{
    "CMV:People who work “Extra hard” at minimum wage jobs create worse standards for themselves by showing they can and will work hard for no extra compensation.\nI work in fast food. For a long time I gave a fuck about what I did, I tried. \nEven when we had call outs, We’re understaffed, ext. I would pick up extra slack to ensure that the company ran good and that my co workers felt happy in the environment we were in. Others would too in the name of the “The team”.\n45 second drive times. Being friend despite the shit storm we were experiencing ext.\n\nSo this all clicked for me when I got stressed out and stepped down as super visor. I spread my view and we as a group let the drive times slow and the customer service scores go down. \n\n\nLOW AND BEHOLD. suddenly people who called into work (Or didn’t show up) were being written up and let go.\nThe appropriate amount of people were being scheduled per shift.\nAnd a load was taken off of all of our backs.\n\nBecause in being “lazy” and working the appropriate work load for what we were doing. It stalled the business and forced them to make changes that would not only accommodate us but speed up the business aswell.\n\n\nEdit: For those of you calling me lazy.\nIt doing what’s expected of you in your job description lazy? \nI still work for this company and am a valued member of the team. I just have limits on how hard I’m willing to stress myself for the demands of the company.\nWhen the company’s own processes have lead to the problems at hand. Not my lack of work ethic.\n\nThey still ask me to take my old position back acting this way. Because Im good with people. But this company isn’t worth my best and their getting what they pay for.\n\nEdit 2: While not a total change in view. Those who are bringing up managements role In changing and guiding these sorts of things are absolutely correct.\nAll the blame can’t fall onto the worker for taking the bad behavior when their the victims in this situation. It’s  more complex than I make it out to be.\n\nEdit 3: Working hard for a promotion is a viable strategy to get promoted if said promotion is deemed worth it. Definitely not every situation is the same and I understand the merit of working hard for something you really want.\n\nI’ve been seeing that “Extra hard” is vague terminology and if you care to read this far ide like it thought of as “More than your job Discription entails”\n\nThis is a really complicated subject I’ve had a lot of fun talking about it with most of you today.\nSo thanks 🙏": [
        {
            "id": "hljw2m2",
            "score": 1,
            "text": "/u/ThyKingToker (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/qz3k96/deltas_awarded_in_cmvpeople_who_work_extra_hard/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.47326",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hlimoj6",
            "score": 12,
            "text": "Your view is myopic. How you behave in your formative years (i.e. late teens, early to late 20s---i.e. the age at which most people find themselves in fast food) will forge habits for the rest of your life. If you want to be a lazy worker while your brain is still developing, you'll condition yourself to be lazy. If you're a hard worker **even when you don't need to be**, that's a valuable skillset that'll stay with you for your entire life. \n\nSource: also worked fast food, and busted my ass while internally seething at lazy employees. \n\nIf you want to be lazy, go ahead and be lazy. But you're shooting yourself in the foot long term for some short term satisfaction.",
            "title_similarity": "0.8336742",
            "sentiment_compound": -0.25
        },
        {
            "id": "hliiqc0",
            "score": 398,
            "text": "Who do you think gets promoted? The laziest/worst employees?",
            "title_similarity": "0.5546162",
            "sentiment_compound": 0.4871
        },
        {
            "id": "hlinta0",
            "score": 19,
            "text": "[removed]",
            "title_similarity": "-0.006644964"
        },
        {
            "id": "hlj2ymq",
            "score": 0,
            "text": "People who work extra hard at a minimum wage job will get noticed and will have the ability to move up much more quickly. If they don’t, their hard work skills should help them find a better job.",
            "title_similarity": "0.6386495",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hlj3d7a",
            "score": 0,
            "text": "Everybody knows that minimum wage workers could be working harder. The hard workers aren't giving that secret away. \n\nThe thing you need to remember is that if you need a law to make your employer pay you as much as they do, your economic value to them is less than that. Usually because you're easily replaceable. You have to work hard enough that you're not worth replacing. \n\nIf you're not working that hard, then either you'll walk away from the job soon because you really don't care about it, or you just want the paycheck and you'll stay until you get let go because you really don't care about the job. \n\nPeople who work harder than that are either looking for a promotion, or they're hard-working people by nature who take pride in everything they do. Usually that kind of person aspires to better than minimum wage jobs, though.",
            "title_similarity": "0.8608606",
            "sentiment_compound": -0.0048
        },
        {
            "id": "hlk9z1n",
            "score": 0,
            "text": "If your work ethic depends on how much you get paid, then it's no wonder things are hard for you.",
            "title_similarity": "0.66788274",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hlkpkkn",
            "score": 0,
            "text": "This way of thinking is why people don’t move up in their place of work.\n\nYou don’t deserve more money if you can’t/won’t work harder.\n\nMy 18 year old brother worked for McDonald’s for just a few months before being promoted to manager. He has since moved on to a better job, but my point remains the same.",
            "title_similarity": "0.7829714",
            "sentiment_compound": 0.431
        },
        {
            "id": "hlmcwhf",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.006644964"
        },
        {
            "id": "hliu2ze",
            "score": 18,
            "text": "Maybe you might have fooled yourself.  Here's why...  You really had a plan. \n\n* You said people who were doing really bad were fired.  \n* But you weren't one of those who got fired.\n\n* You weren't fired because you actually cared enough about the business to take action that ended up changing the business for the better.  \n\nSo in effect, you went above and beyond the call of duty and the business is now better off because of it.  This isn't being lazy.  The lazy got fired.   Hence your view about it and more so, maybe yourself is wrong.",
            "title_similarity": "0.7173815",
            "sentiment_compound": -0.7075
        },
        {
            "id": "hlilx2h",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "-0.006644964"
        },
        {
            "id": "hlip6bb",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.006644964"
        },
        {
            "id": "hlj81eb",
            "score": -1,
            "text": "Working hard like that builds character though. The sort of character which will make you much better positioned to take advantage of any opportunities that you come across.\n\nAs others have said, it also increases you chance of getting promoted etc. But i think the more important angle to look at it from is that in choosing to work hard youre choosing to become the kind of person who doesn't need to rely on promotions, but makes their own luck by getting in the habit of maximising their potential, getting/giving the most from/to situations, and just generally having the kind of disciplined, ambitious attitude that helps people succeed in life regardless of the social situation you find yourself in\n\nIf you don't aspire to be anything more than a minimum wage worker then sure,  do the bare minimum and get your wage. But you pay a huge cost in the quality of your own personal character by taking that route. A cost that has impacts not just on your career and financial life, but in your social, emotional and leisure life too.",
            "title_similarity": "0.5951775",
            "sentiment_compound": 0.9839
        },
        {
            "id": "hljs9zl",
            "score": -1,
            "text": "> For those of you calling me lazy.\n\nI mean - between you not arguing in good faith in this post, your grammar being completely ate up, and you just making edits instead of awarding deltas. Seems like a lazy person to me.",
            "title_similarity": "0.6414236",
            "sentiment_compound": 0.5063
        },
        {
            "id": "hllduc2",
            "score": -1,
            "text": "100% loser mentality.",
            "title_similarity": "0.28135496",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hlmguzj",
            "score": -1,
            "text": "How you do anything is how you do everything.",
            "title_similarity": "0.16679528",
            "sentiment_compound": 0.0
        },
        {
            "id": "hliktcc",
            "score": 39,
            "text": "[removed]",
            "title_similarity": "-0.006644964"
        },
        {
            "id": "hlisyqy",
            "score": 2,
            "text": "The main issue is not that they WANT to work harder, but rather they are so replaceable and, at that pay rate, their finances are at such risk on a monthly if not daily basis, that they cannot afford to lose their job and will do anything to offset any suspicions about their performance. GM's need to make snap judgments sometimes and their employee's futures are really in their hands. An employee must prove there is no reason to suspect their performance when it comes time to revise budgets. Teens dont care so much because they can probably work anywhere and they are never solely responsible for paying to stay alive, their parents will be making mortgage payments. But actual adults who are solely responsible for affording shelter, food, and necessities for themselves and possibly 3 others do not share your comfortable, sneering view that they are driving up standards at diminishing returns. Very sad for you, OP. Try supporting a family in a demeaning job that destroys your health knowing you are fully replaceable and try to write this post again.",
            "title_similarity": "0.8341442",
            "sentiment_compound": -0.9668
        },
        {
            "id": "hljnzp4",
            "score": 2,
            "text": "Minimum wage\n\n*Minimum effort*",
            "title_similarity": "0.26484597",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlisolw",
            "score": 5,
            "text": "Put that extra effort into developing relationships and pleasing the right people instead of taking on additional workload and you’ll be better off.  \n\nYou’ll promote your average worker friend over the hard working impersonal person every time.",
            "title_similarity": "0.7050166",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hlirnov",
            "score": 6,
            "text": "I guess it entirely depends on your life goals. If this is just a stepping stone onto your next career then you can just do the bare minimum. \n\nIf you want to stand out and advance in the company then there’s nothing wrong with putting in the extra effort to be noticed. Good management will take note and promote those who hustle. Bad management- it doesn’t matter what you do.\n\nI put in the effort early on as a bagger/cashier at Safeway then cruised along when I found a new career path. I never felt like I wasted my time putting in the extra effort early on for quick advancement.",
            "title_similarity": "0.7192944",
            "sentiment_compound": -0.0915
        },
        {
            "id": "hlirr74",
            "score": 27,
            "text": "While I don't disagree, I feel like many people who take this position take it to the extreme and use it to do the bare minimum. It also depends on your place of employment. Some bosses will actually reward you for working harder, while others will take advantage.\n\nGenerally, my advice for people is to work slightly harder than normal, and assess if anyone notices/cares, and then make decisions based on what occurs.",
            "title_similarity": "0.78328",
            "sentiment_compound": 0.855
        },
        {
            "id": "hlilg8y",
            "score": 137,
            "text": "I think this will be  contraversial because the truth lies between the true extremes.\n\nTo an extent you are correct. Making it the person with powers problem usually means a oroblem will be solved quicker. Therefore in this situation i think you are correct. Taking the shit and missing breaks/free overtime etc just prolongs it.\n\nIve done similar where me and 2 other colleges refused overtime which caused us to miss deadlines. Lo and behold conditions change and problems we raise earlier are listened to.\n\nThat said not all workplaces are like this. Some companies do care (or at least have good managers) even if they are proactive there will always be a chance of emergencys. Maybe you live close by and there is servre weather that means half of staff cant arrive. Going above and beyond will make you stand out.\n\nThe last point is on promotion. Your not going to promote the person who doesnt show initiative or a drive. Going above helps you stand out and in workplaces that actually value this you'll quickly climb the ranks.\n\nIts alot more company specifc than its made out. For bad companies that just want to bleed workers dry this may be the only option. In better companies you will mark yourself down unnecessarily which will be a determet to you.",
            "title_similarity": "0.8118407",
            "sentiment_compound": 0.9591
        },
        {
            "id": "hlj1ss8",
            "score": 188,
            "text": "You omitted the most important fact in your story by using passive verbs:\n\n> suddenly people who called into work (Or didn’t show up) were being written up and let go. The appropriate amount of people were being scheduled per shift. And a load was taken off of all of our backs.\n\nThe fact is this: There's another actor in this story. It's management. Management, who was understaffing in the first place. Who was loading you with too much work. Management, who was not addressing performance issues that were harming the rest of you.\n\nOverachievers didn't cause this harmful environment. Bad management did. Because with good management, there would be no need or incentive to submit to an abusive schedule.\n\nI was a manager for years at a company that took advantage of its employees like this. I left, and now I'm a management consultant focusing on organizational strategy and humane design. Your problem is not the fault of workers. It is the fault of management.\n\nWhat's more, what you did by \"sharing your view\" and getting the group to change SOP is a microcosm of collective bargaining. You effectively created a tiny union and forced management to change. \n\nSee, you as a laborer can't directly fix the problem. If you had organized the slow down and management hadn't reacted, the problem wouldn't be solved. Someone would need to pick up the slack, or something else would suffer. But you nailed exactly what the real problem was -- understaffing. And the problem was solved by appropriate staffing.",
            "title_similarity": "0.7293007",
            "sentiment_compound": -0.8836
        },
        {
            "id": "hlirbz3",
            "score": 2,
            "text": "sometimes compensation comes in the form of promotions and letters of recommendation over the span of years. it is not always easy to know which of the available actions will result in the best long-term outcomes. it has been my experience that the most reliable employees in small to medium businesses (16 to 1000 employees) are far more likely to receive promotions into management than those who are not. some factors that can throw that off are nepotism (especially in small businesses), yesmen, and conmen (especially in larger buisnesses).\n\nin support of your argument, when it comes to unskilled labor like fast food, being really good means nothing. the best promotion you can get is shift supervisor without a degree and if you have a degree you shouldn't be starting out by flipping burgers anyway.",
            "title_similarity": "0.72667253",
            "sentiment_compound": 0.6507
        },
        {
            "id": "hlisuxt",
            "score": 1,
            "text": "Depends on your employer. If your employer doesn't care about extra work you might be doing then yes, you're wasting your time. If you have an employer who values dedication and hard work he or she might promote you if given the chance.\n\nSaying that \"working hard at minimum wage jobs is a waste of time because of my experience\" is like a woman saying \"all men cheat\" because of a previous experience.",
            "title_similarity": "0.8257684",
            "sentiment_compound": -0.1098
        },
        {
            "id": "hlisx8u",
            "score": 1,
            "text": "This is a common problem in the business world too.  If you pick up other people's slack then the results remain as desired, and nothing changes (except your eventual burnout).  You have to let things go bad when someone else drops the ball if you want to see change.",
            "title_similarity": "0.7255875",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hlit04q",
            "score": 1,
            "text": "Some people work faster than others. If my baseline speed is faster than yours, and you’re slacking because it’s minimum wage then yeah, I might seem like a try hard. \n\nIn reality I’m going at a comfortable speed and I get to not feel like I’m working beneath my abilities. I take pride in my work, even when it’s free.",
            "title_similarity": "0.7230799",
            "sentiment_compound": 0.904
        },
        {
            "id": "hliv76p",
            "score": 1,
            "text": "The relative amount of work and oversight an individual gives their employer is specific to that person and is not a team sport.\nSkill & experience (even in low level  jobs) effects how much work someone can do over a shift; the employer & the employee find this balance & by design this is relative to the individual perspective. In a free country you should quit the job if you \"personally\" don't like the balance. The quit rate is called attrition and should match the current market supply of labor & skill.\n\nLikely a employee seeks to get promoted, or obtain skills via showing they are ethical & hard working. The best way to get a raise is make your self indispensable to your employer.",
            "title_similarity": "0.7721859",
            "sentiment_compound": 0.8747
        },
        {
            "id": "hlivyp5",
            "score": 1,
            "text": "Working hard in and of itself is not going to be beneficial. Once you have established you are a good employee you have to use that leverage. You use that leverage in one or two ways. First way is that your boss is going to notice things run better when you're working and they won't want to lose you. You can then speak to your boss and use that leverage to get increased pay. However imo the second option is better. Your coworkers are going to notice things go smoother when you're on as well. They will have no problem being references on your resume while you look for better positions elsewhere. Your boss will probably love to be a reference as well as usually people want to see people grow. Your work life is kind of like being a hermit crab. If you're feeling stuck or discontent it's because you've outgrown your shell and need to find another one that has room for the growth you want.",
            "title_similarity": "0.72398704",
            "sentiment_compound": 0.9825
        },
        {
            "id": "hlizwqs",
            "score": 3,
            "text": "So what I see here is that you worked hard for a company who didn't care about you working hard, only about profitability. I also see that once you organized and put pressure on the company to care about their employees' well-being, you got better working conditions.\n\nNow, what you said is true, but I would take away from it instead that **being complacent with the system creates worse standards for yourself and others, not working hard per se**.",
            "title_similarity": "0.79882526",
            "sentiment_compound": -0.2311
        },
        {
            "id": "hlj04b2",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.022036"
        },
        {
            "id": "hlj08yc",
            "score": 1,
            "text": "So are you basically arguing \"minimum wage minimum effort?\"",
            "title_similarity": "0.32791406",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hlj0g4c",
            "score": 1,
            "text": "Only if it's unrewarded. There's nothing wrong with showing how much work you can do at minimum wage, but if it's not recognized monetarily in a reasonable amount of time, then you might have a point.",
            "title_similarity": "0.62214726",
            "sentiment_compound": 0.1967
        },
        {
            "id": "hlj1kz5",
            "score": 1,
            "text": "The exception to this rule is if your extra hard work gives you new skills or if you find a new efficiency measure, in which case you would be setting a better standard for everyone. \n\n\nIf this special kind of work is repeatedly not recognised, then you can take those skills to a new job which does recognise those skills.",
            "title_similarity": "0.6102984",
            "sentiment_compound": 0.7978
        },
        {
            "id": "hlj3kvd",
            "score": 9,
            "text": "This is not a direct challenge to your view, bit more a shade of difference:\n\n\"slow downs\" are labor actions, and are in the same category as strikes. Going above and beyond when needed is not a bad thing, but a well placed slow down can force management to pay attention and make changes.\n\nAlways being the \"go-to\" worker or team can result in management taking advantage. It's not great to sacrifice your mental or physical well-being for the good of the company which, at the end of the day, doesn't give a shit about you. However, the way to show that it is above and beyond is to demonstrate what happens when you do the bare minimum, contractually obligated work.",
            "title_similarity": "0.731359",
            "sentiment_compound": 0.7851
        },
        {
            "id": "hlj66ws",
            "score": 1,
            "text": "It’s possible to work hard, care about what you’re doing, but at the same time hold others accountable and not enable them to slack off.",
            "title_similarity": "0.5223193",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hlj6bm5",
            "score": 2,
            "text": ">let the drive times slow and the customer service scores go down. \n\nSome people are incentivized by helping others. They may not be motivated to work hard to earn kudos from mgmt, but rather wanting the consumer to have a good experience. \n\nIf I'm actively watching my checkout lane and signal customers so they don't have to wait, and others are bullshiting and not paying attention, I'm preventing a negative experience for a person. The person not engaged at work is taking advantage of those values to allow me to do more work.\n\nI won't argue that game theory will lead bad mgmt to care more about overall performance than equity in labor division, and worst mgmt to purposefully cut labor to irresponsible levels. But that doesn't mean the hard worker is just being taken advantage of by their boss like a rube.\n\nIn the current market I'd imagine your situation of understaffing and trying to take a stand is common and you're right for safeguarding your health.",
            "title_similarity": "0.7256736",
            "sentiment_compound": 0.5749
        },
        {
            "id": "hlj6sjs",
            "score": 1,
            "text": "This isnt just minimum wage jobs. The corporate world works this way as well",
            "title_similarity": "0.42058343",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hlj84fo",
            "score": 1,
            "text": "Minimum wage, and wage in general, is a racket. But when I've worked in those jobs, I always found I hated it less if I at least pretended it mattered. Mop the floors the cleanest they can get, even if they'll be dirty tomorrow. Make the food just right, just for the pleasure of being good at it. Not for the customer or the employer, for you.\n\nIf you're working extra hard to rise through the ranks of Walmart or Starbucks, you're probably screwing yourself. But if you're working extra hard because this is the job you're stuck with right now and doing something well makes it easier, it's a way to improve your quality of life. It's all about the why.",
            "title_similarity": "0.87115264",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hlj8649",
            "score": 1,
            "text": "Well, what do you define by ‘worse standards’?\n\nSomebody up who works harder than usual for no extra compensation sets a standard for themselves that they won’t half-ass something even if there’s no incentive to do otherwise. That is not a bad standard by any means; most people will tell you it’s a good mentality to always be trying.",
            "title_similarity": "0.7223476",
            "sentiment_compound": 0.5484
        },
        {
            "id": "hlj86te",
            "score": 1,
            "text": "Hard work is usually rewarded with more work. If you're good at your job, which essentially means you make the company money, you are unlikely to progress beyond that role.",
            "title_similarity": "0.6796068",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hlj9gws",
            "score": 1,
            "text": "Off topic, but you my friend, just described socialism, and why it doesn't work.",
            "title_similarity": "0.50680506",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hlja2u4",
            "score": 1,
            "text": "Just true, don't be that mug",
            "title_similarity": "0.0406341",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hljakqc",
            "score": 1,
            "text": "I started off on crew at McDonalds. I only worked hard for the recommendation. A good rec from my manager got me a slightly better job a few months later. Did the same thing at the new job, and the next, eventually after some more job hopping ended up working as a secretary at a law firm, then a personal assistant at the same firm. Now I’m a lawyer with a JD from a top ten law school. So it isn’t totally pointless to work hard at a shit job if you have long term goals in mind. As to the question of “raising standards for coworkers”: if that happened, I’m not sorry about it. I’m going to chase my dreams even if it means other people have to work a little harder than they would otherwise have to. Put another way, I’m not going to let other people’s unwillingness to work hard hold me back from chasing my dreams. Nobody should.",
            "title_similarity": "0.7588402",
            "sentiment_compound": 0.7294
        },
        {
            "id": "hljcien",
            "score": 1,
            "text": "For me its not a question of employer vs the employee.\n\nIts why am i there? Most of these jobs you refer to focus directly on customer goods and services. \n\nI go to work every day to trade value for value to my customers. The employer handles things i hate to do, taxes, accounting, liability, etc, and i take less money then if i did the whole job. What i get from the employer is on me or others and me who have organized. \n\nWhen you see the relationship of the employer like this you know the value you bring and why your there and then negotiate your position. This is similar to shoping for a car or a bank loan. You know what you have to offer and know what they want in exchange. You hold the power of labor and can leverage that to get more or combine with others and organize. Conflict is unavoidable but undervaluing yourself is avoidable. \n\nHard work is part of the value you provide and early on in your life you learn just what your capable of and how to leverage that to get more of what you want and produce what you want either in services to customers or goods. \n\nI hope that helps.",
            "title_similarity": "0.8053416",
            "sentiment_compound": 0.9437
        },
        {
            "id": "hlje801",
            "score": 1,
            "text": "Where I live we have a really high minimum wage, and working harder to get promoted isn’t worth it because the difference in pay is so minuscule until you get really high up the ladder.\n\nBefore minimum wage went up, my hard work got me promoted quickly and it felt worth it. Afterwards we had to keep less people on the clock, which put a greater burden on me, but I was making much closer to minimum wage. \nWhen I stopped working as hard people became resentful of me and I eventually quit. I now make pretty good money working for myself.\n\nI think what you did was smart. If more people thought like you then companies would be forced to compete with each other for better standards and pay, and the government wouldn’t have to step in and impose regulations (which help some people and screw others) as often.\n\nHowever, I think your scenario is very specific and can’t be applied to all situations. In my case working less hard didn’t lead to better standards, it just led to a lot of bad feelings and me deciding once and for all that fast food is one of the worst industries to be in.",
            "title_similarity": "0.8693242",
            "sentiment_compound": 0.4651
        },
        {
            "id": "hljgekw",
            "score": 1,
            "text": "My only argument here, is that people can take real pride in their work. Even if it’s garbage work, to know you did your best might not matter to the boss or customers, but some people can find real satisfaction and purpose in being proud of their work. I agree with you generally, but for some people, having a job and doing their best can be a real life changer",
            "title_similarity": "0.6525028",
            "sentiment_compound": 0.9664
        },
        {
            "id": "hljhn64",
            "score": 1,
            "text": "the reward for hard work is more work",
            "title_similarity": "0.39150304",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hljhvw6",
            "score": 1,
            "text": "I mean, this topic is almost entirely subjective, so this will be difficult to change anyone's view.\n\nI think one of the few perspectives that can change someone's view on this, is \"short term vs long term growth.\"\n\nPutting in the bare minimum doesn't just place you in a certain mindset regarding work ethic, but it also affects your network of people. If you apply to other jobs in the future and those jobs need a reference from your current job, the likely answer will be, \"This worker is on time and meets the bare minimum.\"\n\nIt is incredibly beneficial to you in the long term, to have a network of references and people who can speak to your work ethic, even if that is to your current energy/pay level. \n\nNevertheless, this is still a balancing act. Find how much work is worth a reputable reference/network AND worth the payout you are receiving.\n\nPrinciple: This is entirely up to you, for you, by you. If you can live with doing the bare minimum, then so be it. If you can maintain an excellent work ethic while performing at a bare minimum level in any aspect of your work life, then so be it. \n\nI commend your intuition for wanting to better yourself through a side business. Few people are willing to do that. \n\nI think it's a bit unfair to use your specific experience as a staple for the work ethic of billions of people. However, it's the best example you currently have (or you would have used another example), so we'll go with that. Before I do that, I would advise you look up some research studies done on this topic.\n\nWork ethic is different than results. Despite the results, you put in X% and keep on trucking. It is safe to say that, in the long run, x% effort results in x response. \n\nIf you put in that \"extra hard\" work at a job with bad management, and you realize that your hard work will not be recognized, keep looking for a workplace until you find one that recognizes your hard work. And now, your hard work ethic (that you never gave up) will pay off in incremental dividends. \n\nWith this in mind, it sounds more like you have a strong work ethic AND you working for a company/management that doesn't recognize it AND you are bitter about it. \n\nMaybe consider finding a better opportunity with better management instead of settling for something that will keep you bitter. Time is the most valuable asset in life and you are currently spending 20hrs/week doing something you hate. Why not minimize that and look for a 20hr (or even full-time) role that gives you healthcare, better pay, and better management to work with?\n\n> For those of you calling me lazy. It doing what’s expected of you in your job description lazy? I still work for this company and am a valued member of the team.\n\nAre you, though? By your own definition, you are just another member of the team. Just because the management at your job says you are valued does not mean you are valued if their standards are incredibly low. This just means you're \"valued\" valued at that job, but you're \"mediocre\" at jobs that have higher standards. That is not a good long-term perspective.\n\nYou decide your work ethic. So do right by you and work in a way that you are proud of. Find a job that values you. And MOST OF ALL, you need to provide the results that you claim to deserve.",
            "title_similarity": "0.6868836",
            "sentiment_compound": 0.9958
        },
        {
            "id": "hljj8au",
            "score": 1,
            "text": "The situation you’re describing, is how you can leverage your employment for a raise. \n\n“Hello boss man. See how you had to double the staff recently? I, as the supervisor, believe we can execute a strategy to be more efficient without hiring. In the past, we were able to do xyz, with abc amount of staff. I propose that instead of doubling your payroll. You should just give me a 100% raise, and all the existing employees a 20% raise. This will increase payroll by a total of (some amount less than 100% for argument’s sake 40%) 40%, as opposed to doubling the staff. And we can manage the workload. I believe this will be in everyone’s benefit.”\n\nAnd then you share with him the **extra** work/effort you and your employees need to do to make this work. Then argue that the extra work, requires extra compensation. \n\nAnd you give the prior work history as a proof of concept. \n\nThis is extremely standard.",
            "title_similarity": "0.6748954",
            "sentiment_compound": 0.6361
        },
        {
            "id": "hljklvn",
            "score": 1,
            "text": "Its worth it if they want to get promoted but likely better off investing that energy into learning skills and applying for higher paying jobs.",
            "title_similarity": "0.5396914",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hljl2uc",
            "score": 2,
            "text": "r/antiwork",
            "title_similarity": "0.1257815",
            "sentiment_compound": 0.0
        },
        {
            "id": "hljliii",
            "score": 1,
            "text": "If they offered to pay you for the “extra hard” version of you, what would that look like? And do you think any amount of extra money would be worth the extra effort?\nIs there a high staff turn over because you believe people are getting under paid therefore the only ones who stay are those who “under work”\n\nmost companies wouldn’t look at their employees and think paying them more is the answer to more efficiency. They would burn out pretty quick and probably shut the branch down.\n\nI think a worker who can and does work “extra hard” regardless of pay or reward will go a lot farther and reap the benefits later in life when they find a company that will pay them for what they are worth. They just have to make that move and not stick around in fast food.",
            "title_similarity": "0.84321153",
            "sentiment_compound": 0.9408
        },
        {
            "id": "hljopal",
            "score": 1,
            "text": "I managed restaurants, including QSR, for 30 years.\nIf I can run a shift on five people to standards when suggested scheduling is seven people I'll do it. There's less people to manage, this leads to less drama and less bullshit. I always wrote up and weeded out under performers, I usually weeded out \"won't\" workers (those capable of doing the kob well but won't) before the lesser skilled (within reason) that cared. \nThe thing was come review time I could go to my DM/market president and justify better raises for the people who did the job well and cared. Basically \"I can run the lunch rush with 7 people at 8 bucks an hour or 5 people at 9 or even 10 bucks an hour), I still hit my numbers and no one up above complains about how you cut labor cost so long as nothing else suffers.",
            "title_similarity": "0.75112176",
            "sentiment_compound": 0.7956
        },
        {
            "id": "hljqir3",
            "score": 1,
            "text": "And slackers who don't put any effort in make employers think that people in these positions are overpaid. \n\nThe trick is not to do too little nor too much.",
            "title_similarity": "0.69406766",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hljqvpd",
            "score": 1,
            "text": "Work performance should be assigned an appropriate level of importance by you as an employee. Its important but there are things, like your mental and physical health and happiness that are more important. \n\nThe more people that can find this balance, the better off we’ll all be.",
            "title_similarity": "0.6230196",
            "sentiment_compound": 0.95
        },
        {
            "id": "hljryim",
            "score": 1,
            "text": "\"you get what you pay for\". If the employer pays min wage, that could be the level of effort/production they pay. I hear you on that. But I think some of this comes down to the individual and their work ethic. It's their life and their choice for how little or much they want to work. \n\n&#x200B;\n\nIf a company had to downsize and they are deciding between different people who to cut, working harder might favor that person keeping their job. That aspect can't be ignored. Same goes for possible raises and promotions.",
            "title_similarity": "0.7588959",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hljsdqh",
            "score": 2,
            "text": "$15 an hour is a C- wage. Don’t give more than a C- effort.",
            "title_similarity": "0.4748215",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlju5wi",
            "score": 1,
            "text": "You load 16 tons of #9 coal and the straw boss says well bless my soul",
            "title_similarity": "0.49960694",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hljuexl",
            "score": 1,
            "text": "I wouldn’t say this 100% true. Here’s my argument\n\n1. It depends on the culture of the business. Fast food is an industry where there’s high turn over and you’re easily replaced. Even as a low level manager or supervisor. So working hard in that situation I’d agree. But there are some businesses where working hard as a minimum wage worker will get you to higher positions.\n\n2. Working smarter is better than working harder.  In every job I’ve worked, I worked hard for the first 2 weeks to learn the whole job and some other peoples as well. From that I was able to more productive than other people while also working less. \n\n3. Working hard separates you from your coworkers and in customer service jobs that can be helpful. When I had a minimum wage job with zero chance of a raise I worked really hard to help customers and went above and beyond doing things that weren’t in my job description. Eventually a regular customer came to me and complemented my work ethic and offered me a job making 7$ more per hr\n\nSo if you simply look at (pay per hour/work) then  I’ll agree with you but more than likely someone who’s a hard worker at a minimum wage job is probably a hard worker at other areas im their life and will have more opportunities",
            "title_similarity": "0.8874333",
            "sentiment_compound": 0.9726
        },
        {
            "id": "hljuu5a",
            "score": 1,
            "text": "Showing that you are a hard worker is exactly how you stop making minimum wage at most places. If this company doesn't appreciate you in terms of compensation, leave and find another company. Honestly though, your situation sounds too unique to generalize about.  It's not about minimum wage in your case, it's about being understaffed. You can't \"sprint\" for an entire 8-hour shift day in and day out. You can crunch during the rush...or operate understaffed for a little while, but nobody can sprint for 8 hours a day and if that's what it was taking to prop the place up, then you all have every right to feel burned out. (If you want an analogy, not even marathon runners can sprint the whole time) Poor management burnt you out, and they should know better. On the hottest of hot takes though, doing what's right for you isn't something you need to justify to me or anyone else here.",
            "title_similarity": "0.8245437",
            "sentiment_compound": -0.0974
        },
        {
            "id": "hljxh7u",
            "score": 1,
            "text": "This is a story about bad management not work ethic. A good manager would have done the things that resulted from your actions BECAUSE they would know the end result would be to lose good workers. Bad managers don’t hold people accountable and don’t reward good employees.",
            "title_similarity": "0.69348174",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hlk0tcn",
            "score": 2,
            "text": "Were you not working extra hard to earn a promotion and move into management?",
            "title_similarity": "0.5828389",
            "sentiment_compound": 0.0762
        },
        {
            "id": "hlk1cfi",
            "score": 1,
            "text": "For me it's about building character.",
            "title_similarity": "0.11791979",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlk5zx1",
            "score": 10,
            "text": "**My post is pretty long. So if you skim through it, at least read around the bolded parts.**\n\nYou stated that minimum wage workers who work extra hard often don't benefit. You also stated that you were making 27% more money for 3 times the work - and you found it wasn't worth it. Therefore, it's clear your argument applies to both minimum wage workers and low wage workers.\n\nYou also stated that you either have employees, or you plan on having employees. Since you're stepping down from a supervisor position at a fast food restaurant, I'm going to go out on a limb and guess that you won't be able to pay your employees a substantial salary. But I'm also going to assume you aren't going to pay them minimum wage either.\n\nQuick question: Which employees are you going to give raises to and promote? The ones who only do what they are told, or the employees who go above and beyond?\n\nThese questions are rhetorical. I just want to establish that you do believe extra effort can result in better, worthwhile, compensation. If you plan on promoting your own employees based on how hard they work, you will have to accept that hard work is important for upward mobility.\n\nBut your argument is not that \"extra hard\" work doesn't help employees in general, but that it doesn't help minimum wage workers. This is where I disagree.\n\nu/ThyKingToker, **I propose that you are misattributing the problem to minimum wage jobs when the problem is something else.**\n\nIt's true, working extra hard can create situations where people are expected to do more without proper compensation. However, this problem can exist *regardless* of wages. Even a person who makes 50k per year, much higher than minimum wage, can be put in a position where they work harder, create tighter deadlines for themselves, and gain nothing out of it.\n\nSo why the emphasis on minimum/low wage workers?\n\nAs you stated, you were only being paid 27% more for what was the equivalent of 3 jobs. Others have discussed being promoted to positions where they barely made any more money per hour while taking on far more taxing responsibilities.\n\nIt boils down to three problems:\n\n1. Mismanagement of resources.\n2. Lack of opportunities for promotion.\n3. Lack of compensation for promoted employees.\n\n**The above three issues are not bound by how much employees are paid and can happen at any level of employment.** However, I think it is fair to speculate that these issues are more common with low wage jobs for reasons I won't delve into. But since not all minimum wage jobs will have this problem, it's wrong to suggest all minimum wage workers should avoid working hard.\n\nYou stated that minimum wage workers create worse standards when they work \"extra hard\", and I believe that *can* be true. However, *I do not believe that is necessarily true*. Not all fast food restaurants are run the same - even when comparing two different locations for the same company. For example, a Taco Bell at one location may  improperly manage their employees, but that doesn't mean every Taco Bell mismanages their employees.\n\nIn other words, it is wrong for us to say \"minimum wage employees shouldn't put in extra effort\". **Whether or not they put in extra effort should be determined by other factors, NOT their wage.**\n\n**Employees should work hard if the following criteria is met:**\n\n1. There are promotion opportunities.\n2. Promoted employees are well compensated.\n3. Promoted employees are properly managed so that their responsibilities match their level of compensation\n4. If the hard work isn't creating unfeasible deadlines.\n\nToo many people assume, \"If I work harder, they'll expect me to do more without properly compensating me, therefore I won't work harder - not on minimum wage.\" But minimum wage workers don't always have that problem! Instead of assuming the problem is going to happen, employees need to recognize when the problem is happening instead.\n\n**If the criteria I listed isn't met, then employees may still benefit from working hard as a means of finding other opportunities.** For example, it's more advantageous to have worked as a  supervisor of a fast food restaurant than a cashier or cook. Working towards that promotion can be used to increase the likelihood of being hired for better positions elsewhere. Even if an employee isn't promoted, it's still beneficial to have employers who will put in a good word for them. But if an employee has no chance of being promoted and they know nobody at the company will put in a good word for them no matter how hard they work, then the extra effort won't generally pay off.\n\n**TL;DR: You argued that minimum wage workers shouldn't put in extra effort because it will create stricter deadlines and they won't be properly compensated. I disagree, that's not always true. Sometimes, minimum wage workers don't create stricter deadlines by working harder, and they end up getting promoted and properly compensated instead. Instead of basing how hard one works based on how much they're paid, it's better to base how hard you work on promotional opportunities and compensation.**",
            "title_similarity": "0.8544568",
            "sentiment_compound": 0.9809
        },
        {
            "id": "hlk8s5e",
            "score": 1,
            "text": "Makes sense but as workers become lazy and product quality and efficiency drops it causes down line effects. Like having to hire more workers which causes prices to go up or wages to go down. Or it causes less sales resulting in a business bleeding money resulting in laying off of workers or reducing hours and wages. But I understand that workers don’t think this way. It’s all about them and how much you aren’t paying them their self deduced worth.",
            "title_similarity": "0.79159504",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hlkbcce",
            "score": 1,
            "text": "People that work hard are often those promoted from within to a position whereby they can change the culture. They make the situation better for themselves by climbing up the ladder and hopefully will remember what it was like and change it.",
            "title_similarity": "0.55205286",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hlkdpak",
            "score": 2,
            "text": "I am a hard worker that goes above and beyond and I agree with you 100%. Took me like 15 years to see it, but I have mentally and physically paid the price while doing the work of two people and making less than a lot of others because companies take advantage.",
            "title_similarity": "0.73289657",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hlke8q5",
            "score": 1,
            "text": "I'm a manager at a noodles & company and we have one of the best stores in our state and that's because me and my team constantly make sure everything's full everything's clean etc. We never stop moving. If I lose perspective and start feeling like getting lazy I remember that there's paramedics and nurses and EMTs working out there for the low minimum wage saving our fucking lives while being treated like shit. I remember that someone has to make the world go round. Also the harder you work the more exercise you get imo.",
            "title_similarity": "0.8302713",
            "sentiment_compound": 0.6896
        },
        {
            "id": "hlkiwzy",
            "score": 1,
            "text": "Honestly, the most egregious \"being lazy\" part of your post is the fact that you seem to be implying that you're not whining at upper/middle management enough to get issues fixed.  Management only has a few feedback pipelines that are useful, and one of them is you, as a supervisor/valued-employee.  If you're not advocating for fixes and just letting them slide and working around them, you're in no small part helping to create them.",
            "title_similarity": "0.69360733",
            "sentiment_compound": 0.7098
        },
        {
            "id": "hlkk0i2",
            "score": 1,
            "text": "Heck. That’s at any job. Working harder than you have to only benefits the man",
            "title_similarity": "0.6928518",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hlklqz5",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.022036"
        },
        {
            "id": "hlkn34z",
            "score": 1,
            "text": "You seem to be assuming that they have any real alternative.  It's not like most minimum wage jobs have a strong union.",
            "title_similarity": "0.5634746",
            "sentiment_compound": 0.2937
        },
        {
            "id": "hlko3f1",
            "score": 1,
            "text": "It's a double edged sword. You might have like you're saying, where they continue to run with the bare minimum, or they'll see that you're a go getter and you go above and beyond for the job.     \nOr at least that's the narrative anyway. In my case with my night job, it was a male dominated field and I was faceplanting the glass ceiling until 4 of the 5 managers quit within 3 weeks. I had spent years training for manager position while being repeatedly told there wasn't room for more, at the same time as watching my (much less motivated) male coworkers get promoted over me.    \nSorry, I kinda went way off topic but TLDR:you might get promoted or you might get shafted lol",
            "title_similarity": "0.7697607",
            "sentiment_compound": 0.8946
        },
        {
            "id": "hlkvepu",
            "score": 1,
            "text": "This is a boundary that many people have been conditioned to not see. Considering that an employer must pay you fairly for your effort according to the wage hasn't been an option for so long that people are uncomfortable with the cognitive dissonance it brings.",
            "title_similarity": "0.783501",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hlkvxh7",
            "score": 1,
            "text": "You're not hurting yourself nor your position by working hard, even if it's for a bad company and poor management. Just make sure you aren't sacrificing your long-term health and that you're working your muscles and not your bones/tendons.",
            "title_similarity": "0.6170955",
            "sentiment_compound": -0.5334
        },
        {
            "id": "hll3t7g",
            "score": 1,
            "text": "This is not unique to lower-wage jobs. Profitability and productivity are at an all time high and wages have stagnated for decades. Drawing a line at how hard you're willing to work is completely reasonable. \n\nYou're looking at centuries of labor exploitation in the name of the \"free market\" through the lens of your own job. This is a good thing, because it's adding personal context to a universal problem. \n\nNOW, to your point: There will be moments in your job when you care about going the extra mile. Whether it's to cover someone's shift when their spouse is having a baby or to go out of your way to help a customer who was super chill. Those are great things. You'll get recognized for those. Stick with those moments and your efforts won't feel disproportional to the amount of value/reward you're getting.",
            "title_similarity": "0.81670195",
            "sentiment_compound": 0.959
        },
        {
            "id": "hll4fkd",
            "score": 1,
            "text": "Always do your best, not matter the job.  You may not be compensated or rewarded fairly in your present capacity, but you can take the skills that you gain with you anywhere.  If you give less than your best effort you're hurting yourself more than your employer.",
            "title_similarity": "0.69884056",
            "sentiment_compound": 0.9025
        },
        {
            "id": "hll69mz",
            "score": 1,
            "text": "I agree. I’m a mechanical engineer, and I always have to mention how hard the people working inside fast food restaurants are working. They have to stay focused for almost the whole shift and are almost constantly moving. I think people sell themselves short. \n\nI also believe it’s about what you prioritize in life. If your priorities are getting a lot of money so you can show off to your friends, then you probably won’t get anywhere. If you find your passion however, and devote your life to it, you’ll likely be successful and the money will come. This is more true for people who start at an earlier age.",
            "title_similarity": "0.8684977",
            "sentiment_compound": 0.9589
        },
        {
            "id": "hll8kms",
            "score": 1,
            "text": "Sorry world. \n\nI’m the asshole in this equation. A boyfriend once said I was so efficient I was making him look bad. Plus I’m a massive people pleaser who has lots of energy. This is all on me.",
            "title_similarity": "0.7304464",
            "sentiment_compound": 0.5598
        },
        {
            "id": "hll8zal",
            "score": 4,
            "text": "So, it was a while ago now at this point (\\~15 years, holy shit does time fly), but I was one of those people that worked way too hard in a minimum wage job.\n\nHere's the thing: I think you're wrong. But it's not for a moral or philosophical reason ... I don't think you're lazy, or there's anything wrong (morally) with your approach. It's just that you have the market dynamics wrong.\n\nThe thing is, we aren't in a monopsonistic environment -- that is, we don't work in a labor market in which there's only one employer. Proceeding in your career with Evil Fuckers Incorporated (tm) isn't a waste of time ... not because EFI will reward you, but because *your experience has value elsewhere.*\n\nIf you find that you've spent lots of time and lots of effort getting into a leadership position at Evil R Us and they don't really compensate you for all those extra skills you've gained ... you can still apply at Normal Sane People, Inc, who will offer you a (to you) *huge* increase in compensation to come work for them.\n\nAt the end of the day, as long as there are multiple companies to work for, working hard to learn new skills is a good thing -- it produces new, marketable skills.",
            "title_similarity": "0.78524566",
            "sentiment_compound": -0.8354
        },
        {
            "id": "hlla718",
            "score": 1,
            "text": "I'm going to take a risk and try a completely different angle here, and do my best articulating it.\n\nWhen you work exactly the amount you are compensated for, you create an \"equilibrium\", in which all's well in the short term. However, this also means things are more likely to stay the same way in the long term.\n\nWhen you create an \"imbalance\", you make room for change. So, for example if you work less than the amount of compensation, obviously you risk losing your job. On the other hand, if you work more than compensated, you open up possibilities for a change. You might get a straight up payrise or overtime pay. You may develop a work ethic to get a lot of things done, giving you energy and inspiration to take on side jobs, like what you've done, or learn new things. You may be considered for a promotion because you may be demonstrating behaviours that they look for in a supervisor or branch manager role. You may be noticed favourably by your peers and management, that they may keep you in mind when they progress in their careers. These are less likely to happen if you always only work exactly to your job description.",
            "title_similarity": "0.7116178",
            "sentiment_compound": 0.9618
        },
        {
            "id": "hllkqvr",
            "score": 1,
            "text": "Work ethics are work ethics and one should always put out the same effort no matter what the compensation is.",
            "title_similarity": "0.432544",
            "sentiment_compound": -0.0191
        },
        {
            "id": "hlll3lj",
            "score": 1,
            "text": "You are damn right.  Minimum wage = minimum effort. Casual employment means not to be taken seriously.",
            "title_similarity": "0.57313675",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hllu3dy",
            "score": 2,
            "text": "Your story is the essence of capitalism, with a little swirl of socialism thrown in. Your employer tried to wring every ounce of performance out of you and your co-workers, maximising results whilst minimising expense. You in turn pushed back and **as a collective**, chose to work at a level which reflected your reward for the role, forcing the employer to add more staff.\n\nI like your style, well done.\n\nYour approach would have been less effective if you had one or more colleagues willing to increase their effort and pick up the slack without being paid more.\n\nThis is why unions and collective bargaining are a good thing.",
            "title_similarity": "0.7957173",
            "sentiment_compound": 0.939
        },
        {
            "id": "hllxfku",
            "score": 2,
            "text": "R/antiwork",
            "title_similarity": "0.1257815",
            "sentiment_compound": 0.0
        },
        {
            "id": "hllxgxu",
            "score": 2,
            "text": "This subs' full of boot lickers",
            "title_similarity": "0.261942",
            "sentiment_compound": 0.0
        },
        {
            "id": "hllxhes",
            "score": 2,
            "text": "I mean I get what you're trying to say. Right now in the US labor isn't paid for nearly enough, but there is really no excuse for doing a shitty job. You should have enough pride to know your work reflects on you. I understand feeling like you don't need to go the extra mile, but anyone that says \"since I get paid minimum wage I do the minimum required of me\" is just a shithead with a spoiled brat's attitude. \n\nOne thing I think you really misunderstand though is, you're viewing it through the lense of \"how hard you work\" . It's not, and has never been about how hard you work. I've been fired from jobs where I worked really hard and kept jobs I hardly worked hard at all on. It's about HOW GOOD YOU ARE AT YOUR JOB. Most bosses don't care how hard you're working, they care about your ability to do a job.\n\n  I'm 32 so I'm not an old man, but worked at enough big companies and seen hundreds of employees come and go. The overwhelming majority of people that were fired simply just sucked at thei job. And the significant majority of promotions went to people who did their job well and efficiently. \n\nIf you don't care about how good you are at your job you'll never ever get promoted, it's as simple as that.just like in relationships If you are only concerned about cost/benefit of the job you'll very likely lose that job since you're already in a really bad place if you have to do the math.",
            "title_similarity": "0.8170432",
            "sentiment_compound": -0.9636
        },
        {
            "id": "hllyj09",
            "score": 1,
            "text": "Look minimum wage requires minimum effort, no one in that tiem in there life deserves to be burnt out on a pointless hustle. With that being said, there will be a time in your life where you should hussle. Where the outcome pays out. That is all around education and a high level job. Even trades need education. And goimg to school even in trades with get you ahead. And once you're there, hustling to be at the top of the game is next because even if the job let's you go that experience in your field carries on.",
            "title_similarity": "0.7833974",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hllymbe",
            "score": 1,
            "text": "I take pride in my work ethic.  My actions, and my attitude is something that I can control.  If everyone else is the laziest person on the planet, and I don't have the power to change it, guess what power I do have?  To not succumb to the very thing I cannot stand, laziness.  I will not be a lazy coworker who doesn't pull their weight.  I can quit or I can continue to do the job I signed up for, that I'm being paid for, to the best of my ability.  If everyone stooped to that standard, imagine what kind of world we would be living in.  YOU chose your place of employment, YOU agreed to the terms, and YOU can quit at any time.  This attitude only affects your direct coworkers, and it does absolutely nothing to change the standards or pay.",
            "title_similarity": "0.7324855",
            "sentiment_compound": 0.7912
        },
        {
            "id": "hlm08wb",
            "score": 1,
            "text": "\"Extra hard\" is relative. Say you have a sample team of three wherein the members have work outputs of 3, 7 and 10. If all the 10s of the world drop their output to 5, you now essentially have a scale of 1-7. The 7 is now considered the extra hard worker by comparison and would ultimately need to reduce output. Hence a race to the bottom. Long term this would result in poor production, efficiency and output for the community. At a company level, it may mean closing up shop.",
            "title_similarity": "0.74094415",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hlm3x4j",
            "score": 1,
            "text": "What creates lower wages and standards is low skilled immigration and lack of unions.",
            "title_similarity": "0.5564786",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hlm4q2y",
            "score": 1,
            "text": "you are on the wrong track.\n\n&#x200B;\n\nif you dont work hard and display the correct attitude you will never get anywhere.\n\n&#x200B;\n\nthere are people who can do any job and there are people you constantly need to monitor to do anything.\n\n&#x200B;\n\ndont be the second category, nobody will want to hire you for anything really ...",
            "title_similarity": "0.67133135",
            "sentiment_compound": -0.362
        },
        {
            "id": "hlm7m1g",
            "score": 3,
            "text": "My boss turned up at work with a new Lamborghini. I went up to him to tell him what a nice care he had and he replied with some brilliant advice:\n\n\"Work hard, tow the line, keep your head down, keep putting up those good numbers and you never know, maybe next year I'll be able to afford another\"",
            "title_similarity": "0.67814916",
            "sentiment_compound": 0.9062
        },
        {
            "id": "hlmaskx",
            "score": 2,
            "text": "100% agree -",
            "title_similarity": "0.06907699",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hlmaum5",
            "score": 2,
            "text": "sounds slavery to me",
            "title_similarity": "0.26997054",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hlmhed7",
            "score": 1,
            "text": "I would say most people who work extra hard do so mainly for themselves.\nGetting up every day to do shit you do not enjoy is bad enough, but also feeling like you don’t even have an impact and nothing you do matters is way worse.\n\nGoing the extra mile, helping a coworker out, picking up the slack - that all has real meaning to real people.\n\nYes this can be abused by management, but to most people it’s worth it I guess.",
            "title_similarity": "0.85475194",
            "sentiment_compound": 0.249
        },
        {
            "id": "hlmk6zc",
            "score": 2,
            "text": "Minimum wage? Minimum effort",
            "title_similarity": "0.23262726",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlmmw04",
            "score": 2,
            "text": "I think your verbiage really had a lot of people misunderstand what you're saying. I like to think I'm in a pretty similar situation right now to what you're saying, since COVID we've never had the same amount of people working and because of that a lot of the people who work here for part-time hours have been getting full time with no benefits or pay the difference to show for it. Me and what I would consider some of the harder working people ended up being promoted to lower management and since then it's pretty clear the standards for the theater as a whole have been significantly dropped, since taking on my management role I've been hassling them for them to take an active role in hiring people (as opposed to just leaving our in-house career application up) and for them to increase the wage to compete with local businesses (we are the only minimum wage job surrounded by on avg 17-20 dollar jobs). Only now during our labor shortage and lack of morale does upper management decide they need to propose a wage increase to corporate and give bonuses out, and yeah I was the guy who covered shifts all the time and got my work done on time or earlier and ended up saving hours and money for the company, but now I realize even in lower management that working harder for the minimal amount of pay increases and privileges is rediculous. I put in my bare minimum and only work better for the people around me if it helps them out, I don't care for the job or corporate who screws us at every opportunity and the people in this thread saying otherwise are either clueless and misunderstood your point or are literally just coping with their realization they are wasting their time at their dead-end jobs just as we did. I think the only point you miss is that the effort of workers is irrelevant most of the time in the labor market because minimum wage workers are usually easily replaceable if you suck at your job and they deem you lazy even in cases similar to yours or mine they can just write you up and boot you and replace you with some bright-eyed young new person that will work just as hard as we did for another three months.",
            "title_similarity": "0.8076577",
            "sentiment_compound": -0.2584
        },
        {
            "id": "hlonnjq",
            "score": 2,
            "text": "Had a COWORKER not manager, ask me if I was on break when she saw me on my phone for a second. I said no and then she tried to command me to go do something. We shop for other peoples groceries to get them delivered. We had no orders. Some people are literally brainwashed to think they have to work every second for the man. It truly is holding us all back",
            "title_similarity": "0.7729613",
            "sentiment_compound": -0.128
        },
        {
            "id": "hlpqemj",
            "score": 2,
            "text": "It’s amazing how many people on here side with corporations over employees when push comes to shove. It’s like they have NO IDEA how most corporations take advantage of the lowest workers every day \n\nIt’s this weird just world fallacy that “if you work hard you will be rewarded!”",
            "title_similarity": "0.83022773",
            "sentiment_compound": 0.2611
        },
        {
            "id": "hlrrhlr",
            "score": 1,
            "text": "I own a restaurant. I don’t pay minimum wage, but I will start a dishwasher out at $12/hr. They will quickly get a raise if they show they are reliable and work at a steady pace (no need to be a “hard worker”, just keep the dishes moving). Mine now make $15/hr. However, I have been burned too many times by people getting their paychecks and then not showing up (drugs), people sitting back there on their phones, people taking excessive smoke breaks, people who show up late all the time, etc. I am not a helicopter manager who is constantly riding someone. The job is pretty easy and self-explanatory. I’ve got my good guys now (who make $4-$5/hr more than standard rate for my area), but I’ve had to write a lot of paychecks to crappy workers who couldn’t hold a job for a couple weeks even though in the interview the expectations are laid out with the fact that we do give raises rather quickly. I used to start at $15, but got burned on that too many times. Advertising at $12 vs $15 brings the same candidates through the door.",
            "title_similarity": "0.83684206",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hluesio",
            "score": 1,
            "text": "Every job is literally like this.  Not just low minimum wage jobs that have to deal with this sort of environment at work.  It’s like telling your boss about a loose flooring that someone might trip on.  You can keep telling your boss over and over and nothing will change. But the moment someone trips and falls and there’s a serious injury, all of a sudden the floor will get fixed.  \n\nThis is just how I’ve learned a lot of people operate in the United States. Most people aren’t proactive and they don’t give a damn about anything until it starts to affect them or become serious enough.",
            "title_similarity": "0.8154068",
            "sentiment_compound": 0.227
        },
        {
            "id": "hmab3ta",
            "score": 1,
            "text": ">Working hard for a promotion is a viable strategy to get promoted if said promotion is deemed worth it.\n\nDon't work hard just for a promotion with your current company. I too had similar feelings as you with multiple jobs, and was never promoted there. However people I work with went on to better jobs, and knowing how hard I worked, they reached out and gave me better opportunities.",
            "title_similarity": "0.769966",
            "sentiment_compound": 0.8646
        },
        {
            "id": "hmov5p1",
            "score": 2,
            "text": "This is absolutely true",
            "title_similarity": "-0.094175436",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hmpffte",
            "score": 1,
            "text": "\"CMV:People who work “Extra hard”\n\n... typically succeed.",
            "title_similarity": "0.48891053",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hndfwp9",
            "score": 1,
            "text": "I'm calling cap I busted ass in warehousing & as soon as raises & promotions opened up I was one of the 1st to be approached through guys who did bare minimum weren't even given the maximum raise amount for keeping their position it's not even about being good at tasks it's literally just about mentality",
            "title_similarity": "0.72771883",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hojon4a",
            "score": 1,
            "text": "With the current job market, doing extra they aren’t paying for gets you job security. And possibly job stasis, but at least it isn’t a negative slope. Also, if it’s work that needs doing and no one else is doing it, you’re dodging the negative splash back hitting yourself or others. It isn’t making worse standards for yourself, it’s taking negative consequences onto yourself for others to be useful. You’ve decided it’s not worth it, which you can absolutely choose to do, and you’re seeing what happens when you stop taking those negatives onto yourself before they hit your coworkers or place of employment.",
            "title_similarity": "0.6983868",
            "sentiment_compound": -0.9749
        },
        {
            "id": "hp4iivd",
            "score": 1,
            "text": "I totally get this. I can actually verify, but not here so i dont expose myself, that i do 5 to 10 times the work of most other staff at my work.  I still get shit for not working hard enough some days when we have staff that no word of a lie stand around and do nothing for months at a time.",
            "title_similarity": "0.7813062",
            "sentiment_compound": -0.7347
        }
    ]
}