{
    "CMV: Any opposition to the Covid vaccine is almost entirely political, and not at all based on science and medicine\nI hold this view because EVERY source I've seen that casts doubt on the safety or efficacy of the Covid vaccine goes right back to right-wing politics. They're political sources, they're published on political websites, they're bloggers who also post right-wing political view. \n\nAny non-political source I've found is clearly in support of vaccines. \n\nI want my view changed because I do try to look at both sides of an issue. I do want all the information about a topic, especially in regards to mine and my family's health and safety. And if nothing else, I want to be able to respect the views of friends and family who feel otherwise. I would love for it to simply be a difference of opinion that's intelligently based in reality.\n\nEdit- i would add that any irrational, non-credible reason would be included with political, even though I only specified political. Whether it's fear, conspiracy, or anything along those lines\n\nEdit 2- ok I've spent way too much time on this. I'm getting a lot of the same uncited talking points I've seen over and over again, and I'm noticing more and more conspiracy theorists jumping in. I will try to continue to read replies, but I won't comment unless it's awfully compelling.": [
        {
            "id": "hlsszxx",
            "score": 1,
            "text": "/u/waterbuffalo750 (OP) has awarded 3 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/r0k169/deltas_awarded_in_cmv_any_opposition_to_the_covid/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.50540495",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hlsq0rs",
            "score": 129,
            "text": "So, I guess only question is, if someone watched their mother die because of a negative reaction to the vaccine, or their brother who's a guitarist lose all fine motor control in his hands and as such loses his career. Is this person just a right wing extremist because they are now worried about getting the vaccine? Yes, these things have happened. The vaccine has unknown side effects, and even more unknown future side effects. \n\nAccording to studies from the manufacturers themselves, getting COVID and getting over it, leaves you with a better immune response a second time then if you were to just have the vaccine. Are you saying that someone, faced with this information, and decides the risk of the vaccine is not worth it, it's just thinking politically. \n\nThere is a famous phrase now attributed to far left wing thinking, \"The Personal is Political.\" Meaning everything you do can be wrapped up with a political label. From your post it would appear you may also accidentally live by this motto. But remember most people don't think at all about politics or news media, but what is going to most benefit them, and those around them. \n\nAnd as to why I think you believe that all vaccine hesitations stem from the right? Because no one you watch on the left will question 'science' they agree with, that I believe you probably agree with. But with oppose any 'science' that doesn't immediately fit into their world view, again not trying to criticize you. While the politically right will listen to all science, and give platforms to people they both agree and disagree with, something that you almost never see left wing media doing. So the reason that it all comes from the right? Because the left media won't even consider opinions that contradict their own. And will try and discredit it immediately rather then platform it to try debate or learn from it.",
            "title_similarity": "0.7202032",
            "sentiment_compound": -0.4064
        },
        {
            "id": "hlsvlwd",
            "score": 12,
            "text": "Probably will get destroyed for this but oh-well. The \"vaccine\" doesn't inoculate you, it reduces your symptoms if you get covid. It is technically not even a vaccine but rather a gene therapy, thus the reason every single person has been approved for boosters; because it wears off over time. The covid \"vaccine\" is closer to a seasonal flu shot than a vaccine. With that being said, I agree with you and thus won't try to change your mind. My closely held opinion is that it's all tied to big-pharma and our bought politics, but that is another CMV entirely. Why else would people who have gotten and survived covid need to be vaccinated? They are already more immune to it than a newly vaccinated person.",
            "title_similarity": "0.7750763",
            "sentiment_compound": 0.879
        },
        {
            "id": "hltdy6m",
            "score": 8,
            "text": "Opposition to vaccines is socially irresponsible. Vaccines have been proven to save countless lives. Everyone should get the covid vaccine ASAP!\n\nHowever, there is an argument against vaccines, that is based in science:\n\nVaccines, and modern medicine in general, circumvent natural evolution of immunity. Over generations, our bodies would develop a natural immunity to the disease due to small variations in our genome. Countless people would die unnecessarily, but perhaps it is better for the human race to have that immunity develop naturally.\n\nDisclaimer: I disagree with this, however it is an intriguing argument.",
            "title_similarity": "0.8024087",
            "sentiment_compound": -0.5635
        },
        {
            "id": "hlsq36h",
            "score": -3,
            "text": "Do you have every vaccine ever created? If you do good for you. If you don’t, is it because of political reasons?",
            "title_similarity": "0.7207428",
            "sentiment_compound": 0.644
        },
        {
            "id": "hlskyhr",
            "score": 3,
            "text": "Do you consider the American Heart Association to be devoid of scientific and medical imput, and entirely politically right wing?",
            "title_similarity": "0.6723574",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hlsoqk2",
            "score": 5,
            "text": "Maybe left leaning people are just more complient in generalas history has shown",
            "title_similarity": "0.38238174",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlt544e",
            "score": 0,
            "text": "Go hang out on R/conspiracy and they seem to have some resources. I haven’t personally looked at any of them because I don’t care and have gotten vaccinated. But I am interested to see where this all stems from. Like what’s actually in the vaccine that may be causing issues for some people and does/why it changes dna",
            "title_similarity": "0.81913126",
            "sentiment_compound": 0.836
        },
        {
            "id": "hlsupn4",
            "score": 1,
            "text": "I'm a healthy 40 year old who, statistically speaking, has nothing to fear from getting sick. Nothing political about it.",
            "title_similarity": "0.41886342",
            "sentiment_compound": 0.2565
        },
        {
            "id": "hltf4lz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07080051"
        },
        {
            "id": "hlt1viv",
            "score": 15,
            "text": "I’m surprised nobody has touched on this, but there exists a valid opposition to the vaccine using medicine and science. The accelerated timeline, while explained by the massive influx of funding, has raised some eyebrows by people that I know that used to work in scientific research. They tell stories of corruption and data being manipulated even on FDA approved vaccines created on the longer and typical timeframes that follow the standard FDA requirements.  Most of the scientific and reasonable qualms about the vaccine are regarding the expedited approval process and the adverse reactions(alleged under reporting/ misinformation).  Robert Malone, one of the people credited with advancing the invention of mRNA technology is against the vaccine being used in individuals not at risk for those reasons. The scientific data has small sample sizes over a short term time frame, and i could see how people would use some of the numbers shown  disprove the vaccine and it’s effects despite some of the bad ratios can be attributed to the small sample sizes. However if using the data as a justification to not get vaccinated, wouldn’t the fear be based off of scientific data no matter how misguided it may be?",
            "title_similarity": "0.8222256",
            "sentiment_compound": -0.5408
        },
        {
            "id": "hlt4rug",
            "score": 4,
            "text": "3 oppositions to the Covid vaccine that is not political and more anecdotal:\n\n1. Anecdotal. my friend knows two individuals who can no longer use their legs anymore as a result of how their body reacted to the vaccine. \n2. Not enough supporting research. A lot of people feel that the technology used to make the mRNA vaccines are very new and created in a very short period of time. Therefore the vaccines have not been thoroughly researched. \n3. the \"natural\" argument. Some people are just against vaccines in general because they see it as \"impure\" or \"unnatural\". They have a preference for natural things, and think that things that did not original from a natural source will ultimately harm them in some way.",
            "title_similarity": "0.71866196",
            "sentiment_compound": 0.1016
        },
        {
            "id": "hlslp3e",
            "score": 246,
            "text": "in a nutshell, i'd suggest that what you call, \"non-political\" is \"political\" to someone else and what you call, \"political\" is \"non-political\" to them. \n\ni don't think its a problem of politics, but one of trust. \n\nfor you, you have: \n\n1. a mechanism that you trust for selecting trustable content\n2. a mechanism that you trust for labeling something as \"political\"\n3. the subsequent content (and source) that is now labeled \"trusted\"\n4. the subsequent content (and source) that is now labeled as \"non-trusted\"\n\neveryone does this, but the outcomes are different.  this is why we get echo-chambers.",
            "title_similarity": "0.59776205",
            "sentiment_compound": 0.9723
        },
        {
            "id": "hlslvs6",
            "score": -1,
            "text": "If I though the vaccine were worth it, I wouldn't be putting my health, job, and living situation at risk just to avoid being seen as someone who wants the vaccine. This is especially the case since I'd be with the majority of people. I'm more at risk of ostracization by not getting the vaccine than I would be if I were to get it. Assuming I thought the vaccine were worth it, I can't think of any benefit I would gain by not getting it.",
            "title_similarity": "0.706465",
            "sentiment_compound": 0.5456
        },
        {
            "id": "hltpszb",
            "score": 0,
            "text": "If you contract COVID and \"survive\" (survive is in quotations because the COVID mortality rate in the U.S. 1.6%) your body will develop natural immunity which is significantly more effective than vaccine therapies. Based on your antibody levels (which can be measured with something like an AditxtScore) receiving a COVID vaccine would be an unnecessary medical procedure.",
            "title_similarity": "0.6979017",
            "sentiment_compound": 0.8122
        },
        {
            "id": "hlt2usg",
            "score": 54,
            "text": "For me it's the documented adverse reactions on vaers , yellow card and the CDC . Also the doctors who have warned these could cause ADE . The whistleblower who said Pfizer cut corners on the trials , doctor Robert Malone , the study from Japan showing the mRNA travels from the injection site and deposits itself into bone marrow the uterus and various other organs in mice. The fact that there's no long term data and all the phases of trials aren't complete like other medications .  The fact that some of these vaccines still don't have the ingredients available and if you do get an adverse reaction which seems to be a roll of the dice you can't sue for damages . \n\nThe fact that Pfizer has been fined multiple times for being dishonest about side affects or hid that information they have also been fined multiple times for bribing medical officials and politicians . The fact that most major new organizations and Facebook are heavily sponsored by pharma companies . The researchers who have come forward stating moderna brushed aside concerns for safety and demanded results that were favourable . \n\nThe fact that the highest vaccinated places on the planet are still seeing large surges in covid cases . Vaccinated have the same viral load as non vaccinated.\n\nAnd finally why would I trust government and corporations that have allowed dramatic increases of the costs of life saving drugs like insulin and cancer meds simply for more profit . Why do they all of a sudden care so deeply for everyone's safety but only if the countries can afford it . In North America were on boosters while poorer countries haven't even gotten their first doses , it's not about ending the pandemic it's about shareholder profits .",
            "title_similarity": "0.70679665",
            "sentiment_compound": -0.0319
        },
        {
            "id": "hlt996p",
            "score": 7,
            "text": "It looks like you are looking for \"source\" i.e. mouthpieces that give voice to the anti-vax sentiment. If you are looking for specific data-points that would push against the covid vaccine, there are many, which I am sure you are aware of. If you are looking for just an average Joe who chose not to get vaccinated, I am sure you know there are many people that would never take any medicine unless absolutely necessary. So, I understood your view to really be \"there aren't any prominent non-political voices that are anti-vax\".\n\nAnd, the answer is that there has been a helava concerted effort in common culture, media, politics, and business to silence any anti-vax voice. Most people that are very prominent, even if they don't buy into the pro-vax message, probably don't want to die on that hill in the press.  And less prominent voice will be quickly de-platformed or pigeon holed as right-wing or conspiracy or a scam artist, etc. Look at what happened on reddit. Look at all the many doctors (a distinct minority, no doubt, but my point is the climate is making this a 'hill to die on' type of choice) around the world that have been burned for questioning the mainstream or even suggesting alternative approaches (like Ivermectin treatment). Now, you can argue that because their science is not mainstream it is by definition wrong or you can argue with their specific medical (or non-medical as it may be) angle, but there are certainly players that are distinctly not political. And, I think those voices are being dramatically silenced.",
            "title_similarity": "0.83681345",
            "sentiment_compound": -0.8448
        },
        {
            "id": "hlsmtgb",
            "score": 2,
            "text": "You can have conservative or liberal views without being political. People in rural areas tend to be more conservative not because they vote red by birth but because they are socially and culturally different than people who live in big cities. \nMost people choose to not get vaccines not because the Left told them to get them but because they are actually worried they might get a .01% medical complication from the vaccine or about potential future health consequences of it.",
            "title_similarity": "0.7176723",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hlt9v84",
            "score": 4,
            "text": "Ok - I can jump in on this… I read the « study » Pfizer submitted for approval for the vaccine for 5-11 year olds… here i can cite my source \n\nhttps://www.fda.gov/media/153447/download\n\nAll politics aside, this ‘study’ would be impossible to reproduce. It also goes against the American standards for testing drugs on a sample of the population they are intended for (the non placebo group bad 80% white).\n\nSo to sum up what is actually in the document :\n1) only ~1500 kids were given the vaccine\n2) the recipe had Been modified (so we can’t accept any argument of ‘billions of doses’ have been given - no only these 1500\n3) both placebo and non placebo groups had covid positive cases during the trial\n4) using their own numbers the vaccine only showed a 2.2% efficacy rate at 1 month (no later data provided)\n5) the safety follow-up was less than 2 months \n6) one of their scenarii actually showed the risk of the vaccine outweighed it’s benefit\n7) their risk/benefit analysis was based on data for worldwide infections and hospitalisations for people aged 20+ not for the age group targeted (5-11)\n8) myocarditis was a major risk mentioned by Pfizer - but again compared to a covert of 20+ worldwide (not other young children)\n9) the comparison cohort for this study was a group of people aged 16-25 (not 5-11)\n10) phase 2 & 3 trials were being run simultaneously \n\nThis type of poor ‘study’ raises doubts. If the FDA is allowing use on a large scale for a drug with such a poorly conducted, inconclusive, biased study - this leads to scepticisme. \n\nVoilà - just facts - from Pfizer - published on a government website.",
            "title_similarity": "0.73841965",
            "sentiment_compound": -0.7047
        },
        {
            "id": "hlslke9",
            "score": 141,
            "text": ">Covid vaccine is almost entirely political, and not at all based on science and medicine\n\nVaccine hesitancy isn't new. The pandemic only exposed how big of a problem it is and not only in US. Many countries have some version of vaccine concern regardless of the political climate.\n\nSo the thing is that vaccination concern is scientific. There are plenty of regulatory organizations and scientists whose job is to find any and all problems with vaccines. It's just not done by the public. The vaccine deniers merely use that as evidence to support their vaccination refusal.\n\nTake the reports of unusually high recurrence of myocarditis in the recent Johnson vaccines (I believe). Which are to our best knowledge true and correct. And they indeed raise legitimate health concerns with these vaccines. What that actually means tho, is that doctors might take these reports into account and recommend a different type of vaccine for a patient with a weaker heart, or increase the waiting period for the patient in the vaccination center, or whatnot.\n\nIt does not mean that suddenly the vaccine is unsafe. Vaccine deniers will use that study or report and say that vaccine damages your heart, and therefore not vaccinating is the rational option. The problem with this is that you can get a lot of useful idiots on the anti-vax train if you show them these scientific and absolutely rational reports that raise concerns with specific vaccines.",
            "title_similarity": "0.8974656",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hlsyhmw",
            "score": 19,
            "text": "There are very valid criticisms of the \"narrative\" around the vaccine and especially the mandate. For example the fact that vaccinated people when infected hold an equal amount of viral load as unvaxed and are just as likely to spread the virus - if not moreso under the false belief that you are safe from spreading.",
            "title_similarity": "0.75538015",
            "sentiment_compound": -0.3566
        },
        {
            "id": "hlt13gv",
            "score": 3,
            "text": "I think there are actually a lot of people who don't necessarily think it's \"bad\". They just don't want it. The risk of having a bad outcome with Covid when you're young and healthy has been proven to be extremely low.  The data backs that up and it's undeniable at this point. There's nothing political about it.",
            "title_similarity": "0.53623927",
            "sentiment_compound": -0.8487
        },
        {
            "id": "hltdu2u",
            "score": 3,
            "text": "Natural immunity. \n\nhttps://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1\n\n\"Results SARS-CoV-2-naïve vaccinees had a 13.06-fold (95% CI, 8.08 to 21.11) increased risk for breakthrough infection with the Delta variant compared to those previously infected\"",
            "title_similarity": "0.5567665",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hlthbrj",
            "score": 3,
            "text": "I'm against mandates, for obvious reasons like, I abhor authoritarianism. And I'll never get the vaccine out of pure spite for the political elitist class. I dont care who made it, who mandates it, who recommends it. Seeing how nuts covid and the \"vaccine\" made our ruling class, and especially ruling classes of other countries, put a bad taste in my mouth.",
            "title_similarity": "0.80645126",
            "sentiment_compound": -0.8867
        },
        {
            "id": "hltyjvx",
            "score": 3,
            "text": "I guess today is my last day on CMV. I can feel the ban coming. \n\nChill about covid.\n\n\n1. It's only so feared because anyone who died **with** covid was [counted as dying **from** covid](https://www.cdc.gov/nchs/data/nvss/coronavirus/Alert-1-Guidance-for-Certifying-COVID-19-Deaths.pdf). Depending on your age you are most likely [perfectly safe from it.](https://datavisualizations.heritage.org/public-health/covid-19-deaths-by-age/)\n\n\n2. The things we did like lockdowns and essential workers were far more dangerous than covid. [Suicides](https://www.rcpsych.ac.uk/news-and-features/latest-news/detail/2021/04/08/country-in-the-grip-of-a-mental-health-crisis-with-children-worst-affected-new-analysis-finds), [domestic abuse](https://endlockdowns.org/domestic-abuse/), [missed health testing and appointments](https://healthcareexecintelligence.healthitanalytics.com/features/preventive-care-takes-pandemic-hit-results-in-missed-diagnoses), [addiction](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8085389/)... we will be dealing with the fallout for years. Hard to believe people who care about none of this when they say their actions are because they care about others.\n\n\n3. The [main test they use is not accurate](https://pubmed.ncbi.nlm.nih.gov/32219885/), its [own creator admits this](https://off-guardian.org/2020/10/05/pcr-inventor-it-doesnt-tell-you-that-you-are-sick/),  often and [easily giving false positives.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2095096/)\n\n\n4. **The vaccines [haven't even been properly tested](https://clinicaltrials.gov/ct2/show/NCT04368728?term=NCT04368728&draw=2&rank=1), and already show a steady decline in effectiveness according to Swedish studies, and which [Lord Fauci even admits](https://news.yahoo.com/dr-fauci-just-issued-urgent-201846228.html), all with serious risks like [heart inflammation](https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/myocarditis.html) and [general worsening of heart conditions](https://www.thecardiologyadvisor.com/home/topics/acs/acute-coronary-syndrome-acs-biomarkers-mrna-covid19-vaccine/)\nand [blood clots](https://www.sciencenews.org/article/coronavirus-covid-vaccine-antibodies-cause-blood-clots-side-effect) among other concerns such as [sloppy data, untrustworthy companies, a lack of liability, and professional censorship](https://childrenshealthdefense.org/defender/vaccine-hesitancy-medical-paradigms/). In fact, the [higher the vaccination rate the more excess morality](https://www.skirsch.com/covid/GermanAnalysis.pdf). BTW they want 55 years to release the information that led to approval of the vaccines. Imagine a polio vaccine that didn't last, came out in 1 year, and didn't keep you from catching, spreading, and possibly even still dying of polio, but had a risk of worsening your life as well, and data wouldn't be shared about its approval for 5 decades. It's further possible the way the shot has been treated violates the [Nuremberg Code.](http://www.cirp.org/library/ethics/nuremberg/)**\n\n\n5. Masks have [decades](https://www.nejm.org/doi/full/10.1056/NEJMp2006372) of [science](https://highlanderjuan.com/wp-content/uploads/2020/08/John-Hardie-Why-Face-Masks-Dont-Work.pdf) saying they [don't work](https://bmjopen.bmj.com/content/5/4/e006577), that they might even be [dangerous](https://reader.elsevier.com/reader/sd/pii/S0306987720333028?token=CA2D257365088986674729946B1B0F706BE29B970DF6287CFAA088671A50345E60090B2D6369EC96264E7808AC021246&originRegion=us-east-1&originCreation=20211105205556), and that they let illnesses spread anyways. It's for a much different reason you only see staff wearing them at things like the Met Gala, Obama's party, or the Oscars, and not the elite. \n\n\n6. There are so many other deadly things we do daily and dangerous situations we find ourselves in, so many more illnesses than just covid. Simply [driving your car](https://www.nichd.nih.gov/health/topics/driving/conditioninfo/risk-factors)\nto the market or crossing a street risks death each and every time you do it, but you still do it. Risk of death is part of life, it can't be eliminated. So many people [get hurt in bathrooms](https://abcnews.go.com/Health/cdc-report-shows-bathroom-related-injuries-thousands-visits/story?id=13802036), but people don't shun them. So many people [choke on their food](https://www.verywellhealth.com/all-about-choking-1191873), but people don't prefer feeding tubes. ",
            "title_similarity": "0.66216433",
            "sentiment_compound": -0.9906
        },
        {
            "id": "hlsqdkc",
            "score": 1,
            "text": "https://www.ahajournals.org/doi/abs/10.1161/circ.144.suppl_1.10712\n\nThis could be something to look at along with some of the FDA panel comments",
            "title_similarity": "0.46594816",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlst0vc",
            "score": 1,
            "text": "How are we defining opposition to the vaccine here? Are we saying anyone who doesn’t want the vaccine opposes the vaccine? Or are we talking about the people who think it’s microchipped?",
            "title_similarity": "0.7637249",
            "sentiment_compound": 0.212
        },
        {
            "id": "hlt4mlm",
            "score": 1,
            "text": "I am 19 and in school with not a lot of time recently. I do not rly follow news and honestly don’t rly feel like I know shit about the vaccine as all of my information has come from sources I don’t feel like I can trust (seeing headlines around the internet or hearing second hand from friends/family). It may have been “politics” that caused a stir about the vaccine in the first place, but regardless since the vaccine became a thing I have heard things that legitimately concern me\n\nI’m also aware that the people may have proven the vaccine to be safe, but honestly I’ve had covid a little over a year ago and it wasn’t to bad, and Ik multiple people who got covid some time after getting the vaccine anyway. From my perspective, it doesn’t rly seem necessary even if it is just a tiny lil risk\n\nIdk if it does but I hope this gets my point across, I am personally actually skeptical about getting the covid vaccine. I can promise u guys I have no political agenda (and to be honest can not understand how some people let this be about politics) it makes me a little frustrated knowing people rly will make a lot of assumptions based on one issue like this (which I could rant about forever)\n\nIk I’m kinda ignorant for not educating myself and have gotten a lot of shot (quite possibly in all fairness) because I could be endangering some of the more at risk demographics but everytime someone tries to explain how to me it just sounds like they don’t fully get it either and just feels like they were scared of being called ignorant. I’m sure there’s some of y’all out there who actually have done the reading, plz drop links if u feel like it I’ll probably read, \n\nbut yeah there’s my shpeil, not everybody has politics in their top priorities, I would say politics influences almost none of my decisions andyeah I’m a lil scared to get the vaccine",
            "title_similarity": "0.7796551",
            "sentiment_compound": 0.8386
        },
        {
            "id": "hlt6f82",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.09164293"
        },
        {
            "id": "hlt9xaq",
            "score": 1,
            "text": "Every step of this \"vaccines\" history has been against science, period. I'll give examples of the issues step by step. Firstly, the definition of \"vaccine\" was changed in the last year. Before now, this type of experimentation existed but did not fall into the definition of vaccines. So did the requirments for something to be a vaccine change or did various people standing to make a ton of money from this change, push for this change? This plays into the next part. \n\nSecondly, credibility: How is credibility of efficacy determined? Well by each individual, but certainly not by the institutions that give out the information. Rather by the agreed upon process and oversight. There is not a government organization that has more formal scientific credibility than a scientific organization. In fact, it is well known within scientific organizations that government entities and individual entities that are reliant on the government are much more likely to let politics guide their decisions than any scientific reasoning. Previously, there has been a standard for the amount of time a medicine of any kind has to be tested in order to be considered safe. I'm sure that you know that the standard has been set years in advance of any normal deadline for this medicine. Any study done on the efficacy so far has been reliant on a time standard that is not actually standard and is not reliable. The reliability previously being determined by that standard. So are they credible? I don't get to decide what is credible to you but as a studier of science, this isn't very credible to me. Standards are strict for a reason agreed upon for a reason. If the standard is relaxed, it is tainted. In this case, they have been tainted by politics for possible monetary gains.\n\nThis pretty much sums it up but there is much more. There are a ton of previously widely considered credible (less now by individuals choosing government entities as apposed to non government ones) entities that are continuously studying the long term effects and finding fault. Of course these aren't heavily publicized because channels like msnbc, CNN, and others are *heavily* sponsored by Pfizer and moderna. Fox is not any better, but they certainly are not any worse. I prefer no news network because they are for profit companies who's profit is made from the viewer (product) for their advertisers/sponsors (customers.) There are a ton of people within the scientific communities split on this issue and it is *all* political. Not one side or the other. All of it. Data is objective, your opinion of the data is subjective. Science is not absolute. People percieve the information subjectively and come up with an \"effective\" or \"ineffective\" conclusion. \n\nCurrently there is not enough evidence because of the lax time constraint to make the claim that it is effectively safe or not. We know that it is effective against the original sars-cov2 strain. We also know that against the delta variant, it loses effectiveness heavily within 6 months and constant booster shots are necessary. What we do not know is the long term effect on the immune system by this experimental medicine that was not considered a vaccine until political pressure willed it to be a vaccine. There are a lot of studies being done right now with some reporting data that suggests that perhaps the vaccine does not have as much efficacy as previously thought. There are even people studying the long term immune response and there are some scary questions being asked by credible people within their fields of study that we can't answer yet. One of these being \"is this experimental vaccine forcing an evolutionary change in immune systems that will eventually create a total reliance on the medicine to keep individuals from getting sick, and eventually even that going away? Of course Google and other platforms very openly suppress this kind of information (for political and personal reasons) in order to curb vaccine hesitancy.\n\nIn the end with the whole picture in mind, both sides of this debate generally have a solid foundation for their beliefs. However they are both largely political in nature.",
            "title_similarity": "0.7699684",
            "sentiment_compound": 0.997
        },
        {
            "id": "hltjlgr",
            "score": 1,
            "text": "I would add - pushing the COVID vaccine as the ONLY means by which people can continue to use goods and services of society, is also largely political",
            "title_similarity": "0.7871392",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltjqzd",
            "score": 1,
            "text": "You're right. It's based on rights and ethics. Coercion is a violation of the Nuremberg Code.",
            "title_similarity": "0.5324793",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hltn35y",
            "score": 1,
            "text": "I’m liberal and vaccinated and against the mandate because I don’t think the vaccine is effective enough to warrant it. It’s pretty clear that the effects wear off in 3-6 months and people can still spread Covid, especially the variant, even if they’re vaccinated.\n\nEdit: I’d also argue that the extreme pro-vaccine stance is, in many cases, out of spite politically against conservative folks who are against it.",
            "title_similarity": "0.7990619",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hltouo8",
            "score": 1,
            "text": "😂😂😂 \"I don't like these responses, they are all conspiracy theories!\"\n\nNice debate.",
            "title_similarity": "0.6280874",
            "sentiment_compound": 0.7416
        },
        {
            "id": "hlsr4ux",
            "score": 17,
            "text": "My question is what happened to all of the liberal Portland Oregon vaccines-cause-autism anti-vaxers?  They have been absolutely silent through all of this.  The idea that anti-vax stance is a right wing stance only is wrong.  There are anti-vaxers on both sides of the isle, but the right wing folks have been more outspoken through this.  Very strange.",
            "title_similarity": "0.8012558",
            "sentiment_compound": -0.5704
        },
        {
            "id": "hltgrcj",
            "score": 116,
            "text": "https://www.google.com/amp/s/amp.theguardian.com/world/2021/sep/10/boys-more-at-risk-from-pfizer-jab-side-effect-than-covid-suggests-study\n\nHere’s a source of a recent study showing that teenage boys age 12-15 have a four to six times higher chance of developing heart problems from the vaccine than their chance of being hospitalized with Covid. Seeing as how that age groups chances of dying from Covid are even smaller, do you think it makes sense for this age group to get the vaccine when it’s risk is more common?",
            "title_similarity": "0.573333",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hlt2bbg",
            "score": 5,
            "text": "How about religion? My grandmother is unfortunately a Christian Scientist and therefore doesn’t believe in medicine or doctors. My Mom almost died when she was 4 for this reason (thankfully my grandpa just took her to the hospital).\n\nAnyway, my Grandmother is right-wing, but the main reason she doesn’t want to get the vaccine is because of her religion. I’ve argued with her countless times, and she was actually just exposed to covid the other day, but still no dice.\n\nNot saying I agree with her logic by any means, but there can be opposition fueled by other sources",
            "title_similarity": "0.7201783",
            "sentiment_compound": -0.8647
        },
        {
            "id": "hltie2z",
            "score": 4,
            "text": "Why do I need a vaccine for a virus that has an extremely low death rate for my age group?\n\n4,460 covid related deaths in the 18-29 age group out of 8,348,390 cases of covid-19. \n\nIf you include the 1-17 age group along with 18-29, it would be 5065 deaths out of 14,245,006 cases of covid 19.\n\nLow death rate has nothing to do with politics. I don't care if I get covid. \n\n\nhttps://www.statista.com/statistics/1254271/us-total-number-of-covid-cases-by-age-group/\n\nhttps://www.cdc.gov/nchs/nvss/vsrr/covid_weekly/index.htm",
            "title_similarity": "0.6913155",
            "sentiment_compound": -0.9349
        },
        {
            "id": "hlstz3s",
            "score": 69,
            "text": "In my experience most anti vaxxers are more against the principle of forced vaccinations. The conspiracy theorists actually sure that the vaccine is dangerous are a tiny minority. I know several people who say they don't believe it's actually dangerous to take it but they just won't let people tell them what to inject into their bodies.   \n\n\nSo yeah it's an idealogical stance based on values about freedom and being able to decide whether you want to put something into your body.   \n\n\nDon't see anything wrong with that generally.",
            "title_similarity": "0.8080189",
            "sentiment_compound": 0.9097
        },
        {
            "id": "hlt704p",
            "score": 3,
            "text": "There is an increased rate of myocarditis in young males due to the vaccine. \n\n Sweden is stopping all Medina vaccines for males under 30 due to myocarditis and other health problems.",
            "title_similarity": "0.62301683",
            "sentiment_compound": -0.296
        },
        {
            "id": "hltaixm",
            "score": 2,
            "text": "Why are we shutting down the world for a virus that you have less than a 1% chance of dying from?  Also im not taking the vaccine if I don’t need it to stay alive ive survived covid lets move on woth our lives.  And the fda has only approved the vaccine for emergency use which means they are still testing it and dont know the side effects yet making us the guinea pigs.",
            "title_similarity": "0.79951006",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hltawyu",
            "score": 3,
            "text": "The largest study conducted of the vaccine was done in israel and consisted of a million people showed the vaccine didnt decrease your chances of catching or spreading the virus.",
            "title_similarity": "0.54434097",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hltk2xi",
            "score": 2,
            "text": "How I see it is that the hesitancy towards the vaccine was the fact that it was developed rather quickly and didn’t have extensive long term testing. I’m not anti vax but these are the concerns I’ve heard. Also pregnant women don’t know the affect it will have towards having children. These are things we still don’t know if there will be long term affects. It’s just too soon to know. And then the second part of it is the mandates. People don’t like being forced to take something when they have the concerns that I just listed above. So the vaccine hesitancy is kind of compounded by the mandates forcing people to take it. And then you also have the people who think it’s illegal. I’m vaxxed. Wasn’t against the vax. But I dont like that people aren’t allowed to go into a restaurant without in my city without a vax. That part bothers me.",
            "title_similarity": "0.7215462",
            "sentiment_compound": -0.9221
        },
        {
            "id": "hlt2ej9",
            "score": 20,
            "text": "> because EVERY source I've seen that casts doubt on the safety or efficacy of the Covid vaccine goes right back to right-wing politics\n\n[Pfizer fabricated data in its vaccine clinical trial.](https://www.bmj.com/content/375/bmj.n2635)\n\nThis simple fact should instantly cast a huge shadow of doubt on the efficacy of the (Pfizer) vaccine. If it's so effective, why did Pfizer feel the need to make up data?",
            "title_similarity": "0.8911797",
            "sentiment_compound": 0.6238
        },
        {
            "id": "hlspzex",
            "score": 10,
            "text": "Can you clarify what would change your view on this? \n\nI'm inclined to present you with an explanation of what would be going in the mind of someone who is opposed to the mandate. But from the post you've made and the previous responses, it seems like this isn't what you are looking for. Seems that you would only change your view if you yourself could be convinced that mandates are bad/unwarranted.\n\nAre you looking to better understand the moral, ethical and medical concerns of those who oppose the mandates to understand that those aren't necessarily affiliated with a political party? Or are you looking to see evidence that, in fact, there is a scientific \"reason\" not to have vaccines/mandates?",
            "title_similarity": "0.72221005",
            "sentiment_compound": 0.9647
        },
        {
            "id": "hltkyd7",
            "score": 3,
            "text": "I'm not political, I just want more data and the banning/blocking/shaming of previously highly respected scientists makes me highly distrustful of the mainstream media.  Pfizer asking the FDA to wait for 55 years to share data pertinent to the vaccine is not confidence inspiring. \n\nThe most liberal person I know is also the most Anti-Vax and has been taking Ivermectin for months...\n\nTo me, it is just common sense to wait until real data is actually tracked and provided instead of a lot of experts telling you what to believe.\n\nDoing 1000 before and after the vax MRIs in a double blind study would tell us a lot about what kind of damage/internal scarring may or may not be happening that could cause problems in the future, even when the recipient has no current symptoms.",
            "title_similarity": "0.80371535",
            "sentiment_compound": -0.8456
        },
        {
            "id": "hlsw7g2",
            "score": 7,
            "text": "I think there’s going to be a natural skepticism of new vaccines\n\nI’ve seen people who before covid would themselves mock anti-vaxxers now be like “I’m not gonna get the vaccine unless I absolutely have to”. My own aunt is vaxxed up the wazoo for basically everything but she really doesn’t want to take the covid vaccine because she thinks it’s rushed and doesn’t know if there will be long term effects. \n\nPeople take things like the TB shot for granted because it’s been around for our whole lives. I think even if it’s foolish, it’s natural for some people who are pro-vax say *of this specific vaccine* “no thanks, I’ll wait”.",
            "title_similarity": "0.8008029",
            "sentiment_compound": 0.9036
        },
        {
            "id": "hlsqi64",
            "score": 192,
            "text": "From what I've seen, the main rational argument against getting the COVID vaccine is that this is the first mRNA based vaccine administered to the population at large. While the science behind the vaccine is strong, and research has been done on mRNA vaccines for over 30 years, there is no information on potential long-term effects of these vaccines on the human population. For that reason, getting the vaccine inherently risks suffering complications.",
            "title_similarity": "0.74286115",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hltlwhv",
            "score": 13,
            "text": "[deleted]",
            "title_similarity": "0.09164293"
        },
        {
            "id": "hlsmxcb",
            "score": 3,
            "text": "Unfortunately there will always be people that go against their health & wellbeing along those of other people during times of crisis such as Covid-19 for whatever reason - it could political, science, medicine, narcissism, humor, ennui, etc reasons; there's always going to be people going against what's good for them.",
            "title_similarity": "0.6768559",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hlt8pnb",
            "score": 5,
            "text": "Considering there is opposition to the vaccine all over the world indicates that at least some people are against it for reasons outside of political party influence, especially US political party influence. Are you talking about opposition around the world, or solely within the US?",
            "title_similarity": "0.7655317",
            "sentiment_compound": 0.6872
        },
        {
            "id": "hltcdqx",
            "score": 4,
            "text": "Why can't it be apolitical and not based on science?\n\nI think the vast majority of people who haven't gotten the vaccine don't think of covid as a big enough risk to warrant going and getting it. They can acknowledge that the vaccine is safe and effective yet still not get it. That doesn't strike me as political, but just a different risk assessment.\n\nAlso please remember that this seems to be the only area of bodily autonomy where people are required to give their explanations. If it's body modification or sexual choice, society readily accepts that no means no. Perhaps it will be easier to just accept that it's their body, their choice, and you don't need to understand why, just respect their choice without cajoling them into doing things with their bodies that make them uncomfortable.",
            "title_similarity": "0.7625978",
            "sentiment_compound": 0.8987
        },
        {
            "id": "hltdoeg",
            "score": 0,
            "text": "I do know one person who understands the efficacy of the vaccine but doesn't want to get it mostly because he's irrationally afraid and justifies that by claiming his main opposition is he hates feeling all this pressure to get it and doesn't want to be forced. Ultimately he's just afraid, and he's not even remotely right wing. He's had a hard life with a lot of traumatic experiences and doesn't trust people very easily if at all.\n\nI think ultimately he will end up getting it but he's been wrestling with it for a long time. He was hoping it would all just blow over and he wouldn't have to get it before the pandemic ended due to everyone else getting it. I'm still working on convincing him to come with me and get his first dose when I get my booster. But no he's not a right wing dipshit, just irrationally afraid, has trust issues, and doesn't appreciate being pressured into it. On a human level I can understand his reluctance but ultimately I think he should just fucking man up and get it done.",
            "title_similarity": "0.68054575",
            "sentiment_compound": -0.9728
        },
        {
            "id": "hltf5pz",
            "score": 5,
            "text": "It’s not about vaccine effectiveness.\n\nI’m a 23 year old healthy male with literally zero health problems and have already had Covid with zero issues. \n\nI’m sure the vaccines are very effective but I don’t feel the need to get it. \n\nNow if you want to talk about children that’s a different story. I don’t believe kids 12 and under should be getting the vaccine. Maybe even 18 and under. Not large enough data for children and children have less than a 1% chance of dying from Covid.\n\nTL;DR The vaccines are probably very effective but so is my body at fighting off Covid so I don’t feel the need to get it.",
            "title_similarity": "0.62713945",
            "sentiment_compound": 0.7984
        },
        {
            "id": "hltihq3",
            "score": 0,
            "text": "So my mom recently had to go to a hospital and there were nurses and doctors protesting outside about vaccination requirements for employees. \n\nI’m still convinced my mom is confused and these were right-wing protesters with white jackets,stethoscopes and signs..\n\nBut like you, I want both sides. \n\nLet’s say these really were medical staff. That’s interesting because it’s not necessarily a political drive. Obviously medical staff know the risk of not receiving the vaccine.. \n\nThe only valid (non-political) reason I can understand is that we can’t prove the long term effects. For someone who is truly medically educated they know that we don’t know…just like thousands of other drugs, only time will tell… as someone who supports the vaccine I can understand this concern. \n\nI also tend to notice people have a hard time discerning the difference between this vaccine and say MMR or a flu shot. \nNot all vaccines are the same or have the same objective. \n\nMost boosters have the heard effect -protects the individual , as well as the public. The flu shot prevents the individual from getting that particular strain (possibly protects the public) The covid vaccine is purely to protect YOUR reaction to covid, it won’t otherwise protect the public. \n\nJust an observation I’ve had. Many are clearly confused on this.",
            "title_similarity": "0.78496736",
            "sentiment_compound": 0.9717
        },
        {
            "id": "hltj7ij",
            "score": 0,
            "text": "I think there's an honest scientific discussion about whether it's a good idea to vaccinate young children. We're beginning to understand that the current vaccines don't do a great deal to stop the spread of COVID-19. They do an excellent job at preventing people from getting seriously ill but given that children fair better with COVID-19 than they do with diseases like the flu, this isn't really something we should be worried about for most children, anyway. However, we do know the risk of adverse events with the vaccines (namely myocarditis) is highest amongst young males. Given that the Pfizer trial for children 5-11yo was less than 10k kids and that the rate of myocarditis is roughly 1:10-15k in adolescents, I think its fair to wonder whether it makes sense to vaccinate a child with a vaccine that has known risks and doesn't do very much in curbing community transmission against a disease that is basically innocuous for them.",
            "title_similarity": "0.66152096",
            "sentiment_compound": -0.0892
        },
        {
            "id": "hltob8h",
            "score": 0,
            "text": "Currently living in Latvia, spent some time in Netherlands during COVID, and as I see the right-wing association with COVID vaccine opposition is an American thing where every issue somehow becomes political team-sports. In countries I lived I would say there was a bias towards right-wing to make more drama and conspiracy theories, but it was far from a partisan issue. Most of the people I knew which were anti-waxxers were more left-wing, however that might simply be a sampling bias, because most of all people I tend to spend time with usually are younger and more left-wing. \n\nFrom what I have noticed, I would rather believe that people who are more paranoid or deep into naturalistic fallacies tend to be against vaccines. Plenty of which are represented among the right and left wing spectrum. I think the association with one political side is not a problem of inherently what that side is, but rather the result of 2 party system, which is far from taken for granted in much of the other world. Sooner or later any controversial issue in the US seems to become a right-left drama, and I can understand how that creates a worldview that that's how things just are, but that is the mind opening thing when you live in different countries for some time, and come to realize that the reality which you always take for granted in one place, is nowhere close to being a thing elsewhere.",
            "title_similarity": "0.7603477",
            "sentiment_compound": 0.7018
        },
        {
            "id": "hltow6f",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.07080051"
        },
        {
            "id": "hltqur6",
            "score": 0,
            "text": "The people I know who are unvaccinated are apolitical. They’ve simply looked at the data stratified by age and comorbidity, and made their own adult risk assessment. It’s a perfectly valid choice to not get the vaccine. It’s not always due to fear of the vaccine itself or what govt/politicians/media tell you. Also our US politics are irrelevant to other countries, where there are also many people refusing vaccines.",
            "title_similarity": "0.8126718",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hlttyq6",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.07080051"
        },
        {
            "id": "hltulb7",
            "score": 0,
            "text": "There's the congruence of Johnson & Johnson and Astra Zenca halting use due to a blood clots along with the first vaccine being widely distributed with mRNA technique, could reasonably cause vaccine hesitancy. The traditional vaccine having a side effect that was deemed significant enough to pause usage for a couple of weeks in April (personal note, a mere three days after my wife and I got J&J), so to question whether or not the credible authorities should be believed is understandable since these are similar to Lehmann Brothers remains a Weak Buy, or that Iraq has WMDs, or that free trade will be all upside for the typical American, or that the American government wasn't selling weapons to Iran to fund death squads in Central America, or that aiding the Mujahideen against the godless evil empire wouldn't come back on us, or that South Vietnam could defeat the North, or that the Gulf Of Tonkin incident ever occurred, or so on and so forth. \n  \nIt's not that the vaccine isn't effective or safe, but the authorities have burnt their bridges to being credible, and even if there's a minor problem with the traditional vaccines (J&J) that still far out weighs the risk of being unvaccinated, it allows fear uncertainty and doubt to overwhelm individuals who have been lied to too many times already. So this is not to say that you SHOULDN'T get vaccinated, but that it doesn't have to be political to not believe the conventional wisdom regardless of the conventional wisdom being correct in this instance.",
            "title_similarity": "0.6916841",
            "sentiment_compound": -0.9449
        },
        {
            "id": "hlu285y",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.07080051"
        },
        {
            "id": "hlu3yoc",
            "score": 0,
            "text": "Almost no one is anti vax. Everyone labeled as anti vaccine is just anti forced vaccination. I have no problem with the vaccine. I just don’t have it and will not be made to get it if I don’t want it.",
            "title_similarity": "0.73337495",
            "sentiment_compound": -0.8047
        },
        {
            "id": "hlu4mk8",
            "score": 0,
            "text": "Most people aren’t anti-vaccine. They are pro choosing what to put in their bodies. There’s a very large Israeli studying showing that unvaccinated individuals who have had the virus have better protection vs those with the vaccine who have not had it. It’s pretty easy to find. It’s not a political choice, the people demonizing those who ask questions are politicizing it. No one is telling you not to get a vaccine if you want and there are some that even should like high risk groups. But more than a thousand drugs get recalled each year (and 0 long term data on this essentially booster rna vaccine), there’s sufficient evidence for a healthy person who’s had it to not get the vaccines if they have had covid, and there’s a study that shows some of the most vaccinated countries are the sickest at this point. So people who go on rants  about doing your part when I’m just trying to make an informed decision don’t seem to care I can still shed it with or without the jab. It’s your duty to weigh in the risk and protect yourself if you feel the benefit is better than the risk.",
            "title_similarity": "0.7277065",
            "sentiment_compound": 0.9485
        },
        {
            "id": "hlu57ly",
            "score": 0,
            "text": "I’m a 27M who works in healthcare. Worked through covid seeing patients face to face, some who did have covid. When the vaccine first rolled out I was in the “wait and see” crowd because I have worked this long without a vaccine and have been fine.   \n\nAfter a couple of months, I analyzed data from CDC, WHO and VAERS. As a in shape with no co-morbidities 27M I did my own risk benefit analysis. And in fact my specific demographic had more of a chance developing a long term reaction (myocarditis) than I did from being hospitalized with covid.  This is why I have not taken it.  I don’t believe this is the right choice for the entire population, but as an individual this is why I have not and will not.",
            "title_similarity": "0.6188203",
            "sentiment_compound": 0.222
        },
        {
            "id": "hlu5j0x",
            "score": 0,
            "text": "https://www.scientificamerican.com/article/the-covid-science-wars1/\n\nhttps://sebastianrushworth.com/2021/01/10/are-the-covid-vaccines-safe-and-effective/\n\nhttps://danielpinchbeck.substack.com/p/from-vacillation-to-vaccination?r=1mhh1&utm_campaign=post&utm_medium=web&utm_source=facebook",
            "title_similarity": "0.6402004",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlu78t5",
            "score": 0,
            "text": "First, here's the science: the mRNA shots are not vaccines. This is the first time they have ever been mass introduced into a population. No one - not a person - knows what the long term effects are. You could talk all you want about \"but vaccines usually show side effects in the first X amount of days/weeks/months\" and I would say (again) these are not vaccines. That rationale does not apply. It applies to vaccines, but not this. \n\nSecond, from a risk analysis, if I have a less than 1% chance of dying from covid, and less than 1% chance of being hospitalized from covid, for me any risk greater than 1% is unacceptable and unnecessary. There is no scientific reason for any healthy person to take any risk here.  I had covid, my family had covid, we all survived. According to medical professionals, everyone is getting covid. Everyone. Just like the flu. And, there is a flu shot, I have never taken it, and haven't had the flu in decades. The \"science' says healthy people have healthy immune systems. \n\nFinally, if you're going to go to the \"but you're being selfish\" argument (which is not science based argument), I would say I don't have any social duty to save a bunch of overweight unhealthy people, or the elderly (who have lived their lives) . Not at the expense of what I deem is the appropriate response for my well-being. \n\nEndnote: I personally don't even think the vaccines work to stop the spread of the virus. They may alleviate some symptoms, but in the people who are most affected they don't seem to be doing a very good job.",
            "title_similarity": "0.69701093",
            "sentiment_compound": 0.0644
        },
        {
            "id": "hlue9y4",
            "score": 0,
            "text": "FolLoW The SCienCE Guys\n\nThe mainstream media, politicians, and big farms would *never* be susceptible to corruption. \n\nDarling, it becomes political when the state is taking your rights away to opt out of a vaccine ( where we have no idea what the long term effects are, has a liability clause, and where the main VP of Pfizer, Dr. Michael Yeadon was booted from every platform for speaking against it) .",
            "title_similarity": "0.86707747",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hlukli0",
            "score": 0,
            "text": "\"Do you own research.\"\n\n\\^\\^ I dislike the aforementioned statement because it implies that each person has a strong ability to.. \n\n1. Find reliable resources\n2. Find alternative resources to fact check the original resources\n3. Correctly read, analyze, and interpret scientific studies (most do not have this ability)\n\nWith that point in mind, I agree that many people have no reason to be attempting to interpret and disseminate scientific information--as such, I encourage those who aren't experts in the field to seek advice from medical professionals. If you're unsure about the advice provided by one physician, then consult other physicians.",
            "title_similarity": "0.76166075",
            "sentiment_compound": 0.8599
        },
        {
            "id": "hluxqmh",
            "score": 0,
            "text": "except for the fact that immune system>covid vaccine.\n\nyou take your shots and your pills from big pharma and ill take my alex jones supplements and vitamins.",
            "title_similarity": "0.661983",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hluy4kj",
            "score": 0,
            "text": "Same as masks mandates.",
            "title_similarity": "0.053403255",
            "sentiment_compound": 0.0
        },
        {
            "id": "hluy5p8",
            "score": 0,
            "text": "There is no long term (5+ years) data for this new technology and to my understanding the pharmaceutical companies have no liability if shit goes sideways. Just sayin. And I’m vaxxed so eat one.",
            "title_similarity": "0.55582124",
            "sentiment_compound": -0.6379
        },
        {
            "id": "hlv07in",
            "score": 0,
            "text": "I mean I don’t and never have taken the flu shot because I don’t believe I need it. I don’t typically get the flu. \n\nSo I approach it the same way - I personally feel like I don’t need it and haven’t gotten it in the nearly two years this pandemic has been going.",
            "title_similarity": "0.63624644",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hlv2gpp",
            "score": 0,
            "text": "First off, why would you need the vaccine if you've already gotten covid? You already have the antibodies and you're body recognizes the full virus as opposed to just the spike protein.\n\nSecondly you don't know the long term side effects of the vaccine. We do know the long term side effects of covid. It hits some people much harder and lasts longer in certain people but certain people aren't affected.\n\nIt is very political which is why it is harder to trust the research. You don't know what's cherry picked on either side. That's why it's always best to talk to your doctor and come to your own conclusion. I decided the vaccine was for me. I can understand the other side. There isn't enough time that has passed to know the full extend, either side, of the long term effects.\n\nThese vaccines were also rushed. I have a feeling that in a few years your going to hear that the efficacy of the vaccine was exaggerated or the measure was flawed.\n\nBecause this is overly politicized, its hard to trust either side. Democrats didn't want the vaccine when Trump brought forward operation warp speed, but once in office they pushed the vaccine. There's a huge distrust in the US. You can't blame each other. Look at the corrupt media in this case. It's their job to bring any issues to light. But how can you trust the big name News outlets when lots of their segments are sponsored by Pfizer and moderna?\n\nAnyway, I think each individual should consult their doctor and make the decision for themselves. Government shouldn't be mandating what you can put in your body. How is covid vaccine being pushed but heart disease kills more people per year, so does cancer, etc. Yet there's no war against tobacco companies? Let each person make their own decision. Just present the unbiased facts and let people choose. You'd be surprised wbat people will choose when they know the information is unbiased and truthful.",
            "title_similarity": "0.84105927",
            "sentiment_compound": 0.9804
        },
        {
            "id": "hlv65nf",
            "score": 0,
            "text": "Are you talking about before or after the election?",
            "title_similarity": "0.3595905",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlv6f8e",
            "score": 0,
            "text": "Everything is political.",
            "title_similarity": "0.3271495",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlv6uty",
            "score": 0,
            "text": "Here’s why I, as an 18 year old male that works in a grocery store and is going to college for mechanical engineering have chosen not to be vaccinated.\n\n- I have nearly no risk of severe illness from COVID, in fact, I live in CT, and out of 60k+ total cases for individuals under 20 years old, and a grand total of 4 have died.\n- I had COVID in September, I literally have stronger immunity than someone who was vaccinated without their booster now.\n- My biggest issue is not the risks, but the vaccines incapability in stopping transmission. The data shows that while it affects it to a minor extent, it obviously isn’t enough. That’s why even though I’m not against mandates for other vaccines, i.e. MMR (because those are dangerous preventable diseases for kids), COVID mandates don’t make sense to me.\n- And finally, you can’t accuse me of politicizing the issue when politics are guiding public discourse on vaccines for BOTH sides.",
            "title_similarity": "0.6715208",
            "sentiment_compound": -0.7774
        },
        {
            "id": "hlv8jjy",
            "score": 0,
            "text": "Because any medical treatment in which they use free Krispy Kreme donuts and McDonalds to bribe you with in the name of “health”, for a virus where the leading comorbidity was obesity/heart disease, is not based on science or medicine either. The vaccine might be perfectly fine, in which case whoever is behind the incredibly desperate and bizarre marketing campaign the last year, should be fired. Celebs…lottery tickets…money…free joints…and when that didn’t work, “ok we tried, now you’re fired” is always going to be a no from me. Sometimes you have to use your own common sense and not rely on any sources to tell you what’s right. Look around. Does this - ANY of this - feel right and normal to you?",
            "title_similarity": "0.78089845",
            "sentiment_compound": -0.352
        },
        {
            "id": "hlv900f",
            "score": 0,
            "text": "I've never met anyone in my life against the covid vaccine. It's your body, put whatever you want in it. \n\nI'm very much against mandating it",
            "title_similarity": "0.72655374",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hlvaz3o",
            "score": 0,
            "text": "I am against the mandates. I do see the left is becoming extremely authoritarian and the right the ones scared of our freedom being stripped away by the likes of green passes etc. I don’t care what corporate media calls me. I am not racist or homophobic, and neither are the majority on the right I believe anymore. I don’t care anymore what political category you put me in, I will side with those who see the problems with the following:\n\nWhen I see a little old lady denied entry to a hospital for lack of a green pass, I become skeptical this is about protecting the elderly.\n\nWhen I see a growing number of people with a slew of adverse reactions, I begin to think the choice should then be made by the individual.\n\nWhen big pharma have been found guilty of many frauds in the past, it makes me think the choice should then be made by the individual.\n\nWhen big pharma sponsors the news we watch, and the news then sings their praises, it makes me think the choice should be made by the individual.\n\nWhen effective medicines used for many decades for other applications are irresponsibly called dangerous by the compromised media, it makes me think the choice should be made by the individual.\n\nWhen it becomes clear that the covid infection numbers and more importantly deaths are inflated, and you realise the severity for the vast majority is not nearly as severe as they say, the less one should trust the corporate media/government.\n\nWhen it becomes clear that covid is not serious for the VAST majority of children, the more a sane person should understand if you try to jab the kids, there will be violence.\n\nYou have a right to put into your body whatever you want. But I have a right to say fuck off if you want to forcefully put it in my body or my kids. For now at least. Even one of the reasons listed should give someone enough of a right to say no.",
            "title_similarity": "0.77602136",
            "sentiment_compound": 0.054
        },
        {
            "id": "hlvc0ao",
            "score": 0,
            "text": "I don't know anyone who opposes the covid vaccine. Most people oppose the mandate.",
            "title_similarity": "0.7044906",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlvemn7",
            "score": 0,
            "text": "My dad has heart failure and was kept for observation after taking the vaccine as the vaccine tends to worsen heart issues, his heart function has since declined and he is considering  getting a c pap machine installed again due to the rapid decline in his quality of life. 😁 i dont know much about the specifics of the vaccines effects on folks with heart issues so ill leave the reading to you",
            "title_similarity": "0.64201033",
            "sentiment_compound": 0.8917
        },
        {
            "id": "hlveqxk",
            "score": 0,
            "text": "'Well, ABC says this! And so does NBC, so it must be true, i don't need to do actual research'. The Great Barrington Declaration, the German Extra-parlimentary Committee on Covid, Dr. David Martin (who has a verifiable 205 page dossier on the corruption of the CDC/FDA, etc), Dr Sam Bailey..the list goes on and on. This could easily be a psyop post, or a dummy account paid for by, you guessed it, big pharma. If people can't, or won't see all of the firey red flags, then just drink the kool-aid already. People don't want the truth because it is, in fact, terrifying. I understand. Its a punch in the gut. But Covid patents have been submitted as far back as 1998, a total of 72. US patents that you can verify if you actually want to do your own research and just not regurgitate what your told to believe.  The big picture is that our country has been brainwashed for GENERATIONS. [https://principia-scientific.com/david-e-martin-the-fauci-covid-19-dossier/](https://principia-scientific.com/david-e-martin-the-fauci-covid-19-dossier/)Good luck",
            "title_similarity": "0.77220535",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hlvj8lw",
            "score": 0,
            "text": "I'm opposed to getting it because I already got covid before and the science literature all points in the direction of me being better protected than solely with a vaccine. There is no reputable data regarding people with the vaccine who had covid vs without and so I have no reason to get a vaccine. The science from a n=2million person study says I am 5.96x better protected than someone with a pfizer vaccine against the delta variant. How is my decision not based on science?\n\n&#x200B;\n\nhttps://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1.full.pdf?fbclid=IwAR1sYzK5ameYR5IFvv4NumIppx9JvWVPBVTSEWqmt-7AXiQ84TMH3rzYfgU",
            "title_similarity": "0.79310113",
            "sentiment_compound": 0.8072
        },
        {
            "id": "hlvkis2",
            "score": 0,
            "text": "I think the primary opposition is a political one, but the secondary opposition is science based\n\nThe first question is: should an individual have the ability to autonomously accept or decline medical care depending on their own case-specific priorities and preferences?\n\nIf the answer is yes, then the second question is: what benefits and risks come from the covid vaccine, to inform this decision. Here is where science comes in. The biggest opposition here IMO would be a complete absence of long term safety data.",
            "title_similarity": "0.83871615",
            "sentiment_compound": 0.962
        },
        {
            "id": "hlvknaq",
            "score": 0,
            "text": "I completley agree, it's not based on science or medicine. But it's also not scientific to force a ireversable medical procedure onto people when there's no evidence of it working the same with every person and no science on the lasting effects. Also why if it's so good for you to make othe people get it, aren't you already protected? and if it's crucial to the survival of mankind than why not let the rejects of this experimental \"vaccine\" die off?",
            "title_similarity": "0.75407386",
            "sentiment_compound": -0.6267
        },
        {
            "id": "hlvlt0n",
            "score": 0,
            "text": "I wonder what’s the take of leaving insurance company to decide. People who got vaccinated have lower risk thus lower premium. People are still free to decide whether to get vaccinated or not but at their own personal cost.",
            "title_similarity": "0.5448844",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hlvmm1a",
            "score": 0,
            "text": "I'm 100% pro vaccine (although against mandates) and I've gotten vaccinated and trust that it's safe. But for any vaccine that hadn't been out for years, there are valid unknowns. Furthermore, some young children are better off not getting it. In any case, it's beat to go Witt medical professionals, not politics where one side is opposed to it and the other side wants to force it, even when you sometimes shouldn't under rare occasions.",
            "title_similarity": "0.72629267",
            "sentiment_compound": 0.7876
        },
        {
            "id": "hlvqse9",
            "score": 0,
            "text": "The Covid vaccine may reduce your symptoms, but it cannot make you completely immune, and that's the issue. How many extra booster shots shall we need to protect ourselves? Is it really worth it? Also, the vaccine can cause allergic reactions in many cases (albeit not in most cases), so if you could die from the vaccine, you wouldn't take it.",
            "title_similarity": "0.71720874",
            "sentiment_compound": 0.1628
        },
        {
            "id": "hlvqt3h",
            "score": 0,
            "text": "Simple; a lack of proper study time.  I'm vaxxed, but if someone decided that \"hey, I'd like to wait and see; an emergency use authorization is not enough for me\" then how can you conclude that's a political decision? It's perfectly reasonable for someone who's not in a high risk group (i.e. young) to decide that they would like to wait and see long term research before taking a jab",
            "title_similarity": "0.701605",
            "sentiment_compound": 0.765
        },
        {
            "id": "hlvvv1m",
            "score": 0,
            "text": "I just think that with Covid, it can be a slippery road. One person’s Covid experience can be wildly different than another person’s Covid experience. Getting Covid to get a natural immunity is Russian roulette at best, in my non-medical/expert background. I’m not a doctor or virologist, but I am a person who has seen coworkers, friends, and family die from contracting Covid while others have mild symptoms. I had my siblings all test positive for Covid and have a fairly minor case. Ages 14-22. Then I had a friend age 39, healthy who works out, become intubated, almost die, and is currently re-learning how to walk at the moment. Covid ravaged his body and completely weakened everything about him. For myself, I choose the vaccine over chancing my own bodies response to this virus. I respect peoples’ decision to not take the vaccine, but I hope that they understand that not everyone will have a minor or mild experience with it. Some, not all, of you will die and some of you will have permanent physical damage.",
            "title_similarity": "0.71569157",
            "sentiment_compound": 0.6059
        },
        {
            "id": "hlvykue",
            "score": 0,
            "text": "I'd rather run the risk of catching an illness with a 99.7% survival rate than definitely go through the trauma of a vaccination, which is based in a phobia rather than any sort of rational thinking. My aversion to needles outweighs my fear of covid.   \n\n\nIf you want to make the case that my irrational fear of needles and objects piercing the skin is political, go right ahead, but given I have always had this fear I don't have high hopes for you. You'll be telling me next that the nausea I get when I see anything gross to do with eyes or teeth on the TV is directly linked to my advocacy for free speech.",
            "title_similarity": "0.76140785",
            "sentiment_compound": -0.9499
        },
        {
            "id": "hlvyzz4",
            "score": 0,
            "text": "Going to preface this by making it clear that I think everyone should take a safe vaccine, but no one should be forced to.  \nAlso, I've taken a few political polls and they all put me pretty much dead center. So I wouldn't say I was left or right. And I don't vote like that. I vote for the party that I think will best progress society. (usually an independent, as the majours are all asshats)  \n\n\nI was hesitant to take the vaccine because of the lack of testing for this new RNA technology. The Phizer website outlines exactly where they are up to in the testing process on their website. I'm not sure how much more direct you could go than the vaccine manufacturer themselves. And there is nothing politically left or right about it.   \nThe death rates are all recorded by the ABS and accessible on [abs.gov.au](https://abs.gov.au). that's where I get my information from.  \nGranted, the testing is catching up. but it still has a ways to go, and we simply haven't had enough time to find any long-term effects of these vaccines.   \nThere is also anecdotal evidence from my life. I don't know anyone personally that has not had negative side effects from the vaccine. they have all had 2-10 days off work because of the side effects. My friend has a young niece that has developed seizures since having the vaccine. something that was not present before. The day after her second dose she went from being fine to having 10+ seizures a day.   \nVaccinated rates also have not correlated with a decrease in covid infections, or severity in my country. infections and deaths have stayed steady even as we near 80% vaccine rated. One would expect rates to slow down the more people are vaccinated. but that isn't the case.   \nAgain, my sources here are the vaccine manufacturers directly, and the abs. I don't go to the media for information as they are all biased these days and need to be fact-checked. \n\nI will admit that I have recently(last week) developed political reasons to oppose the vaccine. And that reason is that we are currently being forced to take it. No one should be forced to take any vaccine. Especially one that is still in its experimental stages.",
            "title_similarity": "0.8618756",
            "sentiment_compound": -0.823
        },
        {
            "id": "hlvz008",
            "score": 0,
            "text": "Mine and my husbands friends who we just went to stay with have let us know they are positive and both feel awful. We have tested negative and we are not jabbed. We did have covid in August and we weren’t as ill as they are. We are not jabbed. Seems it’s a lottery to me.",
            "title_similarity": "0.5660794",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hlw03c8",
            "score": 0,
            "text": "I had a hysteroscopy planned. I didn't want to get the vaccine before that.\n\nI don't know if you know what a hysteroscopy is but it requires sending a camera into the womb, and if you're bleeding then they can't see anything. The date of the procedure had to be planned exactly according to my cycle.\n\nI then saw thousands of women have noted a change to their cycle and their period after having gotten the vaccine. No explanation as to why, and no vaccine trials studying effects on the menstrual cycle.\n\nWhat was I supposed to do, take a vaccine and then potentially fuck up my cycle and then have to reschedule my hysteroscopy and wait months again, or just say no to the vaccine because there's no information whatsoever on what type of woman's menstrual cycle it would affect?\n\nDuring the months leading up to the hysteroscopy where I chose not to get vaccinated, I'm sure you would have considered me an anti-vaxx, uneducated, right-wing idiot, unless I took the time to explain my personal, private medical business to you. Now you look around you to all the other \"idiots\" and ask yourself do they have some medical issue you're not aware of?\n\nYou're most likely male, and the field of medicine is almost entirely dedicated to the male body (women's bodies have changing hormones and so they can't be arsed being actual scientists and testing around that, they prefer to be political and go with whatever's easiest)\n\nSo the person who has the exact blueprint body for the vaccine (you) tells those of us for whom the vaccine hasn't been adequately studied, that our choice is right-wing and political, and yours is rational and science-based (how convenient for you).\n\nIf you don't think that women shouldn't have held off for a bit before taking the vaccine, then you're not as rational, or as scientific as you think.",
            "title_similarity": "0.74963504",
            "sentiment_compound": -0.8806
        },
        {
            "id": "hlw89em",
            "score": 0,
            "text": "It is not always political, though sometimes these can interconnect. \n\nGo see the opposition of vaccines by the \"hippies\" and the \"naturalists\". Look at the low carb and chiropractor community who uses pseudo-science, cherry picked data and the most over generalized biological mechanisms and claim a wide range of over generalized statements on the issues. \n\nI know a lot of people who hate trump but keep saying they wouldn't give the vaccine to their kids. But they got it. This is a person who doesn't understand the science.",
            "title_similarity": "0.7982623",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hlwdsin",
            "score": 0,
            "text": "It’s not effective",
            "title_similarity": "0.11497717",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hlwfj12",
            "score": 0,
            "text": "Www.thecovidworld.com\n\nNot political.",
            "title_similarity": "0.24983132",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlwgld6",
            "score": 0,
            "text": "Dr. Sanjay Gupta went on Joe Rogan and said that if you got Covid that the antibodies are just as good as the vaccine. The vaccine doesn't prevent you from catching Covid, it just lessens the symptoms. And I fucking hate needles. So explain to me, as someone who got Covid last year and was fine, why I should get the vaccine?",
            "title_similarity": "0.7274078",
            "sentiment_compound": -0.0943
        },
        {
            "id": "hlwgo5j",
            "score": 0,
            "text": "You're just hearing what you want to.",
            "title_similarity": "0.1980255",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hlwi63l",
            "score": 0,
            "text": "I'm a healthy 23 year old I'll take my chances with natural immunity. My body my choice",
            "title_similarity": "0.42026705",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hlwiaee",
            "score": 0,
            "text": "Here's my take on the vaccines: It's a PERSONAL MEDICAL DECISION. For example, I'm healthy and I'm not worried about Covid killing me. So I don't consider getting vaccinated for it a necessary medical intervention, for myself.\n\nI am acting in my personal best interest. Because I believe, very strongly, in only taking pharmaceutical products if absolutely necessary. I don't take them gratuitously, I treat these artificial compounds with the caution they deserve. I don't think a constant state of being medicated (as so many are) is healthy at all.\n\nWhere's the politics in that statement? I don't think there is any. That's a medical decision. And, while I would be happy to have a more in depth conversation on this topic, I will only do it is if we both use our own words. I'm not interested in links or quotes. Not unless you can convince the person that quote belongs to to actually show up here, and discuss it. Bother to understand my context and my arguments, before he or she tells me what's good for me. Then, I'm happy to converse with them too.",
            "title_similarity": "0.7199337",
            "sentiment_compound": 0.9591
        },
        {
            "id": "hlwmb6v",
            "score": 0,
            "text": "I am farther left than the democratic party, how am I right-leaning if I choose not to vaccinate until such a time that my biological risk factors make it necessary?\n\nLooking at the age data from CDC.gov there is very very little risk from contracting covid for anyone under the age of 55. If the effective duration is only about 3-6 months, I don't see a point getting jabbed *if* I don't intend to re-up 2-4x per year.\n\nI will likely get regularly vaccinated against covid in the next 10-15 years, if I become obese, or if am diagnosed with diabetes or any other condition which affects my immune or respiratory system.\n\nIt's not a political stance to believe that the available vaccines will not end this pandemic. The countries with the highest vax rate have the highest transmission.\n\nUltimately my feeling is that vaccination increases the likelihood of asymptomatic spread. If the vax can increase the likelihood that an infection does not manifest symptoms, that person will not know they are sick. Which means they won't take a test (and nobody is asking vaccinated people to test), and the illusion of safety leads to more risk-taking behavior. Less masks, less handwashing, less social distancing, etc.\n\nI feel that anyone who is statistically not at risk *shouldn't* get vaccinated because to develop symptoms is a warning sign that indicates you should take a test before interacting with your community. I think getting vaxxed without needing it is like disabling a vehicle's check engine light.",
            "title_similarity": "0.64579284",
            "sentiment_compound": 0.5669
        },
        {
            "id": "hlwsknw",
            "score": 0,
            "text": "Previously I had no qualms with the vaccine until three healthy people I'm close with have had adverse reactions to the vaccine. Two being serious & one with lingering effects that remain after five months. One time may be an anomaly, two perhaps a coincidence but three is a pattern. That's enough for me. No thank you, I'll take my chances. Let people choose.",
            "title_similarity": "0.61087126",
            "sentiment_compound": -0.2767
        },
        {
            "id": "hlwumbx",
            "score": 0,
            "text": "When my government run health department stopped administering AstraZeneca to particular cohorts for health reasons I found that to be a pretty good justification for the skepticism I had for it prior to that health determination. It was definitely justified afterwards as it was official medical advice.\n\nI can easily look up the adverse reaction statistics in detail. Those are published by the government as public record. They even go into detail in the statistics on their own site about which side effects are most prevalent and in which cohorts. For example, last time I checked Moderna had a statistically significant risk for myocarditis and pericarditis in male adolescents in particular.\n\nI live in Australia and we have high vaccination rates, high compliance with lockdowns and impositions, and just recently we've used the military to imprison *uninfected* individuals in camps on suspicion. This is not a place where there is any skepticism in government at all, and scant little in the people either. If *my* government is telling me to be wary of vaccination risk then I think it reasonable to assume there *is* risk.\n\nDespite not choosing to vaccinate myself I advised my siblings to do so. I am not interested in evangelising my political *or* medical beliefs. The vaccine was right for them, it wasn't right for me. My brother experienced minor illness as a result of vaccination, my sister has had reproductive issues (namely abnormal bleeding). I know plenty of other people that have had no side effects, and others that have had minor to moderate side effects. Side effects are to be *expected* with a first generation treatment rolled out to *billions*. This *always* happens with every new treatment, the only difference this time is that the covid vaccines are *untested* by standard medical criteria (it would take a decade or more to test a novel mRNA vaccine in humans to the point of certification under normal circumstances, which is exactly why *emergency medical authorisations* have been executed and remain in force in the case of covid vaccination).",
            "title_similarity": "0.7709137",
            "sentiment_compound": -0.52
        },
        {
            "id": "hlwwslw",
            "score": 0,
            "text": "> I hold this view because EVERY source I've seen that casts doubt on the safety or efficacy of the Covid vaccine goes right back to right-wing politics.\n\nSo liberal \"socialist\" Norway is full of right wingers now? And are you aware anti-vax started as a **Left-Wing** movement?\n\nThe reason you think they are \"Right-Wing\" is because you have been trained by USA's media has constantly claimed such. It's also part of a larger lens filter, and here is an easy test. Just ask yourself if you considered freedom to be a Right-Wing movement. If you do, congratulations. It worked on you, welcome to the realization that you have been opposing freedom and favoring government control and facism.\n\n> They're political sources, they're published on political websites, they're bloggers who also post right-wing political view. \n\nDo wolves howl at the moon? If you're not familiar with the phase or discussion it's about correlation doesn't equal causation, or even broader about formal fallacies. \n\nAnyway, the deal is wolves howl for communication and the moon's appearance has no effect on this. However, having been told wolves howl at the moon your brain inherently seeks affirmation, noting every time you've heard a wolf howl at the moon while forgetting all the times you've heard them howl when their wasn't.\n\nThink of it this way. **You think** mask discussion is political, therefore all mask discussion **appears political to you** even if it's not.\n\nLet's try an exercise where you separate from your ego and focus on empathy for a moment. Imagine you were an adult with kids to look after and protect but you're also a Left-Winger so you believe children should never be punished or forced. And then one day your ten year old child comes home with a masking tape wrapped around their face because someone decided to force your child to do something they obviously needed forced into doing. Do you have questions? Do you have concerns? According to your beliefs, how does one express those without someone like you who will just dismiss it all as \"Right-Wing politics\"?\n\n>Any non-political source I've found is clearly in support of vaccines. \n\nBroadly speaking, these \"anti-vaxxors\" you're talking about **support** vaccination. For example, 90% of Americans have been vaccinated against Pertussis, 91% against Varicella, 93% against Tetanus, 90.8% against measles, mumps, & rubella, and so on. These are considered \"real\" vaccines, and Tetanus even requires a booster every decade. There is 90+ chance whomever you're talking to **is** vaccinated and did the same thing with their kids.\n\nBut lets talk about something else for a moment. The first vaccine for Hep B was discovered in 1965 and the first vaccine licensed for use came out in 1986. Even after twenty years of refinement, the chances of a serious complication is around one in six hundred thousand (1:600,000). Public concerns along with questions about liver damage developing in infants have been at the forefront. As a result, Hep B vaccination rates in the USA are around 24%. So, does that mean 76% of the USA is anti-vax? But what about the 90% numbers from before?\n\nMaybe a simple solution is that you should apply your woke views on genders to the topic of vaccination. Instead of male/yes & female/no, you have a range of options such as bi/safe, demi/specific, fluid/pro-choice, or agender/ignores-political. For example, it's entirely possible to be pro-vaccine (using Oxford's definition) while refusing to support forcing a fast tracked, unstudied, long-term unknown, clearly has risks we cannot discuss, clot-forming shot that offers new proof of it's ineffectiveness every single day on people that have little to no risks against the disease in question.\n\n> And if nothing else, I want to be able to respect the views of friends and family who feel otherwise.\n\nOh yes. Who can forget Uncle Jesse the 10 year military vet & missionary that delivered drugs & water who came home and created homeless support programs. His husband developed \"sudden adult death\" within two days of being vaccinated so all he wants to do is talk about how dangerous it could be. Fuck him amiright? Who can respect trash like that? The only thing that matters is they agree to my standards. ಠωಠ\n\n> Whether it's fear, conspiracy, or anything along those lines\n\nBut part of your stance is built on fear. Fear that an unvaccinated will pass COVID to you, fear that your vaccine will fail, and fear that COVID will kill you or someone you depend on.\n\n> Ok I've spent way too much time on this. I'm getting a lot of the same uncited talking points I've seen over and over again, and I'm noticing more and more conspiracy theorists jumping in.\n\nThat's exactly what people need to hear right? You don't have a single citation either but are quick to complain about how people are wasting your time not posting citations. And then you just dismiss them all as crazy conspiracy nuts for disagreeing. Like a wolf howling at the moon, it reminds them people whining about vaccines are closed minded hypocrites that just can't approach the subject like an adult. It really helps the situation doesn't it?",
            "title_similarity": "0.8831563",
            "sentiment_compound": -0.9885
        },
        {
            "id": "hlwysub",
            "score": 0,
            "text": "OP you’re on CMV and every comment you’ve posted has been you justifying what you already believe. The irony is almost too much. \n\nLast year conspiracy theorists predicted a lot of stupid shit, but also appear to have predicted vaccine mandates and discussions like this where you all want to call everyone that disagrees with you stupid regardless of their rationale and pat yourselves on the back - you all need to get off Reddit and occasionally leave the house - no one cares.",
            "title_similarity": "0.83088046",
            "sentiment_compound": -0.9007
        },
        {
            "id": "hlx02x8",
            "score": 0,
            "text": "Mass produced rapidly in a fraction of the normal time, given emergency approval, no true long term studies. I’m not against it I’m against forcing it.",
            "title_similarity": "0.5595808",
            "sentiment_compound": -0.21
        },
        {
            "id": "hlx180p",
            "score": 0,
            "text": "It’s not only the right that have anti vaxers there is plenty on the left also. \n\nI think you have been the victim of confirmation bias here. \n\nThis hole argument has transcended beyond politics now. I think this is also the case with anti vax is they are also falling foul to confirmation bias.",
            "title_similarity": "0.69059587",
            "sentiment_compound": -0.8625
        },
        {
            "id": "hlx1gff",
            "score": 0,
            "text": "Easy...\n1. They misrepresented its effectiveness by showing the RRR instead of the ARR. Even the CDC says use the ARR but since it was only about 1% they fudged it.  \n2. The mortality rate for anyone under 65 and generally healthy is very low and since its not really a \"vaccine\" but a treatment that is EUA ONLY, science would not really suggest it. You are however more apt to give it to elderly, immunocomprimised, etc...even being experimental, for those folks.\n3. EUA - Due to no long term studies.  Even the best and brightest healthcare professional among us can only guess about it.  Even the initial study was only about 3 months long and riddled with errors, shady classifications and issues. \n4. Refusal to list ingredients.  Who seriously in their right mind would take any medication without at least seeing what is in it?  That is NOT based in science or medicine!  I mean really, whats the first thing asked before you take medication?  \" do you have any allergies?\"  Wouldnt even matter here, you nor they know whats in there.  \n5. (Anecdotal) Everyone that I know who doesnt want to have it, didnt want it from Trump or Biden. Its not about politics to them, its about the EUA, nobody being responsible for adverse effects (short or long term), the suspicious push, bribery and coercion for everyone to receive it, and now mandates telling them that they must inject it into themselves.  \n\nI could go on but I hate typing on my phone...at any rate, its far from political for those still not taking it.",
            "title_similarity": "0.63066494",
            "sentiment_compound": -0.5344
        },
        {
            "id": "hlx4x7t",
            "score": 0,
            "text": "I'm vaccinated but for a long time I wasn't and didnt want to. The reason was in no way political. I just didnt want to. I don't often get the flu shots either and I've only gotten the flu once, and it wasn't bad at all. I just didn't feel the need especially when I wore a mask and social distanced. I did end up getting covid from my pops after I visited him (he didn't have symptoms at the time). It wasn't bad at all, but I ended up getting the 2 shots afterwards because my grandma was worried.",
            "title_similarity": "0.6355394",
            "sentiment_compound": -0.6042
        },
        {
            "id": "hlx57tt",
            "score": 0,
            "text": "The fact that politicizing personal health choices is the biggest issue. There is research on the immune response being better from natural immunity and those that are healthy and eat healthy have a typical mild reaction. (Most not all). The category that is hurt most by covid is obese and those with other co-existing diseases. \n\nThis health crisis should be left to the medical field. The politicalization of health mandates is wrong in all forms of human rights. You can still carry the virus if you are vaccinated and those who practice holistic health should not be scrutinized and singled out when this “pandemic” of the unhealthy is really the issue.",
            "title_similarity": "0.7697232",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hlx5kef",
            "score": 0,
            "text": "I think most of the doubt is coming from the mandate. I got vaccinated as soon as I could but does that mean the government should decided whether I have the right to work or not? Absolutely not. The government is acting like it can give us our rights and take them away as they please. Your  rights are your rights, especially the right to provide for your family.",
            "title_similarity": "0.75788975",
            "sentiment_compound": 0.6506
        },
        {
            "id": "hlx9nb8",
            "score": 0,
            "text": "Found r/unpopularopinion 2.0",
            "title_similarity": "0.22339387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlxbmly",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.07080051"
        },
        {
            "id": "hlxem3c",
            "score": 0,
            "text": "On CDC’s website they list over 10,000 deaths directly related to the Covid Vaccine specifically the J&J vaccine. \n\nhttps://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/adverse-events.html\n\nFirst time I read this it was about 7,000 deaths and thats was like 2 months ago. There’s a list of other adverse affects on this website reported by VAERS. Also I remembered reading that most of these deaths had to do with heart problems so although I don’t think the vaccine will be a problem for most people I do think its messed up that if you’ve had heart problems in the past they won’t allow you to be except.",
            "title_similarity": "0.6059548",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hlxhq0g",
            "score": 0,
            "text": "Regardless of the medicine I shouldn't have to be fired to put something into my body I don't want. I thought you people liked body autonomy",
            "title_similarity": "0.5735821",
            "sentiment_compound": -0.2551
        },
        {
            "id": "hly5hnl",
            "score": 0,
            "text": "LoL read the vaers main page. Your info is just wrong.",
            "title_similarity": "0.5263436",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hm1bkns",
            "score": 0,
            "text": "I don't entirely agree with your argument. There are sources online that do publish/document science-based reasoning and facts opposing vaccines, vaccine mandates, vaccine passports, and the like. A friend of mine (Mark Abrams) has published two research papers and launched a YouTube series about the dangers of vaccines, all based on extensive research he has done and discussions he has had with doctors and scientists. The mainstream media and most popular online sources will of course be politically minded, but there are other places to find apolitical, scientific views on this issue.",
            "title_similarity": "0.827401",
            "sentiment_compound": 0.1613
        },
        {
            "id": "hm4n1hs",
            "score": 0,
            "text": "So saying \"my body, my choice\" for not getting the vaccine is political? Then women can't use it to justify abortion because it's political.",
            "title_similarity": "0.7780832",
            "sentiment_compound": 0.0
        },
        {
            "id": "hm4ojzu",
            "score": 0,
            "text": "There have been reports of people getting really sick after getting the vaccine and several people in a couple states have died after getting it. Yeah, that's totally just political and not based in science.",
            "title_similarity": "0.63561904",
            "sentiment_compound": -0.7178
        },
        {
            "id": "hm5xudf",
            "score": 0,
            "text": "Just putting this out there that apparently pfizer is waiting over 50 years before releasing the safety of its usage! (i have a picture i can send through dms as it’s not a link) strange isn’t it? also how is it that the founders / ceos of these companies don’t want it for themselves or their families",
            "title_similarity": "0.6055114",
            "sentiment_compound": 0.6103
        },
        {
            "id": "hmtko56",
            "score": 0,
            "text": "Statistically I am in the age group that is some of the most safe, am probably top 10% fitness levels for my age/weight, have no prior known medical conditions. The vaccine, while FDA approved, did not go through normal FDA approval timelines, and we do not know the long-term affects of the vaccine yet. The data shows there is a growing list of possible side effects. Having taken them into account, and knowing that even if I do get covid that the chances of me dying or even being hospitalized are slim, I believe it is safer for me to stay unvaccinated than it is to risk my health with a potential side effect (such as myocarditis just as an example). This choice is based on data and science put out on the vaccine.  \n\n\nThis is just a side note and not part of the argument: Science/Medicine aren't the only thing to consider when making decisions, and science is every changing. Politics plays a huge part in a persons day to day and effects you just as much. Saying \"trust the science\" doesn't mean anything to someone whos argument is \"I don't trust the government\". You can be against a government forcing you to get a vaccine, and still be pro-vaccine: those stances are not mutually exclusive.",
            "title_similarity": "0.64578354",
            "sentiment_compound": 0.9104
        },
        {
            "id": "hmtm4z2",
            "score": 0,
            "text": "Wow very surprised to not see the most obvious answer in the top comments:\nI am 30, most of my friends are 25-35. (I am pro-vaccine)\nFor young people, they are likely to get very sick from the vaccine. \nThe majority of people I know in my age bracket had severe reactions to the vaccine. For example I had a fever 5 days after being vaccinated, and the night of I was so sick I was not even able to walk up the stairs to go to bed. I missed two days of work and at the time had no sick days (I was lucky and could easily financially weather that but many people cannot). This is common among young people. \nYoung people are very unlikely to be hospitalized with Covid, and in many cases are asymptomatic. \n\nThe choice for young healthy people is between most likely missing work/pay from being vaccinated, vs likely being asymptomatic or not very sick from getting Covid. \n\nUnless you are doing unselfishly it for your community, I think it’s a logically valid choice -maybe THE logical choice - to choose not to get vaccinated as a young and healthy person. (But still not conscience-valid/right thing to do: the reason I got vaccinated was to reduce my chances of spreading it to others. But I don’t expect everyone to be that selfless).",
            "title_similarity": "0.57029134",
            "sentiment_compound": 0.9131
        },
        {
            "id": "hn6g50x",
            "score": 0,
            "text": "MY reason is that any other \"vaccine\" takes years to go thru trials to make sure they are safe. Lab trials, animal trials, people trials... The participants are followed for a period of time to make sure there are no short/long term effects. This C-19 shot was rushed thru in 8 or 9 months??  Has anyone looked up the VAERS (?)  Vaccine side effect reporting. ( I wish I could find the link I had because of course it's been taken down now)   Thousands of people have DIED from these shots, gone blind, deaf, paralyzed, fainting spells, blood clots, heart diseases. No way in fucking hell am I getting that shot. I can't even say it's a \" vaccine\" without rolling my eyes. People still get the virus after they get the shot!!  How in the hell can you call that a \" vaccine\"?",
            "title_similarity": "0.60563356",
            "sentiment_compound": -0.877
        },
        {
            "id": "hnfx8pa",
            "score": 0,
            "text": "I have next to no opposition for the vaccine. Right now, as a college student aged, healthy individual, there risk of adverse effects from either vaccine or the virus is minuscule and one really isn’t less dangerous than the other. I wish I knew more about long term effects, if any, but no one knows that right now.\n\nI have a problem with forcing it on people and that’s why I won’t take it. I don’t think someone should have control over what I put into my body. That’s all I say on that because I know that isn’t what you’re inquiring of. \n\nI will however, say that if I was 10-15 years older, maybe a little more out of shape, and this thing wasn’t being pushed so hard, then I’d more than likely be all for it",
            "title_similarity": "0.69696414",
            "sentiment_compound": -0.8716
        },
        {
            "id": "hlsrc8n",
            "score": 23,
            "text": "Would you say people who refuse to get it due to a history of adverse reactions to vaccines is political?",
            "title_similarity": "0.75566864",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hlslhl8",
            "score": 21,
            "text": "Reactance\n\n[https://en.wikipedia.org/w/index.php?title=Reactance\\_(psychology)&oldid=860744167](https://en.wikipedia.org/w/index.php?title=Reactance_(psychology)&oldid=860744167)\n\nThis is not necessarily political.\n\nIt also involves things like when a toddler looks at you when you say 'dont run away' and they do the exact opposite, or teenage rebelliousness. \n\nTo me many people then take this and make it political, because it helps them frame it, plus half the time the world view seems t obe that we should frame everything in some political manner.\n\n Sometimes its just part of being humans and our diverse reactions to many things.",
            "title_similarity": "0.6665783",
            "sentiment_compound": 0.504
        },
        {
            "id": "hlsm1ez",
            "score": 20,
            "text": "I have a few friends who haven't gotten it for the sole reason that they have been trying to get pregnant for a while, and don't want to throw anything \"new\" into the mix.",
            "title_similarity": "0.5796466",
            "sentiment_compound": 0.4363
        },
        {
            "id": "hlsobyb",
            "score": 36,
            "text": "It’s not necessarily political. Black people have a [legitimate](https://en.wikipedia.org/wiki/Tuskegee_Syphilis_Study?wprov=sfti1) reason to be weary of vaccinations in general, especially ones that spring up with what may seem like suspicious circumstances to a layperson.",
            "title_similarity": "0.5457245",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hlt0v9c",
            "score": 6,
            "text": "I'm vaccinated and agree with that the science we have says the vaccine is safe.  With that said, \n\nOf course the opposition to the covid vaccine is political.  It's based on mistrust in government which often times is based on valid reasons. \n\nIt wasn't that long ago that Democrats, Republicans and the media covered up the fact that government officials poisoned the drinking water of Flint Michigan, then lied about it and gave thousands of children permanent disabilities\n\nhttps://youtu.be/cvlcI2TmfdI\n\nWe have a government void of any accountability that has been proven to side with money off safety countless times.  Do you really blame people for not trusting the fda? The same organization that is complicit in killing over a million Americans through Oxycotin?\n\nThere is a consistent history of the medical community knowingly doing awful shit to people in the name of legitimate science. So when people are hesitant to give the vaccine to their 4 year old, there should probably be so empathy",
            "title_similarity": "0.81026626",
            "sentiment_compound": -0.9424
        },
        {
            "id": "hlstauj",
            "score": -1,
            "text": "One side is open about the fact that vaccine opinions are political opinions. The other side pretends that they’re not being political.\n\nWhether you’re for or against vaccine mandates, that’s a political opinion.",
            "title_similarity": "0.76878595",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hlt4dle",
            "score": -1,
            "text": "I think that people who opted not to get one based off of allergies they have, prior negative side effects with other vaccines, worry about blood clots (especially for those with a blood disorder or problem), etc., all have scientific and medical reasons to be weary of the vaccine. This doesnt make up the majority of antivax people, but there are definitely groups with legitimate science based hesitancy",
            "title_similarity": "0.7791826",
            "sentiment_compound": -0.6542
        },
        {
            "id": "hlt537c",
            "score": -1,
            "text": "Vaccine hesitancy actually is quite rational. It comes down to what action can I take today to stay safe today. The overall risk across your lifetime will be reduced by taking the vaccine, but your near term risk is higher if you choose to take it.\n\nTaking the vaccine or not, both have risks. If you take the vaccine then you immediately expose yourself to all those risks. If you don't then you still have to catch a severe case of covid before you can are exposed to those risks.\n\nAnother point is that you might have already been exposed and have antibodies. Which would mean that you are taking on the additional risks of the vaccine side effects for even more limited reward.\n\nConsidering the risk of severe infection is actually fairly low, it's easy to rationalize not getting the shot. Even though the numbers are actually in your favor across the board to get vaccinated... Actually talking action to get the vaccine can feel like you're actively putting yourself in danger.\n\nI believe this is one reason why post infection treatments are very popular with the Anti Vax crowd. Things like ivermectin have far less scrutiny than the vaccines. But at that point where you're already infected then it makes sense to take the action to take a medicine to improve your chances in the near term.",
            "title_similarity": "0.6977198",
            "sentiment_compound": -0.5364
        },
        {
            "id": "hlt688s",
            "score": 1,
            "text": "It is true that we dont know the long term effects of this particular vaccine because it has only been around for ~1 year. We can assume the risks are low because of it's similar MOA to other vaccines, but we can't know for 100% sure. \n\nTo me, the risks of potentially catching covid seem worse than the unknown long term effects of the vaccine.",
            "title_similarity": "0.63457227",
            "sentiment_compound": -0.6187
        },
        {
            "id": "hlt72kk",
            "score": 1,
            "text": "Is this post in relation to specific vaccines? I don't know up to date science on the Sputnik vaccine, but based on the early science I can understand why Russians would have been skeptical about this one.\n\nThis is not to pick on Russia, China, India or other countries who may have developed vaccines. There are just different standards in different places. Personally I wouldn't want a vaccine without transparent information about where the science behind it's approval comes from.\n\nIn the US much of the early information about covid turned out to be wrong. A new virus we didn't yet know enough about created an environment where false information could easily spread without the science to challenge this false information. This was at a time when people were paying the most attention to covid, and by the time real science was showing up many of these people were no longer paying close attention. If they're no longer paying attention to real science and news, then it creates opportunity for manipulation. \n\nSocial media and political divisions create an environment for group think on a massive scale. You get right leaning people thinking the virus is no worse than flu, doesn't spread through the air, and then more conspiratorial thoughts. Then there's left leaning people who think masks are necessary while outdoors, even with nobody else around. Many right leaning people still think covid doesn't spread though the air, so hand washing and not touching your face is enough. This actually was the early scientific thought based on past coronaviruses, and CDC did not update their website to reflect new science until many months after most people knew covid was airborne. Why get a vaccine if you think hand washing is enough, and why wear masks for a non airborne virus?",
            "title_similarity": "0.7580911",
            "sentiment_compound": 0.9396
        },
        {
            "id": "hlt7spe",
            "score": -1,
            "text": "I think everyone capable of rational thought will agree that the **vast majority** of the population should get vaccinated ASAP. However, I can sympathise with people who are hesitant about getting their young children vaccinated. The truth is that healthy people under a certain age really are at an astronomically low risk against the virus. As for the vaccine, even though the overwhelming scientific consensus is that it's safe, there's no way of telling with 100% certainty that there will be no negative side effects to it down the line.\n\nOf course, I would argue that even if the extremely low risk to your health of getting vaccinated is slightly higher than the risk of facing long-lasting effects as a result of covid, you should still absolutely get vaccinated to prevent yourself from potentially spreading the disease to less vulnerable people and contributing to the development of new strains. But, as I said, I get the concern. Parents are literally biologically predisposed to worrying about their children and in a lot of cases I don't think there's anything \"political\" about that worry.",
            "title_similarity": "0.72587585",
            "sentiment_compound": -0.7643
        },
        {
            "id": "hltix3j",
            "score": 1,
            "text": "There are vaccines that some companies produced that below a certain age, sex, or combination of the two, pose a greater risk to health than the virus itself.\n\n[AstraZeneca](https://www.cbc.ca/news/health/canada-suspends-astrazeneca-vaccine-covid-19-1.5968657) is not suitable for those under 55, even when the country was facing vaccine supply shortages, administration of the vaccine was suspended to those at risk.\n\nWhereas the [Pfizer and Moderna](https://www.cbc.ca/news/politics/pfizer-vaccine-children-1.6253616) vaccines are only expected to be approved for people under 12 in the coming months.\n\nThis isnt right-wing politics, it's literally the government itself. I couldn't get an AztraZeneca shot even if I tried.\n\nThe government is making these decision based on science and medicine.\n\nEdit: For clarity, I'm Canadian. This is all regarding the situation in Canada.",
            "title_similarity": "0.72450876",
            "sentiment_compound": 0.296
        },
        {
            "id": "hltmemt",
            "score": 1,
            "text": ">Edit- i would add that any irrational, non-credible reason would be included with political, even though I only specified political. Whether it's fear, conspiracy, or anything along those lines\n\nThis completely changes the argument. With this, the argument becomes one of validity of a persons fears. With a political argument, the refusal is based not on the information presented, rather on blind political affiliation (republicans do not vax while democrats do). When including anything irrational, including fear, it can very well be based on the facts, even if it is not rational. \n\nIf a person is afraid of flying because they dont want to risk crashing, is that fear invalid because the scientific consensus says that flying is safe? Do we force (or brow beat) them into flying? \n\nWe could ask the same of any fear that an individual may have. Just because a person has what others may consider to be an irrational fear of something does not render that fear invalid. \n\nI think it's helpful to view it through the lens of informed consent. More specifically, why informed consent is necessary. The entire purpose of informed consent is to allow the individual to make their own decision based on the available facts, including potential risks and side effects. What we do not do is say that once something is considered generally \"safe\" or \"good\" or \"best\" by consensus that it overrides personal choice. \n\nIn a medical example: a person's doctor recommends they have a heart bypass surgery. As part of receiving consent for that surgery, the doctor has to tell the patient that there is a risk of death during the operation. If the person determines the risk of death during the operation outweighs the risk of not having the surgery, do we declare that belief invalid and force (or shame) them to have the surgery?",
            "title_similarity": "0.7608931",
            "sentiment_compound": -0.9712
        },
        {
            "id": "hltmifs",
            "score": 1,
            "text": "I firmly believe that my father has turned antivaccine conservative because that's easier than telling everyone that an ex-marine is afraid of needles...",
            "title_similarity": "0.68439734",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hltnw70",
            "score": 1,
            "text": "It's hard to get quality numbers because the rates of both events are so small, but [the myocarditis risk is highest among very young males](https://www.cdc.gov/mmwr/volumes/70/wr/mm7027e2.htm) as [covid risk is extremely low among very young people](https://pyxis.nymag.com/v1/imgs/b23/07e/7357e5b8ed02b63e358afc4121fd30a570-chart-1.w710.jpg). It's entirely possible that at some point those lines cross and there's an age between 2 and 18 where the decreased risk of severe covid is not worth the increased risk of myocarditis. This is especially true given that the myocarditis risk is heavily associated with the second vaccine dose, most of the benefits of the mRNA vaccines if conferred by the first dose. \n\nIf I had a male child in the 2-18 age range, as I understand the numbers currently, I would not choose for him to receive the second dose. Obviously that's a fairly specific set of facts, but you're asking for \"any opposition to the Covid vaccine.\" \n\nThis is a thread giving much the same argument by an MD and self-proclaimed \"lifelong progressive\" MD: \n\nhttps://twitter.com/VPrasadMDMPH/status/1442980835758542859?s=20",
            "title_similarity": "0.42967445",
            "sentiment_compound": -0.9242
        },
        {
            "id": "hltql84",
            "score": 1,
            "text": "Are you including vaccinating young children in this, because the data is not abundantly clear that the myocarditis tradeoff is worthwhile https://www.medpagetoday.com/opinion/marty-makary/93029",
            "title_similarity": "0.6108379",
            "sentiment_compound": 0.0557
        },
        {
            "id": "hltrdbe",
            "score": -1,
            "text": "[Vigiaccess](http://vigiaccess.org/) \n\nThis is a source for you to look at that is deemed credible by WHO. You can look at the reported adverse effects for the COVID-19 vaccines and compare them with all the others that've existed for many years. The difference is astounding. They say these numbers don't indicate anything but they do for me. \n\nI'll also note that beliefs can come from social experiences as well. Stories you hear from people around you. For myself I've had several people in my circle experience various side effects. The ratio wasn't adding up to media numbers and that certainly influenced my position.\n\nAnother thing: not sure what it's like in other countries but in Canada directives were changing regularly. First AZ was safe and they were pushing everyone to get it because there was an abundance of supply. Suddenly they find out its not anymore and it's withdrawn. When there was a shortage of Pfizer they said it was okay to mix doses, days later WHO recommends against it, obviously that creates confusion. Next they discover moderna is unsafe for 18-25 year old and recommend against it. You gotta admit that these frequent changes can create distrust and uncertainty. Rightfully so. It gives the impression that we really don't know everything, even though we claim to.\n\nAll that aside, I really believe it's an individual decision. No should be shamed for it or have their livelihoods threatened.",
            "title_similarity": "0.66301316",
            "sentiment_compound": 0.4601
        },
        {
            "id": "hltss7u",
            "score": -1,
            "text": "More people died in the clinical trial in the vaccine group than the control group for Pfizer I think it was., if you look at all cause mortality, based on the clinical data  that could be one reason to be skeptical.  https://www.theburningplatform.com/2021/11/17/more-people-died-in-the-key-clinical-trial-for-pfizers-covid-vaccine-than-the-company-publicly-reported/\n\nAs well as the FDA wanting 55 years before they fully release the Pfizer clinical trial data https://www.reuters.com/legal/government/wait-what-fda-wants-55-years-process-foia-request-over-vaccine-data-2021-11-18/",
            "title_similarity": "0.6168354",
            "sentiment_compound": -0.6222
        },
        {
            "id": "hltu2p4",
            "score": 1,
            "text": "There is a credible whistleblower claim currently being litigated that Pfizer falsified its clinical trial data. Furthermore, in response to this and the sudden renewed interest in the FDA releasing pfizers clinical trial data as required by law, the FDA suggested that it would take around 70 years for them to finish the process. You don't have to be a rocket scientist to smell something fishy going on there. Will the obvious conspiracy turn out to be true? Maybe, maybe not. But you don't have to be a republican to see how that level of regulatory capture and total opacity is going to cause some concerns.\n\nFurthermore, are you aware that many countries in Europe are currently banning the vaccine for people under 30? This is not nearly as settled as American Media would have you believe. While the absolute risks are still fairly low, the relative risks of the vaccine versus covid don't actually make a lot of sense for young healthy people.",
            "title_similarity": "0.7321743",
            "sentiment_compound": -0.594
        },
        {
            "id": "hltvn72",
            "score": -1,
            "text": "Well, the vaccines are safe and effective, so you aren't going to find any science-based opposition to them and it was silly to ask. That question is asked and answered thoroughly within the scientific community itself, which is inherently adversarial, before these things become mainstream consensus. If the scientists are wrong, other scientists will be the ones to figure it out, and they'll do it via credible arguments and evidence in scientific journals. There has never been a case in which the modern scientific community unanimously got something wrong after expressing this much confidence, and the ones who understood the truth all along were contrarian podcasters and Youtubers and Facebook Karens. That never, ever happens.\n\nHowever, there might be one non-rightwing perspective against vaccines, which is cold-hearted but not as irrational as the arguments emanating from the right. Look at what humans, and especially rightwing humans, are doing to the fate of our descendants and the rest of the species on the planet. Thinning out our numbers will slow that down. And what better way to thin our numbers than a virus that, thanks to the vaccine, pretty much only kills right-wingers? Every right-wing antivaxxer who slowly chokes to death on his own lung fluid is one less vote for Trump in 2024.\n\nI still don't like this argument because this rightwing mass suicide movement is too inconvenient for the rest of us (affecting the quality and availability of other health care, probably raising insurance rates in the future, stressing medical workers, occasionally killing somebody immunocompromised in a breakthrough case, etc) and risks facilitating the evolution of a new, more vaccine-resistant variant. Nevertheless, the fact that the anti-vax movement has basically aimed the virus like a laser at people we could do without is probably the best argument against trying to get them all vaccinated. And at least it offers a \"look on the bright side\" perspective on an otherwise tragic chapter in history.",
            "title_similarity": "0.75946283",
            "sentiment_compound": -0.9676
        },
        {
            "id": "hltwj98",
            "score": -1,
            "text": "REAL sources if anyone wants them \n\nhttps://open.spotify.com/episode/1XfkXVdj3PKn0QVczyVs0G?si=2_dwr99dTZmD6fxyrefUeA\n\nhttps://open.spotify.com/episode/6rAgS1KiUvLRNP4HfUePpA?si=UZBsnsVmQta2GQkt-K1khA\n\nhttps://www.justtheinserts.com/",
            "title_similarity": "0.41242343",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltywuh",
            "score": -1,
            "text": "If you believe in science you understand that time is the most empirical source of evidence (aka wait and see till there is lots of data available), while there is few arguments to be made against the science, it's still a fact that for young people like me have almost no benefit from taking a vaccine compared to my immune system. I know 0 people who got covid from my age group or below that felt worse than let's say the annual flu yet nobody takes a vaccine for it except old people. Why should a 12 year old be forced to take an early version of a widely available VACCINE of all things? It's hard to take the whole thing serious with all of the other dynamics that have taken place since the start, both political and science related subjects. Taking the vaccine simply won't make the virus go away, it will only mean we are forced to take it every 6 months now for the rest of our lives. This isn't a political statement but the way you react to it can make a big difference for all future pandemics.",
            "title_similarity": "0.7325196",
            "sentiment_compound": -0.7093
        },
        {
            "id": "hltzqqe",
            "score": 1,
            "text": "I know plenty of people who are apolitical and just do not want the government forcing this on them.",
            "title_similarity": "0.65910435",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hlu0r4p",
            "score": 1,
            "text": "My sister in law is as far left as one can get.   And isn't vaccinated.  Had covid early on.  So, natural immunity.   Which lasts about as long as the vaccine.",
            "title_similarity": "0.64264786",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hlu1b0z",
            "score": 1,
            "text": "Here’s my view.\nI’m young, healthy, fit and have no underlying health issues.\nStatistically speaking I am at such a low risk of not only getting sick but being hospitalised.\n\nThe only argument I have heard for why I should be vaccinated is moral and emotional blackmail reasons.",
            "title_similarity": "0.57209355",
            "sentiment_compound": -0.1528
        },
        {
            "id": "hlu4z6e",
            "score": 1,
            "text": "1. What’s your take on Steve Kirschs views? They look at official stats and also talked to the FDA that the vaccines are more risky for kids than getting Covid — yet we are seeing several countries pushing this. Why?\n\n2. How can it principally be true that vaccines against a fast evolving virus are supposed to be the only way out? Natural immunity certainly should be considered as it’s been proven in several peer reviewed studies to be the most robust form of immunization. It seems unscientific to push for 100% vaccination rates when ca 40% of the US population already had antibodies against Covid due to prior infection.\n\n3. Science has gotten it wrong in the past, the problem are us humans and our ego. Scientists have a reputation to worry about. They are humans in the end too and even high intelligence does not ensure immunity against group think and other logical fallacies. There are also trends in science which determines what solutions are pursued. Take fertilizers and gen edited crops. They work (under certain conditions), it’s science, but when applied to our environment and society, hundreds of farmers in India committed suicide due to failed harvest because Monsanto pushed their solutions into those markets. You have ecological farmers saying they can achieve higher and better crops without using pesticides and artificial fertilizer by using crop rotation… others are convinced in modern technology - we have the same situation with vaccines and medical experts today. Most believe in the new solutions others would have preferred stronger investigations on proven and existing medications. \n\n4. What if our system as it’s operating currently cannot produce a „sensible“ solution but can only produce a profitable solution instead? It’s a pattern we saw in this and other industries happening as well. If a repeated convicted pedophile worked in a kindergarten, would you feel comfortable sending your kids there? It’s how I feel about big corporations. I consider this not a political view,\n\n5. You point out right wing media- sure it’s a problem but what are neutral sources then? What makes CNN neutral when Pfizer is one of their biggest sponsors?\n\n6. Objective science is a theoretical construct. If all and the biggest research is funded by pharmaceutical companies while smaller independent studies showing cheap and alternative treatments (antiviral mouthwash, aspirin, vitamin D3 and K2 and others), these don’t find as much attention it seems. Most researchers aren’t free in what they find out. In fact some got fired when finding the wrong things like during the initial Pfizer vaccine study: https://www.bmj.com/content/375/bmj.n2635\n\n7. Science on these vaccines is still ongoing and inconclusive in many follow up aspects when it comes to unforeseen side and long term effects. There is a working hypothesis at the moment but — the promise what these vaccines could achieve have been revised several times now. This combined with 3. and 4. can make people feel unsure about the situation. It’s not a political resentment.",
            "title_similarity": "0.7717674",
            "sentiment_compound": 0.9797
        },
        {
            "id": "hlvedff",
            "score": -1,
            "text": "With regards to the mRNA vaccines, we still do not have any medium to long term data. It is a relatively new technology that, if I recall correctly, was first approved for use (not in a clinical trial) last year. \n\nFurthermore, there have been some reports, I don't know how true, that teenage boys have higher chances of being hospitalised from getting the mRNA vaccine than being hospitalised from covid. If I were a teenage boy and I saw that, chances are, I'm not going to willingly give myself a higher chance of landing in the hospital.",
            "title_similarity": "0.6414833",
            "sentiment_compound": 0.6209
        },
        {
            "id": "hlvevnz",
            "score": -1,
            "text": "How can we change your views on something we know nothing about? How can I determine something to be “political” if your just say a general scenario?",
            "title_similarity": "0.64062",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlvm4ro",
            "score": -1,
            "text": "I was just banned from r/Alberta a literal Reddit that is supposed to highlight Alberta in context to tourism and trade and community and weather and sports because I said I didn’t agree with giving the vax to 5y/o kids.\nI guess opinion is bad unless it’s theirs.",
            "title_similarity": "0.7600737",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hlvqppd",
            "score": -1,
            "text": "Apolitical anti-vaxxer here: for me (and anyone else I know who hasn’t gotten jt yet), it’s less an issue of “reasons not to get the vaccine” and more an issue of “lack of reasons to get it.” Actually looking for someone to sell me on getting the jab - CMV!\n1. For someone like myself, I already had Covid before the vaccine came out. Very mild symptoms, common cold was worse personally. (I don’t have any health problems and am 24, so I don’t fall into any high risk demographic.) Since then, I’ve gotten Delta and again, no issues. The risk of being hospitalized or dying from another round of it are, for myself, effectively 0%, and I’m quite apathetic to whether I get it again. Thus, there isn’t any motivation for me to get it from a personal safety standpoint. \n2. I’d be inclined to get the vax if I felt like there was a chance I could pass covid along to others who were high risk individuals, and legitimately might face hospitalization or death if they contracted covid (the whole flatten the curb mentality). But at this point, everyone can get the vaccine if they want to, which, based on what the government is telling us, prevents against hospitalization and death (as I understand it). By my logic, either (1) what the government is saying about the vaccine’s effectiveness is true, in which case I’m not posing a life-threatening risk to anyone else who cared enough ab covid risks to get vaxxed, or (2) the vaccine isn’t effective in preventing hospitalizations/death as the government has been saying for some time, in which case I am inclined to question another aspects of the government’s characterization of the vaccine, like the minuscule degree of risk attached/general effectiveness.\n3.  If you’re unvaxxed, that’s a risk you’ve chosen to bear, not one other people should have to accommodate you for. I assume most people who haven’t gotten vaxxed yet, like myself, would not want other people to get vaxxed on their behalf.\n4. Given all this, i struggle to see how the “benefits of vaccination outweigh its risks,” as the government phrases it. As this thread points out, there’s of course a degree of uncertainty w the long term effects of the vaccine, however slight .. as I imagine anyone would be at least willing to acknowledge. How significantly you weigh the validity of these risks compared to your risk assessment of contracting severe covid effects is specific to each person - for me personally, given I’ve had covid twice and been fine (death by covid risk = 0%), I tend to weigh the vaccine uncertainty risk slightly higher (though I believe it’s still a very slim risk). As I mentioned above, now that the vaccine is available & the risk of hospitalization/death is off the table, the argument to get it for others people’s benefit isn’t any more convincing than the reasons to get the annual flu shot (ie, you risk contracting the virus and getting others sick for a few days), which many people go without. \n\nIt seems to me a personal calculus at this point: if you’re worried about severe side effects of covid, get vaxxed; if you’re not, don’t.",
            "title_similarity": "0.73814535",
            "sentiment_compound": -0.9913
        },
        {
            "id": "hlw6kkp",
            "score": -1,
            "text": "Lack of trust in those in power is not political. I don't care who is in power when they use one idea and don't allow criticism it is scary. \n\nIf this was a hotly contested issue I would actually be able to relax far more but it seems that we only ever hear what the powers at be want us to and its only half of the story.\n\nThe rhetoric around people being hesitant over the vaccine is that they are anti vaxers(which until very recently meant something else) and are evil vile people. In most case they are just people that are scared and don't trust what they have been told.\n\nI probably sound  like a conspiracy nut which I am not. I do have a very solid rule I follow though in life. Never just trust the person trying to sell you something. It's recently come to light that the trials for the vaccine were no where near as clean as we were all lead to belive,  why was that kept from us? Why should we blindly trust when we are decived?",
            "title_similarity": "0.7761127",
            "sentiment_compound": -0.9749
        },
        {
            "id": "hmexqvd",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.09164293"
        },
        {
            "id": "hlsrdgh",
            "score": 83,
            "text": "A lot of the older Black Americans were/are opposed to getting vaccinated because of the gov's history with experimentation on Black people.  I've even heard some say they think there is a valid shot, but the gov will not give that one to black people, they will get some other experiment drug.\n\nSince it is the gov, it walks a fine line on political, but I think for them it's more of a trust issue, since it wouldn't matter who's in office.",
            "title_similarity": "0.7178265",
            "sentiment_compound": 0.7866
        },
        {
            "id": "hlsv9m8",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "0.07080051"
        },
        {
            "id": "hlt0kes",
            "score": -2,
            "text": "You might want to specify which vacines, for example, I wouldn't take the Russian vacine, Sputnik V, because there are legitimate reports, including from the WHO, questioning the data provided by the Russian claiming a 91-97% efficacy, even Putin himself wouldn't take this vacine, and when he did, he did it in private and then claimed to have used the Sputnik.\n\n[Here's a link if you're interested, though I'm not sure how biased this site might be.](https://carnegieendowment.org/2021/11/15/what-went-wrong-with-russia-s-sputnik-v-vaccine-rollout-pub-85783)\n\nAt the same time I also wouldn't take the Chinese vacines, though that is a more distant concern since they were never offered in my country, for much the same reasons, sketchy data and dubious claims.\n\nIt's okay to be opposed to some vaccines, but the AstraZeneca, Oxford, Pfizer, et al, I agree with your premise, they have clear and verifiable test data, any opposition toward these vaccines is purely political.",
            "title_similarity": "0.7424145",
            "sentiment_compound": 0.795
        },
        {
            "id": "hlt12ek",
            "score": 2,
            "text": "I went in for blood work at my doctor's office and while we were talking he said it would be better for me to wait to get a vaccine. He explained that there is a small risk with younger males having issues with fertility after taking the vaccine, and that I most likely still have antibodies protecting my immune system from previously having covid. He said that there is a newer vaccine that is in development that is supposed be better somehow and that if possible I should wait for this one to be available.",
            "title_similarity": "0.68849504",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hlthzdb",
            "score": 2,
            "text": "It might help you to consider sources that are not American because what you say definitely isn’t true everywhere else, and even if it were, political affiliations are different.\n\nFor example where I live there are people who are against the vaccine who were pretty leftwing yoga hippies. But they believe in the bodies ability to heal, and not in big pharma. They also are very much up their own arse. \nThis has driven them to one specific party yes, but that is because their vaccine stance was already there.",
            "title_similarity": "0.8301038",
            "sentiment_compound": 0.9408
        },
        {
            "id": "hltixa2",
            "score": 2,
            "text": "“My body my choice” is not political. \n\nPeople choose or choose not to get laser eye correctional surgery because it’s their choice, not their politics. \n\nPeople choose or choose not to get flu shots because it’s their choice, not their politics. \n\nWomen choose or choose not to get abortions because it’s their choice, not their politics.",
            "title_similarity": "0.6854682",
            "sentiment_compound": 0.2924
        },
        {
            "id": "hltjqxi",
            "score": -2,
            "text": "Joe Rogan. He is against the vaccine not because of politics.  He is against the vaccine out of spite. At first he kept questioning if the vaccine is even effective because his fan base turned on him for leaving CA to TX to escape paying taxes on his Spotify deal. Just to play devil's advocate and be a contrarian.\n\nThen everyone started making fun of him for it. Recently it went as far as Saturday Night Live doing a sketch about it. The more these jokes are made at his expense and the more people these jokes reach, the harder he fights back against the vaccine. Every week it will be a different reason why the vaccine is bad and every week he fights harder and sounds angrier. The more people joke about him, the more he advocates against the vaccine.\n\nIt doesn't seem to be political. He is just butt hurt and he wants to use his platform to hurt everyone back by doing what he can do to make this pandemic last longer and take more lives.\n\nFor instance, he used to keep advocating people eat an all meat diet. Then a researcher went on his show and told him to stop. Although rare, an all meat diet can actually kill people who have a certain condition. Joe continuously advocating for it, will harm those people. Joe stopped and always prefaces this fact when he starts speaking about that diet now. Joe is capable of understand what he says can hurt people. He knows that he is hurting people by spreading misinformation about the vaccine. He does it on purpose because he is hurt from people making fun of him. Height, awful comedy, vaccine misinformation, sexuality... All of it",
            "title_similarity": "0.7347272",
            "sentiment_compound": -0.9663
        },
        {
            "id": "hltkh6s",
            "score": 2,
            "text": "What about people who have tested positive, recovered, and won't get the vaccine.  \n\nI have friends like this, haven't come up with a good argument to \"natural immunity\" that doesn't make me sound like someone pushing the status quo.  \n\nDon't get me wrong, probably most vax opposition is politically motivated.  But the \"why got a shot when I already had it\" is coming from a democrat",
            "title_similarity": "0.78996015",
            "sentiment_compound": 0.8617
        },
        {
            "id": "hlto9j7",
            "score": 2,
            "text": "To preface because this is Reddit, I got my vaccine as soon as I was eligible. I've been following the Moderna vaccine since March 2020, reading up on the science, the history of mRNA medication research, immunology, all that good stuff. I think it's *fascinating* and the mRNA vaccines are a miracle of modern science by being both incredibly effective *and* very safe by nature. I encourage everybody to strongly consider getting their vaccine.\n\nThat all said, here's a few arguments I've heard that I think are reasonable:\n\n* Why *would* I get the vaccine? Local case counts are low, I'm a very healthy and active person in my mid 20s. My parents all caught Covid with little to no side effects, I'm testing myself frequently. I have next to zero reason to fear catching or spreading the virus. I'd rather take my chances with the virus.\n* The side effects suck. I don't want to deal with that. More advanced: I think (because I don't understand the science or trust the general narrative) that the vaccines make you sick.\n* I generally have anxiety with needles and medication (*I want to point out this is one I've seen firsthand - a close friend of mine had a VERY bad time after her vaccine - shortness of breath, memory loss, etc. Not because of the vaccine itself but because of the anxiety getting it brought on*).\n* (**EDIT**) Everyone I know who's had Covid was fine, *I* already had Covid and was fine, I don't have any problems with the vaccine but it's not even worth the 30 minute errand to get it.\n\n***EDIT*** *- some of those are pretty bad reasons, but I still think it's important to be respectful of people who feel that way.*\n\n**THAT SAID** \\- the benefits of the vaccine *strongly* outweigh the cons. I personally still think it's a great idea for everybody to get vaccinated, but ultimately this is based on *my* perspective and *my* research, and I don't expect everybody to come to the same conclusions:\n\n* Covid disables parts of the immune system as part of the infection, and natural immunity has been shown to be less effective than vaccine immunity (so far).\n* The vaccine side effects are *nothing* compared to even moderate Covid sickness.\n* There's very few places where \"local case counts are low\" is actually a compelling argument - the virus is still very present, even here in the San Francisco bay area with >80% vaccination rates.\n* At this point tens/hundreds of millions of people have been vaccinated for up to a year now. I think we can put the \"dangerous side effects\" thing down, and hopefully people who are anxious about it can be comforted by knowing how crazy many people have been totally fine after a day of fever after getting their jab.",
            "title_similarity": "0.68300444",
            "sentiment_compound": 0.9874
        },
        {
            "id": "hltwgsf",
            "score": 2,
            "text": "My opposition to the vaccine is largely political and tied to the overbearing governmental and social pressure to get it. \n\nBut that aside, there are some medical reasons not to get it as well. First, by the traditional (pre-2020) definition of \"vaccine\" this is not a vaccine - it's a theraputic. The CDC literally changed the definition of vaccine so this medicine would qualify, to encourage people to take it. The difference between a vaccine and a theraputic is that this doesn't stop you from getting or transmitting the disease. Rather, it lessens symptoms, potentially keeping you out of the hospital. Having already had COVID, I am comfortable with the risk of getting it again. And I don't want to go in for 2-3 needle shots, which may make me feel just as sick as the virus itself.",
            "title_similarity": "0.80256367",
            "sentiment_compound": 0.7049
        },
        {
            "id": "hlty4c5",
            "score": 2,
            "text": "Not really .... let me give u some scientific and medical reasons: \n\n\\- today AstraZeneca and Johnson Johson vaccines are not being enrolled in many countries due to side effects of blood clotting. \n\n\\-today many countries banned mixing of moderna and phizer vaccines  \n\nNot long ago, these vaccines and rules were not enlisted until these effects occured, its still a learning process. People understand normally vaccines have years of testing before enrolled and we can see the side effects of this happening right now! Who's to say their are going to be more dangerous effects in the future?? Especially with now the 3rd dose and booster shots, and drugs incoming. \n\n\\- My friend says he shouldn't have to get the vaccine bc he has a 99.99% survival rate and even if he gets sick his immunity is strong enough to deal with the virus and the sickness without dying or going to the ICU. Only vulnerable people should get the vaccine and the drugs. \n\nThis assessment is fair as the threat of this virus is for people who are actually vulnerable and  asymptomatic hosts that can spread without displaying symptoms. The death rate is very low for this virus. \n\nMy belief is that our fundamental idea of gettting this vaccine should be to protect the weak. Don't question it, just get it. Think about the safety of your own family when getting it.",
            "title_similarity": "0.76493037",
            "sentiment_compound": -0.9107
        },
        {
            "id": "hltzit0",
            "score": 2,
            "text": "I don't recognize my opinion as politically biased but I just don't trust the government in general and how they've gone about the vaccine is just so sus I can't bring myself to get it just yet. Like a judge offering less time for a prisoner that gets the vaccine, or places I've worked like kroger offering you money if you get it. It just doesn't seem right to me, I'd like to wait for the symptoms list plz. FDA approved means literally nothing in terms of our health safety as being that most of our FDA approved foods have known carcinogens in almost everything along with many more poisons lol.\n\nEdit: In the US.",
            "title_similarity": "0.7944719",
            "sentiment_compound": 0.8772
        },
        {
            "id": "hlu9tro",
            "score": 2,
            "text": "Everyone is saying to trust the doctors unquestionally as they are the experts.\n\nMy mom was prescribed Ambien when I was a kid. The FDA approved the medication as safe. She asked repeatedly if it was addictive and she was assured it was safe and had only mild symptoms.\n\n\nIt took her over a decade to get off of it because every time she tried to go off it (with her Dr't cooperation) she got so violently ill that she ended up in the intensive care for a week each time. A year after it was prescribed the phase 4 clinical trials found it to be much less safe then they originally thought.\n\n\nI have several family friends that were prescribed opiates post surgery/other events. They were assured by their doctors that it was perfectly safe. They followed their doctor's instructions to the letter but still ended up with horrible addictions. When the state restricted opiate use they were cut off without being weaned off. One committed suicide because the withdrawals were too bad, two turned to the black market and their lives fell apart to heroin. The last one is still having massive cravings years later and it's a constant struggle.\n\n\nMy grandfather was prescribed tobacco. He took it as prescribed. He never escaped that addiction.\n\n\nNo one went to jail over any of these issues. Not the pharacuticals, not any of the doctors, the fines were less then the profits made, no one was held accountable.\n\nPeople say to trust the doctors as they are the experts.\n\nWe generally don't take any medications until they finish stage 4 trials. We have had too much grief from new drugs the doctors said were \"perfectly safe\". This isn't too say we don't trust doctors or modern medicine, it's generally extremely effective. We however don't trust that the stage 1-3 studies done by the pharmaceuticals are a reliable metric of safety.\n\nFor people who say that vaccines are perfectly safe look up the recent \"dengvaxia controversy\". Vaccines in general are EXTREMELY safe. Every once in a while however you get a bad vaccine and the new MRNA vaccines do not have long term studies on them (the 12 year studies on the drug when it's actually on the market and the pharmaceuticals can't try and manipulate the data)\n\nFor people who say I'm just antivax, I have gotten all of my recommended vaccines and encourage my friends to give their children their recommended vaccines. Also vaccines do not cause autism. I am saying that all new medications (including vaccines) have risks associated with them and being wary of new drugs until stage 4 trials are finished is a safe rule of thumb although there are exceptions to the rule.",
            "title_similarity": "0.6078695",
            "sentiment_compound": 0.9572
        },
        {
            "id": "hlw3p0n",
            "score": -2,
            "text": "How come I know people how are vaccinated and yet are the ones spreading disease? \n\nAnd their symptoms are no better or worse as people who are catching the virus.  Seen by experience.  From people I know. \n\nSo what’s the point of the vac again?",
            "title_similarity": "0.687076",
            "sentiment_compound": 0.1301
        },
        {
            "id": "hlsv11b",
            "score": 27,
            "text": "A good friend of mine in Sweden was advised by his doctor recently to not take his second dose of MRNA vaccine due to the potential heart complications that could come with it. Granted my friend has a history of heart issues, so this is a special case. However, it is 100% non political, science and date based decision.\n\nOver here in Canada, I’ve read that they may be rolling back on one of the mRNA vaccine due to myocarditis risks among young men. Which is another decision that is entirely science and data driven.\n\nI’m vaccinated myself after seeing reviewing some numbers, but I’ve always held the opinion that a pro-vaxxer is just the opposite side of the same coin as an anti-vaxxer. You should always judge things like this case by case, and it’s a fact that we didn’t know much about the Covid Vaccine until recently.",
            "title_similarity": "0.74781716",
            "sentiment_compound": 0.9246
        },
        {
            "id": "hlsn5wr",
            "score": 74,
            "text": "There are multiple levels to the anti-COVID vaccine.\n\nPsychological level - even the smallest side effects from the vaccine seem 'closer/realistic' because you 'have to take it'. At the same time, although the consequences of COVID are more serious, they seem more distant because of 'what if I avoid getting sick/it will not affect me' mentality. 'You are forcing something on me what may cause me harm, hence you want to harm me'.,\n\nEmotional level - people are afraid, uncertain and confused. They want/-ed answers and there were no answers initially. And then the answers changed a lot, restrictions and precaution measures changed a lot. And now the same people are saying that the vaccines are fine. What if they have 'messed up' again? How can I trust them, when they 'lied' initially?\n\nInformation level - when people don't get answers, they look for them. And lot of people are not critical towards the information they read. Or there is no factually correct information in the media they read a lot (quite often the lowest vaccination rates are among minorities due to the lack of communication in their languages). The propaganda channels and fishy sites always are willing to give sure answers, regardless how wrong they are. And people need/-ed  clear answers.\n\nPolitical level - people who abuse other people fears to gather political support. aka. populists.",
            "title_similarity": "0.6985642",
            "sentiment_compound": -0.9743
        },
        {
            "id": "hlsvwdj",
            "score": 3,
            "text": "If that were true then there would be no vaccine hesitance on the left which is clearly not the case. \n\nGranted, the Covid vaccine specifically carries political implications for the right (for some strange reason) so the majority of unvaccinated are politically right, but there are still plenty of antivaxxers on the left as well. In fact, the broader antivax movement really started on the left as a product of naturalism.",
            "title_similarity": "0.8371067",
            "sentiment_compound": 0.5208
        },
        {
            "id": "hltfjwo",
            "score": 4,
            "text": "I think its ignorant to judge someone based on only 1 decision that they have made.",
            "title_similarity": "0.4428087",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hlts4wa",
            "score": 3,
            "text": "My opposition isn't political - it's financial and legal. Will not participate in a Phase 3 drug without financial compensation. Nor will I give up all legal rights in the event I should suffer and adverse event. Basic common sense",
            "title_similarity": "0.6391747",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hlt3rkc",
            "score": 4,
            "text": "The trouble with your view is that it doesn’t adequately deal with the is-ought gap. Science, and by extension medicine, can tell you what *is*. It can tell you about what the world is like, and so it can tell you what would happen if someone got vaccinated. However, what politics is, is entirely in the realm of what ‘ought’ to be. One may, at a very basic level, disagree that humans should try to stay alive. Someone with such a premise would oppose the vaccine, and no amount of science or medicine could convince them otherwise. Science does not provide prescriptions for how someone should act, ethics do.",
            "title_similarity": "0.8267396",
            "sentiment_compound": -0.1689
        },
        {
            "id": "hltw9j6",
            "score": 3,
            "text": "1) vaccine hesitancy for newly developed should not be surprising. History shows rushed, widespread rollouts of new vaccines often were dumpster fires in the beginning, polio being probably the most obvious example. The true rollout took years, with false starts and unintentional infections of thousands and thousands of people. Anything new, medically, will naturally have some hesitancy as no one truly knows what to expect and not everyone has the same risk tolerance.\n\n2) vaccine opposition from those who have already acquired natural immunity should be expected. They have already acquired effective immunity, and there is no valid reason for someone to have a medical treatment for something that no longer applies to them. \n\n3) vaccine hesitancy due to general lack of blind trust in institutions should not be surprising. Appealing to “credible medical sources” is nothing but an appeal to authority in their view. You won’t win that debate by anything other than data and patience.",
            "title_similarity": "0.72345376",
            "sentiment_compound": 0.4737
        },
        {
            "id": "hltqbcy",
            "score": 7,
            "text": "I’m waiting for a long term study to be done on the drug. It has nothing to do with politics. I am not in a demographic that is at risk of dying from COVID. I do however, read long term studies about side effects. This started after someone I knew very closely committed suicide while on an anxiety medications. This has nothing to do with politics and it’s very worrisome for anyone to think that everyone should just take a drug without knowing long term risks/side effects.",
            "title_similarity": "0.7456718",
            "sentiment_compound": -0.8473
        },
        {
            "id": "hlutt6l",
            "score": 6,
            "text": "So - I'm vaccine hesitant at best. I am currently opposed in some situations. My reasons aren't political. Instead, I view the whole current setup as the cart running before the horse.\n\nBasic setup - we're in the midst of the pandemic and I presume everyone is really trying their best to use the available information to make the best decisions they can. Unfortunately - the information we have is subject to revision as new data becomes available and I frankly don't think enough weight is being put on what we KNOW about immunity and coronaviruses through decades of multinational study. All your accusations of political influence against vaccines I would argue also work for the EXCESSIVELY pro vaccine. The non-political sources I've found agree that the average person not yet exposed to COVID would likely benefit from the vaccine - from there, they differ on how big the benefit is, whether previously infected still need to get a vaccine, etc. The US political sources are basically \"everyone should get vaccinated without exception\" and that is where I think a lot of the rub is.\n\n1. Fact 1 - long term safety studies on vaccines run a minimum of 2 years (often more), typically they run after initial safety and efficacy trials that ran 2-3 years - meaning when a vaccine goes to market, we've almost always been on year 5 or later of the vaccine having been in a monitored population. [Source](https://coronavirus.jhu.edu/vaccines/timeline) - I'm hesitant because the full approval for the COVID vaccine came before full long term trials could be completed. It seemed like a political move, not a scientific move since full approval was given before the standard long term safety data could exist for such a decision. Most discussions I've seen about the long term effects are necessarily based on short term efficacy/safety data because of timing. Why does this matter? There are obviously potentially risks present if shortcuts were taken on safety analysis.\n\n2. Fact 2 - I'm not an early adopter. The cell phones in my house are 2-4 year old models. I don't think I've ever owned a car newer than 4 years old. I don't try new stuff - I let other people be guinea pigs. So, when the government comes out proclaiming new technology is bringing us a vaccine faster than anyone ever thought possible - I'm hesitant to get in line. I was an early adopter as a teen and learned it wasn't worth it to me.  I had COVID a year ago and had cold like symptoms after delta came through my house a few months back (9 mo. after initial infection) - and I watch what appears to be eternal boosters being expected and it just doesn't seem like a reliable vaccine, so I wonder what's the point, since history suggests that when the dust settles we'll likely end up with a 5th coronavirus that gives everyone colds.\n\n3. Fact 3 - In 2019 and prior, there was a wealth of knowledge about various coronaviruses - a few of which we all usually get as babies/young children and future re-infections are simply part of the viruses that produce the common cold. Natural immunity is recognized in coronaviruses, and within COVID-19 is official recognized as existing in various countries around the world [1](https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1) [2](https://pubmed.ncbi.nlm.nih.gov/33408181/) [3](https://pubmed.ncbi.nlm.nih.gov/33777028/) - but the US government acts like natural immunity isn't even a thing that should be discussed. There is something so incredibly anti-science about how the US government is talking about natural immunity as if COVID-19 isn't part of a family of viruses that have been studied extensively for decades and have certain commonalities we can look to as likely with COVID-19, like long lasting partial natural immunity, but future infections after initial infection still resulting in some symptoms, just more mild.\n\nPeople ask: is natural immunity > vaccination, and the CDC starts talking about immunity + vaccine > immunity (yah, we'd expect that - it's like a booster, but they don't answer the question)\nThe US government talks about how not everyone that gets COVID ends up with natural immunity - but that has been true of disease for a long time, and there isn't much solid research to support the idea that your body is going to create an immune response any better from the vaccine than the actual disease it managed to fight off that had the same spike protein you want to inject now. Oh, and there is sometimes public shaming if you point out the same is true of the vaccine - not everyone that gets the vaccines acquire immunity. There's way too much double talk. Because X is true of natural immunity, it's safer to get the vaccine...we'll just ignore the fact that X is more true of the vaccine.\n\nOverall, I think most sane people agree that there is value in the vaccine - especially for immunocompromised, aged, at risk, etc. Unfortunately, I have yet to see the science agree on the rest of what is spouted, especially when you include what the rest of the world is finding out through science.",
            "title_similarity": "0.85200596",
            "sentiment_compound": 0.9974
        },
        {
            "id": "hlsjyfp",
            "score": 530,
            "text": "Just for clarification - are they against the actual vaccine itself, or the proposed vaccine mandates?",
            "title_similarity": "0.66440475",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlszr5t",
            "score": 2,
            "text": "What do you mean \"almost\"?",
            "title_similarity": "-0.021995349",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlt80o2",
            "score": 1,
            "text": "This isn't against the vaccine as a whole, but the jury is kind of out on the utility of boosters right now. 6 months out from your initial shot, the booster mainly provides protection against what will already be most likely an asymptomatic infection, in exchange for a very very small chance at the bad side effects like heart inflammation. If you are a healthy adults there isn't that great an argument that this tradeoff is worth it so that you can go from 30% protected against an infection up to 70%. Which is why the FDA has been dragging it's feet and humming and hawing about allowing boosters for all adults.",
            "title_similarity": "0.6433673",
            "sentiment_compound": 0.8649
        },
        {
            "id": "hltc0rt",
            "score": 2,
            "text": "People are allergic to the vaccine.",
            "title_similarity": "0.5541796",
            "sentiment_compound": -0.296
        },
        {
            "id": "hltcop3",
            "score": 2,
            "text": "There was a specific brand of covid vaccines that caused blood clots in one group at a much higher rate than others, I believe it was young pregnant women. I could be wrong, an opposal to this when you are in this class is completely scientifically and medically based, therefore not political.\n\nNow for a grey area you probably agree with, to those who are immuno compromised or have allergies and do not take a specific vaccine is again based in medicine and science, I wouldn't usually make this point but seeing as you specified any opposition I thought this might be a good one to point out to soften your stance to something more general.",
            "title_similarity": "0.7176647",
            "sentiment_compound": 0.5647
        },
        {
            "id": "hlteheg",
            "score": 1,
            "text": "My opposition to the vaccine is based on the fact that i get a panic attack every time i see a needle, so it took me a while before i got the vaccine and atill havent gotten my second dose, almost die of anxiety on my first dose. Still encourage everyone to take it though",
            "title_similarity": "0.7137039",
            "sentiment_compound": -0.7988
        },
        {
            "id": "hltgci0",
            "score": 2,
            "text": "I think you are somewhat splitting hairs trying to separate politics between the vaccines themselves and the vaccine mandates. Yes, there are many crazy conspiracy theorists who unfoundedly believe these vaccines are toxic bioweapons etc.., but I doubt anyone here would attempt to defend their views. The vast, vast majority of people are not opposed to the vaccine, but are opposed to vaccine mandates, and can do so logically.\n\nPersonally, I'm a young and healthy male who already had a mild case of covid (I got it just before the vaccines were available, was pretty under the weather for 3 days, fully recovered 2-3 weeks on, and confirmed through PCR and multiple antibody tests). My risk for a severe reinfection is incredibly small, likely on the order of my risks from vaccination.\n\nThe university that unenrolled me for not being vaccinated (despite being remote) is not requiring J&J boosters for the coming semester, despite substantial evidence that that vaccine hardly protects against infection 6 months on. They're justification is saying that a booster is not required for their community health, but may provide individual benefits, and therefore that decision to be boosted should be up to the individual.\n\nThis is the exact argument I am making for natural immunity. As someone who is young and healthy and fully recovered from covid, while the vaccine may provide some benefit, the absolute risk is already so extremely low that it is not unreasonable to not get the vaccine. To argue I should get it and be consistent across various risk levels would require living a substantially and unrealistically risk adverse life, as well as to argue for repeated boosters every 4 months or so.",
            "title_similarity": "0.7899538",
            "sentiment_compound": -0.7894
        },
        {
            "id": "hltgtt7",
            "score": 1,
            "text": "I think some vaccine hesitancy is a result of the close ties between politics and private businesses. Many people do not trust the messengers, regardless of politics.",
            "title_similarity": "0.6536299",
            "sentiment_compound": -0.5577
        },
        {
            "id": "hltkpxg",
            "score": 1,
            "text": "SOME of the time, people i talk to who dont like the vaccine dont like it due to the RNA aspect, and just want a more traditional vaccine. it's not really political.",
            "title_similarity": "0.679727",
            "sentiment_compound": -0.4442
        },
        {
            "id": "hltkqef",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.07080051"
        },
        {
            "id": "hltoxcd",
            "score": 1,
            "text": "I wouldn't say any opposition is.  There are bound to be people out there who just don't trust stuff like this and they're probably a-political.  Not many most likely but I'm sure they exist out there somewhere.",
            "title_similarity": "0.6351282",
            "sentiment_compound": 0.1391
        },
        {
            "id": "hltpm83",
            "score": 2,
            "text": "ANY?? Hmm. So someone with a medical problem who physically can’t get it is politically motivated? Interesting",
            "title_similarity": "0.587545",
            "sentiment_compound": 0.5484
        },
        {
            "id": "hltq7j2",
            "score": 1,
            "text": "I don’t get any vaccine that hasn’t been fda approved. My doctor wanted me to take a vaccine a few years back that was not entirely fda approved and I denied it.",
            "title_similarity": "0.64833444",
            "sentiment_compound": -0.3895
        },
        {
            "id": "hlts61f",
            "score": 2,
            "text": "That medicine and science ought to govern society is a political opinion.",
            "title_similarity": "0.6729889",
            "sentiment_compound": 0.0
        },
        {
            "id": "hltvx3b",
            "score": 1,
            "text": "While the political oppositions gets the most publicity, it should not be only concern.\n\nThere is a moral argument about developing nations who are not getting enough vaccines. Countries do not have enough vaccines. Travelers and export companies end up spreading it. \n\nThe quickest way to truly end the pandemic is too make sure those who don't have the vaccine get it. It will help travel. It will also impact the supply chain.",
            "title_similarity": "0.75839007",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hltvxx3",
            "score": 2,
            "text": "Most opposition to the vaccine stems from two things that I can tell:\n\n1. Perception of personal freedom\n2. Distrust/Fear.\n\nThe politics plays on those two motivations. However, I think a lot of it is driven by distrust/fear of the government, distrust/fear of doctors, distrust/fear of big corporations, distrust/fear of the educated, fear of needles, fear of \"how fast\" things were developed, and fear of having something injected in them.\n\nThe politics and news that reports anything that help bolster that distrust/fear only reinforces their distrust/fear. The echo chamber they put themselves in just fans the flames of discourse. Of course these individuals will cite the false information they hear, however, it's not the root cause vaccine opposition. They were going to resist it regardless.\n\nSaying that fear is irrational, is not a valid stance. Nor should that be bundled in as political. Fear is a very valid emotion. If you talk to anyone as anti-vax, I believe you'll find that it seems to stem from some sort of fear.  Worry about future of having kids. Worry about tracking devices. Worry about dying from it.\n\nAs for the former, I guess can say that is a political stance if you so choose. I tend to disagree with that stance, in general.\n\nIf you want to pin this on something, other than fear, then I'd say education is the biggest problem. Lack of education, inability to research a subject properly, and ability to unemotionally rationalize. Those are the main issues.",
            "title_similarity": "0.8356371",
            "sentiment_compound": -0.9847
        },
        {
            "id": "hlu1c85",
            "score": 1,
            "text": "Sorry ahead of time, but this is getting aggravating, especially because all of the people I've been reading claiming to be in science, but apparently never passed the very basic idea of proper research. mRNA is meant to rapidly decay after being taken in by the cell. This is in no way comparable to other cited instances of scientists stating certain chemicals to be safe only for them to be unsafe. Those compounds were meant to be long lasting in the human body which is the opposite of these vaccines. mRNA vaccine technology has been researched since the 90s, so it is in no way new technology, so the argument of 'it's too new' is simply ignorant. \n\nIf you're unsure about something, just fucking find it in a peer reviewed journal. Here's one to start you off:\nhttps://www.nature.com/articles/nrd.2017.243",
            "title_similarity": "0.8045467",
            "sentiment_compound": -0.9248
        },
        {
            "id": "hlu1ch6",
            "score": 1,
            "text": "It’s not always political; it’s often about people not liking being told what to do and then having egos about it. The mob mentality plays into a too, with a lot of public sector union jobs like cops and firefighters having lower rates of vaccination than the population as a whole.",
            "title_similarity": "0.5572506",
            "sentiment_compound": 0.0108
        },
        {
            "id": "hlu1qer",
            "score": 1,
            "text": "My Mom is fairly left on most issues, but was hesitant for a long time about the vaccine because she didn't believe there was enough time testing it. She wasn't right, and we changed her mind, but I think a lot of folks maybe fall into that category of \"not political, but not educated\"",
            "title_similarity": "0.6697354",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hlu22k0",
            "score": 1,
            "text": "Have you looked into Kyle Warner? He is a professional mountainbiker whose career has practically been ruined over a severe and [acknowledged](https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/myocarditis.html) reaction to it. While that certainly is a rare case, as he puts it: \"It doesn't feel rare when it happens to you.\" As a result of the severity of the risk, he advocates that people shouldn't be forced into taking the vaccine because they are the ones that ultimately bear the risk of an adverse reaction to it.",
            "title_similarity": "0.7426229",
            "sentiment_compound": -0.7594
        },
        {
            "id": "hlu2gmb",
            "score": 1,
            "text": "People who are allergic to ingredients found in all mRNA vaccines who don’t want to get the J&J because it is very unsafe for women under the age of 50 \n\n(If you think this is not substantiated by evidence you’re ignorant because the CDC literally drags the j&j on their own government website)",
            "title_similarity": "0.7286422",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hlu35p1",
            "score": 1,
            "text": "The opposition I've seen has been from the people who already have had covid19, which they would have natural immunity. Science has confirmed this through multiple studies, and before the Vaccine, the government's goal (on both sides of the isle) was herd immunity. Now the waning immunity for natural immunity has been an argument but that case can be made for the vaccines as well. I know Republicans that are for the vaccine and Democrats who are against it.",
            "title_similarity": "0.826705",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hlu3mdn",
            "score": 1,
            "text": "Stand corrected op https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1",
            "title_similarity": "0.30223283",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlu3qiu",
            "score": 1,
            "text": "Have you checked the work of Sherry Tenpenny? I’d say that’s a good start. Also check the Vaxxed documentary. Those perspectives aren’t politically motivated and present a compelling case. \n\nAlso there’s plenty of people that have been harmed by vaccines or their families have. Avoiding this vaccine for those reasons isn’t political, it’s based on direct experience. \n\nThere’s plenty of people who simply think Covid isn’t that bad and a vaccine isn’t needed. They generally remain quiet because they aren’t engaged with polite discourse. I’d recommend talking to human beings directly, in person, rather than relying on people who send links to articles from institutions. \n\nPfizer has paid billions of dollars in fines for harming the public. Being concerned about their vaccine because they have a massive criminal history isn’t political.",
            "title_similarity": "0.78752786",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hlu463s",
            "score": 1,
            "text": "What would you consider political? The black community that has a pretty large history of not doing what they are told is severely under vaccinated primarily because they just don't like being told what to do. Is that political?",
            "title_similarity": "0.6204462",
            "sentiment_compound": -0.3116
        },
        {
            "id": "hlu51nv",
            "score": 1,
            "text": "\"Any position\" even people who are taking the vaccine?",
            "title_similarity": "0.6042542",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlu5wfp",
            "score": 1,
            "text": "just a thought as this post might grow but it might be helpful if you listed in your post all the talking points that have already been mentioned , to prevent the same ones being stated again.",
            "title_similarity": "0.54117155",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hlu6pxr",
            "score": 1,
            "text": "I don't think it's entirely political, in fact I think majority of opposition is fuelled by a desire to be \"relevant\" by being opposed to the majority. It matters little that much of the attention gained is negative, it still provides the validation of the illusion of being someone of significance. Even having this discussion here encourages the believe that opposing vaccines is somehow avant-garde when in actual fact it's mind numbingly boring & non-sensical. The best way to deal with those opposing vaccines is to ignore them & offer them no validation. \n\nI'm speaking from a very privileged position of being in a country that has over 16 y.o. at 85%+ full vaxxed. We'll easily achieve 90%+ in coming weeks at these levels those opposing vaccines don't really matter they can fade back into their irrelevant lives.",
            "title_similarity": "0.7701854",
            "sentiment_compound": 0.7847
        },
        {
            "id": "hlu7a9n",
            "score": 1,
            "text": "I wouldn’t quite go so far as to say *any* opposition, and your use of the word science here is nonsensical. Support or opposition to taking a vaccine really has nothing to do with science in general. Science just gives us data to fill out our own personal value judgments. However, I generally agree with your stance. Almost all opposition to taking the vaccine has to do with political value judgments, not medical ones.\n\nThe problem with your statement is that you seem to be making light of the fact that politics weighs more in some peoples’ judgements. Is that a problem in your view?",
            "title_similarity": "0.83188283",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hlu9ooh",
            "score": 1,
            "text": "Right. Mainstream media suppressing thousands of stories like this, but that’s all “conspiracy theory”. Yep. https://www.mercurynews.com/2021/06/25/teen-boy-dies-a-few-days-after-receiving-second-covid-vaccine-shot/",
            "title_similarity": "0.7127135",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hlua7b1",
            "score": 1,
            "text": "I agree with your premise that it is political, I'm vaccinated and so are my kids, however, vaccine hesitancy based off the history of the pharmaceutical companies is understandable.\n\nHere is a copy and paste from the last time this was asked on this sub.\n\n\n>Pfizer had to pay over $2,000,000 in fines for bribing doctors into prescribing medications for off label use and fabricating trial data. https://www.justice.gov/opa/pr/justice-department-announces-largest-health-care-fraud-settlement-its-history\n\n>Moderna has fired scientists whose experiments turn out to have disappointing results. https://www.statnews.com/2016/09/13/moderna-therapeutics-biotech-mrna/\n\n>J&J has been putting asbestos in baby powder for years despite knowing that they caused cancer. https://www.reuters.com/investigates/special-report/johnsonandjohnson-cancer/\n\n>The pharmaceutical industry has repeatedly proven that it cares more about the bottom line than about helping people and I don't think it's fair to characterize people who don't trust these companies as selfish.\n\n\n>I hope some day everybody stops demonizing antivaxxers for being dumb and anti-science and starts pointing the finger at an industry that's abused the trust of the public nonstop since they came into existence.",
            "title_similarity": "0.72878706",
            "sentiment_compound": -0.9389
        },
        {
            "id": "hluac2o",
            "score": 1,
            "text": ">Any non-political source I've found is clearly in support of vaccines.\n\nVaccines or vaccine mandates? And more importantly, what does it mean to be in support of them? If that means \"everyone should take it\", then that is inherently a political statement, so you'd be quoting a \"non-political\" source, that makes political and moral judgements on what people ought to do. To me, this smells like contradiction in your worldview.\n\n I'm not against vaccines as an idea. If you want to take it, take it. If everyone else wants to take them, good on you. I just don't see it being necessary for myself, especially for my age bracket and current health status, and I'm also against government intervention into personal medical liberty. You can see the second part as political if you want.",
            "title_similarity": "0.8649868",
            "sentiment_compound": 0.9549
        },
        {
            "id": "hluakz7",
            "score": 1,
            "text": "Where I live, there's a lot of people who are hesitant to get the vaccine just because they think the side-effects (falling sick with a fever etc) might mean that they got covid. A lot of people (including some family of mine, who are publicly very vocal against RWers) had this baseless idea that one could get covid from the vaccine\n\nEdit just to clarify, i come from a country in Asia which is quite removed from the US political context anyway. (where this trend seems to be particularly attached to politics)",
            "title_similarity": "0.7703335",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hlub4n1",
            "score": 1,
            "text": "I mean, put it this way… the recommendations for vaccines has basically changed in real time. From one jab, to a jab and a booster and now a third booster. Then from helping prevent catching it to just reducing symptoms.\n\nAnd anecdotally, the only people I personally know that have caught covid have been double jabbed.\n\nLike sure, i’ll get the vaccine… but it seems to be pretty unreliable.",
            "title_similarity": "0.7671839",
            "sentiment_compound": 0.81
        },
        {
            "id": "hlubfem",
            "score": 1,
            "text": "The covid vaccine inhibits the repair of damaged DNA.  #fact",
            "title_similarity": "0.6457647",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hlucrkh",
            "score": 2,
            "text": "Well, I'm UK-based so my view is going to differ as even our so-called \"right-wingers\" have never been anti-vaccine, but certainly anti-lockdown and anti-vaccine-mandates.\n\nHowever, I am unvaccinated against COVID and therefore, in the eyes of the internet, an anti-vaxxer.\n\nSo, why opposition on my behalf?\n\nSimply because everyone is telling their own truth and there is not yet a clear consensus on anything.\n\nSome major scientists were saying not to vaccinate under 18s as their risk of complications (myocarditis) is far greater than any potential risk from COVID itself. They started doing it anyway.\n\nThe government were saying \"2 vaccines and you can have your freedoms back\", well, low-and-behold, now they're saying if you don't have the 3rd jab (booster), you're basically classed as unvaccinated. Even though the boss (I believe) of Astra Zenica (?), basically said people don't need a 3rd booster and we should be shipping them to other places.\n\nThere's also the fact that natural immunity, built-up from having COVID, is being dismissed and vaccines still being pushed, despite the fact that even some major scientists are saying that natural immunity is far better than the vaccine currently.\n\n&#x200B;\n\nWhat about \"you need a vaccine to enter X establishment\" - Papers, please!\n\nThe vaccine does not stop you catching or transmitting Covid, so it doesn't prove I don't have COVID, so I can enter the venue free-reign and spread it like wildfire (see: Australia).\n\n&#x200B;\n\nEssentially my view boils down to a very strong disagreement with the current politics and draconian measures being brought in, further compounded by the fact someone in my age-group is highly unlikely to get issues from covid, even more compounded and fortified by my lived experiences. I have used public transport, been to Sweden (no anti-covid measures), been to major cities and events with no mask mandates or anything and I work in retail. I've barely had a cold over the last 2 years.\n\nDon't get me wrong, I still get tested and still wear a mask if I'm asked to; I would also get checked for immunity, but I have to get a positive test (here at least), in order to ask for an anti-body test. So, if I've had it and didn't know (like a lot of people my age), I'll likely never find out if that's the case because my test would all be negative now (which they are).\n\n&#x200B;\n\nEdit: I don't know if I quite followed your CMV here, but my personal belief is a mix of political and scientific.",
            "title_similarity": "0.85220623",
            "sentiment_compound": 0.9792
        },
        {
            "id": "hlue0j9",
            "score": 2,
            "text": "I agree that it’s mostly political and many people who refuse the vaccine are fairly uneducated - BUT I understand that some people are skeptical because it’s new. I’ve had 3-4 week long periods ever since I got vaccinated. Many other women have experienced this as well. Could be related to something else, but I’ve been to the doctor and got tested/examined for so many different things and we couldn’t find anything wrong. This is enough for me to be skeptical about getting the booster shot. I don’t want to get covid obviously, but I’ve it almost seems like the risks might possibly outweigh the rewards for me. I’m on the fence. I will probably do it if I need to in order to enter places and events.",
            "title_similarity": "0.71947134",
            "sentiment_compound": -0.3543
        },
        {
            "id": "hlueob3",
            "score": 1,
            "text": "It’s not political. It’s mostly based on arrogance. It’s the belief that your logic is superior to all the doctors, nurses, scientists, virologists, universities, media, governments and the majority who get vaxxed. The anti vaxxer believes they are smart, and everyone else is dumb.",
            "title_similarity": "0.68085176",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hluf6yx",
            "score": 1,
            "text": "Two things:\n\n1. There may be people who are opposed to the vaccine for apolitical reasons such as religion or weird personal beliefs.\n2. Some people with natural immunity against the virus from previous infection, which based on current scientific evidence makes them pretty much safe from the virus, argue against being forced to take the vaccine, especially since there haven't been clinical trials for their situation.",
            "title_similarity": "0.7082373",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hluge1p",
            "score": 2,
            "text": "If there was a treatment that prevented death 100% of the time should we still take a vaccine?",
            "title_similarity": "0.6030532",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hlugo4u",
            "score": 1,
            "text": "I'm sitting here reading this literally waiting the 10 mins aftery second shot. It took a while for me to be comfortable doing it. For those on the fence....eh. either you do it and move on, or you get stuck with your pants down for the foreseeable future.",
            "title_similarity": "0.41459507",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hlugrsr",
            "score": 1,
            "text": "  One of my substitute teachers told my class this story when the Covid vaccines were in the middle of rolling out, and I have no certainty that it's true, other than that she seemed to be honest about it. (Note: I also may have gotten some of the details off, it was a while ago that I heard it)\n\n  One of her husband's friends from when he was in the military lived in Virginia, and after 9/11, he and his friends decided to take an experimental anthrax vaccine as a way of helping to serve the country again. They all went and got their shots, but they recieved too high of a dose. Of the 9 people that got the shot, only 2 lived. \n\n  The friend went into a coma from it, and died just a few weeks afterwards, due to recieving the shot. \n\n   I got the Covid vaccine because I wanted to protect my family and those around me, but I can understand how someone might question the safety of a vaccine that was only approved for use in an emergency. I myself was kind of wary of it, but I got it anyways and don't regret it at all.",
            "title_similarity": "0.6882191",
            "sentiment_compound": 0.9449
        },
        {
            "id": "hluhzdr",
            "score": 1,
            "text": "Gibraltar",
            "title_similarity": "0.029307261",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlui9vp",
            "score": 1,
            "text": "What about people who were anti vax before Covid? Think theyd all of sudden change their mind or do you think all antivaxxers(precovid ) share a political ideology?",
            "title_similarity": "0.73292136",
            "sentiment_compound": -0.1179
        },
        {
            "id": "hluliyk",
            "score": 2,
            "text": "Principle. It should be personal choice.",
            "title_similarity": "0.17352566",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlulqx2",
            "score": 1,
            "text": "I really don't want to get in the middle of the whole vaccine debate -- I'm personally pro-vax and pro-vaccine choice -- but I just came to add that I know a lifelong nurse practitioner who is not political in the slightest and was pretty adamant about not getting the vaccine at that moment in time. However, this person eventually ended up getting it recently due to an employer mandate -- however, they opted not to go with the experimental mRNA tech, and instead chose a more traditional viral vector option (J&J). Ironically, this person is also not the only healthcare worker that I know of that had similar sentiments. While these examples are certainly anecdotal, I do think that it's entirely possible to have natural hesitancy outside of any kind of political motivation.",
            "title_similarity": "0.7979479",
            "sentiment_compound": 0.9032
        },
        {
            "id": "hlumbcc",
            "score": 1,
            "text": "I have a friend who has an autoimmune disease. She was hesitant to get the vaccine because even though the massive safety trials say it's completely safe for the average person, there's just no way the safety trials could possibly be as conclusive for someone with an unusual disease.\n\nHer reasoning basically comes down to \"there's just no way that the safety trials could possibly get enough people with my disease for the results to be statistically significant.\n\nPersonally I disagree with her and glad she's finally relented and gotten the vaccine, but he opposition is based ona lack of sufficient scientific data",
            "title_similarity": "0.74916977",
            "sentiment_compound": 0.4304
        },
        {
            "id": "hlunoko",
            "score": 2,
            "text": "I would argue that some people are simply not sure of the long-term side effects of the shot.  It's perfectly okay to be cautious.  I know people that could care less about the political side of the shot and are more concerned with how it will affect them long-term.",
            "title_similarity": "0.6642786",
            "sentiment_compound": 0.6745
        },
        {
            "id": "hluo8kf",
            "score": 1,
            "text": "I would argue that the lines between politics, government, news media, medicine, and science are too intertwined to separate at this point.  Legal bribery in the form of lobbying and campaign finance trickles down to university research, and big pharma is able to advertise and fund mainstream news media, creating clear conflicts of interests. This may sound conspiratorial, but it’s true - billionaires have consolidated wealth, power, and information so well its understandable to not trust any of it. \n\nA large part of the science and research on the vaccine and Covid comes from publicly funded universities. Those professors have a career/financial incentive not to “speak against the mainstream narrative”. This was admitted by dozens of university scientists when Biden announced the official investigation into the Covid lab leak theory, after more than a year of public health officials, politicians, and media calling anyone who even considered the lab leak theory a crazy conspiracy theorist who should be censored from major platforms. \n\nWe’re not even close to having an open, honest, and objective setting for research and science when university professors and researchers say they were afraid to speak their truth or start research on a topic for fear of being considered a crazy conspiracy theorist and then being defunded and/or fired. For a similar instance in media/politics, look at how Harvard denied tenure to Cornell West for being against the mainstream corporate media narrative. Universities are now very political. \n\nThen we saw that same model of “initial wild conspiracy” morphed into an official investigation several months later with vaccine effects on women’s reproduction issues, myocarditis, and blood clots, as well as the ever decreasing effectiveness numbers of the vaccine - which they started out saying 99-100% effective. And the worst part is there is never a retraction, correction, or explanation of why the information changed, we’re just supposed to forget it and trust the new narrative or number. Really feels like the 1984 ministry of information has just changed the facts. \n\nThat makes me think there are lots of doctors and researchers today who are too afraid to speak out or begin research on these vaccine side effects, and I have zero faith the media would help them get the message out even if they did speak out. \n\nTLDR: Science and medicine are inherently political because we’re in completely corrupt r/latestagecapitalism society where the lines between business, politics, government, media, and science have all been blurred by billionaires.\n\nEdit: I forgot to mention how the FDA gets almost half their money from “user fees”, aka a percentage taken from big pharma sales.",
            "title_similarity": "0.74662244",
            "sentiment_compound": -0.2555
        },
        {
            "id": "hluovrv",
            "score": 1,
            "text": "My girlfriend is apolitical and has studied medicine. Well, she studied nursing and she has reservation regarding the vaccines. She said that it is too early for it to be given and there is not enough studies to support the Covid vaccines.\n\nShe did take a vaccine but she had experienced some side-effects and she didn't like it. \n\nWe had an argument about the vaccine mandate and how she thinks it shouldn't be mandated. \n\nShe also said that since I didn't study medicine and have no credentials to talk about it, she will not listen to me even though I told her that all that I know about it are from actual credible sources.\n\nShe isn't against all vaccines, just these vaccines. It's just too early according to her.",
            "title_similarity": "0.7392931",
            "sentiment_compound": -0.7442
        },
        {
            "id": "hlur2me",
            "score": 2,
            "text": "I am pro vaccine and I got both the shots very early(back in February). However, I do see the point of someone not wanting to get shot themselves. \n\n1. Absence of evidence is not the same as evidence of absence. I think we just have to accept that we don't know what we don't know. Yes so far no side effects were seen/known, however long term side effects will only be evident after administration of vaccine. However, for people who has the risk of covid higher than this imaginary risk, its way better to just get the vaccine in first place\n\n2. One issue I found with the MSM(mostly left) is they just ignore the above fact and never acknowledge the risk, and many people inherently understand it at some level. This IMO causes more skepticism than just stating the risks, albeit imaginary as of now\n\n3. https://www.nature.com/articles/d41586-020-03067-w science and politics do go hand in hand. \"What does the science say\" itself is very political and inseparable",
            "title_similarity": "0.75151795",
            "sentiment_compound": -0.0298
        },
        {
            "id": "hlur8mx",
            "score": 1,
            "text": "Watch this...\n\nhttps://youtu.be/IqwPWPJJk1E",
            "title_similarity": "0.14317663",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlutbbk",
            "score": 1,
            "text": "There’s a bloke in Australia who’s whinging about being given the sack because he used his own vaccine instead of a TGA approved vaccine.\n\nHe’s been trying to claim that it’s too risky to mix his vaccine and other ones, despite the fact that he already advised trial participants that they would have no issues getting the AstraZeneca vaccine.\n\nHe’s been opposing the mandates on the basis that his vaccine wasn’t included.\n\nThat’s not political, it’s just profiteering off a pandemic.",
            "title_similarity": "0.7492969",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hluu4vo",
            "score": 1,
            "text": "Mandatory vaccination only is a narrative which is not the same across all countries. Some countries accept Covid recovery as part of their policy which already shows in consistency in the narrative. However, a narrative or mandate is not debatable and allows no contrast of ideas, contradicting information and no recourse. A narrative is just dogma and dogma is the basis for religion. Vaccination has become a cult religion where you either follow the teachings or are banished to go to hell. The people \"in charge\" have taken up as prophets and made the most fanatical of the followers into disciples. It has changed the population from an Us VS Them(government ) to Us(government and believers) VS Them(people who wish to not vaccinate or people against the loss of human rights). Dogma or narrative is anti science, it discounts differing opinions and study. There are doctors, scientists and research papers coming out everyday against the short-sightedness of a vaccine only policy, yet they have been silenced by the MSM which is overwhelmingly left leaning and left owned.\nScience allows for debate, transparency and open dialog. This is not science it is coercion veiled in propaganda. We don't have a clue what these vaccines will do over time or when younger generations grow up. This could be the greatest short term miracle wrapped up in the worst long term nightmare for humanity. The only studies that have been completed are ones to see if people will die from the vaccine right now and whether or not the vaccine treats Covid, which in old people it seems to do very well. I am all for vaccination and people's right to get it. Clearly, the people who were considered fully vaccinated but didn't really want the vaccine must be worried that now they need a booster or they will soon be counted as unvaccinated. Lastly, you can call it a vaccine but in the end it is not a traditional vaccine of any kind, it is new and being tested on you. It doesn't stop transmission or you from getting Covid, it only masks the symptoms and lowers your severity of sickness. So you or anyone you know who decides to go buck wild thinking you are protected and protected other people by getting it should think again. You are the silent spreaders because the unvaccinated have symptoms and then get tested. In the end it is the vaccinated who are the plague rats. A plague rat doesn't know it carries disease and gets other sick.",
            "title_similarity": "0.7707245",
            "sentiment_compound": 0.3757
        },
        {
            "id": "hluws5e",
            "score": 1,
            "text": "I'll give you a position you'll appreciate:\n\nM",
            "title_similarity": "0.056726985",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hluwy7o",
            "score": 1,
            "text": "My hippie 79 year old mother and my yoga instructors are anti vaxx because it’s not “natural.”  They are definitly not political.  They think essential oils and homeopathy will keep them well.  No right wingers here, just idiots.  Nothing to cite, this is from listening to their crap.",
            "title_similarity": "0.6479788",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hluxccp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07080051"
        },
        {
            "id": "hluxm3t",
            "score": 1,
            "text": "Take a virus that has a clear infection fatality rate that is highly influenced by age: \n\n\"The estimated age-specific IFR is very low for children and younger adults (e.g., 0.002% at age 10 and 0.01% at age 25) but increases progressively to 0.4% at age 55, 1.4% at age 65, 4.6% at age 75, and 15%at age 85.\"\n\n[Assessing the age specificity of infection fatality rates for COVID-19: systematic review, meta-analysis, and public policy implications](https://pubmed.ncbi.nlm.nih.gov/33289900/)\n\nand co-morbidities\n\n[Obesity, diabetes, hypertension and severe outcomes among inpatients with coronavirus disease 2019: a nationwide study](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8444420/)\n\n&#x200B;\n\nand have vaccines with waning antibodies that only effectively maintain a meaningful reduction in your chances for hospitalization and death, not infection and transmission.  [Waning of BNT162b2 Vaccine Protection against SARS-CoV-2 Infection in Qatar](https://www.nejm.org/doi/full/10.1056/NEJMoa2114114)\n\n&#x200B;\n\nand how recovery yields a complex, durable and robust immune response:\n\n[The immunology of asymptomatic SARS-CoV-2 infection: what are the key questions?](https://www.nature.com/articles/s41577-021-00631-x)\n\n&#x200B;\n\n[SARS-CoV-2 infection induces long-lived bone marrow plasma cells in humans](https://www.nature.com/articles/s41586-021-03647-4)\n\n&#x200B;\n\n[Comparing SARS-CoV-2 natural immunity to vaccine-induced immunity:  reinfections versus breakthrough infections](https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1.full.pdf)\n\n&#x200B;\n\nand medical journal letters/summaries:\n\n[COVID-19: stigmatising the unvaccinated is not justified](https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)02243-1/fulltext)\n\n[The epidemiological relevance of the COVID-19-vaccinated population is increasing](https://www.thelancet.com/journals/lanepe/article/PIIS2666-7762(21)00258-1/fulltext)\n\nand you end up with a medical decision which is effectively only about your health, not so much about others' health.\n\nfor some people the risk-benefit analysis is to take it, for others its not, or not yet\n\n&#x200B;\n\nanother issue is the vaccine itself.\n\nmRNA doesn't have the pedigree of other vaccine types, be it by safety profile and/or time.\n\nMany people simply want to wait for a more legacy type of vaccine, such as novavax or covaxin, maybe COVI-VAC.\n\none can reasonably argue that they'd be willing for only 1 degree of \"new\" in their vaccine.\n\na vaccine for a new virus, with a new vaccine platform is 2 types of \"new\".\n\na vaccine for a new virus, with an already established vaccine platform is only 1 type of \"new\".",
            "title_similarity": "0.4940109",
            "sentiment_compound": 0.3825
        },
        {
            "id": "hluxp3t",
            "score": 1,
            "text": "I have a buddy who works for public service. He’s a 20-something, very healthy male who refuses to get the vaccine. His argument is that, with his current work policy, if he comes in contact with someone with Covid-19 while he is unvaccinated, he gets two weeks off paid automatically. If he’s vaccinated, he gets two days off and one negative test and he’s back to work. He knows it’s incredibly selfish, but for him it just doesn’t make logical sense in his current position to get vaccinated. \n\nTo be clear, he believes that, were he to get the virus, the statistics show that he someone of his age and health is more than likely to be completely fine. He is also virtually never in close contact (as defined by the CDC) with someone who would be considered “high risk”. So his is unvaccinated for non-political  reasons.",
            "title_similarity": "0.65090567",
            "sentiment_compound": 0.4097
        },
        {
            "id": "hluxvgg",
            "score": 1,
            "text": "There are two non-political reasons given to get the vaccine. To protect yourself from Covid. To protect others from Covid. \n\nLet’s start with protecting yourself. If you’re young and healthy, Covid has a very high survivability rate. High enough that it’s rational for a young, healthy person to consider the risk negligible. Even more so if their risk of contracting Covid is small. And while we could argue of the extent, there is a non-zero risk that also comes with taking the vaccine. This is true of any vaccine, but on top of things, this is a new technology that has not had full, long-term testing. And it’s practically guaranteed that you’re going to feel like crap for a day after at least one shot. That alone is worse than the asymptotic Covid many young, healthy people experience. \n\nIt is neither political nor irrational for a young, healthy person to be willing to view the relatively minor risk of Covid as a safer bet that the relatively minor risk of adverse reactions to the vaccine. And that’s even before you consider people who have had Covid and recovered. \n\nSo that leaves getting the vaccine in order to protect others. Just in general, being selfish is not a political position. \n\nBut you routinely hear stories of fully vaxxed\nindividuals contracting and spreading Covid. So at best, you’re just deceasing the odds of spreading Covid to others. Something you can also do by keeping your distance.",
            "title_similarity": "0.6470137",
            "sentiment_compound": 0.5975
        },
        {
            "id": "hluy624",
            "score": 1,
            "text": "The funniest part about the arguments that anti-vaxxers make is when they discuss pro-vaxxers (or just the common majority at this point) as SCARED from covid-19 and it's very dangerous long-haul side effects.  They completely disregard the fact that they are very SCARED of the vaccine that is based on science.  I also completely disregard anyone who says that bog pharma is out to get us and they want us all to become terminally ill from the vaccine OR the government wants to monitor us.  Well, guess what guys, THEY ALREADY DO monitor us like we are ants.  And, no big pharma is not out to almost kill billions of us cause then we wouldn't buy their stuff anymore or even DIE, let alone give them millions of dollars more.",
            "title_similarity": "0.8234699",
            "sentiment_compound": -0.9776
        },
        {
            "id": "hlv0n0g",
            "score": 2,
            "text": "I'm convinced a lot of people are really afraid of needles and will go to absurd lengths to avoid admitting thats the reason",
            "title_similarity": "0.61777616",
            "sentiment_compound": 0.128
        },
        {
            "id": "hlv1u6u",
            "score": 1,
            "text": "They flat out tell me it’s because of political reasons.",
            "title_similarity": "0.54431236",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlv3kmv",
            "score": 1,
            "text": "So completely random question. More like a fundamentals type question, can go both ways but may create a point. I know this is a virus, and not a bacteria, but follow this logic. So along time ago when penicillin was discovered, it was a miracle drug. They started to use it for battle wounds for soldier at war, then residential use became huge and used it for all type of cold like ailments, skin infections, etc. it was a miracle in treating active bacterial infection. So time went on, and eventually, due to widespread use, the bacteria learned how to scramble the lactam ring on the penicillin molecular structure, and lead to it becoming less effective. Penicillin began to lose its potency as an empiric treatment. The bacteria that was being treated was becoming smarter than the mechanism of the drug.Then, drugs such as augmentin(a beta lactamase inhibitor), cephalosporins, and a whole bunch of newer antibiotic drug classes were created to help take down constantly evolving bacteria. Then you have MRSA, then VRE as the next step. So question is, viruses are really smart right? Evolved many times faster than the human race has over much time. Is the over vaccinating of the population possibly going to lead to the same fate, where we have a never ending mutating virus, that needs new formulations thrown at it every so often? Will it eventually outpace our vaccines? Just kind of throwing it out there, I feel like this is the question that hasn’t been asked much. I think it may come down to two tipping points. 1.) if the vaccine can, for the most part, prove to eradicate the virus to a point of almost no detection, then a massive vaccine push makes all the sense, correct? 2.) if this is not the case, are we just pushing back the inevitable? Even if all are vaccinated, is it possible for mutations to outpace vaccine creation? Will the mutations be even deadlier?",
            "title_similarity": "0.7516346",
            "sentiment_compound": 0.9874
        },
        {
            "id": "hlv48mr",
            "score": 1,
            "text": ">Any non-political source I've found is clearly in support of vaccines.\n\nNot a thing. Everyone has a bias. Some sources have minimal bias, but they all are political to some degree.",
            "title_similarity": "0.7612107",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hlv4e6o",
            "score": 2,
            "text": "The reason why the vaccine is such a politically contested issue is because of republican conspiracy theorists and liberals who attack you for wanting to make your decisions like what cnn did to joe Rogan",
            "title_similarity": "0.79003155",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hlv4mex",
            "score": 1,
            "text": "A lot of people are political about it for sure. When Trump was in office prominent liberals opposed it for being rushed and flip flopped once Biden took over.",
            "title_similarity": "0.7197497",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hlv4p1g",
            "score": 1,
            "text": "You can't really say \"vaccines\" and lump them all in the same category.     In regards to the COVID vaccines, there are the ones based on mRNA and the ones based on inactivated virus.   The ones based on mRNA are a totally new way of creating vaccines, and covid is the first one it has been created for.   There is no long term data on it.    The ones based on inactivated virus, are a different matter, because using inactivated virus(or bacteria) to create a vaccine has been around for 130+ years.\n\nSo I can understand people being hesitant to take the mRNA vaccines.   I myself have only taken the vaccines created using inactivated virus, and when I got my booster shot(3rd shot) in July this year, I was offered the Pfizer vaccine, I gave them a hard NO, and said I will stick to the vaccine I took in October/November 2020.\n\nIt is not at all irrational or in the realm of conspiracy theory to not wan to take a type of vaccine that doesn't have as long of a history as the other ones.",
            "title_similarity": "0.7095666",
            "sentiment_compound": 0.1119
        },
        {
            "id": "hlv5xxr",
            "score": 1,
            "text": "I don’t see a political agenda that the disproportionate number of unvaccinated black people have.  They don’t align with the conservatives that’s for sure",
            "title_similarity": "0.53320736",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hlvaqfw",
            "score": 1,
            "text": "It is very clear in this situation that policy has been driving science not the other way around. If you follow the news, you would have noticed that lots of decisions came before having scientific evidence.E.g. few months ago, the administration set-up a date to start giving the boosters without FDA or CDC concurrence.",
            "title_similarity": "0.71446383",
            "sentiment_compound": 0.6478
        },
        {
            "id": "hlvew3s",
            "score": 1,
            "text": "I am conservative. Got the jab early because I get the flu shot, got the shingles shot, got the HPV shot... why not the VID shot? Most of my fam is conservative. Most got the shot. Except crazy uncle who thinks it's the tracker/DNA changer shot. Most of my friends are also conservative. Most got the shot. If about 75% does that mean there's only 25% conservatives in this country?",
            "title_similarity": "0.7200605",
            "sentiment_compound": -0.2491
        },
        {
            "id": "hlvg5od",
            "score": 1,
            "text": "Not that I agree with their concerns, but most are merely concerned with the lack of adequate clinical testing and trials. Yes, I'm aware the mRNA mechanism has been in development for a while, but it didn't go under the same scrutiny as a vaccine normally would.\n\nMy obvious answer for this is simply that it was an emergency vaccine for an emergency situation and as such, it has been very successful. You must agree that the risk of the vaccine, albeit not high on its own, is higher than what would normally be acceptable for a vaccine, though.\n\nSimply put, it's an emergency vaccine, not a true vaccine. It's acceptable that some would be wary. So long as they understand exactly what it is they're concerned about.\n\nThe vaccine is successful, it does work, and the risk is not significant enough for it to be doubted at this stage in the pandemic. I personally want to see a new iteration of the vaccine in 5-6 years. Especially now that it's clear the virus is here to stay. I want a vaccine that lasts a year, has no adverse effects (the current stats are not drastically high, but they aren't insignificant either), and doesn't knock you out for 1-3 days. I did not expect this or require it for the emergency mode we've been in, but it's fair to expect it for the near future.",
            "title_similarity": "0.7052523",
            "sentiment_compound": 0.8864
        },
        {
            "id": "hlvj7fg",
            "score": 1,
            "text": "r/foosgonewild",
            "title_similarity": "0.14302793",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlvkg0o",
            "score": 1,
            "text": "Something new was created. \n\n\nWhat is the short term effects? \nFrom what we can tell, this. \n( Whatever symptoms) \n\n\nLong term? \nHasn't existed long enough so no clue. \n\nPeople not wanting to take something new is completely fine. All new medicine all new vaccines and hell when old meds and vaccines were first coming out I wouldn't complain If people were afraid too. \n\nWhy be a guinea pig or an unpaid guinea pig and then to make it worse they started forcing everything which really made the stigma so much worse. \n\n\nA lot of people want to be safe and not make a choice that can either kill or effect them in a way that'll hurt them in the future. If we do something we want the knowledge to be known already. Oh you have this complication, well you took this shot and it's Known to sometimes cause this issue after this time so we know what to do. \n\nThats a lot less scary than \n\nHey remember those people who died a while back, turned out they all were at risk for this complication. If we had only known it was from this we likely could've done something sooner instead of wasting time on other stuff. \n\n\nIt's a lack of information. That lack of information can be extremely scary and I don't blame anyone for wanting to wait or choose not to take it cause tbh it's survivable. \n\nEither way, fear of unknown Is justified. Greater fear because of the force behind it, and a growing opposition to it, justified too.",
            "title_similarity": "0.79660213",
            "sentiment_compound": -0.9813
        },
        {
            "id": "hlvnoiq",
            "score": 1,
            "text": "I’d say replace politics with ideological, though it runs along political lines. But I’ve noticed more and more that there seems to be a certain personality that seems drawn to these beliefs and an almost pathological need to believe they know the REAL truth.",
            "title_similarity": "0.664817",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hlvpl45",
            "score": 2,
            "text": "Saying the opposition is due to political reasons is giving them too much credit imo.\n\nYour view in my opinion doesn't go far enough. These people are selfish, anti-intellectual, tin-foil hat wearing scaremongers who are willing to gobble up complete shite just so they don't have to get a prick in the arm twice and then have a booster once a year.",
            "title_similarity": "0.7360717",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hlvtq12",
            "score": 1,
            "text": "It's not political to not want to take an experimental vaccine whose long-term effects are unknown.",
            "title_similarity": "0.5935061",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hlvusz6",
            "score": 1,
            "text": "To address your cmv directly, I think that vaccine hesitancy is actually the result of cognitive bias, and the resulting mental gymnastics (political) are merely an attempt at justification.\n\nThe cognitive bias is that of favouring a known risk of an uncertain event over a known risk of a certain event.\n\nThe bias is one of excess risk averse behavior, the same one that makes people irrationally hesitant to lose something they possess rather than lose the opportunity to gain something they do not.\n\nIt’s basically the same sell as if there was a magical way to get a broken (but totally healable) arm and be immune to death or serious injury from car crashes your whole life.\n\nClearly, breaking your arm in a clinic at 6 years old would be the right move, saving millions of lives every year….but  you’d have a lot of people that would refuse to take a baseball bat to their kids arm for the magical cure that may not be needed (maybe you won’t get in a car crash).\n\nThe reason that the cognitive bias justification comes down on the right side of the political spectrum is that conservatism appeals disproportionately to people who’s fear of unknown risks outweighs the promise of uncertain gains. It is, quite literally, the conservative strategy.",
            "title_similarity": "0.7533778",
            "sentiment_compound": -0.9721
        },
        {
            "id": "hlvy72k",
            "score": 1,
            "text": "is any irrational reason out? I'm sure there are some who just haven't made it a priority or who just don't like shots ect.",
            "title_similarity": "0.47439885",
            "sentiment_compound": -0.2982
        },
        {
            "id": "hlw3x8a",
            "score": 1,
            "text": "You don't want the covid vaccine because you are a conspiracy theorist.\n\nI don't want the vaccine because I am scared of needles.\n\nWe are not the same.",
            "title_similarity": "0.7228898",
            "sentiment_compound": -0.7746
        },
        {
            "id": "hlw43if",
            "score": 1,
            "text": "I know a lot of anti-vaxxers, and none of them are remotely right wing; they are all either hippies or left wing anarchists (or both).\n\nThe hippies believe there are hidden costs to vaccinating, that vaccines weaken or damage our immune systems, and have side effects at a level beyond the physical. It's hard to either prove or disprove these beliefs with current science.\n\nAs for the anarchists: there's a misconception in your title, which is that you think science is not political. Ideally, science is a dispassionate search for truth, but in reality it is entangled in capitalism and thus intrinsically political. When a scientist makes a statement or publishes a paper, the first question we have to ask ourselves, before we even consider their methodology, is: who is paying them? The last 100 years of history is littered with examples of science being silenced or corrupted by business interests, from Thalidomide to smoking to climate change.\n\nThere are huge business interests in getting everyone to have the Covid vaccines, so every contraindication needs to be weighed carefully against the pro-vaccine propaganda.\n\nThen there's the state coercive aspect of what's been happening. How much do you value your personal freedom? What are the long-term implications of the state being able to lock down society when it wants to? Of forcing or coercing people to have certain medical treatment?\n\nSome of these points overlap with \"right wing\" concerns, but they stem from concern about the future of humanity rather than selfishness.",
            "title_similarity": "0.8387003",
            "sentiment_compound": 0.9266
        },
        {
            "id": "hlw5ukr",
            "score": 3,
            "text": "According to Our World in Data, vaccines and COVID related science has approximately 6000+ peer reviewed studies, and more added everyday, from hundreds of institutions around the world. \n\nUntil anti-vaxxers can provide 6001 peer reviewed studies, they’re dumb ass, anti-intellectual rednecks to me.",
            "title_similarity": "0.6029496",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hlw6hjp",
            "score": 1,
            "text": "I have a friend in Switzerland, they have about 12k deaths total but only 68 are people under 50. His perspective is ya old people should get vaccinated. But why risk myocarditus when its not killing young people. I have argued that complications from COVID are pretty bad and vaccines reduce transmission etc. He is considering those points but it is not political.",
            "title_similarity": "0.6614815",
            "sentiment_compound": 0.1341
        },
        {
            "id": "hlw950h",
            "score": 1,
            "text": "Not entirely since it can give some nasty side effects which would make some people hesitant to get it. \n\nThough those side effects are vastly insignificant compared to the dangers of not getting it\n\nNot everything is political and some people are just very careful. That’s why we need more communication and less hate. Posts like this marginalise the issue and make it black and white. Which It really isn’t",
            "title_similarity": "0.55909604",
            "sentiment_compound": -0.888
        },
        {
            "id": "hlwbc6u",
            "score": 1,
            "text": "Just depends what you call political. Like the dark horse podcast has 2 scientists on it, but they also started a third party. You're going to be pressed to find apolitical people or orgs today when the government has entered into every aspect of our lives, from subsidies in ag to solar to education and kids.",
            "title_similarity": "0.7574326",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hlwg3cm",
            "score": 1,
            "text": "i hang out online with a lot of anti-vax people. you are correct: most are just libertarians who oppose the vaccine just because it's mandated, and big tech censors anti-vax sentiment.\n\ni actually got the vaccine back in may, but refused to tell my employer about it for months",
            "title_similarity": "0.7747066",
            "sentiment_compound": -0.497
        },
        {
            "id": "hlwh6vw",
            "score": 1,
            "text": "I got the vaccine so I don’t care that much about this. But I mean the pure fact that you made a post about the vaccine comes across as an entirely political! Also do you even understand what science is? It is gaining evidence to support or counter a theory/hypothesis. Science isn’t a fact and things we know currently will more then likely change in the coming years. Which is why looking at things like the vaccine and not wanting to take it is completely reasonable. How about you don’t force your choice of taking the vaccine on others and let them decide what they would like to do just like taking the vaccine was the right choice for you.",
            "title_similarity": "0.88115525",
            "sentiment_compound": 0.9614
        },
        {
            "id": "hlwhrh1",
            "score": 3,
            "text": "i don't think it's political, a lot of it seems to be based sheerly on stupidity.",
            "title_similarity": "0.48959914",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hlwlezn",
            "score": 1,
            "text": "My husband got the vaccine, Moderna, and after the first dose he felt...off.  A few days later he actually drove himself to the emergency room for having chest pains (they didn't find anything on any tests).  He also had random numbness in his hands for weeks.  He got the booster anyway, felt really off again for days afterwards.  He is really, really nervous about getting the booster.\n\nSome people really do have bad reactions to these vaccines.  I am not thrilled with getting the booster because the second dose knocked me on my ass for a day.  The idea of being sick for a day every six months for the rest of my life kind of sucks actually.  I will do it, because getting COVID is worse.  But lets not pretend this vaccine is a fun one for most people to get.",
            "title_similarity": "0.61474895",
            "sentiment_compound": -0.8236
        },
        {
            "id": "hlwo77k",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.07080051"
        },
        {
            "id": "hlwq7os",
            "score": 2,
            "text": "I am fully vaccinated and have my booster planned for early December, so I consider myself very pro vaccine. Vaccines are as close to settled science as could possibly be, and believe me, I hate that term because no science is truly settled, we continue to learn. That being said, I think the way the vaccine was rolled out was oafish and haphazardly. They made many boasts about it's efficacy being 99.something for preventing covid but now we see many breakthrough cases. They also never figured out that even if you are vaccinated you can still infect others with the virus. This all feeds into the conspiracy nuts, so who do we blame? Btw, with about 70% of our black community not vaccinated, I think that weakens the whole right wing theory. Personally it's the right wing tv and radio pundits that are anti vaccine not the citizens on the street.",
            "title_similarity": "0.7819423",
            "sentiment_compound": -0.9559
        },
        {
            "id": "hlwzhp3",
            "score": 1,
            "text": "Easy.  I have a staff of mostly minorities.  20% refuse the vaccine because they do not trust the government or big pharma.  They are both democrats, black, and female.  And idiots, but I guess that's not relevant.",
            "title_similarity": "0.625438",
            "sentiment_compound": -0.1283
        },
        {
            "id": "hlx69s0",
            "score": 1,
            "text": "My sister is scared because she wants to have children and several people she knows have experienced irregular periods after getting theirs. She isn't against vaccines entirely but she's afraid that it might affect her reproductive system in some way that we don't yet understand.\n\nWhile I want her to he safe, I also understand how she feels and nowadays with how political things are it's hard to know who exactly to trust. I absolutely think anti+vax people are full of shit and have been for a long time. But I wouldn't put it past pro vaccine people to lie about potential risks for individuals \"for the greater good.\"\n\nWhat's your take on that?",
            "title_similarity": "0.74160564",
            "sentiment_compound": 0.775
        },
        {
            "id": "hlxangi",
            "score": 1,
            "text": "Or it's just personal choice...",
            "title_similarity": "0.18289372",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlxc4ru",
            "score": 1,
            "text": "I consider myself fairly left-leaning big fan of AOC and Bernie and all of their policies. I am science-oriented having worked at Nas A and a strong background in math and logic. I am also a risk assessment and management specialist and because of that I can tell you that it is logical to be cautious about a new vaccine particularly given that our medical industry in the u.s. is extremely profit-based nefarious and has a long long history of hurting people for money. To the point that there are TV commercials every day about some medication that there now being sued for which is just considered a cost of doing business. They don't bother making them safe for testing them properly because it actually cost less to pay people off than it does to not sell the product. Obviously this doesn't good alright account for any and all medicines but enough that people's fears are generally well-founded. I don't blame people for being vaxx. hesitant. When I blame them for is acting as if their choice doesn't affect anybody else and claiming that they don't need to take special precautions to compensate for their personal choice. I think it's fine if people avoid the vaccine as long as they live in a way that minimizes that impact to the rest of us",
            "title_similarity": "0.810908",
            "sentiment_compound": -0.5043
        },
        {
            "id": "hlxd3kc",
            "score": 1,
            "text": "Honestly not sure how to approach this, because based on your second edit it sounds like you just want a source that says \"the vaccines are bad, don't use it\", and that's not likely to be the case. Unless you want some story about how crazy the medical science world is that could refute their claims. (Look up perdue pharma and oxycotin if you're interested in that). We should also know that science isn't always 100 percent accurate as it's every learning and newer tech comes out to assist in that learning. Also science is directed by humans and we are not free of corruption. [Here's an incidence of a Harvard scientist named John Darsee that fabricated his findings that ended up in a lot of journals.](https://pubmed.ncbi.nlm.nih.gov/6828878/)   \n\n\nPersonally, I feel like a real middle grounder in this instance, because if an anti-vaccine person says \"what about the long term side effects!\" I think about the fact that we don't know the same for catching covid. But in that same sense, when someone says \"they say it's effective get it!\" I think, well what's the context of \"effective\"? Because most of the vaccines we have to get we only get once, or only need a booster every so many [years](https://www.cdc.gov/vaccines/schedules/hcp/imz/adult.html). These are every so months or so.   \n\n\nAt the end of the day people take in all that and make their decisions.  In part, that's how they decide to call it effective. They take in the information they gathered, weighed it in a cost versus benefits sense, and then moved forward.",
            "title_similarity": "0.81141174",
            "sentiment_compound": 0.9659
        },
        {
            "id": "hmv1moh",
            "score": 1,
            "text": "Yes.  This has been written about by experts on the topic and is related to international politics:\n\n\"These developments suggest that an anti-science confederacy or empire may be on the verge of expanding across the Northern Hemisphere. A triumvirate of (1) medical freedom initiatives in the US, (2) Russian disinformation, and (3) far right wing extremist groups in Western Europe, now accelerates mistrust in vaccines and COVID-19 prevention\"\n https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3001068#:~:text=These%20developments%20suggest,COVID%2D19%20prevention",
            "title_similarity": "0.77379775",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hnk1m63",
            "score": 1,
            "text": "i would argue that even some pro covid vaccine articles are political in nature, though less outwardly so since being pro the vaccine isn’t going “against the grain”. that being said, the vaccine seems to be successful so far. but, it’s still new. throughout history scientists and medical professionals have been wrong to disastrous consequence. medications are recalled all the time to this day due to carcinogens. doctors used to prescribe a drink with radium that resulted in a man’s jaw falling off. there’s nothing wrong with skepticism about the relatively unknown, and there’s always a chance that these experts, still bound by human nature, have missed a vital angle of perspective when looking at things. this vaccine was released relatively quickly. only time will provide greater reassurance",
            "title_similarity": "0.8012664",
            "sentiment_compound": 0.41
        },
        {
            "id": "hnljlcc",
            "score": 1,
            "text": "Is this an unpopular view or something?",
            "title_similarity": "0.19988498",
            "sentiment_compound": 0.0
        },
        {
            "id": "hnlkcy7",
            "score": 1,
            "text": "I think it's a mistake to draw a hard line between \"political\" and \"based on science and medicine.\" Everyone's view about vaccines will be both. If we recognize how our own views of \"science\" are shaped by our political preconceptions, I think that gives us more power to change others' minds about scientific topics, not less.\n\n(Apologies if someone else already made this point, since I haven't read the whole thread.)\n\nAs some of your commenters have pointed out, many vaccine doubters' views are based on their (mis)understandings of the science of vaccines (or other science), or their flawed analyses of comparative risks. Those understandings and analyses are shaped by political prejudice, but so is yours and mine -- and even those of the professionals who do this work. There are no \"non-political\" sources; even the most strictly scientific text is \"political\" - not in a \"Rep. vs. Dem.\" sense, but in the sense that it reflects the writer's desire to shape public policy (by shaping public opinion, at a minimum - else, why publicize one's view?). That desire shapes what we choose to study and which results we think are important enough to share.\n\nI used to assume that people who didn't accept scientific facts were all either stupid or arguing in bad faith. I'm coming to see instead that many of them accept different sets of \"facts,\" interpret those facts differently, or weigh their relative importance differently than I do because motivated reasoning and perception shape our thinking differently.\n\nI'm not saying they are right. I'm saying that a lot of what we think of as \"fact\" is actually based not on our observations, but on *who we trust*. I'm not a doctor, or a biologist, or an epidemiologist, but I think I understand that the benefits of COVID vaccines far outweigh their risks for the vast majority of people because that's what the sources I trust say. Someone who suspects those sources and trusts others instead will think I'm deluded.\n\nWhy should we care about this?\n\nI care because I think it shows that we CAN change the mind of someone across what seems like a vast political divide, but (only?) if we change what sources of information and analysis they trust. For some people, revealing an overwhelming political bias in a source is one way to do that, so, um ... good work!",
            "title_similarity": "0.8487758",
            "sentiment_compound": 0.9875
        },
        {
            "id": "hp68ujj",
            "score": 1,
            "text": "So… some within the African-American population (and I would imagine this would be true for some Native Americans as well) have a somewhat justified concern that the gov’t would be willing to experiment on them w/o consent or even flat out poison them en masse through a vaccine. I even found myself adopting some this reasoning and thus got vaxxed at a hospital in a majority White area of the city. I’m willing to admit to a certain level paranoia but it doesn’t come from nowhere",
            "title_similarity": "0.70522845",
            "sentiment_compound": 0.4221
        },
        {
            "id": "hpiuadi",
            "score": 1,
            "text": "have you heard about project salus?? the data that comes from that is gathered by AI, it literally cannot be biased",
            "title_similarity": "0.41215077",
            "sentiment_compound": 0.2901
        },
        {
            "id": "hpkcwso",
            "score": 1,
            "text": "Don’t minority males have the lowest rate of COVID vaccination and they traditionally vote blue?",
            "title_similarity": "0.388035",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i32p1de",
            "score": 1,
            "text": "I am going to open with my —general— political view, I am a republican (in most circumstances)\n\nIf you have questions about the “in most circumstances” I go on what I truly believe is right, for example I think going green—fully solar, wind, nuclear fusion and hopefully in soon future fission—is a good idea but execution is off\nI think that people shouldn’t stick to a party because their parents had the views of the party, and they don’t know any better, people should make their own decisions, in voting season, and vote based on that not on what, typical party, they belong to\n\nI don’t want to have the vaccine, yet, I am a very science backed person, I think that the vaccine was made to quickly and left undiagnosed for long term affects, the average medical trial is on average 6 to 7 years—links at end of post—and the second link states, and I quote “The vaccine was mass produced before the clinical studies were complete to save time” and I’m just worried about long-term adverse effects, of a generally untested ‘drug’ I am truly just afraid of these affects and am not worried about what party I generally support.\n\nAlso on a different but similar topic, I think that the, typically left-wing, view of mandated vaccines or non-admission to events, some public places and the alike,  is generally dumb. People have the right to refuse treatment, if a competent adult, or medical proxy—typically a child’s parent until the age of 18– can (as the name refers to) refuse any medical treatment, vaccines included—this is ethics clause why anti-vax parents can hold their views, i think the government shouldn’t break ethics.\nPlease on this topic CMV\n\nLinks in order of use:\n\nhttps://www.antidote.me/blog/how-long-do-clinical-trial-phases-take\n\nhttps://www.northwell.edu/coronavirus-covid-19/vaccine/frequently-asked-questions#:~:text=Scientists%20began%20work%20on%20the,complete%20to%20save%20time.\n\nhttps://vtethicsnetwork.org/medical-ethics/right-to-refuse-treatment",
            "title_similarity": "0.80257285",
            "sentiment_compound": 0.9811
        }
    ]
}