{
    "CMV: we should stop using the term “Latinx”\nI admit it will be very difficult to change my view as I feel very strongly on this but I am open to reconsidering my view.\n\n1. The term is completely unpronounceable in Spanish the way that people intend for it to be pronounced. If the people for whom the word is intended cannot even pronounce it, then it is not an effective solution.\n\n2. “Latino” is gender neutral in Spanish already but if that is unacceptable because of its masculine inclination for some people then there are other alternatives that are easier to pronounce such as “Latine” and “Latin.” In Spanish, it is understood that “Latino” is gender neutral and it does not have the sexist connotation that English-speakers assume it does. \n\n3. The term is largely pushed by progressive white Americans against the will of the Latino community in the US. Only 3% of Latinos in the US identify with the term according to the Pew Research Center, the vast majority have not even heard of it, and amongst those who have their view of it is overwhelmingly negative. They see it as a white Western attempt to disrespect the rules of the Spanish language for politicized means, which is linguistic imperialism. \n\n4. Given the number of people who actually use the term being so small, it should not be used as the default for all Latinos unlike what corporations and politicians in the US are doing. If you know someone identifies as a woman or a man just call them Latino or Latina. \n\n5. We often say people are the authors of their own experience and this is a central tenet of progressivism especially for the marginalized. So why are people NOT listening to the majority of Latinos who do not want to be called Latinx? It screams “we know what is better for you than you know for yourself so sit back and shut up.”": [
        {
            "id": "hmer33z",
            "score": 1,
            "text": "/u/OddGuidance907 (OP) has awarded 8 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/r46mh2/deltas_awarded_in_cmv_we_should_stop_using_the/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.39918596",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hmergyu",
            "score": 0,
            "text": "Well by definition, the Latino/Latina paradigm doesn’t include the non-binary members of the community. I don’t think those people should be left out, though I also don’t think the terms Latino and Latina should be done away with. \n\nPersonally, I prefer the term “Latine” which rolls off the tongue easier than LatinX. \n\nI would say the best way to look at these gender neutral terms as a way in American English to refer to all people of Latin American descent regardless of gender identification, and Latino and Latina as specified terms within that broader umbrella that most people identify with. However I would say that I am only able to give my perspective on the way gender neutral terminology works, not on how it is expressed. If most men, women, non-binary, etc. people in the community identify with Latino the best, I have no say on that matter (though I still believe non-gendered terminology is useful)",
            "title_similarity": "0.8421035",
            "sentiment_compound": 0.9337
        },
        {
            "id": "hmepxkh",
            "score": 2,
            "text": "No worries! No one uses it. Absolutely nobody. Unless you’re in liberal reporting at a lower level, you won’t hear it.",
            "title_similarity": "0.54799056",
            "sentiment_compound": 0.3208
        },
        {
            "id": "hmeq1o4",
            "score": 41,
            "text": "1. I keep hearing it is unpronouncable, but why can they not say \"latinequis\"? I took Spanish for 7 years and I can imagine saying \"latinequis\" using the rules of the language so I hist dont understand that argument.\n\n2. Regarding the argument that the \"o\" ending represents men and women, that's the entire point. Same as here in the US how the word \"men\" meant men AND women. The argument is that the sexism is literally built into the language so its not even an argument against LatinX.\n\n3. The only argument that seems valid is that current Latinos are fine with \"Latinos\" and thats a good enough argument I think.",
            "title_similarity": "0.76245195",
            "sentiment_compound": -0.3859
        },
        {
            "id": "hmehtdx",
            "score": 180,
            "text": "1. It’s not a Spanish term. It’s an American English term. Lots of words wouldn’t make sense in a *different* language. \n1. But this is English. And English doesn’t gender ethnicities. So English needs a word that fits with the way it uses adjectives. The issue with the gendered default is the “male as default”, not a connotation. It’s the denotation that’s the problem. \n1. That doesn’t make any sense because again, it’s an *english* word. \n1. This is the same as (3)\n1. The existence of the word in a different language in no way requires people to use it in their own language. Think about it. You identified “Latine” or “Latin” as alternatives. Would (5) apply to these alternatives?\n\n\n**edit** since this is getting more attention, I want to make my position clear. My issue with the argument the OP has made is the *argument*. \n\nSaying “Latinx is problematic because the people it describes (generally, Spanish speaking people) don’t  prefer to use it themselves is like arguing the term *Americanos* is problematic in Spanish because the people it describes don’t prefer to use it. It makes no sense to have data that “we wouldn’t use it” and infer “therefore it’s offensive that you do”. \n\nFurther, I personally think Latinx is performative and unnecessary. It’s not pronounceable *in english* which is much more of an issue than it’s pronunciation in another language. Latin American exists and it seems needless (yet harmless) to invent a neologism.",
            "title_similarity": "0.7934702",
            "sentiment_compound": -0.9696
        },
        {
            "id": "hmewqgr",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.19636503"
        },
        {
            "id": "hmehcvh",
            "score": 357,
            "text": "Should the people who identify as Latinx stop using the term?\n\nEDIT: This is it, this is my whole argument. Once OP revised their OP to state something other than \n\n>we should stop using the term “Latinx”\n\nwith \"we\" meaning people in general and appended \"to describe the Latin- community in general\" this argument doesn't really work. I understand OP has revised their argument.",
            "title_similarity": "0.78325033",
            "sentiment_compound": -0.8827
        },
        {
            "id": "hmek2la",
            "score": 50,
            "text": "Can you really stop using a word that nobody actually started using in the first place?",
            "title_similarity": "0.51467043",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hmejsni",
            "score": 159,
            "text": "I've never heard a single person say latinx so I guess we already stopped using the term",
            "title_similarity": "0.39732707",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmes0yp",
            "score": -3,
            "text": "2. I think Latinx does an amazing job, especially in one word, towards increasing the visibility of gender-expansive people of Latin America or descent. It also includes those who identify as he/she. There is a difference between gender-neutral and gender-inclusive terms. Latino, Latino/a, Latin@ are indeed gender-neutral terms. However, they reaffirm the gender binary and fail to capture diversity from a critical gender-inclusive perspective. The Latino culture has a long history of failing our trans and non-binary community. These are conversations that our families, communities desperately need. If anything, Latinx provides a starting point or ice breaker to discuss the reality of non-binary genders.",
            "title_similarity": "0.79122984",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hmevcz9",
            "score": 60,
            "text": "You've stated that you're a white Latino, I identify as a queer brown Latine/x from Mexico\r  \n\r  \n1. It really isn't completely unpronounceable in Spanish.  \n\r  \n2. “Latino” is not a gender neutral in Spanish. The people that set the standard for the language  did not consider the trans community in its creations. Interestingly, the first reistance to using Latino as a umbrella term was by feminist from Brazil and not the trans community. Isn't it strange that you can have five Latinas but if one Latino enters the room you're now considered a room of Latinos. If I were to tell someone I was Latino, there is no way they'd derive that I was gender non-conforming. \r  \n\r  \n3. **The term is largely pushed by nonbinary and trans Latine people from the North and South.** The fact that only 3% of Latinos in the US identify with the term according to the Pew Research Center, doesn't mean that the non-binary/trans community does not deserve their space. Disrespect the rules of the Spanish language, you mean the colonizers tongue? Even the idea that Spanish should be kept \"pure\" is rooted in colonial ideology. White supremacy does exist in the south and is not unique to the USA. Linguistic imperialism, you realize that Spanish is the colonizers tongue and not native to South and its very existense in this land is due to imperalism. \r  \n\r  \n4. The fact that a large portion of the Latine community isn't ready to accept the term makes no difference to me. My identity has been erased for far to long. The ideology that I as a non-binary person does not deserve representation is bigotry. \n\n5. If were are going to be honest community resitance to non-binary and trans representation is not new nor is it valid cause for me not to fight for representation. \n\nI find that most folks that believe that the term is not used in South have no non-binary friends nor are they connected to the trans community in any capacity. If you haven't heard this term used regularly in the last few years, you need to expand your social circle to include the non-binary community. It has been used in queer conferences for years in the south. There's even a few shows in the south that use this term, consider **Todxs Nós** about the Brazilian non-binary community. \n\nIf not Latine or Latinx, what term do you suggest I use that communicates my gender identity? For the love of all that is holy don't suggest Latino or Latina",
            "title_similarity": "0.69734764",
            "sentiment_compound": 0.1803
        },
        {
            "id": "hmevn6l",
            "score": 13,
            "text": "Why the fuck is this reposted every fucking week?",
            "title_similarity": "0.23809938",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hmehzyl",
            "score": 1,
            "text": "people are not always referred to in their preferred way, the word is understandable in its context and thus a viable word.  the contextual usage of it can be used as a polite insult,  thus it has a viable function.\n\nall in all it shouldn't replace the current Latino, but its an acceptable substitute for specific situations",
            "title_similarity": "0.74446213",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hmeq9ju",
            "score": 1,
            "text": "I’ve always thought that was a very stupid term.  I’m Latino, and I agree - get rid of the term “Latinx”",
            "title_similarity": "0.7161583",
            "sentiment_compound": -0.2944
        },
        {
            "id": "hmevyh9",
            "score": 0,
            "text": "Why do you want your view changed on this? The Latine community has already adopted \"Latine\" as the gender neutral term and the term \"Latinx\" never really got much traction in the first place. Whoever is still saying \"Latinx\" is starting to catch on now - it's already happening.",
            "title_similarity": "0.69986486",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hmex4q0",
            "score": 0,
            "text": "im not from latin america, but i think the term is stupid as well. im filipino, and the term filipinx which some (an even smaller subset of) people have tried to popularize did not gain any traction whatsoever, based on what i see in my day to day and even among college aged people, which you'd think would be the most likely audience. i agree that it smacks of imperialism and personally, a hint of condescension, the big white man telling the dumb native what they should call themselves. but this topic is a weekly topic on cmv, and i've seen some arguments that made me change my mind and stop caring so much about this non-issue that is literally half a world away.\n\nits an american term, created by (from what i've read from here) LGBTQ+ people of hispanic descent. they invented the term for themselves. if they want to use it, and its not demeaning, i don't have the right to complain. i have never encountered anyone who seriously wanted me to use filipinx. from my perspective, it really seems that the backlash to the hated latinx evangelization and testimonies from latinos who despise the term is much bigger than what theyre trying to fight against. \n\nfuck politicians. fuck corporations. this is just another stupid thing they do in their quest for profits and pandering. you complaining about them doing this is equivalent to me complaining about dora the explorer treating me like a 5-year-old. we are not the target audience.\n\nfor another analogy, you complaining about this is like a vietnamese person complaining about old british people using Peking instead of Beijing. only very few people use the term, even fewer people spread the word 'Peking', you can probably get some chinese people really mad about this, given how they already feel about the west and what the west have done to them, but ultimately its a non-issue. maybe there are some british politicians using terms used in the days of empire to appeal to old people, maybe some corporations try to evoke those feelings in old people to make them buy shit. it doesnt matter to you or me if they get duped by them. \n\ni think you telling people that they should use latino/latina is equally as bad as them telling people that they should use latinx. languages change over time, and if more people say things a certain way, the new way is the correct way, and new dictionaries and style guides will reflect that. no one gives a shit what the language institutions say.",
            "title_similarity": "0.70785856",
            "sentiment_compound": -0.9958
        },
        {
            "id": "hmf6yzn",
            "score": 0,
            "text": "Welcome to \"What's Wrong with the Trans Community! Starring Loud and Obnoxious White People!\"\n\nSeriously though, it's painful how White Trans/Trans Allies are all about this bullshit but then when someone from that Community which the new word is for speaks out, they are shunned and written off as no worse than the Transphobes.\n\n\nI've come across a post once where everyone was on agreement that White Trans folk and their Allies are the most loud, obnoxious and annoying people that claim to be progressive. If you're so progressive, why do you not ask the people who you try to help if it actually works for them? Furthermore, why do you shun people when they try and speak against it?",
            "title_similarity": "0.73469704",
            "sentiment_compound": -0.5901
        },
        {
            "id": "hmeigeh",
            "score": 33,
            "text": "Letting people identify themselves in a way they think is accurate and that they are more comfortable with only affects you if you go out of your way to look for something to be offended by. Just let people do their thing and mind your own business. \n\n Don't you think it's ironic that you are criticizing people for wanting to change things in society while dictating how you think society should operate?",
            "title_similarity": "0.7459108",
            "sentiment_compound": -0.1045
        },
        {
            "id": "hmes1bn",
            "score": 10,
            "text": "I have seen this CMV like four different times. These are also the only four time I’ve ever heard the term Latinx. Seems like to stop the usage you just have to stop posting lousyass CMVs.",
            "title_similarity": "0.42229137",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hmf9wl4",
            "score": 121,
            "text": "[deleted]",
            "title_similarity": "0.19114257"
        },
        {
            "id": "hmem5yr",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.19636503"
        },
        {
            "id": "hmeoudm",
            "score": 21,
            "text": "https://en.wikipedia.org/wiki/Gender_neutrality_in_Spanish\n\nWhen you are speaking Spanish and need gender neutral terms, which ones do you prefer? \n\n(If you don't speak Spanish, or if you don't try to use gender neutral terms, then maybe having a strong opinion on this subject is a mistake.)",
            "title_similarity": "0.84648365",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hmekua2",
            "score": 425,
            "text": "I must say that this is one of those things I find there to be far more complaints of use, than actual use.\n\nI have almost never actually seen this strange word being used in the wild. The only reason I know it exists is because of the many jokes deriding it's usage.\n\nYou say “we” must “stop”, but “we” have never started. Of course any term, however absurd, will have an however smal, insignificant minority use it.\n\nI just entered this term into a search engine; all that I retrieved were discussions about how silly it is, with most agreeing it is silly, not actual natural usage of the term, as I very much find for \"latino\".",
            "title_similarity": "0.63451254",
            "sentiment_compound": -0.5679
        },
        {
            "id": "hmevvew",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.19636506"
        },
        {
            "id": "hmeijsi",
            "score": 54,
            "text": "> They see it as a white Western attempt to disrespect the rules of the Spanish language for politicized means, which is linguistic imperialism. \n\nthe term originated in the latin american community.  Originally, it wasn't spoken, only written.  Hence the issues with pronunciation.",
            "title_similarity": "0.797399",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hmeo941",
            "score": 1,
            "text": "i give my place in existence to that one spermatozoon who was second to me in the race..",
            "title_similarity": "0.34058124",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmev8at",
            "score": 17,
            "text": "I’d only like to add that for point 3, the use of Spanish itself as the default language for Latin America is already existing successful linguistic imperialism. What’s a little more at this point? Should the Spaniards and Portuguese be the only ones to have foisted their language on South America?",
            "title_similarity": "0.6319247",
            "sentiment_compound": 0.7691
        },
        {
            "id": "hmeqlb7",
            "score": 4,
            "text": "The only people I have ever heard use the term in real life are latinx women.  The only people I have ever heard rail against it are people on Reddit.  \n\nWho am I to tell these latinx women not to identify how they want to identify?",
            "title_similarity": "0.59413093",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hmf0g1o",
            "score": 29,
            "text": "As a latino, I don't mind at all. If it's not use to hurt people, then why stop it?",
            "title_similarity": "0.67683446",
            "sentiment_compound": 0.1471
        },
        {
            "id": "hmel0ls",
            "score": -3,
            "text": "Yeah it's silly. Only a small minority of a minority actually gets offended all the time about this. But you know, it's the era of echoing the snowflakes these days",
            "title_similarity": "0.47929925",
            "sentiment_compound": 0.0387
        },
        {
            "id": "hmex9gx",
            "score": -1,
            "text": "nobody outside of the American left uses it.  Its just another example of white cultural imperialism.",
            "title_similarity": "0.47213832",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmeyjys",
            "score": 3,
            "text": "CMV: in non-Latino circles, the backlash against this term is largely against the spirit of inclusion it represents, and not any of the stated reasons in this post\n\n\nThere are totally valid reasons that you've alluded to, like \"x\" being unpronounceable in Spanish, and that to some people it represents colonialism from the English language, and that it's an academic term that no one actually identifies with. Or that most people identify with a specific country or ethnicity first before identifying as Latino/a/e. But \"Latin**e**\" avoids most of those issues with just about zero downside\n\n\n99% of the complaints I see from fellow White people is a reaction against an intentional language choice to be more inclusive. The fierceness of the backlash against a term that doesn't concern them is from their overall objection to \"PC\" and \"cancel\" culture in general. Those same people don't want to have to care about their word choice, and most of all they hate the idea that anyone could be upset with them over it",
            "title_similarity": "0.8489758",
            "sentiment_compound": -0.9271
        },
        {
            "id": "hmeoom1",
            "score": 3,
            "text": "I agree with you, sort of.\n\nBut let's look at it this way instead: except for people of Spanish descent, almost nobody in South or Central America (or NA) speaks Spanish because it's their ancestral language. Most of this continent's traditional languages have been completely wiped out. Their language has already been colonized and transitioned to a European one. \n\nOn one hand, this sure looks like neocolonialism. On the other hand, it also feels sort of like correcting a neighbor. \n\nWhat complicates things even more is that gender in language wasn't originally specifically about gender. Gender in language appears to be a holdover from proto-language counting mechanisms. E.g. Japanese and Chinese have different types of suffixes to denote the types of things one is counting. As time goes on, these counters seem to slowly disappear or merge, often until there are one (agender, like English), two, or three counters. These often manifest as \"masculine,\" \"feminine,\" and \"neuter.\" \n\nDon't be fooled, though, even languages like English gender their words. Connotations get attached to words and people tend to associate some nound with specific genders (people referring to boats as 'she') even though there are no extant rules concerning \"proper\" noun-genderization.\n\nSo back to the initial question: should we stop using the term \"Latinx?\" That's not really up to us. All languages shift and change. If those of Latin-American descent (another colonialist term - not a lot of latin-speakers there. Which is especially humorous because afaik French is the most similar language to Latin that presently exists) elect to use an English neologism to describe their heritage and language, who are we to stop them? Does it matter who started it in the grand scheme of things if the people in question adopt the term as they have \"Latino\" in the first place?\n\nMaybe they will, maybe they won't. Language is funny and stupid and I personally am averse to the thought of forcing my political theories on others, but I guess if they end up liking it, that's their prerogative.",
            "title_similarity": "0.7345203",
            "sentiment_compound": 0.9771
        },
        {
            "id": "hmf13bw",
            "score": 0,
            "text": "I Fucking hate latinx with a burning passion it just doesnt fucking work i would like latine better because it actually flows and can pronounced in spanish. The only minorities who use latinx are the americanized latinos who guess what? Mainly speak english and some cases dont speak spanish at all.\n\nPeople need to understand that spanish is a heavily gender language and that slapping the x is not a solution.",
            "title_similarity": "0.8573602",
            "sentiment_compound": 0.3496
        },
        {
            "id": "hmf4dn0",
            "score": 0,
            "text": "This is the dumbest case of virtual signaling I have ever seen. Nobody uses “Latinx”, and as you mentioned it’s impossible to pronounce in Spanish. It’s just a stupid way to appear more inclusive.",
            "title_similarity": "0.6544613",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hmf58xz",
            "score": 0,
            "text": "Most of my social circle is Latino and they think Latinx is stupid. It’s a ridiculous invention of white liberals to create victimization where it doesn’t exist",
            "title_similarity": "0.7158501",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hmf60oo",
            "score": 0,
            "text": "I feel it’s overcorrecting by all the activists and lgbtq progressive goals of this time. Latino is already gender neutral, so shouldn’t it already encompass all genders, even non-conforming ones? I see it like the word mankind. Mankind (to me) encompasses men, women, and everything in between. I understand the idea behind it, since gender neutrality often accepts the male form as the “default” but I think it’s just one of those things that’s easy for corporations and white progressives to push while not having to do the “hard” stuff that actually affects social change. Eg., a corporation can start using latinx in their language which “looks” good but they might support the Border wall or conservative legislators who are enacting policies that are harmful to the latin community!\n\nHowever, if someone wants me to call them Latinx, I will. I take it with a grain of salt that Latin people don’t like using the term latinx. Yes, the x sound wouldn’t make sense in Spanish, but historically, latin culture is also very Catholic and anti-LGBTQ. Even if they found a term that made sense linguistically, I think it would take some time for Latin America to accept it and make the phrase common.",
            "title_similarity": "0.79123753",
            "sentiment_compound": 0.9754
        },
        {
            "id": "hmf77xy",
            "score": 0,
            "text": "I don't understand why it became a thing, I've never actually heard anyone say that outloud, and I feel like this is a super fucking overexaggerated issue. That said, I don't know if the proper nomenclature is \"latino/latina\" or \"hispanic\". What is a mexican? What is a cuban? The only one I know for sure is Spain = Hispanic.",
            "title_similarity": "0.5975812",
            "sentiment_compound": 0.8426
        },
        {
            "id": "hmf7y4u",
            "score": 0,
            "text": "1. Actual Latin people hate this word.   \n2. This is a word used by woke people to signal they are woke. \n\n2 good reasons not to use the word.",
            "title_similarity": "0.76717234",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hmfc82m",
            "score": 0,
            "text": "Latin & Latine do great, unless we want to specifically talk about nonbinary latinx people",
            "title_similarity": "0.62844104",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hmfgnxr",
            "score": 0,
            "text": "Yeah, the 10 idiots who use \"Latinx\" dispite the fact that the spanish language is gendered should definitely stop using that goofy ass made up word.",
            "title_similarity": "0.76679945",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hmfgpmu",
            "score": 0,
            "text": "Would it be at all possible to institute a rule whereby any “people should stop saying/doing X” posts are required to be accompanied by citations of X happening in real life? Not on Twitter, not by corporations online, but actually in real life, like at a well attended conference or something? \n\nBecause the top posts on this subreddit are about 50% “complain about Twitter trends.” We already have /r/unpopularopinion\n\nTo OP: please demonstrate that the “hate” (and I’ve seen you use that word) you feel for this term being “pushed” on you is proportional to the amount it actually affects you. Because otherwise this is about as relevant a daily concern as “people shouldn’t identify as dragons”, *but* it has the unfortunate side effect of being a very effective springboard to dismiss the very real concerns of NB and trans Spanish speakers who face very real difficulties being heard and accepted in their communities / countries of origin.\n\nSo that’s why you should just deal with it, essentially. Harm is low to you, potential harm to others from stigmatizing the term is high.",
            "title_similarity": "0.60026276",
            "sentiment_compound": -0.6172
        },
        {
            "id": "hmfjqbc",
            "score": 0,
            "text": "Not gonna try to change your view but support it…\n\nThe term Latinx is an idiotic attempt at trying to adapt a gendered Romance language such as Spanish to contemporary English-speaking social justice discourse.\n\nRomance languages did not make nouns masculine or feminine because they thought of them as manly or womanly (like a ship in English). It’s just the way Romance languages work. High and Low Germanic languages also sort nouns in two groups or sometimes three like German.\n\nThe word “toga” for example is feminine in Latin, Spanish, French (toge), Italian, Portuguese and Romanian. We need to have a grammatical noun group in Romance languages so that we can properly conjugate verbs, adjectives and possessive pronouns accordingly.\n\n“Un libro” (one book) singular in Italian becomes the plural “Due libri” (two books).\n\nAs a general rule, when you have a group of masculine and feminine nouns to conjugate in plural, the masculine form takes precedence, even if there is a ratio of 1 masculine to 9 feminine nouns. Again, nothing to do with manly or womanly, or with perpetuating the patriarchy:\n\n> “Mio libro è caduto” (my book has fallen, masculine singular “o”)\n\n> “Miei libri sono caduti” (my books have fallen, masculine plural “i”)\n\n> “Mia rivista è caduta” (my magazine has fallen, feminine singular “a”)\n\n> “Mie riviste sono cadute” (my magazines have fallen, feminine plural “e”)\n\n> “Mio libro e le mie riviste sono caduti (my book and my magazines have fallen, defaulting to masculine plural “i”)\n\nIt’s the same concept in Spanish for latino (masculine singular), latina (feminine singular), latinos (masculine plural), latinas (feminine plural) and latinos (default plural).\n\nIt’s not about the patriarchy. You need nouns to fall into the masculine or feminine group, otherwise it is impossible to put a single sentence together.\n\nTo use X to remove gender in Romance languages would be idiotic because you would have to end every noun, adjective and possessive pronoun with an X in order no avoid offending anyone.\n\n> “Mix librx e le mix rivistx sono cadutx”",
            "title_similarity": "0.8458353",
            "sentiment_compound": 0.944
        },
        {
            "id": "hmfo2xn",
            "score": 0,
            "text": "1. It’s an English word now - welcome to English where we steal words like fuck and then butcher their spelling and pronunciation. I’ve never seen it used in Spanish outside of a hashtag.\n\n2. Latinx is used to include non binary, intersex, trans, etc people as well that don’t fit the gendered binary of the language. It’s also used as an ungendered form of the word by those who like that, and has been used in some Spanish academia for a while as an unspoken placeholder term to differentiate between Latinos (supergroup) and Latinos (group of dudes). Different people use it for different reasons.\n\n3. Again it’s an English word now, ask the native French how they feel about English butchering their words.\n\n5. See 1 and 4. Some people like some people hate it. I met a lot more of the former than the latter, and all do the latter tried to uses it in Spanish as that’s their primary language. Anecdotal but that’s all I got for this one.",
            "title_similarity": "0.7466937",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hmfqjc6",
            "score": 0,
            "text": "My issue with it is that it's linguistically awkward to refer to even in English. Eg, what's the plural of it? How about the possessive plural?  I have the same problem with \"GenZ\".  \nNevertheless, a group of people are using a term that is not offensive and doesn't hurt anyone so just leave it alone. Attempts to change and/or control the behavior of many people because you as an individual don't like it is narcissistic. Furthermore, English is a descriptive language, not prescriptive. Meaning, dictionaries and English books write down and describe however people happen to be actively using the language.",
            "title_similarity": "0.8286525",
            "sentiment_compound": -0.3803
        },
        {
            "id": "hmfwzat",
            "score": 0,
            "text": "To me its a form of linguistic colonialism from quite progressives on my native language.\nThey wish to impose their western ideals and change one of the very foundations of the culture, its language.",
            "title_similarity": "0.6190843",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hmg2nnj",
            "score": 0,
            "text": "It seems like the new White.  Let's erase all your individual identities and be one group that thinks and acts the same.  I hate that few of my ethnic traditions were passed down in order to assimilate",
            "title_similarity": "0.6618648",
            "sentiment_compound": -0.296
        },
        {
            "id": "hmg7esa",
            "score": 0,
            "text": "No one should even attempt to change your view. This term is a perfect example of woke white people telling a minority group how to talk and flexing their own form of white supremecy. I know zero Latinos who use this term and dont mock it every time this is brought up. My mexican mother thinks it's the stupidest shit ever thought up. My peruvian/honduran in laws think it's the stupidest shit ever thought up. We have feminine and masculine terms for everything. Do we stop doing that altogether?! Let's not change a language spoken by hundreds of millions of people because of a few sensitive crybabies acting offended to feel self important. Millions of Latinos live in poverty and struggle to find work and stability in their home countries. If these people really cared, they would be worried about that instead of their perceived issues with misgendering which only hurts feelings of a very very small minority.",
            "title_similarity": "0.6541568",
            "sentiment_compound": -0.9621
        },
        {
            "id": "hmgxm7j",
            "score": 0,
            "text": "Well... as for number 5, that is a very strong Latin American thing, as well... it's just generally an American thing... do I need to share the countless stories in South America of someone who knows nothing about me trying to tell me what to do?  I mean literally any \"harmless\" comment ('how are you?' 'I feel a little tired right now,' 'Oh! Then you must go lie down and rest!' - ummm no, I must continue working, I just mentioned how I feel because you asked - that would be the simplest example, it ranges all the way from complete strangers making comments about my lifestyle choices, when they don't even know anything about my lifestyle....  Latin Americans piss me the fuck off with this shit, it is RAMPANT in South America, and even some of Central America - I was born in the U.S., raised for many years in Japan and China, and then left many years ago to live in SE Asia, Europe from Portugal to Serbia and many places in between, and now Latin America, so I'm confident enough in my comment, speaking just from my experience)...\n\nLet's face it, most people in the Americas, including the U.S. and Canada, do not have staggeringly high IQs, the best educations, or a great sense of respect or politeness engrained in them.... about all they have is a huge ego, gaping chasm of insecurity, and culture of selfishness...  Try Europe and Asia, and you would have a very different picture.  In fact, in Europe and Asia, this wouldn't even be a discussion.\n\nBut... we could also delve into the way \"gringo\" is originally a \"harmless\" word that gets bandied about in derogatory ways amongst some Latin American cultures, and the people that word is used to describe have little to no voice in its use...  I mean... unless you're just a total fucking hypocrite...",
            "title_similarity": "0.6262872",
            "sentiment_compound": 0.7593
        },
        {
            "id": "hmhju9a",
            "score": 0,
            "text": "I will say this: \n\nLatinx isn't made \"for the Latin community.\" It's made primarily for the trans Latin community. \n\nMany trans folks that speak a gendered language feel very uncomfortable, and misgendered. \n\nThe Latin community is widely conservative, and not super supportive of LGBT groups, including trans folks. \n\nLatinx might be a bad term. Actually, for many of the reasons you stated, it is. But a good, gender neutral term to refer to people could be very helpful for trans folks.",
            "title_similarity": "0.8366653",
            "sentiment_compound": 0.5067
        },
        {
            "id": "hmhlx0d",
            "score": 0,
            "text": "Gendered languages in general are a problem and, at their root, ridiculous. Like, who went up to the table and gave it a mental dick? Or went up to the owl and hung a pair of imaginary titties on it? \n\nOne half of my nationality is tied to a country with this ridiculous language type and a somewhat archaic mentality. For example, the word “both”. For 2 men, it’s word A. For 2 women it’s word B. But for a man and a woman, for some reason, it’s word A again, like for men. What the actual hell? Why isn’t the presence of a woman recognised? And this language is in no way short of words, no-no, our writers are world-famous for lengthy-ass novels. In fact, I’ve started using word B in protest, when referring to me, a guy, and my female friends. \n\nSo here’s my issue with your topic. Latino IS in fact masculine. Why not just use the plural? Latinx is overdoing it, perhaps, but why can’t people just use the plural Latine or something closer in pronunciation to their native language?",
            "title_similarity": "0.6501786",
            "sentiment_compound": -0.8806
        },
        {
            "id": "hmitkqe",
            "score": 0,
            "text": "Latin is a language, not an etnicity. Stop historical appropriation.",
            "title_similarity": "0.5147336",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hmew18p",
            "score": 1,
            "text": "I'm going to impose my will on Latinos because my friend hates the term and I like getting on his nerves. He represents like 1:10billion of the population or whatever the current population statistics say. I'll sacrifice the will of the latinos just to get him riled up. \n\nSo latinx is used around him but I personally don't like the word either but I'm not latino so I don't really care or get riled up about it",
            "title_similarity": "0.7964998",
            "sentiment_compound": -0.679
        },
        {
            "id": "hmfqr3h",
            "score": 1,
            "text": "Dear friend, your title should read \"Wex should stop using the phrase Latinx.\"",
            "title_similarity": "0.6077025",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hmfrg3l",
            "score": 1,
            "text": "Hard to change that view because I've never actuality heard anyone use that term",
            "title_similarity": "0.40377563",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hmfs0qc",
            "score": 1,
            "text": "Latine is what I’ve been saying since you can actually say it in spanish",
            "title_similarity": "0.40498304",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmene09",
            "score": 398,
            "text": "[removed]",
            "title_similarity": "0.19636503"
        },
        {
            "id": "hmf3bin",
            "score": 9,
            "text": "Latine is the spanish friendly gender neutral as you said in your post. this is what i see use most amongst non gender conforming friends in mexico \n\nsource: mexican",
            "title_similarity": "0.66207904",
            "sentiment_compound": 0.743
        },
        {
            "id": "hmejp5w",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.19636503"
        },
        {
            "id": "hmejnh1",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.19636503"
        },
        {
            "id": "hmg821w",
            "score": 13,
            "text": "I think there are a number of counterarguments to some of your points here that you don't seem to have addressed.\n\n1. Not all Latinos are Spanish speakers. Latino (in North American English) refers to people of Latin American origin or descent. In particular this includes monolingual English speakers of Latin American heritage, Portuguese speakers from Brazil, French speakers from French Guiana, and speakers of indigenous languages from Latin America. The term for people from specifically Spanish speaking countries is \"Hispanic.\" In particular, I want to push back on your claim that the word is intended for Spanish speakers.\n\n2. Latinx is not supposed to be a Spanish word. The people who support the term are supporting it as an English word. Latino is itself an English loan word from Spanish. However, due to the large number of Spanish speakers in North America, it hasn't fully separated from Spanish and become a purely English word. However, even if Latino is gender neutral in Spanish, it's important to keep in mind that it may not be in English, because the Spanish and English words are distinct. In particular, English has also borrowed Latina, and in English we don't tend to categorize words into male+gender neutral or female, instead English words tend to be either male, female or neutral. \n\nTake for example loans from French like masseur and masseuse. These are fairly gendered as male and female words in English regardless of the fact that French uses the masculine for gender neutral like Spanish does. On the other hand, chauffeur retains its gender-neutral character and loses its masculine character in English, probably as a result of the feminine chauffeuse being so uncommon in English.\n\nThis analogy is intended to support my point that despite the usage in Spanish, Latino and Latina are generally seen as gendered in English, necessitating some form of gender-neutral English word. Some people have opted for just using Latino, and others have opted for Latinx, and others have borrowed gender-neutral versions from Spanish gender-neutral language movements like Latine and Latin.\n\nThe point here is that Latinx doesn't have to be a Spanish word, nor do I believe that most of its advocates intend it to be. It's a perfectly reasonable English word. As a result, I don't see it disrespecting the Spanish language unless people try to force it back into Spanish. (Which some people may do, but I definitely don't think they're anywhere near the majority of people using the word.)\n\nTo summarize, I think you ought to reconceptualize Latinx as an English word that is a modification of a loan from Spanish rather than one intended to be a Spanish one, and additionally it's worth keeping in mind that it doesn't just refer to Spanish speakers.\n\nAnyway these are just the points where I think you could change your view. I do agree with several of your points, but that's off topic on this sub.",
            "title_similarity": "0.73025984",
            "sentiment_compound": 0.9636
        },
        {
            "id": "hmfhnad",
            "score": 15,
            "text": "It’s not a Spanish word, it’s an English word. Its unpronounceability in Spanish is irrelevant - if anything, this highlights the usefulness of it, as (if we are sticking to the typical rules of a language) Latino/a is bringing gender back to a language that lost it hundreds of years ago. \n\nEarly citations are from women who self-identified as latinx. Younger women tend to lead language change with older people and men eventually following. The greatest pushback I see comes from those groups (when people choose to identify themselves). \n\nNo one says you have to use it, and I don’t think anyone should say I have to not use it. We can each choose to or not to use it; linguistic prescriptivism is generally a doomed exercise anyway.",
            "title_similarity": "0.7924588",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hmepumm",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.19636503"
        },
        {
            "id": "hmf5jdb",
            "score": 5,
            "text": "Wow, so many thoughts. For starters, let's acknowledge some things. First, Latinx is absolutely a term solely used in the U.S. I'm one of those people who use the term, because I believe in its inclusive nature, however, I also recognize the term isn't native to Spanish (native Soanish-speaker btw). Second, the term was created (again in the states) to address a feeling that \"Latino\" created an exclusive definition for those who did not want to be bound to the masculine nature of the culture -- language just being one example. \n\nThis is all to say you're both right and wrong. According to Pew Research, a majority of ~Latinos~ in the US don't identify as \"Latinx\", most identify as \"Hispanic\", but (if I remember the research correctly) this in itself is still a small number. Many individuals identify themselves based on the country they or their family is from, or use multiple identifiers. Additionally, by using an alternative, you acknowledge there is a need for a term like \"Latinx\" (such as Latine). Many Latin American surveys have shown Latine is an option, but even then opinions vary. \n\nMost important to this argument though is that the use of any term, including Latinx, requires a group consensus and this is simply difficult. No group can convene and vote on the most acceptable term; take for example the Black community in the US -- many of whom prefer to be called African American, Black American or simply Black. Unless there's some conference of every Latinx individual living in the states, then there's going to be some disagreement on how we should be called as a population. The Latinx community is notoriously prideful about how we are identified (examples include always ready to rep a flag, arguments about which is country is the best, etc). The reason why Latinx is one of the best options *in the states* is because it was created by the community. The term Hispanic was generated by the US Census to identify large groups of Brown laborers and just stuck. This is my personal least favorite identifier and unfortunately still stays due to it being a data identifier.\n\nThere's a sense of a \"if it ain't broke, don't fix it\" mentality, esp. for Spanish language purists, but I don't think it causes as much harm as folks try to assume. I most.often hear this term in the activist world and believe this is actually why the term should be used in the states. It not only acknowledges those who come from Latin America, but those who were born here and have this \"ni de aquí, ni de allá\" feeling. It's a way to be inclusive in a variety of ways, and not shit on the feelings of other with a sense of entitlement or elitism. But again, we use multiple identifiers (I identify as a Latinx woman and a Latina), and that's totally fine. To completely rid of the word is ignorant to the minority that seek to use it.  Thanks for coming to my TED talk.",
            "title_similarity": "0.7695618",
            "sentiment_compound": 0.9205
        },
        {
            "id": "hmfiylr",
            "score": 7,
            "text": "Oh God not this guy again.  Will someone please just look at his post history.  He is baiting all of you.",
            "title_similarity": "0.5163492",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hmfyr41",
            "score": 8,
            "text": ">“Latino” is gender neutral in Spanish already\n\nThis is not true. \"Latino\" denotes male and \"Latina\" denotes female. When discussing plural people, the default is the masculine. It doesn't remove the masculine connotations of the term. Think about \"policemen\", \"postmen\", etc being used as plural despite women being in both of these fields. The \"men\" in the phrase hasn't become gender-neutral, it's just the default.\n\n>it does not have the sexist connotation that English-speakers assume it does\n\nWhether or not defaulting to masculine terms for groups is sexist (a separate argument), this is not why \"Latinx\" was coined, it was specifically to make a gender-neutral term, particularly for the inclusion of non-binary people.\n\n>The term is largely pushed by progressive white Americans against the will of the Latino community in the US.\n\nOk, and I know Lantine people who say the opposite - that they want Latinx/Latine/something else to be popularized and white americans are the ones throwing fits about it. I, as a white person, started using \"Latine\" BECAUSE Latine/Latinx people told me to. Your view here is 100% formed by personal experience (or assumptions) and is not necessarily representative of the broad spectrum of opinions on the subject.\n\nLatinix was attempted to be popularized first, until spanish-speakers rightfully critiqued it for the weird pronunciation/spelling. \"Latine\" came after (though it may have been *used* before, it became popularized as a better alternative to \"Latinix\" that doesn't just dismiss the reason for trying to coin a new term to begin with).  \n\n>If you know someone identifies as a woman or a man just call them Latino or Latina.\n\nk, so what are we doing for non-binary people, since this was a major reason for coining the term in the first place...?\n\n>So why are people NOT listening to the majority of Latinos who do not want to be called Latinx? \n\nBecause I've yet to see trans Latine people en masse criticize either term (beyond wanting to find something that is spelled less weirdly, hence Latine), and have been told by them to use it. This is a situation where I'm much more likely to look to trans Latine opinions on this, because cis people often dismiss this not because of the inherent Badness of the term, but because they fundamentally do not agree with gender-neutral phrasing. This goes beyond Latinx itself.",
            "title_similarity": "0.8166582",
            "sentiment_compound": -0.2972
        },
        {
            "id": "hmf5bck",
            "score": 13,
            "text": "The term Latino might be gender neutral in Spanish. But the term Latinx is an English term, a great number of languages take words from other languages and apply it in a way that fits theirs. (Ex. Football - fútbol). \n\nBesides that, people who use the term Latinx are doing so when trying to leave room for ambiguity or to respect someone’s gender identity. Because as you said Latino has a masculine connotation even if it can be neutral as well. And for people who don’t identify with feminine or masculine pronouns it is borderline impossible to speak a lot of Latin languages because of how heavily gendered most words are, with zero existing neutral alternatives. \n\nLanguages like Spanish and Portuguese were not built for gender neutrality. In Portuguese you cannot say “Thank you” without gendering yourself (obrigado - obrigada), they’re exclusive gendered words. Since the expansion of the English language into Latin America, more and more people residing in those countries are becoming fluent and often engaging in media exclusively in English which leaves a lot of room for neutrality. \n\nSo when words like Latinx come up it gives these people an ability to have their neutral identity be respected or to address others with those identities. It is not a word meant for the masses to benefit off of. Very much like gender neutral bathrooms, which are not there so that the masses can be pleased the reason for their existence helps those who are already undesirable in the eyes of the public, especially in Latin America, transgender& non binary people for the most part.\n\nThe majority of the people is not the focus, but applying neutrality in broader terms to refer to all aids in making the word more common and give it the ability for more use within the communities of those people\n\nBottom line: Latin languages are currently in evolution, the emersion of gender neutral terms and the use of “e” instead of “a” and “o” is slowly becoming more prevalent in those languages. But it is very new and English is still a crutch. And assuming you are Americans, then you’ll understand that the notion that people have to stop engaging in free speech because the masses don’t like what they’re saying is something that 1. Won’t happen and 2. Shouldn’t happen",
            "title_similarity": "0.8804006",
            "sentiment_compound": 0.995
        },
        {
            "id": "hmemtd7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.19636503"
        },
        {
            "id": "hmerho4",
            "score": 1,
            "text": "Labels are stupid in my opinion but do as you please because I don't care....",
            "title_similarity": "0.7287507",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hmesp13",
            "score": 1,
            "text": "I'd argue that the only reason this is 'wrong' is because all but 10 people never started using it in the first place.",
            "title_similarity": "0.5233648",
            "sentiment_compound": -0.4118
        },
        {
            "id": "hmezvyu",
            "score": 1,
            "text": "I never started using it in the first place 🤷",
            "title_similarity": "0.23329425",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmf0z9g",
            "score": 1,
            "text": "Does anyone actually use the “Latinx” term in real life?",
            "title_similarity": "0.33382124",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmf10j8",
            "score": 1,
            "text": "I want to be called LatinG\n\nY’all want to label without my choice still lol fuck X",
            "title_similarity": "0.69475067",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hmf180s",
            "score": 1,
            "text": "Its a generational thing. I dont know any Latin folks my age(34) who even entertain that word.",
            "title_similarity": "0.39087814",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hmf1hyc",
            "score": 1,
            "text": "It's intended to benefit latinas. So I think the question is what fraction of them like it. \n\nYes, we are attempting to force other cultures to become less sexist, and I'm good with that if is appreciated by their women.",
            "title_similarity": "0.68873906",
            "sentiment_compound": 0.9246
        },
        {
            "id": "hmf1oe3",
            "score": 2,
            "text": "While I agree with your argument, a few people have brought up the point that you haven’t specifically identified who the “we” are who use this term in the first place. \n\nThis should probably be added to the rules for the whole CMV subreddit, but when attacking a position, one should identify specifically who holds this position and cite examples of specific people espousing it. Otherwise this page could become endless culture wars against straw men and attacking views that no one holds.",
            "title_similarity": "0.78889",
            "sentiment_compound": -0.9493
        },
        {
            "id": "hmf28d3",
            "score": 1,
            "text": "Yes. My Gf is Latin and her whole family finds it ridiculous.",
            "title_similarity": "0.55621976",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hmf3cpy",
            "score": 1,
            "text": "What about the entertainment aspect of it? It is quite funny as far as controversies go.",
            "title_similarity": "0.40737832",
            "sentiment_compound": 0.7178
        },
        {
            "id": "hmf3pca",
            "score": 1,
            "text": "I don’t really have an opinion on this because I’m not Hispanic. I’ll call people what ever they want to be called. However every Hispanic person I’ve spoken to about this absolutely despises the term Latinx.",
            "title_similarity": "0.7669395",
            "sentiment_compound": -0.4576
        },
        {
            "id": "hmf4ap3",
            "score": 2,
            "text": "I'm not American and English isn't even my native language, so aside from seeing Latin-American people complain about this online I don't really know much about this.\n\nHowever, I'm wondering, when you say:\n\n> “Latino” is gender neutral in Spanish already \n\nIf you see someone who looks on the outside to be female, but they haven't told you that they are, would it be considered weird to refer to them as Latino?\n\nBecause as I understand it, that's the situation where you'd e.g. refer to that person as \"they\" rather than \"she\". And so if it'd be weird to refer to them as Latino, then it apparently does not have a truly neutral connotation, and it makes sense that people go looking for an alternative term.",
            "title_similarity": "0.8226637",
            "sentiment_compound": -0.7881
        },
        {
            "id": "hmf754m",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.19636503"
        },
        {
            "id": "hmf7gx0",
            "score": 1,
            "text": "Maybe not ‘view changing’, but from the perspective of other cultures, many white heterosexuals, particularly conservatives, would hate a term that demasculinizes them even if overall it’s technically more inclusive, they would rate their feelings as more important than the 3% even if it was only a mild inconvenience.  I do agree that co-opting the language of a culture is a little tone deaf in that direction, but we do it all the time with little thought for how the  untrue feels about it.\n\nFor referring to ‘them’ as Latinx even though they don’t like it or don’t use it themselves, I would argue that that happens almost universally as well…the word doesn’t have to be for them, we refer to people as Mexicans, Africans, and others regardless of how they refer to themselves.  In addition to being culturally and racially insensitive, often they are literally incorrect, but it’s not something we would expect them to use themselves.  I might refer to someone from New York as a New Yorker, even though they themselves don’t really identify themselves that way…but if they hear the term on TV saying all ‘New Yorkers’ will be taxed for such and such, they would immediately understand that they would be affected.  If we decided that term was somehow too ‘something’ and started calling them ‘New Yorkies’ or something, they might hate it and insist we keep calling them ‘New Yorkers’, it’s not up to us to keep using the old term.\n\nAs for Latino already being gender neutral, it may be gender neutral within the language, but since Latina exists, externally Latino seems to be the match for it so externally it’s what would be applied to men.  Overly sensitive, probably, but jut like ‘guys’ is arguably gender neutral *when it’s intended that way* it’s easy to see how it would be confusing and some might prefer *people* or something instead.\n\nSo basically probably the tail wagging the dog here, but people hating a change doesn’t mean the change is bad, lots of people just hate change, and that change coming externally certainly makes it worse.  I have conservative relatives that hate change even when it doesn’t affect them in any way.",
            "title_similarity": "0.87619984",
            "sentiment_compound": -0.9862
        },
        {
            "id": "hmf8vlu",
            "score": 1,
            "text": "Is the root,  foundational problem that Spanish doesn't have a gender neutral third person pleural word? \n\nThe same way English doesn't have a second person pleural,  so we use things like y'all and yinz. And Latinx is an attempt to create that word?\n\nETA: is there a precedence in Spanish that other words end in X? Or is this a fundamentally,  novel use of the letter to denote gender neutrality?  I don't speak Spanish.",
            "title_similarity": "0.7999191",
            "sentiment_compound": 0.6322
        },
        {
            "id": "hmf9jsl",
            "score": 7,
            "text": "I've asked a number of latino/latinx/latine folks about this, and have received mixed answers (I'm more or less fluent in Spanish). Anecdotally, the overwhelming majority of LGBT people I've asked have responded positively about the use of the term, but feel that latine makes more sense - with the caveat that many of them didn't know about latine until I brought it up to them. The majority of the responses I've received have been generally in favor of using it, but I have a bias in my sample, as it has been nearly all younger people (20-30 range).\n\nI would consider many of these people a part of my friend group/social circle. If this is my primary interaction with the latin community, why shouldn't I use a term they are in support of being used? Sure, their parents might not like the term, but I'm not hanging out with their parents. Similarly in English, singular they/them is contested in public debate, but I'll use it, even when speaking about someone I don't know, as my friend group/community supports the use of it.",
            "title_similarity": "0.71677125",
            "sentiment_compound": 0.9682
        },
        {
            "id": "hmfaaxs",
            "score": 1,
            "text": "All I see is whining about using latinX , and hardly any  use of latinX.",
            "title_similarity": "0.58591616",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmfb54e",
            "score": 1,
            "text": "Hello Italian here can we just redo the whole thing because Latin still means something else to the rest of the world",
            "title_similarity": "0.67166305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmfbngs",
            "score": 1,
            "text": "The fuck is Latinx?",
            "title_similarity": "0.34018874",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hmfdpcf",
            "score": 1,
            "text": "We are LATINOS. That's it.",
            "title_similarity": "0.32425815",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmfh37x",
            "score": 1,
            "text": "Latinx could be an excellent name for a Spanish focused Linux distribution....",
            "title_similarity": "0.5083866",
            "sentiment_compound": 0.743
        },
        {
            "id": "hmfha1f",
            "score": 2,
            "text": "I swear to god this topic appears almost weekly.",
            "title_similarity": "0.054921538",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hmfipzl",
            "score": 1,
            "text": "There are plenty of  latino lgbt people who use and go by Latinx, the origins and use of it is from latino communities. It doesn't need to be stopped being used but there does need to be accomations for the vast amount of latinos who hate the term, So like when a celebrity or politician refer to latino communities they can say latino, latinx communities instead of just latinx. And if a latino person wants to refer to themselves as latino, fine. If a latino person wants to refer to themselves as latinx, fine.",
            "title_similarity": "0.69745064",
            "sentiment_compound": 0.3098
        },
        {
            "id": "hmfkp8d",
            "score": 1,
            "text": "Doesn't the term Latin(O,A,X) have origins in European colonialism of South America? I am genuinely curious why the term is accepted at all, regardless of the ending, as it has roots in clumping a large swath of otherwise disparate peoples under a fictitious ethnicity. \n\nLike Brazilian people are very different than Cuban people, yet they're all considered Latin peoples?",
            "title_similarity": "0.599192",
            "sentiment_compound": 0.7399
        },
        {
            "id": "hmfmjd2",
            "score": 1,
            "text": "Gabriel Iglesias talks about this. It’s for laughs but the message is spot on.",
            "title_similarity": "0.5284616",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hmfmovc",
            "score": 2,
            "text": "Seems op has shifted their original points a few times without granting deltas. \n\nWhy are you here if you’re going to do that?",
            "title_similarity": "0.51795924",
            "sentiment_compound": 0.0869
        },
        {
            "id": "hmfmxdw",
            "score": 1,
            "text": "My Mexican best friend has indicated to me that LatinX is a joke and mainly used by white people in America to make themselves feel better or something? Idk just call them latinos or their name or their specific culture",
            "title_similarity": "0.6481868",
            "sentiment_compound": 0.9022
        },
        {
            "id": "hmfpolz",
            "score": 1,
            "text": "Probably won't change your mind but it is easy to pronounce: la-teenks. Keep saying it that way and they might just start using Latin, which should be perfectly acceptable for everyone concerned. Except those who want a hard gender neutering.",
            "title_similarity": "0.7214257",
            "sentiment_compound": 0.9253
        },
        {
            "id": "hmfqe7s",
            "score": 1,
            "text": "I’ll be honest, I’ve never even heard the term, 😂! I am a Caucasian Spanish teacher, and it just sounds stupid to me. But that’s MHO.",
            "title_similarity": "0.6637324",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hmftxir",
            "score": 1,
            "text": "Person A: \"When did you start using that word, _Latinx_?\"  \nPerson B: \"I once saw it on Reddit and wondered what it was. Have been using it ever since.\"",
            "title_similarity": "0.3466288",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmfuxxs",
            "score": 1,
            "text": "Because of Anglo Cultural imperialism.",
            "title_similarity": "0.46292534",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmfy4l2",
            "score": 1,
            "text": "The only people using Latinx are confused whites",
            "title_similarity": "0.5141034",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hmfzzy9",
            "score": 1,
            "text": "While I agree with this intuitively, I think you can make a stronger argument if you include specific recent examples of Latinx being used as opposed to just a generalized grouping of \"white progressive Americans\".",
            "title_similarity": "0.6636962",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hmg1ck9",
            "score": 1,
            "text": "In my experience with the Hispanic community in Dallas Texas, LatinX was used mainly by college educated Hispanic people from 2019 through 2020. They've since moved on, maybe everybody else should too.",
            "title_similarity": "0.40521687",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmg1mdy",
            "score": 1,
            "text": "It is only Latin if it comes from the Italian province of Lazio.",
            "title_similarity": "0.37848186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmg1ymm",
            "score": 1,
            "text": "I just never started.. 🤷🏻‍♂️",
            "title_similarity": "0.20379534",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmg31fu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.19636506"
        },
        {
            "id": "hmg5382",
            "score": 1,
            "text": "Luh-teen-ix is totally unpronounceable in Spanish?",
            "title_similarity": "0.5960875",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmg5bhj",
            "score": 1,
            "text": "I was at a comedy show the other day, stand-up made a joke about this and asked the audience. (40% Latino audience) and they all all booed.\n\nGives me hope this BS term will fizzle out.",
            "title_similarity": "0.46434033",
            "sentiment_compound": 0.765
        },
        {
            "id": "hmg75vx",
            "score": 1,
            "text": "I’ve actually seen this talked about before. I’m not Latino, or from an area that has an abundance of Latino culturw. Without the usage of Latinx, how is the trans community and gender nonconformance accepted overall? \n\nIt reminds me of folks vs folx which some also find unnecessary because the term doesn’t specify gender. I’m pretty neutral on the term, but I generally stick to the traditional spelling. I think the expectation that other languages can adapt in the same way as English is problematic, but I don’t know another language to comment on if it’s something that is possible.\n\nI will say that it can be a helpful indicator of safety with the knowledge that people who use the spelling are likely to be inclusive and understanding of marginalized groups. That may be more important to some than offering a grammatically correct spelling.",
            "title_similarity": "0.8253795",
            "sentiment_compound": 0.8334
        },
        {
            "id": "hmg8a0x",
            "score": 1,
            "text": "You are not wrong. They expext us to xall you gringox?",
            "title_similarity": "0.35352445",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hmg8fbl",
            "score": 1,
            "text": "I’m from South Texas so we just call ourselves Tejanos. I don’t like using any of those terms they give us.",
            "title_similarity": "0.62467927",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hmgam4d",
            "score": 1,
            "text": "What about Filipinx ?",
            "title_similarity": "0.188164",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmgc7pa",
            "score": 1,
            "text": ">Latin\n\nThe term Latin(s) already refers to a specific people, albeit disappeared as such, and citizens of multiple countries feel they're their roots, at least partially.",
            "title_similarity": "0.54905593",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmgcr0u",
            "score": 1,
            "text": "I just think it’s stupid.  It was a term likely created by a liberal white woman anyway.",
            "title_similarity": "0.6291489",
            "sentiment_compound": -0.34
        },
        {
            "id": "hmgcv42",
            "score": 1,
            "text": "Only woke tumblr white people use that stupid term. Filipinos is gender neutral and don’t go by filipinX either",
            "title_similarity": "0.62907547",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hmgdor9",
            "score": 1,
            "text": "Amen",
            "title_similarity": "0.038326696",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmgdx4c",
            "score": 1,
            "text": "So there’s a pandemic going on among many other things yet we’re gonna worry about this bullshit? Cool",
            "title_similarity": "0.61528623",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hmgi8ro",
            "score": 1,
            "text": "Are you sure it’s widely agreed by Spanish speakers that “latino” used as a gender-neutral term has no sexist undercurrents? In Italian there is now a common practice to address mixed gender groups with both vowel endings rather than the all-encompassing masculine o - you’ll hear things like “ragazzi e ragazze” or read things like “tutti/e.” There is even a (small but growing) movement now to use an asterisk as a non-gendered vowel ending (tutt* instead of tutti/e). This is all happening within Italy itself, not within any particular Italian diaspora.",
            "title_similarity": "0.6694901",
            "sentiment_compound": 0.631
        },
        {
            "id": "hmgidem",
            "score": 1,
            "text": "My question is, was this term coined by woke white culture or the Latino community?\n\nI personally think it sounds dumb but I grew up in Miami for a time, Florida most of my life. I have a different understanding of Latino culture. None of my Spanish friends use this term, or at least, not around me.",
            "title_similarity": "0.53838414",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hmgkgvw",
            "score": 1,
            "text": "It’s the soft bigotry of low expectations. White progressives tend to think they know what’s best for minorities - even when they explicitly denounce any attempts of their supposed good will toward the communities.",
            "title_similarity": "0.71186626",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hmgkolq",
            "score": 1,
            "text": "Maybe the idea of “We” is problematic. You should definitely stop using it if it seems silly to you. I never used it because I speak Spanish and the entire concept around the term is, I think, ridiculous and culturally offensive.\n\nBut those who see it as sexist are right to push for the change. The issue is really this simple question: Does someone taking offense at something MEAN that thing is offensive enough to need change?\n\nThis is the conundrum of cultural change throughout history. Validity is completely subjective.\n\nTherefore I disagree that the collective social “We” should stop using it, but those who think that absurd should continue to resist it.",
            "title_similarity": "0.8991642",
            "sentiment_compound": -0.9337
        },
        {
            "id": "hmgkt3x",
            "score": 1,
            "text": "How did this give away 8 deltas? I’ll make it very easy for objectors to the OP: he’s right. I’m Latino. I prefer to call myself Spanish and Indian, or mestizo, but I’ll take any of these terms over Latinx. Latinos don’t like the term, and we don’t use it. It is politically toxic. It’s one of those things that according to polls white progressives love and Latinos hate, and it’s more likely to push them away from the Democratic Party, which as a conservative, I think is great. \n\nLatinate or Romance languages are essentially gendered. Neutering them robs them of their intelligibility, and their sonorous tone. It’s evil. It’s based on a presumption that not using the word is bad. Progressive neologisms are totally inorganic because they’re imposed from on high rather than coming from people themselves and their vernacular. It’s a counterproductive exercise because there will remain plenty of other words which require “changing” in order to accommodate this project. What’s next? Señorx?",
            "title_similarity": "0.8194237",
            "sentiment_compound": 0.8265
        },
        {
            "id": "hmgl5hq",
            "score": 1,
            "text": "I am from Mexico living in the US. This term is absolutely cringe to me. I probably hate it more than Americans.",
            "title_similarity": "0.6957147",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hmglo97",
            "score": 1,
            "text": "Yeah. This isn't rocket science. I can't believe that some idiots probably in some random American adult babysitting institution (university) were able to even popularise it in the first place.",
            "title_similarity": "0.53260326",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hmglv4o",
            "score": 1,
            "text": "The Anglo Saxons need to stop messing with other people's cultures.",
            "title_similarity": "0.7030865",
            "sentiment_compound": -0.296
        },
        {
            "id": "hmgm565",
            "score": 1,
            "text": "I am sorrry but Latino is not gender neutral in Spanish, it literally means male latin person in Spanish. Latina if you are Female, Latino if you are male.\nApart from that I do agree in most of your arguments and I do get super triggered as a latino with this term as it feels as the USA is appropriating my own language.",
            "title_similarity": "0.7893428",
            "sentiment_compound": 0.6863
        },
        {
            "id": "hmgn6m3",
            "score": 1,
            "text": "I think people born in America might use it more, seeing as our language doesn't have words with masculine and feminine words.\n\nI really do feel that native speakers don't give a shit like we do about those articles.\n\nI also believe they don't have the same discussions as we do because of the differences in the language.\n\nI don't like the word, but I can understand both sides of the argument.",
            "title_similarity": "0.8333936",
            "sentiment_compound": -0.2716
        },
        {
            "id": "hmgob7l",
            "score": 1,
            "text": "Same goes for \"African-American\".",
            "title_similarity": "0.19075568",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmgp5q1",
            "score": 1,
            "text": "The only people I have seen use it are white sjw types. The Latinos i have asked about it think its stupid and they don't care.",
            "title_similarity": "0.6692452",
            "sentiment_compound": -0.7208
        },
        {
            "id": "hmgptzj",
            "score": 1,
            "text": "Should the 3% of people who identify as latinx also stop using the term? Why?",
            "title_similarity": "0.51559985",
            "sentiment_compound": -0.3736
        },
        {
            "id": "hmgs306",
            "score": 1,
            "text": "Wait, do you actually know anyone in real life that uses that term?",
            "title_similarity": "0.1970348",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmgsbhg",
            "score": 1,
            "text": "The point of the word \"Latinx\" is not quite the reason you think. It originated in Puerto Rican LGBT circles as a nonbinary alternative to Latina and Latino.\n\nIt's not pushed by white progressives so much as by Puerto Ricans, especially nonbinary or feminist Puerto Ricans. [It\"s been in common use at the University of Puerto Rico, a Spanish speaking university, for years now](https://web.archive.org/web/20190821200657/https://www.chronicle.com/blogs/linguafranca/2018/05/01/the-cross-lingual-intersextionality-of-latinx/). [Here's a member of their faculty arguing for the x in Spanish](https://web.archive.org/web/20190821210713/http://www.80grados.net/de-la-a-la-x/).\n\nWhich is also to say, of course most Hispanic people don't like it. Most Hispanic people don't like vosotros either, but that's a perfectly good word in Castillian Spanish.\n\n(Furthermore, many English speakers today really don't like \"Ms\", and will say that they don't like singular \"they\" even as they use it all the time.)",
            "title_similarity": "0.65418375",
            "sentiment_compound": 0.42
        },
        {
            "id": "hmgun5v",
            "score": 1,
            "text": "…and ALL other nutty pronouns.  This has become utter bullshit.",
            "title_similarity": "0.5238503",
            "sentiment_compound": -0.624
        },
        {
            "id": "hmgzq3s",
            "score": 1,
            "text": "Not going to change your view. You're entirely correct",
            "title_similarity": "0.30942842",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmh0cqd",
            "score": 1,
            "text": "Specifically on your third point. I've only really heard it used by younger generations amd only by actual laying, latinex, however you feel most comfortable referring to it. It seems this is always added into the dialog complaining about common word usage. Sort of makes me thing of using they/their pronouns with transgender. It's more a mild inconvenience to start thinking about word usage. It seems just use what the person prefers.",
            "title_similarity": "0.7259264",
            "sentiment_compound": 0.0076
        },
        {
            "id": "hmh3sbg",
            "score": 2,
            "text": "As a latino I don't really care what term you use. Sure you can call me latinx but for most of us if not all it will feel weird and you might get a weird look with it.\n\nLatin culture is less \"inclusive\". We don't really care if is a female or male we have better things to worry about.\n\nPS: I speak for the mayority not every single one of the Latinos on earth.",
            "title_similarity": "0.7708788",
            "sentiment_compound": -0.7986
        },
        {
            "id": "hmh8ecc",
            "score": 1,
            "text": "Wait, who tf calls anyone latinx ? Lmao",
            "title_similarity": "0.38493836",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hmhc4tc",
            "score": 1,
            "text": "I’m Latino and live on a south border city in Texas where the majority of people here are Latino and literally no one I know has ever referred to themselves in that that way, and a majority of us here consider it as an insult, we don’t like it and don’t use it.",
            "title_similarity": "0.5870463",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hmhc9pq",
            "score": 1,
            "text": "Another commenter talked about the origin of the word latinx, which you gave a delta so I won’t touch on that, but I will talk about the context of where Latinx is used, that is, mostly in academic and activist spaces. From personal experience, I’d say Latinos in these spaces are split with the use of latinx as a personal identifier but the main purpose of its use is to signal inclusivity and that is very well understood. It also is not looked down upon if Latinos do not want to use the term, no Latino is forced to use it. \n\nAs you can imagine, these spaces are intentionally doing this to show solidarity with marginalized communities, and it’s not as off putting in these contexts as anti-Latinx folks on Reddit would lead you to believe.\n\nCorporations using or misusing the term to virtue signal to consumers is just par for the chorus and has happened with almost any progressive cultural shift.",
            "title_similarity": "0.7486265",
            "sentiment_compound": 0.352
        },
        {
            "id": "hmhez9q",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.19636503"
        },
        {
            "id": "hmhgigy",
            "score": 1,
            "text": "How do you pronounce Latinx? It’s not really much of a term where I live (Texas) so I’ve never heard anyone say it. Ty",
            "title_similarity": "0.45131135",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hmhigqy",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.19636503"
        },
        {
            "id": "hmhjds9",
            "score": 1,
            "text": "It’s stupid. I’m with ya!",
            "title_similarity": "0.3662383",
            "sentiment_compound": -0.5707
        },
        {
            "id": "hmhjob6",
            "score": 1,
            "text": "CMV: The more you put words on a pedestal, the more you give them power over you and ultimately worsen the problem you're trying to prevent...",
            "title_similarity": "0.6231373",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hmhndl6",
            "score": 1,
            "text": "I’m uncomfortable using the term but only because I’m cusp boomer/X and first generation American with a dual citizenship. \n\nLike Archie Leach in A Fish Called Wanda, I’m terrified of saying the wrong thing. \n\nAnd in my lifetime, so many terms have been approved and disapproved. \n\nThere’s so many nuances to making your way in the USA.  I feel so much better about my character and how I affect others if I don’t cause them embarrassment, anguish or shame. \n\nSo every time now that identifying terms gets refined further, I can feel another fifty diverticula (?!?) wrenching open along my intestines. \n\nBecause I just don’t want to hurt anyone. \n\nBut I don’t want to shut up about what’s happening, either. \n\nThat’s my perspective.",
            "title_similarity": "0.6917872",
            "sentiment_compound": -0.9635
        },
        {
            "id": "hmhq59h",
            "score": 2,
            "text": "Yeah it’s dumb, just use Latina for women and Latino for everything else",
            "title_similarity": "0.6730246",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hmhqw2v",
            "score": 1,
            "text": "You can simply pronounced it as Latin ex which sound normal in Spanish. Also Latino is not a gender world in English but it is in Spanish for us Latino is male and latina is female in Spanish most words have gender like when you say ladies and gentlemen, now a days in Spanish you should use \"latinos y latinas\" which can be replaced by Latin X",
            "title_similarity": "0.71789074",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hmhrspo",
            "score": 1,
            "text": "I don't think anyone outside of America uses it",
            "title_similarity": "0.22688414",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmhs876",
            "score": 2,
            "text": "Porque Nosotros que somos Latinos te estamos diciendo so puto Gringo q no nos gusta y no es nuestro Comprendes Cabron?",
            "title_similarity": "0.44416267",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hmhxt07",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.19636503"
        },
        {
            "id": "hmhz0ha",
            "score": 2,
            "text": "If you ask anyone who actually lives in any Latin countries they'll all agree this is some stupid shit some english speaking motherfucker made up for woke points, buut I think at this point I don't care because it's not a term I've seen beyond woke culture",
            "title_similarity": "0.7144278",
            "sentiment_compound": -0.914
        },
        {
            "id": "hmi4qh8",
            "score": 1,
            "text": "The point of new words is to progress a language of fill in a gap. This is a word that is neither useful nor needed. Gendered language does not equal gender as a concept. Just because the word for table is feminine does not mean the table is a girl. It is just part of the language structure. English speakers do not always understand this, which is why it is frustrating they are inserting the term. The word is not easy to pronounce and does not have a use. It should not be “forced” and most likely will not stick in terms of the language. It reminds me of kids shows trying to force slang terms.",
            "title_similarity": "0.78511655",
            "sentiment_compound": -0.601
        },
        {
            "id": "hmi6d0l",
            "score": 1,
            "text": "I don't have a strong opinion on the matter but I would like to direct you to a podcast called Codeswitch, if you haven't already heard of it. They have many episodes that discuss this and similar topics. I live in super- white south dakota so I have no direct experience with anyone using the term no matter what color but I have never heard *of* white people using it,  and many people they talk to on that podcast do identify and embrace being Latinx.",
            "title_similarity": "0.62539804",
            "sentiment_compound": 0.8148
        },
        {
            "id": "hmi7x48",
            "score": 1,
            "text": "Completely agree. Let’s stay authentic, not performative, lest we lose the moral force when it matters.",
            "title_similarity": "0.6023873",
            "sentiment_compound": 0.0498
        },
        {
            "id": "hmiacqy",
            "score": 1,
            "text": "We already stopped.",
            "title_similarity": "0.1993641",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hmicmwz",
            "score": 2,
            "text": "So glad we don’t have this dumb shut in Europe",
            "title_similarity": "0.4866537",
            "sentiment_compound": -0.1486
        },
        {
            "id": "hmicvxy",
            "score": 1,
            "text": "Yup Progressive libs pushing what they feel is best per usual",
            "title_similarity": "0.45974943",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hmij7ge",
            "score": 1,
            "text": "No one uses it but white women anyway.",
            "title_similarity": "0.38672858",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hmimc0p",
            "score": 1,
            "text": "Who even has been using it? Probably just main stream “news”.",
            "title_similarity": "0.29699653",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmiom6l",
            "score": 1,
            "text": "Wasn't it made up by politicians?",
            "title_similarity": "0.2233944",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmipj6b",
            "score": 2,
            "text": "Latino",
            "title_similarity": "0.25351828",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmiqgso",
            "score": 3,
            "text": "Spanish is generally masculine or feminine. End of discussion￼",
            "title_similarity": "0.48797572",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmis5ef",
            "score": 3,
            "text": "White people are going to call you whatever they want, remember how they created \"people of colour\" when they wernt allowed to call them coloured people",
            "title_similarity": "0.44314057",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hmisqnq",
            "score": 3,
            "text": "Agreed. Agreed. White progressive need to meet some things to themselves. They are a specific culture and they do not have monopoly on what is right in the world.",
            "title_similarity": "0.63687414",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hmj0iik",
            "score": 3,
            "text": "I am a latinO, and trust me, we all hate that term.",
            "title_similarity": "0.6353133",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hmj59vq",
            "score": 3,
            "text": "\"LatinX\" is the language of the colonizer.\n\nIt is an attempt to rewrite a native language with the colonizer's values and morals, which were never asked to do so in the first place.\n\nSo let's stop using this silly word and celebrate the cultures as they are.",
            "title_similarity": "0.68678176",
            "sentiment_compound": 0.6151
        },
        {
            "id": "hmjk05d",
            "score": 1,
            "text": "We are speaking the english language not spanish.  Just because the word comes from spanish doesn't mean we are speaking spanish.  When a language borrows a word from another language they do not usually borrow the grammar.  In fact linguists would not even call the word a spanish word anymore.  It is now an english word that came from spanish.\n\nIt's a term used by English speakers speaking to other english speakers.  Objecting to us not following spanish grammar rules when speaking english doesn't make sense.  In english we do not have many gendered words and all words that are gendered are not gender neutral.  Expecting progressive gender inclusive english speakers to be comfortable referring to a woman as latino because of a nuanced understanding of a language they are not speaking doesn't make sense.\n\nIn English latino refers to males and latina refers to females.  Which groups those words refer to in Spanish is not relevant when you're speaking English.",
            "title_similarity": "0.7911381",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hmjsruy",
            "score": 2,
            "text": "I think the Americans didn't really put much thought into this one. Usually in English, you drop the gender postfix from Latin words and you have the English non-gendered version.\nLike Italiano/Italiana simply becomes Italian not ItalianX! Why not just Latin or Latine?",
            "title_similarity": "0.6852629",
            "sentiment_compound": 0.1759
        },
        {
            "id": "hmjuxue",
            "score": 1,
            "text": "I disagree in that it’s not worth the time because I’ve literally never heard that word used before and I live around a bunch of Mexican people.",
            "title_similarity": "0.58267474",
            "sentiment_compound": -0.505
        },
        {
            "id": "hmkaa9n",
            "score": 2,
            "text": "People need to stop framing this debate as if it’s white people pushing the term. Yes there are a lot of white people who use the term but it was created by latinx people who don’t need someone to explain to them that “Latino” is gender neutral. They probably know more about it than you do, and by you I don’t mean OP I just mean people in general.\n\nAlso, there are plenty of terms that are problematic, specifically to one group, but the majority of population is fine with. Does this mean that those terms aren’t problematic just because the majority is fine with them?",
            "title_similarity": "0.81773067",
            "sentiment_compound": -0.3716
        },
        {
            "id": "hmkg9ms",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.19114257"
        },
        {
            "id": "hmmvz3u",
            "score": 1,
            "text": "I'm curious how you feel about the term \"cisgender.\"\n\nLots of cisgender people don't like the term, and don't identify as cisgender.",
            "title_similarity": "0.660401",
            "sentiment_compound": 0.049
        },
        {
            "id": "hrnlkrf",
            "score": 1,
            "text": "Is a stupid term created by Non-Latino, you expect to be taken seriously where is basically a huge contradiction to the language in the first place. I think American have nothing else to do.",
            "title_similarity": "0.76653683",
            "sentiment_compound": -0.4215
        },
        {
            "id": "htustbk",
            "score": 1,
            "text": "For the most part, I agree with you feel like it has its uses in genderqueer/non-binary Latin American spaces and for identifying people on a personal level.",
            "title_similarity": "0.47183114",
            "sentiment_compound": 0.6444
        },
        {
            "id": "htwwbkf",
            "score": 1,
            "text": "I have a questions…\n\nWhy don’t we just identify them as Latins?? \n\n“Latino” or “Latina” translates to “Latin female,” or “Latin male.” \n\nLatin American’s call them selves Latino and Latina because that’s how we identify someone as female or male thru text. (Kinda like Italiano and Italiana) The “a” and “o” are solely for that purpose, so why not identify Them as “Latins” if that’s the translation in English?? \n\nI get Latin is a language belonging to the Italic branch of the European languages. Latin was originally spoken in the area around Rome known as “Latium” aka Italy, but I don’t think there would be an issue identifying as “latin.” I think it would be safe to identify as “latin” as non-binary if the whole region is identified as “Latin America.”",
            "title_similarity": "0.64283776",
            "sentiment_compound": 0.7516
        }
    ]
}