{
    "CMV: Car headlights are becoming too bright\nThey blind people who are driving in front of and behind cars, as well as pedestrians. This is based on my personal experience and talking to other people, but it seems to have gotten worse in the past few years especially.  \n\nHeadlights should only be bright enough for a) other cars to know you’re there and b) you to sufficiently see the road. \n\nThere need to be new regulations on maximum brightness settings and light positioning. You should not be seeing spots for so long after a car passes you. Many times I flash someone who I think has their high beams on, only for them to flash me back. I wonder if companies are following regulations or if there even are regulations on brightness levels and positioning. \n\nI seriously hope someone can change my view because I am sick of avoiding night driving and getting so angry over this. Please CMV.": [
        {
            "id": "hnauhew",
            "score": 1,
            "text": "/u/ohnoitsgravity (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/r9aogf/deltas_awarded_in_cmv_car_headlights_are_becoming/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.51851714",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hna17gq",
            "score": 94,
            "text": "Most of those people are running their lights on high beams which is the cause.",
            "title_similarity": "0.4019939",
            "sentiment_compound": 0.0
        },
        {
            "id": "hna1c1g",
            "score": -83,
            "text": "So, while I broadly agree that there is a problem here, I think you are missing the actual cause. The problem isn't that headlights are too bright, it's that people are used to driving with high-beams on because their former headlights weren't powerful enough. Once that habit changes, we should be back to normal.",
            "title_similarity": "0.83661866",
            "sentiment_compound": -0.5472
        },
        {
            "id": "hnalx2o",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnabyeb",
            "score": 2,
            "text": "1. More light is good when there are no other cars on the road.\n2. The best/newest cars auto dim when they see the red rear lights of other cars (e.g., all Tesla models). This will filter down to all other cars the same way that back up cameras did (now mandatory safety equipment).",
            "title_similarity": "0.79096913",
            "sentiment_compound": 0.6204
        },
        {
            "id": "hnal50e",
            "score": 0,
            "text": "The issue isn't so much that the lights are too bright, but that they're badly aimed. Of course there's the knobs running around with hid bulbs in a reflector housing which scatters ultra bright light everywhere but those are getting rarer. But most newer vehicles are coming with projectors. On a projector housing the light is reflected through a multi step process. properly adjusted, it shines down at a slight angle from the vehicle it's on, and never hits your eyes. One issue is people retrofitting these and not adjusting, a secondary issue is that most are set up for 2 people in the front of the car. Add a bunch of trunk/backseat weight and it's shining up. Id argue that instead of saying lights are too bright, you need to argue in favor of auto adjusting lights. I had adjustables in my 06 Mazda and it was great",
            "title_similarity": "0.77495754",
            "sentiment_compound": 0.836
        },
        {
            "id": "hna1f64",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.102999166"
        },
        {
            "id": "hna7z9r",
            "score": -7,
            "text": "I don't think there's really a limit on how bright is too bright. Sure auto dimming review & side view mirrors And maybe even windshields someday will become necessary but there is no limit to how bright is useful for in front of you when you are traveling at interstate speeds. Having extra time to stop when something gets in the way of your vehicle is life-saving And unless I'm sure that the lights cause more deaths than they prevent I think bright headlights are better. Believe me I pull over all the time to let people go by who have bright headlights and I hate them with a fiery passion, but I kind of also understand why they are there",
            "title_similarity": "0.85283464",
            "sentiment_compound": 0.9528
        },
        {
            "id": "hnaim3e",
            "score": 1,
            "text": "meanwhile there's my car with the headlights so dim and aimed so low that me and my mom can't tell if they're on lol",
            "title_similarity": "0.719796",
            "sentiment_compound": 0.0152
        },
        {
            "id": "hnalbkw",
            "score": 1,
            "text": "Yeah my mom holds her hand in front of the mirror to block them from blinding her. I don't care much but it definitely messes with her driving.",
            "title_similarity": "0.7628871",
            "sentiment_compound": 0.5402
        },
        {
            "id": "hna7s5v",
            "score": 220,
            "text": "The issue is not the brightness of the bulbs. It is either headlights that are not properly aimed or people putting high power bulbs into the older style headlights that leak light like crazy. The high power bulbs are only intended for the newer parabolic projector style headlights that ensure the light is aimed down.",
            "title_similarity": "0.73297894",
            "sentiment_compound": -0.2225
        },
        {
            "id": "hna2k90",
            "score": 709,
            "text": "auto-dimming mirrors should be the law, as well as tinted windshields. That removes the power from the idiots who will still use crazy bright lights",
            "title_similarity": "0.7837454",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hnaaabm",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnagk5t",
            "score": -2,
            "text": "My best argument to change your view is that most of these headlights are aftermarket, installed by mechanics or the owner themselves. When installed, the angle of the light beam is not properly calibrated, resulting in a beam that is too high and blinding to oncoming drivers. It's a calibration oversight, not a brightness issue.\n\nBut anecdotally, I completely agree. I've found the problem worst in the western USA, where municipal lighting is scarce in the mountains and plains. Locals need light to drive and have learned aftermarket lights will illuminate the whole area -- with few drivers in these places, the thought of the effect on other drivers seems secondary",
            "title_similarity": "0.8595588",
            "sentiment_compound": -0.7393
        },
        {
            "id": "hnam2wd",
            "score": 1,
            "text": "It's dumbasses in trucks that put a 6 inch lift and don't readjust the angle. What would shine into the back of your car is now shining into your rearview.",
            "title_similarity": "0.7119066",
            "sentiment_compound": 0.0
        },
        {
            "id": "hnaemb3",
            "score": 9,
            "text": "Cars aren't so bad.  It's the TRUCKS!  LED lights at eye level.",
            "title_similarity": "0.427297",
            "sentiment_compound": 0.5961
        },
        {
            "id": "hnaiybc",
            "score": 0,
            "text": "Oddly enough the infrastructure bill changes regulations for headlights. Cars will now be able to have dynamic lighting that will aim the beams away from the oncoming driver. Europe has had them for ages and we’ve finally caught up.\n\nhttps://www.cnet.com/roadshow/news/adaptive-headlights-legal-us-biden-infrastructure-bill-law/",
            "title_similarity": "0.7100327",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hnalyzk",
            "score": 0,
            "text": "New tech helps by trying to give you the best of both worlds: bright lights that auto-dim or angle down when sensors see an incoming car or pedestrian. \n\nBut it's not perfect. Sometimes the sensors get tripped up and they angle higher than they should. This happens even on low beams.\n\nSometimes I'm going uphill toward an intersection, and my lights blast anybody moving perpendicular because they can't angle any lower.",
            "title_similarity": "0.8662689",
            "sentiment_compound": 0.009
        },
        {
            "id": "hnawhlk",
            "score": 0,
            "text": "I have never had that problem.  Maybe you need to get your eyes checked out.",
            "title_similarity": "0.32590654",
            "sentiment_compound": 0.3089
        },
        {
            "id": "hnbeg42",
            "score": 0,
            "text": "Reducing the brightness will just increase the amount of accidents, the brightness has increased for a good reason. \nWhat is lacking is the implementation of proper leveling solutions, where sensors would confirm that the oncoming cars and the one in front are not being blinded. This is being worked on as we speak.",
            "title_similarity": "0.7346549",
            "sentiment_compound": 0.872
        },
        {
            "id": "hnbg82e",
            "score": 0,
            "text": "I was just thinking about this. Every time a car passes me at night I’m completely blinded. Led lights need to be banned in headlights. They’re more dangerous than just dimmer lights.",
            "title_similarity": "0.8601495",
            "sentiment_compound": -0.7501
        },
        {
            "id": "hnbyae2",
            "score": 0,
            "text": "Ok while I agree that there is a point where lights can be too bright. I could never agree that 50% of drivers have “too bright” lights. My first question would be what kind of vehicle are you driving? For me the biggest difference in viewing headlights came when I went from a small sedan to a full size truck. The height of your vehicle and the height of the oncoming vehicle do make a big difference.\n\nNow in regards to the actual brightness I live in northern Canada. We have deer, black bear, elk, and moose. The last two can be 700-800 and 1000-1400lbs respectively. They are also black or dark, dark brown. You want really bright lights here because when you are travelling at 65mph, you need to be able to see an animal coming up out of the ditch. That is why many people here will actually buy LED light bars to help keep themselves safe.",
            "title_similarity": "0.622386",
            "sentiment_compound": 0.9558
        },
        {
            "id": "hnag5ph",
            "score": -6,
            "text": "I 100% relate but also...have you considered the possibility that you are A) just getting old or B) deteriorating your own eyesight by staring at computers all day? I always feel like \"headlights are too bright these days,\" but I've been wondering if it's really one of those non-headlight issues...",
            "title_similarity": "0.79745936",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hnahbg1",
            "score": 1,
            "text": "Yeah I like my 2019’s car’s headlights from my POV, but people flash me all the time thinking I forgot to turn off my brights. Not cool.",
            "title_similarity": "0.8367696",
            "sentiment_compound": 0.1298
        },
        {
            "id": "hnaj41p",
            "score": -1,
            "text": "When people actually turn them on which seems to be a challenge.",
            "title_similarity": "0.3834339",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hnajzov",
            "score": -1,
            "text": "It really depends where you are going. I was driving a road this week that I literally could not see at all, I could only use the roadside reflectors as channel markers. I needed much brighter headlights for those conditions. I do not need brighter lights in the city or on the highway. We need a \"City\", \"Regular Bright\", and \"High Beam\" as 3 different options (or like my previous car, light brightness was controlled by both speed and GPS coordinates).",
            "title_similarity": "0.7880683",
            "sentiment_compound": 0.8134
        },
        {
            "id": "hnakp7f",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hna97u2",
            "score": -7,
            "text": ">There need to be new regulations on maximum brightness settings and light positioning. \n\nNo. We need regulation for less cars and more public transports such as trains",
            "title_similarity": "0.66178894",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hnajva9",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnak8dz",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnakg5h",
            "score": -2,
            "text": "I get an occasional car flashing their high beams at me bcuz they think my LEDs are high beams. It’s fun.",
            "title_similarity": "0.5649448",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hnar62r",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnaa3ae",
            "score": 81,
            "text": "I think the issue is more that they’re aimed horribly, and not protected from spilling. They aim up too high. Some cars have really nice bright lights but don’t hit anywhere above waist level.",
            "title_similarity": "0.72518015",
            "sentiment_compound": 0.06
        },
        {
            "id": "hna9a0b",
            "score": 160,
            "text": "Trucks are too tall I'd say",
            "title_similarity": "0.31490952",
            "sentiment_compound": 0.0
        },
        {
            "id": "hnazqsp",
            "score": 5,
            "text": "It's not the brightness that's the issue. It's the angle. \n\nIf you aim a flashlight at someone's face, then you're blinding them. However, the same flashlight aiming maybe 20° lower will aid both people's vision. Same principle here. Headlights of the same brightness aimed towards the road will cause less light to go into opposing drivers' eyes and instead will go towards illuminating the road and area in front of the car. \n\nConversely, high-beams are necessary on (for example) suburban roads with no street lights. Normal headlights aren't always bright enough. If you're driving down a winding road with a relatively high speed limit (~40mph, let's say), normal headlights don't sufficiently light the couple hundred feet ahead of you to sufficiently navigate it. As for maniacs that use high-beams into opposing traffic, they can go to hell, but they will always be a side effect of having high-beams.",
            "title_similarity": "0.78001213",
            "sentiment_compound": -0.6803
        },
        {
            "id": "hnap8op",
            "score": 27,
            "text": "Ok, terrible cmv responses so far, so I'll give it an honest go:\n\nThere are 3 issues at play, and none of them are the brightness of the bulbs.\n\n1: Headlights are improperly aligned / get unaligned over time, and people don't correct the problem. To solve this, we just need better enforcement. People get pulled over for headlights that are burned, they should also get pulled over for unaligned headlights.\n\nRealigning headlights is an easy procedure in most cars. Takes about 20 mins if you've never done it before. 10 if you know how. \n\n2: Headlight plastic gets foggy over time, which causes the light to scatter more, causing even a properly aligned headlight to shine where it's not supposed to. To fix this, people should repolish their headlights when they start getting too foggy. The procedure takes about 30 mins if you have the proper equipment, and doesn't require much. It should be a normal maintenance item like an oil change, except you'd have to do it less often, and it'd be cheaper.\n\nThe reason you didn't notice this issue before is that headlights used to be made of glass, which doesn't oxidize and fog over time. Now they're made of plastic, and that becomes less clear over time due to exposure to uv and oxidation. Fortunately, the problem is usually limited to the surface, so a simple sanding and polishing fixes the problem (I've done this myself). \n\n3: Trucks are becoming bigger and taller, making even properly aligned headlights shine over the height of peoples eyes in traffic.\n\nTo fix this, there should be regulations on the height you're allowed to mount the headlights. If you want a huge truck, you'll have to live with weirdly placed low headlights. Current big trucks just have their headlights too high.\n\nAgain, trucks didn't use to be so big, so this didn't use to be a problem. Now that trucks are getting bigger and bigger, this is an issue.\n\nFix these issues, and we can live in a world where car lights are nice and bright, and nobody gets blinded.\n\nTherefore, the problem isn't that headlights are getting too bright, it's that we're not using them properly.\n\nEdit: grammar",
            "title_similarity": "0.84068376",
            "sentiment_compound": 0.9196
        },
        {
            "id": "hnajels",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnaq54h",
            "score": 8,
            "text": "[deleted]",
            "title_similarity": "0.102999166"
        },
        {
            "id": "hnaa7hm",
            "score": 26,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hna4pi8",
            "score": 225,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hna1fag",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnajvyf",
            "score": 11,
            "text": "One thing that a lot of people here aren't mentioning is that cars are getting larger and designs are moving towards taller front ends. This is having a disturbing effect on pedestrian deaths, but newer cars also have higher headlight positioning which makes them more likely to blind if you're in a smaller car:\n\nhttps://medium.com/sidewalk-talk/the-troubling-tie-between-bigger-cars-and-pedestrian-deaths-c82a0ee8dc0b\n\nFrom the article, the average weight of new vehicles in America have increased by 11% and the share of SUVs on the road has increased 8%.",
            "title_similarity": "0.73484737",
            "sentiment_compound": 0.251
        },
        {
            "id": "hnab7jw",
            "score": 68,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnahxsk",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnafb44",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnad0uu",
            "score": 17,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnad4q0",
            "score": 86,
            "text": "The [IIHS has already told automakers their headlights suck.](https://www.motorbiscuit.com/headlight-issues-got-carmakers-slapped-by-the-iihs-in-2020/)\n\nI would suggest the issue isn’t with brightness so much as glare for incoming drivers.  The good news is that IIHS already evaluates this and dings companies with too much of it.  After a product cycle or so, expect to see some improvement.  They also credit companies with auto adjusting lights, since it solves the problem of people using high beams at the wrong times.\n\nThe other half of this conversation is that the car companies can’t control what happens after it leaves the factory.  A lot of people swap in aftermarket lighting, but unless said bulbs have been evaluated by regulatory agencies, that could contribute wildly to the glare problem (due to aftermarket “plug in LED conversion” type of eBay specials having a different focal point in the same reflector housing resulting in a different beam pattern).  Additionally, many drivers have poorly adjusted headlights, which can mean a light would be shining in an inappropriate area that some adjustment could fix but most drivers never check or do this.\n\nI can’t change your view per se but I can at least try to explain why you’re seeing what you’re seeing.  Good news is that automotive lighting is heavily regulated so there’s room to expect improvement.",
            "title_similarity": "0.832528",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hnaiddc",
            "score": 14,
            "text": "So part of the problem is that US law has lagged behind other parts of the world that allows for adaptive headlights which helps reduce the brightness by adjusting where the beam is on the fly. This was just updated with the building back better act but it will be a bit before the new rules are out and when manufacturers can have them in",
            "title_similarity": "0.75953364",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hnam59l",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnan8xf",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnarrea",
            "score": 4,
            "text": "I think it’s a combination of the angle, the color, *and* the brightness. I’ve flashed my lights at someone because I thought they were using their high beams, and HOLY SHIT, they flipped their high beams on, blinded me, and I narrowly avoided taking out a pack of wild armadillos.",
            "title_similarity": "0.7052742",
            "sentiment_compound": -0.6289
        },
        {
            "id": "hnarssb",
            "score": 2,
            "text": "Your headlights have to be up to various codes to get a warrant of fitness in my country. NFI wasn't going on over there.",
            "title_similarity": "0.6465917",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hnatl5r",
            "score": 1,
            "text": "I wonder if this is some adjustment period that we suffer through. If you wake up at 3AM and go to the restroom, full power of your light will likely be painfully bright for you. But if it's middle of the day, same light may be so so. \n\nI think that 2 owners of new cars with bright LED lights don't blind each other and both are much safer on empty, dark road than owners of halogen lights.\n\nIf I'm not wrong with the above, conclusion may be that change happens too fast.",
            "title_similarity": "0.79014236",
            "sentiment_compound": 0.877
        },
        {
            "id": "hnatppd",
            "score": 1,
            "text": "I have been worried about my eyes recently \n\ni cant see shit when cars are driving at me on a dark road\n\nOne part if the problem. Is when people update older light housing, into halogen bulbs. \nThey have reflective properties in back, which were meant for much dimmer lights. \n\nAnd they dont always get the angle right. Seemd to be right in my face.",
            "title_similarity": "0.8700203",
            "sentiment_compound": -0.2444
        },
        {
            "id": "hnaulu9",
            "score": 1,
            "text": "LPT-I drive much slower than these dill bags care for and they get annoyed, change lanes….problem solved.",
            "title_similarity": "0.68856746",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hnaw1b1",
            "score": 1,
            "text": "DONT change your view! Youre fucking right!",
            "title_similarity": "0.11986723",
            "sentiment_compound": 0.0
        },
        {
            "id": "hnaxu9u",
            "score": 1,
            "text": "as someone with eye site problems i will agree with this statement.",
            "title_similarity": "0.22683862",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hnayk2i",
            "score": 1,
            "text": "Yeah I agree that headlights are getting brighter on all cars. LED bulbs being a big cause. And why are they crazy colors? That just makes it so much worse when they are blue or yellow.",
            "title_similarity": "0.7069728",
            "sentiment_compound": 0.1335
        },
        {
            "id": "hnazufn",
            "score": 2,
            "text": "I’ve never encountered this here in Belgium, although most new cars have them. \nAre you sure it isn’t just all the aftermarket led “upgrades” that are the problem? Over here we have mandatory yearly inspection of vehicles, and light positioning is checked. Although the led headlights in my car have an auto leveling function that activates every time I start the car. \n\nI’d say more regulation is the answer here.",
            "title_similarity": "0.7370631",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hnb0ydp",
            "score": 1,
            "text": "Im diving a VW Golf 2, old car and low to the ground in comparison to modern cars. And I tell you, if there is an SUV coming at me at night, I can't see shit, headlight at eye level and fucking blinding. That's about 3 seconds where I can't see anything. Lights need to have a maximum brightness",
            "title_similarity": "0.7338287",
            "sentiment_compound": 0.5753
        },
        {
            "id": "hnb1zvy",
            "score": 1,
            "text": "It's very possible you are just getting older. As you get older your night vision and ability to adjust to changes in lighting goes down. It's one of the reasons kids like dark rooms and teachers say \"it's so dark in here!\" It becomes far more noticeable as you age.",
            "title_similarity": "0.6334665",
            "sentiment_compound": 0.7263
        },
        {
            "id": "hnb2hjt",
            "score": 1,
            "text": "The lights are brighter which is fine for seeing better but the other problem is that cars are higher off the ground more so the headlights are at least 12” higher up so it’s a combined effect.",
            "title_similarity": "0.61421037",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hnb2p6w",
            "score": 1,
            "text": "I understand what you're saying but my point still stands. Your vision shouldn't come at the expense of other drivers.",
            "title_similarity": "0.44156602",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hnb2xoj",
            "score": 1,
            "text": "Just have the lights adjusted properly and don’t use high-beams when other cars are in front of you and it’ll be fine.",
            "title_similarity": "0.564271",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hnb3j0j",
            "score": 1,
            "text": "Adding to that i hate how most new cars have blue xeon/led headlights instead of the much more comfortable warm white halogen lights of yesteryear",
            "title_similarity": "0.6789879",
            "sentiment_compound": 0.2666
        },
        {
            "id": "hnb3ntx",
            "score": 1,
            "text": "Yep.. Lots of fuckers in newer model SUV’s and Trucks driving around with LED headlights that are literally brighter than the headlights on god damn semi trucks.. it’s unbelievably irritating.",
            "title_similarity": "0.67594707",
            "sentiment_compound": -0.6115
        },
        {
            "id": "hnb3rax",
            "score": 6,
            "text": "I have only anecdotal evidence nothing factual to back this up so correct me if I'm wrong, but I think a it would help a ton and almost fix it completely if they just changed the hue of the light. Even the brightest yellow light in oncoming traffic is more bearable on my eyes than a regular blue light... \n\nThose brighter blue lights are so terrible that I loose vision for a couple seconds even after they pass (it like burns into my retina or something idk and leaves a fuzy spot for a couple seconds) which is super dangerous. \n\nJust make everything yellow tinted and it would almost fix the issue",
            "title_similarity": "0.81003654",
            "sentiment_compound": 0.8524
        },
        {
            "id": "hnb504g",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnb5kce",
            "score": 1,
            "text": "I just started driving again after over 8 years of not having a car & the difference in headlights was the first thing to strike me. Its obnoxious.",
            "title_similarity": "0.7009915",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hnb6hgx",
            "score": 1,
            "text": "You don't need to have your view changed, it's the reallity. It's esp. bad when those crapheads install overpowered lamps.",
            "title_similarity": "0.55622125",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hnb6q77",
            "score": 2,
            "text": "The issue also is people don't know how to properly install aftermarket lighting.  The type of bulb should be in the proper housing and aimed correctly.",
            "title_similarity": "0.6217337",
            "sentiment_compound": 0.0
        },
        {
            "id": "hnbaf1r",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnbc8v8",
            "score": 1,
            "text": "1,000% agreed. I have a hard time driving at night due to every other car having the power of the sun in their headlights.",
            "title_similarity": "0.76028454",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hnbdhul",
            "score": 1,
            "text": "What's also annoying is that turns, bumps and hills don't exist in some people's world. If anything, headlight angles and sharp cut off ponts for headlights make this worse, as when you are blinded, the lights is more concentrated. Most roads aren't straight and flat.",
            "title_similarity": "0.79378355",
            "sentiment_compound": -0.8539
        },
        {
            "id": "hnbdmmv",
            "score": 2,
            "text": "My husband and I went off the road in the country because there were overly bright headlights coming towards us and overly bright headlights behind us, shining in our mirrors. Neither one of us could see anything except lights.",
            "title_similarity": "0.71904266",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hnbe5ix",
            "score": 1,
            "text": "The headlights that automatically change to bright mode should be illegal. \n\nIf you can't remember to turn your own brights on then don't fucking drive ._.",
            "title_similarity": "0.6944833",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hnbftlt",
            "score": 3,
            "text": "I am part of that 5% of population who spends most of their time working in agricultural areas throughout the country. Brght headlights are helpful for avoiding deer at 65 mph. Thank God for auto dimming.",
            "title_similarity": "0.5315104",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hnbh8jt",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnbhps6",
            "score": 1,
            "text": "I only get blinded when they hit a speedbump coming towards me, the light lifts and becomes way brighter now that its pointing at my face",
            "title_similarity": "0.6330149",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hnbiiyu",
            "score": 1,
            "text": "Absolutely agree. I get that the LED’s are great for the driver of the vehicle, but they are shit for everyone else around you.",
            "title_similarity": "0.635008",
            "sentiment_compound": -0.3514
        },
        {
            "id": "hnbin1y",
            "score": 1,
            "text": "The brightness is not the problem if lights are adjusted properly.  What happens is that people replace old incandescent and halogen bulbs with LEDs that fit the socket but don’t match the reflector or the lens in the car… we end up with super bright lights that illuminate the bottom of the bridge they are driving under as well as the house on the left side of the road…. Instead of the thing they are driving on…. The road…. Which is the only thing that needs illuminated.  A horizontal beam of light below the person in front of you’d mirrors.  I drive a sprinter van… my head is 8 feet off the ground,  if your lights are in my eyes your car needs fixed…. This problem has been addressed pretty well in California. I don’t see it much any more……\n\nThere are certain intersections where because of the shape of the road the light will be in your face…. That is part of driving,  it is the way it is.",
            "title_similarity": "0.8032163",
            "sentiment_compound": 0.9659
        },
        {
            "id": "hnbjb7g",
            "score": 1,
            "text": "Wow I thought this was only happening in my town. It's got so bad I'm avoiding driving at all at night. Either that or I'll have to change the aim of my lights and blind other drivers as well.",
            "title_similarity": "0.7921841",
            "sentiment_compound": -0.6066
        },
        {
            "id": "hnbkrbf",
            "score": 1,
            "text": "From what I understand. If people adjusted their headlights correctly, they wouldn't need super bright headlights. Donut media on YouTube did a video about this.",
            "title_similarity": "0.63352036",
            "sentiment_compound": -0.6759
        },
        {
            "id": "hnbks4j",
            "score": 2,
            "text": "100% agree. I work nights so I drive in the dark both ways.\n\nJust this week I flashed a guy who I thought had been driving for a full mile towards me with his brights on. He flashed me back and I didn't even notice a difference. These bright ass led lights should be illegal.",
            "title_similarity": "0.74582",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hnbl4hc",
            "score": 4,
            "text": "I feel as if the issue has been solved at least over in Europe with matrix LED headlights (USA finally said they were working on writing them into regulations). These are very bright but essentially works like a display where sections of the light turn off where other vehicles/pedestrians are present as not to blind them while still improving visibility compared to older tech. Plus, some of them are so high in resolution that they play animations when you walk up to the car!\n\nCheck out this video from Audi for a visual demonstration : https://youtu.be/hDJi240E_ZA\n\nI will agree that BMW using fucking lasers for headlights are overkill though. I cannot for the life of me understand why lasers are necessary",
            "title_similarity": "0.7110669",
            "sentiment_compound": 0.9624
        },
        {
            "id": "hnbljig",
            "score": 3,
            "text": "The brightness isn’t necessarily the problem, and I think it comes hand-in-hand with nice new cars. They all should have auto dimming functions in those lights. My family had a Chrysler 300 M in 2000, that whenever it saw a set of lights in front of it it automatically turned off the highbeams. This was one of the greatest features for me as a driver, and I can only imagine it was very valuable for those coming in contact with me. Darker lights are not the issue, if we have the technology. We should allow as bright lights as possible, and ensure tech is there to prevent driver blindness. So therefore instead of having darker lights, and regulating something like that, why not lightbulbs that have sensors in them that know that they can do them themselves? It sounds like oh way better option that doesn’t mess with peoples liberties. And if it was a standard feature in a car in 2000, why is it so rare and other vehicles? It was awesome",
            "title_similarity": "0.71389276",
            "sentiment_compound": 0.9833
        },
        {
            "id": "hnbm1tk",
            "score": 1,
            "text": "In regards to your statement that there need to be new regulations on maximum brightness, the federal government does regulate the brightness, angle and mounting location. \n \n\nhttps://www.govinfo.gov/content/pkg/CFR-2004-title49-vol5/xml/CFR-2004-title49-vol5-sec571-108.xml\n\nhttps://en.m.wikipedia.org/wiki/Federal_Motor_Vehicle_Safety_Standard_108",
            "title_similarity": "0.47646052",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hnbn3jc",
            "score": 2,
            "text": "i work in a factory where we build headlights and i can confirm headlights are getting a bit too bright",
            "title_similarity": "0.6496606",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hnbppbv",
            "score": 2,
            "text": "Sounds like the problem is with the angle, not brightness. \n\n>b) you to sufficiently see the road. \n\nWhat ya sufficient to see the road? Id argue that they need to be brighter. And as long as they aren't pointed into the other drivers eyes there would be no issues.",
            "title_similarity": "0.6508991",
            "sentiment_compound": -0.5242
        },
        {
            "id": "hnbpv6s",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.069118515"
        },
        {
            "id": "hnbti34",
            "score": 1,
            "text": "everytime i'm on the sidewalk and a car passes by i'm blinded and it hurts my eyes .",
            "title_similarity": "0.71855736",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hnbztng",
            "score": 1,
            "text": "Some times the lights also aren’t angled correctly",
            "title_similarity": "0.42349243",
            "sentiment_compound": 0.0
        },
        {
            "id": "hnc12jl",
            "score": 1,
            "text": "I feel your pain, but I drive in the countryside and you need those bright lights to have any chance of seeing deer any l about to cross at night. Those bastards are everywhere.",
            "title_similarity": "0.7005449",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hnc22rv",
            "score": 1,
            "text": "I used to have the same view until I changed my car and now have one with bright led lights, I don't have any issues now with others with led lights cause my eyes are already used to a brighter light.",
            "title_similarity": "0.63945293",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hnc2vxr",
            "score": 1,
            "text": "For real, I don’t have any problems with the yellowish ones but the pure white ones always seem way to bright. I live in the city and it’s just so unnecessary.",
            "title_similarity": "0.46116072",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hnc462j",
            "score": 1,
            "text": "The headlights don't need to be dimmer. They need to be YELLOW. \n\nBlue light makes your eyes close - so you can't see anything that's dark around it \n\nWhite artificial LEDs are blue, red, and green.\n\nYellow is red and green, no blue, and your pupils don't dilate. Doesn't cause headaches as instantly as blue.",
            "title_similarity": "0.531527",
            "sentiment_compound": -0.296
        },
        {
            "id": "hnc5b71",
            "score": 1,
            "text": "its not as common here (belgium) but ihave heard that in murica its pretty common for people to retrofit led bulbs to their cars.\n\nthese come in more than one variety and some are not the same spec or just are bad and shine light where the lens isnt supposed to catch that light\n\nhere and im guesssing over there when i see lights that are annoying mostly they are set up bad, you have two dials to dial in your lights and i feel like its not done well on most cars\n\nalso just that the us has so many fuggin trucks which only worsens the issues because the lights are up so high that every issue is worsened",
            "title_similarity": "0.85381556",
            "sentiment_compound": -0.9495
        },
        {
            "id": "hnc5rp4",
            "score": 1,
            "text": "People who keep their fog lights on all the time are also the worst.  They don't help you see further and the blind the hell out of the people in the other lane",
            "title_similarity": "0.71447283",
            "sentiment_compound": -0.9282
        },
        {
            "id": "hnc6m2w",
            "score": 1,
            "text": "It is probably mentioned in the comments somewhere, but the height of the headlight also plays a part. The trucks that they are making now are really tall in relation to a passenger sedan.",
            "title_similarity": "0.48117906",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hnc9is1",
            "score": 1,
            "text": "I'm pretty sure it's just crappy after market LED lights put into housings meant for halogens",
            "title_similarity": "0.64270294",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hnc9r3b",
            "score": 1,
            "text": "Addressing some things I've seen in other comments:\n\n\\#1: This is not just about individuals putting after market bulbs in their cars. My car is a 2022 Honda Civic and it's stock headlights are so bright (or intense) that many people flash me their brights even when I don't have my brights on.\n\n\\#2: Not all headlight angles are adjustable. Again, my 2022 Honda Civic is at a factory set angle and (according to both the Honda Dealer and the national Honda Customer Service line) not adjustable by anyone, including the dealer.\n\n\\#3: Maybe it's technically \"intensity\" not \"brightness.\" Whatever, my lights are blinding oncoming traffic. It's too BRIGHT in their eyes. \n\n\\#4: Mirror dimming, manual or auto-dimming, does not solve this problem. I'm talking about oncoming traffic, not the people in front of me. \n\n\\#5: Requiring others to get tint on their windows isn't a viable solution. Then their windows will be letting in less light \\*all\\* the time, requiring their headlights to be brighter too for them to be safe.  \n\n\nI concur with OP: There needs to be enforced laws about maximum brightness and about the angle of the light.",
            "title_similarity": "0.72754914",
            "sentiment_compound": 0.8511
        },
        {
            "id": "hnca2iv",
            "score": 1,
            "text": "The bigger issue imo is all headlights should be self levelling and have auto high beams. The brightness itself isn’t really an issue. We were on a long trip recently and pretty much every vehicle where the headlights seemed too bright were either towing something (so the front end is lifted up slightly), or forgot to turn their high beams off.",
            "title_similarity": "0.70521",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hnccbai",
            "score": 1,
            "text": "I have a terrible time driving at night due to the bright lights.",
            "title_similarity": "0.7288332",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hnccih3",
            "score": 1,
            "text": "I see the practical application in the headlights, the further you can see the better chance of you avoiding deer.\n\nI agree we shouldnt have to drive with sunglasses past midnight but like... you could just highbeam them and see if they angle them proper after that.\n\n(I also mounted one a headlight with red glass on my shelf to harass those who run highbeams.)",
            "title_similarity": "0.7973728",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hncdbjo",
            "score": 1,
            "text": "I agree with this one 100% I drive a Mitsubishi Mirage which puts my eyes basically at same level of all these trucks with insanely bright lights",
            "title_similarity": "0.40586215",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hncexho",
            "score": 1,
            "text": "Nope, I agree with you on this on my astigmatism hurts to drive at night. I wear my glasses at night to reduce the glare with the coating I pay for. People are taking consideration of their own conditions why they need to increase brightness while others have this condition and its been worse to see over time.",
            "title_similarity": "0.8268195",
            "sentiment_compound": -0.5873
        },
        {
            "id": "hnchmk7",
            "score": 1,
            "text": "It is not the brightness that is the issue but the angle of the light. In my country (EU nation) cars are subject to a compulsory VRT (Vehicle Road-worthiness Test). One of the things that are tested are the headlights. If the beam they throw is angled too high they blind other drivers. So cars with such problems fail the test until the issue is fixed.",
            "title_similarity": "0.83395916",
            "sentiment_compound": -0.9252
        },
        {
            "id": "hnchndv",
            "score": 1,
            "text": "There was this jeep that had lights mounted on the rear of their car, they were fucking high beams that’s definitely blinded and distracted me.",
            "title_similarity": "0.70063585",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hnciluc",
            "score": 1,
            "text": "Yes! As a pedestrian / cyclist who doesn't drive, I feel like everyone's out there to blind me.",
            "title_similarity": "0.61457705",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hnclywv",
            "score": 1,
            "text": "Disagree, brighter is better as the driver can see the road better at night. The problem is that most cars that blind you are cars that have aftermarket bulbs. For those, you can't just swap out the bulbs with aftermarket ones and be done with it. You also need to adjust the aim so that it aims down towards the road and not at the driver in front. People who do the bulb swapping usually don't know or don't bother adjusting the aim, that is the real problem. It's not about the brighter bulbs.",
            "title_similarity": "0.878929",
            "sentiment_compound": -0.4042
        },
        {
            "id": "hncncov",
            "score": 1,
            "text": "100% agree. Half the time when I'm driving I have to sit very uncomfortably or adjust my mirrors to a position I can't see with them because the lights on other cars are too bright. The amount of times I've been driving and thinking \"wtf is this person doing with their brights on\" when they don't actually have the high beams on is ridiculous. My eyes are pretty good too (sometimes I forget to turn my lights on in the first place because I can see perfectly fine without them), and I've heard a lot of complaints from people with worse eyes too so it's not just a me thing",
            "title_similarity": "0.8796295",
            "sentiment_compound": 0.228
        },
        {
            "id": "hncqmy9",
            "score": 1,
            "text": "I find the color to be a major part too.  The very white lights hurt my eyes very bad but the yellow color isn't as bad.  I think only the soft yellow color should be allowed.",
            "title_similarity": "0.6769208",
            "sentiment_compound": 0.012
        },
        {
            "id": "hncrrne",
            "score": 1,
            "text": "Absolutly agree the new white lights look like bright lights plus the incredibly arrogant/selfish people who put the extra high beams on their giant trucks I guess doubly making up for something else they are lacking. I am always so concerned about blinding others as someone who goes in to work super early in a lot of backroads seems many people just prefer to annoy people.",
            "title_similarity": "0.7509426",
            "sentiment_compound": 0.836
        },
        {
            "id": "hncwaqe",
            "score": 1,
            "text": "None of the laws for manufacturers have changed, and all of the laws you propose actually exist. And lights have always been pretty much at the maximum allowed lumens output. \n\nSo no... car headlights are not \"becoming too bright\", as their \"brightness\" hasn't really changed much. \n\nWhat they are becoming is less \"orange\" (technically higher color temperature). Which is somewhat more \"glaring\" on your night vision. \n\nAnd they are becoming more \"projected\", which puts the total allowed \"brightness\" into a smaller area. \n\nThat area sometimes becomes mis-aimed (which is already a vehicle code violation, though not really enforced, and it would be *very* expensive and difficult to enforce). \n\nThat's what you're seeing.",
            "title_similarity": "0.63967866",
            "sentiment_compound": 0.3201
        },
        {
            "id": "hncx163",
            "score": 1,
            "text": "Farcking SUVs",
            "title_similarity": "0.25401098",
            "sentiment_compound": 0.0
        },
        {
            "id": "hncz1dl",
            "score": 1,
            "text": "In reality the problem isn't brightness it's projector housings.  Focusing all of the light into an acceptable field of view.  This should be (and 99% of the time im sure it is) aimed below your eyeline.  It then won't blind you.  The issue comes when the other car is aimed slightly up (on a hill say) and that concentrated beam is hitting your eyes.  Maybe a solution to this would be to add auto tilting to these headlights to keep the beam level and below the eyeline of oncoming traffic.  This may prove a challenge though as you obviously cannot reduce the visibility of the driver.  \n\nIf you can't drive at night due to headlights, perhaps discuss this with an optometrist who can prescribe tints or other solutions.  Otherwise it's likely best to stay off the roads if you feel you may be a danger to others due to lack of vision.\n\nYeah headlights are seemingly brighter but I'll trade that for my own better visibility in low light situations any day of the week because other's lights don't bother me near this much.",
            "title_similarity": "0.76482654",
            "sentiment_compound": 0.8418
        },
        {
            "id": "hnd0jbf",
            "score": 1,
            "text": "I will provide an anecdote that will hopefully change your view. \n\nIt was approximately 8:30pm-ish (very dark since it was winter), I was driving on a 2-lane divided highway (2 lanes - big grass median - 2 lanes), and the speed limit was 75mph (doing 80). I was driving a new 2011 Ford Explorer Limited with the best headlights, whatever came with the package. A Dodge Ram on the other side of the highway rear ended a semi which knocked out his headlights. He then somehow drifted across the median and into our lane. I barely spotted him in time and was able to swerve enough that I only took off his front end of his truck instead of hitting him square in the cab. Both vehicles were totaled. If my headlights had been brighter, I could have taken corrective action and potentially missed him entirely.\n\nWhat I propose is that we get rid of our antiquated laws (or, ya know, keep up with the times) and allow manufacturers to aim their headlights around oncoming cars. BMW has this feature over in the UK, but the feature is disabled in the US because it isn’t allowed. \n\nhttps://youtu.be/4v19IgSGr28",
            "title_similarity": "0.70197153",
            "sentiment_compound": 0.5647
        },
        {
            "id": "hnd1n79",
            "score": 1,
            "text": "Finally someone said itttt 😭😭😭😭",
            "title_similarity": "0.036069136",
            "sentiment_compound": -0.9081
        },
        {
            "id": "hnd1qdy",
            "score": 1,
            "text": "I was behind a Lexus last night and the brake lights were blinding. Lights are entirely too bright these days.",
            "title_similarity": "0.7024392",
            "sentiment_compound": 0.4902
        },
        {
            "id": "hnd2odb",
            "score": 1,
            "text": "Honey they've BEEN too bright",
            "title_similarity": "0.20593786",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hnd2vyg",
            "score": 1,
            "text": "Never really noticed it with cars it’s mainly the big ass modded out trucks with aftermarket light bars",
            "title_similarity": "0.5907433",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hnd4d13",
            "score": 1,
            "text": "I was just thinking how everyone seems to have their brights on but it’s definitely just brighter lights! Drives me nuts when they blind me in my rear view",
            "title_similarity": "0.67933637",
            "sentiment_compound": 0.2363
        },
        {
            "id": "hnd615g",
            "score": 1,
            "text": "I have an astigmatism and I agree 100%. I try not to drive at night whenever possible. It's insane how bright some of the lights are and it fucks me up.",
            "title_similarity": "0.7692307",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hnd684t",
            "score": 1,
            "text": "I would argue that at least part of the problem is that the color temperature of new headlights is so blue. Older headlights were much yellower and affected your night vision far less.\n\nAnother problem is that the light on new headlights doesn't fade out at the edges. There is a harsh border, where it's 100% brightness all the way to where it falls off to 0%.",
            "title_similarity": "0.67221934",
            "sentiment_compound": -0.7522
        },
        {
            "id": "hndd6jw",
            "score": 1,
            "text": "There actually is a limit on the brightness of headlights.  The challenge is, the enforcement.  I am guilty of this personally as I have installed LED headlights in both of my cars.  Now, I have also made sure my lights are properly aligned.  Some who do this swap out don't.    \n\nThese are not legal for highway use, but how do you enforce that law?",
            "title_similarity": "0.84639883",
            "sentiment_compound": 0.1318
        },
        {
            "id": "hndf2mr",
            "score": 1,
            "text": "I drive trains. You think car headlights are too bright until I come around the corner. Choo, choo, f***ing choo! I can't, by law, dim them for cars in most situations. Even if someone else did it for you in the past. \n\nHonestly most people don't follow the law or common sense when using high beams. If you can see the car in front of you, you would see something on the road between you if there was anything. Dim your headlight. If your are facing me, you don't want me losing my way in the blinding haze and crashing headlong into you at 60mph. Dim you f-ing headlight. Like as soon as you see someone else, dim that damned thing.",
            "title_similarity": "0.8671129",
            "sentiment_compound": 0.7937
        },
        {
            "id": "hndka08",
            "score": 1,
            "text": "Alot of idiots drive with high beams on",
            "title_similarity": "0.48051694",
            "sentiment_compound": 0.0
        },
        {
            "id": "hndptly",
            "score": 1,
            "text": "Massive issue in the UK too",
            "title_similarity": "0.28104225",
            "sentiment_compound": 0.0
        },
        {
            "id": "hndrr6f",
            "score": 1,
            "text": "My car is from the eighties and low to the ground, I drive by smell at night",
            "title_similarity": "0.50621504",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hndrwcy",
            "score": 1,
            "text": "How about using [polarized](https://www.polarization.com/land/land.html) lights?",
            "title_similarity": "0.2315481",
            "sentiment_compound": 0.0
        },
        {
            "id": "hndt3x4",
            "score": 1,
            "text": "The real answer is optical control. Sure you can have bright lights but then need a lens to go over them that directs the light towards the ground and away from eye level.",
            "title_similarity": "0.6299478",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hndxlxi",
            "score": 1,
            "text": "I agree they are too bright so what I do is not look directly at the lights and try to decide whether to flash them or not. Instead I focus on the white line to the right side of the road and it doesn’t blind me. It works for me but getting it passed into law- I mean, how do you measure brightness? Is it similar to the low fat, less fat thing in the 90s? There would have to be a standard wouldn’t there?",
            "title_similarity": "0.6645042",
            "sentiment_compound": 0.4836
        },
        {
            "id": "hndyzue",
            "score": 1,
            "text": "I bought my headlights online and they're far too bright. Drivers flash me constantly. I don't want my lights to be this bright but they were close to $500 and I can't wait for another set to arrive in the mail",
            "title_similarity": "0.6755272",
            "sentiment_compound": 0.4636
        },
        {
            "id": "hne02vx",
            "score": 1,
            "text": "I agree",
            "title_similarity": "-0.15047106",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hne8hzf",
            "score": 1,
            "text": "i think the real problem is the height that cars sit at on the road. if you are in a sedan, and the person behind you has a truck, its gonna look like the highbeams are on in the truck just because of the height of the light.",
            "title_similarity": "0.6428641",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hnebwqg",
            "score": 1,
            "text": "I agree and disagree. I have pretty bad vision driving at night. I used to have the same opinion, but as I got older and my vision worse, I had to install bright lights in my car. ￼",
            "title_similarity": "0.88856035",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hnedlju",
            "score": 1,
            "text": "As a driver with a car lower than average to the ground, I think you’re right. And new cars definitely have brighter lights than older cars. Is there a regulation for this? Max lumens?",
            "title_similarity": "0.63121706",
            "sentiment_compound": 0.5362
        },
        {
            "id": "hnei1d0",
            "score": 1,
            "text": "I always drive on to work before the sun rises. The bright lights on everyone's cars were killing me (I have a 2000 Chevy S-10, with original lights, lol). I had to but a pair of yellow tinted glasses to wear so I would be completely blinded.",
            "title_similarity": "0.812114",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hnfd16q",
            "score": 1,
            "text": "I avoid night driving because the head lights hurt my eyes.  Bright head lights are a serious safety issue.",
            "title_similarity": "0.8195758",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hngpbvb",
            "score": 1,
            "text": "Im not sure if this challenges your view per se but the issues isn't that car headlights are getting brighter. \n\nThe issue is people are putting the wrong type of headlight in their car which causes it appear brighter or it's set at the wrong angle causing the person ahead of you to be blinded by the light. \n\nThe most common culprit is people putting led bulbs which are significantly brighter than Halogen Bulbs inside a housing for Halogen bulbs. This is bad because the housing was designed to reflect the duller halogen in such a way to make it appear brighter. Stick an led bulb in and you basically blind everyone infront of you.",
            "title_similarity": "0.817963",
            "sentiment_compound": -0.8352
        },
        {
            "id": "hnh29gl",
            "score": 1,
            "text": "It's driven by the fact that advances in LED and Xenon lights have made it possible to produce more light from a small light source than ever before, and which consume less electricity and cost less than ever before.  So as part of the savings the build in more brightness because more is obviously better. But no one stopped to ask, is more actually better?",
            "title_similarity": "0.56735045",
            "sentiment_compound": 0.7576
        },
        {
            "id": "hnibyxd",
            "score": 1,
            "text": "Brightness is not the problem. Color isn't really the problem either although that is a minor problem. The real problem is that there is no standard on where low beams can be placed. High beams obviously let you see better, so taking your low beams and turning them into high beams makes it easier for you to see. I just also makes you an asshole to everyone else on the highway. They really should set a standard for how high the light from a car headlight can be 100 ft from the car.",
            "title_similarity": "0.74766743",
            "sentiment_compound": 0.2402
        },
        {
            "id": "hnl61uz",
            "score": 1,
            "text": "While this is the general trend, my mother got rid of a car about 15 years ago that had just the normal lights brighter than most vehicles high beams.  It was just brutal, every vehicle we went by flashed there high beams trying to 'remind' us to turn ours off, but they already were.  \n\nThe high beams were even more stupid; it'd be the dark of night but flip those babies on and it'd look like daylight in front of ya",
            "title_similarity": "0.8137892",
            "sentiment_compound": -0.5483
        },
        {
            "id": "hnzkekg",
            "score": 1,
            "text": "I agree. I have a 2017 Chevrolet Silverado which came stock with HID headlights. They are super bright, and people get pissed off at me, and always think I have my high beams on, but I don't.  They are awesome on country roads, but not so much in town.",
            "title_similarity": "0.7932366",
            "sentiment_compound": -0.5358
        },
        {
            "id": "ho8usnh",
            "score": 1,
            "text": "I can relate to this one. SUVs are getting more and more popular and taking over the roads. They are tall and thus their headlights are often positioned higher. I drive a coupe with a large rear windows that is not tinted and when I’m driving in the city at night an SUV behind me can easily light up my whole interior with it’s low beams and the reflection in the rear view mirror can be blinding. \n\nThis is something that I think will become less and less of an issue. For years Audi has been spearheading the development of more advanced headlight designs. Using dozens of small LEDs their matrix headlights can light up what is necessary better than conventional lights without blinding oncoming drivers. Recent developments incorporate sensors and cameras to enable intelligent high beams that can detect cars and pedestrians and turn off the specific LEDs that might cause a disturbance. \n\nThis technology has started to trickle down with every new iteration being incorporated into the A8 luxury sedan and older version making their way to other vehicles in the Volkswagen group range such as the Škoda Superb. Other manufacturers have also developed similar technology in an effort to compete. \n\nSo yeah, the future looks bright.",
            "title_similarity": "0.6823771",
            "sentiment_compound": 0.9591
        },
        {
            "id": "hqqu6xw",
            "score": 2,
            "text": "Omg, thank you so much for bringing this up. I thought I was the only one who thought the headlights were bright as fuck. It’s ridiculous sometimes when I’m driving and it literally feels like someone is trying to get you killed on the streets with some seriously bright high beams or something.",
            "title_similarity": "0.78066504",
            "sentiment_compound": -0.34
        },
        {
            "id": "hr0d2ro",
            "score": 1,
            "text": "There should be a stricter law and lumen limit",
            "title_similarity": "0.38363972",
            "sentiment_compound": 0.0
        },
        {
            "id": "hsp9nqv",
            "score": 1,
            "text": "I hate these new fucking headlights. What the fuck was wrong with the old headlights? I just don't see how someone sat down in a meeting and thought it was a good idea to add bright ass LEDs on a stock car.",
            "title_similarity": "0.7390232",
            "sentiment_compound": -0.8402
        },
        {
            "id": "i3t3xun",
            "score": 2,
            "text": "Agree with your view. Also annoying are those LED light bars   that douchebags turn on in the city to somehow show off and it ends up blinding you.  Not sure how lights are a flex but I guess in the current economic conditions the bar is low....",
            "title_similarity": "0.69101775",
            "sentiment_compound": -0.4991
        },
        {
            "id": "i3ufkcl",
            "score": 1,
            "text": "Not going to change your mind, but the older mirrors that could be adjusted down more than once are helpful with this problem, but it still doesn't help with oncoming traffic.",
            "title_similarity": "0.6317573",
            "sentiment_compound": -0.4092
        }
    ]
}