{
    "CMV: female dating strategy is little more than a sub for hating on and devaluing men\nI lurked on there to see if there was any solid advice, but 80% of the posts I see are just people complaining about men. I got out of a several-years-long relationship on good terms a while ago and visited the sub to maybe find some tips on getting back out into the dating world. I totally get venting about a date gone wrong, or posting about not meeting someone who fits their standards, but how are people expecting to find a relationship with such a consistent negative mindset? \n\nLike many who post there, I also personally aim for having a partner that is socioeconomically equal to or higher than me, I work hard, have a good education, and can hold my own, I need a partner who can do the same for themselves. Doesn’t matter if they work construction or if they’re a professional streamer or what have you, I just aim for people who are doing /something/. The ridiculous standards on FDS are a little wack. Being told I /deserve/ someone with 6 figures when I myself only land in the 40k range is a bit of a reach. All in all, if the person I’m talking to doesn’t have ambitions or a sort of life plan, I kindly move on and have even remained good friends with a couple of guys I once casually dated. \n\nAnyway, I’m off topic. \n\nThe downfall of the sub is they’re consistently crapping on dudes who they deem ‘below them’ for myriad reasons that don’t make much sense. If it’s not a good fit, move on, that’s someone else’s future spouse, so don’t stress about it. They tout themselves as having high standards, when in reality many posters just want someone to be ‘chivalrous’ and pay their way. A key to a good relationship is when both partners feel as though they have the better deal. Have I not lurked enough to come across decent posts? Should I post my own opinions there and risk getting dragged?": [
        {
            "id": "hosq6dc",
            "score": 1,
            "text": "/u/Heyaeryn (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/rhqil7/deltas_awarded_in_cmv_female_dating_strategy_is/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.5392073",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hor2cyl",
            "score": -7,
            "text": "I don’t agree with some posts, but I would argue that at least 80% of the content is on point. The sub philosophy is to go for men that you like, someone who turns you on, whatever that means for YOU, the 6 figure salary is something you made up yourself in your head. It’s about not letting society beat you down for your tastes and preferences, because only YOU should be the one to decide that. Or you could be “not like the other girls” and go for what you think you deserve based on your own low opinion of yourself, then be all surprised pikachu face when you end up with sad stories on r/breakingmom, r/deadbedrooms, or r/relationship_advice 🤷‍♀️",
            "title_similarity": "0.80001235",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hos3e4l",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hor027t",
            "score": 170,
            "text": "I don’t see anything about six figures being needed when I quickly browse through?\n\nLooking through some top posts I see things about:\n\n- porn addiction\n- setting boundaries\n- abusive relationships\n- not depending on a man finacially and also not the other way\n- agaisnt casual sex\n- not being negged / avoid pick up artist behaviour \n- that you shouldn’t try fix someone or change their mind if they say they don’t want a relationship \n- men paying for first date + dates should have effort put into them\n\nThat all seems… fine to me? I mean the date paying theres some valid points on either side to be honest (how women have higher expenses and lower wages) its not for me but I don’t see anything wrong with it or being upfront about it? \n\nCan you point me in direction of some posts or comments specfically this just a quick flick through?\n\nI guess the worst I see is calling some men low value… but tbh they are calling abusive men low value which I guess I agree with? Abusive men are low value and shouldn’t be dated and should be avoided? That seems… like a very middle of the road take. \n\nEven checking their side bar for their principals they seem … reasonable. That you should improve yourself and be secure emotionally etc without a relationship, that you should know what you want and not just expect it to be in the first guy you meet, that you shouldn’t settle out of fear of being alone, that casual sex and hookups often isnt going to lead to a long relationship and should be avoided if thats what you want, that if a man says he doesnt want commitment then you should take that as the truth? It all seems very very reasonable no?\n\nEDIT: femaledatingstratpros is a satire subreddit. It is like going to a circlejerk subreddit.",
            "title_similarity": "0.77515435",
            "sentiment_compound": -0.9673
        },
        {
            "id": "hos1m54",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "horc9u4",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hos875p",
            "score": 3,
            "text": "Ooooh I just went on for the first time. They're not just hating on men in there. They're actively creating toxic femininity, which isn't something I've even seen before. With the handbook describing exactly what a high value woman needs to be (with the seeming goal of.... marriage and kids? I don't really get why that's the ultimate end goal here but ok). It's literally creating constraints for how a woman should act. \n\nI have a small conspiracy theory after reading a few of the handbook posts that it was written by a conservative man. It's all about being the perfect woman and not moving in with a guy and all this stuff. Under the guise of controlling him, yes, but that almost seems like it was thrown in there to get the women to comply with these crazy ideals.",
            "title_similarity": "0.8076005",
            "sentiment_compound": 0.9106
        },
        {
            "id": "hoqxh8b",
            "score": 73,
            "text": "I'm not that familiar with the sub but at a glance they seem like they're complaining about dates with bad men, not men in general. \n\nMost of it looks like it's encouraging women not to get abused, which is fine.",
            "title_similarity": "0.7947021",
            "sentiment_compound": 0.8721
        },
        {
            "id": "hos2dj8",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hor3y8z",
            "score": 20,
            "text": "I just looked it over and it seems to me to be mostly rather run of the mill posts from people who are pissed off from their divorce or breakup. As an admittedly female sub, this will of course involve some shitting on men, but that's not my larger point.\n\nLike a lot of relationship commentary, and especially that aimed at people focused on breakups, there is a lot of talk of who is owed what in a relationship. This is the kind of sub that will naturally be sought out by women like yourself who have recently been reintroduced to the dating scene, whether by choice or force and whether fairly or unfairly.\n\nAfter a relationship ends, it's a fairly normal reaction for someone to try to convince his or herself that he or she was the good guy and that it wasn't his or her fault. Online fora catering to people who recently have broken up will therefore populate mostly with those in that mindset.\n\nSome people, like you, will look at it and say that they don't want to focus on that negativity or break down every relationship they see in the media as some microcosm of the higher platonic form of 'relationship'. Some others, though, will look at it and dive in. That sub seems to be mostly people who have dove in.\n\nThat all said, trees do grow from dirt and others have pointed out that the sub does have some good advice. I think that advice, as well as the overall sub, is not limited to just women, and so that is likely the shortcoming of the sub (which is most likely because the mods of such a sub are those who dive into breaking down relationships the most).\n\nI mean, \"don't date a loser\" is fairly universal advice that anyone would agree to in abstract, but that for some is hard to stick to in practice. The kind of people consistently going to these subs are going down a rabbit hole of overanalyzing relationships and drawing some wrong conclusions because of that. They may sometimes shit on men, but they also have some good advice. And that's a hell of a lot more than I can say about my ex wife :)",
            "title_similarity": "0.87587106",
            "sentiment_compound": 0.5618
        },
        {
            "id": "hos5y2w",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hor1hfr",
            "score": 27,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hornsg8",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hourdin",
            "score": 0,
            "text": "It’s a sub for female incels.",
            "title_similarity": "0.38257128",
            "sentiment_compound": 0.0
        },
        {
            "id": "hosq3vo",
            "score": 1,
            "text": "it's a female incel/MGTOW type subreddit more or less",
            "title_similarity": "0.37379283",
            "sentiment_compound": 0.0
        },
        {
            "id": "hor82or",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "horkjzx",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hosbe8w",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hosbvlb",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hosq5m9",
            "score": 1,
            "text": "I just went through that sub and it’s a sad amount of shit to unpack. \n\nA lot of the attitude from there comes from their experiences with shitty men: several profiles i lurked on belonged to women who are apparent rape survivors, for example; others came there post-divorce where they (possibly rightfully) blame their ex-spouse for the dissolution of their marriage; many are just the rank and file “victims of unrealistic and selfish delusions of how women should be in relationships according to men”-types. It’s honestly hard to call them out on that because they have a point.\n\nBut of course, that makes me ask “then why tf are you dating? Shouldn’t you be trying to unpack your own trauma and jaded bullshit so you can, I dunno, stop being put in these situations where you stem your own value and identity from the people you date? Because CLEARLY the shitty men are rubbing off on you yet you keep going back to them yet say it’s all their fault…”\n\nSo all their woke nonsense aside, just remind yourself how a lot of women probably became shitty women because their experiences with men got bottlenecked into a consistent litany of shitty experiences with said shitty men. \n\nI’m not really trying to change your view, but am trying to give you some of their perspective. At the end of the day, anyone on that sub probably shouldn’t be in a relationship, yet they still pursue that “trophy” husband because of how social standards have pushed them there, and then their bad experiences cemented their pessimism. \n\nAt the end of the day? Just take the cautionary tale and move on. Just try not to be a man who sends another woman over to that sub.\n\nEdit: looks like the “lol queen shit only” crowd found this OP yall.",
            "title_similarity": "0.8562621",
            "sentiment_compound": -0.9949
        },
        {
            "id": "hotzbnc",
            "score": 1,
            "text": "Men are trash thats why.",
            "title_similarity": "0.38876116",
            "sentiment_compound": 0.0
        },
        {
            "id": "hosy4zm",
            "score": 0,
            "text": "Most of what I've seen on there isn't hating men, but ruthlessly classifying them and pursuing \"high quality men\" in a machiavellian, sociopathic way. Devaluing \"low quality men\" is just a tool for this end to avoid wasting time on them, but not really the main purpose.\n\n&#x200B;\n\nI do think it's a *tiny* minority of cis women who think and act this way, so I wouldn't put too much stock in it.\n\nThe title is an ironically over-representative moniker. Like having a polarizing, extremist political party called \"The Righteous Party For All People.\"\n\nI don't think FDS represents cis-het-women any more than incels represent cis-het-men-- there are uncomfortably many of them, but they largely keep to themselves and definitely don't represent most of the people you meet day-to-day. Just don't get sucked into it or get too jaded from what you see there.",
            "title_similarity": "0.75161976",
            "sentiment_compound": 0.4626
        },
        {
            "id": "hou2dcz",
            "score": 0,
            "text": "Dont get relationship advice from Reddit... Its absolute shit",
            "title_similarity": "0.45618635",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hozjl6k",
            "score": -1,
            "text": "first of all, in a proper relationship the man makes more money than the woman, not the same amount. i agree that you don't deserve a man making six figures or making more money than you. maybe it's not that you care about men's feelings but rather care about getting dick and that's the real reason you're writing this. we have bigger problems, reddit doesn't allow subreddits lgbtphobic and racist against protected classes yet subreddits that are sexist against women are allowed. male privilege is at work. apparently woman hate is embedded in even men that are cucks.",
            "title_similarity": "0.7691716",
            "sentiment_compound": -0.881
        },
        {
            "id": "hora2f7",
            "score": 26,
            "text": "[removed]",
            "title_similarity": "0.046365634"
        },
        {
            "id": "hosc5ct",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hosd0nc",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.046365634"
        },
        {
            "id": "hoskabn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hos9vl6",
            "score": 32,
            "text": "[deleted]",
            "title_similarity": "0.08817948"
        },
        {
            "id": "hot4cwn",
            "score": 4,
            "text": "I think you are a bit mistaken, it isn't that FDS is filled with people who hate men, rather, it's filled with women who are indifferent to men. They really don't see dating as a path to a relationship. They don't want a relationship. They want to trade what little they have to offer (largely sex and looks) for power and money that comes from being associated with a man who has high social status and good income. \n\nWhat's funny is that the people I know who have those things (and I include myself in that) really are turned off by the sort of people who value those things above people. \n\nI am a high earner. I am likely \"desirable\" by FDS standards. I'm in my early 50's, I'm very well off, I have more than enough money to retire comfortably whenever I want, I am a well-respected expert in my field, I have a PhD, I'm in a leadership position in a public company, etc.\n\nMy idea of a great first date would absolutely get me kicked to the curb by FDS -- thankfully! I want to go to the park by the lake, walk along the path and talk. We can stop at the stand and pick up a coke and a dog and munch on that if we get hungry, and we can just have fun getting to know each other. I don't want to go drop $400 on a fancy dinner to see if we like each other, I want to find out who the person is without pretense. \n\nAnd my second, third, fourth, eighteenth dates would likely get me thrown away too -- because I like to do simple, easy, everyday things: go for walks, play with my dog at the beach, hit up a museum, etc. \n\nI am no interested in being a stuffed shirt showing off for other people. I have to do that to earn my paycheck, I sure as hell don't want to relax that way. And any woman who wants a relationship with me would understand that!\n\nAnd, I know I'm not alone. Most guys (and gals too!) who have high profile, good paying jobs don't want to have to show off on days off. Putting on a performance for others is hard work. Relaxing and being accepted for who one is, now that's what can be the start of a great relationship though!\n\nBut FDS doesn't want that. They want someone they can show off and use. \n\nSo, I don't think it is that they hate men. I think you have that wrong. Rather, they just don't see men as part of the equation. They aren't thinking in terms of a relationship where there are two people in a partnership and each is getting something of equal worth and value. They are thinking totally in terms of what they get. And that's all they are interested in.",
            "title_similarity": "0.78537595",
            "sentiment_compound": 0.9205
        },
        {
            "id": "hoshr3q",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hoslkup",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hoqyyfm",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hos4vgn",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hos92zp",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hority2",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hoscd2y",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hoskusv",
            "score": 2,
            "text": "I don’t disagree with what you say and this might not change your mind, but if you read the rules thoroughly you will see that the idea is good. The practice however is to be desired. There are some mindsets that are a little to extream.\n\nOne of my reoccurring gripe is their disire/push that a man need to take you to a sit down meal and must pay for it all. There is nothing wrong with getting coffee or going Dutch.\n\nFrom what I have gathered their biggest strive that is hard to see over all the gold diggers that tend to pop up in “hot” or r/all is the safety of women from the low/no value men (LVM/NVM) out there. Yes as a man I am discussed by my sex as a whole. there are a lot discussing men how will treat women terribly. And there are an equal number of women who can’t see that. \n\nAs a whole I think the human race is a selfish people that care only of ones self. There are some who are more willing to step on others to get it.",
            "title_similarity": "0.6645026",
            "sentiment_compound": 0.9471
        },
        {
            "id": "hos69zs",
            "score": 56,
            "text": "Maybe this is an unpopular opinion but I haven't really seen as many of these posts as other people have but I don't see what is wrong with women having a subreddit to discuss their experiences with dating. Men have forums dedicated to discussing how to neg/manipulate women, lie to them or become sexist PUAs...so it just seems funny to me that people complain about FDS so much\n\nI never post in it but I've read a lot of really helpful posts from there and sure, some of it is kind of ridiculous but that's just this site in general lol.",
            "title_similarity": "0.8498068",
            "sentiment_compound": 0.8201
        },
        {
            "id": "hor63z1",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "horni8r",
            "score": 30,
            "text": "[removed]",
            "title_similarity": "0.04636561"
        },
        {
            "id": "hosau70",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.046365634"
        },
        {
            "id": "hosl92z",
            "score": 0,
            "text": "All of those subs started out better, and like all of them, devolved into stupidity. \n\nSame sort of deal with r/theredpill for example. Started with legitimate self help for struggling people. Got infiltrated/invaded with crazies, and went off the rail. \n\nIt might be like that now. It wasn’t at the start, and (from my understanding) wasn’t the core intent of the sub.",
            "title_similarity": "0.7029145",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hosmxq0",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hosspud",
            "score": 0,
            "text": "You’re doing God’s work here.",
            "title_similarity": "0.08683573",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoswb80",
            "score": 0,
            "text": "FDS was created by people on 4chan to give them a fake boogey man to incel over, today it's evolved to unironically attract people, but it started as satire.",
            "title_similarity": "0.68764913",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hotaow9",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hq20fcd",
            "score": 0,
            "text": "I wandered in by accident and tried to post some encouragement for someone who needed it and pretty much got told to fuck off. It’s definitely not about support.",
            "title_similarity": "0.6582459",
            "sentiment_compound": -0.0408
        },
        {
            "id": "hq4dgkg",
            "score": 0,
            "text": "Amazing...commenting so I can find this later\n\nEdit: Whoever downvoted this has proved OPs point wonderfully. Your downvote is as useless as your dreams.",
            "title_similarity": "0.5492668",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hq5cvt0",
            "score": 0,
            "text": "With that opinion you'll get bannes on the spot.",
            "title_similarity": "0.12307301",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoqtm9y",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "horbdfz",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hoqu3ks",
            "score": 305,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "horwo6z",
            "score": 12,
            "text": "In my opinion, the online dating scene sucks for both men and women but in different ways. Any half decent looking woman on a dating site is going to get flooded with matches, especially in larger cities. I'd be willing to bet most men on dating sites don't even read a woman's bio before swiping right (or whatever it takes to like someone) on any woman they find remotely attractive and there are a lot of guys strictly trolling for quick sex. I'd ever bet the majority of men who are actually looking for a long term relationship are also open to a quick hookup. So women, who tend to be more selective anyway, can have an overwhelming number of potential matches to sort through. Sites like Tinder that only show you people who like you if you like them make this problem even worse because a lot of men k know on Tinder literally swipe right on ever woman so they don't miss a potential match. I see this dynamic as a significant reason many women set ridiculously high standards.",
            "title_similarity": "0.8736556",
            "sentiment_compound": 0.9076
        },
        {
            "id": "hormwd9",
            "score": 64,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hosl42g",
            "score": 1,
            "text": "A problem with all the dating ecosystem is that: best candidate find a match and exit the said ecosystem. So the expert are actually the worst.   \nSome of them because they have a lot of success and enjoy this game.  \nSome because they have expectations not rooted in real life.  \n\n\nThis is true as well for people present on dating sites/apps. So you probably need to filter MOST of the stuff. Actually this is true for many subs :p  \n\n\nBut you will probably find some good advices too if you have been out of the game for a long time. For example, I've found in dating sub \"how to write your Tinder profile\", what to write, what you should not write.   \n\n\nSo read with moderation, they have good content too, but remember that implicitly, these sub accumulate \"bad candidates\".",
            "title_similarity": "0.821249",
            "sentiment_compound": 0.8573
        },
        {
            "id": "hou2agw",
            "score": -1,
            "text": "They really love misandry don't they. Also they're sexist, racist and toxic. Big yikes",
            "title_similarity": "0.5168553",
            "sentiment_compound": 0.1263
        },
        {
            "id": "hou3tpq",
            "score": -1,
            "text": "I loved fucking with that sub, but got banned quickly loll",
            "title_similarity": "0.70721626",
            "sentiment_compound": -0.3716
        },
        {
            "id": "hq1kuro",
            "score": -1,
            "text": "> Being told I /deserve/ someone with 6 figures when I myself only land in the 40k range is a bit of a reach. \n\nI suggest that using how much a person makes is harmful as an indicator of the value of the people.\n\nWhat that's saying is that people who make 100K are somehow better than people who make 40K.  That's just not true.\n\nI'm a software developer. I married a teacher. I made more than she did. That doesn't make me better, or make us incompatible.",
            "title_similarity": "0.67069507",
            "sentiment_compound": 0.1685
        },
        {
            "id": "hq2hn38",
            "score": 1,
            "text": ">Like many who post there, I also personally aim for having a partner that is socioeconomically equal to or higher than me\n\nA lofty but unrelastic goal. Think about it, if everyone shared that same ideal then at best you'd only be able to date someone that is equal to you, never higher and it's pretty hard to both quantify and actually find someone who is exactly equal to you socioeconomically.\n\nSo with that current mindset finding someone involves looking for someone who has lower standards who happens to be more successful socioeconomically. That's a ticking time bomb and abusive. The one with lower standards will eventually raise them and move on.",
            "title_similarity": "0.70325446",
            "sentiment_compound": 0.8717
        },
        {
            "id": "hq3ze8u",
            "score": 1,
            "text": "\"I also personally aim for having a partner that is socioeconomically equal to or higher than me\"\n\n\nThat line makes my skin crawl.",
            "title_similarity": "0.48619312",
            "sentiment_compound": 0.0
        },
        {
            "id": "hosji8j",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hos150c",
            "score": 12,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hosfzg9",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hoskbpd",
            "score": 54,
            "text": "I mean, even if you're right I really don't see all that much wrong with a subreddit that has a culture that allows for women to have reasonable-high standards and complain about guys who don't meet those standards. And if they want to have those standards, and then end up bitter and alone because they can't attract someone with those standards, that's their problem to deal with.\n\nAnd (this part is important) I don't really think FDS is a problem because, unlike incel communities, the toxicity of FDS seems to stay in FDS. Even on this subreddit a post like \"All men should make six figures, be six feet tall, and have a six inch long dick, cmv\" doesn't pop up very often and, when it does, it gets downvoted to oblivion before it can pick up any traction.\n\nI also personally think the reason a lot of people have such an intense emotional reaction to FDS is that while a lot of us internet gremlins are used to the background radiation that is incelly misogyny we (mostly guys) aren't used to experiencing the opposite.\n\nI dunno, I think most people overhype how much of an issue FDS is.\n\n(I also don't think women hating men is as much of an issue as the opposite because, for example, as far as I know there hasn't been an instance where a woman has shot up a school full of children because they couldn't get that prime 6/6/6 catch).",
            "title_similarity": "0.7334181",
            "sentiment_compound": -0.9002
        },
        {
            "id": "hot9ka4",
            "score": 5,
            "text": "It's honestly 90% the times that we live in. In the early 2000s for example being a \"gold digger\" was considered a bad thing as was prostitution, adultery, very clearly and vividly talking about sex in a song on the radio, etc. Today those are all viewed by a large group of males and females as empowering. I honestly think a lot of it is because of people like cardi b who portray things like these as a positive thing. The tinder and onlyfans cultures are other likely causes for the cultural shift. Honestly in my opinion this decade is the definition of sadcringe. There's a lot of hate being thrown around, a lot of women hate men and a lot of men hate women. Imo if a man hates women he should be with other men and if a woman hates men she should be with other women. There's a lot of extremely shallow people in this world. From the neck beard eating a family sized bag of Doritos while pleasuring himself in his mother's basement meanwhile believing he deserves a supermodel (that cooks for, cleans up after, and constantly has sex with him), to the drug addict with a venereal disease for each baby daddy living on welfare and child support who believes that she deserves a tall and handsome multi-millionaire with a 13 inch dick. It's sad honestly.",
            "title_similarity": "0.7908976",
            "sentiment_compound": 0.6697
        },
        {
            "id": "hordy8k",
            "score": 1237,
            "text": "It is far more than *merely* a sub for hating on and devaluing men!\n\n#####Who uses FDS?\n\nIt is important to understand who goes to FDS. Of all women, only women that use reddit, and of all women that use reddit, only women that:\n\n* Are struggling to find and hold down a relationship; i.e., are not having success dating.\n\n* Are the kind of people that seek dating advice on reddit.\n\n* Are likely to also use /r/datingoverthirty, /r/datingoverforty, and /r/AskWomenOver30 according to [subredditstats](https://subredditstats.com/subreddit-user-overlaps/femaledatingstrategy).\n\n* Are most likely to also use /r/PurplePillDebate according to [subredditstats](https://subredditstats.com/subreddit-user-overlaps/femaledatingstrategy). PurplePillDebate is a subreddit for debating with \"RedPill\" people (see /r/TheRedPill (or don't - it's super toxic), which is a segment of the [manosphere](https://en.wikipedia.org/wiki/Manosphere).\n\nGiven this, I would speculate that it is reasonable to characterize the subreddit's demography as women, aged 30+, lonely, and terminally online. In other words, this is a particularly vulnerable and desperate population, which is ripe for preying upon.\n\n#####Radicalization and $$$\n\nWhen you have a population that is relatively vulnerable and isolated, then inundating them in information, ideas, and ideology that lacks broader appeal will server to further isolate that population by pushing away the people around them, leading to them relying more and more on their radicalizing community as a place of support and socialization. This process then repeats itself and becomes difficult to break free from. It becomes a self-fulfilling prophesy whereby the FDS population adopts toxic ideas about love, sex, and relationships, and in doing so works against themselves in their search for love, sex, and relationships.\n\nNow, this is where things get spicy. The moderators of FDS have a captive audience in the FDS users because the FDS advice is far more likely to harm than help their dating prospects. So, what do you do with a captive audience? Well, you turn them into customers! The FDS mods have created a corporation, \"The Real Female Dating Strategy LLC\", which has a website, podcast, and social media presence across basically all platforms, all of which can be found in [the FDS Sub wiki](https://www.reddit.com/r/FemaleDatingStrategy/wiki/index). In addition to any sort of ad revenue, site traffic, or sponsorship they have, they also have [merchandising](https://www.thefemaledatingstrategy.com/fds-merchandise-1).\n\n#####Summary\n\nSo to your claim that FDS is *merely* for hating men, I present to you the case that actually FDS is for radicalizing women and then taking advantage of said women for financial gain.",
            "title_similarity": "0.85515416",
            "sentiment_compound": -0.5731
        },
        {
            "id": "hoshj9n",
            "score": 14,
            "text": "But it came to be \\*in response\\* to things like PUA, MRA, Red Pill, Incels etc, right?\n\n  \nI'll admit this is a presumption, so correct me if I'm wrong.",
            "title_similarity": "0.44354767",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hoqvm0s",
            "score": 1091,
            "text": "[removed]",
            "title_similarity": "0.04636559"
        },
        {
            "id": "hq2304a",
            "score": 7,
            "text": "Do you complain about the porn subs promoting rape and abuse of women? Theres like over 100 of them.",
            "title_similarity": "0.6898427",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hot22ix",
            "score": 12,
            "text": "you posted this so that people would agree with you lmao, enjoy the internet points",
            "title_similarity": "0.38170052",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hoxfjxy",
            "score": 12,
            "text": "My final comment. Again, I don’t subscribe to all of FDS but I would bet even other men would agree with FDS on what a low value man is. For the record, low value doesn’t mean low income, it means they treat people badly. FDS is trying to encourage women not to give energy to LV men because there are wonderful men out there who deserve love and to be treated well. \n\nHere are some things about a man that make him low value to FDS, and to me. Let me know if you agree. \n\nHe:\n- lives with his parent(s)\n- doesn’t work\n- expects others to clean up after him or cook for him \n- has poor hygiene\n- doesn’t take care of his body, mind, emotional state \n- needs a “mommy” instead of a partner \n- doesn’t put effort into relationships\n- tries to control women \n- is a workaholic and puts work before people \n- only wants sex\n- harms or demeans women \n- is racist, homophobic, and/or misogynistic \n- doesn’t have basic life skills \n- doesn’t have friends \n- doesn’t get along with his family (even if they’re nice)\n- is an addict \n- is very pessimistic and negative \n- puts the minimum of effort into everything \n- fears commitment \n- is only concerned with his hobbies \n- has no goals\n- leeches off other people \n\nI’m guessing you wouldn’t want your sister or daughter to date a man like that. You’re probably not a man like that. Good men should be grateful to FDS for encouraging women to stay away from losers.",
            "title_similarity": "0.7796666",
            "sentiment_compound": 0.9706
        },
        {
            "id": "hovk4e4",
            "score": 21,
            "text": "I skimmed over that sub and  I dont see how advicing women on not dating abusers is \"devaluing men\".\n\nI read a few comments of what it seems bitter women but overall nothing on the level of what you see in the incel subreddits. I don't see users on fds saying how men deserve to raped or killed.",
            "title_similarity": "0.819659",
            "sentiment_compound": -0.9391
        },
        {
            "id": "hotdkhh",
            "score": 40,
            "text": "I don’t agree with all of FDS’s ideals but following some of their basic “rules” have given me a lot of time back that I used to spend on dating. It’s also helped me set personal boundaries for what kind of behavior I will or will not tolerate. Coming from an evangelical background that taught me men were superior to women and that I needed to submit to men really messed up my view of myself and the world. FDS has helped me realign my values with reality and my own inner voice. Some FDS “rules” I follow:\n\n- never chase a man. If he wants to spend time with you, he will make time to do so. \n\n- don’t contact exes\n\n- delete contacts of people who aren’t worth your time \n\n- walk away at the first red flag. Don’t let them pile up. \n\n- don’t settle down too quickly. Take your time in finding the right person, not the convenient person. \n\n- Be safe when dating. \n\nThe other point I’d like to make is that there are women in FDS whose lives depend on choosing the right partner because of the society they live in. FDS is a good guideline to weed out the bad and dangerous men.",
            "title_similarity": "0.79785156",
            "sentiment_compound": 0.8837
        },
        {
            "id": "hos8jy0",
            "score": 3693,
            "text": "**FDS works the same way all pill culture works**. The red pill, the incel communities, MGTOW, etc. \n\nAnd you may say \"Well, doesn't that prove my point\" and maybe you're right, but the thing you have to understand about pill culture is that it doesn't rise out of a hatred for another gender or a group. It rises out of an attempt to create a pain-management strategy for people. It takes people looking for strategies to deal with a painful situation (love and relationships) and then sucks them into alt-right thinking patterns by using mechanisms key to high-control groups. You can see this in how closely policies line up with the BITE model (behavior control, information control, thought control, emotional control). \n\nSo I guess my thesis statement is that if you round up FDS to just being a group of women you don't like bitching about men, you've missed the really significant mechanism for how it is operating. You're seeing the part you find hurtful or offensive, but being unable to see past that you're missing what's really being done at the center of things. \n\n* So we're going to first need people in binary catatgories. There are high and low-value men. There are queens and pickmeshas. There's no middle ground, you either have value or you don't. Be alpha or be a beta cuck. Be a chad or a manlet. We've now created strong in-group and out-group identies. \n* Next, lingo. We're going to create a bunch of words and terminology specific to our community that have specific definitions that only we use. Scrotes, pickmeshas, monkeybranching, AFBB, hypergamy, LVM, NVM, etc. etc. Giving you language specific to this philosophy to think in shapes your thoughts and your ability to communicate about situations to a specific series of jargon all set to reinforce a specific set of ideas. \n* There's going to be some actually helpful advice. Vet guys before you give them too much emotional attachment. Don't proceed hoping he's going to improve. (I could list RP/MGTOW/Incel examples here too if you're interested). This is very basic advice about self-respect and boundaries that a lot of people need to hear and it feels great to have someone talking about your problems like they are real and offering solutions. \n* Typically the group is going to *say* in their literature and philosophical pieces that you can kind of take what's useful and use it how you want to. It usually pitches itself as kind of flexible and you can do whatever you want. But in *practice*, being in the group means that no one else is supportive of that. If you come in saying \"Look, I like what you say about vetting, but I love kinky sex and I am going to keep doing that\", the group is really hostile to diverging from the plan. The only thing bringing this group together is a strong adherence to the doctrine, and working against it or questioning it will cause the in-group to shun you and try to talk you out of it. You are told that if you're not on board with the entire package of ideas, you're weak or still thinking like the outgroup and you'll be pressured to accept in-group ideas. \n* A huge portion of energy will be spent looking at fear-based and anger-based examples that reinforce the needs of the group. Incels will look at chadfishing, Mgtow will post articles about paternity fraud, redpill will post tinder studies that reinforce hypergamy, and FDS is going to post about scrotes fucking over women. He left his wife after her cancer diagnosis. Look at this unhappy marriage and how she married a LVM and now she's stuck with kids. This creates a loop. The loop is you go to the site, you get angry and afraid, you rage in the comments about how [inert group here] has the right ideas, and then you come back and do it all over again. You end up kind of addicted to the anger and fear because you see things that are painful in the real world or online and you run back to the people you know will react the way you want them to and you just live that way. It keeps you coming back to their site again and again so that it becomes a significant part of your day. \n* Outside thought and critique is harmful. We can't let people participate here who aren't believers, we have to excise members who aren't taking the whole idea set at once, and we have to make sure that we're never really talking with outsiders about what we think, because that could challenge the opinions. We're going to constantly talk about our haters and how we're unpopular and everyone wants to shut us down, because persecution is a strong motivation to stay in the in-group. We're going to use fake or extreme examples of critique so poorly thought out that we can mock it as a kind of false example of engaging with outside thought, but it's largely a strawman to reinforce in-group thought. \n* Practical results aren't required. You don't have to get the thing you were promised to stay here. You don't see women fleeing the sub when they find their HVM and go off to live a perfectly happy life. There will be highly fictionalized and, by any rational standard, imaginary \"success\" stories posted from time to time, but largely you won't see an exodus of people who are successful and get to leave the group. There's no actual plan for people to succeed and move on. There's no endgame. People joined to manage their pain over bad relationships, but the goal shifts to being about your membership in the in-group and not really about your outside life and how this is really playing out in terms of your dating experiences. And some people will see *some* positive results of course, because there are some practical nuggets of advice scattered around, but it won't usually result in the wholesale change promised. \n* This is the point where you realize you could go back and replace FDS with Scientology and this list would look pretty much exactly the same. \n* If it isn't working, you're not doing it right. People who get frustrated that they aren't seeing results promised are told that they are just not embracing the philosophy the right way, and if they try harder they will get the results they are looking for. This is always a case of user failure and never prompts anyone to consider if the philosophy is actually sound. \n* People have a very hard time leaving. You can stop hanging out with the group, you can physically leave the site, but you've been indoctrinated in a way of thinking about people and human behavior that is really hard to unwind. I know, because I spend a lot of time talking to people trying to unwind the thoughts they've internalized. You're used to thinking in the lingo and the philosophical terms you are used to that needing to unlearn that is painful and difficult. \n\n\nI could go on. \n\nYou say FDS is about little more than hating men. I'd argue it is about a LOT more. It is really important that people be able to identify this kind of group structure on sight. No one joins because they hate men. They join because they are frustrated in dating and feel like they are being used or taken advantage of and they want strategies to avoid painful experiences and find what they are looking for. It's what happens afterward that causes the problem. These groups are happening a lot online and you should be able to see these common elements and label them and recognize them on sight. Are they giving you a bunch of new lingo and terminology? Are they dividing people into classes and groups with hard, binary features? Are they using rage and fear to keep you interested in the material? Big, big red flags.",
            "title_similarity": "0.6242186",
            "sentiment_compound": -0.947
        },
        {
            "id": "hosp6xr",
            "score": 2,
            "text": "Hi /u/Heyaeryn! You're not in trouble, don't worry. This is just a **Rules Reminder for All Users.** \n\n---\n\n**All users, (including mods, OP, and commenters) are required to follow the rules of this sub at all times.** If you see a user violate the rules of the sub, please report that comment/post and a human moderator will review it. We understand that some topics posted here may touch on sensitive or contentious issues. We ask that all users **remember the human** and **assume good faith**. \n\n**Notice to all users:**\n\n1. Per **Rule 1**, [**top-level comments must challenge OP's view.**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)\n\n2. Please **familiarize yourself with** [**our rules**](https://www.reddit.com/r/changemyview/wiki/rules) **and the** [**mod standards**](https://www.reddit.com/r/changemyview/wiki/modstandards). We expect all users *and* mods to abide by these two policies at all times. \n\n\n3. This sub is for changing OP's view. We require that **all** [**top-level comments**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1) **disagree with OP's view**, and that **all other comments** [**be relevant to the conversation**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5).\n\n4. We understand that some posts may address very contentious issues. Please **report any rule-breaking comments or posts.**\n\n5. **All users must** [**be respectful**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2) **to one another.**\n\nIf you have any questions or concerns regarding our rules, please message the mods through [modmail](https://www.reddit.com/message/compose/?to=/r/changemyview) (*not PM*).",
            "title_similarity": "0.49317074",
            "sentiment_compound": 0.8371
        },
        {
            "id": "hot1581",
            "score": 2,
            "text": "The alternative, honestly, is to just ignore them. You admit (from your description) that it's toxic behavior, and no one needs toxicity in their lives. They'll filter themselves out from the dating pool just like their male counterparts based on their attitudes. Others offer good advice for protecting yourself against those attitudes and personalities.",
            "title_similarity": "0.7115805",
            "sentiment_compound": 0.6705
        },
        {
            "id": "houvrpz",
            "score": 1,
            "text": "r / Pussypassdenied is the same thing but for woman. What's your point.",
            "title_similarity": "0.47269222",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp452su",
            "score": 1,
            "text": ">The downfall of the sub is they’re consistently crapping on dudes who they deem ‘below them’ for myriad reasons that don’t make much sense.\n\nOkay, this is FDS we’re talking about. According to them, all men are lower than they are because they are misandrists who seriously need to get a damn life.",
            "title_similarity": "0.7159279",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hpdotpd",
            "score": 6,
            "text": "When you consider the porn subs that degrade and devalue women in the thousands, the fit you are throwing over one female sub that tells women to have standards is truly humiliating for you.",
            "title_similarity": "0.76884145",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hpdx4d7",
            "score": 1,
            "text": ">Like many who post there, I also personally aim for having a partner that is socioeconomically equal to or higher than me,\n\nLate to the party,  but...\n\nThis strikes me as an odd framing.  I'm not sure about your posting history,  but...  If you're a woman,  you're saying that you'll never \"date down\".   If you're a man, I can't help but imagine how you'd be attacked for taking advantage of someone if you tried to do so. \n\nHow much of your dating preference is structured around socioeconomic status?  \n\nMine is structured around things like \"am I attracted to this person?\"  \"Are they kind?\"  \"Can I talk to this person about where I'm at in my life and where they're at in theirs?\"  \"Does this person care about me or do they care about the fact that my socioeconomic status and the fact that dating them equals or increases mine?\"",
            "title_similarity": "0.8054618",
            "sentiment_compound": 0.9132
        },
        {
            "id": "hptfq6h",
            "score": 1,
            "text": "!delta\n\nWow",
            "title_similarity": "-0.1350426",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hptwrwb",
            "score": 2,
            "text": "Lets hear OPs opinion on BLM",
            "title_similarity": "0.11460493",
            "sentiment_compound": 0.0
        },
        {
            "id": "hq1c2ny",
            "score": 1,
            "text": "Did that sub go private after this post?",
            "title_similarity": "0.30376682",
            "sentiment_compound": 0.0
        },
        {
            "id": "hq1cdyb",
            "score": 1,
            "text": "Can't view the subreddit because it's private, but from some comments here it sounds like it. However you can hardly blame it with the amount of redpill type subs out there.",
            "title_similarity": "0.5535581",
            "sentiment_compound": 0.1505
        },
        {
            "id": "hq1qday",
            "score": 1,
            "text": "Just to add to what others have said: imagine what kind of woman thinks that advice is good. Obviously some of them do. The dating advice is things like find a man who pays 100%, who worships you, who only spends time with you, who will bend over backwards for you. It’s likely these are women who serially date unemployed men who are takers, who disrespect them, who spend more time at the gym than with them. If they were unable to ever find a guy who didn’t do these things, they end up jaded and pissed and confused why everyone else is finding “good guys” and they can’t. So they look for advice, or try to give advice, but only people like them would think their advice is any good because everyone else sees it’s insane, the same way most people react to incel advice about Chads and how you’ve gotta be the alpha.\n\nI’ve met a couple women who seem to have this problem, and it’s 100% their selection process. They want a relationship but all they get are fuck boys, so they assume that’s what all guys are like. They date guys for their looks and have a low bar for how he treats them. They refuse to date people they don’t find extremely attractive, so they end up with narcissists who focus on their own looks (and themselves) to an extreme. After 30 years of guys hitting and quitting, they just figure guys are awful. Someone telling them to look for a guy who worships them is like a beacon in the dark — “it’s true! I keep dating guys who disrespect me!” — but they fail to see that worship is just what shitty guys do to get their attention. A regular person doesn’t worship a stranger they just met. Respect is earned over time and anyone who throws a ton of it at you from the start is probably fake.",
            "title_similarity": "0.86578745",
            "sentiment_compound": -0.8652
        },
        {
            "id": "hq1xt2l",
            "score": 2,
            "text": "I don't think so. Having read through many of the posts on that subreddit does he but you are saying, I don't think that this particular subreddit has evolved into hating men. It might be evolving into that but I don't think it's really there yet. There are not a lot of posts which really suggest that that is what it has become. It's me it's me it's just a lot of women being burnt out on bad relationships so they said high standards and they expect high standards. Nothing more.",
            "title_similarity": "0.87599236",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hq2elgq",
            "score": 1,
            "text": "'Alt-right' thinking strategies.  \n\nThat phrase renders your entire argument invalid.",
            "title_similarity": "0.48212",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hq3bn7d",
            "score": 1,
            "text": "It is a difficult notion to shake but human attraction isn't a clear hierarchy the way other animal systems are.\n\nHuman attraction and connection is about compatibility not who is \"good enough.\"\n\nI think Incel and femcel attitudes arise from an attachment to the idea that there is a clear hierarchy in dating when it simply isn't the case.",
            "title_similarity": "0.63610065",
            "sentiment_compound": 0.8028
        },
        {
            "id": "hq4p01k",
            "score": 1,
            "text": "Your exes shouldn't be your friends, the only exception is if there's kids involved. If you're friends with your ex, you're still interested. This is coming from my personal experience; exes are exes for a reason.",
            "title_similarity": "0.6318402",
            "sentiment_compound": 0.5017
        },
        {
            "id": "hq6yz3e",
            "score": 1,
            "text": "Haha they made a response to this post and i notice a lot of them start with the phrase, \"it's funny...\". Looks like they're getting a tad nervous of being called out.",
            "title_similarity": "0.6226655",
            "sentiment_compound": 0.743
        },
        {
            "id": "hrd28n3",
            "score": 2,
            "text": "I’m actually happy about FDS growing user count. Yeah it’s toxic and angry. \n\nBut if anything women are not angry ENOUGH. \n\nPill subs for men encourage men to be directly violent to their wifes and girlfriends. \n\nSubs like FDS look down on deadbeat men and encourage women to not put up with bs. I don’t see anything wrong with that.",
            "title_similarity": "0.7793287",
            "sentiment_compound": 0.8102
        },
        {
            "id": "hrlit4h",
            "score": 3,
            "text": "FDS doesn't advocate violence against men, taking away male rights, or cheating.   \n\n\nMost of the users are looking for healthy lifestyles and want to avoid the pitfalls that one generally finds themselves in while dating men, like being exposed to lengthy or robust cheating circles, substance abuse issues, violence, and general sociopathic nonsense.   \n\n\nOne could argue that you don't need to apply gender to discourse in order to have a conversation \\*for\\* women, but if you look around very briefly on Reddit, you see subs advocating rape, \"strugglefucking,\" redpill shit, and a slew of other subs which are designed to bond men together by trashing women. The odds are not even. The platform does not disservice men in any capacity, let alone in any way that is enough to \\*not\\* justify a female-only sub.   \n\n\nThe women on the site are tired of being beaten, cheated on, raped, stalked, harassed, and let down in ways that society is not willing to compensate for and openly laughs at. Women don't go on mass shooting sprees, or try to leverage the government to limit men's voices.   \n\n\nThey aren't redpill. They aren't hostile to men as a sex, because many of us would prefer to leave men alone (unlike redpillers, who actively torment women because \"boobs\" or \"male bonding.\")   \n\n\nThere is nowhere else to go to get a grip on the gender-based hatred that society AND Reddit as a whole openly support.  Women don't just \"hate men\" for absolutely no fucking reason.   \n\n\nThere is literally nowhere else to go.",
            "title_similarity": "0.80336046",
            "sentiment_compound": -0.9917
        },
        {
            "id": "hvhlq1k",
            "score": 1,
            "text": "30 -40 year old karens hated by everyone all put in a toxic subreddit",
            "title_similarity": "0.7008491",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hvllumw",
            "score": 3,
            "text": "As someone who seems to fall time and time again for narcissists and recently learned about love bombing, gaslighting, negging etc because I was trying to educate myself as to not continue this pattern of dating- I see the value in FDS. For a woman like myself who is a “fixer” I realized for a long time I felt like I had to prove my value by helping, offering comfort, favors, emotional support etc etc etc due to abuse and trauma I absolutely agree with so much I have read.\n\nObviously I have my own morals and opinions so there are many things I do not agree with. I think with any dogma individuals have to use their own discernment as to what works with them. Do I believe my partner needs to make 6 figures? No. I do however find the grey rock strategy beneficial to me because I have been easily emotionally manipulated in the past. I feel like FDS is especially valuable to women with low self esteem and those who have grown up with a parent who is a narcissist or seems to continue to fall into patterns of dating narcissists or emotionally manipulative partners. I definitely see this as a helpful tool.\n\nI’m a student of philosophy. I was always taught not to just blindly accept anything. Put it into practice in your own life. If it doesn’t work for you put it down. You don’t have to accept every aspect of FDS as truth but not everyone had the love, support and privilege of a nurturing environment to teach them to have value for themselves and not over extend their kindness to emotionally draining people who do not reciprocate the energy in a relationship.\n\nI consider some of the standards in FDS a bit petty or extreme HOWEVER for a woman who is trying to exercise setting boundaries who is often used like a doormat these ideas about approaching relationships (both romantic or platonic ) can be beneficial. \n\nWhat I’m saying is don’t throw the baby out with the bath water. I see a lot of good things in FDS and a lot of things that I just gloss over because they do not align with my own personal morals and values. What’s important is to think for yourself.\n\nTLDR- FDS is an extreme strategy that can be beneficial for victims of abuse or trauma struggling to set boundaries and not be taken advantage of or abused.",
            "title_similarity": "0.8140345",
            "sentiment_compound": 0.9896
        },
        {
            "id": "i46rrw6",
            "score": 1,
            "text": "i need put this on my fridge to keep me from falling from the myriad of groups like this.",
            "title_similarity": "0.46177736",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i6fegmu",
            "score": 1,
            "text": "Hatred of men is born out of trauma and fear, hatred of women is born out of spite.",
            "title_similarity": "0.625238",
            "sentiment_compound": -0.9571
        },
        {
            "id": "i6zo5bt",
            "score": 1,
            "text": "Hey do y all know what happened to r/femaledatingstrategy",
            "title_similarity": "0.35894737",
            "sentiment_compound": 0.0
        },
        {
            "id": "i8dbzk8",
            "score": 1,
            "text": "I think FDS can be toxic but I don’t think everyone is “someone’s future spouse”. \n\nThey may not ever get married.",
            "title_similarity": "0.62244946",
            "sentiment_compound": 0.0
        }
    ]
}