{
    "CMV: I don't think I should personally make changes to my life to fight climate change when multi billion dollar companies couldn't care less.\nWhy should I stop using my car and pay multiple times more to use exorbitant trains?\n\nWhy should I stop eating meat while people like Jeff Bezos are blasting off into space?\n\nWhy should I stop flying when cruise ships are out and about pumping more CO2 into the atmosphere than thousands of cars combined?\n\nI'm not a climate change denier, I care about the climate. But I'm not going to significantly alter my life when these companies get away with what they're doing.\n\nI think the whole backlash against climate change is most often not out of outright denial, but rather working class people are sick of being lectured by champagne socialists to make changes they often can't even afford to, while the people lecturing them wizz around in private jets to attend their next climate conference.": [
        {
            "id": "hpaoel8",
            "score": 1,
            "text": "/u/British231 (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/rko7c2/deltas_awarded_in_cmv_i_dont_think_i_should/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.40325928",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hpamfwg",
            "score": 0,
            "text": "Individual changes don’t mean much anyways so don’t sweat it. We need systemic change.",
            "title_similarity": "0.43091974",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpasgp7",
            "score": 1,
            "text": "I agree with you. All of these comments about how corporations do these things because of consumers. We are expected to make the better decision despite its impact on our personal lives. But, there is no expectation for the leaders of these corporations or the corporation themselves (since they rights like people in the US) to just make a better decision even if it isn’t as profitable? Ya, no, I think a burden needs to be placed on them to make it less profitable to carry on the way they are. I don’t believe enough people can be expected to make the changes in their personal lives that it would require to make corporations change their actions.",
            "title_similarity": "0.7431202",
            "sentiment_compound": 0.8863
        },
        {
            "id": "hpapeur",
            "score": 77,
            "text": "Your primary premise is fundamentally flawed!\n\nThe following multi-billion companies are just a few that are doing a TON to fight climate change and have made significant changes to either become carbon neutral or carbon negative -- as well as doing great work in other areas of environmental impact:\n\nCisco Systems, Ecolabs, Hasbro, PG&E, Best Buy, Apple, CMS Energy, Johnson & Johnson, Bell Corp, HP, Biogen, Boston Scientific, Microsoft, Hershey, Boeing, Raytheon, NVIDIA, Walmart, Bristol-Myers Squibb, MetLife, PPG, Oracle, Starbucks, CVS, UnitedHealth Group, GE,\n\nand many more  [https://www.newsweek.com/full-list-us-companies-green-rankings-2017-18](https://www.newsweek.com/full-list-us-companies-green-rankings-2017-18)\n\nYou may think those multi-billion dollar companies couldn't care less, but they do. If you go read any of these company's annual reports you will find that they are working to reduce their carbon footprint and other environmental impacts for two reasons. First, it makes economic sense to do so. Reducing energy consumption costs less money overall. Second, it makes good PR, which makes good business sense, so the investment is a solid public relations investment. You may think they could do more or do it faster, but that is not the argument you made. If it is in their annual reports, they care. It is. They do. \n\nAs one example, Walmart is [very aggressive](https://corporate.walmart.com/planet/climate-change) in addressing climate change, sourcing 36% of their energy demand from renewable sources, and many of their stores and warehouses are topped with solar panels. They doubled their fleet's fuel efficiency between 2005 and 2015, and are working to improve it even further. They have been reporting climate impacts on their annual reports since 2006. Walmart has been a global leader in corporate responsibility on climate change. A stance that has really pissed me off, since I want them to be simply evil in every respect given the way they treat retail workers -- it would make it easier to simply hate them and wish them to fail.",
            "title_similarity": "0.721731",
            "sentiment_compound": 0.9607
        },
        {
            "id": "hpassup",
            "score": -2,
            "text": "True opinion. No matter what we do individually, the entire world couldnt make any significant difference on atmosphete pollution. Add reality to this equation, you eliminate all the living-to-survive people, uneducated, unintelligent and evil people, careless, misguided people and people who live in countries that see no need to follow the cause… and you get about 5-20% of total human population living as green as possible. Which would amount up to 5% of total emissions.\n\nThere is only one viable way of handling the problem - laws. Laws that push hard for sustainability. Laws that heavily tax polluting sources. Laws that lay red carpet with barriers from the sides for climate change innovation technologies, studies, research, application and social influencing. \n\nWhat we cannot: \n\nforce businesses to make changes benefiting all while cuttinf profits; \n\nForce people to care if governments and businesses do not have clear, number defined goals for improvement.\n\nForce shithole countries to pollute less. (But oh boy it will come to that when shit gers very very serious).",
            "title_similarity": "0.75067616",
            "sentiment_compound": -0.8944
        },
        {
            "id": "hpbt8e4",
            "score": 0,
            "text": "The point isnt that your personal contribution is meaningful.  Its that if people act in certain ways it will get climate issues to be top of mind for them and theyll be much more likely to consider those things when voting and making other choices.\n\nBut youre right ultimately peoples personal habits (even collectively) will not make much of a difference for the climate.  The primary contributors are corporations.",
            "title_similarity": "0.75120324",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hpamqqh",
            "score": 1589,
            "text": "1. If everyone thinks as you do, then change is not possible.\n2. Helping *a little bit* is better than no help at all.\n3. Reducing your meat consumption and walking or using public transportation when possible will neither change nor impact your life in any significant way.",
            "title_similarity": "0.67750657",
            "sentiment_compound": 0.0747
        },
        {
            "id": "hpapuwo",
            "score": 3,
            "text": "Ok. Do you also litter because other people litter?",
            "title_similarity": "0.26180586",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpanfpu",
            "score": -1,
            "text": ">\tI'm not a climate change denier, I care about the climate. But I'm not going to significantly alter my life when these companies get away with what they're doing.\n\nDo you care about your future? Do you have children and care about their future?\n\nCompanies don’t have children, so they don’t worry that much about what happens to the planet unless public perception regarding their behavior affects their bottom line.\n\nWhile true that your actions won’t have a significant impact, they have some. It’s up to you whether or not your “sacrifices” are worth it for you. Deciding in favor of inaction because companies aren’t doing their part (which isn’t true for all of them) doesn’t make much sense.",
            "title_similarity": "0.74852204",
            "sentiment_compound": 0.9588
        },
        {
            "id": "hpb0c0w",
            "score": 1,
            "text": "With the energy it just took you to write this post, you could do something extremely simple, like use reusable bags at the grocery store next time. You don’t even have to tell anyone you did it.\n\nJust because you’re not making a huge difference like the 1% can doesn’t mean you’re not making a difference. No one is asking you to be the Gandhi of climate change. \n\nIf you don’t want to make drastic changes, don’t. But you can make smaller, less drastic ones. And by doing so maybe you set the example for others to follow. If even 10 people do the small change you did, that’s already 10 times more effective than you thought it would be.",
            "title_similarity": "0.71584374",
            "sentiment_compound": 0.7813
        },
        {
            "id": "hparjg0",
            "score": -2,
            "text": "The two are not mutually exclusive, assuming that is the fallacy in your post. I too get furious when I see oil companies telling me to not shower too long, but changing our  habits AND systematic change are both neccesary. Pouting your lips and saying ”if they don’t I won’t” is nothing but unproductive bitterness.",
            "title_similarity": "0.69959986",
            "sentiment_compound": 0.0905
        },
        {
            "id": "hpauyr3",
            "score": 3,
            "text": "So here’s why: by changing your consumption habits towards lower carbon products you are sending a market signal to the companies that aren’t changing. You are sending a signal to the people around you that we should all be taking global warming seriously as the existential threat it is. It doesn’t make a huge change in how much carbon gets out in the atmosphere but it does communicate to others that this matters. Some people might see it as virtue signaling, but they are inconsequential because the game is to get as many people to start caring more and also communicating to manufacturers and politicians how much it matters to us. The people who will write you off are a smaller pool than the people who could potentially be won over, the difference is that it’s hard to know you’ve won them over but easy to know when some asshole says your virtue signaling.",
            "title_similarity": "0.7726957",
            "sentiment_compound": 0.9781
        },
        {
            "id": "hpap0ft",
            "score": 99,
            "text": ">Why should I stop using my car and pay multiple times more to use exorbitant trains\n\nA 30 day pass for Chicago's train system [costs $75](https://www.transitchicago.com/passes/). Average monthly car payment is [$563](https://www.lendingtree.com/auto/how-much-does-a-car-cost/#:~:text=In%202021%2C%20the%20average%20car,Kelley%20Blue%20Book%20and%20LendingTree.). Plus all the additional costs of car use (fuel, maintenance, insurance, parking, pithy bumper stickers, and so on) mean that driving a car is even more expensive than above. How much are the trains where you live? \n\n>Why should I stop eating meat while people like Jeff Bezos are blasting off into space\n\n\"[Social media users tweeted that Bezos’ brief trip to space released 300 metric tons of carbon dioxide. The trip released none. The rocket’s engine burns hydrogen and oxygen to carry it away from Earth.](https://www.politifact.com/factchecks/2021/jul/20/tweets/how-much-co2-did-bezos-rocket-ride-release-close-z/)\"\n\n\"[An Average American’s diet has a foodprint of around 2.5 t CO2e per person each year.  For a Meat Lover this rises to 3.3 t CO2e](https://shrinkthatfootprint.com/food-carbon-footprint-diet)\"\n\nIt looks like your personal meat eating has a larger carbon footprint that Bezos's space penis launching.",
            "title_similarity": "0.67926097",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hpb7quq",
            "score": 25,
            "text": "You know who popularized the idea of an individual's carbon footprint? The [fossil fuel industry](https://en.wikipedia.org/wiki/Carbon_footprint#Origin_of_the_concept).\n\nIn my opinion, you shouldn't change your life *in the ways you described* to fight climate change, because they're not effective. But you *should* change your life just a little bit to take steps that will be effective. That's the idea behind a volunteer group I started a month ago ([Big Climate Impact](https://bigclimateimpact.org), r/BigClimateImpact): help point American citizens at the most impactful things they can do.\n\nIn my opinion (and [that of others](https://amp.theatlantic.com/amp/article/621013/)), the most impactful thing you can do right now is ensure that policies which will shift us as rapidly as we can manage to [clean electrification everywhere](https://www.rewiringamerica.org/electrify-the-book).\n\nSo the change to make to your life at this point is a smallish one (this is focused on Americans):\n\n1. Write to your Senators/Representatives to **support the climate provisions of Build Back Better**. They can still pass a bill in budget reconciliation that will have a huge impact!\n2. **Vote in the primaries** in 2022: Big Climate Impact will have a voter guide that will make some non-obvious suggestions (depending on where you are) for primary votes, in order to get the best outcome for the climate\n3. Support the candidates that are pushing us forward on climate policy\n\nClimate change is not only a huge problem to address... it's an absolutely gigantic economic opportunity. Solar and batteries have fallen 90% in cost in recent years. Think of how big fossil fuels and the energy sector is in general, and then imagine a huge shift in the next couple of decades to whole new varieties of products.\n\nHere's the CMV: you *should* change some of what you do now, but around policy and not around the individual actions you suggested.",
            "title_similarity": "0.7723484",
            "sentiment_compound": 0.9905
        },
        {
            "id": "hpanfz8",
            "score": 0,
            "text": "If you think that, then why not join XR? If you believe that systemigc change is needed, I want you to fight for it.",
            "title_similarity": "0.4135403",
            "sentiment_compound": -0.4919
        },
        {
            "id": "hpaqbsf",
            "score": 0,
            "text": "You consume the products that give those corporations revenue, therefore you are partially responsible. Do you drive a car, eat meat, or use a smartphone? Those are all created and distributed by corporations for you to use.",
            "title_similarity": "0.60356736",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hpatktn",
            "score": 0,
            "text": "you dont have to stop anything. companies are trying to go green. but you can decide to buy from green companies and green products. win/win",
            "title_similarity": "0.47673476",
            "sentiment_compound": 0.1139
        },
        {
            "id": "hpaunvq",
            "score": 0,
            "text": "If you call your electric company and asks for “100% renewable source”, you may get a reduced electric bill. In my case, my net bill ends up much lower than advertised, because more houses in my area have solar roofs. Fight climate change while paying less with one phone call.",
            "title_similarity": "0.6547941",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hpazquo",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.051947385"
        },
        {
            "id": "hpb31et",
            "score": 0,
            "text": "Why not advocate on these issues? Vote for politicians who want a wealth tax, work with organizations trying to expand bus service, make some noise locally. The beautiful thing about zoning and transit is that they are controlled by municipal governments, and local politicians tend to be way more public than higher levels of government. You can go yell at your mayor, if you'd like. Cause you are right - taxing the rich, building better public transit, taxing cruise ships, and breaking up Amazon would all do wonders for climate change.",
            "title_similarity": "0.7457241",
            "sentiment_compound": 0.9607
        },
        {
            "id": "hpb4rvt",
            "score": 0,
            "text": "Businesses produce pollution as a by-product of making their product. If you buy their product you are responsible for some of their pollution. If you buy 0.00001% of the gasoline Exxon produces, then you own 0.00001% of their pollution.\n\nYour views are not unique to this problem, same as the people that insist that taxes should be only raised on people making more than them. We all own the problem and we can all solve it.",
            "title_similarity": "0.7200182",
            "sentiment_compound": -0.4069
        },
        {
            "id": "hpb6wgk",
            "score": 0,
            "text": "Do you vote Green?",
            "title_similarity": "0.1569353",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpb7fp5",
            "score": 0,
            "text": "The point of making personal descesions against climate change is to holf companies responsible. If you stop buying their product they will want to know how to get you back as a customer. They'll be force to change their ways. There's more useful ways of fighting climate change than sorting your recycling.",
            "title_similarity": "0.72474253",
            "sentiment_compound": 0.2716
        },
        {
            "id": "hpb9jpv",
            "score": 0,
            "text": "Your lifestyle may be what props these companies up. By refusing to be a consumer, you undermine them",
            "title_similarity": "0.54663146",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hpbbcq8",
            "score": 0,
            "text": "You are, sadly, correct.\n\nWhat environmentalists do amounts to modelling a set of pro-social behaviors that have very little, if any effect, in the current economic and political environment.",
            "title_similarity": "0.5399677",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hpbcu1c",
            "score": 0,
            "text": "Make changes to your life surrounding taking political action to *force* companies to help fight climate change. You might be right that you can recycle all you want and companies are going to keep dumping whatever they want in the ocean, but there are power centers in this world and in democracies you can push them a certain direction. So basically protect the environment with votes for laws that force everyone to protect the environment.",
            "title_similarity": "0.75763166",
            "sentiment_compound": 0.8614
        },
        {
            "id": "hpbe2w3",
            "score": 0,
            "text": "Question:\n\nDo you vote?\n\nFollow up Question:\n\nDo you not litter?\n\n\nIf you answered yes to either of these, I'm curious as to why you participate in these collective action problems where your individual actions have statistically no impact on the outcome of the problem-- fighting climate change is no different.",
            "title_similarity": "0.6553186",
            "sentiment_compound": -0.7691
        },
        {
            "id": "hpbemad",
            "score": 0,
            "text": "Agree on all but the \"I can't do anything about it\". Typical individual actions (like what you mention - reduce, reuse, recycle) are peanuts compared to industry - so make a personal choice to force industry to change! Check out some of the most effective charities per dollar like the Founder's Pledge Climate Change Fund, named the most effective charity per dollar by [Giving What We Can](https://www.givingwhatwecan.org/best-charities-to-donate-to-2021/) - $10 saves about 1 tonn of CO2 through innovation and government policy. Your individual actions can make a global difference, especially when you add the fourth and fifth \"R\"s: reduce, reuse, recycle, rethink, and regulate.",
            "title_similarity": "0.71549153",
            "sentiment_compound": 0.9873
        },
        {
            "id": "hpbf912",
            "score": 0,
            "text": "Multimillion dollar corporations work for you (dig out your oil and process your fuel, process your plastic wrapping, and farm your food).  \n\n  \n\nCorporations exist for you, by you. Corporations sell plastic because you buy plastic. They sell cars because you buy cars. It is your fault the world is ending as it is almost everyone else's. Take responsibility for your actions. Every 'bad' or exploitative company in the world would instantly vaporise if every human reduced their carbon footprint and consumption of unethical products to 0. You are the company's motive.",
            "title_similarity": "0.78418607",
            "sentiment_compound": -0.8591
        },
        {
            "id": "hpbfzd8",
            "score": 0,
            "text": "If oil companies cannot operate without drastically reducing their carbon footprint then they need to be forced to shut down in order to make any timely impact on the fight for climate change. How can a company like this be forced to shut down? The US government probably won't do anything about it. What option is left is for the people to make a personal changes to strike/boycott against these companies and stop using personal/work transportation that enable oil companies.",
            "title_similarity": "0.8151685",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hpbg46p",
            "score": 0,
            "text": "From an ethics and morality point of view do you believe taking personal action to fight climate change is an important thing to do given your personal set of values? Because if fighting climate change is something you value why would you compromise it regardless of what some company does? And if it isn't something you value what compulsion do you have to change your lifestyle if the corporations suddenly did as well?",
            "title_similarity": "0.6792083",
            "sentiment_compound": 0.3408
        },
        {
            "id": "hpbg95a",
            "score": 0,
            "text": "If a multibillion dollar company jumped off a bridge would you too?",
            "title_similarity": "0.459621",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpbgxwe",
            "score": 0,
            "text": "Start using products and services from companies that care about it. Read the Bill Gates book.",
            "title_similarity": "0.38102856",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hpbi3gq",
            "score": 0,
            "text": "Bro turn on the tap slightly so it drops, ok, now put a bucket under it and let it drip over night. What you'd see is a full bucket, which was filled by drops, one drop at a time.\n\nI rest my case",
            "title_similarity": "0.41586256",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hpbitzf",
            "score": 0,
            "text": "Where I live it’s actually cheaper for me to use the train than it is to drive. I live 10-15 miles away from my job which is in a major city. I do take a bit more time out of my day to use the train because it’s on a schedule compared to going to and from work exactly when I needed to. This is a small price to pay because I am usually reading the whole time or listening to a podcast.\n\nMy monthly travel budget right now is $200, but I’m always well under it because my monthly train pass doesn’t cost nearly that much. The rest I keep in case I need to Uber or for gas money when I’m car pooling. \n\nMy total monthly expenses for driving to work blew the other number out of the water. Parking was $265 a month. I used a whole tank of gas in two weeks of driving and usually spent around $80 a month on fuel. Then there’s general wear and tear, oil change, and general car expenses that averaged $55 a month. This came to a grand total of $400 a month. I literally cut that spending in more than half by getting rid of all my car expenses. \n\nPublic transportation doesn’t have to be shitty. Europe and Asia are full of examples of awesome train networks that aren’t sophisticated, are actually policed so they don’t smell like piss half the time, and they run on time. In some Scandinavian cities they guarantee that bike paths won’t have more than 4 centimeters of snow through the winter. In the US you’re lucky if a bike lane is protected or not snowed in during winter.\n\nAs an individual it’s not your responsibility to never own a car, but purchase something that meets your needs. It is your responsibility to be an informed citizen and to vote.",
            "title_similarity": "0.6986412",
            "sentiment_compound": 0.9668
        },
        {
            "id": "hpbjlr2",
            "score": 0,
            "text": "You're somewhat right, although enough people making personal changes in the aggregate can make at least a small difference. There are billions of people; if even one percent voluntarily curb their emissions that's still ten million fewer cars on the road and who knows how many fewer cows farting up a storm. Still, I'm mostly with you: I care very strongly about climate change, but I try to make low-emissions choices while still living my life the way I want to. I drive an SUV because it fits my lifestyle, but not the biggest gas-guzzler I can find. I eat meat, but I mostly hunt my own. I can't stand public transit so I avoid it whenever possible, although I want other people to use it as much as they can.\n\nHowever, what you MUST do, and the only thing that will really make a large difference, is support political leaders who will powerfully regulate large polluters and, most importantly, aggressively invest in the technology that will eventually make clean energy and sustainable food cheaper and better than fossil fuels and beef are today. \n\nThat technological day is coming, and it will be the real turning point in the fight against climate change. Digging up a bunch of deeply buried rocks and sludge, transporting them long distances, and setting them on fire is not the most theoretically efficient way to power anything; it's just the easiest way to figure out. Renewables have clear potential to be far superior. Advances in battery technology will make electric cars far superior, out-ranging and out-performing any gas vehicle. SpaceX's Starship rocket will likely eventually be powered by carbon harvested from the atmosphere using clean electricity. Growing only meat in a lab requires far less source material than growing an entire cow, and we will eventually figure out how to grow something similar or identical to wagyu beef on a cellular level without wasting resources growing the rest of the cow. That will be cheaper. \n\nSome of these advances are farther away than others, but they're all on the horizon, and we need to rush to make these technologies better AND cheaper than their dirty alternatives, so that the developing world embraces them for the only reasons they'll embrace anything: cost and convenience. So you have to keep voting for people who will do everything in their power to speed up this one revolution that will really make a massive difference. This can be disappointing when we vote for people who want to make a difference and they can't pass legislation because of Joe fucking Manchin and a bunch of worthless Republicans. But we have to keep at it until we win enough power to get things done.",
            "title_similarity": "0.8318947",
            "sentiment_compound": 0.9866
        },
        {
            "id": "hpc82ll",
            "score": 0,
            "text": "It’s not about the private life of rich people, the problem lies in companies. They are the biggest CO2 producers",
            "title_similarity": "0.65251267",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hpd5zll",
            "score": 0,
            "text": "No matter how much money we have - we all have equal responsibility.\n\nIf we don’t do our bit, we are no better.",
            "title_similarity": "0.38863504",
            "sentiment_compound": -0.357
        },
        {
            "id": "hpda6ec",
            "score": 0,
            "text": "They donate more than you.",
            "title_similarity": "0.11809786",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpdqhsc",
            "score": 0,
            "text": "Na you're right",
            "title_similarity": "-0.24557959",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpdw2f9",
            "score": 0,
            "text": "It’s all very hyped anyway.",
            "title_similarity": "0.014804229",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpe7w9i",
            "score": 0,
            "text": "You shouldn't stop eating meat. Eating meat is beneficial for the planet because the cow's fecal matter deposits more carbon than is belched out. Also the methane that comes out is part of a natural carbon cycle that has been around for waaayy longer then we have. If there is anything wrong with eating meat it is the monocropping used to grow their feed. The monocropping used to grow their feed is terrible for the planet. The biodiversity of the area is wiped clean and when the plants die in the fall they oxidize and release carbon into the atmosphere. Cows can live off of the leftovers and inedible by humans parts of plants with their better stomachs. While a chicken or pig's stomach is designed a big more like ours so they need to eat more of the \"fruit\" part of the plant if that makes sense. Hence why eating beef could be better for the planet than eating pork or chicken (cows are almost always pastured before switching to eating feed to fatten them up for better marbling and that usual taste (pastured=free-range for those wondering))  Eating free ranged versions of all of them are better for the planet then anything, but there are rules set in place that allow companies to put free range on their packaging if their animal eats less than a certain percentage of animal feed or has a bit more room than their cage raised counterparts. It could be a lot worse than truly desired. Buying local is usually always the go if you really do care.",
            "title_similarity": "0.7491051",
            "sentiment_compound": 0.9734
        },
        {
            "id": "hpe9osy",
            "score": 0,
            "text": "Nothing to change, you are right. Individual change, even across society, is meaningless when those producing all available product and resources don't.",
            "title_similarity": "0.4542633",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hpaubms",
            "score": 9,
            "text": "Who do these multi billion dollar companies sell to? You.\nIf you stop buying from companies who emit carbon, they’ll cease to exist. Do you think cruise ships would exist if no one went on them. \n\nAlso, are trains more than expensive than a car ride? That doesn’t make much sense.",
            "title_similarity": "0.82515526",
            "sentiment_compound": -0.5803
        },
        {
            "id": "hpb5u1t",
            "score": 16,
            "text": "The logic of your question is: *\"Why should I do the right thing when someone else doesn't?\"*\n\nThe answer to that question is always the same: *\"Because it's the right thing to do.\"*\n\nStop comparing the value of your actions to others; Do what feels right to you for its own merits.",
            "title_similarity": "0.42517585",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpb43jw",
            "score": 28,
            "text": "I have a lot to say about the psychological dynamics of this, but let me start here: \n\nHere in the US, what we call \"regular people\" are actually among the very wealthiest and greatest emitters of greenhouse gases in the world. A family of four, say, with a firefighter and a teacher as parents, will be earning roughly $100,000 a year. That's roughly 33x the median household income in India, and 15x the median household income in China. \n\nEven though it's not Bezos kind of money, by global standards that family is fabulously wealthy. So why is it unreasonable to ask that that family make some modest lifestyle changes to reduce their carbon footprint? \n\nSetting all that aside, if you told your kid to clean up his room and he said he shouldn't have to because his classmate Jeff has a housekeeper and he never has to clean up his room, you wouldn't accept that, would you? Your logic isn't really all that different. You can't control what other people do; you can only control your own behavior. If you legitimately are concerned about climate change, why not make changes to your lifestyle in order to make it better? Why not serve as an example to others of how to behave?",
            "title_similarity": "0.63251865",
            "sentiment_compound": 0.9677
        },
        {
            "id": "hpaumzu",
            "score": 1,
            "text": "If you don't live in China or India you really don't matter.",
            "title_similarity": "0.3393975",
            "sentiment_compound": -0.0906
        },
        {
            "id": "hpaxoiq",
            "score": -1,
            "text": "Think globally, act locally.",
            "title_similarity": "0.009853801",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpb2ayd",
            "score": 1,
            "text": "Let's send all the world leaders on private jets all around the world, and air condition their huge conference venues!",
            "title_similarity": "0.4535588",
            "sentiment_compound": 0.3802
        },
        {
            "id": "hpb3x0m",
            "score": 1,
            "text": "Because it's the right thing to do?\n\nEDIT: \"There's a lot of drunk drivers on the road so why shouldn't I drive drunk?\"",
            "title_similarity": "0.59878635",
            "sentiment_compound": -0.1838
        },
        {
            "id": "hpb4god",
            "score": -1,
            "text": "If you earn over roughly $36,000 a year then you are part of the global top 1%. If you live in the West you are likely in the top 10%. Don't count yourself out of responsibility too quickly!",
            "title_similarity": "0.5014067",
            "sentiment_compound": 0.4389
        },
        {
            "id": "hpb6rmp",
            "score": 1,
            "text": "You should stop eating meat because animals deserve the moral right to live a life free from exploitation and farming them brutally violates that",
            "title_similarity": "0.6333866",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hpb9mnw",
            "score": 1,
            "text": "Based post.",
            "title_similarity": "-0.19275045",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpb9u0x",
            "score": 1,
            "text": "I don't get what a champagne socialist is, but as someone who never drinks/socializes in a pretentious manner while having a trust fund (I'm broke lol) \n\nI think no one is imposing upon you to change yourself, but to consider what power you DO have and are capable of using to benefit the world/others, as small as it is. There are tons of people who have decided to give up meat or trade their cars in for public transport because they want to live congruently with their ideals and plans on being part of a small difference. \n\nThat being said it feels equally... Champagney, to wax about not being a billionaire and say, being one of those people who discourage actual people who are doing their best to accommodate changes. \nIf more people were on board with changes such as, idk, public transportation, over time the demonstrated need and reliance on such a huge piece of infrastructure would net it more funding. And who wouldn't want a future where more people without cars are finally able to get and keep steady employment with more predictable and conveniant systems?\n\nOr veganism- we're getting that beyond meat stuff now, and it can be affordable. I remember how during the pandemic, when people were cleaning out grocery stores of goods, some vegans were practically thriving since no one wanted to eat their morningstar frozen stuff. If they're good about actual nutrition, they're probably doing their body a favor, on top of staying close to their personal ethics/ideals. \n\nI think if you want to awknowledge this knowledge/understanding that your potential to make a difference doesn't mean that much in the large scheme of things considering Jeff Bezos or Tesla, or the shitty way our government prioritizes where funding goes and how to actually execute projects, then you either need to step up and at least remind others of this, make use of what little impact you're capable of and make sure you vote in support of green policies, and keep supporting/uplifting those who want to try to use their impact, because even a single human being can leave a massive carbon footprint in their lifetime.",
            "title_similarity": "0.79816794",
            "sentiment_compound": 0.9814
        },
        {
            "id": "hpba7jg",
            "score": 1,
            "text": "Billion dollar companies don't make changes because their billions of customers don't care.\n\nIt takes the customers caring for them to care.\n\nThat's why the people who care want other people to care -- the companies won't change their ways until the customers start voting with their dollars...or the governments start regulating them into environmentally friendly compliance.  In most countries, this also requires people to care and take action (e.g. voting).",
            "title_similarity": "0.7855319",
            "sentiment_compound": 0.9507
        },
        {
            "id": "hpbb6f9",
            "score": -1,
            "text": "This is the attitude of a child. \"They don't have to so why shouldn't I\"' - is a placeholder for laziness and apathy. You gotta fight because if you don't - when climate change happens and the govt breaks down under the crisis guess who is gonna be returned to King and queen status? Those rich folk. So fight your little heart out for our crappy lively hood because if you don't now..... Your kids and your kids kids will be forced to live in Elon Musk's United States of Musk, with no way to defend themselves against the Musk army (remember he's one of the only ones with money left to pay for an army as the govt folded under the crisis). A frightening but very real future.",
            "title_similarity": "0.7425286",
            "sentiment_compound": -0.7931
        },
        {
            "id": "hpbfvn6",
            "score": 1,
            "text": "Most of these actions by corporations are because humans demand products and services by the corporations.\n\nOil companies are making the oil that the average person uses. Stop using oil-based products as much and you reduce how much of it they produce. Same goes for plastics, CO2 impacting things, etc. Who do you think is sitting on the cruise ships that pollute so frequently? Mostly average people (maybe on the richer side of things).\n\nRich people doing wasteful things are debatable. There are usually \"early adopters\" that test run things with excessive amounts of money to spend, in the hopes to reduce the cost of performing the task. For example, gasoline engines were far more expensive and wasteful than coal powered steam engines at the time. Nowadays, gas is much more efficient in comparison.\n\nThe best things you can do are:\n\n* Reduce how you consume. You reduce the demand, you starve the market.\n* Vote for politicians who share your values, when possible\n* Embrace newer technologies such as electric vehicles and lab grown meat (or going \"more\" vegetarian\")\n* Contribute to the social pressure for corporations to do better. Follow their reports and news surrounding their impact. Boycott products when you are able to.\n\nChange won't happen overnight. It will be decades long, but the general shift eventually picks up momentum.",
            "title_similarity": "0.76272464",
            "sentiment_compound": 0.7681
        },
        {
            "id": "hpbh48d",
            "score": 1,
            "text": "Climate change is a collective problem that involves acknowledging diffusion of responsibility to solve. You don't care about changing while the billionaire doesn't change and the the billionaire doesn't care about changing when you won't. \n\nThat seems to be why almost nobody is actually doing anything about it. \n\nThe only recourse is for you to change and hope it sets an example for them to change in turn. This is also true of the international community of nations. Or don't and we all just deal with the consequences.",
            "title_similarity": "0.74159557",
            "sentiment_compound": -0.1169
        },
        {
            "id": "hpbr8pt",
            "score": -1,
            "text": "Just do your part by not having kids. The landfills are filling of millions of used diapers every year. Maybe not adding to the world's problems and making more consumers and taxpayers.\n Like how many schools still use plastic silverware to make it easier or Styrofoam plates. Like start teaching kids while they're young so they dont grow up with a mentality of \"oh well, I can't really do anything myself as one singular person, so why bother.\" Like teaching kids that this is a disposable planet is one of the worst subconscious things we can be teaching. \nNot really a changing view comment bc I felt like o.p. when I was growing up. I just view not having kids as me helping the environment in the outrun, but that's just my personal belief.",
            "title_similarity": "0.7440896",
            "sentiment_compound": 0.5094
        },
        {
            "id": "hpbwbuw",
            "score": 1,
            "text": "Okay, here's some food for thought. Not long ago, the head of the U.N. food agency tweeted at Elon Musk saying \"1/6 of your one-day increase would save 42 million lives that are knocking on famine's door.\"\n\nElon tweeted back saying \"If WFP can describe on this Twitter thread exactly how $6B will solve world hunger, I will sell Tesla stock right now and do it.\"\n\nThe U.N. guy clarified that he was only talking about \"people on the brink of starvation\". But more importantly, he didn't show any information about how this money would solve even that problem.\n\nThe point Elon was trying to make is that people always have this idea of curing these massive world problems with money, but when you ask them exactly how they plan to use the money to solve the problem, the problems start to come out of the woodwork.\n\nMaybe they have an idea, but there's massive costs with overhead, administration, corruption, and even then it's not a guarantee that the money would solve the problem the way they hope. The truth is, throwing money at these major global problems is not going to do much. These problems are extremely complicated and multi-faceted. Elon knows this.\n\nI'd like you to read this [very illuminating article from NPR](https://www.npr.org/sections/goatsandsoda/2021/11/11/1052719247/how-6-billion-from-elon-musk-could-feed-millions-on-the-brink-of-famine) about this twitter exchange. In my opinion, it shows how money alone simply doesn't solve the problem.\n\nEven if Elon sold all his shares and flooded the most famine-stricken areas in the world with tens of billions of dollars, that wouldn't be a permanent solution, would it?\n\nTake this excerpt from the article:\n\n>Its 60-year experience in delivering aid helps the agency reach some of the world's hardest-to-reach places. In a May study, Wiggins and Simon Levine, also of the Overseas Development Institute, looked at what was done to help people in the biggest, most-drawn-out conflicts over the last three decades — from the conflict in northern Uganda, which ended in 2006, to the current conflict in Afghanistan.  \n>  \n>**They concluded that WFP made a difference in these situations – but only up to a point**. \"The scary thing is that so little was done,\" says Levine — but when there was emergency relief, it came in the form of food aid, mostly from WFP.  \n>  \n>This assistance, wrote the authors in the paper, \"**probably protected recipients from unacceptable hardship.**\"\n\n60 years of throwing 115 million dollars in these places and the most they can say is \"we *probably* helped\".\n\nI don't think throwing money at climate change solves the problem, either.\n\nBut you're right, cruise ships pollute, private jets pollute.\n\nBut as Ghandi said, \"Be the change you wish to see in the world\". Are you wiling to stop driving? Are you willing to stop eating meat? Neither are the rich. We are all at fault. No one raindrop feels responsible for the flood.",
            "title_similarity": "0.75273335",
            "sentiment_compound": -0.9857
        },
        {
            "id": "hpap4qp",
            "score": 42,
            "text": "The big companies only react to demand. If everyone does their part, companies will react as well. Nothing is isolated, it’s all connected. I saw a doc on this exact point and it explained how it’s actually important we do our part.",
            "title_similarity": "0.5065022",
            "sentiment_compound": 0.5207
        },
        {
            "id": "hpao0jn",
            "score": 799,
            "text": ">Why should I stop flying when cruise ships are out and about pumping more CO2 into the atmosphere than thousands of cars combined?  \n\nIf people stopped going on cruises, do you think they would still send cruise ships out?  \n\n&#x200B;\n\n>Why should I stop eating meat while people like Jeff Bezos are blasting off into space?\n\nIf everyone cut out 50% of meat from their diets, what do you think that will do to total emissions from factory farms?  \n\n&#x200B;\n\nNo one single person can make a difference, but the idea is if everyone together makes changes in their own personal life, the effect is greater than the individual contribution. Its not like these giant companies would continue to pollute for the fun of it.",
            "title_similarity": "0.89049065",
            "sentiment_compound": -0.5307
        },
        {
            "id": "hpanpbe",
            "score": 254,
            "text": "Why shouldn’t I toss my litter on the ground when companies release massive pollution?  Why should I bother donating a few bucks to charity when millions are starving?  Why should I wear a mask to protect the couple dozen people around me when millions don’t?  Why should I smile to my cashier when most people don’t even make eye contact?  \n\nBecause it’s the right thing to do, and the cumulative effect of lots of people doing the same isn’t negligible.  I bought an electric car not only for that reason, but because every dime I don’t spend on gas is one less dime of profit to the oil companies.  I also recycle, urge other people to take these things seriously, and vote.  I and the other people like me do make a difference.",
            "title_similarity": "0.83853704",
            "sentiment_compound": 0.8467
        },
        {
            "id": "hpb48rk",
            "score": 61,
            "text": ">Why should I stop using my car and pay multiple times more to use exorbitant trains?\n\nActually, public transport is cheaper than owning a car.\n\n>Why should I stop eating meat while people like Jeff Bezos are blasting off into space?  \n>  \n>Why should I stop flying when cruise ships are out and about pumping more CO2 into the atmosphere than thousands of cars combined?\n\nAt this point, personal lifestyle changes are not made to save the world singlehandedly. They are made to **normalize** eco-friendly behaviour. This is an important concept. If enough people make the choice for less carbon-heavy behaviours, it will become easier for society as a whole to sustain a low-carbon culture.\n\n>I'm not a climate change denier, I care about the climate. But I'm not going to significantly alter my life when these companies get away with what they're doing.\n\nIt's just as bad to be an \"action-denier\" as a climate-change denier. Because both kinds of people end up doing the same thing - deterring society from moving in the right direction. Your consumer choices are supposed to influence the companies' choices. Supply and demand has to be at play here.\n\n>I think the whole backlash against climate change is most often not out of outright denial, but rather working class people are sick of being lectured by champagne socialists\n\nWhy does anyone have to make their lifestyle choices about what someone else is doing as opposed to simply **what's right**? Why is everyone always trying to look at everyone else  rather than making independent, rational choices? (Trick question - this is exactly the reason why we need to **normalize** eco-friendly behaviors - because the rest of society are lazy copycats.)\n\nI highly recommend reading the following blog post that is both entertaining and articulates the flaws behind your reasoning: [https://hahatheworldisending.wordpress.com/2021/10/29/on-exposure-therapy/](https://hahatheworldisending.wordpress.com/2021/10/29/on-exposure-therapy/)",
            "title_similarity": "0.9381468",
            "sentiment_compound": -0.7568
        },
        {
            "id": "hpatqtm",
            "score": -2,
            "text": "Do it for your own soul and to mitigate the underlying guilt of living in a consumer economy built of the exploitation of foreign ecosystems and labor. \n\nBut don’t delude yourself into thinking it will matter.",
            "title_similarity": "0.62432843",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hpatvdh",
            "score": 2,
            "text": "It's all performative nonsense. It's impossible for consumers to radically change the way they live.\n\nThe only feasible way to reduce carbon emissions is using nuclear power, and nobody wants to have that conversation.",
            "title_similarity": "0.70928913",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hpayg4y",
            "score": 2,
            "text": "It helps me sleep at night knowing I didn’t give up and that my family and I did what we could. You can’t hold the high ground and condemn others when you aren’t actually doing anything yourself.",
            "title_similarity": "0.4459567",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpb5e8l",
            "score": -2,
            "text": "This is ridiculous. Why not steal when some people steal and get away with it? OP wants an excuse.",
            "title_similarity": "0.42818826",
            "sentiment_compound": -0.416
        },
        {
            "id": "hpb6gk5",
            "score": 2,
            "text": "\"Your carbon footprint\" is a bs line trying to deflect responsibility off corporations that spew billions of tons of waste into the environment.",
            "title_similarity": "0.7203774",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hpaviks",
            "score": 40,
            "text": "I have seen your deltas on this, so I won’t address that companies are doing what they do to serve customers, but there is another reason:\n\nMy wife had a friend over for dinner and she brought her husband, and we didn’t get along well. He was hard on me for driving a Ford Mustang, and when I asked, he drove a Honda Accord that got like 3mpg better fuel economy.\n\nI asked why he didn’t drive an electric car, and he said because they cost too much, and better tech was coming soon.\n\nI asked if he had solar panels on his roof, and then why not, and he gave the same excuse. They cost too much and better tech is on the way. I showed him a company in Texas that will put the solar panels on your roof at no cost. You don’t get to sell excess power, but you get a discount on power  usage and you are helping to build a green grid. \n\nHe said he didn’t trust them, and didn’t want the holes in his roof.\n\n\nNow I am not a climate change denier either, but that seemed to be a really pathetic take on it. He advocated for mandating EV usage instead of gasoline powered cars, yet didn’t drive one. And he wouldn’t consider a no cost way to help produce power. He wants everyone else to feel the pain of change first, or at least at the same time, and to be blunt, his behavior is more likely to drive people away from his views instead of towards them.\n\nI have another friend who drives an EV. When our families drove to Florida for a vacation (from Texas) he rented a Tesla, demonstrating a long trip is possible in them with some charging stops. When we were in Pensacola he let us drive the Tesla and drove us around in it, it was cool. That is how people are convinced, by seeing the positives.\n\n* Who cares if Jeff Bezos goes to space? It is largely symbolic, but they are trying to work towards Mars, and to get there we are going to fire a lot of rockets into space. And space might have some solutions for problems we have today, if and when we are able to harvest materials from space and bring them back to Earth. Space travel is worth it.\n\nIf you are thinking of not eating meat, then don’t eat meat. You do your part, and people are more likely to listen to you on the subject. And you might show people that you can live just fine on a plant based diet.\n\nWhy should you stop flying because of cruise ships? Same reason. When famous people pushing for a carbon neutral life fly in private keys to climate conferences, many of us get a little irritated at them. If you think people shouldn’t get on a cruise ship, don’t get on one. If you think flying is a bad thing, don’t, there are options. But if your friends know you are flying, it will have a similar impact on their opinion of your beliefs on climate change.\n\nYour last paragraph backs this up, but it applies to job as well. The old saying “don’t throw rocks if you live in a glass house” applies, don’t lecture other people to live a life you won’t yourself. Not that you are lecturing, but if you think we need to change how we handle the environment, the best thing you can do is start by changing yourself and your own habits.",
            "title_similarity": "0.8163527",
            "sentiment_compound": 0.9873
        },
        {
            "id": "hpaxq37",
            "score": 12,
            "text": "No one has addressed the political side of your opinion. Either we like it or not, laws on companies ( as you said ) would tremendously reduce pollution and help the climate we as humans are designed to live in.  \nHow do laws get elected / in use?  \n  When there is a need about the said law..  \nHow do we know there is a need for a new law?  \n  There is a high demand by the citizens..  \nVote with your money,  buy less things that are not eco friendly, support more eco friendly politicians, and get your message out there by being an example.  \nMore people will follow, day in day out..the need for laws will develop and the laws will follow..naturally and organically through society.",
            "title_similarity": "0.7809171",
            "sentiment_compound": 0.3511
        },
        {
            "id": "hpaqa3x",
            "score": 52,
            "text": "This is spite, however, it is misapplied.  The logic should not be that the solution is not equitable therefore I won't participate in the solution.  It should be that it is not equitable therefore I will compel those companies to participate in the solution.\n\nAnother way to think about it are the communities that had nothing to do with the over consumption.  Climate change is an existential threat to them today.  You should consider answering to them, not the logic that satisfies your senses of spite.    \n\nYou think they forgive you and I for our over consumption of goods that harms them directly?",
            "title_similarity": "0.75385106",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hpazgds",
            "score": 4,
            "text": "it's not an all-or-none decision.  You can join the army of people who mitigate some small fraction of the global warming causes...\n\nBut how about applying pressure on your politicians to do something or get voted out?  That's not nothing.",
            "title_similarity": "0.74762785",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hpaui1s",
            "score": 6,
            "text": "On the flipside why the would multi-billion dollar companies make changes to their practices when their customers are happy to give them multi-billions dollars to continue as they are.\n\nTake eating meat for example. Why would farmers stop factory farming when you're more than happy to pay them to continue. From their perspective so long as you are unwilling to make any change they continue to profit. This directly incentivises them to not care. You directly incentivise them not to care. If you see billionaires jetting around in wasteful planes and your response is 'oh they don't care, let me continue to give them money' then jetting around in wasteful planes is a unilaterally good thing for billionaires to do in their mind.\n\nI dunno, it just seems hopelessly naive for someone unwilling to give up some steaky bois to expect multi-billion dollar company to just randomly give up multiple billion dollars.",
            "title_similarity": "0.84945536",
            "sentiment_compound": -0.0787
        },
        {
            "id": "hpavrt9",
            "score": 8,
            "text": "I think a big misconception is that making changes in your life to fight climate change will be inconvenient or make your life worse in some way. \n\nYou're right that corporations are doing most of the damage but I still believe in individual responsibility. I don't judge anyone that needs to drive a car or that eats meat but there is still a lot you can do. And a lot of what you can do will actually make your life better. \n\nShop less, buy secondhand, avoid fast fashion, replace some of your single use plastics with reusable. Do you like saving money? Because that's how you save money. Bring your own bags to the grocery store, leave some clean tupperware in your car so if you go out to eat you don't have to take home a plastic or styrofoam to go container. Little, simple things that don't cost you anything but do make a difference. \n\nI also encourage people to recycle clothing, you can take textiles to h&m or North Face stores to be recycled. Don't shop at h&m though, fuck fast fashion. Recycle your electronics, recycle everything that can be recycled.",
            "title_similarity": "0.82445085",
            "sentiment_compound": 0.8
        },
        {
            "id": "hpb1wvs",
            "score": 11,
            "text": "What you’re saying may have made sense 5-10 years ago, but 2019 data from the EPA suggests otherwise.\n\nTransportation now makes up the largest sector of CO2 emissions in the United States, at 29%. And of that total, 58% of these emissions are from “Light-Duty Vehicles” (i.e. the regular cars and trucks people drive every day).\n\nBy comparison ships and boats only make up 2% of that transportation total, and aircraft only 10%.\n\n[link to source](https://www.epa.gov/greenvehicles/fast-facts-transportation-greenhouse-gas-emissions)",
            "title_similarity": "0.63693035",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hpanth9",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.020167127"
        },
        {
            "id": "hpav6tw",
            "score": 1,
            "text": "It’s hard when the East gives zero fucks. But we do what we can bc in the end, it’s only you and that mirror. Keep going.",
            "title_similarity": "0.3555562",
            "sentiment_compound": -0.3071
        },
        {
            "id": "hpb3am3",
            "score": 1,
            "text": "Those companies emit CO2 as a side effect of providing some products/services to you. \n\nStop using unnecessary products and services and  these companies will reduce production and carbon footprint.\n\nYou can't blame companies like this while totally ignoring the fact that those companies are producing for YOU, not for themselves.\n\nYOU are responsible whether you like it or not.",
            "title_similarity": "0.7342667",
            "sentiment_compound": -0.1197
        },
        {
            "id": "hpb4fx2",
            "score": 1,
            "text": "And the fact that one person can't do anything",
            "title_similarity": "0.045246333",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpb4xub",
            "score": 1,
            "text": "It’s rules for thee not for me.\n\nAll significant forms of pollution are from corporations and the elite class of society. \nCorporations control what is available to the public. Elite decide what corporations are allowed to do. \nPublic use what’s available to them.",
            "title_similarity": "0.60184836",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hpb596z",
            "score": 1,
            "text": "Because this directly affects you and your future. The best lever you have to pull to create change is your behaviour and how that can then be one of hopefully millions of small nudges to push those larger organisations in the right direction. You can not do anything if you wish but it will, if only a little, harm you in the long run",
            "title_similarity": "0.66197777",
            "sentiment_compound": 0.138
        },
        {
            "id": "hpb5i50",
            "score": 5,
            "text": "You and everyone else that isn't Jeff Bezos and Elon Musk, votes with their money. Airline companies and cruise ship lines and the meat industry and car companies can't function if you don't give them money. If you and the rest of the world stop giving them money because you want more ecofriendly mass transit and less environmentally destructive and consumptive meat options and more electric cars, they have to either accommodate or die. \n\nYou are 1000% correct that large companies are almost entirely to blame for the destruction of most of our ecosystems and the climate as a whole. You are also correct that they are the ones that need to change if we want to avoid absolute catastrophe. However, the companies won't have any incentive to change unless the consumer tells them they have to by refusing to give them anymore money. \n\nDoes your individual impact as a consumer make or break this kind of dynamic? No. But a billion people's individual impact does.",
            "title_similarity": "0.8517561",
            "sentiment_compound": -0.889
        },
        {
            "id": "hpb5zgu",
            "score": 1,
            "text": "This was actually the motive behind the whole “green” marketing campaign that started around the turn of the century.  It was mostly to cause people to feel guilty about how their choices impact the environment instead of focusing on the big companies that are making the biggest impact.\n\nHowever, change will never happen if consumers keep their everyday lives unchanged.  Also, buying “eco friendly” products just makes it worse because companies can charge more for usually an identical product to their standard.  The best way to make a difference is to do a little research as to what products are actually better for the environment instead of taking the companies word for it.  Also, letters to your local representatives actually do work, especially if you get a handful of your friends to do it to.",
            "title_similarity": "0.77340376",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hpb6ibm",
            "score": 1,
            "text": "This is not only about you making sacrifices but more like becoming aware of your habits and lifestyle. By making these changes, hard at first, you will feel pretty happy about \"doing your part\" and you will always find a way to do something. Start with something easy, then keep on going. You will be proud of making this change in your life and will feel like you are doing your part and growing like a person.\nIt's not about changing everything all at once, it's about improving your lifestyle bits by bits, to reduce your carbonprint.\nIn doing so you will also make your children (if you want some) used to living with these habits, and therefore making impacts for the next generations & make it easier for them to keep on going.\n\nIf you and many people around the globe do the same, \"reducing meat-based food\" for example will have a significant impact.\n\nI also think that Big corporations want money more than polluting for fun. If they see that the general habits and ways of consuming are ecologically centered, they will align their policy, marketing, communication and products on it so that consumers like you and me can identify to these companies, and buy their products / services.\n\nAnd when you look at what's already being done, you see that some things are already changing. It's a long fight, not an easy one, but it's working and it could work even more if you are joining",
            "title_similarity": "0.44579038",
            "sentiment_compound": 0.9918
        },
        {
            "id": "hpb7pgj",
            "score": 2,
            "text": "I'll take these premises:\n\n* Individual decision/action can have a significant impact on climate change, especially when taken collectively (this point well argued by others here already)\n\n* The overall impact elites *could* is larger than the above\n\n* You care about the climate\n\nWhat I see you expressing in this post is a feeling of injustice; that people who could exact more change due to their position and power are not doing so, so having to put in effort yourself would be wrong. I won't discuss the validity of such feelings, but it seems to me they're the root of your reaction here. But let's put them aside for a second.\n\nWith respect to the goal of improving climate trends, what are the consequences of you making changes to address them to the extent you can? If we agree on our first premise, you can indeed exact positive change. Now, are there any harmful consequences of taking personal action toward this goal? I would argue that the only potential negative consequences (with respect to the climate goal alone) are that your actions may somehow result in *more* inaction (or harmful action) from elites. This is the conclusion those feelings of injustice manifest. But, I think it's easily overturned:\n\n* Elites with power in this context are largely driven by financial or political power\n\n* Financial power is ultimately derived from consumers, and consumers have a degree of choice as to where their money goes: collective choice toward options that put more action toward resolving climate change is possible and would result in some degree of shift in financial power toward those groups\n\n* Political power is ultimately derived from the people (in democratic/near-democratic contexts, at least, although even outside of those collective action can overturn political power). Same as the above, if preference is given toward groups enacticing change, those groups get more power to do so.\n\nGiven the above, I argue that taking action to improve climate trends is more likely to yield *more* change in the same direction from elites rather than less. So, with respect to the goal of improving climate trends, there's no reason not to take personal action.\n\nI think you're absolutely right that a lot of people end up in inaction due to these feelings of injustice. While for you these feelings are leading to inaction (bad for the goal), they can also be leveraged to motivate action like those I described above (that shift power toward those taking better action toward the climate) which actually begin to resolve the injustice. Inaction solves nothing, and the feelings of injustice there can lead to you feeling righteous in your inaction - but when that inaction does nothing to help, that feeling of righteousness only serves to comfort you in making a decision that does not, in fact, serve your goal.",
            "title_similarity": "0.72420394",
            "sentiment_compound": -0.3583
        },
        {
            "id": "hpbas59",
            "score": 1,
            "text": "From some perspectives, you are correct. Individuals can't make anywhere close to the impact that corporations can make. In fact, in many cases, entire industries conspire to offload the responsibility to end-users when they realized that's both easier and cheaper. Look at [plastic recycling and how it was invented by the Big Oil](https://www.npr.org/2020/09/11/897692090/how-big-oil-misled-the-public-into-believing-plastic-would-be-recycled) to absolve Big Oil of polluting the planet by deflecting to \"If *you* don't recycle, it's *your* fault the planet's polluted!\" when they knew full well that recycling is not in any way economically or even in many cases practically feasible.\n\nHowever, the power of the individual lies in their ability to band together and create political strength that is greater than the sum of its parts. Your responsibility then, is to ensure you support politicians and leaders who push the agenda of reducing waste, and reducing pollution, while balancing wellbeing. And if during this time of change (which won't come easily or quickly) you can find it within you to do your part in being mindful about your actions (see \"Think globally, act locally\"), then all the better.",
            "title_similarity": "0.80572677",
            "sentiment_compound": 0.8848
        },
        {
            "id": "hpbatuu",
            "score": 1,
            "text": "The military is even worse. \n\nFirst they need to tell us peon citizens — what % do we cause?",
            "title_similarity": "0.50662947",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hpbb2f3",
            "score": 1,
            "text": "As long as you aren't helping them do it. Shop local.",
            "title_similarity": "0.36842453",
            "sentiment_compound": -0.2235
        },
        {
            "id": "hpbbijz",
            "score": 2,
            "text": "One day humans will be extinct and new life will spawn. It doesn't really matter at the end of the day.",
            "title_similarity": "0.44723663",
            "sentiment_compound": -0.0749
        },
        {
            "id": "hpbbipi",
            "score": 1,
            "text": "Most of those billion $$ companies produce so much emissions because their product is demanded either directly or indirectly by the consumer. We also live in an age of hyper finance, where every ounce of profit must be squeezed out. Add the fact that it’s pretty well documented that most products will lose significant market share if they stop being one of the cheaper options (consumers as a whole choosing), companies feel extreme pressure to not raise the price of the product compared to the price of competition. If everyone’s prices go up, that’s fine for them, but only their product increasing in price is a big NO.\n\nIt starts in a change in the individual. Get enough individuals and it changes society. Change society and it changes government and large businesses’ actions.",
            "title_similarity": "0.747506",
            "sentiment_compound": 0.3008
        },
        {
            "id": "hpbbyp0",
            "score": 2,
            "text": "I have scrolled far enough and i still think op is right.",
            "title_similarity": "0.08814414",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpbejfm",
            "score": 1,
            "text": "Bro the only people really telling you that are the companys that actually need to do something, its propaganda designed for you to feel just like this, 70% of carbon is done by corps, they are the only ones that need to change, what little diffrence you do other than vote for canidates who will hold that 70% accountable means almost nothing.",
            "title_similarity": "0.63005596",
            "sentiment_compound": 0.128
        },
        {
            "id": "hpbk0i0",
            "score": 1,
            "text": "Agreed, with a big thumbs up",
            "title_similarity": "-0.090988025",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hpbk1sr",
            "score": 1,
            "text": "Multi billion dollar Companies care about one thing and one thing only. Making. a. profit. If they can make a greater profit selling you electric cars, beyond meat and other green products then they will.\n\nThey're destroying the environment to make the products you enjoy. If you stop using them, they stop destroying the environment. That simple.\n\nYou shouldn't martyr yourself over it, but if everyone made small changes in there lives it would make a huge difference overall.",
            "title_similarity": "0.83867705",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hpbkfxm",
            "score": 1,
            "text": "This guy doesn't want his view changed, he just wants a debate/to get people annoyed",
            "title_similarity": "0.5025359",
            "sentiment_compound": -0.4257
        },
        {
            "id": "hpbkidr",
            "score": 1,
            "text": "Multi billion corporations act as customer demand. You are customer. As long as you don't demand the better stuff, they won't provide it",
            "title_similarity": "0.65292084",
            "sentiment_compound": -0.3687
        },
        {
            "id": "hpbklov",
            "score": 1,
            "text": "Reality is that moral goals <> convenience and affordability. nothing can run on hopes and dreams, it needs to be sustainable either through government subsidies and/or punishment / Tax. \n\nThe \"rich\" / corporations have such a global reach that local and country laws are just minor inconveniences. If the USA start breaking up and jailing executive teams that continue to dump waste/ didnt meet emission goals / etc  you'll see way more companies changing its tune.\n\nThe only thing we can do is vote local/state/general and advocate those that care about cc.",
            "title_similarity": "0.7963746",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hpbkn6r",
            "score": 1,
            "text": "You want the things these corporations provide. You are at fault for paying and supporting the industries.",
            "title_similarity": "0.5330304",
            "sentiment_compound": 0.128
        },
        {
            "id": "hpblgi2",
            "score": 1,
            "text": "Should people bother to not murder others because wars exist?",
            "title_similarity": "0.6006808",
            "sentiment_compound": -0.3098
        },
        {
            "id": "hpbms6e",
            "score": 2,
            "text": "It is like saying I won’t vote as my single vote won’t change anything.\nIf everyone had that attitude then nothing good will ever come to pass.\n\nPart of private industry is trying to do something re climate change btw.",
            "title_similarity": "0.6698369",
            "sentiment_compound": 0.0243
        },
        {
            "id": "hpbn68i",
            "score": 1,
            "text": "You shouldn't be stopping anything, but you should be SABOTAGING everything. Don't be a reactionist.\n\nSabotage or die. Sabotage or you're just another human primate driven by his ego and not what needs to be done.\n\nTed kachinsky wasn't completely right but also not completely wrong.\n\nYou care about \"the environment\" but you are not actually doing anything about it, OR YOU'LL BE VEGAN, i assure you that.\n\nIt's easy to make certain claims when you where born in the animal race that abuses and cheats nature through science medicine and tecnology.",
            "title_similarity": "0.74717236",
            "sentiment_compound": -0.7892
        },
        {
            "id": "hpbnat7",
            "score": 1,
            "text": "+ government doesn't give a hoot either.",
            "title_similarity": "0.31980073",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpbog45",
            "score": 2,
            "text": "You are a stakeholder, but you aren't the owner of these large emitting companies. Which means that you don't have the authority to make them change. The government has the authority to force them to change. You however only indirectly influence the government if you are lucky enough to live in a functional democracy. \n\nCompanies that create pollution are directly responsible for it's creation. Consumer demand for their products is indirectly responsible.\n\nThe place where someone would have the most control over how much pollution is created is at the company level. When the decisions they make directly influences how much pollution is created. \n\nAnytime someone who is directly responsible for a cost tries to pass the blame onto those who are indirectly responsible. They are trying to steal from you by making someone else pay for their costs. \n\nAll costs must be paid eventually. Whenever a cost is paid for by volunteerism. We have the free rider problem. For the polluters the volunteers pay for companies costs the companies caused but neglected to pay. Propaganda that it if the consumer's fault is cheeper than paying for it themselves.  \n\nWhenever we don't manage the commons with some government like entity, the commons are abused untill they decline and fail. All because no one is responsible for them or has the authority to do anything about it. \n\nUnfortunately the ocean and the atmosphere are the commons for the world. Global warming has extreme costs. The destruction of the ocean's ecosystem also has extreme costs.\n\nWe will all have to pay for this. It's not a matter of humanity paying for it. It's who should pay for it. It should be those who made and make profits by neglecting to pay for it.",
            "title_similarity": "0.7349694",
            "sentiment_compound": -0.9545
        },
        {
            "id": "hpbpgcb",
            "score": 1,
            "text": "Well in a way you're right but there multimillion dollar companies are burning carbon to get their products and services to you. Just not buying beef would do more to help than almost anything else you could ever possibly do.",
            "title_similarity": "0.7898296",
            "sentiment_compound": 0.6723
        },
        {
            "id": "hpbq118",
            "score": 2,
            "text": "“It’s someone else’s problem to fix.” is the exact opposite sentiment of what would work and anyone can use it, even billionaire companies.  Now Gimmie mah delta, cause that’s all the arguing this hot take requires in order to shoot down.",
            "title_similarity": "0.64985937",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hpbqdce",
            "score": 1,
            "text": "Actual socialists are advocating for working people to take control of the multi-billion dollar companies because we know climate change won't be prevented through individual action alone. If you're mentioning \"champagne socialists\" you're probably thinking of liberals who want to leave the ownership structure of these companies the same and just ask very nicely for them to not ruin the environment (liberals are capitalists).\n\nThe changes you need to make to your life are joining an organization (Sunrise movement, DSA, etc) that fights for a fundamental restructuring of our economy towards making humans (not profit) the centerpiece of it. Recycling, taking public transport, etc can help but that alone won't do it.",
            "title_similarity": "0.7778085",
            "sentiment_compound": 0.011
        },
        {
            "id": "hpbrefp",
            "score": 1,
            "text": "The rich people deserve it because they have money. You're a regular person so you don't deserve to reap any rewards from this ecological assassination",
            "title_similarity": "0.65764105",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpbrrd7",
            "score": 2,
            "text": "I like traveling by air, driving my car, eating meat, living in the suburbs, etc.  The solution is not to give up these things, be honest, people won't give up their first world lifestyles except at the point of a gun.  People who don't have that lifestyle won't stop trying to obtain it.\n\nThe solution is some combination of population control and new technologies to reduce environmental impact.\n\nThe world population has more than doubled in the past 50 years, and that's one of the main drivers of climate change.  Imagine if there were such a thing as safe, effective, and reversible male birth control.  Increase education, healthcare, access to safe abortion, and gender equality so that people in developing countries don't feel the need to pump out 12 kids.  \n\nImagine if fusion power ever becomes commonplace.  Transitioning to electric cars, building up renewable power generation.  Moving polluting industries into orbit or onto the Moon.",
            "title_similarity": "0.7659193",
            "sentiment_compound": 0.9589
        },
        {
            "id": "hpbsakw",
            "score": 1,
            "text": "Multi billion dollar companies produce for YOU to consume, if you don't make changes to your habits, they won't either. As simple as that.",
            "title_similarity": "0.665828",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpbscny",
            "score": 2,
            "text": "This is the literal definition of \"whataboutism\". \n\nYou seem to recognize that climate change is bad and should be fought against and are just using others' despondency to justify your own. It sounds like if you were in the position of the multi billion dollar companies, you'd be doing the exact same thing. \n\nChange has to start somewhere. We all have to be the change we wanna see and all that good shit. Don't let the fuckers get you down.",
            "title_similarity": "0.7247927",
            "sentiment_compound": -0.2153
        },
        {
            "id": "hpbsyaj",
            "score": 2,
            "text": "Only  1 reason honestly. Companies don't pollute for funsies. Its all driven by profit. If there is a massive change in our consumption habits they'll be forced to make more environmentally friendly products to chase that demand.   \n\n\nOf course it won't fix everything. LIke eating less meat isn't going to stop them from using fossil fuels for the further manufacturing. That's where the government comes in.",
            "title_similarity": "0.81781036",
            "sentiment_compound": 0.8105
        },
        {
            "id": "hpbt04i",
            "score": 1,
            "text": "Thats why you should vote for parties that want to regulate these corporations. A vote for a party that fights climate change is worth a lot",
            "title_similarity": "0.6496484",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hpbtciu",
            "score": 1,
            "text": "Companies don’t just exist in a vacuum, they’re actually feeding demand. If no one wants to change their consumption the companies have no reason to change their ways either. Essentially what you want is the government to make your decision for you.",
            "title_similarity": "0.6611934",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hpbtxez",
            "score": 2,
            "text": "Every time I choose to act on my values to do the right thing, despite opposing pressures or inconvenience, I can sleep a little better at night. It can be personally fulfilling and meaningful to know you've fought the good fight.\n\nAlso, IF you are living a middle class income fuelled lifestyle in the global north you probably look a lot like a rich person to the rest of the world. Developing countries are trying to catch up to places like America in terms of economic and consumer class development, and as long as we continue modelling an unsustainable society, many other parts of the world will similarly shrug their shoulders and say \"well, they get to do it, and they've exploited us plenty, so it's only fair that we all get to live the same way.\" \nWe could justifiably say that the billionaire class has everything to do with it, but even as a currently unemployed apartment renter, I am cognizant that much my life I have been part of, maybe not the 1%, but within the global 10%. Surely there's some level of power and responsibility there.\n\nSpeaking of modelling, it's hard for me not to perceive shifts like the popularization of plant based diets as something that required early adopters to push through inconvenience and stigma. This effort is necessary for normalization.",
            "title_similarity": "0.682298",
            "sentiment_compound": 0.9015
        },
        {
            "id": "hpbu3dw",
            "score": 2,
            "text": "The number of working class people outnumber the rich like a million to one.  Cruise ships don't emit emissions when working and middle class people stop taking cruises.  Container ships don't emit emissions when working class and middle class people stop over consuming cheap imported goods they don't really need.  So yes, your actions and the actions of those like you do make a massive direct difference.  \n\n\nThen there's the indirect difference.  The more complacent the general public is the easier it is for assholes to get away with being assholes.  Nobody gives a fuck about the corporation that dumps trash into the river when all the poor people also dump trash into the river.  Once all the poor people start caring about the river and the only asshole putting trash in it is the corporation it's a hell of a lot easier to single them out and shame them into change.",
            "title_similarity": "0.7406399",
            "sentiment_compound": -0.9296
        },
        {
            "id": "hpbv7zj",
            "score": 1,
            "text": "I’m with you. There’s no conclusive data that suggests every person doing their thing like stopping meat eating or flying will make a change. \n\nHeck, the US military creates more pollution that 140 countries combined. What difference will your one hour of driving make?",
            "title_similarity": "0.79349554",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hpbvabz",
            "score": 1,
            "text": "You are 100% right. Who will climate change affect? Working people.\nThe government is supposed to be for the people. If that is the case they should introduce a carbon tax.\nBut they are not for the people, they are for the corporations, so they won't.",
            "title_similarity": "0.804415",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpbwjh8",
            "score": 1,
            "text": "I think you're right. The problem is system and we need systemic change to solve it. Individual change of course is good, but can never be enough.",
            "title_similarity": "0.46175617",
            "sentiment_compound": 0.128
        },
        {
            "id": "hpbwpnr",
            "score": 1,
            "text": "You are absolutely right in my opinion in the context that you frame the issue. However I like to think about it in the context of voting with your dollar. Which I believe is much more important than any other voting you may do. And you get to do it constantly. The idea here is you do your best to spend your money only on corporations that are not gross polluters. You do spend your money consciously. Try to support local businesses, especially local food. You reward companies that try to behave in an environmentally conscious way and don’t just greenwash their products. If enough people do this the corporations feel the impact of how those dollars are being spent and they adjust their business practices accordingly. Meanwhile all the money you spend locally helps encourage and support small businesses that keeps your money flowing in your town and also keeps them providing local services that have a much less negative environmental impact due to reduced shipping costs and the negative impacts of all that global shipping.",
            "title_similarity": "0.7050227",
            "sentiment_compound": 0.9511
        },
        {
            "id": "hpc0cks",
            "score": 2,
            "text": "So you decide to not do the right things in life because others won’t?",
            "title_similarity": "0.3810116",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpc0jnm",
            "score": 4,
            "text": "I think this is a common problem in the attribution of blame for this problem.\n\nGiant corporations don't seek as their primary motive to destroy the planet. Their primary motive is to make money. They make that money off consumers. We are consumers.\n\nThe reason corporations are destroying the planet is because they figured out ways to save money and make their products and services affordable for the masses by offsetting the costs onto the environment.\n\nSure, it's their fault for coming up with the idea, but we're all implicated now because we all willingly agreed and adapted our lives to the conditions they offered.\n\nNobody put a gun to your head and forced you to shop at Amazon. Nobody made you adopt a high protein meat diet to achieve your fitness goals. You made choices based on what you wanted in life and the corporations did whatever they had to to bring you the cheapest way to satisfy your desires.\n\nThey aren't trying to destroy the Earth. There's no profit or benefit in just arbitrarily ruining the planet. They're trying to make money off your desires. Destroying the Earth is just the easiest way to make them the most compelling vendor for you to give away your money to.\n\nSo if we don't all change how we live and what we expect out of life, then the corporations will just keep doing whatever they can to give us those selfish things we want right away for the cheapest possible price.\n\nEven demanding legislation to ban the kinds of corporate practices that harm the environment is making a choice to change the way you live. Because one way or another, those added costs are going to land on you.",
            "title_similarity": "0.7921517",
            "sentiment_compound": -0.972
        },
        {
            "id": "hpc11iu",
            "score": 1,
            "text": "I mostly agree - systemic change is needed, individual action has a small impact at best, and is meaningless at worst. \n\nIf these systemic changes occur you will be forced to change your behavior and if they don't occur mother nature will force you instead.\n\nPreparing for these changes by making some of the more likely ones now will make the transition easier. Building your own resiliency so your less reliant on the systems that are likely to fail or that may be forced to change means you'll be better equiped for the future and more able to help those close to you through the difficult times ahead.",
            "title_similarity": "0.5009628",
            "sentiment_compound": -0.488
        },
        {
            "id": "hpc11pq",
            "score": 1,
            "text": "I am with you. I am not wasteful and I recycle and all. Don't drink bottled water because I think it is stupid wasteful. So I really don't have a huge relative carbon impact but what really rubs me the wrong way is that everyone loves to talk about lowering our carbon footprint by making these huge sacrifices that maybe 1% of people will actually do and it is dumb to think otherwise. What we never will talk about is the main cause and  the most effective way to cut down. That is, population control.\n\nYes, humans are the source and the more of them, the more pollution the earth will have.",
            "title_similarity": "0.8093617",
            "sentiment_compound": 0.1799
        },
        {
            "id": "hpc2jw2",
            "score": 1,
            "text": "Shut up, get back in your pod, and finish your bug sandwich peasant.",
            "title_similarity": "0.43806887",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpc2ztj",
            "score": 1,
            "text": "If you aren’t doing your part then you’re part of the problem.",
            "title_similarity": "0.09004622",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hpc4etx",
            "score": 1,
            "text": "I chose to fight climate change by not reproducing. The wife was on board with not procreating. 15 minutes could save you thousands by switching to not having children.",
            "title_similarity": "0.7729689",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hpc4zjj",
            "score": 1,
            "text": "Dude, I get it. It’s hard to be optimistic or want to try when you are a drop and they are an ocean.",
            "title_similarity": "0.33324146",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hpc59q9",
            "score": 1,
            "text": "So your collective damage is, say, “1” in comparison to say, ocean dumping by a rubbish company being a 5000. If everyone thought like you, the impact would be 7,000,000,000 compared to that company. Each “1” gets reduced by half, that number falls to 3,500,000,000.\nThe opposite thought could be applied. If every one of those “1”‘s stopped choosing the company based upon its carbon ethic choice, it’s market share will decline and their number will fall from 500. It will also reduce the “1”’s to “0.5”’s.\n\nThe real issue in my eyes is the green washing. Planting trees but importing food is counter productive. All well & good that we are pushing the margins in the Western world, but the attitudes of more eastern cultures are still based on principles not good for the earth. You’d be better to just boycott Chinese products than you would to not recycle.",
            "title_similarity": "0.64295423",
            "sentiment_compound": 0.5587
        },
        {
            "id": "hpc5pr6",
            "score": 1,
            "text": "All these \"individual solutions\" are drops in the bucket. They do make a small difference, but theyre a distraction from the real problems. This is why the plastic industry spent tens of millions telling us to recycle instead of changing anything about their products. Its why fossil fuel companies fund campaigns telling us to keep our thermostat higher and carpool instead of investing in green energy.\n\nThose things you mention are good things to do, and reducing your personal impact is never bad, but they are NOT the systemic changes needed to fight climate change.",
            "title_similarity": "0.80734277",
            "sentiment_compound": 0.0708
        },
        {
            "id": "hpc6hdm",
            "score": 1,
            "text": "Easy thing you can do at not much cost or effort: change to a green energy tariff. It may not be perfect but it is something.\n\nTry out a meat free burger if you haven’t already. Most good burger places will allow you to swap out the pattie for a meat free one. Honestly, it’s often hard to tell the difference as most of the taste from a burger comes from the sauces and other ingredients.",
            "title_similarity": "0.6352403",
            "sentiment_compound": 0.9659
        },
        {
            "id": "hpc6utn",
            "score": 1,
            "text": "The vast majority of people don’t truly care about anybody other than themselves and their immediate family. If you told them that they could fix poverty, famine, abuse, exploitation etc around the world by making major changes to their lifestyle then they wouldn’t be interested. The only reason they would consider doing it for climate change is because they are worried that the consequences might personally affect them and their children. If not, then they wouldn’t give a damn. It’s purely done out of self-preservation. And since I’m not having children, why would I give up the things that I enjoy (driving my car, flying on holidays etc) to benefit the hypothetical descendants of somebody who doesn’t give a toss about me?",
            "title_similarity": "0.77895296",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hpc9j5z",
            "score": 1,
            "text": "One thing to consider is that demands on consumer products can have a surprisingly large influence back upstream. For example Apple wanted to procure zero emissions aluminum for its iphones. In the grand scheme of things, not all that much aluminum. However it led to the first zero emissions aluminum operation: [https://www.riotinto.com/fr-CA/can/news/releases/First-carbon-free-aluminium-smelting](https://www.riotinto.com/fr-CA/can/news/releases/First-carbon-free-aluminium-smelting). Those innovations may carry through to the whole aluminum industry, one of the biggest polluting industries, in coming decades.\n\nYour individual consumption might not seem like much but for brand new products from start ups that are trying to stay afloat, a handful of customers might make the difference, and then the innovation catching on could end up changing the world.",
            "title_similarity": "0.6666626",
            "sentiment_compound": 0.6646
        },
        {
            "id": "hpcbwp7",
            "score": 1,
            "text": "Someone asked a similar question in a class where we were discussing how to convince people of the importance of climate change. They said, \"why does it matter who we convince, when there are 8 CEOs whose minds will never change, and who could have more impact than millions or even billions of people?\"\n\nMy prof responded with what many people have already said here about how people's individual actions do add up. But he also drew basically a standard distribution curve on the board to represent all of humanity. He asked us to consider that the 10% of people on the left side of the curve already believe in climate change and are working to reduce climate change impacts. Then we could think of the 10% of people on the right whose minds would never ever be convinced to care about climate change. And say there's an 80% of people in the middle who don't feel very strongly either way on climate change. (These numbers are not even estimates, just useful for the thought experiment) \n\nSay, for this example, the majority people who hold the most power to impact climate change exist in that 10% on the right who will never care about climate change. Well, to be frank, at some point all those people will lose their power or die. And eventually, as more of the people from the central 80% shift to being the people and CEOs holding the most power and influence, we want them to be people who believe in and care about climate change. \n\nSo although not really your question, this argument convinced me as to why engaging in climate change actvism for the general public can be really important.\n\nPersonally, I think if responding to climate change would be a major financial burden, that's not something I'd ask anyone to do. Like if taking the train would really negatively impact your life, don't worry about it. There's lot of ways we can all live more sustainably. Sometimes these are super easy and sometimes more challenging. I think its worth trying out the more challening options, but never letting it be a horrrible burden and stopping if those options become so.",
            "title_similarity": "0.7501652",
            "sentiment_compound": 0.9458
        },
        {
            "id": "hpcc9ud",
            "score": 1,
            "text": "Are you the same as them? Do you want to act in the same way as them? Would you not fuck the planet if you were them?\n\nIf you feel like you have no responsibility now, just because you’re not rich, what makes you think you’d suddenly care a lot if you were rich?",
            "title_similarity": "0.6268275",
            "sentiment_compound": 0.8514
        },
        {
            "id": "hpceiso",
            "score": 1,
            "text": "Personally there isn’t a lot that us as individuals can do, but For me I like to take steps to help because it makes myself feel\nBetter and jsut a bit more aware of the earth and what it provides us. I really don’t care what Jeff bezos is doing. But climate change or not I think we should be more respectful of this planet and not jsut take a take. I think it makes us better individuals as well.",
            "title_similarity": "0.6790692",
            "sentiment_compound": 0.9805
        },
        {
            "id": "hpcey6i",
            "score": 1,
            "text": "You can either be part of the problem or part of the solution. Change is happening because people support it. Spend your dollars wisely, vote with your wallet as well as with a ballot. It all adds up.",
            "title_similarity": "0.37840378",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hpckv1z",
            "score": 1,
            "text": "My wife gives me shit for throwing away a soda can on accident and thinks even my small contribution to recycling will actually be impactful. Then I remember that massive corporations intentionally build shit to fail and use untold amounts of plastic and I bite my tongue and say yes dear because I know I'm right but my wife thinks she is.",
            "title_similarity": "0.74820924",
            "sentiment_compound": -0.6428
        },
        {
            "id": "hpcnmku",
            "score": 1,
            "text": "No you're actually right.  I think what we should do is personally fight the companies.  Then climate change will probably fix itself",
            "title_similarity": "0.6818747",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hpcoq2p",
            "score": 1,
            "text": "The notion that environmental concerns (including climate change) represent consumer-level issues is one of the biggest, most pernicious, and incredibly effective lies ever told.",
            "title_similarity": "0.5860662",
            "sentiment_compound": 0.081
        },
        {
            "id": "hpcq4is",
            "score": 1,
            "text": "It's the \"I won't impact the world\" paradox/fallacy. It's like voting. Does your vote count in the sea of votes? No, not really. So, why does anyone vote?\n\nBecause if many people do it, it has impact. That's how influencers can help the world. If they instigate their fans to stop meat consumption or carbon emissions, they all do it _together_. You are part of a network and if you decide to do it, it is not only a responsibility to do it but also spread it to other people. I convinced 5 of my friends to vote last time. They in turn convinced other people. I am now trying to convince some people to get vaccinated.\n\nBut most importantly, I didn't vote thinking _my_ vote will change the world, but because _our_ vote does. We do what it takes to be part of a community and of human society. We do our part. It is both a responsibility and an opportunity. We are part of the same team and we will win as a team only. You can't defeat carbon emissions alone.\n\nYou would also be surprised how fast this stuff spreads in a neighborhood or society. Everyone starts using electric cars and even more people start using them. Same with recycling, pollution, etc.\n\nYour choice to do it is probably not that relevant, but it _can be_ the last drop to fill the cup and change the mentality of others.\n\nTogether only. Solo no go.",
            "title_similarity": "0.75417954",
            "sentiment_compound": 0.9799
        },
        {
            "id": "hpcroo5",
            "score": 1,
            "text": "if you’re actively supporting the big corporations responsible for the majority of climate change, you’re part of the problem. you’re allowing them to keep doing what they’re doing, and ENCOURAGING them to do it because it’s making them money.",
            "title_similarity": "0.6705925",
            "sentiment_compound": 0.8374
        },
        {
            "id": "hpcspop",
            "score": 1,
            "text": "I think individuals have some responsibility, but mainly we have the responsibility to \"talk with our money\" as a way to drive change at corporate level. Eg if we refuse to buy from nestle because they have slave labour, refuse to buy from kellogs because of the way they treat their workers, refuse to buy from companies who are big polluters etc. I agree that most of our other actions (recycling bins etc) are a drop in the ocean, but a drop in the ocean is more than nothing.",
            "title_similarity": "0.7567102",
            "sentiment_compound": -0.872
        },
        {
            "id": "hpcvc0a",
            "score": 1,
            "text": "Fighting Climate Change is a fight everyone can join. And the great thing about conservation is that you do good and get paid for it.",
            "title_similarity": "0.5205091",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hpcwpwl",
            "score": 1,
            "text": "I just want to change a portion of your view. Let me preface it by saying Jeff Bezos ain't great. \n\nBut don't shit on him for the space stuff. There's a very real chance that an earthbound humanity is doomed. We may be past the point of no return with climate change already, and we certainly aren't slowing down. Biden, a president who campaigned on climate change policy, is doing more to accelerate fossil fuel drilling than trump IIRC. The world very likely, is doomed. \n\nIf that is the case, the only chance for the future of our species is efforts to get off this ruined rock. That includes every space program, but it also includes billionaires riding their penis rockets to the stars and that sweet, sweet, asteroid mining. Jeff Bezos is furthering our space industry, which could very well save our species some day.\n\nAnd hey, we may not be doomed. Even if that's the case, offloading our industries, even eventually our garbage into space may be the only fucking way we can save our planet. \n\nSo in this one specific instance, let the billionaires have their fun. It's helping, very slightly.",
            "title_similarity": "0.81585735",
            "sentiment_compound": 0.9705
        },
        {
            "id": "hpcy7aa",
            "score": 2,
            "text": "I think you're looking at the wrong changes to make. [The best thing you can do for the environment is have less kids](https://lh3.googleusercontent.com/proxy/jp4KEv2m-Oam-LPG7t7z6MVHeCiwsMWRrF90613RfvRKFPSR4ZSMW7xJRogQwaqaAh_2UcomX7fxmeoVhXnoPptxz1zTA1dNXJSYgLI_vXJ3xhhRyMP0Pjqija9m3jRPWhJKk-OG0fgAiO97GiHnhcy32EPusB-A02Q). Think about it: not only are you taking that kid's emissions out of the equation, but their kids', their grandkids', etc. And guess what? This will also SAVE you money and birth control is much less disruptive to one's way of life than offspring. You're also robbing big companies of future investors, employees, and consumers.",
            "title_similarity": "0.5125821",
            "sentiment_compound": 0.664
        },
        {
            "id": "hpcyogy",
            "score": 1,
            "text": "This is why I believe we are screwed as a species on this planet. Even if we took personal responsibility for our cars pollution, our plastic garbage, our non-existant recycling program. Even if our American companies took responsibility for it's toxic by product waste, it's air pollutants, it's oil should in the ocean. There is no way we could convince other countries like China, India, etc. From doing the same.",
            "title_similarity": "0.79232186",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hpcyw65",
            "score": 1,
            "text": "The preconceived notion that climate change is a inconvenience to you is a bit... misguided.\n\nIf we were working towards fighting climate change it would mean that you would have no electricity bills, don't pay for fuel, your vegetables would come from close to you (either organically and sustainably grown, or hydroponically with renewable energy), your county would be focused more on making stuff in your country instead of cheap imported stuff from China etc. etc.\n\nIt's just the fact that the TRANSITION to doing all these things effect huge multibillion dollar corporations who have ties to fossil fuels and shipping liners.  You should alter your life because there are hugely rich people damaging the climate based on you living your life right now.  Your lifestyle literally fuels all those things. Making TRUELY good climate decisions should result in you having a better life... not a more inconvenient one.",
            "title_similarity": "0.81862",
            "sentiment_compound": 0.8165
        },
        {
            "id": "hpd0man",
            "score": 1,
            "text": "I believe all these space flights cause more problems than a thousand cars. I also am very suspicious of nuclear testing and nuclear accidents maybe being the real cause of the problem.",
            "title_similarity": "0.73464656",
            "sentiment_compound": -0.8685
        },
        {
            "id": "hpd2a5h",
            "score": 1,
            "text": "Individual actions will never solve systemic problems. Corporations and the US military create a majority of the worlds impact on image change.",
            "title_similarity": "0.6777322",
            "sentiment_compound": 0.4149
        },
        {
            "id": "hpd3ba0",
            "score": 1,
            "text": "For all the people saying companies are just making what people want yes this is true but so is planned obsolescence . Things are not made to last anymore . We had a fridge from the 50's out last tons of new fridges . Sure it used more power but it prevented a pile of waste from replacing a fridge every 5-10 years",
            "title_similarity": "0.7232221",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hpd3iq9",
            "score": 1,
            "text": "Eat the rich.",
            "title_similarity": "0.24503261",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hpd48h3",
            "score": 1,
            "text": "You should not compare your morality to a company because you are a person and they are not. They are things which exist to make money and disregard everything else. It's like asking why murder is wrong since the lions might get us all anyway.\n\nCorporations are literally monsters.",
            "title_similarity": "0.7546383",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hpd5n2c",
            "score": 1,
            "text": "You don’t care that much if you’re doing things that actively harm the environment. Corporations are meeting a demand. Complacency let’s them win and keeps evil ppl in power.",
            "title_similarity": "0.7071657",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hpd7j6e",
            "score": 1,
            "text": "I try to live in a way that if everyone else in the world lived like me, it would be a good place to live. IDK, It makes me feel good but do as you’d like.",
            "title_similarity": "0.34378025",
            "sentiment_compound": 0.7456
        },
        {
            "id": "hpd7uwr",
            "score": 1,
            "text": "To me right now it’s a multi layered topic- that we’re simply trying to only look at 2 parts: Social class & Personal Moral Ownership- which imo don’t really stand next to me act other in a tiered order.\n\nThe key is your personal ownership in which you take on- should align with your beliefs, responsibility you take on in life so on and so forth.\n\nWithin that space if you feel it’s not your responsibility anymore since those people up there don’t choose to coincide with your “burden” that la your personal choice.\n\nBut if we look at from a “far view” the average folk working together in this context - have more power to move that needle, than the rich alone do. If you’re argument is that the companies they own don’t do much? I’m not sure on that personally but if that’s what your “quitting” on something you care about, who are we to say different? But I will say that thing doesn’t mean much to you then.\n\nThe decisions and choices we make for ourselves should be on the principles, values, alignments we choose for ourselves- not necessarily what a certain part of the social class in doing, if that makes sense.",
            "title_similarity": "0.46003562",
            "sentiment_compound": 0.8614
        },
        {
            "id": "hpd90dh",
            "score": 1,
            "text": "Reducing meat consumption does fuck all for climate change, biggest myth out there.\n\nI don't think you should make decisions and live your life based on anyone else's actions. Stick to your own morals and ethical code and do what you believe is right.",
            "title_similarity": "0.81386757",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hpdafd7",
            "score": 1,
            "text": "There are a few reasons why you should:\nFirstly, those companies do what they do because of you and your feelings towards things. If you support them without regard they will keep going because you keep supporting them. \nSecondly, we are not in a vacuum, one person doing something will create effects issue of themselves. This is peer pressure and it is certainly effective. Every single person who helps to make a positive change creates a standard for society as a whole that is set harder each time it is done and by each person it is done by. Even just one single person taking time to do the right thing makes someone take stock and think about whether they should be doing that or not. \nFinally, like we skyway hear and what has been spouted many times it takes every person doing their part. This means even if you are not able to do the absolute best thing every single time billions of people doing their best will make a world of difference and push the multi billion dollar companies and those people not trying to care. Then it becomes a cascading effect and moves more and more to take to the cause.",
            "title_similarity": "0.54783183",
            "sentiment_compound": 0.9718
        },
        {
            "id": "hpdb1t8",
            "score": 1,
            "text": "As long as you don’t change your lifestyle you are supporting the companies whose practice are destroying the planet. Speak with your money, make so that it is no longer profitable.",
            "title_similarity": "0.68547404",
            "sentiment_compound": -0.6492
        },
        {
            "id": "hpdbckk",
            "score": 1,
            "text": "If you cut down on meat and make other changes that help the environment as best you can, people take notice and it raises awareness. Naturally, if you go completely vegan and shit on everyone else for not doing the same, many people will actually double down on ***not*** doing what you tell them to do. \n\nIf more and more people start caring and realising how bad our current situation is, larger companies will be compelled to meet demand for these things once they start losing business to greener companies. Also, if more and more people are voting in elections based on environmental policy, all parties will make more of an effort to win following elections.\n\nThe fact that we have to do this when most of the fault lies with the billionaires who care about nothing but their bottom line is unfair, of course, but that doesn't absolve us of all responsibility. You don't need to make your life awful for a change that is ultimately negligible, but do what's convenient, I guess.\n\nPersonally, I prefer Quorn chunks in my home-cooked curries nowadays and the vegan royale at Burger King is honestly better than the chicken version (the beef replacements not so much though. They're nice, but definitely not quite as good. Still, fun to try them out.)",
            "title_similarity": "0.7640152",
            "sentiment_compound": 0.8233
        },
        {
            "id": "hpdbh7y",
            "score": 1,
            "text": "I think you have nailed it here mate. I see that the benefits we have received from fossil fuels far outweigh the costs due to the effects of any increased in atmospheric CO2 that that has caused. \n\nUnfortunately too many issues are bundled into the climate change narrative.  So if others like me have doubts about the catastrophic predictions of climate change we are accused of not caring about the environment. The hypocrisy is not only from the high flying mega rich but many average people accept the benefits but complain vigourously about the costs. For example city dwellers living inctheir concrete abodes surrounded by bitumen and all forms of pollution complain about farmers clearing land to grow their food because it is the farmer that is creating the climate  Armageddon. \n\nSorry about the rant but l find it difficult to be concerned about many things that are affecting society, that may well be addressed better individually and on their merits, rather than insisting that the only course of action is to eliminate fossil fuel and harvesting the environment.",
            "title_similarity": "0.7864991",
            "sentiment_compound": 0.8631
        },
        {
            "id": "hpdbtc5",
            "score": 1,
            "text": "Just a thought, If Bezos hadn’t convinced so many people that he provided such convenient purchasing, then he would still be a poor schmuck. It’s easy to blame the guy at the top, but we are the ones who put them there. Doesn’t apply to all rich bastards of course.",
            "title_similarity": "0.6038519",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hpdep57",
            "score": 1,
            "text": "Residential recycling is a joke and if plastic recycling is going to ever matter companies need to stop making /using non-recyclable options. People can stop using single use plastic but companies need to change towards sustainability.",
            "title_similarity": "0.7336166",
            "sentiment_compound": -0.1406
        },
        {
            "id": "hpdfhpv",
            "score": 2,
            "text": "Choosing to not change for a better carbon footprint out of spite, doesn't cause Bezos to change his ways.\n\nWhile its true that individual \"civilian\" lifestyle choices don't have a very big impact compared to the big companies and governments that pollute, you still have to be cognizant.\n\nThose little lifestyle changes are like daily reminders to keep climate change on your mind, so you can make decisions where they matter, like voting right, and spending your money ethically/wisely.\n\nTL;DR sure, use a plastic straw, but make sure youre supporting green politicians, and perhaps donating to green initiatives.",
            "title_similarity": "0.72819734",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hpdgkq2",
            "score": 1,
            "text": "If everyone has this mindset, nothing will ever be achieved. \n\nThe majority of the population ultimately decide the fate of the earth by what they choose to consume.\n\nWe all have the power, and to say you shouldn't make a change because other people aren't doing it is just a cop out.\n\nThose who stand and watch an act of violence against another human and do nothing are just as guilty as those who commit the violence. Same goes for violence against the planet.",
            "title_similarity": "0.7279998",
            "sentiment_compound": -0.9313
        },
        {
            "id": "hpdijxo",
            "score": 1,
            "text": "Let me tell you from the POV of a global 3%-er, and a N.American top 10% earner:\n\n* I stopped eating meat.\n* I've retrofitted my house.\n* I will not get a second car, even though it's hella inconvenient. My car is average, not a Prius but not an Escalade.\n* I offset all flights & vacations.\n* I donate significantly to orgs that effectively fight for the cause.\n* I personally divested from fossil fuels in my portfolio.\n\nIs my life \"carbon negative\"? Not yet, but soon. Am I a self-deceiving hypocrite? I hope not. Is it visible to people who can only afford to take the bus? Not in a million years.\n\nYes, some ultra rich are pissing on us all in a wide arch. But I suspect not all of them are. And I suspect we may not be able to tell the difference easily. And I suspect that by turning the heat, and cranking that ratchet, we'll get more and more of the rich & powerful onto the right side of history.",
            "title_similarity": "0.8253355",
            "sentiment_compound": 0.8587
        },
        {
            "id": "hpdkkog",
            "score": 1,
            "text": "At a certain point, the collective good will tips from outlier volunteer to an actual movement. The momentum of which will catch on and force the largest domino. Hopefully. \n\nJust know that it is not the proactive that will be noticed. Very suddenly, subtly, and with nothing telegraphed, attention will sour upon the inactive.\n\nDon’t get caught wanting.",
            "title_similarity": "0.55586064",
            "sentiment_compound": 0.6562
        },
        {
            "id": "hpdm4sr",
            "score": 1,
            "text": "Isn't should the wrong way of looking at it?",
            "title_similarity": "0.05889947",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hpdnsi2",
            "score": 1,
            "text": "Indeed do something better. Be politically active, fight for our survival, change peoples mind, disrupt greedy corporations,  sacrifice for humanity and you'll find you're not alone",
            "title_similarity": "0.53902644",
            "sentiment_compound": 0.3485
        },
        {
            "id": "hpdnsks",
            "score": 1,
            "text": "Stop buying from big companies and those companies go out of business.",
            "title_similarity": "0.55673003",
            "sentiment_compound": -0.296
        },
        {
            "id": "hpdp1ri",
            "score": 1,
            "text": "I think you should personally make changes, but I think you shouldn't be shamed for not making more changes.  \n\nMulti-billion dollar companies don't make changes because they claim they need to maximize shareholder returns and it's cheaper to keep things the way they are.  Rich people don't make changes because they can afford to not care if their house is energy efficient.\n\nSure, I'll make more changes, but there are things I won't do until those guys pitch in.",
            "title_similarity": "0.8005572",
            "sentiment_compound": 0.9397
        },
        {
            "id": "hpdp2h4",
            "score": 2,
            "text": "Because those companies that couldn't care less, are made up of people just like you and me.\n\nIf you, and I, and everyone else starts working towards that goal, then before you know it, those same companies are made up of people who not only want to make a positive change for the environment, but have the power to make that change.\n\nMaking a positive change isn't all or nothing, it is a combination of literally billions of us taking small steps towards the same goal.",
            "title_similarity": "0.6371658",
            "sentiment_compound": 0.792
        },
        {
            "id": "hpdtsgi",
            "score": 1,
            "text": "I get where you are coming from, but it’s not an “either/or” scenario. \n\nYes, corporations need to be held to account, and need to do more. Yes, they can make a bigger difference than you can, but that doesn’t mean that individuals shouldn’t ALSO do more. \n\nIn terms of eating less meat, we should all do that. That’s a consumer decision, and short of restricting supply, there’s not a lot a business can do about it. \n\nAnother consideration is that multinationals have their impact in a few areas - Amazon contributes via packaging and transport emissions, but doesn’t really impact on (say) the impact of eating meat by billions of people.",
            "title_similarity": "0.74022025",
            "sentiment_compound": 0.7343
        },
        {
            "id": "hpduffx",
            "score": 2,
            "text": "Broadly speaking. companies are trying to match a consumer desire to a product. If the consumer continues to demand the product, they will continue to produce it. \n\nIndividual action will lead others to follow, becoming collective action, and eventually changing the entire course of action\n\nAs an example, say you were to buy an e-bike and bike to work rather than drive. You advocate it to all your friends and they do it and continue this cycle. Now suddenly to car makers, they notice this pivot and probably want to get in on the action and move towards trendy e bikes rather than outdated cars\n\nIt might not seem like you can make that much of a difference but you’d be surprised. Many people I know have moved more towards sustainable lifestyles due maybe to a single vegan food blogger, or a public transportation advocate",
            "title_similarity": "0.63555896",
            "sentiment_compound": 0.5566
        },
        {
            "id": "hpdv8cm",
            "score": 2,
            "text": "Problem is that those companies aren't some bond-esque villains who are shitting on climate because they are planning to destroy the world. They are doing it to make profit. And if you, and other people, do change things in their life to fight climate change - even when it costs you money and inconvenience, it means that they doing bac crap will inevitably mean less profit. All because they are doing something that you consider bad enough to inconvenience yourself.\n\nThey will start to care, because they will want to win people and make money. It's as simple as that.\n\nWhat is more - if most people actively fight climate change - there is political gain in that. So politicians will be less likely to be dismissing climate change and will actively try to push some laws that fight it to win votes. All because it becomes an issue that people care about and will lead them to being reelected.",
            "title_similarity": "0.76428723",
            "sentiment_compound": 0.6638
        },
        {
            "id": "hpe1pdn",
            "score": 1,
            "text": "I’m not sure if this will change your view, but I think a solid option is to make only changes that hurt those corporations. Instead of worrying about not taking a flight for your vacation, just stop using Amazon. \n\nStop supporting corporations that dump on the climate. It’s still a change to your life, just not the change the “personal responsibility” narrative tries to push.",
            "title_similarity": "0.7943864",
            "sentiment_compound": -0.8855
        },
        {
            "id": "hpe50p9",
            "score": 2,
            "text": "Isn’t this just a slippery slope logical fallacy?",
            "title_similarity": "0.16427915",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpe64z4",
            "score": 1,
            "text": "use a car to make more money or to build a business.buy meat raised via regenerative agriculture be that silvopasture marine permaculture or allan savory's adaptive multi paddock grazing as its cheaper and higher quality without subsidies interfering. fly only if the opportunity cost makes it worth it.if you are worried about your impact on the enviroment just put it in your will to invest some amount of money into replanting a ton of bull kelp or marine permaculture its super cheap per acre or you could have the money go towards funding silvopasture or agroforestry.theres not much need to focus on the world when basic things like agriculture can both be profitable and carbon negative. if you care about it just put just enough effort in to be carbon negative and leave it at that whats more important is that people get out of poverty and have a chance to invest in such things [https://www.copenhagenconsensus.com/post-2015-consensus](https://www.copenhagenconsensus.com/post-2015-consensus) and it turns out that people will do that on their own if the gov gets out of the way.  \nedit: if you only want to look after yourself if you live in a polluted city or something use aquaponics or algae bioreactors to produce your own o2 and food even if you have to hire someone to do it for you so that you and your kids arnt as dependant on your income/the economy",
            "title_similarity": "0.71966505",
            "sentiment_compound": 0.5413
        },
        {
            "id": "hpe9yle",
            "score": 2,
            "text": "You shouldn’t. The solution isn’t going to be any of these things. Nature will sufficiently reduce the human population over time to fix the problem.",
            "title_similarity": "0.63017434",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hpebrnp",
            "score": 2,
            "text": "Why do people go on cruises? They’re awful in every single way. You lose money, you don’t have fun, you’re stuck in close proximity with strangers, and then you’re home. We should absolutely stop going on cruises for ALL OF THE REASONS! Climate change is just one",
            "title_similarity": "0.6711549",
            "sentiment_compound": -0.7339
        },
        {
            "id": "hpebz3z",
            "score": 1,
            "text": "I don't know why people get so huffy about this. I still drive my small gasoline powered car because I can't afford to buy a new electric one. But I support legislation that subsidizes electric cars, electric infrastructure, and renewable energy.\n\nI still eat meat, but I eat a lot less of it than I used to. It's no big deal, it's a lot healthier to fill out a meal with vegetables and starch rather than loading up on meat. Some meals I skip meat altogether, and I support legislation to encourage types of farming and ranching that reduce destruction of land and help store carbon in the soil.\n\nFlying is only 2.5% of global CO2, and because of how many passengers are packed into a plane, it's generally less carbon intensive than driving. So I still fly, but I support legislation to subsidize electric aircraft development and deployment. Also I take the train to and from the airport for $3.\n\nCruise ships don't actually pump out more CO2 than thousands of cars, they pump out more _dirty pollution_ than millions of cars. The entire ocean shipping industry is responsible for about 2.5% of CO2, same as aviation. But the shipping industry uses very dirty fuel, which when burned produces polluting particulates, sulfuric and nitric acid precursors, carcinogenic carbon compounds, toxic metals, etc. Shipping produces as much of _these_ kinds of pollutants as millions of cars, but they don't have much to do with global warming.\n\nI support legislation to clean up global shipping, and actually in 2020 the shipping industry began to adhere to new rules to reduce shipping pollution.\n\nI work with young climate activists, most of them drive cars, some of them eat meat, they fly when they can. There's nothing that says you have to wear a hair shirt to solve global warming. I mean, if we still used horses, we might have meetings about getting all the horseshit out of the street, but we'd still have to ride horses to get to the meetings!",
            "title_similarity": "0.79457605",
            "sentiment_compound": 0.9596
        },
        {
            "id": "hpec1w2",
            "score": 1,
            "text": "I am only coming to the party on climate change when this happens which it won’t this is the greatest Reddit post of all time.",
            "title_similarity": "0.6495397",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hpedz20",
            "score": 1,
            "text": "Because it's a whole lot easier to say \"start caring you heartless corporations\" when you're not gushing down 2000 litres of water per meal and pumping c02 into the atmosphere in situations where you just don't have to.\n\nMore specifically, it's easier to say when when we collectively do not do any of those things.",
            "title_similarity": "0.6841033",
            "sentiment_compound": 0.7063
        },
        {
            "id": "hpehqwh",
            "score": 1,
            "text": "“The worlds already fucked, I’m just adding to it”.\n\nYou have to be the change that you want to see.",
            "title_similarity": "0.30707455",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hpeix0r",
            "score": 1,
            "text": "Collectivism starts with a single person. Change forms like puddles in a storm. Now if every raindrop said “Theres no point in trying” and evaporated before they hit the ground would the puddle ever form?",
            "title_similarity": "0.46718723",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hpej6b8",
            "score": 2,
            "text": "Tbh I don’t give a shit lol, y’all eat your slop and deny yourself of luxuries thinking it’s making a difference though.",
            "title_similarity": "0.5932216",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hpejg2l",
            "score": 1,
            "text": "It's up to you to decide how much you are part of the problem and how much you are part of the solution. According to your CMV you seem to be more part of the problem than the solution.",
            "title_similarity": "0.2707581",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hpeltjw",
            "score": 1,
            "text": "The reason you shouldn’t bother with excessive individual action is not that “companies and rich people will still keep polluting” (although it certainly doesn’t help to know that you’re slaving away while some people are flying dozens of times per year). As others have pointed out, companies are just making what the people want to consume.\n\nThe reason is that even if you make changes, others won’t. When you take it upon yourself to make ‘small changes to help’, you’re part of a solution which is doomed to fail.\n\nGovernments need to step in. People need to vote for far-reaching changes and massive projects and overhauls.\n\nThink of it like this: imagine all the fuel companies are putting lead in their fuel. They all know it’s bad, but it’s allowed, and if it’s allowed, some people will do it, so if you want to survive, you have to do it too. But if you are a “good” leader of a fuel company who wants to keep selling fuel but doesn’t want to put lead in it, you want to get together will all the other fuel makers and convince the government to regulate lead away.\n\nWe are the fuel companies and unless we can convince the people with *power* to change things, you might as well do whatever you want, not exactly because “rich people gonna pollute”, but because the situation is hopeless so why live like crap through it?",
            "title_similarity": "0.8129395",
            "sentiment_compound": 0.8069
        },
        {
            "id": "hpep4l9",
            "score": 1,
            "text": "Yes you are definitely true. There is a statistic that says that if you go green your entire life you would save only as much carbon as is emitted by fossil fuel industry in one second",
            "title_similarity": "0.5766262",
            "sentiment_compound": 0.886
        },
        {
            "id": "hpepbhk",
            "score": 1,
            "text": "Corporation decisions are just direct responses to consumer demand.  All you are really saying is you don't want corporations to do anything about climate change",
            "title_similarity": "0.7418387",
            "sentiment_compound": -0.1833
        },
        {
            "id": "hpepqss",
            "score": 1,
            "text": "Counter argument to the others in this thread:\n\nI no longer believe it is possible to avoid **significant** damage and changes to the way our world works due to anthropogenic climate change. It is too late, and the strategies we have to counter the issue are insufficient. One staggeringly obvious problem we face is that switching to green and renewable methods incurs its own carbon cost. Production, mining, distribution etc. \n\nThe truth is quite likely that our way of life is incompatible with the realities of life on a planet like this. Our actions have costs.\n\nEven if we pushed the off button and everyone started living feudal lives tomorrow, it would still be too late.\n\nOpen to counter arguments.",
            "title_similarity": "0.78424907",
            "sentiment_compound": -0.8658
        },
        {
            "id": "hpept74",
            "score": 1,
            "text": "I'm very late to this party.\n\nIt can feel that way, yes. But it's also a narrow and small view. Movements of people make a difference.\n\n[This Kurzgesagt video is the best I've seen to sum it all up in an approachable way.](https://www.youtube.com/watch?v=yiw6_JakZFc)",
            "title_similarity": "0.3908743",
            "sentiment_compound": 0.8662
        },
        {
            "id": "hpesfk5",
            "score": 1,
            "text": "Because climate change doesn't care if it's unfair, it's happening and we only know what we know to prevent it. It's happening regardless so I do what I can to make myself feel better about the full thing.",
            "title_similarity": "0.6271626",
            "sentiment_compound": -0.4075
        },
        {
            "id": "hpeu9kb",
            "score": 1,
            "text": "The companies don't pollute for fun. They pollute because you don't fucking stop to constantly replace your perfectly fine electronics and don't stop to buy cheap crappy fast fashion bs six times a year.",
            "title_similarity": "0.7016237",
            "sentiment_compound": 0.2716
        },
        {
            "id": "hpeumd5",
            "score": 1,
            "text": "A company is not a human being. It is an entity created for the sole purpose of making money. How can you justify getting mad at something that is don’t exactly what it was created for?\n\nIf you think that your individual contribution towards fixing an issue will not be significant enough to be worth it, then you are contributing wrong.\n\nThe person who takes a jet to a climate conference and influences a million people to ride bikes invested of driving has done far more for the environment than you have by using less gas.  When it comes to these people, you just choose to only see one side of the scale.",
            "title_similarity": "0.8077303",
            "sentiment_compound": -0.4574
        },
        {
            "id": "hpeuz4i",
            "score": 1,
            "text": "To OP and all interested parties, there's a very interesting and well-constructed Kurzgesagt episode on this called \"Can you fix climate change\". I personally really liked how they approached the subject. \n\nI'm not sure I can add anything that hasn't been said already, I'm trying to live my life adhering - where applicable & morally sound - to the categorical imperative meaning I don't agree with op, but as Kurzgesagt may explain to anyone in their take on this much better than I could, it's worth thinking about what each and everyone could and should do or refrain from.",
            "title_similarity": "0.63483405",
            "sentiment_compound": 0.8722
        },
        {
            "id": "hpevmpc",
            "score": 1,
            "text": "This may sound like a cliche, but every person has an affect on this. Think about over the course of a year, how much plastic you probably use up. Everything from packaging, drinks, electronics, etc. \n\nYour actions as a responsible consumer helps to shape what these companies sell. One person alone can help bring attention and focus to the issue. Think about Greta Thornberg. She's a student, started off as a basic person, in a country many Americans know little about, with IKEA being the exception. \n\nSo if you end up bringing focus or a new light or way to see things to people, your impact will be tenfold. You can lead by example, without even trying and people close to you may slowly adopt those environmentally friendly habits of yours.",
            "title_similarity": "0.607101",
            "sentiment_compound": 0.9382
        },
        {
            "id": "hpeww4w",
            "score": 1,
            "text": "Simple answer: Do just a tiny bit by supporting only those that show interest in the environment and their impact on it. Billionaire companies get their money from you and me. Vote with your spending.",
            "title_similarity": "0.59916174",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hpf2x0q",
            "score": 1,
            "text": "Especially considering those billionaires are the ones who exploited the earth to this point in the first place. It was revealed last year that all the “do your part” recycling, switching lights off, etc were all part of propaganda campaigns by Big Oil lol the irony",
            "title_similarity": "0.6502003",
            "sentiment_compound": -0.34
        },
        {
            "id": "hpf58ee",
            "score": 1,
            "text": "I agree and disagree at the same time.",
            "title_similarity": "-0.025289983",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hpfw32k",
            "score": 2,
            "text": "here in Brazil we have gone through this with the Amazon, developed countries have destroyed their forests and pollute the environment, and then they want an underdeveloped country to accept absurd norms on how to deal with something that is OURS",
            "title_similarity": "0.6196953",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hpfx5zz",
            "score": 1,
            "text": "You can boycott bad companies and buy similar products from local (=less energy for transportation, and smaller companies are easier to regulate) and/or environmentally friendly companies, or secondhand. When enough people do this, it causes the bad companies to shrink and the local and/or good ones to grow.",
            "title_similarity": "0.6237926",
            "sentiment_compound": 0.1045
        },
        {
            "id": "hpg5f5d",
            "score": 1,
            "text": "Appeal to Hypocrisy is a common logical fallacy^(\\[1\\]) .  It's like a 16 year old kid caught smoking telling his parents \"You say I shouldn't smoke, but you hypocrites smoke two packs a day\"^(\\[2\\]) \n\nIf people's acts are warming up the planet or endangering the environment, then those acts are wrong regardless of how many people or which corporations are doing it. Therefore, in this case, \"everybody doing it\" isn't a reason for you yourself to do it.\n\n\\[1\\] In more formal academic terms it's called *ad hominem (tu quoque).* It means \"to the man (you too)\".  \n\\[2\\] Based on a Beastie Boys song lyric \"You Gotta Fight For Your Right to Party\".",
            "title_similarity": "0.7888794",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hpifcgf",
            "score": 1,
            "text": "That was perfectly stated. Can I quote you?",
            "title_similarity": "-0.05136904",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hpin6q5",
            "score": 1,
            "text": "I recommend everyone to take this quiz to find out your ecological footprint and how many planets we would need if everyone lived like you: http://www.footprintcalculator.org/home/en",
            "title_similarity": "0.51185775",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hpl06is",
            "score": 1,
            "text": "OP, you are absolutely right. Without significant structural change, there is no point in changing your lifestyle to fight climate change. On its own, it's empty moral posturing and arguably worse than doing nothing, because you're participating in the illusion that individual choices somehow matter in the grand scheme of things, effectively undermining the possibility of REAL change. If we truly want to save the various species on this planet, we'll have to make far greater sacrifices than simply opting to bike to work or drive an electric car. It's revolution or bust folks! If you don't see that, you're part of the problem.\n\nThe people who try to browbeat others into lifestyle changes are more reprehensible to me than those who don't care at all. At least the guy driving a Hummer that says \"fuck the environment\" is being honest.",
            "title_similarity": "0.7921848",
            "sentiment_compound": -0.6093
        },
        {
            "id": "hplm3pj",
            "score": 1,
            "text": "A smarter move would be to improve infrastructure in the face of Global Warming, make all our lives better.\n\nNot one of these \"climate activists\" is even contemplating how to get China, India, Russia and the Mid East countries on board.  They don't even allow the problem to be discussed, because it has no solution.",
            "title_similarity": "0.80208397",
            "sentiment_compound": 0.6214
        },
        {
            "id": "hpndxw5",
            "score": 1,
            "text": "if no one Does anything no one else will",
            "title_similarity": "0.0964801",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hppjh4s",
            "score": 1,
            "text": "Honestly, I'm inclined to agree. The only way we are going to make progress against climate change is when we have to. This idea that \"if we do this, then this...\" will **never, ever**, work as long as we 1) have oil, 2) have large, emerging economies, 3) have politicians with financial self-interests, 4) suppress research into cleaner energy tech, 5) encourage single-use products, 6) market convenience, 7) make true recycling overly complicated, 8) hold onto outdated concepts, 9) prioritize cars over mass transit and trains, and 10) make products that are designed to break easily. \n\nWe pollute everything, including space. We'll continue to do it until it's unusable or until we paint ourselves into a corner.",
            "title_similarity": "0.8130344",
            "sentiment_compound": 0.9531
        },
        {
            "id": "hq24bn7",
            "score": 1,
            "text": "This is an understandable opinion.   But really you could change a handful of things that would be beneficial to you anyway.    So something like eat meat just once a day and replace with more greens.    In pleasant temps bike/walk for some of your errands.    Your AC could be 76 in the summer and heat could be 68 in the winter.   Ive been to places that are the opposite and it is enraging.\n\n&#x200B;\n\nAnyways this wont solve climate change but if everyone did a few basics these billion dollar companies would see their revenue flatten or decline and start making/ planning changes",
            "title_similarity": "0.8054608",
            "sentiment_compound": 0.7411
        },
        {
            "id": "hrhfq9p",
            "score": 1,
            "text": "If you accept defeat then all is already lost. I completely agree with you because why the fuck should I do better if my change is such a minuscule one. But the only way we can make change in this system is by putting our money into more ethical and environmentally friendly companies. Vote with your dollar.",
            "title_similarity": "0.73221767",
            "sentiment_compound": 0.8731
        },
        {
            "id": "hs06p94",
            "score": 1,
            "text": "It’s a very big a complex question with no easy answers. I agree that those that are wealthy should morally take more responsibility for the invention and push towards greener technologies and innovation rather than pushing us to take the full responsibility while they live hypocritically. \nThere is debate about if climate change is even a bad thing. Climate change in itself is not, climate change is inevitable with or without humans, but we are talking about negative human influences on the climate that create unnatural results and there is often debate about what those unnatural results are often times and how severe it is for it to really be a problem. There is also sciences of regeneration that are quite incredible that can make us question our belief in scarcity. I think how we impact the environment is going to be based on more intelligent solutions as we mess things up. There are scientists with PhD’s on both sides that argue different views on climate change. There is no authoritative evidence to suggest that meat consumption, driving vehicles, pollution etc. is bad ENOUGH for it to be a motivator to make drastic change now for everybody. \nI use to whole heartedly believe in some of these documentaries and such such as cowspiracy and the whole slew of them I’ve seen a ton from agriculture to permaculture I try to make the most eco friendly choices and limit plastic consumption I don’t do chemical pesticides. \nThere are wealthy people such as Tony Robbins that is investing a ton of money into lab produced meat that is much healthier for the environment. I think it’s just a process and we have to trust it try to feel inspired to create inventive solutions and ideas and share them with others Inspire others to do the same not much more we can do the modern day well pretty much demands that having a vehicle is a necessity and it’s nearly impossible to avoid plastic consumption. I believe we’ll figure it out and improve our environment in the process. We’ve already made huge environmental improvements since the 1970’s just look at pictures of LA during that time. Stay positive we got this 🤍🙌🏼",
            "title_similarity": "0.7548873",
            "sentiment_compound": 0.9857
        },
        {
            "id": "hsp0hhs",
            "score": 1,
            "text": "Based",
            "title_similarity": "-0.27508122",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht2r2sf",
            "score": 1,
            "text": "You've probably heard the statistic that only 100 companies are responsible for 71% of emissions. \n\nWho buys from these companies? we do. They don't create emissions for fun. Whilst they're the ones choosing to profit off of emissions, we're the ones choosing to buy things knowing 1) didn't need to and 2) there could have been a more climate change friendly option. \n\nA single raindrop doesn't believe he's responsible for the flood. But the flood happens regardless, and it wouldn't have if all the raindrops decided not to flood.",
            "title_similarity": "0.7745377",
            "sentiment_compound": 0.6241
        },
        {
            "id": "hw3zgoa",
            "score": 1,
            "text": "I think this is a particularly interesting point especially following the publishing of a study by the New Climate Institute which states that the world's biggest companies are failing to meet their own targets on tackling climate change.",
            "title_similarity": "0.6914351",
            "sentiment_compound": -0.079
        },
        {
            "id": "hyefgyr",
            "score": 1,
            "text": "Silly. Start small, start anywhere pls.",
            "title_similarity": "-0.030574594",
            "sentiment_compound": 0.1027
        }
    ]
}