{
    "CMV: Baby it’s cold outside is not a date rape song.\nThe song was written in 1944. In those days women were not supposed to be alone in a man’s place by themselves or they were looked at as loose/no morals. The girl wants to stay but doesn’t want her reputation to be tarnished. Drinking in social settings in the house and office (and smoking too) were more common then. Thus the man offering her a drink was not to get her drunk and rape her, but a common courtesy. What’s in this drink was common to say to avoid responsibly for your actions after drinking. The guy wants her to stay, she wants to stay but is worried about what others would think. The censors would also never have approved a rape song. Back in those days Lucy and Desi could not even sleep in the same bed on TV. There is no way a rape song would make it on the air. The only people who have an issue with this song are people who have no concept of history and are placing todays values on an innocent song.\n\nEdit: I wanted to thank everyone who shared their opinions. Some were long and well thought out, some were short but still made a good point and very few were done by angry elves (my Christmas humor). Merry Christmas to everyone!": [
        {
            "id": "hqbh6s6",
            "score": 1,
            "text": "To /u/United_Juggernaut114, **your post is under consideration for removal under our post rules.** \r\n\r\n* You are required to **demonstrate that you're open to changing your mind** (by awarding deltas where appropriate), per [Rule B](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_b). \r\n\r\n---\r\n\r\n**Notice to all users:**\r\n\r\n1. Per **Rule 1**, [**top-level comments must challenge OP's view.**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)\r\n\r\n2. Please **familiarize yourself with** [**our rules**](https://www.reddit.com/r/changemyview/wiki/rules) **and the** [**mod standards**](https://www.reddit.com/r/changemyview/wiki/modstandards). We expect all users *and* mods to abide by these two policies at all times. \r\n\r\n\r\n3. This sub is for changing OP's view. We require that **all** [**top-level comments**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1) **disagree with OP's view**, and that **all other comments** [**be relevant to the conversation**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5).\r\n\r\n4. We understand that some posts may address very contentious issues. Please **report any rule-breaking comments or posts.**\r\n\r\n5. **All users must** [**be respectful**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2) **to one another.**\r\n\r\nIf you have any questions or concerns regarding our rules, please message the mods through [modmail](https://www.reddit.com/message/compose/?to=/r/changemyview) (*not PM*).",
            "title_similarity": "0.41335204",
            "sentiment_compound": 0.6452
        },
        {
            "id": "hptbjny",
            "score": -16,
            "text": "It seems as if you are only arguing that the song wasn't a date rape song in 1944. The problem is, we ain't in 1944 any more.\n\nTo modern ears, it's a song where the guy very obviously wants to have sex with the woman and the woman is telling him no, over and over and over. Eventually it's suggested that he has spiked her drink with something as well. No amount of arguing that in 1944 it was okay not to take no for an answer and to spike drinks makes it ok in 2021. I mean I guess in 10,000 BC it was okay to club her in the back of the head and drag her to your cave.",
            "title_similarity": "0.7833987",
            "sentiment_compound": -0.0191
        },
        {
            "id": "hpt77t2",
            "score": 35,
            "text": ">The girl wants to stay\n\nHow do you know",
            "title_similarity": "0.32500523",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpt6u6i",
            "score": -10,
            "text": "Would you say the Swastika is not offensive because it was originally a religious symbol. And that people that take offense to seeing a swastika have no concept of history and are placing today's values on an innocent symbol? Or do you think that context of the Swastika has change over time and is not a symbol of hate in the west, even if it wasn't originally created to do so?",
            "title_similarity": "0.6293298",
            "sentiment_compound": -0.3442
        },
        {
            "id": "hpt74s9",
            "score": -6,
            "text": "What do you think would happen, if a girl went to a police station and said that she had a few drinks at a guy’s house, fell asleep and she thinks  he did something sexual to her without her consent in 1944?  I think she would probably be labeled as loose and at fault. She probably would be too ashamed to say any thing and would blame herself.\n\nYou can say that the culture was different, but I’d say that try culture was also much more naive and sheltered. Just because now, we are much more aware of worst case scenario and it can see it through that lends, doesn’t mean that it didn’t exist when the song was created.",
            "title_similarity": "0.8323991",
            "sentiment_compound": -0.9219
        },
        {
            "id": "hpthcvr",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpt6k58",
            "score": -15,
            "text": "The dude ignores the woman's protestations, plies her with drinks, gropes her, and pressures her to stay at his place despite her having clearly said no over and over again.\n\nAnd I'm pretty that in the time in which it was written, men pressuring women into sex in this same scenario was not uncommon.",
            "title_similarity": "0.7611992",
            "sentiment_compound": -0.7234
        },
        {
            "id": "hpt9yq1",
            "score": 1694,
            "text": "You're absolutely right. \"Baby It's Cold Outside\" isn't a date rape song. It is however, still problematic.\n\n>The song was written in 1944. In those days women were not supposed to be alone in a man’s place by themselves or they were looked at as loose/no morals.\n\nAnd if the man in the song weren't a completely selfish asshole, he'd recognize she has more to lose than he does and make sure she got home safe.\n\n>Thus the man offering her a drink was not to get her drunk and rape her, but a common courtesy\n\nMy mother will start to worry\nBeautiful what's your hurry?\nMy father will be pacing the floor\nListen to the fireplace roar\nSo really I'd better scurry\nBeautiful please don't hurry\nWell maybe just a half a drink more\nI'll put some records on while I pour\n\nTwo things here. One, he's not addressing her concerns about her parents worrying. He's trying to distract her. That's not common courtesy, that's manipulation. Two, she says \"well maybe just a half a drink more\" indicating she will spend a short time with him. He says \"I'll put some records (plural) on while I pour\" indicating his express desire to lengthen their time together regardless of what she wants. \n\n>What’s in this drink was common to say to avoid responsibly for your actions after drinking.\n\nIt also could just be she was curious what she was drinking. This question isn't really the issue. The issue is his response.\n\nSay what's in this drink?\nNo cabs to be had out there\n\nAgain, he doesn't answer. \n\n\nThere's so many examples in this song of worrisome behavior. Even for 1944. He's not treating her like a person, he's treating her as a means to an end. Even if it's not about date rape, the song's not great. It really doesn't deserve your ardent defense.",
            "title_similarity": "0.95076",
            "sentiment_compound": 0.4161
        },
        {
            "id": "hpuwbtc",
            "score": 1,
            "text": "Here is the problem with your entier argument. The song in questioned, while it may have been writen in the 40s it was still predatory then. The \"male\" lines there called the wolf and the \"female\" the mouse, this already sets up a predatory nature for this song. \n\nYou keep saying the girl \"wants to stay\" yet she clearly doesn't, you also have to take in the fact it is the 40s and women where expected to listen to men and be \"ladylike\" and nice to them. The first two verses she is saying how she wants to leave and he is ignoring her. She uses her mother and father as a means of extra leverage (sadly something women have to do since men refuse to take no for an answer) but then defaults to being ladylike again and placating him by accepting a drink. \n\nHell she even calls him out as being pushy and tells him multiple times no, but instead of taking the No he keeps pushing and forcing until he breaks her down and she stays longer.",
            "title_similarity": "0.7704369",
            "sentiment_compound": -0.9267
        },
        {
            "id": "hptazck",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpt9uhp",
            "score": 2,
            "text": "Not rapey, but homeboy’s def looking to get it in. …..”merry Christmas!”",
            "title_similarity": "0.46057573",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpu03ab",
            "score": 0,
            "text": "At best you can argue it wasn't one then. In 1944. Last I checked it's 2021, and the song is rapey.",
            "title_similarity": "0.3945141",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hptkyu1",
            "score": 11,
            "text": "It doesn't really matter to me if it's interpreted as a date rape song or if you take a more nuanced approach; there are valid arguments for both sides...but either way this song has no business being celebrated in the 21st century. She says \"no\" point blank and the man continues to ignore her and push the issue. Regardless of the reasons behind it, the ONLY message we should be promoting is that \"no\" ALWAYS MEANS \"NO.\" Full stop. There is no negotiation after that. When someone says \"no\" that is the end of the discussion.",
            "title_similarity": "0.6993137",
            "sentiment_compound": -0.8622
        },
        {
            "id": "hptg5or",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hptldrd",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpto3uj",
            "score": 44,
            "text": "I absolutely love this song, but there's one line that troubles me every time I hear it:\n\n\"The answer is no\"\n\nEven in 1944 no meant no.   There's nothing coy or subtle about that, it's not a mixed signal, it's not coded in any way, it's just a blunt no and the song should have ended there.  \n\nImagine that rather than sing it in a beautiful voice Marilyn Maxwell just screamed it at Dean Martin at the top of her lungs and he responded \"but baby it's cold outside.\" Suddenly the rest of the song seems really dark, especially the part where he suggests she will die if she goes outside.  \n\nThere is a latent power dynamic at play.  She's at this guy's house, and she's damned if she does, damned if she doesn't.  The rumors are already swirling and he will control the narrative, not she, no matter what happens.  So she can't scream no at the top of her lungs, but is it really a stretch to say she's screaming it on the inside?",
            "title_similarity": "0.76529646",
            "sentiment_compound": -0.6605
        },
        {
            "id": "hpu5pp4",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpt6fts",
            "score": -21,
            "text": "The author is dead. The context of the song is irrelevant .",
            "title_similarity": "0.32643613",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hptk2n1",
            "score": 68,
            "text": "The term \"date rape\" is first found in print in the 1975 book Against Our Will: Men, Women and Rape by American feminist journalist, author and activist Susan Brownmiller.\n\nIn 1944, the concept of \"date rape\" did not exist, so in a strictly literal sense, it was not written as a \"date rape song\".\n\nWith that said, even though there wasn't that term for it, \"date rape\" or the act of forcing someone on a date to have sex against their will, was allegedly extremely common prior to the 1970s... it is very difficult to find data to back this up because *it was so common that it was not even considered worthy of reporting or tracking.*\n\nThe definition of rape itself was different in the 40s. It was legally impossible, for example, for a wife to be raped by her husband. It was legally impossible for men to be raped. In some places, if a white man had forcible sex with a black woman, it was not legally rape.\n\nWe now also have in society the legal concept of non-forcible rape - that is to say, sexual activity with a person who the law believes does not have the capacity to give consent.\n\nIn the 1940s, a woman who was alone with a man that she was not married to was in a dangerous position both physically and socially. If she was found to have engaged in pre-marital sex, it would literally ruin her life. She would be a shame to her family, and her prospects of marriage would plummet. The man would suffer no consequences.\n\nWhat matters here is that **whether she wants to stay or not, she is clearly stating \"the answer is no\"** and voicing her intention to leave. \"But I could tell she really wanted to\" is not a valid defense against a rape accusation. \n\nSaying \"I'll stay for one more drink\" is not consent.\n\nSaying \"I'll stay for one more cigarette\" is not consent.\n\nSaying \"I really think you're charming, but I have to go\" is not consent. It does not meant that she wants to stay. \n\n**Women who are refusing men's advances still to this day have to pretend that they like the man, but have some other irrefutable reason not to sleep with him, because many men are taught to be persistent, and many men become angry and/or violent when they realize that their persistence is not going to result in consensual sex.**\n\nThere was no consent given, and lots and lots of saying no, but just like in any bar you go into tonight, there will always be that guy who thinks that refusing to take no for an answer makes them charming. \n\nIn summary:  \n\n\n1. There is a wealth of evidence to show that the woman is trying to leave\n2. There is a wealth of evidence to show that the woman is saying \"no\"\n3. There is no evidence that the man intends to let the woman leave\n4. At no point does the man relent in his pursuit of the woman. Instead, he tries new approach after new approach... flattery, pity, concern, poetry and physically moving closer to the woman\n\nWe can't know whether or not the man ever allowed the woman to leave... but any woman can tell you that the woman in this song is in a very dangerous position. If you have never been trapped alone in a room by someone physically stronger than you who wants to have sex with you and literally will not take no for an answer, then you might not know how she felt - but I know how I would feel.\n\nIn the 1940s, this would not have been considered a date rape song, because society did not have the concept of \"date rape\", they only had the concept of \"a woman who allowed herself to be put in a compromising situation\".\n\nThe fact that the male-dominated society did not recognize date rape as a thing does not meant that this song did not *perfectly* capture the moments before a date rape took place - the terrifying moments when a woman realizes that she has no way to escape, and needs to smile politely to avoid angering the man while trying desperately to find a way out of a very dangerous situation.",
            "title_similarity": "0.75520456",
            "sentiment_compound": -0.9979
        },
        {
            "id": "hptgwq7",
            "score": -2,
            "text": "Can it both be a date rape song and not be a date rape song, depending on context?\n\nLike in a 2020s context it is a date rape song, and in a 1940s context it is not a date rape song?",
            "title_similarity": "0.61147934",
            "sentiment_compound": -0.8813
        },
        {
            "id": "hptlul4",
            "score": 14,
            "text": "I think ultimately it doesn’t matter what the original intention is. If we continue to celebrate it we perpetuate the notion that the behavior is okay today.",
            "title_similarity": "0.39506394",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hptkpaj",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpuxwzu",
            "score": 0,
            "text": "I dont have much to say but this; when we talk about what is and is not appropriate, we are referring to the current day, and thus the words \"at that time\" are all but irrelevant in that conversation. I think you'd agree that we used to say and do lots of things, specifically in 1944 for the sake of this conversation, that would absolutely not be acceptable in 2021. What differentiates this song from those things, in that \"this is what it meant in those times\" is a defense of this song, but not, say, the depiction of the crows in Dumbo? (Not to say that the two are equal in any other way, of course. I only mean to illustrate my point that \"it was okay in those times\" isn't a point in favor of that, nor this song)",
            "title_similarity": "0.6967943",
            "sentiment_compound": 0.7942
        },
        {
            "id": "hptmll0",
            "score": 3,
            "text": "I read this to my fiance to see what he thought. He agrees with me that it's about rape because even though date rape might not have been a common concept in the 40s, the song itself is literally about a woman wanting to leave and a man convincing her not to, and also him refusing to tell her what he put in her drink.\n\nIt's problematic.\n\nThe one valid argument against this I can see is that cultural norms were different then (women would be seen as improper/had to worry about what their families thought back then) and this in itself is fucked, because why doesn't the man face any consequences for literally coercing a woman he wants to have sex with to stay with him, when she already said she wants to go?\n\nCultural norms change for a reason - this is no longer acceptable because it should *never have been* in the first place.",
            "title_similarity": "0.83237267",
            "sentiment_compound": -0.9768
        },
        {
            "id": "hptih63",
            "score": 48,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hptetf3",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hptfomy",
            "score": 7,
            "text": "Clarifying question: do you believe there is such a thing as \"rape culture\", and that it was worse in past times than it is now?",
            "title_similarity": "0.49118516",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hptmhey",
            "score": 50,
            "text": "The most problematic part of this song is that if she wanted to stay, the social norms of the time prevented her from just saying so. She couldn't just say yes, I'm staying because that's what I want to do because *that* would have made her appear easy/imprudent. Instead she has to go through the song and dance of making excuses. Then she blames her decision to stay on alcohol (say, what's in this drink?) instead of saying she's staying because she wants to. And the whole back half of the song is about the backlash she's going to face for her decision (My sister will be suspicious/My maiden aunt's mind is vicious/There's bound to be talk tomorrow/At least there will be plenty implied). \n\nThere's nothing in the song about her not staying because she doesn't like him or doesn't want to, only the societal backlash she would face for doing what she wanted.",
            "title_similarity": "0.83454627",
            "sentiment_compound": -0.8435
        },
        {
            "id": "hptfb2w",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hpthxqt",
            "score": 1,
            "text": "Looking at this song from a technical perspective. The main verse is “but baby it’s cold outside”. The guy singing that doesn’t really think she should leave because it’s cold, he really just wants her to stay. Keeping that noted, the entire song is a back and forth on why the girl wants to leave and the guy thinks she should stay, they don’t sing in unison the entire song till the very last line where they both sing “baby it’s cold outside”, which in songwriting, would mean that she’s stayed because they are now on the same page. And now that the girl is saying “it’s cold outside” she doesn’t actually want to stay because it’s cold outside, she wants to stay for him.",
            "title_similarity": "0.77643025",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hptozju",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hpucyn9",
            "score": -1,
            "text": "So without knowing anything I looked up the lyrics. You know fresh perspective and all that. And from my point of view, the song is very... rapey.\n\nYou know the joke: I saved a girl from rape yesterday. How, what did you do? I convinced her.\n\nThat's what the lyrics of this song are. Now to the date rape allegation. First let's bring up the definition : A feature of date rape is that in most cases the victim is female, knows the perpetrator and the rape takes place in the context of an actual or potential romantic or sexual relationship between the parties, or when that relationship has come to an end. The perpetrator may use physical or psychological intimidation to force a victim to have sex against their will, or when the perpetrator has sex with a victim who is incapable of giving consent, for example, because they have been incapacitated by alcohol or other drug. [...]  It is controversial, however, with some people believing the problem is overstated and that many date rape victims are actually willing, consenting participants, and others believing that date rape is seriously underreported and almost all women who claim date rape were actually raped.\n\nSo the feature of date rape is that the victim knows the perpetrator. It happens in the context of an actual or potential romantic relationship in which the sexual relationship would have been seen as appropriate if consensual. The perpetrator may use a physical or psychological intimidation to force a victim to have sex against her will, or when the victim is incapable of giving a consent due to alcohol or other drugs. And it's often viewed as controversial by the broader public where some believe date rape victims are actually consenting participants (by being on date they give consent for example),\n\nSo let's see the greatest offenders in the song :\n\n....\n\n>Well maybe just a half a drink more.\nI'll put some records on while I pour.\nThe neighbors might think.\nBaby it's bad out there.\nSay what's in this drink?\nNo cabs to be had out there.\n\n....\n\nSo as someone who never heard the song I read these lyrics as. The man gave her the alcohol so she wouldn't drive off home (can't drive while intoxicated) and there are no cabs here, so she shouldn't go home. So he just cut off her way out of the situation. \n\n\n....\n\n>Mind if move in closer?\nAt least I'm gonna say that I tried.\nWhat's the sense of hurting my pride?\nI really can't stay.\nBaby don't hold out.\nBaby it's cold outside.\nAh, you're very pushy you know?\nI like to think of it as opportunistic.\n\n....\n\nLet me get close to you, you can't blame a man for trying right? No I'm not pushy, I'm just opportunistic. We get into some physical intimidation here.\n\n...\n\n>I simply must go.\nBaby it's cold outside.\nThe answer is no.\nBut baby it's cold outside.\nThe welcome has been.\n\n...\n\nThe majority of the lyrics are some iteration of \"I must go home\" followed by an excuse as to how she can't go home right now. That checks the psychological intimidation.\n\n....\n\n>There's bound to be talk tomorrow.\nThink of my life long sorrow!\nAt least there will be plenty implied.\nIf you caught pneumonia and died!\nI really can't stay.\nGet over that old out.\n\n.....\n\nYou can't leave otherwise you might die. And how will that look? That I let you go home alone. No, you can't do that to me. That's manipulation.\n\n.....\n\n>Okay fine, just another drink then\nThat took a lot of convincing!\n\nThe point where she finally gives in after an entire song of begging and making excuses as to why she can't leave.\n\nYeah, sounds to me like a textbook example of date rape.\n\n>The guy wants her to stay, she wants to stay but is worried about what others would think. \n\nI read that differently. The whole tone came to me as her being extremely reluctant to stay. One of the reason being it's late and she doesn't want to worry her family.\n\n>There is no way a rape song would make it on the air.\n\nWe didn't think of it as rape back then. That's the scary part and example of how the norms changed. It was thought of as normal that no, doesn't REALLY means no and she needs a bit of convincing. Today we have a word for that. So the real question is was it problematic back then?\n\nDon't know. I wasn't alive back then, but the entire song makes up the guy to be manipulative as fuck. He cuts off her route home. He is trying to distract her and never answers directly and makes constant excuses until she gives in. Ending with the immortal line: That took a lot of convincing!\n\nRapey as fuck.",
            "title_similarity": "0.6576494",
            "sentiment_compound": -0.9984
        },
        {
            "id": "hptugm1",
            "score": 50,
            "text": "[deleted]",
            "title_similarity": "0.017570196"
        },
        {
            "id": "hpte78w",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hpu8whi",
            "score": -3,
            "text": "You’re really close to getting it in your post OP. \n\nYou’re right, in the old days, it was considered improper to be alone with a man. Why?\n\nSure, they want to avoid the perception they had sex. Why? \n\nWhat values are we adhering to here?\n\nIn the 40s, racism was commonplace, coming out meant ostracizing or death, and fundamental religion and conservatism permeated media. If the implication of a woman spending time alone with a man is that she straight up fucked him, because girls can’t be around guys without tempting them into sin, right? \n\nSo now that we’ve established the time period, let’s talk about consent. \n\nThe language at the time notwithstanding, the idea is that if she doesn’t leave, they’re gonna fuck. She expresses more than a few times during the song that that isn’t what she wants, and for the entirety of the song, the dude doesn’t take no for an answer. \n\nIf you were coming up with excuse after excuse to leave a place, and you knew the person trying to keep you there wanted to fuck you, and wouldn’t just say fine and let you leave, would it make you uncomfortable?\n\nAnd so, while he may not be slipping mickeys into her cocktail and waiting until she passes out, he’s still not accepting the “no” and the difference between those who believe this song is about date rape and those who don’t, is that one side of that argument truly believes that “No” actually means “no”",
            "title_similarity": "0.7870251",
            "sentiment_compound": -0.9856
        },
        {
            "id": "hptb2dp",
            "score": 362,
            "text": "I think the original meaning could be argued either way, you've done a good job of your side and I'm sure the other opinion can be just as easily argued. \n\nI think what is more relevant is how it is interpreted today. To my ears, without context, it sounds like the girl is making any excuse possible to get out of there. Is that maybe because those reasons in 1944 would have been much more normal? Yeah sure. But if was talking to a girl like that today and she made 100 excuses as to why she shouldn't stay, I'd be blind to not see she that. \n\nThe swastika argument is a good one, it's not what a symbol actually means, but what it has come to mean, that matters. I think modern covers of Baby It's Cold outside have also tweaked the lyrics to reflect more modern ideas (for example, a girl's family being very protective over her instead of having independence).\n\nRegardless, I don't think this song needs to be \"cancelled\". It's pleasant on the ears and could be called a \"product of it's time\". But intelligent conversations about what you'd actually do in that situation are never a bad thing - because if a girl was at my place and it took constant nagging and alcohol to keep her there, she's probably not having the best time.",
            "title_similarity": "0.65806025",
            "sentiment_compound": 0.8378
        },
        {
            "id": "hpu8hr1",
            "score": 8,
            "text": "When a woman can’t say yes to sex (because of the social repercussions) she also can’t effectively say no to sex (because the guy can just assume that no means yes). The song is rapey because it requires you to point to the culture to assume consent rather than her actual stated desires. \n\nShakespeare wrote plays where the happy ending is a rapist marries his victim. Probably because that keeps the woman’s morals clear. But it opens the door for more victim blaming - was it a rape or a “rape”?\n\nThat’s why sexual liberation is essential for women’s safety.",
            "title_similarity": "0.8017534",
            "sentiment_compound": -0.9019
        },
        {
            "id": "hptiaev",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hptnkt7",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hpttcci",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hptzpso",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpu00iy",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpu4p5w",
            "score": 0,
            "text": "You're not wrong but I'm going to keep saying it because of how much it triggers boomers",
            "title_similarity": "0.36118427",
            "sentiment_compound": 0.1967
        },
        {
            "id": "hpu6u7e",
            "score": 0,
            "text": "I agree with you but I think the best argument against this song is that in the current cultural climate of addressing sexual assault and rape in our society and how the justice system utterly fails it, I think the song can come across insensitive.\n\nI mean look at the scene in \"Bladerunner\" where Decker forces himself on Rachel. When that movie was made, it was scene as \"sexy\" and now it comes across as rape and sexual assault. (HOpefully a more obvious example demonstrates the more subtle argument).\n\nOur time and culture matters to how we perceive things.\n\nThis is why i prefer the song when it's performed non-traditionally. Like when it's a women pursuing a man or even two men or two women. It just takes it out of the current gender dynamics about sexuality and sexual assault.",
            "title_similarity": "0.702981",
            "sentiment_compound": -0.9626
        },
        {
            "id": "hpubmwk",
            "score": 0,
            "text": "The song isnt about rape however it does speak volumes to the culture of coercion that existed and still exists to this day either way.",
            "title_similarity": "0.63390344",
            "sentiment_compound": 0.5773
        },
        {
            "id": "hpui373",
            "score": 0,
            "text": "Morals of the past are still cringe tho",
            "title_similarity": "0.36383453",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpuipsy",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpuyzrk",
            "score": 0,
            "text": "It's.. just a song. It's not that deep bro",
            "title_similarity": "0.2527187",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpvd088",
            "score": 0,
            "text": "**EDIT**, ive read through other answers and saw some of the less favourable interpretations of the song. If those hold any ground, then it's a lot worse than my initial response makes it out to be, but I'll keep it up because i think the conclusion stands either way, stronger even, if its as bad as other responses say  \n\n**Original Answer**\nI think we can agree the song was not written with any ill intentions, most likely its supposed to be a nod at contemporary dating practices, it would be impolite to invite her to stay the night if they're not married, so they're both skirting around the issue looking for excuses.\n\nBut, i think the issue isjt its original intention, i think its that it doesn't sound like that anymore. Its not, in the less conservative parts of the western world at least, an issue for the two to spend a night together, so it sounds more like she's saying, legitimately and sincerely that she needs to or wants to go, and he keeps coming up with reasons she should stay. The repeated nature can make it feel somewhat insistent as well, that doesn't make it sound any better.\n\nSo I would say the issue isnt intention, its the unintentional similarity to some not good behaviour. Speaking as someone who has been sexually assaulted myself, i don't think the song was written to be bad, but once the similarities are pointed out it really does make you uncomfortable, and i can only imagine what it would be like for people whos history matched more closely to the scene the song portrays than mine does.\n\nI don't personally have a problem with people playing it for themselves, if they like it, well yeah, I don't think its written to be about that, but i would 100% prefer they didn't play it out in public, especially not at the frequency it does get played. Public spaces should be public, and that should include the basic consideration of not playing music that makes a significant group of people, who went through a very traumatic event, uncomfortable at best.",
            "title_similarity": "0.7997441",
            "sentiment_compound": 0.2365
        },
        {
            "id": "hpvlpeb",
            "score": 0,
            "text": "It’s quite possible that she’s giving him other reasons not to stay that put the blame on other people and situations beyond her control, (like her parents, or the weather)  because she doesn’t want to put herself in a situation that could become volatile if he got angry at her for rejecting him.",
            "title_similarity": "0.74860966",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hpvppd1",
            "score": 0,
            "text": "I think if it were written today it would be a huge no. At least borderline date rape ey. But at the time it was written in, things were different.",
            "title_similarity": "0.55192316",
            "sentiment_compound": -0.296
        },
        {
            "id": "hpw2y0p",
            "score": 0,
            "text": "This is my favorite christmas song, and you just changed my whole view on it. Still, I don't think it's a Christmas rape song, but it kinda is problematic.",
            "title_similarity": "0.669075",
            "sentiment_compound": -0.6466
        },
        {
            "id": "hpw4pa7",
            "score": 0,
            "text": "I'm late to this party, so this will get buried, but here's a go anyway. In order to understand the extent to which this song is rapey, you have to have a solid understanding of consent. It's important to understand sexual consent because [sexual activity without consent is sexual assault](https://en.wikipedia.org/wiki/Sexual_assault). Here are some common misconceptions about sexual consent, corrected.\n\n* [**\"Token resistance\" to sex is virtually nonexistent, particularly for first encounters**](http://journals.sagepub.com/doi/abs/10.1111/j.1471-6402.1998.tb00167.x). The overwhelming majority of men and women who say no to sexual advances really do mean no. It's **never** reasonable to assume that when someone says no, they don't really mean it (unless you have previously mutually agreed to role-play and have decided on an alternative safe word, in which case it's not an assumption) [even if the person has sent extremely \"mixed signals,\"](http://journals.sagepub.com/doi/abs/10.1177/0886260517699948) or even [engaged in some sexual contact](https://www.rainn.org/articles/what-is-consent) ([as many sexual offenses often entail](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4484276/)).\n\n* **[An overwhelming majority of people require *explicit*](http://www.jstor.org/stable/pdf/20620316.pdf?refreqid=excelsior%3A35795183e914dfef5bad76292e6e685f) (i.e. [unambiguous](https://www.merriam-webster.com/dictionary/explicit)) consent for any sexual activity beyond kissing in a new relationship**. However, [even an unwanted kiss can be fatal if the person being advanced upon feels unsafe due to a large discrepancy in size/strength](https://www.independent.co.uk/news/world/americas/gay-panic-austin-james-miller-texas-man-cleared-murder-a8327261.html).\n\n* [As in other social interactions, **sexual rejections typically are communicated with softened language**](http://journals.sagepub.com/doi/abs/10.1177/0957926599010003002) (\"Next time,\" \"Let's just chill,\" \"I really like you, but...\") [**and often don't even include the word \"no.\"**](http://journals.sagepub.com/doi/abs/10.1177/0957926599010003002) These rejections [are still rejections](https://apps.rainn.org/policy/policy-crime-definitions.cfm?state=Montana&group=9), and any subsequent sexual activity [is still sexual assault](https://apps.rainn.org/policy/policy-crime-definitions.cfm?state=Nebraska&group=9). Both men and women [are capable of understanding these types of refusals, and to pretend otherwise is disengenuous](https://yesmeansyesblog.wordpress.com/2011/03/21/mythcommunication-its-not-that-they-dont-understand-they-just-dont-like-the-answer/). Perpetrators often [misrepresent their own actions to garner support, avoid responsibility, blame the victim, and conceal their activities](http://journals.sagepub.com/doi/pdf/10.1177/0957926504045031), and [re-labeling sexual assault or rape as a \"miscommunication\" accomplishes those goals](http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.360.5138&rep=rep1&type=pdf). It may not be a good idea to recommend to someone that they try to communicate more forcefully, because [like domestic abusers, rapists often feel provoked by blows to their self-esteem](http://www.emotionalcompetency.com/papers/baumeistersmartboden1996[1].pdf), so encouraging someone to communicate in ways [that are considered rude](https://is.muni.cz/el/1423/podzim2010/GEN144/um/KITZINGER_FRITH_Just_Say_No.pdf) could actually lead them to danger. Sex offenders are [more likely to be physically violent](http://www.innovations.harvard.edu/sites/default/files/134851.pdf), and [1 in 4 women and 1 in 7 men has experienced severe physical violence by an intimate partner](https://www.cdc.gov/violenceprevention/nisvs/infographic.html), so it is far from outrageous to take precautions against physical violence by being polite. Both rape and violence against women were more common, not less, in 1944. \n\n* [**Wearing someone down by repeatedly asking for sex until they \"consent\" to sex is a form of coercion, not consent**. Some forms of coercion are also illegal in some jurisdictions](https://www.cdc.gov/violenceprevention/pdf/NISVS-StateReportBook.pdf). Genuine consent [must](https://apps.rainn.org/policy/policy-crime-definitions.cfm?state=Wisconsin&group=9) be [freely given](https://apps.rainn.org/policy/policy-crime-definitions.cfm?state=Minnesota&group=9), or a [human rights violation has occurred](https://en.wikipedia.org/wiki/Human_rights#Sexual_and_reproductive_rights). \n\nThis shit matters. Women were in a bind in 1944 with the social mores of the time. That was not good for women, and almost certainly led to more rapes:\n\n> [convicted male rapists have demonstrated higher levels of conservative gender role beliefs](https://academics.rowan.edu/csm/departments/psychology/assert/documents/AngeloneMitchellandGrossi2015.pdf)\n\nOffenders often [rationalize their behavior](https://www.jstor.org/stable/pdf/3053901.pdf?casa_token=UuYDZaA8LCIAAAAA:HnHjgy9A4thcjrpWDunYAu1Bea3xepmkYCxoA1EPgc5X5cer7cvxOF1xxo6WMenj6bDqYrlXUZ5UkNrWt-vVubhKpsIN47pN0zlIEFbCk-cMx3GCgSQZ) by whether society will let them get away with it. Does this song let date rapists think they can get away with it? That's the right metric to use to evaluate whether *Baby it's cold outside* is a date rape song.",
            "title_similarity": "0.7291109",
            "sentiment_compound": -0.9983
        },
        {
            "id": "hpt7plp",
            "score": 1644,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hptrkhz",
            "score": 8,
            "text": "Let me ask a different question:\n\nLet's imagine that the evening in question *did* proceed to a date rape.  \n\nWould people in general be more, or less, inclined towards victim blaming if they heard that the dialog in the song took place that evening than if they didn't?\n\nHonestly, I think *that*, more than anything else, is what people find kind of shitty and \"date rapey\" about it.\n\nThe number of people defending the depicted behavior in this thread leads me to *strongly* believe that it would encourage that kind of victim blaming. E.g. \"she obviously wanted it\".",
            "title_similarity": "0.7240866",
            "sentiment_compound": -0.9433
        },
        {
            "id": "hpttd9x",
            "score": 16,
            "text": "I don't know if this contributes meaningfully enough to this discussion to avoid being deleted, but I just wanted to point out that the phrase,\n\n\"Say, what's in this drink\"\n\nrefers to the fact that he made the cocktail himself, not that she somehow detected a date rape drug in it. Many affluent men at the time would have a small cocktail bar or cabinet for entertaining. Even if they didn't drink much or at all, being able to offer something to visitors was considered common courtesy. \n\nHave you noticed how many TV shows and movies show CEOs or mafia bosses and whatnot pouring a finger or two of liquor from a wet bar *in their work office* and offering something to the protagonist even if they're at odds? (Another famous example, Tony offers Loki a drink.) That's a cultural holdover from what was a widespread cultural norm for a middle class or above person in most of the West. \n\nShe's just basically asking, \"This is good, what's your recipe?\" It was a common compliment to being served a drink when you didn't specify what you wanted. Like saying, \"Who's your tailor?\" to compliment someone's outfit (another phrase that no one says anymore). It's just another one of those turns of phrase that everyone used to know until they didn't.\n\nI could go on for an hour about how ahistorically scapegoating this song is ridiculous, but it looks like most of the defending comments are covering the ground well enough. I just noticed that many detractors seem to point to this line *specifically* as problematic and no one had yet addressed that this was a very mundane exchange of common pleasantries rather than the panicked realization of a lady in mortal danger.\n\nCarry on.",
            "title_similarity": "0.74942577",
            "sentiment_compound": 0.3485
        },
        {
            "id": "hpuikna",
            "score": 6,
            "text": "This is all true, but knowing the history logically doesn’t necessarily mean there won’t be an emotional reaction to lyrics that sound wildly inappropriate in today’s vernacular. No matter what I know about the song, it will always conjure uncomfortable feelings when I hear “the answer is no” followed quickly by complete disregard. So, I don’t expect you to change your mind that the song wasn’t written as a date rape song, but I think it’s more than fair to understand how the lyrics could be triggering to a modern audience. To someone with PTSD from date rape, there’s a very good chance that’s all they’ll be able to think about when they hear it, and thus to them it IS a date rape song.",
            "title_similarity": "0.77471197",
            "sentiment_compound": -0.9472
        },
        {
            "id": "hptl9u4",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hptunnd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hptw34m",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hptwb6b",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hptzeuz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hpu2m85",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hpu2o2m",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hpu4qzv",
            "score": 1,
            "text": "The problem is the song’s ambiguity, especially when viewed through the lens of today’s stance on explicit consent. Modern discussion of sexual assault has to include an admission that coercion can take many shapes.\n\nNo, there is nothing in the song that *explicitly* mentions rape, and you can certainly make an argument that she is “playing hard to get” or “maintaining social propriety norms of the times”. However, there are too many instances of (women) having undesired sex due to non-physical and non-chemical, but, mostly, social pressure. And this song definitely fits that narrative. \n\nSo, do I think we should ban this song? No. Can we still enjoy the music and excellent performances? Absolutely. But!…\n\nWe should be willing to admit, both to ourselves and in open discussion, that the ambiguity in the implied consent as portrayed in the song is problematic in today’s world, just as it most likely was in 1944. This song is an excellent example of how *not* to behave. If we want to decrease sexual assault, we must figure out a way to flirt without sending mixed messages or exerting gentle pressures, as portrayed in this song. Because, just as it was in 1944, mixed messages [remain a problem](https://youtu.be/GZ3QHTpMZgQ).",
            "title_similarity": "0.74716353",
            "sentiment_compound": 0.4314
        },
        {
            "id": "hpubsku",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hpulitr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hpulx93",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hpuxp7m",
            "score": -1,
            "text": "I think this is a ridiculous subject to even ponder. I think there are subjects more important to think about than what the song means. Can no one talk with context about these things? No one wants to fight over a 1940s Christmas song anymore. It had its day we heard its movement and now we have moved on because we know it’s ridiculous. If we have morals, or ethics, or spirituality, or religion, or not then this topic would still not be at the top of the list of things to need closure on after years of having the same conversation? I’m sure everybody’s made their mind up about it by now. Let’s talk about Bill Cosby, that’s what date rape really looks like!",
            "title_similarity": "0.6954355",
            "sentiment_compound": -0.8548
        },
        {
            "id": "hpv28jo",
            "score": -1,
            "text": "Song is not good either way. I can't believe people actually unironically listen to Christmas music.",
            "title_similarity": "0.58801526",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hpv2voi",
            "score": -1,
            "text": "How do we know\n\n>  The girl wants to stay\n\n?",
            "title_similarity": "0.33840004",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpv6vbc",
            "score": -1,
            "text": "You make a good point, but, literally, the last two lines of the song are: \n\n>Okay fine, just another drink then  \n\n>That took a lot of convincing!",
            "title_similarity": "0.524648",
            "sentiment_compound": 0.8534
        },
        {
            "id": "hpvce5m",
            "score": -1,
            "text": "Imagine living in the 40's as a 20 yr old woman lmao fucking awful",
            "title_similarity": "0.41861376",
            "sentiment_compound": 0.1548
        },
        {
            "id": "hpvd7j3",
            "score": -1,
            "text": "Look at ops post history and think about who is asking this question",
            "title_similarity": "0.21558216",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpvfhcw",
            "score": -1,
            "text": "Well, it was the era of, \"Your lips say no, but your eyes say yes.\" That song is rapey as hell, but even now days some consider it fun to badger and get aggressive with a woman  for sex when after all, she\"s asking for it by being alone with him. I'm surprised anyone hears this song and thinks it's just flirty. Ever see the trope of the boss chasing the secretary around his desk? The culture saw things as it's up to women not to lead men on. Sometimes that meant saying hello or would you like another coffee.",
            "title_similarity": "0.7663684",
            "sentiment_compound": 0.6428
        },
        {
            "id": "hpw5tj2",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hpuvv90",
            "score": 15,
            "text": "Hi /u/United_Juggernaut114! You're not in trouble, don't worry. This is just a **Rules Reminder for All Users.** \n\n---\n\n**All users, (including mods, OP, and commenters) are required to follow the rules of this sub at all times.** If you see a user violate the rules of the sub, please report that comment/post and a human moderator will review it. We understand that some topics posted here may touch on sensitive or contentious issues. We ask that all users **remember the human** and **assume good faith**. \n\n**Notice to all users:**\n\n1. Per **Rule 1**, [**top-level comments must challenge OP's view.**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)\n\n2. Please **familiarize yourself with** [**our rules**](https://www.reddit.com/r/changemyview/wiki/rules) **and the** [**mod standards**](https://www.reddit.com/r/changemyview/wiki/modstandards). We expect all users *and* mods to abide by these two policies at all times. \n\n\n3. This sub is for changing OP's view. We require that **all** [**top-level comments**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1) **disagree with OP's view**, and that **all other comments** [**be relevant to the conversation**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_5).\n\n4. We understand that some posts may address very contentious issues. Please **report any rule-breaking comments or posts.**\n\n5. **All users must** [**be respectful**](https://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_2) **to one another.**\n\nIf you have any questions or concerns regarding our rules, please message the mods through [modmail](https://www.reddit.com/message/compose/?to=/r/changemyview) (*not PM*).",
            "title_similarity": "0.47600055",
            "sentiment_compound": 0.8371
        },
        {
            "id": "hptb98q",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hptos2u",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hpu3988",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hpugdcf",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hpvm067",
            "score": 2,
            "text": "Can't change the truth.",
            "title_similarity": "0.1560501",
            "sentiment_compound": -0.2411
        },
        {
            "id": "hpvsrp1",
            "score": 2,
            "text": "I hated when last year they made this song into something like a bad thing\n\nIts like fuck people come on. Its a song. If you dont like it, dont listen to it.\n\nNo big deal.\n\nBut ohhhh nnoooooo it means this and that and whatever etc.\n\nTimes change. People need to as well.",
            "title_similarity": "0.6680907",
            "sentiment_compound": -0.4775
        },
        {
            "id": "hpvvhn0",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hptj2iy",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hptbit2",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hptm6wg",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpvpknw",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.0054387283"
        },
        {
            "id": "hptlamg",
            "score": 19,
            "text": "I think \"Death of the Author\" is a concept that could apply here.\n\nHistorical context and cultural norms don't matter here. The song is about rape to some because others interpret it that way.\n\nBut I think there is a better way to explain what is wrong with the song in general.\n\nFor those that claim the song is about rape, saying that times have changed is the wrong argument. Saying that the man in the song is pushy and that's what makes it rape-y is the wrong argument. The feeling about the song being sexist is correct though, but it isn't because of the direct lyrics. The fact that the woman is expected to put up a show, but not the man, is a reflection of just how ingrained sexism is in 1940's culture. Things become more disturbing if we imagine the woman actually wanted to leave. How would she communicate this effectively if the man is always under the assumption that he knows what the woman wants.\n\nI don't think the song is about rape. But it certainly paints the picture for what 1940's sexism looked like.\n\n(To be clear, I am not arguing that the man in the song is being a sexist, or that he hates women, but rather the cultural norms and expectations for men and women were structured in a sexist way.)",
            "title_similarity": "0.7560345",
            "sentiment_compound": -0.9833
        },
        {
            "id": "hpuh2k7",
            "score": 5,
            "text": "It's not so black and white.\n\nI don't think when it was written someone was thinking \"I'll write a song about how I might rape a woman\". Rather I think the pressure applied speaks to a cultural attitude towards consent and the treatment of women, and it certainly heads into dark waters. If someone were to actually behave, in the present day, in the way described in the song then I think we'd all look at it and think \"No...don't do that\".\n\nI suppose where I have some sympathy is that I don't think art like this is ruined by looking bad under a modern moral lens. It's okay to enjoy the light-hearted nature with which the song is intended, or to appreciate the superficial frivolity of it, but I do think it's important that when we analyse art in culture we see what attitudes are reflected in it. And \"It's cold outside\" certainly embodies some attitudes I think we're better of moving past.",
            "title_similarity": "0.7707265",
            "sentiment_compound": 0.7989
        },
        {
            "id": "hpthg6e",
            "score": 30,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hptch18",
            "score": 84,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hptinm7",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hptzv3o",
            "score": 14,
            "text": "Ok so I’m not sure if this breaks the rules because I’m ~95% on board with your argument here. However, there is exactly one point that I know for a fact you’re wrong about. \n\n>The censors would never have approved a rape song. \n\nIn the musical ‘seven brides for seven brothers’ one of the big musical numbers is titled ‘sobbin women.’  In context of the film it’s how 1 brother convinces the rest to go into town and abduct a half dozen women from their families.  Outside of that context the song refers to the rape of the Sabine women (sabine-sobbin) which is when early Rome invaded nearby less powerful cities just to abduct women, since they felt they didn’t have enough.  \n\nSo yes in the 1940s Hollywood censors 100% absolutely did approve at least 1 song explicitly about rape, which was used to justify the abduction of women.  The more you know.",
            "title_similarity": "0.68945134",
            "sentiment_compound": -0.9737
        },
        {
            "id": "hpu0ujs",
            "score": 1,
            "text": "I agree that it's not, but I also totally get why people today think it is.  And perception is everything.",
            "title_similarity": "0.30768776",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hpu2n9d",
            "score": 3,
            "text": "Others have said it well: it's provably not a date rape song, but it's still problematic. You said people are ignoring the history of it, when the truth is most young people who hear it will hear it *without* it's context on the radio. It is bringing back problematic values (woman aren't allowed to be openly sexual, men should be persistent to a dubious consent extent) in a modern age, things that the youth would not have even thought of until they hear the song for the first time. \n\nThat said, I love the song lol. I just think it's important to acknowledge why it's an uncomfortable song nowadays, whether there's context or not. For example, even as a kid, I hated Santa Baby which is outright about women being gold diggers and old men being sugar daddies. Sure, the intent is probably more fun than that, but the point is an innocent intent doesn't actually make it okay and still feeds unconscious bias.",
            "title_similarity": "0.79981685",
            "sentiment_compound": 0.8875
        },
        {
            "id": "hpu9rpx",
            "score": 1,
            "text": "It's not that it was intended to be that - and ultimately it isn't a date rape song. That being said, the idea that you have to understand historical context to truly understand their conversation not being problematic is in itself a problem. \n\nWhile I can acknowledge that it clearly wasn't written to project a questionable message, in today's context, it definitely sounds like a creepy guy who ignores a woman saying 'no' multiple times. Given that, we should be open to accepting that while the past context does give it different meaning, we can still learn from how that message would be taken in today's time. \n\nSo really, it's a bit of both. Perception and context add nuance to shift it one way or the other, so I think people who argue for either side as if it's unequivocally one or the other are wrong.",
            "title_similarity": "0.76487136",
            "sentiment_compound": 0.7932
        },
        {
            "id": "hpuidbt",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpuljhp",
            "score": 2,
            "text": "The song is famous for being in a movie twice. The second time the genders are reversed and she is getting the man to stay with the same lyrics.",
            "title_similarity": "0.5892233",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpuqcw7",
            "score": 2,
            "text": "So the song was written by a husband and wife (Frank Loesser and Lynn Garland ) who would sing it as a “ok time for you to go home from our party” so it’s definitively not a rapey song, our modern interpretation is just awful. It’s written explicitly as an end of the evening song and the irony is that the two people singing it are the only ones who wouldn’t be going to the cold outside - because they were in their own home already!",
            "title_similarity": "0.76893926",
            "sentiment_compound": -0.5411
        },
        {
            "id": "hpv7ge2",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpvgecu",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpvh9or",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpvquky",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpvzfz9",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpw0lct",
            "score": 6,
            "text": "There is no way the song was enjoyed for more than half a century with an understood implication that the woman was there under duress. \n\nThe song quite clearly is about a common wintertime affair of using the weather as an excuse to spend more time together.  \n\nThe horrific lack of agency of women in that time was not displayed by her inability to leave because of the pressure placed by the man, but by the implication that she would be judged for staying. \n\nThose who feel this song is inappropriate in today's context are justified in their position, but someone who enjoys the song isn't condoning sexual assault.",
            "title_similarity": "0.8555404",
            "sentiment_compound": 0.8722
        },
        {
            "id": "hpw6l76",
            "score": 2,
            "text": "Honestly I’ve never heard anyone outside the internet complain about the song. I was surprised with all the controversy surrounding the song how often I’ve heard the song played on the holiday radio station I’ve been listening to. They play the song constantly. Christmas is a very traditional holiday and once a song is added into the holiday cannon it’s almost impossible to get radio stations to stop playing it.",
            "title_similarity": "0.61740994",
            "sentiment_compound": 0.9213
        },
        {
            "id": "hpwabiz",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpwhvk1",
            "score": 1,
            "text": "Without knowing the composer’s intent, I think that the song is lended meaning, and contextualized, by the way in which it is performed.\n\nThat means that the woman is as eager and in control (or as weak and demure) as the character that the singer develops and performs, and the man is as rapey and manipulative (or as kind and charming) as the character that that singer develops and performs.\n\nAs many have mentioned, the words themselves can kind of go either way, based upon cultural context, etc.\n\nSo, it’s up to the performers to clarify, through tone of voice and relationship, what is happening.\n\nAs an example.  Many of the modern recordings have female singers that have a VERY specific tonality when they say ‘hey, what’s in this drink?’  It’s an accusing tonality, very much as a modern person might confront somebody if they thought they were being drugged.  That choice is then almost immediately dropped, because the song doesn’t get awkward, she returns to wanting to being playful.  \n\nSo, which are and which are not effective artistic choices is, to me, the only relevant question.  Again, without the composer here to ask, all we can do is interpret — both through textual analysis and by listening to and watching performances that offer different viewpoints through the different ways in which the scene is played.",
            "title_similarity": "0.63911283",
            "sentiment_compound": 0.7612
        },
        {
            "id": "hpwnykb",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.0054386854"
        },
        {
            "id": "hpwrgjp",
            "score": 2,
            "text": "It’s obvious. Anybody thinks it is has never been raped. The song doesn’t mention forcible sex.",
            "title_similarity": "0.451258",
            "sentiment_compound": 0.5667
        },
        {
            "id": "hpwv91n",
            "score": 1,
            "text": "I genuinely always thought it was a creepy song, thank you for explaining things further :> /gen",
            "title_similarity": "0.45022437",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hpx1ibn",
            "score": 1,
            "text": "There was an episode of I Love Lucy where Ricky is is worried that Lucy is going to come down to the club where he works to disrupt the show again because she wants to be a star. Ricky is explaining his concerns to Fred. Fred responds \"Well, why don't you slip her a mickey?\" \n\nThat phrase was associated with date rape drugs in the 50s. Fred even had to use some \"connections\" to find some. \n\nTV censors only worried that things wouldn't be too obvious back then. If you did things in a way that would be missed by a younger audience but if it was subtle enough to be understood by the adults it was okay.",
            "title_similarity": "0.7722771",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hpx1ur3",
            "score": 1,
            "text": "It's a \"because of the implication\" song",
            "title_similarity": "0.22146842",
            "sentiment_compound": 0.0
        },
        {
            "id": "hq3hg3p",
            "score": 1,
            "text": "Yeah, but we're listening to it now, not back then. It might've been pretty coy back then, but even when you know the history of the song, because definitions and meanings change over time, it can be interpreted as a rapey song now.",
            "title_similarity": "0.6310061",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hrxis45",
            "score": 1,
            "text": "Finally, somebody gets it.",
            "title_similarity": "-0.032326613",
            "sentiment_compound": 0.0
        },
        {
            "id": "hsg11gj",
            "score": 1,
            "text": "Every song is a rape song if you believe.",
            "title_similarity": "0.3726683",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hsljguu",
            "score": 1,
            "text": "Still a very cringey song. Reminds me of the episode of family guys where he says 10 no’s and a yes is still a yes",
            "title_similarity": "0.46644294",
            "sentiment_compound": 0.6597
        }
    ]
}