{
    "CMV: Russia should be banned from all sporting events, international travel, maybe even property seizure due to them invading a sovereign country.\nI understand many Europeans rely on Russian exports (especially oil) so trade restrictions are difficult. And if I recall, they are only excluded for doping violations at the Olympics. Plus there is an inconsistent application to property seizure and I don't think travel is restricted for most.\n\n  \nInvading a sovereign country should immediately have consequences.\n\nEnforcing this would be difficult. But I imagine most democratic countries working as a group would sign on immediately. The same democratic countries that enjoy healthy tourism and investments from Russia. Or maybe it already exists and is not enforced.": [
        {
            "id": "hy91hsf",
            "score": 1,
            "text": "/u/JohnOfA (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/t0dn7j/deltas_awarded_in_cmv_russia_should_be_banned/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.68496776",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hy9cr2l",
            "score": 6,
            "text": "Russia should’ve been banned from all sporting events the past couple years to send a message about doping",
            "title_similarity": "0.78451985",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hy8onve",
            "score": 170,
            "text": ">Invading a sovereign country should immediately have consequences.\n\nSo, you would support the US getting all the same consequences for all the bullshit we pulled in the middle east? Or Syria.....Or Libya?",
            "title_similarity": "0.70255804",
            "sentiment_compound": -0.3527
        },
        {
            "id": "hy976cb",
            "score": -12,
            "text": "Ukraine was not a sovereign country, it was a vassal state of the USA. All large nations do this, they use insane amounts of money/weapons to cause regime change in smaller countries.\n\nIts fine to be morally outraged by that but to only be outraged when russia does it shows you have just been succesfully propagandized by the US state department.\n\n\nAlso, if you say \"when USA does it its peacekeeping\", you should realize that every single war in the history of the world was claimed to be defensive by both sides. Even caesar did this when he invaded gaul.",
            "title_similarity": "0.85469234",
            "sentiment_compound": -0.8641
        },
        {
            "id": "hyaegfw",
            "score": 2,
            "text": ">Invading a sovereign country should immediately have consequences.\n\nBut... Why?\n\nDon't get me wrong, I'm not defending Russia here. But why should Russia be faced with consequences when the USA has been doing whatever the fuck it wants for the last... 60 years? Under false pretences and whatnot.",
            "title_similarity": "0.78425467",
            "sentiment_compound": -0.4174
        },
        {
            "id": "hyas4o1",
            "score": 20,
            "text": ">Invading a sovereign country should immediately have consequences.\n\nRight, who's going to levy those consequences on the US and NATO for their various invasions of various Middle Eastern countries?\n\nIf Russia is to be punished for their invasion of Ukraine, then what that means is that international law is merely the whims of whoever the president of the US is. The world effectively becomes a massive imperial holding for the US. \n\nEither the US and the various Western states should be subjected to the same costs, or nobody should be subjected to costs. \n\nEither you have a consistent rules-based international order, or you have an anarchic realist hellscape. The former is normatively better, but the latter is more realistic. As it stands, the US acts as if it exists in the latter under the guise of the former. To argue that Russia should be subject to sanctions or similar is hypocrisy belying a deeper belief in American global supremacy.",
            "title_similarity": "0.84896195",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hy8zocq",
            "score": 11,
            "text": "The thing is, there is no advanced/big country which has clean hands.\n\nThis should be applied to America and China as well.  \n\nAmerica's acts are common knowledge.\n\nChina has also annexed Tibet, and is pressurizing India to give one of India's states to it.\n\nDemocracy does not exist in this world. It's still a hierarchy. And there's no way to punish the perpetrators.",
            "title_similarity": "0.6933579",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hya4z3s",
            "score": -1,
            "text": "Ukraine is not a member of NATO. So we can only provide supplies. Wish we could help somehow....",
            "title_similarity": "0.57137907",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hyar52w",
            "score": 49,
            "text": ">Invading a sovereign country should immediately have consequences.\n\nYou're right. Lets start with Bush Jrs invasion of Iraq under the pretense of nukes(which turned out to be a filthy lie). Time to ban all American athletes from the Olympics because they fell for the propaganda of their government. /s\n\nPutin is doing what Bush jr and so many others have before. Lie, invade, murder and steal. \n\nPunishing atheletes who are adored by citizens of a nation won't stop the leaders, it would create a bigger rift and increase support for the warmonger by alienating the countrys inhabitants on the international scene.\n\nI can't see how banning international flight would do any good.",
            "title_similarity": "0.86356646",
            "sentiment_compound": -0.8523
        },
        {
            "id": "hy8r7c1",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.091086656"
        },
        {
            "id": "hyackc4",
            "score": -5,
            "text": "Nope, not going to change your view. You are absolutely correct. No Russian vessel making port. No Russian plane to land. No Rubel to be exchanged. Cut off the pipelines and stop accepting Russian Gas. Reroute all flights to avoid Russian airspace. No visa for Russian citizens. Seize all Russian owned assets. Expel all Russian diplomats. Threaten all countries that help to circumvent these measures with alike sanctions. See how long Putin will last.",
            "title_similarity": "0.7589092",
            "sentiment_compound": -0.9017
        },
        {
            "id": "hy9az0f",
            "score": -7,
            "text": "This could lead to Russian economic retaliation via oil. Do we really want them making our gas prices go up even more? What do you really care more about - some foreign country halfway around the world or your own pocketbook and that of your neighbor? It just isn't neighborly for you to make me pay more for gas. That's what really matters",
            "title_similarity": "0.74252546",
            "sentiment_compound": 0.664
        },
        {
            "id": "hy8uhcv",
            "score": 161,
            "text": "The people of a nation are not its tyrannical government. Banning Russia from the olympics punishes people who have nothing to do with the military operations going on right now, and the amount of people that participate in the olypmics globally are insubstantial such that it's needlessly cruel and causes more break down in relations than it solves.\n\nWWI ended with the treaty of Versailles which showed that if you are ultra punitive, people will seek out a leader that will solve their problems shortsightedly and it will breed more conflict.\n\nSanctions are appropriate because they are a tool to cause civil unrest and stop wars before they begin. There is a very obvious and strategic end goal to sanctions that is preferable to violence. Compared to a ban from the olympics, this stands to save many people from harm in due time. It is much more appropriate.",
            "title_similarity": "0.8957671",
            "sentiment_compound": -0.9785
        },
        {
            "id": "hyb3mu0",
            "score": 0,
            "text": ">Invading a sovereign country should immediately have consequences.\n\nWhy?\n\nUp until 5 minutes ago (all of history) this is the norm. It how the US was created. Its how most modern nations were created. We (most modern nations) just happen to like the outcomes from said wars and want to freeze in place where we are. Why? Because its advantageous to us. Nobody cares if say \n\nhttps://www.thebusinessyear.com/4-conflicts-in-africa-2021-rage-alongside-covid-19/focus\n\nAfrica has conflicts.",
            "title_similarity": "0.71459156",
            "sentiment_compound": 0.6868
        },
        {
            "id": "hybnzxd",
            "score": 0,
            "text": "What about when the US invaded Iraq?",
            "title_similarity": "0.35743913",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybxm8c",
            "score": 0,
            "text": "Why isn't USA banned from all sports for all the countries it invaded?",
            "title_similarity": "0.73231554",
            "sentiment_compound": 0.357
        },
        {
            "id": "hycfopr",
            "score": 0,
            "text": "You don't go far enough. We should be propping up separatist movements within Russia and allowing them -- and Ukraine -- into NATO. We should play by Russia's rules. Their justification for annexing crimea was a population that sympathized with Russia. By that logic, we should liberate any part of Russia that opposes authoritarianism.\n\nI'm sick of kid gloves for Russia just cause they have nukes.",
            "title_similarity": "0.8552009",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hyaybx9",
            "score": 10,
            "text": "Is this standard to be applied to countries *other than Russia* as well? And who decides whether or not the cause for invasion is justified or not?\n\nThe US invaded Iraq in 2003 for example, much to the chagrin of much of the global community including many western countries. Evidence after the fact shows that the US never had concrete evidence of weapons of mass destruction, and lied to the UN General Assembly over it and invaded anyways despite calls for them not to. If the standard you propose is to be applied to Russia over its invasion of the Ukraine, should it not also be applied to the United States and the United Kingdom when they decide to engage in military action?\n\nThat's only the tip of the iceberg as well - the US and UK have long histories of invading sovereign countries to achieve political or economic aims, and have done so many many times throughout the 20th and 21st centuries. The US also currently provide military and logistic support to countries like Saudi Arabia, which is engaged in a war against Yemen, and have ground troops in Yemen, as does the UK.\n\nI imagine most citizens of Western countries would not be all too pleased if they were held to the standard they demand of citizens in other countries when their own governments act out of line or engage in unprovoked warfare. As others have noted, punishing citizens of those countries also doesn't really solve the problems being created by their governments anyways. At best this inconveniences a lot of people who were probably not asking for trouble anyways, and at worst it could radicalize them in favour of their country's government that you are trying to take down with policies like these.",
            "title_similarity": "0.81447744",
            "sentiment_compound": 0.8087
        },
        {
            "id": "hy8ow7n",
            "score": 1355,
            "text": "So you're saying that rather than affect any of the governmental decision-makers, that countries should go after random Russians who don't want to be in Russia? Banning from sporting events and international travel doesn't affect the oligarchs. Property seizure of those oligarchs is tantamount to declaring war, and property seizure of other non-oligarch Russians does nothing.\n\nYou can't hurt the government by hurting its people if the government doesn't give a shit about its people.",
            "title_similarity": "0.7872275",
            "sentiment_compound": -0.7361
        },
        {
            "id": "hy9l929",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.091086656"
        },
        {
            "id": "hyadtsl",
            "score": 1,
            "text": "Yoo man what are you smoking? Should we round them up in camps and force them to work till they die as well? Or just deporting them after we sieze everything they own? Or just leave them homeless and unable to return to there home? I don't know where are you from or how were you raised but you should never punish people for what there country does. They did not do it!!!",
            "title_similarity": "0.7312981",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hyb66yn",
            "score": 1,
            "text": "I think that it is no longer in the American cultural memory that the USSR, at least towards the end, was helped along towards a transformation away from Stalinism at least in part because the USSR was cognizant of how much disparity there was between the average standard of living there relative to modest cities in the West.    \n\n\nSupposedly, Boris Yeltsin's visit to a supermarket in the US had a dramatic impact on the man.  \n\n\nhttps://www.nhregister.com/neighborhood/bayarea/news/article/When-Boris-Yeltsin-went-grocery-shopping-in-Clear-5759129.php",
            "title_similarity": "0.66545624",
            "sentiment_compound": -0.296
        },
        {
            "id": "hyb7o74",
            "score": -1,
            "text": "I disagree with the deltas awarded here.   \n\n\nIf the people hurt enough, maybe they will get smart/wise and revolt against their corrupt leaders. Or it reveals quite publicly how much their government doesn't care about them to everyone. If the country does something bad, punish the whole thing. And they can try to leave their country. Too much gray area already allows the leaders to take advantage of that and avoid any repercussions at all. They deserve no wiggle room. They already declared war by invading Ukraine so seizing their other stuff only makes sense. It's a staunch disapproval and it has to come from all sides, including within. Otherwise, there are no alternatives and they will just get away with it as they will do now anyway.",
            "title_similarity": "0.8649822",
            "sentiment_compound": -0.9663
        },
        {
            "id": "hybbzng",
            "score": 1,
            "text": ">\tI understand many Europeans rely on Russian exports (especially oil) so trade restrictions are difficult.\n\nDifficult? Yes. Impossible? No. Extremely harmful to Russia if everyone does it? Yes.\n\nRussia just invaded another country. IMO the only appropriate response is to completely and utterly cut them off from the rest of the world in any and every way possible.",
            "title_similarity": "0.91674185",
            "sentiment_compound": -0.4208
        },
        {
            "id": "hyc00lg",
            "score": -1,
            "text": "The citizens of that territory voted to join Russia 8 years ago. What's the problem here?",
            "title_similarity": "0.5588261",
            "sentiment_compound": -0.128
        },
        {
            "id": "hyc2iw6",
            "score": 1,
            "text": "So should all of these be done to the USA for the Iraq War?",
            "title_similarity": "0.55687636",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hy9f3ym",
            "score": 22,
            "text": "get in line behind all the other countries that should be banned 😂",
            "title_similarity": "0.6474534",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hy9n9s0",
            "score": 22,
            "text": "This isn't the first time.\n\nRussia invaded Ukraine before, and annexed Crimea and has supported the rebel-held separatist parts of the country.\n\nThey also invaded South Ossetia in Georgia too and annexed that.\n\nWhy should this invasion be any different from the previous? Is it the scale? Is it the closeness to our homes?\n\nIf invading a sovereign country also warrants exclusions from international travel and sports, then why was the US and UK not punished for invading Iraq without UN approval, or Libya? Those weren't exactly legal either. Would you recommend similar punishments for the US and UK for those incursions?\n\nFor the record, I'm British.",
            "title_similarity": "0.82201296",
            "sentiment_compound": 0.3645
        },
        {
            "id": "hya6mab",
            "score": 8,
            "text": "So you're proposing punishing the Russian people for the actions of its government? I don't see how that's a just way to go. It's similar to economic sanctions that way. We pretend they're to hurt the government, while the people in charge freely admit they target the people and do their damage to governments through the civil unrest they cause.\n\nDo you also support the same travel and sporting restrictions for the US in the wake of the Iraq and Afghanistan invasions? Both were likewise invasions of sovereign countries and the same could be said of what the drone program does constantly in violating sovereign airspace (not to mention them being brazen assassinations without any due process and killing more civilians than combatants, even when statistics call all fighting age males combatants.) Surely by the metric you'd apply to Russia, the same punishment should apply to the United States.\n\nRegardless of your standards for how you would mete out punishment, they should be evenly rendered no matter how you feel about the countries invading and being invaded. Remember while you can easily rant about theocratic and oppressive rule and supposed WMD's, the Russians can easily and justifiably rant about a dangerous, growing movement of literal nazis in Ukraine, and cite an ethnic Russian separatist movement in Donbas.\n\nAt the end of the day, the choices of the government do not necessarily (and in many cases very rarely) represent the choices of the people within that country and punishing the people for the decisions made by their government is never the answer.",
            "title_similarity": "0.856596",
            "sentiment_compound": -0.9806
        },
        {
            "id": "hy9tzkq",
            "score": 2,
            "text": "I do like how European Countries are more thoroughly examining their dependence on Russian oil and gas and are starting to brainstorm plans to become more independent as a response to this conflict. Hopefully, in the future, they will get rid of this leverage Russia has. \n\nhttps://www.washingtonpost.com/climate-environment/2022/02/23/russia-ukraine-eu-nordstream-strategy-energy/",
            "title_similarity": "0.7215346",
            "sentiment_compound": 0.3767
        },
        {
            "id": "hyac7hm",
            "score": 2,
            "text": "So if I am doing business with Russia and it is not something directly contributing to any violations of international sentiments or law, I should have to pay the price of your sanctions?",
            "title_similarity": "0.71164596",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hybdjd2",
            "score": 2,
            "text": "CMV: The exact same should have happened against the USA and UK for their invasion of Iraq in 2003.",
            "title_similarity": "0.5482921",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybpg9v",
            "score": 2,
            "text": "The USA invaded plenty of sovereign nations throughout the 20th century. It razed Iraq and Afghanistan only 20 years ago. \n\nDo we only care when it’s the big bad bogeyman who does the invading? By flagrantly violating international law, the US / UK helped to embolden people like Putin.\n\nThe problem with the US is that history is told in Hollywood fashion, with ‘goodies’ and ‘baddies’ - not only is there a lack of nuance and perspective, the USA can only ever be the righteous hero. \n\nSo yeah, ban Russia from everything for their invasion. But spare a thought for previous invasions and incursions and interventions perpetrated by the good ol’ USA and its flunkeys like the UK.",
            "title_similarity": "0.8450439",
            "sentiment_compound": 0.5919
        },
        {
            "id": "hy8t6yq",
            "score": 39,
            "text": "[deleted]",
            "title_similarity": "0.11025941"
        },
        {
            "id": "hy9ede7",
            "score": 4,
            "text": "We should take away his cellphone privileges",
            "title_similarity": "0.49421677",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hy9z8hc",
            "score": 19,
            "text": "I believe Russia should face sanctions for their actions. \nI do however find it some what funny that people are arguing that but didn't argue that America should have faced any sanctions after their last 2 invasions of sovereign countries? And the multiple boarder excursions they have made with military forces against the will of those sovereign governments over the last 10 years. Just seems a bit hypocritical",
            "title_similarity": "0.8500352",
            "sentiment_compound": -0.3603
        },
        {
            "id": "hya5fxb",
            "score": 2,
            "text": "Most Russians arnt russia, by all means go after puten and the top echelons but the majority of Russians including the ones doing the invasion are just people like us who want to get on with there lives.\n\nIf we fight them so be it but we must remember they are people too, our actions must be preventative only and not punitive.",
            "title_similarity": "0.8202398",
            "sentiment_compound": 0.6432
        },
        {
            "id": "hyaag8g",
            "score": 3,
            "text": "Would you agree that punishing the civilians makes them more likely to support their leader?",
            "title_similarity": "0.5490159",
            "sentiment_compound": 0.2177
        },
        {
            "id": "hyabi2p",
            "score": 2,
            "text": "My father is in Moscow visiting family.\n\nWe live in the US. I don't want him stranded there.",
            "title_similarity": "0.5591325",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hyaf0an",
            "score": 1,
            "text": "Do you think the same standard should be applied to other countries, like the United States?",
            "title_similarity": "0.34229457",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hyag8nj",
            "score": 1,
            "text": "Why would you punish the Russian citizens for the actions of the Russian government?",
            "title_similarity": "0.6934382",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hyagno9",
            "score": 1,
            "text": "Russians aren't bad people. They just have a crazy government.",
            "title_similarity": "0.60074633",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hyaj1uo",
            "score": 1,
            "text": "Only if it scares our military industrial machine as well they all have too much power #fuckthechickenhawks",
            "title_similarity": "0.6946583",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hyamid4",
            "score": 1,
            "text": "I dont thunk Russia gives a crap about trivial self indulgences. The west doesnt seem to understand this.",
            "title_similarity": "0.5862968",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hyaozla",
            "score": 1,
            "text": "The US has and INSANE amount of oil reserves for this very purpose. To sell it at a high price and look like the good guys. Its gonna go down and european fuel products will not be cheap.",
            "title_similarity": "0.6987821",
            "sentiment_compound": 0.2422
        },
        {
            "id": "hyaph5k",
            "score": 1,
            "text": "If this were to be reciprocated & accepted as an agreed international punishment for invading sovereign countries, the US would have to close their doors & stay at home permanently",
            "title_similarity": "0.67365134",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyarafh",
            "score": 1,
            "text": "Consider what happened when Russia invaded Georgia and then Crimea: Admonishment, sanctions, and nothing from the UN.\n\nSadly you could do this all day and it wouldn’t impact Putin and the leaders at the top for Russia.",
            "title_similarity": "0.76760185",
            "sentiment_compound": -0.25
        },
        {
            "id": "hyav4kz",
            "score": 1,
            "text": "It depends on what you want to achieve.If you want to show ANY consequences it's enough to restrict ordinary Russian people from travel to EU.But if you want to show consequences due invasion you must also use restriction and sanction for elites. Putin doesn't care about ordinary people, and they can't affect to him, but if him wallets will angry due sanctions it can change something. And I think it's the only way that can affect him.",
            "title_similarity": "0.8724265",
            "sentiment_compound": -0.8
        },
        {
            "id": "hyaztau",
            "score": 1,
            "text": "So the USA should have been banned from the 2004 Olympics due to the invasion of Iraq in 2003?",
            "title_similarity": "0.69588816",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyb4bte",
            "score": 1,
            "text": "Are you ready to do all that to the US for it's crimes since WW2?",
            "title_similarity": "0.61651504",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hyb6vwj",
            "score": 3,
            "text": "Is not the first time a country invades another country, look back a few years ago when USA invaded Irak, a lot of people where against it from all around the world, yet they did what they want. The history repeats itself. They invade, loose or win and another chapter comes.",
            "title_similarity": "0.67026466",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hyb6xr1",
            "score": 1,
            "text": "They should be banned from sports for their doping history alone. The invasion is just extra cherry on top.",
            "title_similarity": "0.815319",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hyb7040",
            "score": 1,
            "text": "Yes, and also the US. But who's gonna sanction them if they're the most powerful armed entities around, and a war between them would assuredly result in mutual destruction? Like how would you implement your idea? It's not doable.",
            "title_similarity": "0.69506437",
            "sentiment_compound": 0.153
        },
        {
            "id": "hyb9mte",
            "score": 1,
            "text": "The olympics were literally just held in a country that’s running concentration camps and has some of the worst human rights abuses in the world.",
            "title_similarity": "0.63631976",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hyba4ln",
            "score": 2,
            "text": "How would this same policy not apply to the US in 2003? Seems your criteria need to be explained a bit more in detail.",
            "title_similarity": "0.5258619",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybatgn",
            "score": 1,
            "text": "Let me guess\n\nThat somehow does not apply to, say, Turkey.",
            "title_similarity": "0.3708449",
            "sentiment_compound": 0.0
        },
        {
            "id": "hybcp8q",
            "score": 1,
            "text": "War should be raised on Russian govt, not Russian people.",
            "title_similarity": "0.69377494",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hybd7h2",
            "score": 1,
            "text": "I was going to type out a long response, but go read how World War 1 was started.  Countries are like family. You fuck with one, you fuck with the whole family, even if the one you fucked with is an asshole.\n\nThe best we can do is bad press, economic sanctions, shit like that. We can't go to war with Russia, otherwise we're going to war with others. Russia knows it, we know it.\n\nGeopolotical grandstanding sucks, and it leads to deaths, but what can you do? Will the Russian people stand up against their own government? How many people will run the risk of sacrificing their own lives to change their own government?\n\nYou want to punish people who spent their lives trying to get to a level of achievement most can't get to, all because of where they come from.\n\nI'm an American, there are things my country does that I don't like, and other is only so much that I can do, but for me to get fucked over because my country sucks, is unacceptable.\n\nIT is like blaming all the Chinese because of the Corona Virus. It's bullshit to do that, it's bullshit to punish olympians.",
            "title_similarity": "0.85625136",
            "sentiment_compound": -0.9969
        },
        {
            "id": "hybg5mf",
            "score": 1,
            "text": "The US is 10 times worse actually. At least Russia is forward. The US uses the CIA to topple governments, create instability, it also invades sovereign nations, like Iraq and Afghanistan. The US might hide it well behind a powerful propaganda machine, but it's far worse than Russia.",
            "title_similarity": "0.7659307",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hybm3km",
            "score": 1,
            "text": "I mean you could do that but you'd have to cut off the US and several of their allies from the rest of the world to avoid being a hypocrite",
            "title_similarity": "0.72938585",
            "sentiment_compound": -0.6652
        },
        {
            "id": "hybmwab",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.091086656"
        },
        {
            "id": "hybpa6m",
            "score": 1,
            "text": "Then you would have to ban the US too, right?",
            "title_similarity": "0.51634717",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hybpgb2",
            "score": 2,
            "text": "Just a question, why *just* Russia though? \n\nThere's the issue of Afghanistan and Iraq to ban and boycott the US. \n\nThere's the issue of Palestine to ban and boycott Israel etc. \n\nSo why do it half hearted? Why not ban all three of them?",
            "title_similarity": "0.76914144",
            "sentiment_compound": -0.8561
        },
        {
            "id": "hybpkcy",
            "score": 2,
            "text": "Im not entirely in favor of sanctions that affect a whole country. Its very difficult for people to rise up against tyrants when they dont have money and resources, in fact it works to a dictators advantage which is why I think putins not too worried about sanctions. Im all for sanctioning putin and the people that support him. its not too difficult because its probably a thousand people at most and they are all known. no need to seize their properties even, just dont let them have access to any assets they have outside russia. but try not to hinder the russians that are against the war and their government. In fact help them any way possible. its very difficult to depose a dictator without outside help, and sanctioning those people makes it almost impossible for them.",
            "title_similarity": "0.78383946",
            "sentiment_compound": -0.8362
        },
        {
            "id": "hybpz17",
            "score": 2,
            "text": "We should be careful punishing all Russians for this war, especially as their not a democratic country. The citizens, nor the rich oligarchs are invading a sovereign country. If the Russian peoples were allowed a vote they would not be invading anywhere. \n\nLots of British people would welcome the EU invading and retaking the UK for the EU. Remainers wouldn't be called separatist terrorists, the Russian areas of Ukraine are similar.   I believe the west call it regime change",
            "title_similarity": "0.91893685",
            "sentiment_compound": -0.9127
        },
        {
            "id": "hybqwau",
            "score": 7,
            "text": "They should've been banned from all sporting events for state-sponsored doping. The IOC tried (and it didn't just apply to the Olympics, either. See Mazepin losing his flag in F1.), but when they can still field a full hockey team and even get away with continued doping DURING the Olympics, it's clear it hasn't stuck.",
            "title_similarity": "0.8258006",
            "sentiment_compound": 0.4039
        },
        {
            "id": "hybresf",
            "score": 1,
            "text": "By the same logic, do you think China should be held responsible for their action against, US for invaded Afgan/Iraq?",
            "title_similarity": "0.5909767",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hybrwj8",
            "score": 2,
            "text": "If anyone’s to blame its the ~~Jews~~ NATO for peeving off ~~Hitler~~ Putin so bad!",
            "title_similarity": "0.6250572",
            "sentiment_compound": -0.8011
        },
        {
            "id": "hybs0lh",
            "score": 2,
            "text": "This has been seen over and over again. A portion of a population hates their government, rightfully. US imposes sanctions like this or others with the expectation that pressure on civilians will make more of them revolt.\n\nIt is always the opposite outcome. It just backfires.\n\nForeign hostility is seen for what it is. Civilians blame the aggressor, not their government for not protecting them from it. On the contrary people become marginally more nationalistic and will turn to the government they know and hate to fight off the foreign aggressor.\n\nThink of it this way: Picture some of the really horrible events or \"battles\" in the US in the last few decades. How do you think Americans would react to Chinese tanks rolling into LA to \"help\" would be taken?",
            "title_similarity": "0.77578276",
            "sentiment_compound": -0.9661
        },
        {
            "id": "hybtbwo",
            "score": 3,
            "text": "They should be the recipients of smart bombs dropped by F-35s. They don’t give a fuck about anything else. Do you think they care what happens to their citizens? They don’t need the consent of the governed to be elected in Russia.",
            "title_similarity": "0.7476524",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hyby9re",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.091086656"
        },
        {
            "id": "hyc4i5v",
            "score": 1,
            "text": "You are asking countries to tie their hands and enforce this on themselves?Good luck getting China,US ..........to agree.",
            "title_similarity": "0.49786133",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hyc5olb",
            "score": 1,
            "text": "While we're at it, can we ban the USA from all sporting events, international travel, size property due to them invading and destroying a long string of sovereign countries?",
            "title_similarity": "0.7984086",
            "sentiment_compound": -0.802
        },
        {
            "id": "hyc6z5q",
            "score": 1,
            "text": "I disagree.\n\nThe fault of Putin should not be cast on the population.\n\nThere are protests of thousands in Russian cities, as well as Russians apologizing worldwide. It was not the population's choice to have this war.",
            "title_similarity": "0.7802743",
            "sentiment_compound": -0.8757
        },
        {
            "id": "hyc7ckv",
            "score": 1,
            "text": "So the the same should be done to the US for invading Iraq, right?",
            "title_similarity": "0.4600041",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyc7qjk",
            "score": 1,
            "text": "Just do the Russian people a favor and take out all the oligarchs.",
            "title_similarity": "0.6502728",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hyccxzu",
            "score": 1,
            "text": "So do you think the US, France, etc. should be banned from all sporting events and international travel for invading sovereign countries and overthrowing their governments?",
            "title_similarity": "0.76960766",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hycdzam",
            "score": 1,
            "text": "Did you ever hear about the 600 pound gorilla?\nWhat does the 600 pound Gorilla do?\nWhatever he wants.\n\nWho is going to stop a Superpower? Another superpower? Over a country that is nonessential to that opposing superpower?",
            "title_similarity": "0.5713659",
            "sentiment_compound": -0.4871
        },
        {
            "id": "hycfn0l",
            "score": 1,
            "text": "Why is nobody mentioning that NATO want to put missile silos, NATO bases and military presence on the Russia border? \n\nWhy is Russia the villains when all they are doing is defending their territory and culture from western powers? \n\nWhy is it okay when NATO does the very same thing? \n\nWhy has this point not once been mentioned on our social media and news? Even the point being brought up.",
            "title_similarity": "0.7796651",
            "sentiment_compound": -0.6322
        },
        {
            "id": "hycglp1",
            "score": 1,
            "text": "Then by that regard we need to ban US for literally toppling sovereign governments.\n\nYou need to separate the fking state and its people.",
            "title_similarity": "0.7258714",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hycgpq2",
            "score": 1,
            "text": "Like America was banned when invading Iraq back in 2003?",
            "title_similarity": "0.595101",
            "sentiment_compound": -0.128
        },
        {
            "id": "hycjyu5",
            "score": 1,
            "text": "Should America be banned for the same reasons?\n\nDo you want me to get the list of countries America has invaded or interfered with?\n\nI can get you the list if you want.\n\nI don't disagree with you btw... but it shouldn't be unilateral.",
            "title_similarity": "0.67981684",
            "sentiment_compound": -0.12
        },
        {
            "id": "hyckgvj",
            "score": 2,
            "text": "I am technically Russian, but I've been living outside of Russia for 7 years now. Also I fully support Ukraine in this conflict. Banning international travel would mean for me personally that my mother wouldn't be able to come and visit me. Do you think that's justified?",
            "title_similarity": "0.7530105",
            "sentiment_compound": 0.6251
        },
        {
            "id": "hyckl2d",
            "score": 1,
            "text": "Shouldnt the US be held to the same standard for interference in Bosnia, Iraq, Sudan, Afghanistan, Yugoslavia, Yemen, Haiti, Somalia, Libya, all of Latin America, Guyana, etc. They have 51 instances of foreign interference in sovereign nations since WWII. In fact, US interference in Russian elections in 1996 ensured Yeltsin got reelected, who had a 6% approval rating among Russians. Yeltsin gave us Putin, who in turn led us to where we are now. Among other factors in 2014. \n\nRestricting all the things you mentioned regarding Russia only hurts its citizens, while the ruling class slides on by, unscathed.",
            "title_similarity": "0.8091605",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hycopg3",
            "score": 1,
            "text": "You can’t punish innocent people that happen to live in a country ran by a megalomaniac",
            "title_similarity": "0.5974878",
            "sentiment_compound": -0.25
        },
        {
            "id": "hycqfcm",
            "score": 1,
            "text": "totally",
            "title_similarity": "-0.096502006",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycr9f5",
            "score": 1,
            "text": "Russia should be broken up into 5-10 republics.",
            "title_similarity": "0.42160666",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hyct22o",
            "score": 1,
            "text": "Hasn’t the US also done this tho?",
            "title_similarity": "0.13248864",
            "sentiment_compound": 0.0
        },
        {
            "id": "hyct6pw",
            "score": 1,
            "text": "Should the same apply to the US for invading Iraq, and Afghanistan?\n\nTo Saudi Arabia for invading Yemen?",
            "title_similarity": "0.48099124",
            "sentiment_compound": 0.0
        },
        {
            "id": "hycwsy2",
            "score": 1,
            "text": "I agree, but then USA has to be banned too. For invading Irak, Siria, Libia, ...\nand a long list of countries for a long time.",
            "title_similarity": "0.7225808",
            "sentiment_compound": -0.5023
        },
        {
            "id": "hycwvey",
            "score": 1,
            "text": "Then so should US have been banned since Vietnam, Cuba, Syria, Afghanistan, Iraq, Libya, and what not.",
            "title_similarity": "0.63414335",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hycwwpc",
            "score": 1,
            "text": "Seizing property (invasion) is an act of war. It's hard to justify starting a war, when Russia hasn't done anything to you.",
            "title_similarity": "0.72845626",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hyczpdq",
            "score": 1,
            "text": "Russia should be banned from existence",
            "title_similarity": "0.61593735",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hyd284t",
            "score": 2,
            "text": "Going by that logic every major power in the world will have to be banned from all the above mentioned events. For years America and its stooges in NATO have been bombing and invading countries across the middle east for fun and no one gave a fuck. Now the same thing happens to a European nation and suddenly everyone is losing their shit. War is bad, but it is not as if Russia is any worse than the US. The double standard when it comes to international affairs is unreal.",
            "title_similarity": "0.8388309",
            "sentiment_compound": -0.928
        },
        {
            "id": "hyd3ib8",
            "score": 1,
            "text": "Would you be logically consistent and ban USA, Germany, Israel and UK for doing the same in recent past?",
            "title_similarity": "0.59766155",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hydc4jr",
            "score": 2,
            "text": "Ironic how Americans are sanctimoniously condemning Russia for their military's invasion of Ukraine, while conveniently forgetting it's own invasion of Iraq & Afghanistan and its interference in Palestine, Libya, Yemen etc.. \nAnti war when it suits.",
            "title_similarity": "0.795367",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hydcvhx",
            "score": 1,
            "text": "I agree.",
            "title_similarity": "-0.16909602",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hydekx7",
            "score": 1,
            "text": "International travel ? Yeah sure let‘s cut away the possibilities to get out of a country they oppose. Great idea.",
            "title_similarity": "0.6585157",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hydis9i",
            "score": 2,
            "text": "The seizing of properties is a very good way to destroy Western economy. How? Just take one example, the US system of debt. It works by people allowing them to give money, and after \\[for example\\] 3 years, the money is given back at a \\[for example\\] 4% interest rate.\n\nAlso, the USA has a very high rating with how likely it is to pay back the debt, [here are the ratings](https://tradingeconomics.com/country-list/rating).\n\nTherefore, if USA and other EU countries start doing that, their reputation will be destroyed. And their is a slight problem of war, ya know.\n\n&#x200B;\n\nAnd no, you can't ban them from sports. That's not how it works.\n\n&#x200B;\n\nFurthermore, your narrative of \"democratic countries\" at the end is laughable. Your naive assumption that democracy=good is far from true. Let me remember, who invaded Iraq? Afghanistan? Syria? On the other hand, big bad none democratic China invaded 0 in the past 40 years.",
            "title_similarity": "0.6955694",
            "sentiment_compound": -0.855
        },
        {
            "id": "hydj1mb",
            "score": 1,
            "text": "Hard disagree.\n\nIntentionally isolating a nation and its people will have little impact on Vladimir Putin or his army. This course of action is more likely to turn Russia into a larger, more powerful North Korea than it is to cause some kind of internal revolution or sway the minds of its leaders.\n\nYour suggestion is the first step in ensuring that the Russian people - once again - effectively become prisoners in their own nation, through no fault of their own.",
            "title_similarity": "0.7993796",
            "sentiment_compound": 0.468
        },
        {
            "id": "hydj2ik",
            "score": 1,
            "text": "Hurting innocent people doesn't hurt the government... Atleast not in Russia. lol",
            "title_similarity": "0.49311987",
            "sentiment_compound": 0.0372
        },
        {
            "id": "hydy2xs",
            "score": 1,
            "text": "Should the US have been penalized similarly when they invaded Iraq?",
            "title_similarity": "0.59054744",
            "sentiment_compound": 0.0
        },
        {
            "id": "hye6y6u",
            "score": 1,
            "text": "Not that I agree with their reasoning, but I could give you their reasoning to why they invaded if you’d like to know. And no, it had nothing to do with “Nazi’s” lol. This is a culmination of over a decades worth of  what Putin views at least, NATO aggression and expansion into “their” territories; I believe he said (paraphrasing translation here) “I’m sick of NATO having guns on my front porch, pointing at me and lying about it.”",
            "title_similarity": "0.7920661",
            "sentiment_compound": -0.6255
        },
        {
            "id": "hyflxll",
            "score": 1,
            "text": "I believe otherwise. If you can remember, we did the same to Germany in WW1. We also did it in WW2, and it led to the Cold War, and China becoming a World Power.\n\nIf we implement restriction we'd risk being hypocrites, and violating their national sovereignty.\n\nIn fact, I'm under the opinion of why should we care about other countries wars & fightings? We don't immediately counter african, minor asian, and minor middle east wars & conflicts.\n\nAmerica got stuck fighting in the Middle East because of \"Oil\" & 911. We don't have an excuse, \"911\", for Ukraine.\n\nRemember all the republicans talking about Joe Biden, his son, and Ukraine? We are tied up in Ukraine both in public, federal, state, and private-wise. That's why Democrats, Biden, and co want to go into it to \"defend\" them.\n\nThey have to go in, or our debt will increase exponentially; as well as politicians will see heavy losses on there private bank books.\n\n\\---\n\n**We'd immediately go into WW3 if we began:** \"banning them from all sporting events, international travel, and start a property seizure due to them invading a sovereign country.\"\n\nWhat you are suggesting is a counter invade, and perhaps even the beginnings of a genocide where russia begins to ignore the rules almost all countries agreed to in war.",
            "title_similarity": "0.8510758",
            "sentiment_compound": -0.9838
        },
        {
            "id": "hyim6cj",
            "score": 1,
            "text": "Russians who oppose their government should absolutely be allowed to leave (esp since some are being arrested for protesting in their own country)",
            "title_similarity": "0.7898622",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hynuvyf",
            "score": 2,
            "text": "Hey all. I did try to keep this brief but...\n\nI understand where the OP is coming from but any sanctions that target Russia's population directly are not going to work and are folly if part of the point is to turn them against Putin. But only right now. I'll explain that later.\n\nI completely agree that the US, UK and various other countries should have faced greater consequences for Iraq in particular, and I am a Brit. When Ukraine was invaded that was one of the things that came to mind - the hypocrisy on display. I still remember reading resolution 1441 myself at the time. It was right there in plain language for everyone to see that it was an illegal action, and at one extremely dangerous point it actually threatened to break up the UN. I am also still disgusted and ashamed that the dossier which said that Iraq had WMDs was produced by British intelligence. Goddammit, I honestly recall thinking at the time that the whole entire farce set a terrible precedent for the future - for countries and leaders to think they can do what they like in plain sight... and look where we are now?\n\nBut so far so already-mentioned-by-everyone-else, right? So why did I choose to post?\n\nBecause this entire situation is a COMPLETELY different animal, but one that is unfortunately familiar even though it should have been put to bed. Putin is a completely paranoid, murderous ex-KGB agent who somehow wound up running Russia and doesn't seem to understand that time has moved on from the 20th century, evidenced by the fact that he is actually going ahead and trying to fulfill the absolutely insane goal of reconstituting the USSR, when practically nobody wants that except him. He is absolutely convinced he is doing right because he has made the mistake of thinking that eliminating dissenting voices has eliminated dissent, and is stuck in the Cold War era, thinking that the west wants to dismember Russia, destroy its future and make it disappear, and force-feeding that message to his citizens. \n\nWhatever your political alignment is doesn't matter here -  we are a world that has been marked by progress, by moving forward, by trying to make things better. Even if our opinions are different, and we may disagree about how to get it done, we want the same thing.\n\nBut he and his cronies are trying to bring in the Old World Order.\n\nI can't help but be reductive here, and I don't mean to offend, but I can't stress this enough - the stakes are so much higher than Iraq, Afghanistan or the entire War on Terror that it makes it look like a schoolyard fight.\n\nOutside of the Ukrainians fighting to defend their country because they now have no choice, any non-violent solution is absolutely the way to go with this because otherwise the end of the line is World War 3, so while I don't actually agree with it right now, I can't change your view if the situation ends up demanding it if that's the only way, because the potential alternative consequences of this escalating are unthinkable.\n\nBesides let's be honest here - the current sanctions have probably been twisted and spun by the Russian media to make it look as though they are targeting the Russian people anyway.\n\nAnd just before I started writing this I discovered Putin has now warned that Russia will be stepping up its 'nuclear deterrence' response because of 'aggressive statements'.\n\nEven if it is a bluff, the guy just threw a temper tantrum because of people saying some nasty things about him.\n\nUnfortunately, that toddler happens to be in control of the world's largest active nuclear arsenal, largest arsenal full stop, and actually showed a willingness to consider using it when his country isn't even under attack, and thinks that the rest of the world will just take that lying down.\n\nNever mind Russia - most of these posts I've read here have been about the NATO countries being the aggressors, so what do you think would happen if they did the inevitable and proved him wrong? I sure as hell don't want to find out.\n\nTo write this post was to feel like a crackpot conspiracy theorist. I honestly thought we were past this shit as a species. How absolutely fucking naïve I was.",
            "title_similarity": "0.83543086",
            "sentiment_compound": -0.9981
        },
        {
            "id": "hypfe2l",
            "score": 1,
            "text": "We shouldn't be punishing the innocent citizens of Russia for the actions of Putin. Putin started the war. He should be the one to face consequences.",
            "title_similarity": "0.77620864",
            "sentiment_compound": 0.1088
        },
        {
            "id": "hz7sk0s",
            "score": 1,
            "text": "You mean like the consequences western nations faced when they illegally invaded Iraq? OP get off your high horse and get back on your meds",
            "title_similarity": "0.6884935",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hzfvhe8",
            "score": 1,
            "text": "Banning travel would make it harder for people who don't want to be involved in the war to escape.",
            "title_similarity": "0.6744908",
            "sentiment_compound": -0.5302
        },
        {
            "id": "hzyodqr",
            "score": 1,
            "text": "Is the world trying to cripple russia? did we not learn from WW1 when sanctions were imposed on germany",
            "title_similarity": "0.6993185",
            "sentiment_compound": -0.0772
        },
        {
            "id": "i13em7p",
            "score": 1,
            "text": "is it allways wrong to invate a sovreign country? What about afghanistan, irak, vietnam etc?",
            "title_similarity": "0.50046957",
            "sentiment_compound": -0.5362
        },
        {
            "id": "i1feu1g",
            "score": 1,
            "text": "With the man called Putin his a very stubborn and heartless soul imagine that of him claiming to be right... What decission/command have Biden made to this man",
            "title_similarity": "0.58393717",
            "sentiment_compound": -0.7548
        }
    ]
}