{
    "CMV: We should stop saying \"Russia\" and start saying \"Putin.\"\n\"Russia says it is liberating Ukraine\"  \n\"Russia threatens nuclear war\"  \n\"Russia destroyed peace efforts\"  \n\n\nI am seeing a lot about what Russia is doing lately, for fairly obvious reasons. However, as I understand it, the majority of Russians are not in favor of the current direction of the country. Moreover, none of them have the power to make, or halt, these decisions.  \n\n\nWhen people say \"Russia\" they really mean \"Putin.\" Putin invaded Ukraine. Putin threatened nuclear war. Putin destroyed peace efforts. It's one dude with the power, and allowing him to hide behind \"Russia\" is shifting where the responsibility for these acts lie. We should be titling our posts and our news leaks with Putin because he specifically made the decisions, not the general public of Russia.   \n\n\nPointing out that Putin was elected and therefore represents the will of the people is not going to change my  mind. He is still and individual giving individual orders, presidents are responsible for the effects of their decisions. We have no problem saying \"Trump allowed Covid to get out of hand\" or \"Biden caused inflation\" instead of \"the US caused inflation.\"": [
        {
            "id": "hzhzimh",
            "score": 1,
            "text": "/u/Mycellanious (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/t7jg0a/deltas_awarded_in_cmv_we_should_stop_saying/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.41846865",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hzhxv3v",
            "score": 7,
            "text": "We should be saying Russia, so that Russians know their responsibility to prevent this kind of man ruling their country ever again. They are not innocent at all!",
            "title_similarity": "0.83033085",
            "sentiment_compound": -0.3022
        },
        {
            "id": "hzi0f3l",
            "score": 0,
            "text": "Putin isn’t t going around raping and killing innocent women. The Russians are.",
            "title_similarity": "0.67577755",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hzi4okc",
            "score": 0,
            "text": "The Russian people have a long history of overthrowing bad governments. Yet, they choose not to overthrow this one. \n\nThere are only a few decent ways out of this situation, and Putin's removal from power is one of them. This is something that can only practically happen from within Russia.",
            "title_similarity": "0.8253195",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hzhx2i9",
            "score": 17,
            "text": "I might be wrong, but I don't think that Putin successor would manage Russia that differently. At some point, geopolitics is one thing, and your internal political positions are another. It doesn't matter if you're left wing, right wing, centrist, socialdemocratic, liberal, conservative, communist, if you're a head of state/government, and you see your country threatened, you will act accordingly (which may or may not be war).\n\nI'm not familiar with, say, UK politics, but I'm quite sure that not one (1) Prime Minister, be him labour or conservative, favored scottish or northern ireland independence. As leader of a country, you need to ensure its unity, otherwise what's even the point? In the home you live in, you make sure every window is intact, you don't just demolish one room.\n\nThis is to say, ok, Putin is gone, there's a new president, new government. Then what? They will be NATO friends all of a sudden?",
            "title_similarity": "0.79434335",
            "sentiment_compound": 0.9672
        },
        {
            "id": "hziertb",
            "score": 8,
            "text": "FALSE INFORMATION. 50% of russians said in a poll that they were IN FAVOUR of this war…. \n\nwant sources? okay. \n\nhere’s some of the MANY sources: \n\n[source 1](https://www.dailymail.co.uk/news/article-10568223/amp/Russian-trust-Putin-SURGED-invasion-Ukraine.html)\n\n[source 2](https://thehill.com/policy/international/russia/595523-twice-as-many-russians-in-new-poll-say-military-use-justified-to?amp)\n\n[source 3](https://www.cnn.com/interactive/2022/02/europe/russia-ukraine-crisis-poll-intl/index.html)\n\n[source 4](https://www.pbs.org/newshour/world/putins-public-approval-soared-as-russia-prepared-to-attack-ukraine-history-shows-its-unlikely-to-last)",
            "title_similarity": "0.73525006",
            "sentiment_compound": 0.7346
        },
        {
            "id": "hzi3k6n",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.15241447"
        },
        {
            "id": "hzhvx1c",
            "score": 0,
            "text": "The thing is, its not just putin its the whole government, there basicly a bunch of mobsters looting off theyre own country, if we get rid of putin another will take his place and the attitude between russia and the west will be the same",
            "title_similarity": "0.7738369",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhw7bt",
            "score": 4,
            "text": "I would agree with you if the Russian military refused to take orders from Putin but since they are carrying out his orders I feel using “Russia” is fair",
            "title_similarity": "0.76023304",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hzidiy8",
            "score": 0,
            "text": "Putin invaded Ukraine? I didn’t see him rolling in there personally, looked like Russian folks to me. Obviously people understand that not all Russians support what is happening. You’re the only one here making the generalization that you’re angry about. I think arguing over semantics right now is not going to accomplish anything, if you want to help, then do something that will actually help.",
            "title_similarity": "0.86849177",
            "sentiment_compound": -0.3999
        },
        {
            "id": "hzidk8m",
            "score": 0,
            "text": "Most Russians voted for Putin, and support the war.",
            "title_similarity": "0.6906955",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzifkz1",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.15241447"
        },
        {
            "id": "hzifn0b",
            "score": 0,
            "text": "Whenever i see a russian speaking out how awful this is and how they had nothing to do with it, i always ask who they voted for...\n\n&#x200B;\n\n\\*silence\\*",
            "title_similarity": "0.77127",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hzijgrl",
            "score": 0,
            "text": "Putin isn't bombing hospital himself, Russians are. Russians clearly don't oppose the war enough that they stop bombing Ukrainian civilians, trying to flee.",
            "title_similarity": "0.8360033",
            "sentiment_compound": 0.5641
        },
        {
            "id": "hzikkh2",
            "score": 0,
            "text": "Russian soldiers are killing Ukrainians, not Putin. Russian pilots are bombing civilians, not Putin. Russian artillery men are targeting suburbs, not Putin. It didn’t fly for Nazis, and it shouldn’t fly now.",
            "title_similarity": "0.7724907",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hzirky7",
            "score": 0,
            "text": "Putin is popular in Russia. Most Russians support him.",
            "title_similarity": "0.4961659",
            "sentiment_compound": 0.6983
        },
        {
            "id": "hzjiebz",
            "score": 0,
            "text": "I'd maintain that it's Russia and not Putin. \nWestern media propaganda has been successful to a certain extent in portraying Putin as a war mongering psychopath and people in the west and perhaps a part of the non western world  has bought that narrative.\nBut Putin isn't crazy. There are clear reasons for him doing what he is doing. It's not for himself but for Russia even if a lot of people, within Russia even, might feel otherwise and rightly so because war shouldn't be the go to unless all diplomatic channels have been exhausted. Be it here in Ukraine or elsewhere like Yemen, Syria, Libya... \nThe reasons for the invasion are simply the geo-political interests of Russia which doesn't want a non pro-russian government in the Ukraine which is a huge security threat to Russia. Oil and natural gas deposits discovered in Ukraine which will have a huge impact on Russia's gdp as it is currently the largest supplier to Europe. Russia wanting NATO to adhere to earlier agreements of not expanding to eastern Europe, Ukraine cutting off water to Crimea, killing people who are pro Russian etc.\nThe whole media propaganda happening on both sides is just a way to show the world that they have taken the moral high ground compared to the other party...Similar to what the US and it's allies have been doing in their various escapades in the middle east,Afghanistan and Africa...If democracy is what the west is supposedly standing for in this moral fight against Russia then why not bring democracy to Saudi Arabia for instance. \n\nI'm not from the west and maybe that's why I find it strange that Ukraine is getting a lot more coverage than what is happening in Yemen right now where Saudis are using US weapons including cluster bombs to kill civilians. But the west gets a lot of money from the Saudis so we can't say they're wrong... \nWar is wrong be it in Yemen, Syria or in the Ukraine and human lives matter be it that of white people or brown but because of vested interests the media doesn't show it that way and because of that a large part of the world doesn't see it that way. \n\nThe only ones I find having an opinion similar to yours are ignorant people who are easily swayed by propaganda and buy into whatever the media in their country is dishing out. \n\nWhile ideals like sovereignty of a nation, individual  freedom etc. are good to aspire to a lot of people fail to realise that all of this is restricted by larger forces in the outside world. Interests of larger, powerful political powers take precedence over that of smaller nations. Laws set by governments trump Individual freedom in many cases.\nIt gets difficult to wage wars without citizens supporting it. That's a learning from the Vietnam War. Regular people don't understand geopolitics or economic interests but it's easy to rile them up using morals. Saying something is right and something else is wrong. We are taught morals right from a young age after all.\nAnd that's what is happening here. It's easier to paint Putin as evil rather than saying all Russians are evil. \nBut I for one believe it's not Putin but Russia acting on its interests (through Putin). Similar to what the west has been doing all this while...",
            "title_similarity": "0.8639491",
            "sentiment_compound": -0.9836
        },
        {
            "id": "hzjir80",
            "score": 0,
            "text": "It's not just Putin.  Have you seen the countless videos of Russians (soldiers & civilians) supporting the invasion?  I understand that they are being brainwashed and I also know there are countless protests in Russia of civilians standing up to Putin.  My point is, it is not just Putin.  He has a large following.",
            "title_similarity": "0.7968331",
            "sentiment_compound": 0.25
        },
        {
            "id": "hzk25wn",
            "score": 0,
            "text": "Putin is the democratically elected leader of Russia. Millions of people support his cause.\n\nHundreds of thousands of soldiers kill and are prepared to die for his cause.\n\nI certainly doubt see an elderly, bald headed Putin crazily charging the Ukrainian border with a single AK 47, in a helmet.\n\nWhat I see is a 60 mile long convoy.",
            "title_similarity": "0.69961965",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hzk3dvd",
            "score": 0,
            "text": "I disagree. Whilst your idea is sound, you don't go far enough. Putin didn't drive any tank. Putin didn't fly any fighter jet. Putin didn't fire any assault rifle. Putin didn't build the bullets. Putin didn't design the planes. Putin didn't drive the transporter to get the troops in place.\n\nPutin did call for the invasion. Putin did sit in luxury house getting his ever need met. Putin did sit by and watch as his requests to invade another country were carried out.\n\nBut never pretend that Putin did any of the acts that he requested. The individuals that did those acts are directly responsible. \n\nIf a politician told me to go kill someone in a foreign place, they have to find out how that would work out for them. \n\nIndividuals are taking actions as part of a movement they are vested in, and they are responsible for those actions and war crimes.\n\nIf there were no soldiers, there would be no war. If they had all just laughed at Putin on his plush cushioned chair and told him to fuck off, then we'd not be in this situation.\n\nPutin is a fucking ill psychopath. Anyone that follows his orders can't be any more mentally stable than that.",
            "title_similarity": "0.69586015",
            "sentiment_compound": -0.7489
        },
        {
            "id": "hzkf3iq",
            "score": 0,
            "text": "I think we should stop saying \"putin\" and start saying \"russia\". It's obvious that russians are fully to blame for their regime and this war.",
            "title_similarity": "0.84761935",
            "sentiment_compound": -0.8592
        },
        {
            "id": "hzkjq0i",
            "score": 0,
            "text": "No, absolutely no. Reasons for this war are way more on behalf of domestic politics – Russians admire strong, victorious leaders and victorious wars. Putin get power because of war in Chechnya, strength his power because of war in Georgia. After Crimea annexation he was supported by over 80% of population. No – it's toxicity of Russians to blame. \n\nAnd I'm saying that as former rusophile. Not in political way – I have never doubt that Putin is criminal and not partner. I loved Russian nation, this language and culture. But now I, and people all over Europe see bunch of our  Russian friends vividly supporting invasion.",
            "title_similarity": "0.81667626",
            "sentiment_compound": 0.231
        },
        {
            "id": "hzkopz2",
            "score": 0,
            "text": "Putin decides. Russia implements. Putin has no power without the collective cooperation of the Russian state and its people. If you think Russians cannot or have never collectively refused to follow leadership, the depth of your history knowledge is showing, comrade.",
            "title_similarity": "0.7419048",
            "sentiment_compound": -0.0803
        },
        {
            "id": "hzksa5b",
            "score": 0,
            "text": "In 2008 Putin ended his second presidential term and could no longer run because of the Russian constitution. But Putin is a dictator, so what does he do? He rigged the election to put his prime minister as president, and Putin became prime minister. After that term, he became president again and even changed the constitution to make holding to power easier for him.\n\nNothing changed when Putin was \"not the president\" because it's all a show. It's Russia, not Putin. There are many Putin clones that could take his place. Putin is not special. \n\nWhat if Russia ousts Putin but continues the war on Ukraine? That's why the focus needs to be on Russia. This will end when Russia leaves Ukraine alone, not when Putin is ousted.",
            "title_similarity": "0.84280515",
            "sentiment_compound": -0.9052
        },
        {
            "id": "hzl7gdd",
            "score": 0,
            "text": "He represents the people of Russia. He is Russia. If the people really wanted to they could absolutely stop this madness but they aren’t. Sure they are protesting and you see some Russian soldiers abandoning their posts and going AWOL or just leaving or surrendering to Ukrainians. However, the Russian people are not stopping what is happening, so they too are supporting, even if it is involuntary, what Putin is doing. Even the council agreed to go forth with operations in Ukraine. They all know the truth as to what is happening and yet they stand by and do little to nothing. This is as much Russian as it is Putin declaring war on Europe.",
            "title_similarity": "0.8576098",
            "sentiment_compound": -0.8192
        },
        {
            "id": "hzlftca",
            "score": 0,
            "text": "No, we should stop saying Putin and start saying Russia. Putin is the head of state.  The notion that the Russian people are not responsible for this monstrosity is ridiculous. The German population was definitely responsible for the Holocaust. And the Russians are responsible for the war in Ukraine and all the other filth Putin's administration spewed in the last two decades. Putin enjoys considerable support by the population who consistently vote for him. Nobody said a word when he and Medvedev. Made the president switcharoo in 2008 to circumvent the constitution. Nobody said a word when they invaded half of Georgia, killed people abroad.",
            "title_similarity": "0.8595967",
            "sentiment_compound": -0.3546
        },
        {
            "id": "hzhvobg",
            "score": 1140,
            "text": ">He is still an individual giving individual orders\n\nAnd there are still a lot of individual Russian soldiers following those orders. If it were truly Putin and only Putin, pretty sure the Ukrainians could shut down that one-crazy-man invasion very quickly.",
            "title_similarity": "0.77077305",
            "sentiment_compound": 0.8689
        },
        {
            "id": "hzi9pry",
            "score": 1,
            "text": "I agree. Considering the penalties for pushback for the Russian people who disagree with Putin, I'd say that they don't have much choice.\n\nI do know that some people agree with Putin and what he's trying to do, but a lot of them are being manipulated and lied to. It's hard to say what they do and don't support. \n\nA friend of mine has family in Russia, and it seems that a lot of people are hearing that they are 'helping' Ukraine. That they will be welcomed as heroes. My friend's parents are/were in the unique position of hearing what those outside of Russia are saying about the invasion. At first they truly believed that it was basically a welfare mission that Ukrainians were fully on board with. The last time she was able to make contact with her parents they were confused as to what was actually even happening.\n\nI fully support Ukraine, but I have a lot of compassion for the Russian people who are left with no good choices.",
            "title_similarity": "0.8016785",
            "sentiment_compound": 0.6251
        },
        {
            "id": "hzij4ko",
            "score": 1,
            "text": "Over here on the more logical and well informed right have been calling it Putin the whole time.",
            "title_similarity": "0.49523506",
            "sentiment_compound": 0.3321
        },
        {
            "id": "hzip6mr",
            "score": 1,
            "text": "> \"I love a good Putin dish: Borsch or Stroganoff.\"\n\n> \"When I went to the Putin bakery to pick up an order of Pirozhki, they were all sold out.\"\n\n> \"So I went to school hungry and sat miserably through a class on the history of Putin.\"\n\nNo. This is a bad idea.",
            "title_similarity": "0.5872078",
            "sentiment_compound": 0.128
        },
        {
            "id": "hzi0hmd",
            "score": 9,
            "text": ">That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness. Prudence, indeed, will dictate that Governments long established should not be changed for light and transient causes; and accordingly all experience hath shewn, that mankind are more disposed to suffer, while evils are sufferable, than to right themselves by abolishing the forms to which they are accustomed. **But when a long train of abuses and usurpations, pursuing invariably the same Object evinces a design to reduce them under absolute Despotism, it is their right,** ***it is their duty,*** **to throw off such Government, and to provide new Guards for their future security.**\n\nI don't think Russians are individually or personally responsible for Putin's war in Ukraine, but I do think they have a duty to expel him from power. And inasmuch as they have that duty, it is appropriate that the people as a whole (rather than as individuals) bear some responsibility, and that using \"Russia\" instead of \"Putin\" is likewise appropriate.",
            "title_similarity": "0.6976036",
            "sentiment_compound": -0.9369
        },
        {
            "id": "hzi88mz",
            "score": 2,
            "text": "It works a lot better for the propagandists to say Russia though.  Collective guilt is so hot right now.",
            "title_similarity": "0.6996695",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hzjwje2",
            "score": 2,
            "text": "Commenting directly because the number of arguments made against OP's view and the superficiality in their reasonings. \n\nName one country that hasn't had politicians/politicaly parties that attempted to decieve the public to achieve or sustain being in political power. - The answer isn't Russia. The answer isn't USA.\n\nName a country that doesn't use disinformation/misinformation/propaganda to sell an illusion of free will or freedom. The answer isn't Russia. The answer isn't USA.\n\nName a country where people in power haven't marginalized a group of people for personal benefit. - The answer isn't Russia. The answer isn't USA.\n\nName a country which hasn't become increasingly top-heavy, tax-mad and systemic in brainwashing their population with mostly insignificant learnings, except insofar as to foster an industrialization which benefits in the sustenance of the system and its arms. - The answer isn't Russia. The answer isn't USA.\n\nName a country where the government hasn't played its part in censoring evidence or facts of historical significance? The answer is not Russia. - The answer isn't Russia. The answer isn't USA.\n\nName a people today that is mobilized enough so as to be able to overthrow its government and has done so during the last 50 years where technological advancements made available to the country in question could not quash. Not even a 3rd world country, let alone Russia or the States.\n\nAnd by your logic, state a person who hasn't tacitly chosen to make the world and the environment less sustainable and them to your list. - The answer isn't Russia. The answer isn't USA.\n\nName a country which has a time machine of sorts that allows the current generation to go back in time, pierce through the history written by the victors and see it - without doubt for what it actually is - come back and still not undo the wrong done by the previous generation. No hints here. \n\nLastly name a nation that deserves to be bastardized. All its people. Its poor, its its homeless, its orphans, its uneducated. No hints here either.",
            "title_similarity": "0.6936718",
            "sentiment_compound": -0.3027
        },
        {
            "id": "hzi687f",
            "score": 20,
            "text": "Everyone who possess some common sense knows Putin is the Head of the Russian government and that the war was demanded by the government, not the citizens. However despite being ordered by Putin, its carried out by the Russian military. Putin didn't invade Russia, the Russian military did. \nIf you have common sense you know Russia in headlines signifies the government and military, not the citizens.\nAnd if a person can't comprehend something as simple as that; \nswitching out the term won't make much of difference. \n\nWhen people refer to Trump or Biden, in the given examples, it's because they want to single out their administration or certain statement, they do that with Putin too. However, if the US would be involved in foreign conflict, people speak of the US, not the president who demands that its carried out. When Bay of Pigs is remembered, people speak of \"American defeat\" not Kennedy's defeat.",
            "title_similarity": "0.8571446",
            "sentiment_compound": -0.7367
        },
        {
            "id": "hzi6xao",
            "score": 11,
            "text": "So you would be ok with blaming only Hitler, but not Nazi Germany?",
            "title_similarity": "0.6211104",
            "sentiment_compound": -0.128
        },
        {
            "id": "hzhz6q1",
            "score": 600,
            "text": "69% of Russians support Putin and the war. That's according to figures collected by an independant/non-governmental research agency. Putin may be the leader, but Russians in every walk of life are supporting the war effort. George Washington won the Revolutionary War, but it was with the contributions of everyone else in the US. Wars are a team effort, and no individual leader should get all the blame or credit.\n\nhttps://www.pbs.org/newshour/world/putins-public-approval-soared-as-russia-prepared-to-attack-ukraine-history-shows-its-unlikely-to-last",
            "title_similarity": "0.85256684",
            "sentiment_compound": -0.8957
        },
        {
            "id": "hziixh0",
            "score": 5,
            "text": "The invasion isn't the fault of the Russian people, however it is their responsibility to remove to the man who initiated it. I understand that they live in an autocratic country run by one of the 21st century's worst dictators but at some point, some responsibility lies with the Russian people to remove Putin. The West also failed in its responsibility to properly deter him and in the coming elections, no doubt at least some of the people who cultivated and encouraged that weakness will removed from power. \n\nThe problem is that unless the Russian people, from the average citizens to the oligarchs with a guilty conscience, remove Putin, this whole situation will get worse and fester in the heart of Europe for decades to come. And more and more dead will pile up and the world as a whole will be a less free and less safe place for everyone across the globe. \n\nThis may sound rather callous and cruel but as scary as the Russian government is, they can't shoot everyone. And if the Russian people really don't want war and don't support Putin, they can prove it by removing him. And to their credit, a lot of them don't support him. But enough of them do or are at least apathetic enough not to care. Russia, at the end of the day is a country not a corporation and while Putin commands its military, he doesn't own it unless the people serving in it allow him to.",
            "title_similarity": "0.8591802",
            "sentiment_compound": -0.9755
        },
        {
            "id": "hzhwxbs",
            "score": 193,
            "text": "There are thousands of Russian men currently killing people in Ukraine.  We have seen Russian soldiers surrendering, there are thousands that are not, those people are not blameless lost lambs wandering around Ukraine in a haze of ignorance, they are an invading army killing people.  I don't care if some of them didn't know what they were being sent for, just following orders is not an excuse that absolves you of blame.  The generals carrying out Putin's orders are not innocent, the police protecting the Russian establishment are not blameless.  The fsb, the oligarchs, the large base of people largely outside of the cities who do support Putin are not blameless, the propaganda media of Russia are not blameless.  You cannot and should not boil a fucking million plus person effort across governmental, military, and civilian levels to invade another country as Putin.  If there is ever an accounting for this, more heads than Putin's must roll, and reductionist statements like this that excuses war crimes being committed by thinking soldiers right now is the worst kind of virtue signaling just because you want to feel better for the civilians in Russia that don't support the invasion.  Yeah it sucks for them, but it doesn't mean that their country isn't enabling and enacting this invasion.",
            "title_similarity": "0.7769212",
            "sentiment_compound": -0.8155
        },
        {
            "id": "hzhvrly",
            "score": 8,
            "text": "It is more than just Putin. It is his advisors, his cronies, generals, etc.\n\nTo put a name on this whole group, \"Russia\" is the obvious word.",
            "title_similarity": "0.6026467",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhw3cq",
            "score": 12,
            "text": "no man rules alone.\n\nThere are a number people in the Russian government with political influence.\n\nI try to make the distinction \"the Russian government\" rather than just \"Russia\", but I don't think the actions of the Russian government should be described just as Putin's decisions.  It isn't just him.",
            "title_similarity": "0.7251769",
            "sentiment_compound": -0.2382
        },
        {
            "id": "hzik7nv",
            "score": 16,
            "text": "Russia has a population of 145m.\n\nI understand that Russia is also massive so it's unreasonable to capture the number of people who do not agree with Putin. However, Moscow has a population of 12m. \n\nI would expect a sizeable portion like that to be out on the streets protesting. \n\nI googled it, and on the day of the invasion, 2000 people in Moscow showed up to the protests. \n\nSo what would a fair number be? Well I think of it this way: to keep things simple I'm going to just assume a uniform distribution. Since moscow has roughly 10% of the population and since the invasionary force is 200k, I'd expect Moscow contributed 10% of that (crude I know, fewer people in cities join military etc), but the contribution sits at 20k and 2k protested against. \n\n\nThis is not enough of a counter imo. I believe it is adequate to say \"Russia\" and not \"Putin\"\n\nInstead everyone sits at home watching propaganda, slowly getting used to the idea of the whole thing",
            "title_similarity": "0.6832105",
            "sentiment_compound": -0.3193
        },
        {
            "id": "hzhwv3l",
            "score": 91,
            "text": "No man rules alone.\n\nPutin would just be a little man yelling on the internet if he did not have a group of oligarchs & regional leaders bought into his strategy.\n\nThose lieutenants have the same problem, just one level down.  \n\nRepeat until you get to the foot soldiers of the army and the office drones that work in the oligarch offices.\n\nNo matter how you cut it, every citizen in Russia is *to some degree* a participant in that system. \n\nTo absolve a nation of deep seeded cultural problems and pretend that everything would be sunshine and rainbows if not for one lex luthor villain is wishful thinking.",
            "title_similarity": "0.81471705",
            "sentiment_compound": -0.8546
        },
        {
            "id": "hzhvq15",
            "score": 1,
            "text": "Who is the \"We\" you are referring to?",
            "title_similarity": "0.080029234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzhz0jy",
            "score": 1,
            "text": "Putin is making the decisions, but Russia is still carrying out the actions. As long as Russian soldiers are performing the actions, we should say Russia.",
            "title_similarity": "0.6423425",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzi1wyo",
            "score": 5,
            "text": "I say your viewpoint is wrong for this reason.  \n\nObama dropped 25,000 bombs on Syria in 2015 & 2016.  Many 10s of 1000s of more in Iraq, Libya & Yemen.  Libya in fact displaced millions of people due to the destroyed infrastructure.     It would be unfair for them to call the USA \"Obama\" though many there consider him a war criminal.   \n\nFor the same reason I'd say you're wrong about Russia.",
            "title_similarity": "0.73495716",
            "sentiment_compound": -0.9628
        },
        {
            "id": "hzi8622",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.15241447"
        },
        {
            "id": "hzi8pb7",
            "score": 2,
            "text": "We are always talking of the government, not the people, Trump didn't personally let covid get out of hand, nor did Biden singlehandedly cause inflation, The Russian Government, headed by Putin, caused the war, Putin and The Russian Government are so closely linked that there's no point signifying the difference, He isn't an elected official, he is the despot controlling the government with the help of oligarchs",
            "title_similarity": "0.80292726",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hzi9wg7",
            "score": 1,
            "text": "It's also turned into more blanket banning and censorship. I always thought we were the beaming light of freedom. Where we have access to all information. Not anymore. We're being pummeled with the same propaganda War that's happening out there. And if you can't see that happening you're just as crazy as the people on the other side who think they're fighting Nazi fascists.",
            "title_similarity": "0.75886416",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hziccjy",
            "score": 1,
            "text": "You need to understand that when people say Russia, they dont mean literally every single Russian person, then mean the country/government/army of Russia. No one is accusing the Russian populace/civilians of anything, in fact its been shown that the average Russian isn't in favor of the war.",
            "title_similarity": "0.72561574",
            "sentiment_compound": -0.8425
        },
        {
            "id": "hzidmz4",
            "score": 1,
            "text": "Russians still believe this. Name the Russian party leader you believe would be better and don’t believe you would also condemn in an alternate universe in which they led the country",
            "title_similarity": "0.70044976",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hzihen4",
            "score": 1,
            "text": "Granted Putin made the decision to start the invasion and continues to make the decisions to keep it going but :\n\nThere are plenty of Russian who support Putin and the war.\n\nThere are plenty of soldiers who are bombing and shelling schools and playgrounds and apartment buildings\n\nThere are plenty of oligarchs who are all for this going on\n\nThey are Russian therefore Russia and not Putin is the proper term",
            "title_similarity": "0.8205198",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hzii3kl",
            "score": 2,
            "text": "I'm from germany and at least here Politicians and Media (most of the time) about \"Putins War\" or \"Putins agression\".",
            "title_similarity": "0.660501",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hziivr8",
            "score": 1,
            "text": "Putin isn't the one shooting civilians,  that's the Russian military.  \nIs no longer just about him,  if it ever truly was.",
            "title_similarity": "0.6924279",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hzijf0d",
            "score": 1,
            "text": "You can say whatever you want, but unless it's some sort of magic spell, the mere choice of words won't change reality.",
            "title_similarity": "0.3812022",
            "sentiment_compound": 0.0387
        },
        {
            "id": "hzijhkz",
            "score": 2,
            "text": "The Russian state is almost autocratically controlled by Putin. It's actions *are* his actions. So it is as appropriate to describe these as acts of Putin as acts of Russia, insofar as by \"Russia\" we mean the Russian state.",
            "title_similarity": "0.7075455",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzikhqe",
            "score": 1,
            "text": "Nope. it's up to the Russian populace to make the change. They can soft disagree but until there is an uprising there is implicit support.\n\n\"Well I'm oppressed by this regime so I'd rather they murder Ukrainians than me as a Russian citizen\" - no.\n\nYou can simultaneously empathize with the Russian populace but also hold them accountable.",
            "title_similarity": "0.8383355",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hzil4ua",
            "score": 1,
            "text": "Because it isn’t just Putin and he has many Russian immigrant supporters in the US.\n\nWake up",
            "title_similarity": "0.5944035",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hzinipt",
            "score": 3,
            "text": "\"First they came for the socialists, and I did not speak out—because I was not a socialist.\r  \n\r  \nThen they came for the trade unionists, and I did not speak out— because I was not a trade unionist.\r  \n\r  \nThen they came for the Jews, and I did not speak out—because I was not a Jew.\r  \n\r  \nThen they came for me—and there was no one left to speak for me.\" --Martin Niemöller\n\n&#x200B;\n\nI know, I know this isn't exactly Nazi Germany (yet), but it still applies.  The whole point of this quote is to note how it gets like it was in Nazi Germany, and by standing by the Russians are allowing this to happen because it's \"not their problem, they aren't all bad\".  It'll honestly be their own mistake here in a few years anyway when they are living in 1800's Russia.  In short, if the Russian people don't work to stop it, their apathy tacitly supports it.",
            "title_similarity": "0.647778",
            "sentiment_compound": 0.9185
        },
        {
            "id": "hzinkmp",
            "score": 1,
            "text": "According to international law the leader of a state is the embodiment of that state. So Putin is technically Russia.",
            "title_similarity": "0.5736462",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzino2b",
            "score": 1,
            "text": "I find it helpful to be able to differentiate things that he personally does, so I would argue for preferring the term \"Kremlin\" instead",
            "title_similarity": "0.49667144",
            "sentiment_compound": 0.0352
        },
        {
            "id": "hziny2m",
            "score": 1,
            "text": "Would it be fair to say “the Russian military” is invading Ukraine? We can’t know for sure what percentage of Russian citizens oppose the war but regardless they are not doing the fighting. We can be more accurate by saying Putin is using Russia’s military to invade Ukraine instead of just saying Russia.",
            "title_similarity": "0.8735404",
            "sentiment_compound": 0.3643
        },
        {
            "id": "hzipoy4",
            "score": 3,
            "text": "I agree, there should be a divide between the Russian people and the Putin enacted war.\n\nNot only are the people being lied to every way possible but there's an inherent manipulation in regards to authority that make it harder to defy their orders. Also it's been stated that a lot of the troops invading Ukraine are very young and even easier to manipulate.\n\nThere's even changes in  'trending' posts on social media now that it's without the Russian influence controlling it. And that's in America, where many people don't believe there is an influence. There may be other countries that have been manipulated as well, I'm not sure. Imagine being front and center where the information is originating.\n\nNot to mention the very real risk of exorbitant fines, loss of jobs, loss of schooling, and jail time that protesting or even just stating your opposition can garnish. These are people fighting a battle both mentally and physically. Which is incredibly difficult to do especially with all of the psychological influence that had been conducted on them for years.\n\nAfter Putin is stopped I hope we can humanize the plight of the Russian people and not enforce sanctions that will lead to repression. As we did for Germany which ultimately culminated in WWII.",
            "title_similarity": "0.8476098",
            "sentiment_compound": -0.9804
        },
        {
            "id": "hzipwp5",
            "score": 1,
            "text": "Maybe we should stop watching western controlled media and check out more independent journalists",
            "title_similarity": "0.5535718",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzirnkg",
            "score": 1,
            "text": "I make sure I do this if possible",
            "title_similarity": "0.10619177",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hzis3t3",
            "score": 1,
            "text": "Putin is just 1 man he can't invade a country by himself. You can't let the Russian people off the hook any more than you can let the Nazis off the hook for Hitler being a crazy person who wanted to murder all the Jews.\n\nI've seen loads of Russians online saying \"I'm against this war\", \"I'm ashamed to be Russian atm\", etc, but eventually they might get drafted, they might be sent into Ukraine and they might have to kill and murder Ukrainians. At some point there is a such a thing as personal accountability.",
            "title_similarity": "0.87285066",
            "sentiment_compound": -0.9736
        },
        {
            "id": "hzis4co",
            "score": 1,
            "text": "Putin's gay clown mafia",
            "title_similarity": "0.46504375",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzismz9",
            "score": 2,
            "text": "Not here to change any minds, but I just wanted to add that Russia has been steadily descending into a USSR-style authoritarian police state over the last few years.\n\nTheir news agencies are moderated by the government (they aren't even allowed to call the conflict in Ukraine a \"war\"). Expressing anti-government views can cost people their jobs and their freedom, I know people in Russia who are afraid to even discuss the situation in Ukraine over the phone.\n\nThis should be considered when saying things like \"x% of the population support Putin\" or \"x% of the population support the 'military operation' in Ukraine\" or that \"not that many people are actually protesting in Russia\". I don't think that anyone is holding the North Koreans accountable for the actions of their leader, nor is anyone saying that the North Koreans support Kim Jong-un and his actions. I personally feel sorry for the North Koreans and similarly, I feel sorry for the Russians who are stuck with a tyrant.",
            "title_similarity": "0.8812071",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hzisum5",
            "score": 1,
            "text": "We could call them Team 1 and Ukraine team 2......we can be the blue team",
            "title_similarity": "0.25449395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzitbae",
            "score": 1,
            "text": "if its putin's fault, why are we punishing all russians with sanctions, and not just putin",
            "title_similarity": "0.8082838",
            "sentiment_compound": -0.743
        },
        {
            "id": "hzitglu",
            "score": 1,
            "text": "One problem there is that the majority of Russians actually do support Putin. Last I checked his approval ratings were at least 90%.\n\nNow the average Russian may or may not support the war in Ukraine, but by and large they enthusiastically support the guy who started the war",
            "title_similarity": "0.7192457",
            "sentiment_compound": 0.6802
        },
        {
            "id": "hzitlhs",
            "score": 1,
            "text": "No, when people say \"Russia\" they mean the Russian government. The people in charge making the decisions.",
            "title_similarity": "0.620303",
            "sentiment_compound": 0.0
        },
        {
            "id": "hziu4qs",
            "score": 2,
            "text": "Its pretty similar to the Trump situation. Im not totally familiar with Russia, nobody is because its not an open country, but Putin does not have majority support. If he did he would have open elections and allow free speech. But he probably has the support of about 30% of the population. So its not just Putin. Its Putin and  something like 30% of Russia. Also you have to be careful about statements like \"Trump allowed Covid to get out of hand\" or \"Biden caused inflation\". Sometimes its true, sometimes its not. Leaders of countries, even dictators, do not have total control over their economies or over the movement of viruses.",
            "title_similarity": "0.80019426",
            "sentiment_compound": 0.9775
        },
        {
            "id": "hziuv8y",
            "score": 1,
            "text": "I don't agree with the underlying premise that \"Russia\" means \"everyday Russian citizens.\" It means the country of Russia, more specifically the government leading decisions for the country. When people talk about any country, they are not talking about each individual citizen, but the influence of the country as a collective.",
            "title_similarity": "0.7530185",
            "sentiment_compound": -0.1419
        },
        {
            "id": "hzivlzm",
            "score": 1,
            "text": "Russians are silent there for accomplice",
            "title_similarity": "0.44458854",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzivn8l",
            "score": 1,
            "text": "I'm surprised our propaganda isn't pushing that more. Worked for the Napoleon and Hitler problems.",
            "title_similarity": "0.6068915",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hzivz06",
            "score": 1,
            "text": "Not all Russians are against the invasion and annexation of Ukraine. Former Yugoslavia used to be ruled by a ruthless dictator called the Butcher and he was removed from power because of nonviolent resistance and the military and police refused to follow his orders. That is not the case in Russia. Most authoritarian regimes reward and take care of their military branches because they understand their need in order to stay in power.",
            "title_similarity": "0.80898166",
            "sentiment_compound": 0.7152
        },
        {
            "id": "hziw2wv",
            "score": 1,
            "text": "No, it's the Russia that's the problem. They kept this maniac in power, they are following his orders.",
            "title_similarity": "0.6553861",
            "sentiment_compound": -0.745
        },
        {
            "id": "hzixe84",
            "score": 1,
            "text": "\"Calls to boycott Coca-Cola grow after company refuses to pull out of Putin.\"",
            "title_similarity": "0.65861964",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hziy5lj",
            "score": 1,
            "text": "This is how I feel about America",
            "title_similarity": "0.23845962",
            "sentiment_compound": 0.0
        },
        {
            "id": "hziywdq",
            "score": 1,
            "text": "There was a story about Sky News journalists getting shot at by Russian soldiers, not Putin. I remain unconvinced that Putin would be solely to blame for ordering that unarmed civilians be targeted as combatants. We blame all Nazi soldiers for their actions, therefore Putin does not hold the whole pile of blame of Russian wrongdoing.\n\nIf Putin were solely to blame, then it should follow that Putin is acting out of line, but the lack of military backlash against Putin shows that some significant subset of Russians support Putin's actions.",
            "title_similarity": "0.85402983",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hziz5er",
            "score": 1,
            "text": "In some part Russians are responsible for Putin. They’re the only ones that can stop him without the threat of a nuclear war.",
            "title_similarity": "0.8231286",
            "sentiment_compound": -0.2556
        },
        {
            "id": "hzj0esv",
            "score": 1,
            "text": "When someone says the \"USA bombed  a worker returning home.\" I don't go: \"OMG THAT WASN'T ME! STOP SAYING USA SAY (insert president at the time) INSTEAD!\" Because that's nonsense. Everyone knows we are not talking about the everyday civilian. We are talking about a world power. Same thing with Russian. it's not like this war is just because of Putin and Putin only, there are supporters all around the country and underlings that are doing his will. He has many many people that eat his propaganda up. Usually, the older generation that doesn't use the internet but still. The same shit happens with the US idiots who are dying over oil and money. They choose to feed into the narrative given by the government.",
            "title_similarity": "0.8693137",
            "sentiment_compound": -0.8603
        },
        {
            "id": "hzj10x8",
            "score": 1,
            "text": ">*However, as I understand it, the majority of Russians are not in favor of the current direction of the country.*\n\nIf the majority of Russians weren't in favor of the current direction of their country, then their country would head in another direction.\n\nPeople need to be held accountable for the actions of their governments.",
            "title_similarity": "0.728258",
            "sentiment_compound": -0.5448
        },
        {
            "id": "hzj36be",
            "score": 2,
            "text": "The fact of the matter is that a large swathe of Russian people actually agree with what Putin is doing, because they are an older population and rely on state-media (see: propaganda) to get their news and information. It doesn't help that Putin is also trying to clamp down on social-media, which is going to mean more people get \"brainwashed\" and believe what he's saying about Ukraine.\n\n&#x200B;\n\nYou also have the fact that a lot of people daren't speak up about any concerns or \"anti Putin rhetoric\" for fear of being jailed, or having their family jailed. \n\nThe soldiers fighting in Ukraine right now are also still following Putin's orders as well.\n\n&#x200B;\n\nSo, while it's not Russia as a whole, it certainly isn't just Putin.",
            "title_similarity": "0.83921874",
            "sentiment_compound": -0.89
        },
        {
            "id": "hzj3grs",
            "score": 1,
            "text": "i think we need to aknowledge that some 3/4 of the population of russia are also existing within a bubble of media/information where they are being guided to beleive and support putin. so its not only putin but putin and his hypnotised force",
            "title_similarity": "0.68114614",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hzj4mwf",
            "score": 1,
            "text": "Most Russians agree with Putin",
            "title_similarity": "0.44222355",
            "sentiment_compound": 0.4173
        },
        {
            "id": "hzj5si8",
            "score": 6,
            "text": "That's how reporting of International news works.\n\n\"Britain voted to leave the EU\" - well I didn't, and it was actually only 17.4million that did.\n\n\"US invaded Iraq\", most Americans didn't go anywhere near Iraq, it was the national military who invaded, following a decision made by Bush and his advisors. \n\nLikewise, Putin didn't make the decision alone. Yes, it's good to remember that a significant population of Russians don't support what's happening in Ukraine, but when we talk about the actions taken by a country's military or government, we generally refer to it as the country as a whole.",
            "title_similarity": "0.83749604",
            "sentiment_compound": 0.3655
        },
        {
            "id": "hzj61kz",
            "score": 1,
            "text": "I'm down with this",
            "title_similarity": "0.1605879",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzj6lf8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.15241447"
        },
        {
            "id": "hzj7ny6",
            "score": 1,
            "text": "Some of the Russian military is not conscious, so they are there willingly. The media is a willing job. The police that are beating and arresting protestors in Russia are doing a willing job. Since these jobs are willing, they are adding to their country going that direction.\n\nWe need to call out the police, media and military in every country that due similar actions. It's deflecting to only blame politicians",
            "title_similarity": "0.76210666",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hzj7zrv",
            "score": 4,
            "text": "It's not a one man decision. It's the whole leadership of Russia. A country is represented (in foreign affairs) by it's leadership. And that leadership is elected by the people.\n\nSecondly, war is not a one man decision. Putin wants war, the other governing institutions agree, the military leaders agree, the soldiers follow orders. Each of them could choose differently. \"If you fight Putin you're in danger\" isn't an argument. If the \"overwhelming majority\" was opposed to the war, they would not follow Putin.\n\nAt best, they're split 50/50, I think even that is too generous. There are more Russians who believe in Putin's lies and who support going to war than sane ones.\n\nThe army is founded by public money and is not Putin's army, it's Russia's army.\n\nImagine \"The US has nukes\". But you would have me say \"Biden has nukes\". He does not. The US does. \n\n>We have no problem saying \"Trump allowed Covid to get out of hand\" or \"Biden caused inflation\" instead of \"the US caused inflation.\"\n\nIt seems to me you're from the US (might be wrong) because the rest of the world gives no fucks who the president of US is and actually says \"The US allowed Covid to get out of hand\". We only use their names of we want to say \"Trump allowed covid to get out of hand *in the US*\".\n\nLastly, speaking of x caused y is usually confined in x's country. Therefore country z caused y to itself is a strange way to put it. Here we are speaking of country z caused something TO ANOTHER COUNTRY.\n\nIf Russia was not in approval of war, we'd have Putin's head sent to NATO by the Russians.",
            "title_similarity": "0.85460997",
            "sentiment_compound": 0.3164
        },
        {
            "id": "hzj890h",
            "score": 1,
            "text": "There should be no one to change your view.",
            "title_similarity": "0.31166446",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzjb2nh",
            "score": 1,
            "text": "In general I think it's more accurate to say \"Russian government\". This goes for basically every country.",
            "title_similarity": "0.59220296",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjdzi7",
            "score": 1,
            "text": "There are thousands of innocent Ukrainian civilians dead at Russian hands. Sure, those Russians were lied to and then found themselves shot at by the Ukrainians defending themselves, but they did and do still have a choice. One of the best potential endings for this war would be of the Russian soldiers turned around and went home to overthrow the corrupt government that sent them there. However, if you take away their personal culpability from the killing and war crimes currently taking place that dramatically lessens the chance of that actually happening. Instead, it would become something that will be debated (after the fact) as something they maybe should have done. If they understand that they are making a choice every moment they continue, then it is something that could still happen. And, yes, having choice means taking ownership over those devisions",
            "title_similarity": "0.8268533",
            "sentiment_compound": -0.8789
        },
        {
            "id": "hzjet8k",
            "score": 1,
            "text": "Putin isn’t attacking Ukraine. The country is attacking Ukraine. Putin leads the country, which means that the country does what Putin tells it to do.",
            "title_similarity": "0.7328439",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hzjf3un",
            "score": 1,
            "text": "> Putin invaded Ukraine \n\nI doubt Putin has even stepped foot within 500 miles of Ukraine in the last couple weeks. Russian soldiers invaded Ukraine. Would the army have attacked without his order? No. But could he have attacked without their willful participation? Also no.",
            "title_similarity": "0.7668968",
            "sentiment_compound": -0.797
        },
        {
            "id": "hzjibh0",
            "score": 3,
            "text": "The world made this mistake with Zimbabwe. They kept blaming Robert Mugabe for all the illls and now years after his death nothing has improved.\n\nIts never one guy. It's a network of cronies, true believers, systems of corruption, millions of voters etc.\n\nIts never one guy. Taking that one guy out doesn't change the rest.\n\nPutin invading did not happen without all of those things.\n\nThe only value in blaming Putin is as propaganda and giving other Russians with power a way out of the situation by removing him.\n\nPower is a complex mesh of people and systems. Not one guy.",
            "title_similarity": "0.78470534",
            "sentiment_compound": -0.8751
        },
        {
            "id": "hzjjk7t",
            "score": 1,
            "text": "russia has a leader. his name is putin.. he isn't personally out there fighting on the lines.. so no... just language wise its incorrect to say that Ukraine is at war with putin. they are at war with russia.",
            "title_similarity": "0.79867566",
            "sentiment_compound": -0.802
        },
        {
            "id": "hzjjtk6",
            "score": 5,
            "text": "Except it’s not just Putin\n\nIt’s not the whole of the civilian population, but there are many levels of government required to wage a war. Not even a dictator can make that call on his own.",
            "title_similarity": "0.7071049",
            "sentiment_compound": -0.7469
        },
        {
            "id": "hzjofvp",
            "score": 1,
            "text": "It's all about him and his cronies. Not much to do with the average Pavlovs or Dashas in Russia.",
            "title_similarity": "0.595098",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzjpq27",
            "score": 1,
            "text": "There is no changing your view. You are right. This is a war between a dictator and an innocent country",
            "title_similarity": "0.6148981",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hzjrkr9",
            "score": 1,
            "text": "Don't forget the Kremlin is supporting him 100%.",
            "title_similarity": "0.29664823",
            "sentiment_compound": 0.5523
        },
        {
            "id": "hzju5to",
            "score": 1,
            "text": "In case you haven’t seen it yet, there is a LARGE number of Russians who believe their narrative and support him in his endeavors next door. It is by far much more than just Putin doing this. Oh also, for what it’s worth the majority of the people in support of their “special military operation” look to be older than 50.",
            "title_similarity": "0.5966555",
            "sentiment_compound": 0.765
        },
        {
            "id": "hzjuha4",
            "score": 2,
            "text": "For every single person forced to act there needs to be multiple people forcing them. If it were truly just Putin, the population would just say \"Nah\". What would he do then?",
            "title_similarity": "0.6956233",
            "sentiment_compound": -0.128
        },
        {
            "id": "hzjv928",
            "score": 8,
            "text": "I am Russian (though I live elsewhere) and I don't support this war, so I like this idea very much, however...\n\n> majority of Russians are not in favor of the current direction of the country.\n\nUnfortunately this is not true. The current Putin's rating is estimated to be around 71%, up from 64% before the war. It's hard to tell how much you can trust those numbers, but they seem consistent with my experience. There are real people I know that believe Putin.\n\nMany Russian people are brainwashed by the state propaganda. Putin currently controls all Russian news sources: TV, radio, internet news websites. The last few independent outlets were closed in the last few days.",
            "title_similarity": "0.84208703",
            "sentiment_compound": -0.8199
        },
        {
            "id": "hzjvmqa",
            "score": 5,
            "text": "No we shouldn’t. Russians bear responsibility for keeping putin in power. Most russians support putin and his actions. \n\nWe should not demand russians answer for having putin in power and being apolitical people. We should demand that they begin self-reflecting and asking themselves why are they not living like Norwegians when they have so much oil and rare element resources. \n\nNot once in a thousand year of existence of russian (muscowy) state, have its people had democratic or half-decent (in terms of being humane) leader. Its a threat to word peace to continue on living 100-50 years behind europe in terms of mindset and political reforms (slavery, serfdom, abolishment of monarchy, oligopoly, democracy). World wishes the best for russians, but russians don’t wish the best for themselves. Yet.",
            "title_similarity": "0.82598376",
            "sentiment_compound": 0.8798
        },
        {
            "id": "hzjwsx4",
            "score": 1,
            "text": "Russia doesn't refer to the Russians though, it refers to a political power. It's okay to say \"Russia threatens nuclear war\", but not \"Russians threaten nuclear war\". It's just the way things are said, Germany invaded Poland, Soviet Union invaded Afghanistan, it doesn't say anything about the people who live there. Obviously those decisions are made by the government.  \n\n>Putin was elected \n\nWith the staggering 99% of the votes no less",
            "title_similarity": "0.8259788",
            "sentiment_compound": -0.8471
        },
        {
            "id": "hzjxprr",
            "score": 1,
            "text": "What about Belarus? Since we know that Belarusians do not support Lukashenko, can we say with higher confidence that Lukashenko is attacking Ukraine and not Belarus? So it is not just about a one person regime but its public support as well.",
            "title_similarity": "0.8225646",
            "sentiment_compound": 0.7254
        },
        {
            "id": "hzjyw17",
            "score": 2,
            "text": "Citizens always have two choices: Face the consequences of their leaders actions or rebel and become an enemy of the state.  That's it.  Or in other words, if the people aren't rebelling, they are just an extension of their government, and their government is an enemy to the world right now.",
            "title_similarity": "0.7304772",
            "sentiment_compound": -0.7774
        },
        {
            "id": "hzk1fdb",
            "score": 1,
            "text": "I get the point, but disagree.\n\nThe army attacking Ukraine is not some mercenary army Putin hired. It is the Armed Forces of the Russian Federation. These are russian soldiers, the sons and daughters of the Russian people. Financed by Russian taxes, supplied by Russian factories and farms.\n\nPutin is the leader of the country, deciding how it spends its resources and applies it's miltary. He controls the media and the information the people have access to.\n\nAnd it is always always the responsibility of a people to put into power responsible leaders, to prevent them from achieving such ultimate power that they can no longer be challenged or ousted. To get rid of them when they go to far.\n\nPutin has effectively instituted himself as dictator, or at the very least the undisputed leader of an oligarchy. The Russian people failed to stop him, either because they didn't see it in time, were outmaneuvered, or simply didn't care enough.\n\nAnd opposing him now is difficult and carries significant personal risk, while at the same time being hard to figure out that you need to do because of said control of media. They should have done it earlier. He has showed clear dictatorial tendencies for decades. It has not been a carefully hidden ambition. \n\nBut even with the danger, it is still ultimately the responsibility of the Russian people to stop him. Because it IS their country attacking, their money financing it and they who bear the brunt of punitive economic sanctions.\n\nI still agree that we shouldn't punish or demean individual Russian citizens who aren't government officials or wealthy oligarchs in Putins circle.\n\nBut the people living in Russia do have a responsibility for the government they put in place, or fail to stop from seizing power. Because it IS their country.",
            "title_similarity": "0.8039875",
            "sentiment_compound": -0.9841
        },
        {
            "id": "hzk2570",
            "score": 1,
            "text": "I'd prefer it everyone said \"Pupin\" going forward...",
            "title_similarity": "0.34115773",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzk2ft9",
            "score": 1,
            "text": "Sadly too many russians seem propaganda brainwashed. So reasons for it nonwithstanding, if they support putin they are also to be named. Or can you say that the putin propaganda supporters are a minority in Russia?",
            "title_similarity": "0.7703382",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hzk564y",
            "score": 1,
            "text": "Many people compare Russia to Nazis. I think it’s good to look a but further back at post-WWI Germany. They were a proud country, an Empire, defeated and humiliated. And this soon led to nazism and WWII.\nUSSR may or may not have been great, but its heir Russia lost its place in the world, became poor and humiliated, and unlike most satellite or occupied states its people never dealt with this. The KGB colonel with absolute power certainly didn’t. They see the West as encroaching. They want to support whatever makes Russia great again. History repeats itself…",
            "title_similarity": "0.8305603",
            "sentiment_compound": -0.4662
        },
        {
            "id": "hzk5shi",
            "score": 1,
            "text": "So long as armies still have the will to fight, and do, it's more than Putin.  An invading force is never *the country*, but they sure think of themselves as representing it if you ask them.  \n\nAnd no matter how bad it gets, even if your family is under hostage, you always have a choice.  It may not be a good choice, but we learned from Nuremburg that simply obeying orders is not good enough.  A lot of these soldiers are saying they had no idea and were lied to, but the longer that goes on, the more culpable an individual is.",
            "title_similarity": "0.7921339",
            "sentiment_compound": -0.9444
        },
        {
            "id": "hzk6vv0",
            "score": 1,
            "text": "I get what you're going for, but it isn't one man enabling this. Much like when the US president takes action, there was a large sum of people that put him in that position and a collection of people supporting him from behind the scenes. Just because you have Russians speaking out against this doesn't mean there isn't a collection of people behind the scenes enabling him and continuing to support him.",
            "title_similarity": "0.7676183",
            "sentiment_compound": 0.8922
        },
        {
            "id": "hzk7nhx",
            "score": 1,
            "text": "I would think a majority of all citizens from any country would oppose war and even in America we have absolutely no say in that. Although I do remember seeing Congress this and Congress that in old newspapers detailing the war",
            "title_similarity": "0.7682934",
            "sentiment_compound": -0.8832
        },
        {
            "id": "hzk9vsr",
            "score": 1,
            "text": "Russia is a mafioso run country. It’s an entire system of governance that is is to blame. Putin however is just the head of the snake but the body is very long. He has thousands of cronies that have enabled him but they also have tight control over what their people see in the media so they have now convinced many “innocent” people to support their cause. Your argument is too simple because it would equate to calling Hitler the sole aggressor in WW2 when he had an entire Nazi party under his command. It’s the same thing here.",
            "title_similarity": "0.74440044",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hzkbg13",
            "score": 3,
            "text": "Putin didn't march into ukraine. Putin isn't firing cluster bombs at civilian centres. Putin isn't arresting 80-year old protestors. Putin isn't willingly hosting a news show full of government propaganda and lies.\n\nEvery russian who is assisting in this tragedy is equally responsible.\n\nOnly the russian people can stop this.",
            "title_similarity": "0.8347328",
            "sentiment_compound": -0.8366
        },
        {
            "id": "hzkboze",
            "score": 1,
            "text": ">However, as I understand it, the majority of Russians are not in favor of the current direction of the country\n\nI would 't say that the 'majority' of Russians are not in favor of Putin's efforts. Sure, we see the protests on the internet, and they are very large crowds. But they are not a majority. \n\nI harbor no hatred towards the Russian people. I think Putin has jumped the shark, but to say that a majority of Russians do not support Putin I think would be a misnomer.",
            "title_similarity": "0.8160919",
            "sentiment_compound": 0.1548
        },
        {
            "id": "hzkegbl",
            "score": 1,
            "text": "Unless russians are actively rebelling, they are all \"Russia\"",
            "title_similarity": "0.71862566",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hzkfnfy",
            "score": 1,
            "text": "Putin and his state apparatus of the capitalist ruling class?",
            "title_similarity": "0.49492937",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzkjwtl",
            "score": 1,
            "text": "Can we also stop saying \"Zelenski\" and just say \"World Economic Forum Puppet\".",
            "title_similarity": "0.48627418",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzkkhdb",
            "score": 1,
            "text": "No, it is not just Putin. There is a whole government behind this. Putin is the figure head, but there is a lot of very rich and influential people who wanted this war. Not the Russian people necessarily, but definitely not just one man.",
            "title_similarity": "0.7260808",
            "sentiment_compound": 0.7716
        },
        {
            "id": "hzkn7hv",
            "score": 2,
            "text": "Russia is both a nation and a state. The people of Russia -those who make up the Russian nation- are not collectively responsible for this war, but the Russian state, which Putin leads, is. Saying that Russia did something is fine, as long as it's understood that what we're talking about is the Russian state, the Russian military, the Russian government, etc. and not the Russian people.\n\nThere will always be people who conflate the two, and act xenophobically towards Russian nationals, but I don't think we'll cure people's prejudice by changing the way we speak.\n\nSaying that \"Putin did x\" or \"Putin did y\" is also reductive. He's a dictator, yes, but he's not the only one in charge. Lots of Russian politicians, oligarchs, and generals had to sign off on this invasion. The fault lies with the entire Russian government.",
            "title_similarity": "0.8394697",
            "sentiment_compound": -0.8714
        },
        {
            "id": "hzknp5u",
            "score": 1,
            "text": "Is this CMV or CYV, i.e. Change Your View, you want to keep your view but change everyone else's?\n\nIs there a subreddit for that?",
            "title_similarity": "0.50913036",
            "sentiment_compound": 0.1306
        },
        {
            "id": "hzknyus",
            "score": 1,
            "text": "Putin isn't driving the tanks, flying the helicopters, shooting the guns, launching the missiles...\n\nThis is a coordinated effort by the whole of the Russian government and military, under the orders of one person.",
            "title_similarity": "0.69292724",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzkov6x",
            "score": 1,
            "text": "It is really one and the same. Putin was \"elected\" \"legitimately\", but Russia is made up of people and they choose to follow Putin. If Biden decided to invade a country then we would say the US invaded not Biden invaded. When we \"liberated\" all those other Asian countries in the past it wasn't said Bush, Obama, Bush, Trump, or Clinton was invading them. During every war there are protests. During every war there is propaganda from both sides as PART of the war. Hell, even the war on drugs had propaganda and arguably was MOSTLY a propaganda war. Every election is a propaganda war. Putin isn't riding in a tank in Ukraine. Putin isn't shooting. Putin is in a ritzy palace giving orders and people are following him bc he is recognized as leader of the nation and authorized to make decisions for that nation. Electing a person has consequences and even if you didn't vote for, don't agree with, or completely disagree with actions of the one elected, to the other countries that is irrelevant.",
            "title_similarity": "0.83115906",
            "sentiment_compound": -0.9959
        },
        {
            "id": "hzkpi2y",
            "score": 1,
            "text": "Russia keeps empowering militaristic tyrants like the later Romanovs, Stalin, and now Putin. Without blaming random individual citizens, at what point are you allowed to acknowledge there is something systemic to it?",
            "title_similarity": "0.7699485",
            "sentiment_compound": 0.6283
        },
        {
            "id": "hzksofk",
            "score": 1,
            "text": "Putin is the leader of Russia, and thus represents them. Whatever he does on the worldstage is what Russia is doing on the worldstage. If Putin is invading Ukraine, then Russia is invading Ukraine and vice versa. \n\n> We have no problem saying \"Trump allowed Covid to get out of hand\" or \"Biden caused inflation\" instead of \"the US caused inflation.\"\n\nIt's understood those statements are referring to events within the US. You could place blame on the president, or you could blame nearly countless other people in charge relating to those events. However, when the US is interacting with other countries on the world stage, as leader of the country, responsibility falls to the president by default. It's typically used interchangeably between [president/PM] vs [country] does [X thing].",
            "title_similarity": "0.8610526",
            "sentiment_compound": 0.1675
        },
        {
            "id": "hzku2mt",
            "score": 1,
            "text": "it's easiert to say the countries name instead of who actually in charge or whatever they're doing. do you know who's n charge for germany, fance, spain, usa, japan and so on? i dont and i certainly will not remember the name of those people who mean nothing to me. i barely remember the names of my extended family so thats that... of course i know not the country as a whole i meant but the people who are in charge and those who follow them.",
            "title_similarity": "0.63881767",
            "sentiment_compound": -0.1326
        },
        {
            "id": "hzku884",
            "score": 1,
            "text": "If this is how you go about recalling historical events, you're in for a lot of research. \n\nThe Americans no longer dropped the atomic bombs, the then-president did. The battle of agincourt is now the battle of whoever the leaders were at that particular time. The sino-Japanese war is now emperor vs ruler. \n\nObviously, this isnt the way things are remembered, and it's for good reason. No one leader acts alone.",
            "title_similarity": "0.765723",
            "sentiment_compound": -0.891
        },
        {
            "id": "hzkufes",
            "score": 1,
            "text": "Then stop saying \"China\" and start saying \"Xi\".",
            "title_similarity": "0.40164837",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzkvgeg",
            "score": 1,
            "text": "If you put a government's responsibility on a single individual, all they have to do is cut him loose to absolve themselves.",
            "title_similarity": "0.6132122",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzkvifn",
            "score": 1,
            "text": "No. Putting behavior reflects on Russia's people and they are partially complicit.",
            "title_similarity": "0.6488234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzkxmbs",
            "score": 1,
            "text": "By all accounts 60-70% of Russians support Putin and his actions. So I think it's just a matter of semantics.",
            "title_similarity": "0.6220442",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hzkz257",
            "score": 1,
            "text": "Just one point - russian people respect orders since they're indoctrinated or because they are afraid. Yeah, Putin is the main \"villain\" in this situation, but you could still blame the russian people for respecting orders or for not starting a revolution. Also, if you see some of the clips about the war crimes you can see SOME soldiers going out of their way to hurt or kill people. Yeah, some are psychos and I can't use them as a rule, more like an exception... \n\nTbh, I think it's a bad situation overall, even for the russian people who can be blamed, at most, for their previous inaction. But if we do that, we should blame all the people who lived in system based on indoctrination and propaganda.",
            "title_similarity": "0.831174",
            "sentiment_compound": -0.9811
        },
        {
            "id": "hzkz6uv",
            "score": 1,
            "text": "Americans have a two party system and in that two party system you have people who blindly agree to whatever is said by their affiliates. To this day whether its deep seated racism or the effects of the \"terror\" propaganda people get nervous when a middle eastern enters a plane with them. It's the same for Russia and some of the people agree with their leader.",
            "title_similarity": "0.7123829",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzl27bm",
            "score": 1,
            "text": "If we talk about WW II we say Germany, or Nazi Germany  - not just Hitler. The same applies to the current situation in Russia. It's not just the work of one men, but the fault of everybody who enables that person.\n\nThe truth is that we can't stop Russia from the outside without escalating the situation and risking a 3rd World War. The change has to come from within Russia. Every Russian has to be made aware that they are participating in evil if they don't resist, thus we should definitely say Russia and not just Putin. there are millions of people who voted for him, ten thousands who cross the boarder to invade another nation and a country where - so far - the majority remains silent, while the situation is escalating further and further.",
            "title_similarity": "0.87415415",
            "sentiment_compound": -0.9025
        },
        {
            "id": "hzl2ibs",
            "score": 1,
            "text": "there were quite a fer people in Germany who were against the Nazis and hitler didn't act alone. We need a name for the Russians who act on Putin's behalf, like Puties or Vladhats.",
            "title_similarity": "0.7822781",
            "sentiment_compound": 0.5007
        },
        {
            "id": "hzl2nn9",
            "score": 1,
            "text": "I feel for the Russian people, I really do. But you have to understand that the support of the Russian people, and the guise of popularity, has been instrumental in Putin's rise to power and continued authoritarianism. \n\nIndependently nongovernmental polling shows that not only did most Russians feel that [Russia was not to blame](https://www.themoscowtimes.com/2021/12/14/2-in-5-russians-believe-war-with-ukraine-likely-poll-a75816) for the invasion of Ukraine   [Putin's numbers actually went up when he announced it.](https://www.pbs.org/newshour/world/putins-public-approval-soared-as-russia-prepared-to-attack-ukraine-history-shows-its-unlikely-to-last)\n\nEdit: nm, I see you already responded with a Delta to someone who said something similar.",
            "title_similarity": "0.82811713",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hzl38zg",
            "score": 1,
            "text": "What is your view on the CCP and Xi, does your view still hold water here as well?",
            "title_similarity": "0.12094915",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hzl66ji",
            "score": 1,
            "text": "We should stop saying \"German\" and start saying \"Nazis\"\n\nWho *elected* the Nazis? Germans. Upper and middle class Germans.\n\nSame demographic elected Putin. Same demographic elected Bolsonaro, Duterte, and Trump.",
            "title_similarity": "0.63064474",
            "sentiment_compound": -0.296
        },
        {
            "id": "hzl675w",
            "score": 1,
            "text": "What if China started to form a nuclear coalition around Central America. And then they decided they wanted to add Mexico. Do you think the US would be cool with that or would they try to control Mexico?",
            "title_similarity": "0.5781803",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hzl9j53",
            "score": 1,
            "text": "Putin isn't the whole government. Do you think if he disappeared Russia would be any different?",
            "title_similarity": "0.7021629",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hzl9jm9",
            "score": 1,
            "text": "The US DID let Covid get out of hand. Trump was not helpful, but he didn’t single handedly remove people’s masks and make people refuse to get vaccinated. The hardest part about having a bad president is realizing he/she is a reflection of enough of your fellow citizens to be in power.",
            "title_similarity": "0.74422383",
            "sentiment_compound": -0.7973
        },
        {
            "id": "hzlahfa",
            "score": 1,
            "text": "You know how, in programming, you can test code, by feeding it various kinds of input, and checking if the output is what you expect?\n\nTurns out, that applies to all assumptions about cause and effect, not just the ones that take place inside a microchip. We can do this here, as well. It's just that it's gonna be hypothetical, because I'm not able to actually feed in the necessary input, and I assume neither are you.\n\nThe test is very simple: someone with the capability (someone in the US government, most likely) orders a missile strike on Putin's location, causing him to evaporate into a large number of tiny, invisible little particles. Become one with the Universe, so to speak. So beautiful. I'm smiling just thinking about it.\n\nIf your theory that Putin is the sole cause of this ongoing act of mass murder is correct, that should solve all our problems. The invasion of Ukraine stops,  Russia withdraws, end of story.\n\nDo you think that's what would happen?",
            "title_similarity": "0.70723766",
            "sentiment_compound": 0.5131
        },
        {
            "id": "hzldu28",
            "score": 1,
            "text": "There's so much victim blaming going on in this thread you'd think a girl got raped at a frat party",
            "title_similarity": "0.57028735",
            "sentiment_compound": -0.829
        },
        {
            "id": "hzle0ug",
            "score": 1,
            "text": "I know what you mean here but this is the danger of dictatorship.  The leader essentially is the state, and we don’t usually distinguish between the state and the country.  \n\n\nLike we say the US did x when we mean the US govt.  now the president has much of the authority on that but isn’t the sole executor of government power.",
            "title_similarity": "0.6548333",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hzle4cv",
            "score": 1,
            "text": "I think there are some good points here re: the culpability of the Russian soldiers and people. But I want to point out something bigger: what \\*is\\* Russia?\n\nA country is not simply a list of people who live in some arbitrarily-delineated area. If that were true, then no country could ever invade another country. For example, is it the United States invading, or is it Congress? Etc. Nor could it do anything else, like enact laws or be good at basketball. Reassigning responsibility away from the country deprives the term \"country\" of the definitional heft it clearly has.\n\nThat's because a country is _also_ a set of government institutions (including foreign policy and military), a status in the international community (e.g. the UN recognizes an entity called \"Russia\" with X borders and Y leadership), and a culture. The actions that cluster of stuff takes is what it means to say a country does things. And while the definition of a country is a little loose, it's certainly tight enough to be confident that when a country's army invades its neighbor, that the country is doing the invading.\n\nThe point that Russia's policies are a poor representation of the will of its people is true enough, but that doesn't mean that Russia isn't invading Ukraine. Instead, it means that the Russian people aren't, collectively,  _in control_ of what Russia is doing. But Russia is still doing it! A country's policies could range anywhere from a perfect representation of its people's collective will to purely the whims of its dictator and anything in between, but in any case they're still the country's policies.\n\nI suspect some of the confusion here is that democracies have allowed us to reasonably hold populations accountable for the actions of their country, because--if you squint a bit--the country's actions are a reflection of its citizens' desires. And because we've gotten so used to this property of democracies, we tend to confuse the country with its people. Then something comes up where that doesn't apply, and we follow the logic the wrong direction.",
            "title_similarity": "0.7817514",
            "sentiment_compound": 0.9293
        },
        {
            "id": "hzlfv2o",
            "score": 1,
            "text": "u/angryupvote",
            "title_similarity": "0.32585526",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzlh2v7",
            "score": 1,
            "text": "How about “Russian Army” or “Russian military”?",
            "title_similarity": "0.44366854",
            "sentiment_compound": 0.0
        },
        {
            "id": "hzlhx5f",
            "score": 1,
            "text": "No, don’t change his view. It’s correct. Putin lies to his people. Many of them don’t even know that they are the people taking freedom. They are being told shit and they can’t doge that because Putin controls all media in Russia. The bad person is Putin (and maybe some followers). But calling all Russians bad is like calling all Gernans Nazis just because there are some and there were some.",
            "title_similarity": "0.84570265",
            "sentiment_compound": -0.6542
        },
        {
            "id": "hzlkcb3",
            "score": 1,
            "text": "I dont agree with this wholly, but i understand your point. Russia is a nation where it is not the easiest thing to get free and open information. They are not north korea, but in some aspects they arent far off. That is not too say the population is completely brainwashed, but propaganda still works very well for a considersble amount of the population there. Now i understand why youre saying what youre saying, putin is running a one man show in the government and you shouldnt blame the entirety of the populace for the actions of a single man, but its importsnt to take into consideration russias nationalism problem.\n\nMuch like the US under trump, putin has a loyal core of supporters that disregard his scandals in favor of blind loyalty, then he has supporters outside of that which while not radicals will still generally speaking believe him as they dont very often go out of there way to disagree with him. That is obviously not to say everyone, as the last weeks protests make obvious, but still it is a problem, and it is not a minor portion of their population. \n\nIts not a 100% clean \"his population is brainwashed\" or \"everyone hates him but cant get to him\" situation, its a lot more grey than that, and thats important to keep in mind when judging russia for his actions.",
            "title_similarity": "0.7753226",
            "sentiment_compound": 0.2257
        },
        {
            "id": "hzll2sy",
            "score": 1,
            "text": "Putins approval ratings were at an all time high after the first time he invaded Ukraine. It’s nice to think that all or most the Russian people are completely against this war but that just didn’t seem to be true, at least not yet maybe a while living under sanctions will change that.\n\nBut it is important to remember to not be racist or prejudice to any Russian person at all.",
            "title_similarity": "0.8704349",
            "sentiment_compound": 0.6959
        },
        {
            "id": "hzllfdn",
            "score": 1,
            "text": "It seems most people are tackling the moral question of responsibility, but I disagree with this on simpler linguistic grounds - it's just really common to use \"<country>\" in a geopolitical context to mean \"<incumbent government of country>\". Like when I say \"America invaded Iraq\", I don't mean you personally",
            "title_similarity": "0.76440525",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hzln9t6",
            "score": 2,
            "text": "As the one who lives in Russia I have to share my view from the inside. Russia turns into North Korea 2.0 with increasingly rapid pace. For only the last week we have blocked Facebook, Twitter, BBC, DW, CNN, Voice of America, all Ukrainian mass-media; most of our local independent mass media have been blocked or stopped saying anything about Ukraine out of fear of being closed/imposed/imprisoned. We have several new laws that prohibit to show any support for Ukraine, otherwise you may get imprisoned for many years like if you'd commit murder (luckily the govs don't know English). Government mass-media streams wild propaganda 24/7 producing only fear and hatred toward Ukrainians/Europeans/Americans. Most of people have no other sources of info, most of our elections are faked. Now our currency declining value, or economics falling in moreover.\n\n&#x200B;\n\nIf you get into the streets with any kind of protest, you definitely will be beaten by police and get a big fine for first time. For the second - arrested, imprisoned, most likely tortured and sometimes even killed. Russia now is ready to war against its own people more than against an enemy without. I guess most of people who support this war are simply deceived, brainwashed and blind. And it's still 31% who officially doesn't support it. Put the blame on all of us is something like blame the hostages for actions of terrorist captured them. Don't y'all agree it'd be fair for any other kind of political system, but not for totalitarian dictatorship?",
            "title_similarity": "0.8142308",
            "sentiment_compound": -0.9716
        },
        {
            "id": "hzlo511",
            "score": 1,
            "text": "[Putin is not alone. Here is a video of Russians supporting the invasion of the Ukraine.](https://youtu.be/9VDf1fvbc-E)",
            "title_similarity": "0.74007463",
            "sentiment_compound": 0.5632
        },
        {
            "id": "hzlt4ab",
            "score": 1,
            "text": "Simple opposition: All governments rule by the consent of the governed to some degree, and Russia is no exception. Putin alone is just one man, and a lone man is not capable of invading a country. Whether or not they like it, Russian generals are still issuing his orders, Russian soldiers are carrying out those orders, Russian taxpayers and laborers are providing pay and supplies to those soldiers, etc.\n\nEven as of last week when Vice was doing street interviews in Moscow, lots of people were still very vocal about supporting the invasion and Putin.",
            "title_similarity": "0.75928634",
            "sentiment_compound": -0.6034
        },
        {
            "id": "hzluhmu",
            "score": 1,
            "text": "Well they did that in the final war with Napoleon",
            "title_similarity": "0.4422862",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hzmvv41",
            "score": 1,
            "text": "At this point, saying the Russian people are without blame is simply untrue. I have many Russian friends and although none of them are particularly trusting of Putin, they all display some ambivalence to the war. This is understandable to an extent considering all the propaganda but this isn't North Korea we're talking about and people have (or at least *had*) access to non-Putin-aligned media. Yet the protests are too small to have any real effect. Of course, it's hard to protest when you live under a dictatorship, but Putin and his cronies are a very small group of people who are currently driving their country head-first towards destruction. For Russians to just close their eyes to this is, in my opinion, soon going to be completely inexcusable.",
            "title_similarity": "0.8316865",
            "sentiment_compound": -0.8716
        },
        {
            "id": "hzndhj1",
            "score": 1,
            "text": "Putin this dick in your mouth",
            "title_similarity": "0.3605669",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hzpnry8",
            "score": 2,
            "text": "To remove “Russia” completely from the descriptor may be disingenuous. Putin is only in power because many other Russians have supported him and continue to support him. These supporters may be a minority, and mostly oligarchs and sycophants, but still, Putin couldn’t have become what he is and do what he’s doing alone. \n\nI see the spirit of what your saying. Calling Nazi Germany simply “Germany” during WWII would have been a disservice to the German people as a whole. It would have communicated an oversight of the reality that a dictatorial regime is the one calling the shots. This is why we said “Nazis” or “the Third Reich” or “Hitler and the Nazis” or “Nazi Germany” (instead of just “Germany”). \n\nFollowing on with that last example, I think you’re on to something when you say we should get away from simply saying “Russia.” Maybe “Putin’s Russia” (implication that there is, could, and should be a Russia without Putin) or “The Putin Regime” (implication that he isn’t acting alone) would be better.",
            "title_similarity": "0.8281969",
            "sentiment_compound": 0.6542
        },
        {
            "id": "hzrkgbq",
            "score": 1,
            "text": "So should we also not say Nazi Germany, just Hitler? \n\nYou’re also overlooking the hundreds of thousands, if not millions of Russians who are in total support of this war of aggression. Look at all the Russian influencers who are spouting anti-Ukraine propaganda on social media.",
            "title_similarity": "0.78939706",
            "sentiment_compound": -0.6258
        },
        {
            "id": "hzroudt",
            "score": 1,
            "text": "I understand this point of view, but even a murderous spy and mob boss who becomes president and installs himself as leader for life, is nonetheless the head of the state.\n\nIn fact I think it could be argued that Putin is even more a representative of the Russian civilization as he is it’s totalitarian and absolute ruling head, compared to say Justin Trudeau, Prime Minister of Canada, who is democratically elected, has far far far less power and any sway over the machinations of governance, & will be replaced, whereas Putin is in power until deseated.\n\nRelevant to this discussion is Louis XIV, who brought France to its peak of absolute power and his words 'L'etat c'est moi' ('I am the state') expressed the spirit of a rule in which the king held all political authority.\n\nSo I’d say, that most democratically elected leaders are not their country. But Captain Poutine, or Putin, whom is the head authoritarian of the Russian Federation is indeed indivisible from ‘Russia’, semantically.  It is up to the Russian people to depose Putin if they don’t like what Russia has become. \n\nPutin is Russia. Any civilian who supports an aggressive and war-making nation is to some small measure responsible for that nation-state’s actions, even through lack of disobedience they permit whatever empire they belong to, to flourish.",
            "title_similarity": "0.76575255",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hzuzmij",
            "score": 1,
            "text": "\"The Levada Center, one of the few independent pollsters in Russia, says that 50 percent of Russians see the United States and NATO as responsible for rising tensions. Fewer than 5 percent blame the Kremlin.\"\n\n[https://www.nytimes.com/2022/02/04/world/europe/russia-public-opinion-ukraine-us-nato.html](https://www.nytimes.com/2022/02/04/world/europe/russia-public-opinion-ukraine-us-nato.html)\n\n\"The results show that as of 26-28 February, 58.8% of Russian citizens support Russia’s actions in Ukraine, whereas only 34% of Russians do not support the war. The level of support of the war among Russians over 60 reaches higher – more than 70%. However, among younger people (18-29) the positive view drops to about 40%. Half of the respondents aged 18 to 44 gave a negative assessment of “Russia’s actions in Ukraine.\"\n\nAfter the outbreak of war in Ukraine, almost 50% of Russians’ attitudes towards Putin changed for the better. Only 23% of Russians began to regard Putin for the worse. Significantly, only 25% of Russian citizens believe that the current events have not affected their attitude towards Putin at all.”\\*\n\n[https://euromaidanpress.com/2022/03/06/nearly-60-of-russians-support-putins-war-against-ukraine/](https://euromaidanpress.com/2022/03/06/nearly-60-of-russians-support-putins-war-against-ukraine/)\n\n\\*The poll does not refer to Russia's actions as an invasion, but a \"special military operation\". Still surprising results nonetheless\n\n**TL;DR: Russians largely support Putin's war against Ukraine, at least as of now. So it's not just Putin, but the majority of Russian society. There is still significant opposition, so it would be wrong to say** ***all*** **Russians support the war. Ultimately, everyone should be judged as individuals. But with that in mind, it would also be wrong to suggest this is an initiative solely supported by Putin and his oligarchs.**",
            "title_similarity": "0.66556513",
            "sentiment_compound": -0.7531
        },
        {
            "id": "hzvg3we",
            "score": 1,
            "text": "I think we should say \"the Russian government\". Not blame the people but if he was entirely alone they'd get rid of him. Government and oligarchs should share some of the blame.",
            "title_similarity": "0.79636586",
            "sentiment_compound": -0.4062
        },
        {
            "id": "hzwqqb9",
            "score": 1,
            "text": "The deceived are not absconded of guilt.",
            "title_similarity": "0.20026398",
            "sentiment_compound": -0.27
        },
        {
            "id": "i07ya3p",
            "score": 1,
            "text": "People talk about Nazi Germany all the time and not just Hitler, too. I know that many Russians are against Putin but they also know that many didn't care about changing something in the last 20 years. They let them get themselves into this position. Now they all have to deal with it. I won't have any empathy with Russians as long as Ukraine is bombed like that and every Russian crying about it should feel ashamed while is living in a safe and warm home.",
            "title_similarity": "0.8461478",
            "sentiment_compound": -0.5093
        },
        {
            "id": "i1fgmlz",
            "score": 1,
            "text": "Putin is preparing himself to be the world power but I will sit back and look what Biden gonna do about that \n\nPutin have be the number one heartless man in the whole world right now \n\nBut however let wait and see what gonna happen next",
            "title_similarity": "0.7351094",
            "sentiment_compound": -0.5927
        },
        {
            "id": "i2am573",
            "score": 1,
            "text": "It’s extremely obvious. He is giving orders to Russian personnel not Putinian personnel",
            "title_similarity": "0.5960095",
            "sentiment_compound": 0.34
        },
        {
            "id": "i2elf8r",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.15241447"
        },
        {
            "id": "i2nfg25",
            "score": 1,
            "text": "Russia's engaged with decades of apathy towards Ukrainians being slaughtered, and if we can't hold Russian nazis accountable who should have been on the streets protesting ages ago, then we can't hold western ultra-conservatives or nazis accountable either. I agree with the sentiment that Russia is more of a dictatorship, but a lot of the same people suggesting that poor Russians have no conceivable way to fight their government are the same people who were saying that somehow, simultaneously, that the west is worse in every conceivable way. You do realise these are both RT talking points, right? And that centuries of nationalist, imperialist pride \\*does in fact\\* have an effect on the daily Russian and how their mentalities towards other Slavs are impacted, right? There are very real microaggressions that other Slavs, who are in fact seen as tainted and lesser-than, and we as the \"lesser Slavs\" are not even seen as white by the nazis, nor Putin, who many Russians DID IN FACT support. So yes, as someone with family in Russia, I wish them all the best, and I wish from the bottom of my heart, that they didn't have to suffer. But again, this is why MILLIONS of them need to be in the streets, not just merely thousands. If Belarus in 2020 could do it to their openly messed up dictatorship, so can the Russians. If Ukraine has to be out there, perhaps it's time for the Russian people to take notes from the people they have colonized for centuries. Because when Ukrainians were peacefully protesting these past decades, they were not simply jailed. They were shot in the head with sniper rifles from rooftops and disappeared, by the Russian government. Does anyone here know what it is like to grow up as a Slav and have every other fellow Slav EXCEPT your Russian friends and family understand, that it is NOT OK to make Blood and Soil implications by saying that we are the exact same, and that we are being too whiny to want our own autonomy? Have you ever had to live with that kind of infantilization by your fellow neighbours being called ethnic slurs and being made to feel lesser than for your culture, only to have it constantly appropriated and mixed up with Russian things because, Russians INSIST that you belong to them as their property? Because a lot of Palestinians, Afghani and Syrian people seem to agree, that this stuff really hurts people, and the benefitting people really need to look inwards to confront their problematic behaviour. I hope this war has been a wakeup call for the vast majority who were silent all these years. And don't pretend like Russians don't have access to social media, because they do. And the Russians that migrate to other parts of the world INCLUDING Ukraine, still insist on maintaining these awful imperialist and supremacist views, whether fully conscious or not. Nations which live with the privilege and off of the suffering of other people, who are comprised of hundreds, no thousands of ethnic groups, tend to become indifferent to the suffering of those they have dehumanized all these years and look down on them. I urge anyone here to listen to Terrell Starr's podcast The Black Diplomats, on the matter of Russian Colonialism and how it draws a lot of parallels with western colonialism and slavery. He is a black American journalist reporting in Ukraine as we speak, and he's made it his life's work to teach arrogant westerners who are severely misinformed on eastern Europe and its history. Now if you'll excuse me, I have to go see if my Russian friend's mom who has been posting selfies of herself attending Moscow plays, swimming in olympic-sized swimming pools and eating exotic desserts and posting it to instagram why she keeps ignoring and refusing to share any fundraisers for my dead family members' bodies to be transported somewhere safe, and no I am not kidding about either of these things. Russians use VPNs to still use instagram and facebook, and nowhere have I seen once, any expressions of solidarity with the Ukrainian people on these profiles, which are protected by said VPNs. Please understand why it's difficult for some of us to have sympathy for famous Russian YouTubers right now. That Roman guy. He will be fine. He has his life, he has his limbs, he has his family, unless they are the literal Russian nazis who insist on keeping up with the invasion and genocide of my people. He is now outside of Russia and you know what, he is safe now to talk about Russia's nationalist supremacy problem and share a fundraiser for Ukrainians with his huge platform. But instead, we get sort of a half-admission that his country fucked up, and it is all blamed solely on the government. Why then, whenever people bring up Azov, do people not lend the same curtesy to them? After all, they are just some poor, misinformed little boys who don't know any better. But no, instead we get this double standard where Ukrainians are held to a higher standard of scrutiny for some reason, because of this internalized dehumanization of my people. And speaking of which, you know how a lot of Russians like to point out that Ukraine has a nazi problem? Well then I urge you to look even beyond Putin's party and the oddly-similarly-named Russian National Unity party, which has over 200x the number of openly-admitting members since its establishment, than azov. Oh, and that's not the beginning. Dugin's various Nazbol parties, and of course we haven't even gotten to the countless nazi militias functioning both within Russia, and the Russian ones slithering in Ukraine over the last decades and slaughtering our people. Uh, yeah, Russia, YOU need to take some responsibility and deal with YOUR nazi problem. If you are gonna claim that you can't storm the government building there then you can at least deal with the many, many Russians amongst you, who are in fact, literal nazis. Another reason I feel a little embittered by very popular YouTubers on this matter. Has Roman ever talked about his country's colonial history and widespread nazi problem, that not only impacts countless ethnic minorities in Ukraine, but also the million Muslims living in Russia? How about the Jewish communities constantly being threatened by them? Do you see how a simple \"uhh yeah, i know guyyz, that uhh, Ukraine has it worse than us, but let me make the majority of my videos about me\", after literal crickets on the problematic elements of his country, just can't really be very well-received by a group of people who are in the middle of being genocided? Now if Roman has in fact covered Russia's nazi problem in an entire video and dedicated other videos discussing Russia's fascist bloody hands on the matter, then please do DM me the links, and I will apologize. I do wish him the best, as much as he has taken the time to wish us the best. I really hope that with his privileged reach he can get some fundraisers going for both him, and the Ukrainian people. In the meantime, feel free to like who you like. Support him. But please, Russia, for the love of gods, please work on your nazi problem. Those are the ones who are rubbing shoulders with you on the streets. These are the people who have been coming into our lands, spreading misinformation, indoctrinating young boys to believe that it is ok to kill us. Those are the people who voting or not being able to vote, will not affect regardless. You DO in fact have the power to address this very real problem. Do that for yourselves, do it for the Ukrainian people. Do it for the world. And PLEASE encourage our YouTubers to talk about this!!!!!!! So many are making ridiculous claims like \"there are no progressive people in Ukraine\" and that is infuriating, considering a close friend of mine recently was killed in Kharkiv by Russian fascist invaders. The ignorant boys have already long-since surrendered, and the bloodthirsty nazis remain. Activists all over Europe are united in the fight against Russian fascist imperialism, no matter what anyone from the outside tries to tell you. And I can't believe I have to add this in, but yeah, be extra vigilant when defensive Russia-posting starts happening. Half the reason this war was allowed to happen and a lot of the world turned their cheek was because of ignorant Russian student being paid to sit in front of a computer monitor and post on reddit, Twitter, facebook and YouTube comment sections. (yes, i'm talking about bots and troll farms). If they can do it, then Russians can work together to do counter-information to combat all of the misinformation they've been feeding the world for years and years. Thank you.",
            "title_similarity": "0.8683327",
            "sentiment_compound": -0.9454
        }
    ]
}