{
    "CMV: Alopecia is not a disability. Chris Rock’s joke was not ableist\nAlopecia is a medical condition but it is not a disability. A disability in my view is a condition or set of symptoms that limits how someone physically moves around in the world, or interpersonally interacts with the world. Jokes about disabilities in general are ableist because it belittles the extra efforts people with disabilities make to adapt in a world that is designed for ‘able’ people. \n\nBut alopecia is just hair loss. It doesn’t physically restrict someone from moving through the world or limit how they interact with others. \n\nI accept that alopecia can cause depression and anxiety etc which if severe enough can constitute a disability. But that’s depression/anxiety, not alopecia. Calling alopecia a disability is a smack in the face for other people with legitimate disabilities. \n\nIf we’re saying it is a disability, why is male pattern baldness not considered a disability, or psoriasis, eczema etc? \n\nI don’t understand the undercurrent of commentary only that basically says that Chris Rock made an ableist joke and deserves to get socked in the face for. Was the joke tasteless? Yeah. Was it ableist? No.\n\nETA: it’s difficult to respond to each and everyone’s comments so I’ll summarise my take here. \n\nI have a better understanding now of what alopecia can entail and how it can impact someone’s day to day life. I still find it difficult to accept it as a disability because most people are focusing on the aesthetic aspect of alopecia (ie bald women are treated differently than those with hair, harder for them to participate in certain industries like acting, fashion etc - which I think the same can be said for people of certain ethnicities or people not being conventionally beautiful). \n\nI appreciate the varied experiences that have been shared showing that some medical conditions can be to an extent that it can be disabling. It’s made me think that my original criteria for what a disability is might be too restrictive. \n\nI don’t think my mind has been changed regarding alopecia specifically and the ableist nature of the joke, but I have a better understanding of disabilities as a whole now.": [
        {
            "id": "i2k1y6w",
            "score": 1,
            "text": "/u/-ciscoholdmusic- (OP) has awarded 2 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/tqyst3/deltas_awarded_in_cmv_alopecia_is_not_a/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.44205114",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i2k7fgu",
            "score": 10,
            "text": "It's someone being made fun of for a medical condition beyond their control. Plain and simple, The fact that people think it's okay to make fun of them for it is the problem.\nI'm an asthmatic and I have seen and heard comedians make every single tired joke about the asthmatic kid.\n\nIt's tired. None of it's newer innovative and the biggest problem in the end is that it's at someone else's expense and that is the real problem with those kinds of jokes.",
            "title_similarity": "0.67563355",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i2k0p94",
            "score": 60,
            "text": "What difference does it make if he was making fun of a disability vs another medical disorder?\n\nThis is like arguing \"I'm not racist for hating the Chinese, that's an ethnicity!\"",
            "title_similarity": "0.69868606",
            "sentiment_compound": 0.7441
        },
        {
            "id": "i2jsxr4",
            "score": 4,
            "text": "It's a medical condition.   Making fun of someone over a medical condition is classless.",
            "title_similarity": "0.7340258",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2k2ic8",
            "score": -1,
            "text": "Edit: I feel like people are downvoting me because of all the other stuff I said, but the most important point is that legally, according to ADA and SSA, Alopecia and Psoriasis/Eczema (pointing out the latter because OP asked why these aren't considered disabilities) can be considered disabilities. This one is not my opinion, just how we as a society define disability.\n\n\\_\\_\\_  \n\n\nPlease consider the intersection of race and gender in combination with this medical condition, which I would in fact consider a potential disability. (I say \"potential\" because some people with Alopecia do not consider themselves disabled, and I respect that of course.)\n\nAppearance hugely affects how a woman is considered in society, especially in regards to hair for black women. There are literally lawsuits involving cases where women were fired for not wearing makeup or heels to the office; black people were fired for wearing their hair naturally, etc.\n\nAlopecia is actually a common example cited for ADA (Americans with Disability Act.) It specifically refers to a case when an employers did not hire someone because they thought the person with Alopecia might have cancer (Alopecia can cause hair loss of eyebrows as well, and especially in women this combined with complete hair loss is perceived in a much more negative way than male pattern balding.)\n\nLegally, psoriasis and eczema can also be categorized as a disability by SSA (Social Security Administration) if it meets the requirements for disability benefits. It is categorized under dermatitis.\n\nI do not have Alopecia but I am an autistic AFAB PoC and have a whole slew of mental illnesses that greatly affects my life. I do consider myself disabled so while I can not speak on behalf of the entire disability community, I do think my voice is relevant on this topic.\n\nDo you have a disability? Because if not, it is kind of a \"smack in the face\" for \"abled\" people to declare how \"people with legitimate disabilities\" would feel in this situation. Please don't use our status as an excuse to your justification. We can speak for ourselves, thank you.\n\n(I'm sure there are other disabled people who believe Alopecia is not a \"legitimate\" disability and that is commentary I can appreciate from these people, but again, I think it is inappropriate for people outside of a particular group to speak on behalf of these people. I think you could've made your argument without trying to bring up how we are supposed to feel about this situation.)\n\nThanks for listening. I do get where you're coming from, and I hope what I said makes some sense too :)",
            "title_similarity": "0.7261259",
            "sentiment_compound": 0.7876
        },
        {
            "id": "i2jzfhp",
            "score": 386,
            "text": "Hair protects your head from the Sun. Without it you need to wear a hat to prevent sunburn.\n\nAlopecia areata totalis affects even the eyebrows and eyelashes, which means it's easier to end up with sweat from your forehead, plus other objects going into your eyes, meaning eye protection is needed and sometimes sweat bands.\n\nIf you have a medical problem requiring aids, I'd call that a disability.\n\n**Edit:** I have had a lot of responses basically saying the same thing: That alopecia is not sufficiently bad to be considered a disability, or that calling it such insults people with a \"real disability\".\n\nI'd reply to these like this: For sure it's not a condition that needs government support, and arguably doesn't need a whole lot of extra equipment, although seriously, no eyelashes *actually* *is* a much bigger deal than you seem to think it is.\n\nBut the bar of this CMV isn't about government support, or how much it affects someone's daily life. The CMV is basically saying it's **of so little of an issue that it's perfectly OK to tease someone for having no hair**.\n\nIf you honestly think that, then there's something wrong with you. It's just not OK to make fun of people's medical issues, no matter how trivial you seem to think they are, and calling that out definitely doesn't insult people who can't walk.",
            "title_similarity": "0.7245006",
            "sentiment_compound": 0.9278
        },
        {
            "id": "i2jxkaz",
            "score": 160,
            "text": ">I accept that alopecia can cause depression and anxiety etc which if severe enough can constitute a disability. But that’s depression/anxiety, not alopecia.  \n\nIsn't this a bit like saying \"I accept that a candle can cause a fire and end up burning your house down, but that was the fire not the candle\"\n\nYou're ignoring the root cause of the issue and just addressing a symptom.\n\n>Calling alopecia a disability is a smack in the face for other people with legitimate disabilities.\n\nDisabilities aren't in some competition, calling something a disability doesn't mean there is less disability to go around or something. \n\nDo you think the Paralympic athletes with no legs tell those with a mental disability that \"You're not really disabled, you still have your limbs\"?",
            "title_similarity": "0.738152",
            "sentiment_compound": -0.8225
        },
        {
            "id": "i2jsf7m",
            "score": 230,
            "text": "I also don’t think it was ableist, but it is a joke about a real medical condition, and that is something that disabled people have to deal with a lot as well, so I could see why someone could feel personally offended by it",
            "title_similarity": "0.71996725",
            "sentiment_compound": 0.4497
        },
        {
            "id": "i2khdwz",
            "score": 35,
            "text": "Two things. The second actually renders the first obsolete, but the first is worth saying anyway. Don't let it put you off reading the second if you don't like it. \n\nFirst: have you considered that your definition of what is and isn't a disability isn't relevant? The community decides what a disability is - the community as a whole, yes, but especially the disability community. If they say you're in, you're in. And it seems like they say alopecia is in. \n\nSecond: ableism isn't just about disability discrimination. Ableism is about able bodied people not considering others. Ableism is not having wheelchair ramps, sure, but ableism is also removing pandemic restrictions, causing people with health issues to have to shield because they have to limit their time amongst the potential plague bringers who are making crowds and not wearing masks. **Ableism is just people making life unnecessary hard for people who have chronic medical conditions.** And in that sense, mocking someone for a physical characteristic caused by a medical condition - something they'd done to try to own their condition, no less - is absolutely ableism.",
            "title_similarity": "0.8096045",
            "sentiment_compound": 0.2228
        },
        {
            "id": "i2nln2z",
            "score": 12,
            "text": "I feel that Jada Smith lied about having alopecia. I know a couple of people with it personally and they have smooth patches where hair won't grow at all. But Jada has a full head of hair stubs besides the thin line on the top of her head which could be from cosmetic surgery. I personally believe Jada just has the common hair thinning many women in their 50s have. \nThe reason why all this is important is because Chris Rock did NOT joke about a disease, he joked about a hairstyle; a personal decision Jada made which was to shave her head. Again, Jada did NOT lose her hair to a disease, she chose to cut it off and you can clearly see it can completely grow back if she wanted it to, even if it may be sort of thin. There are no bald patches anywhere and she has a full head of stubble. She is posing as someone with a disease for sympathy, to appear as a victim, and to distract people from the fact that she is a cheater.\n\n[Hair surgeon explains Jada's  \"alopecia\"]\n(https://m.youtube.com/watch?v=DdPmmlvhpHk)",
            "title_similarity": "0.74624395",
            "sentiment_compound": -0.4108
        },
        {
            "id": "i2jsxcu",
            "score": 44,
            "text": ">or interpersonally interacts with the world\n\nNot making any argument either way or another, but wouldn't you consider an inability to follow beauty standards naturally a change in how someone \"interpersonally interacts with the world\"? I mean, it *shouldn't* be that way, but I think it's quite obvious that bald women are treated differently than those who are able to grow hair.\n\nIf a condition disturbs the relationship you have with society, would you not see it as a disability in some sense?\n\nAs for male pattern baldness - being bald is more socially acceptable for men than it is for women, sadly. \n\nPlease note that I don't think women should be treated differently because of their hair. I simply think that they *are being treated differently*, even if they should not be.",
            "title_similarity": "0.789802",
            "sentiment_compound": 0.3253
        },
        {
            "id": "i2k5j0j",
            "score": 1,
            "text": "If you're a hair model this condition has horrific effects on your career.",
            "title_similarity": "0.44559792",
            "sentiment_compound": -0.6597
        },
        {
            "id": "i2kg3kr",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.19478062"
        },
        {
            "id": "i2kgodk",
            "score": 1,
            "text": "I have a friend who has alopecia, had it as a kid and didn’t grow hair on his arms at all. We poked fun when we were younger but never a big deal. When he got older he lost all of his hair and while we wanted to rib him when we could we could tell it wasn’t easy for him going through it. It’s certainly not a disability by any means however for an ego maniac actress whose entire identity is her looks, I could see how she took this the wrong way and got upset.",
            "title_similarity": "0.74819577",
            "sentiment_compound": -0.6652
        },
        {
            "id": "i2kv044",
            "score": 1,
            "text": "Two things:\n\n1) Alopecia isn’t “just” hair loss. It’s hair loss caused by an autoimmune disorder.\n\n2) Who is defining disability here and why? Alcoholism is a disability legally.",
            "title_similarity": "0.6841017",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i2k881o",
            "score": 2,
            "text": "is anyone saying it's a disability? it's a disease. never even seen it stated the way you did",
            "title_similarity": "0.6241881",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kq38f",
            "score": 1,
            "text": "I'm still confused about why people even think he's making fun of her condition in the first place.  Her buzzed hair looks virtually identical to Demi Moore's buzzed hair in GI Jane, as they show it in the theatrical posters/covers.  Her condition was tangential - you could make the same line about Sinead O'Connor and it would make just as much sense.  Point in fact, when GI Jane came out, people made that exact comparison.",
            "title_similarity": "0.69048023",
            "sentiment_compound": 0.25
        },
        {
            "id": "i2npq0m",
            "score": 2,
            "text": "I can’t man. Men are going bald in large numbers every day and have to deal with it for the rest of their lives yet they have always been made fun of by comedians. Some men have to go through some traumatic shit when that happens to them, I’d argue that the emotional distress is at least equal to women who have alopecia. The excuse that men have it better is usually backed up by “logic” like “It rarely happens to women so it’s worse for them when it does!” My dad lost his hair 40 years ago and he still wishes he could get it back, of course he does.\n\nNot only that but Chris Rock didn’t even know she had alopecia!!! Also Chris Rock has made jokes about bald heads so even if he knew at worst it’d be in bad taste. Comedians are always walking the line between what they can say and can’t say.",
            "title_similarity": "0.5160614",
            "sentiment_compound": -0.9083
        },
        {
            "id": "i2jw710",
            "score": 1828,
            "text": "I have alopecia, and I do not consider myself disabled. However, I know many who do. In my country, a disability is defined as a long term condition that has a significant impact on one’s day to day life and some people with alopecia find that the emotional impact of alopecia, as well as the side effects (for example, dry eyes and frequent infections due to no eyelashes, constant irritated nose due to no nose hair etc) can have a huge affect on their lives.\n\nI don’t condone what Will Smith did, and think it was an overreaction, but the joke was incredibly poor taste. I have never gone out in public without wearing a wig and had I felt as brave as Jada I would have been absolutely crushed to have someone make a joke at my expense.",
            "title_similarity": "0.72953296",
            "sentiment_compound": -0.0462
        },
        {
            "id": "i2ju1bh",
            "score": 9,
            "text": "I think you can be ableist in a way that doesn't specifically target a disability the same way that you can be white supremacist in a way that doesn't necessarily denigrate a non-white race (but does reaffirm the supremacy of whiteness). Whether Chris Rock's comments rose to this level is certainly debateable but I would say that in theory, jokes mocking a person's physical appearance in a way that others people who look different from what is considered normal, could certainly rise to that level, they could reaffirm and normalize ableness, even if they do not specifically mock a disability",
            "title_similarity": "0.7677391",
            "sentiment_compound": 0.827
        },
        {
            "id": "i2kbft2",
            "score": 7,
            "text": "Not being a disability doesn't mean it's okay to make fun of either. There are lots of things that should be off limits. Medical conditions should be one. Especially ones that can effect someone's self esteem in this way. Comparing it to male pattern baldness is silly because there are different expectations for women and men's hair. That's like saying making fun of a guy with huge female-like breasts is fine because women have breasts? Like that's stupid.",
            "title_similarity": "0.78032935",
            "sentiment_compound": 0.8669
        },
        {
            "id": "i2kbwkl",
            "score": 0,
            "text": "his joke wasnt even negative though, defeating the entire premise of this point of view, his joke was a compliment about strong women.",
            "title_similarity": "0.6341239",
            "sentiment_compound": 0.8806
        },
        {
            "id": "i2kdcsw",
            "score": 0,
            "text": "Eczema is pretty rough, right?\n\nDoes alopecia have any symptoms which can't be full mitigated by a light wool sweater and a hat?",
            "title_similarity": "0.6197433",
            "sentiment_compound": 0.5514
        },
        {
            "id": "i2kzyoz",
            "score": 0,
            "text": "I agree 100%T. People get upset about literally anything. People need to grow up and grow thicker skin.",
            "title_similarity": "0.39512172",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i2l9iqc",
            "score": 0,
            "text": "As far as I'm concerned... You can make fun of alopecia. You shouldn't make fun of SPECIFIC PEOPLE'S alopecia.",
            "title_similarity": "0.7262503",
            "sentiment_compound": 0.1526
        },
        {
            "id": "i2lgran",
            "score": 0,
            "text": "Alopecia is an autoimmune disease. Youre a dick. Male pattern baldness is not a disease. Eczema and psoriasis are. Its rude to make fun of a disease regardless.",
            "title_similarity": "0.834389",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i2nnqat",
            "score": 0,
            "text": "I haven’t seen any talk about ableist, so I’m talking out of my ass, but that seems like a weird distinction to make.\n\nBy your definition, people with poor eyesight are disabled, yet jokes about people with glasses aren’t a major issue.\n\nThe issue is not with a technical definition of disability, but with the presence of a medical condition that is a rarity, and can cause mental/emotional pain due to being seen as a “freak.” \n\nWhen you crack jokes at the expense of the minority, the “damaged,” the hurting and insecure, you are not creating comedy. You’re hurting someone who needs love by exploiting their source of pain for an audience of people who can’t imagine what they’ve had to endure.",
            "title_similarity": "0.8822075",
            "sentiment_compound": -0.9718
        },
        {
            "id": "i2nykp8",
            "score": 0,
            "text": "she isnt Able to grow hair which is something most people do",
            "title_similarity": "0.5343939",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2nn2mc",
            "score": 7,
            "text": "Making fun of bald men = ok\n\nMaking fun of bald women = not ok\n\nRegular people committing assault = not ok\n\nRich people committing assault = ok\n\nThat’s just how society is.",
            "title_similarity": "0.5300772",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i2kj182",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.19478062"
        },
        {
            "id": "i2kjyoq",
            "score": -1,
            "text": "Your definition of disability is wrong.  Next?",
            "title_similarity": "0.47084525",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i2kpln5",
            "score": 1,
            "text": "\"Disability\" is a term that has multiple definitions under different contexts and it is important to note the specific way you are using the term in order for a discussion to have the proper impact. Oddly, the definition you give isn't a definition used either legally or medically.\n\nUnder the ADA, a disability is a legal, not medical term. It means \"a physical or mental impairment that SUBSTANTIALLY limits one or more major life activity.\" And it includes people who have a record of such an impairment, if the do not currently have a disability; or, those who are regarded as having such an impairment, even if they do not have a disability.\n\nThus, a person who had cancer, and the cancer is in remission or cured, the person is still considered disabled under the ADA legal definition. Even if they suffer no current limits to life activities. Further, a person who has an accent, and is mistaken by their employer to be mentally disabled \\_IS\\_ disabled under the ADA with respect to interactions with that employer even though there is nothing at all wrong with them at all!! Legal definitions are wierd!\n\nThe World Health Organization defines disability as a loss of function at the level of the whole person or any impairment or defect of one or more organs or members.\n\nAlopecia is a skin disease that stops normal hair follicle function. The skin is the largest organ of the human body. Therefore, according to the WHO, alopecia is clearly an impairment or defect of one or more organs, a loss of function at the level of the whole person, and is therefore a medical disability. It is not a serious disability. But it is a disability.\n\nSo, this is an important distinction to understand: the ADA would not consider her to be legally disabled, but her doctor would consider her to be medically disabled.\n\nIf any doctor adhering to WHO standards would consider her disabled, who are you to say they are wrong?   \n\n\nIn any case, your definition is inadequate both legally and medically.",
            "title_similarity": "0.7380633",
            "sentiment_compound": -0.8972
        },
        {
            "id": "i2kr3ps",
            "score": 1,
            "text": "Hey if that’s not a disability, then erectile disfunction isn’t a disability either, which it clearly is. Her head is disabled in the ability to make hair follicles, just like my dick is unable to get hard",
            "title_similarity": "0.8266217",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2mhcch",
            "score": 1,
            "text": "Agreed. And being compared to GI Jane or Demi Moore is the most good natured ribbing one can get. A physical assualt for any verbal insult is so base, let alone a partial compliment. I'm sure blind, dead, paralyzed, amputees would trade their disability for no   hair & just get a wig. Another reason women have double standards, they constantly nix men for no hair but if they don't have any it's a disability. And clearly she has hair, just shaved. Can't wait for people to collect their govn't checks for losing functionless hair.",
            "title_similarity": "0.7127186",
            "sentiment_compound": 0.4923
        },
        {
            "id": "i2nwm7x",
            "score": -1,
            "text": "By that logic, mastectomy is just cutting off an external skin and fat that serves almost no purpose. Instead of being one of the most devastating consequences of breast cancer to women.",
            "title_similarity": "0.5861999",
            "sentiment_compound": -0.9081
        },
        {
            "id": "i2nxdpp",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.19478062"
        },
        {
            "id": "i2nydg9",
            "score": 1,
            "text": "To lose something valuable (to you) against your will can be very upsetting. For someone to joke about your loss, especially a loss that is widely regarded as unfortunate, isn't \"just a joke\", it's bullying.\n\n\nSo what Chris Rock did was the textbook definition of bullying.\n\n\nWas it ableist?\n\n\nWill Smith's wife can no longer produce hair, which doesn't seem all that problematic, since wigs exist. And of course, she may have some trouble with getting debris in her eyes on windy days. That's a disability certainly that would require compensatory measures, like eye guards. But wearing sunglasses or fake glasses more often isn't a big deal, right?\n\nBut consider the broader picture - hair and grooming style, especially for females, serves a major social role, and a wig cannot totally replace that in all circumstances. Not everyone can afford a really good wig that is both comfortable and passing as real hair entirely throughout the duration of its use.\n\nIndividual burdens that result from wearing a wig and eye protection when required may be small, casual, and easy to write off as \"no big deal\", but that doesn't capture the whole impact of daily, weekly, monthly, and lifetime incumbrances brought on by not being able to produce hair. Also consider that there may be benefits to not producing hair.\n\nIf she can't do something like grow her own hair, then she is not able, and that impacts her life in some capacity.",
            "title_similarity": "0.72993743",
            "sentiment_compound": -0.3324
        },
        {
            "id": "i2khl68",
            "score": 7,
            "text": "This is just semantics. Ableist/disability might not be the correct terms to use, but it's still shitty to joke about people's insecurities",
            "title_similarity": "0.7173908",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i2kg432",
            "score": 2,
            "text": "I think the discrimination a person with Alopecia can face does put it in a disability category.",
            "title_similarity": "0.494315",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kgmzh",
            "score": -2,
            "text": "It's not ablest because it was scripted, and they almost certainly discussed it beforehand. See his face while he was slapping him.",
            "title_similarity": "0.457061",
            "sentiment_compound": 0.2748
        },
        {
            "id": "i2kqjsq",
            "score": 2,
            "text": "It was a cheap shot about an unlikable person. Tie goes to the comedian.",
            "title_similarity": "0.5896662",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i2lvgoq",
            "score": 2,
            "text": "The dude that produced “Good Hair” should not be making slights at black women with hair problems. That’s intentionally malicious.",
            "title_similarity": "0.72736096",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i2kiwig",
            "score": 27,
            "text": "I mean I would say a real medical condition, disability or not, isn’t a a joke.\n\nAlso, while I’ve never had alopecia and won’t speak on their experiences, as a woman who’s voluntarily shaved their head people in general can be dicks to bald women. I’ve worked retail for years, I’m used to difficult if not flat out impossible people, the time period when I shaved my head was the time period when people were willing to be the most rude. No one, regardless of net worth, needs someone like Chris Rock making tasteless jokes like he made. He didn’t deserve the slap for it, real or fake, but leave someone’s hair alone. More so if you have every reason to know they’re in an upsetting situation they might not want made fun of.",
            "title_similarity": "0.72658104",
            "sentiment_compound": -0.9036
        },
        {
            "id": "i2klyg8",
            "score": 5,
            "text": "\"or interpersonally interacts with the world. \"\n\nIt affects her interpersonal interactions greatly.  People respond very differently to bald women who are exceedingly rare in our society vs their interactions with men.",
            "title_similarity": "0.58391744",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2k5b8g",
            "score": 6,
            "text": "I think you are being a bit semantic. \n\nI’ve seen some mentions of ableism but it’s not the prevailing take. \n\nIt’s understandable why some people might make the connection between disability and medical condition even though it’s not a mobility disability. Maybe there is an argument to be made they are using the wrong word, but I think absent a more appropriate word I’m not sure that it’s an important distinction. \n\nI also think you are maybe using too strict a definition. I think it’s pretty easy to understand how a visual disfigurement could affect someone’s ability to live an unaffected life. In that way it’s not an unreasonable application of the word. \n\nOf course I’m not opposed to an alternate term but until then I don’t think it’s a big deal unless people with disabilities have an issue with it.",
            "title_similarity": "0.78996533",
            "sentiment_compound": 0.5357
        },
        {
            "id": "i2kx31i",
            "score": 118,
            "text": "Oh this brings up a great question of what is a disability! There's been a lot of great academic/research work in the last 30 years about disability, but it's still not something the broader public has a familiar understanding of. So the alopecia debate is a good pop-culture example to explore the question. Honestly, I hadn't thought about alopecia as a disability before reading this either. I'd like to introduce two things that are useful for understanding the many dimensions (each a spectrum) that make up the construct of disability and then apply them to alopecia.\n\n1) [International Classification of Functioning, Disability and Health \\(ICF\\)](https://www.physio-pedia.com/International_Classification_of_Functioning,_Disability_and_Health_\\(ICF\\))\n\n2) [The Social Model of Disability](https://en.wikipedia.org/wiki/Social_model_of_disability)\n\nThe ICF breaks down the construct of \"health\" into three layers of A) **Body Functions and Structures**, B) **Activities**, and C) **Participation** (at the individual and social levels). These three are contextualized by envorinmental factors, personal factors, and the particular health condition itself. \n\n*Disability* then, can be understood at each of these three layers by A) **Impairments of the body**, e.g. loss of senses, memory loss, psychological dysfunction, B) **Activity limitations**, e.g. difficulty walking, difficulty reading, difficulty having sex, C) **Participation restrictions**, e.g. engaging in your work, hanging out with your friends, obtaining healthcare, participating in a meaningful relationship.\n\nSo, with this lens we can look at Alopecia\n\nA) **Impairments of the body**: hair is a body structure that serves multiple functions including regulating temperature, extending sense of touch, and protection from the environment (e.g. sun)\n\nB) **Activity limitations**: I don't think there are any critical activities of daily living that are limited, but there are still activity limitations such as being limited in how long you can stay out in the sun (without a hat), or obviously limited in donating hair\n\nC) **Participation restrictions**: This is a big one for hair loss I think, especially for Jada. Her profession is acting and in her workplace (Hollywood), not having hair meaningfully restricts her in the roles she would be accepted for and limits other professional opportunities as well (hair advertisement, etc.). Socially, there is real stigma when it comes to being a woman (and a black woman at that) without hair. She is also restricted participating in social structures where hair is meaningful (e.g. fashion), especially where black hair is meaningful--if you're unclear on this, I highly recommend the documentary [Good Hair, written and narrated by none other than Chris Rock](https://en.wikipedia.org/wiki/Good_Hair).\n\nSo with this in mind, you can also reflect a bit more on the social model of disability and how many of our social structures involving hair, e.g. beauty standards, contribute to disability in terms of participation restriction and some activity limitations.\n\nI'd also add that if alopecia is the underlying health condition causing depression, then depression is more a symptom than the cause of the dysfunction related to depression (e.g. not wanting to get up in the morning, suicidality). Sometimes things can be both health conditions of themselves, and symptoms of other conditions. In this case, saying depression is the \"real cause\" is like saying blood loss is the \"real cause\" of death when your arm's been cut off. Or lung failure was the \"real cause\" of death, not COVID-19.\n\n-edit-\nTo respond to a couple of comments, I think it's important to emphasize that modern definitions of disability do not it as a binary state where you're either disabled or you're not. Experiences of disability and conversely the *ways* in which our environment (e.g. built environment and social environment) cause disabling experiences each exist on spectrums of greater/lesser extent. It might be helpful to think of disability as the corollary (flip-side) of health. To have a more rich and meaningful discussion of health, we need to move past the cursory dichotomy of healthy vs unhealthy and disabled vs not disabled. [The WHO defines health as \"a state of complete physical, mental and social well-being and not merely the absence of disease or infirmity.\"](https://www.who.int/about/governance/constitution) In the comments, social-wellbeing seems to be dismissed as not relevant to health/disability, but it is in fact essential. As such you can consider how social considerations of disability intersect with issues of discrimination and oppression, and other things like class, race, gender, religion, etc. Again, the social model of disability is very useful from this angle. The tensions are also quite evident when you look at the margins, where people who suffer a lot from experiences of disability (especially non-visible disabilities) cannot access health resources because the health system does not recognize them on the \"disabled\" side of the binary.\n\nTL/DR: To address issues of disability, it is more useful to move beyond the dichotomy of disabled/not disabled towards a perspective that looks at the *ways* and *extent to which* people experience disability.\n\n-edit2- Thanks for the Reddit Gold! It's my first time ^ ^",
            "title_similarity": "0.64348745",
            "sentiment_compound": -0.9426
        },
        {
            "id": "i2k5kb2",
            "score": 13,
            "text": "What is and isn’t a disability is pretty nebulous, the ADA even protects people that are regarded as having disabilities. \n\nFrom the ADA website on what “regarded” means. \n\n“”Regarded as” means that the person either:\n\nHas an impairment that does not substantially limit a major life activity;\nHas an impairment that substantially limits a major life activity only as a result of the attitudes of others toward them; or\nDoes not have any impairment, but is treated by an entity as having an impairment.”\n\nThe ADA defines a physical impairment as “a physiological disorder or condition, anatomical loss, or cosmetic disfigurement that impacts one or more of these body systems” (of which skin is included)\n\nSo because Jada has a physical impairment (a physiological condition which affects her skin that causes cosmetic disfigurement) and it at least somewhat limits her life activities (having to use additional protection from the sun and for her eyes, perhaps even having to use topical ointments, eye drops or specialized care) then ADA may actually provide her protection.",
            "title_similarity": "0.7469033",
            "sentiment_compound": 0.1406
        },
        {
            "id": "i2km330",
            "score": 1,
            "text": "For her career path of acting, which she chose and invested in and was successful in before it affected her to this degree, being a woman with patchy baldness is definitely a disability.  It distinctly affects her ability to get work.\n\nFurthermore, alopecia can be the result of an auto-immune condition, and they don't only come in single-symptom varieties.  Alopecia may only be the externally visible symptom.",
            "title_similarity": "0.67868596",
            "sentiment_compound": 0.802
        },
        {
            "id": "i2ko1tn",
            "score": 1,
            "text": "People give me shit for my medical condition all the time. It’s a part of life, doesn’t mean I can slap someone because of it.",
            "title_similarity": "0.59848446",
            "sentiment_compound": -0.4588
        },
        {
            "id": "i2koefd",
            "score": 1,
            "text": "I think the problem with the joke wasn't that it was about Alopecia, it was that she had it. Its usually considered poor taste to have a target of a joke. Joking about a subject is fine. Also Will had a moronic moment as a reaction.",
            "title_similarity": "0.7270659",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i2kxc5t",
            "score": 1,
            "text": "I agree with you. I saw her videos about her alopecia. She is bald in a straight line where the wigs pull her hair out. She shaved her head. That is self induced baldness.",
            "title_similarity": "0.53400314",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i2kz41j",
            "score": 1,
            "text": "So because its not a disability its totally ok? Semantics doesnt equal ethics.",
            "title_similarity": "0.7014091",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2kzezb",
            "score": 1,
            "text": "Male pattern baldness IS alopecia, by the way. It's called androgenetic alopecia. There are different types of alopecia. Jada has something called alopecia areata, where you lose hair in patches. Arguably the form of hair loss most commonly thought of as \"alopecia\" is alopecia totalis, which, as the name suggests, is a complete loss of all body hair.\n\nI think it's debatable whether or not alopecia areata constitutes a disability, but I do not think it's at all comparable to androgenic alopecia, especially in women. Half of men lose hair by age 50; as they get older, it goes up to 70 percent. It's common and expected in men. While a large percentage of women also experience androgenetic alopecia at some point in their lives, the hair loss is typically much less pronounced and widespread than it is in men. So people think of it as jarring when a woman loses her hair in a way that they don't when it's a man.\n\nI don't agree with the statement that it doesn't \"limit how they interact with others\" -- it absolutely does because people think of women with significant hair loss as disturbing. And the same goes for men OR women with alopecia totalis. In many cases of alopecia areata, as Jada has, a man can shave his hair down and go unnoticed, but women aren't \"supposed to\" have hairstyles like that.",
            "title_similarity": "0.68452257",
            "sentiment_compound": -0.9566
        },
        {
            "id": "i2kznyr",
            "score": 1,
            "text": "Anyone complaining is just sensitive instead of seeing it as humor. Can't please everyone!\n\nP.s. I am bald and get mocked every day.",
            "title_similarity": "0.5571517",
            "sentiment_compound": -0.503
        },
        {
            "id": "i2l1dg8",
            "score": 1,
            "text": "Bro if this is a disability then where’s my disability check?",
            "title_similarity": "0.4483463",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2l62vk",
            "score": 1,
            "text": "Will didn't slap Chris because he made a joke about alopecia. This is a saving face tactic orchestrated by his team to protect his public image.",
            "title_similarity": "0.7481998",
            "sentiment_compound": 0.5197
        },
        {
            "id": "i2l7u8k",
            "score": 1,
            "text": "You disagree with the definition of a word. How can someone prove that the definition is the definition when you seem to make up a definition randomly?",
            "title_similarity": "0.5936467",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i2l8qm6",
            "score": 1,
            "text": "Even if it was, who cares",
            "title_similarity": "0.402939",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i2l95hx",
            "score": 1,
            "text": "How about we just let jokes be jokes and stop getting offended by them. They're jokes. A king who turns on his court jester, is a tyrant.",
            "title_similarity": "0.5330842",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i2le7rr",
            "score": 1,
            "text": "It doesn’t matter if it’s a disability neither, jokes are just that, they can’t censor jokes",
            "title_similarity": "0.7844323",
            "sentiment_compound": -0.3899
        },
        {
            "id": "i2lee38",
            "score": 1,
            "text": "Yes, those two statement are correct. But it still not right to make jokes about someone who doesn’t feel like getting joked around.",
            "title_similarity": "0.70676744",
            "sentiment_compound": 0.8608
        },
        {
            "id": "i2lifrm",
            "score": 1,
            "text": "Wrong.  I am an ADA disability coordinator for state government and I have provided accommodations for someone with alopecia.  It is a disability as per the US government in accordance with the ADA of 1990",
            "title_similarity": "0.48676473",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i2liqw1",
            "score": 1,
            "text": "If alopecia was a disability white dudes would be able to cancel everyone!",
            "title_similarity": "0.53171813",
            "sentiment_compound": -0.3164
        },
        {
            "id": "i2ljj2e",
            "score": 2,
            "text": "The nature of a joke depends on who the audience is, I believe in the show biz world, it was definitely a pretty mild fucking joke, being bald isn't necessarily a thing only sick people have, she just looked like a character because she was bald, it wasn't like haha u have x disease.",
            "title_similarity": "0.74556863",
            "sentiment_compound": 0.6373
        },
        {
            "id": "i2lm8u4",
            "score": 3,
            "text": "I feel like if Will Smith didn't do what he did the joke would have gone by and no one would even mention it again. It would have just been lost in the shuffle of the rest of the show. No one would have remembered or cared.",
            "title_similarity": "0.6461749",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i2ln0a3",
            "score": 2,
            "text": "Thank you for this. It isn't a disability. It's a disease, but not a disability. Secondary conditions that occur because of a primary disease are not the conversation piece here. Mental illness as the result of a disease....sure, depending on the severity and length could be considered a disability. But that's not qualifying the primary disease as disabling. That's wholly the second condition that could be counted as a disability. \n\nI live with 3 distinct mental health disorders that shape and decide what I perceive as reality, how I process that reality, how I regulate my emotions, how I cope with stress, how I relate to human beings, how I speak,  how I function on a daily basis, or in crisis, or in normal situations, how I sleep, how I eat, how I dream, how I do anything and everything. I can't trust my own brain, but also can't trust anything or anyone around me. \n\nThat's what qualifies as a disability. A disorder or disease or illness or condition needs to literally mess with your ability to perceive/manage/function in the world to qualify as a disability. \n\nAlopecia does not do this.",
            "title_similarity": "0.80476904",
            "sentiment_compound": -0.9839
        },
        {
            "id": "i2lodw9",
            "score": 2,
            "text": "I can somewhat see how alopecia *could* be considered a disability in that it can limit the individual's ability to fully participate in life, thus causing it to it disabling. That being said, context matters an awful lot. Jada is a multimillionaire who has access to every possible support for alopecia that money can buy, including beautiful, natural looking wigs if she so chooses. She made the choice to shave her head and go to a widely televised event without making an attempt to lessen the attention on her condition...which is awesome! More power to her for owning that and looking absolutely beautiful while she did. However, her experience of alopecia is world's away from, say, a woman without her nearly limitless resources that might not get to choose whether she steps out into the world bald. She was also sitting in the front row at an event where the presenter (Chris Rock) is known to roast the audience, especially those in the front row. Not to mention, I'm pretty sure the entire show is rehearsed and the jokes are vetted prior to the actual event, so it is entirely possible the the whole interaction was staged. In and of itself, it being staged doesn't change whether alopecia is a disability and whether making a joke about it is ableist or harmful. But it does put things into perspective that perhaps the whole thing is being used to garner attention to an increasingly irrelevant award ceremony by eliciting debate over a subject that, in this context, is more of a caricature of what alopecia, ableism and disabilities actually look like in the real world.",
            "title_similarity": "0.6639474",
            "sentiment_compound": 0.9637
        },
        {
            "id": "i2lqc4j",
            "score": 2,
            "text": "Hot take, who cares, far worse happens every single day, and putting the actions and lives of celebrities on pedastools merely distracts the public from the shit going on in our own country and outside of it.",
            "title_similarity": "0.5883294",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i2lr3vw",
            "score": 2,
            "text": "Imagine you are at your school and in a talent show someone makes fun of you or someone you care about a condition that has made them cry and suffer everyday but try to keep up with it. You/your loved one  becomes very afflicted by that. What is the difference with this and a bully? Someone who tries to diminish you and feel bad in front of others just for the laughs? It is different if you target a whole population in your joke or target someone who is not even there and does not know in real life this person, but in that event everyone knows each other, is like being in school or an office for them. \n\nChris Rock was a bully and Will decided to do an impulsive move and hit the bully. Now Will is at the principal office. People forget celebrities are humans and adults act like children as well. Comedians also think just because their job is to make people laugh they can say whatever they want without responsabilities, they can bully anyone and condemn the others behavior just because that is their profession. In a real life scenario you make fun and humilliate someone girlfriend and prepare to get a good stop or maybe a punch, just because you are in a stage does not make you invulnerable. I’m not saying this is the world we want, just saying this happens everyday with normal people, not because they are celebrities have to be any better than regular people. Both are wrong on different things.",
            "title_similarity": "0.46601614",
            "sentiment_compound": 0.3974
        },
        {
            "id": "i2lsfub",
            "score": 1,
            "text": "I have alopecia, as does my brother. People stare. Many jobs are not open to us if we do not agree to wear a wig or a hat (customer-facing jobs). \n\nI wear a wig. There are many things I cannot do, like go swimming or compete in running races because of it. My brother goes bald and deals with the social opprobrium.\n\nWhen we were children, people made fun of me and my brother. We were not picked for teams and games. My brother was beat up several times for being 'different.' \n\nIt is not a disability, but it is limiting. 'the joke' was mild considering all the things that people say to a baldy.",
            "title_similarity": "0.6638075",
            "sentiment_compound": 0.4291
        },
        {
            "id": "i2ltrjw",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.20384666"
        },
        {
            "id": "i2lujkj",
            "score": 1,
            "text": "I have mild cerebral palsy. Because of this I can’t drive. Because I can’t drive, I can’t get a job. I have a friend with alopecia. Her alopecia has meant that she can’t get a job. She struggles to make ends meet when would-be employers tell her that bald goes against the dress code, and that because her head coverings aren’t religious she can’t wear them. She’s tried getting the law involved  once or twice but it was too expensive. \n\nSo…one of us is disabled and one is not?",
            "title_similarity": "0.6732567",
            "sentiment_compound": 0.09
        },
        {
            "id": "i2lvqca",
            "score": 2,
            "text": "The GI Jane look is beautiful and bad ass. Total compliment. She needs to get over herself.  Even Will laughed about it at first.",
            "title_similarity": "0.5022757",
            "sentiment_compound": 0.8516
        },
        {
            "id": "i2lxncc",
            "score": 1,
            "text": "Agreed. Furthermore, why was Chris Rock’s joke about Jada so much worse than Regina Hall’s joke about Lebron?\n\nBoth are due to medical conditions. But literally no one batted an eye, much less objected, to the joke about how “Space Jam 2 should have been nominated for best special effects because of Lebron’s hairline.”\nMost people, regardless how they feel about Will Smith’s actions, preface their opinion with some variation of “Chris Rock shouldn’t have made that joke” for whatever reason (its insensitive to mock something someone can’t control, it’s rude to make fun of something Jada’s obviously sensitive about, etc.).\n\nHell, people have been making fun of Lebron’s hairline for around 20yrs and I have yet to see one iota of scrutiny regarding those jokes. So I fail to see why one Oscar joke was so much worse than the other.",
            "title_similarity": "0.7918434",
            "sentiment_compound": -0.4721
        },
        {
            "id": "i2ly5su",
            "score": 1,
            "text": "I have alopecia and I've never considered it to be a disability.",
            "title_similarity": "0.6519772",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2m1vrb",
            "score": 3,
            "text": "Idk about male pattern baldness, but psoriasis and eczema are totally considered disabilities!! I have a friend with psoriasis that attends my disability group with me :) Pretty sure she considers it a disability… \n\nMy dad and aunt also have psoriasis and it’s caused lots of issues for them… my aunt has psoriatic arthritis and had to have several surgeries on her leg (knee I think? I’m not sure) that prevented her from working for several months. \n\nMy dad treated his psoriasis with tanning salons for several years at the recommendation of his doctor (this is a harmful and outdated recommendation! Don’t do it!). Then he got melanoma as a result. Luckily it hadn’t spread, but he had to have giant patches of skin taken out every month for 6 months until they got it all. He had to have skin grafts from other parts of his body because there wasn’t enough skin left in some parts. One of them got infected and his arm swelled up and he had to wear a sling.\n\nAnd of course my dad had prescription cream he puts on his psoriasis every morning. \n\nIn high school I had a friend with eczema. The itchiness made it hard for her to concentrate in class. (Even though she had creams/medications.) I’d consider that a disability. \n\nI think it’s ultimately up to the individual to say whether they identify as disabled or not. But by a lot of common definitions of disability, psoriasis and eczema can definitely be disabilities.",
            "title_similarity": "0.4468366",
            "sentiment_compound": 0.9731
        },
        {
            "id": "i2m3cl9",
            "score": 2,
            "text": "Did he even make fun of Jada tho? Maybe he meant she is a beautiful bald women just like Demi Moore in GI Jane?",
            "title_similarity": "0.5743493",
            "sentiment_compound": 0.8767
        },
        {
            "id": "i2m5aqu",
            "score": 1,
            "text": "Ah yes, the adversity faced by the slightly bald\n\n*shakes fist at the sky*\n\n“Damn the system!”",
            "title_similarity": "0.42271674",
            "sentiment_compound": -0.1007
        },
        {
            "id": "i2m7gzr",
            "score": 1,
            "text": "I think you’re splitting hairs",
            "title_similarity": "0.26358765",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2m86lq",
            "score": 1,
            "text": "Not ableist, but still in very poor taste",
            "title_similarity": "0.4791635",
            "sentiment_compound": -0.6798
        },
        {
            "id": "i2mal82",
            "score": 1,
            "text": "Who the hell is having this conversation ? No it wasn't ableist but I was shitty. Poking fun of things people have no control over is bad comedy and low hanging fruit.",
            "title_similarity": "0.600265",
            "sentiment_compound": -0.8957
        },
        {
            "id": "i2mboci",
            "score": 2,
            "text": "Insult comics making an 'ableist joke' isn't even bad. It's on brand. It doesn't even fucking matter if that dude literally made a verbal hate crime before our very eyes, the response is not allowed to be \"random act of violence that has zero repercussions because the victim does not want to deal with the fall out and hassle of dragging Will fucking Smith to court\"",
            "title_similarity": "0.7277122",
            "sentiment_compound": -0.9211
        },
        {
            "id": "i2mcqy5",
            "score": 1,
            "text": "no one says it's a disability. it's a condition that COULD lead some people to feel negative about themselves. Similar to how some men don't like being bald and how some people don't like having skin conditions. \n\nWhy do you think it's okay to make fun of people's insecurity, if it's not severe? \n\nI agree that Chris Rock's career should end because of the joke, but shouldn't he at least say \"I apologize for making a joke on your hair loss.\" \n\nSimilarly, why can't men start saying \"hey, I dont like that you made fun of my baldness.\"?",
            "title_similarity": "0.76081383",
            "sentiment_compound": 0.2197
        },
        {
            "id": "i2mcumx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.19478062"
        },
        {
            "id": "i2mcxa4",
            "score": 1,
            "text": "Alopecia (edit: at least of the kind Jada Pinkett-Smith has) is an autoimmune disorder. The hair falling out is basically just a symptom. Any autoimmune disorder greatly increases your susceptibility to diseases like COVID.",
            "title_similarity": "0.60580003",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i2mez3j",
            "score": 2,
            "text": "My friend with alopecia explained to me that you miss your ear and nose hairs immediately. your nose just runs continuously and constantly, and the hair in your ears is required to hear things and everything sounds like it is down a hallway. i would argue thats its a mild disability that you can still function fairly normally with...but definitely going to affect your day to day if its a severe case.",
            "title_similarity": "0.5725598",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2mfoul",
            "score": 1,
            "text": "Disability is a loaded word. It’s pretty clear Chris rock went over the line vs jada compared to the other people he roasted for some reason. Imagine making fun of medical conditions.",
            "title_similarity": "0.53080803",
            "sentiment_compound": 0.8442
        },
        {
            "id": "i2mgjd1",
            "score": 1,
            "text": "Does it matter? Even if it’s just an allergy or a random disease? It’s rude as fuck to make fun of somebody’s physical condition in front of a million people. \n\nThat being said, will smith was clearly the bigger douchebag for punching him.",
            "title_similarity": "0.54563797",
            "sentiment_compound": -0.6966
        },
        {
            "id": "i2mh1hz",
            "score": 1,
            "text": "The joke was tasteless, but will smith did was totally innapropriate, unacceptable, and disgraceful",
            "title_similarity": "0.6223157",
            "sentiment_compound": -0.5883
        },
        {
            "id": "i2mi2t1",
            "score": 1,
            "text": "Depending on the circumstances, alopecia can meet the statutory definition of a disability as defined in the ADA, Rehabilitation Act of 1973, or the ADAAA of 2008.  If the alopecia is a symptom of an autoimmune disorder, then it is explicitly listed as a disability in the ADAAA.  \n\nIf the person with alopecia is experiencing disparate treatment or disparate impact as a result of their alopecia, and an employer refuses to present or develop a reasonable accommodation, then the person with alopecia would potentially have a solid disability-discrimination complaint.  \n\nWhile alopecia doesn't necessarily prevent a person from completing a major life activity, if they are regarded by others as disabled, then according to the law that person meets the statutory definition, even if they have no disability at all.  \n\nFor example, if a person with alopecia applied for a job as a sales associate, and the employer refuses to hire, promote, or train that person because they have baldness, then that's a viable disability-discrimination case. \n\nIf the alopecia is the result of an autoimmune disorder, then it is explicitly acknowledged as a disability in the non-exhaustive lists of conditions and characteristics which can be defined as such in the ADAAA.  \n\n\nSource: I am an aspiring law student and just finished a paper on this specific subject, minus the alopecia.\n\n\nHOWEVER it should be noted that there is no statutory protection against being made fun of by a comedian in this kind of situation unless it has a direct effect on your employment, access to public accommodations, applicant status, etc.  \n\nSo Jada Smith wouldn't have a viable claim in this circumstance, at least as far as I know.  (Not a lawyer this is not legal advice do not take legal advice from a stranger on Reddit)",
            "title_similarity": "0.6373605",
            "sentiment_compound": -0.4047
        },
        {
            "id": "i2ml0xt",
            "score": 1,
            "text": "Yeah, like what about regular bald people? They can’t do anything about their hair either and they take jokes about it all the time.",
            "title_similarity": "0.64715886",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i2mzr0u",
            "score": 1,
            "text": "Eczema is definitely a disability",
            "title_similarity": "0.34524262",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2n0khh",
            "score": 1,
            "text": "Anyone who has the nerve to compare this condition to someone who lives in daily pain or cannot walk, hear or see is absolutely out of their god damn minds. I’m so tired of hearing ridiculous bs like this",
            "title_similarity": "0.5069959",
            "sentiment_compound": -0.8244
        },
        {
            "id": "i2na7w1",
            "score": 2,
            "text": "Isn't it just traction alopecia, tho?  But let blow it up to being a fucking *disease* for sympathy 🙄",
            "title_similarity": "0.5192431",
            "sentiment_compound": 0.564
        },
        {
            "id": "i2ndycr",
            "score": 1,
            "text": "The fact that Chris made the joke shows how it affects people on ab interpersonal level.",
            "title_similarity": "0.53300595",
            "sentiment_compound": 0.296
        },
        {
            "id": "i2ne29h",
            "score": 1,
            "text": ">A disability in my view is a condition or set of symptoms that limits how someone physically moves around in the world, **or interpersonally interacts with the world**.\n\nBy your own definition (emphasis mine), it seems as though alopecia could very well be considered a disability. The psychological toll, the self-esteem issues that come along with it, the painstaking decisions to go bald or have to purchase and maintain wigs...I would say all of those constitute impediments to how one interpersonally interacts with the world.\n\nBut, whether intended or not, making this an issue about ableism/disability it sort of makes a strawman out of the greater debate on whether or not the joke was appropriate. I think arguing over whether or not it's a disability isn't really the point. I think most people are criticizing Chris Rock for making a joke about a person's medical condition at that person's expense. Disability or no, a person with alopecia can't control what it does to their physical appearance, so making a joke about it is punching down in the same vein as joking about a person's disability—it's not about the severity with which the condition impacts their lives...we're not doing a suffering Olympics here...joking about immutable characteristics of a person is in poor taste.\n\nETA: The Americans with Disability Act (ADA) has defined disability as a “physical or mental impairment that substantially limits one or more major life activities.” The ADA doesn’t have a list naming all the specific conditions considered a disability, so it can be said that although not all alopecia conditions can be considered a disability, in some cases the challenges they endure can lead to a mental impairment.\n\nI think the greater issue here is that OP seems to be missing the fact that many conditions can cause mental health issues which definitely due fall under more traditional definitions of disabilities.",
            "title_similarity": "0.75487196",
            "sentiment_compound": 0.7136
        },
        {
            "id": "i2ngtl6",
            "score": 1,
            "text": "it’s like a fat joke or a glasses joke. at some level it’s harmless, millions of people “suffer” from those physical “imperfections” but at the end of the day if the listener is that sensitive there really isn’t much you can say to them to justify it.",
            "title_similarity": "0.68611014",
            "sentiment_compound": 0.5346
        },
        {
            "id": "i2nhbho",
            "score": 1,
            "text": "Doesn't matter if it's ableist or not it's a joke",
            "title_similarity": "0.6166686",
            "sentiment_compound": -0.2411
        },
        {
            "id": "i2nhczd",
            "score": 1,
            "text": "So we are weighing, making a tasteless joke about someone, against physically assaulting someone? I feel like the latter is more in the wrong.",
            "title_similarity": "0.5980031",
            "sentiment_compound": -0.4522
        },
        {
            "id": "i2nj1q0",
            "score": 7,
            "text": "I’ve had alopecia for 17 years. It made my life way harder than it needed to be, there’s no debate about that. But I’m fine at this point I’ve accepted it for what it is. However I’m a young confident male. I can’t speak for my community. Especially not the women where hair is a core component of their aesthetic. \n\nEarlier this month there was a young 12 year old girl named Rio from Indiana. She had alopecia. She couldn’t take the jokes, and she took her own life. News that won’t make headlines because just like this post; it’s not “serious” enough…\n\nIt’s easy to speak about something that you aren’t personally going through. If you’re at a “perfect” distance to the situation where you can make your assessments then return to your normal life, more power to you and congratulations for hitting the genetic lottery of normality. \n\nThere’s a video resurfacing of Will Smith making a joke on Arsenio Hall at one of the band members who had alopecia. It just goes to show you, until someone you love goes through an incredibly undeniably difficult situation, it just won’t be real to you in your world. And it’s an absolute shame that pain seems to be the only Factor that brings about empathy and understanding in these times.\n\nAlopecia is a dog shit condition. Everybody responds to it differently, but no one has a good time during it. You will lose relationships, job opportunities, confidence, and ultimately a good chunk of your sanity over it. Just because there is no scientific definitive quality which impacts our lifespan, does not take away the fact that we lose out in our lifetime because we live in an aesthetically obsessed society and hair or lack there of, solidifies a lot of your future possibilities. \n\nI really hope you and your loved ones never experience anything so detrimental as alopecia.  Because if they do, they will bleed. And you might rethink your thought process of right now; which is fine, because in time, if you’re living life right, you will learn and become wiser and gain an empathy you don’t have as of yet.",
            "title_similarity": "0.63211155",
            "sentiment_compound": 0.9873
        },
        {
            "id": "i2njzwn",
            "score": 1,
            "text": "In the end, we’ve made it okay to joke on baldness In general. The fact that bald men get made fun of constantly, but it’s an okay defense cause it’s a woman is a bit asinine to me",
            "title_similarity": "0.650555",
            "sentiment_compound": 0.743
        },
        {
            "id": "i2nk7kv",
            "score": 2,
            "text": "Fun fact: I googled “is male pattern baldness a medical condition”? and found out the medical term is androgenic Alopecia. So MPB is alopecia and what she has is actually female pattern baldness.",
            "title_similarity": "0.58064985",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i2nnk5s",
            "score": 1,
            "text": "Not weighing in on whether it is ableist exactly, but I think it's more than merely tasteless. I think what's important to focus on is that alopecia is immutable, like disabilities and certain other qualities can be. We tend to strongly disfavor judging people for something that they cannot change.",
            "title_similarity": "0.79350203",
            "sentiment_compound": 0.8674
        },
        {
            "id": "i2npwky",
            "score": 2,
            "text": "I have eczema on my hands to the point where I actually had to take time off work before and I wouldn’t consider that disabled.",
            "title_similarity": "0.5469049",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2npxr6",
            "score": 2,
            "text": "\"Ableist\", lol, that's the real joke right there.",
            "title_similarity": "0.39468628",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i2nqvdz",
            "score": 3,
            "text": "Preach!!!!! Thank you! Has everyone lost their fucking minds! How was he not immediately escorted out for assault. The only saving grace would be most people probably thought it was a skit. But after he starting screaming I don't get how the just continued like nothing happened ...",
            "title_similarity": "0.6351771",
            "sentiment_compound": -0.4055
        },
        {
            "id": "i2nry32",
            "score": 2,
            "text": "Honestly, I'm not sure he was aware that she has alopecia. It wasn't a joke about alopecia it was a just a silly joke about her having short hair.",
            "title_similarity": "0.7471352",
            "sentiment_compound": 0.3506
        },
        {
            "id": "i2nukbn",
            "score": 1,
            "text": "More powerful ‘victims’ of nothing but self indulgence.",
            "title_similarity": "0.50508016",
            "sentiment_compound": 0.2609
        },
        {
            "id": "i2o0tk7",
            "score": 1,
            "text": "Male pattern baldness isn’t alopecia and to those that think it is, please explain",
            "title_similarity": "0.7437326",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i2o3fxs",
            "score": 1,
            "text": "Don’t forget. Chris Rick has a disability. NVLD. Similar but not the same as autism. Similar traits. So will smith attacked a disabled person.",
            "title_similarity": "0.5440603",
            "sentiment_compound": -0.7046
        },
        {
            "id": "i2o3pd5",
            "score": 3,
            "text": "Pfizer sponsored the Oscar’s and just came out with a new alopecia drug.  Alopecia is also a possible side effect of vaccination. Can’t make this shit up.",
            "title_similarity": "0.59382594",
            "sentiment_compound": -0.6428
        },
        {
            "id": "i2o3t7u",
            "score": 1,
            "text": "Even if it was and even if it is it shouldn't matter",
            "title_similarity": "0.5411215",
            "sentiment_compound": -0.0191
        },
        {
            "id": "i2o495j",
            "score": 1,
            "text": "It was only ableist because it was directed towards a woman. Many men have androgenic alopecia all the time and are made fun of but noone cares.",
            "title_similarity": "0.5365633",
            "sentiment_compound": 0.7311
        },
        {
            "id": "i2o4hfk",
            "score": 1,
            "text": "I think everyone has way to thin of skin now. Ppl ready to cry/riot over the smallest of fucking things",
            "title_similarity": "0.35397914",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2o86xg",
            "score": 1,
            "text": "My mother has psoriasis on her hands and feet. There are several weeks per year when she can’t walk at all, or use those hands, due to the plaque and cracks/open sores. During the good months, she is on steroids and fighting off minor sprosiasis flares… the medication has side effects. Steroids affects her brain / emotions, as well as her blood glucose levels.Creating a nightmare year round.",
            "title_similarity": "0.41176513",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2o9kur",
            "score": 1,
            "text": "It's a disability to grow hair... By definition. \n\nBut yeah, if you can't make fun of people for being bald, fat, weird, etc. Then how can you make jokes at all? Like have you ever seen a comedy show?",
            "title_similarity": "0.70990604",
            "sentiment_compound": 0.762
        },
        {
            "id": "i2o9yp9",
            "score": 1,
            "text": "Who fucking cares. It can still be mentally/emotionally debilitating, which is what matters in the end.",
            "title_similarity": "0.5302714",
            "sentiment_compound": 0.5256
        },
        {
            "id": "i2obsll",
            "score": 1,
            "text": "Will Smith is an insecure little bitch.",
            "title_similarity": "0.36696374",
            "sentiment_compound": -0.7436
        },
        {
            "id": "i2obvep",
            "score": 1,
            "text": "New York post interview with Chris Rock quoted as him not knowing about the alopecia.  Pictures of her at the Oscar's in the green dress and buzz cut were stunning. There's something more sinister wrong with Will Snith besides the fact that he's a straight up ass hole.",
            "title_similarity": "0.6034947",
            "sentiment_compound": -0.8648
        },
        {
            "id": "i2oc2hy",
            "score": 1,
            "text": "I agree with you, but Alopecia can be a symptom of a immune system disorder (or breathing disorder) that is very deadly so I would say that it a disability in some cases.",
            "title_similarity": "0.494658",
            "sentiment_compound": -0.5499
        },
        {
            "id": "i2oc7qc",
            "score": 1,
            "text": "I didn't realize people were making that claim, but in the world we live in today, I'm not surprised.",
            "title_similarity": "0.6179887",
            "sentiment_compound": -0.2498
        },
        {
            "id": "i2odp5w",
            "score": 1,
            "text": "This is a semantics argument",
            "title_similarity": "0.21153443",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i2ognya",
            "score": 1,
            "text": "If you have seen GI Jane it's not a bad joke or in poor taste... It is about the first woman going through Navy Seal training and gaining the respect from her peers. She keeps up with the men while competing under the male standards. She shaves her head to prove she belongs there, just like the men do. As a young girl, she was the most bad bitch I knew! \n\nIt is one of my favorite movies and inspired me to join the military. I see no insult.",
            "title_similarity": "0.504229",
            "sentiment_compound": 0.831
        },
        {
            "id": "i2ojf4f",
            "score": 1,
            "text": "ahhh disagree. extreme sweating and having no hair lefs to feeling you bad and ugly and makes you  physically restricted.\n\nBut a Jada Smith does not feel ugly herself.",
            "title_similarity": "0.8017099",
            "sentiment_compound": -0.4209
        },
        {
            "id": "i2opaqm",
            "score": 1,
            "text": "I wonder what Stan Sitwell thinks of the incident",
            "title_similarity": "0.3532495",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2opk2h",
            "score": 1,
            "text": "stop speaking on shit you don’t experience",
            "title_similarity": "0.56593364",
            "sentiment_compound": -0.7003
        },
        {
            "id": "i2os57w",
            "score": 1,
            "text": "That’s just the thing, I don’t wanna change your mind.",
            "title_similarity": "0.4856739",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2otor3",
            "score": 1,
            "text": "I suppose it's not a disability but it's still a disease like joking about somebody having cancer or something.",
            "title_similarity": "0.72803307",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i2oun9h",
            "score": 1,
            "text": "We really should just stop body shaming other people. If someone is absolutely morally bankrupt or even criminal (some examples of current and past world leaders come to mind), calling negative attention to their fat or making fun of their hair takes away from the most important part of what makes that person worthy of criticism - their behavior. If that person doesn’t have problematic behaviors, then making fun of their hair, lack of hair, or other body characteristics is just, well, mean. \n\nI think there’s space for gray area here, though. One example I can think of is when you know the other person is okay with it, or maybe during something like a comedy roast. I’m not sure.",
            "title_similarity": "0.7121175",
            "sentiment_compound": -0.6008
        },
        {
            "id": "i2ox05s",
            "score": 1,
            "text": "Even if his joke was ableist,  I don't think Will Smith has that heavenly right to slap someone. You can criticize someone for saying something bad but you can't be violent against them. It's unethical and borderline offense.",
            "title_similarity": "0.7949026",
            "sentiment_compound": -0.3359
        },
        {
            "id": "i2oz0am",
            "score": 1,
            "text": "Wow....who gives a fuckkkkk??? Will Smith is a detached insecure moron who thinks he's in a movie 24/7. Why does everyone overcomplicate clear straight forward things and over simplify things that are actually nuanced and have details in its depths that actually need to be made conscious. There's no debate here....",
            "title_similarity": "0.5934915",
            "sentiment_compound": -0.6946
        },
        {
            "id": "i2p1161",
            "score": 1,
            "text": "My little brother had alopecia as a child and so did my cousin when she was in elementary. Jada has a shaved head and Chris made a joke about her hairstyle. How many of us can actually say that they knew beforehand that Jada Smith actually has alopecia before this incident? Was Chris Rock or anyone else expected to perform thorough background checks to make sure every joke passes through a filter of what's appropriate and what isn't",
            "title_similarity": "0.60254025",
            "sentiment_compound": 0.6908
        },
        {
            "id": "i2p58xa",
            "score": 1,
            "text": "It wasn’t ableist, just a shitty joke making fun of someone who can’t help it. That’s my problem with it at least",
            "title_similarity": "0.5549926",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i2p5fhx",
            "score": 1,
            "text": "Plus she LITERALLY SAID \"I DONT CARE WHAT ANYONE THINKS ABOUT IT\" not long ago.",
            "title_similarity": "0.40532547",
            "sentiment_compound": -0.4889
        },
        {
            "id": "i2p5sbx",
            "score": 1,
            "text": "I'd say even more: having a short haircut is not a disability. It's just a haircut.\n\n\"Hey you look like GI Jane\" must be one of the least offensive jokes Chris Rock has ever made.",
            "title_similarity": "0.7814843",
            "sentiment_compound": 0.7167
        },
        {
            "id": "i2p5xax",
            "score": 1,
            "text": "Here's my thing... she can be offended. She can be sad. Will can be pissed. You have to sit there and accept those feelings like an adult.\n\nWhat you can't do is smack a comedian for offending you. Fuck your feelings at that point. You are so entitled You have to stop a show to let everyone know \"you can't joke about me!\" Fuck that fu k you and especially fuck your baldness.",
            "title_similarity": "0.61600935",
            "sentiment_compound": -0.972
        },
        {
            "id": "i2p6jjb",
            "score": 1,
            "text": "I have to agree with you on that, with your criterias, alopecia is not a disability.\n\n\nThe thing is that these criterias are too restrictive, as you questioned already. A disability is a long term condition due to a biological or psychic defect that influences your every day life. Anything not \"normal\" that you are is a disability, in simple terms. Anything that requires you to go out of you way to live with is a disability, generally. The reason why your criterias are so restrictive probably is due to the big spectrum of disabilities. Hair loss seems pretty nice compared to paraplegia or scichophrenia.",
            "title_similarity": "0.80448955",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i2p7j3h",
            "score": 1,
            "text": "It is not just hair loss. It’s an autoimmune disorder and as someone who has one of those: autoimmune disorders wreck your life. It changes how you eat, it changes your fatigue levels, it changes literally everything about your life, and it is crippling. There’s also usually the added side effect of chronic pain, which by itself is a disability without everything else.",
            "title_similarity": "0.52364033",
            "sentiment_compound": -0.8376
        },
        {
            "id": "i2p85oq",
            "score": 1,
            "text": "Having your hair fall out because you wore wigs and then call it a disability …. Gee wiz",
            "title_similarity": "0.5354487",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2p9rel",
            "score": 1,
            "text": "Honestly sometimes I was jealous of my female friend with alopecia. I've been jealous of guys who can be bald or go bald naturally without anyone batting an eye. I never liked having long hair as a girl. It was a sensory nightmare and a pain to take care of. I know it looks beautiful, but I don't have it in me to take care of it most of the time. I was forced to keep it long as a little kid, but soon as I could, I started going shorter and shorter. Now I have shaved sides and a long top, but haven't worked up courage to go completely bald. I guess I'm the exception to the rule. I appreciate beauty and wish I could do it for myself, but I don't see that happening, so I'd rather be practical. \n\nAnd on a side note, in your opinion, are disabled people allowed to make jokes about themselves? I think yes, because it's our lives and we've lived it and therefore have the right to say what we want and make light of some things that are difficult. The world is too full of special snowflakes who cry attacked and fake hurt.",
            "title_similarity": "0.65795773",
            "sentiment_compound": 0.0237
        },
        {
            "id": "i2pon1k",
            "score": 1,
            "text": "\\> I still find it difficult to accept it as a disability \n\nIt doesn't matter whether or not it was a disability or how serious alopecia is. Violence is not the appropriate response, even when someone says something utterly objectionable. This is not the Middle Ages. Insults do not warrant violence. Period.",
            "title_similarity": "0.812662",
            "sentiment_compound": -0.5967
        },
        {
            "id": "i2ppjxn",
            "score": 1,
            "text": "Also, he didn't really make fun of her or put her down. He made a humorous reference to her resembling a literal hero. GI Jane is an icon and a symbol of female strength and power being equal to, or even greater than, male power. It was about women not being stereotyped as weak, that women were valuable and strong with or without traditional \"beauty\". Jada is so jaded and self-involved that she got upset at what was essentially a humorous compliment. This would be like Will getting offended because someone said he looked like Superman. Nothing but Hollywood vanity and narcissism.",
            "title_similarity": "0.7234286",
            "sentiment_compound": 0.8186
        },
        {
            "id": "i2pqn3v",
            "score": 2,
            "text": "I have alopecia, developed about 18months ago, lots large patches on my head, which as a man is hard to cover up and have lost a large patch on my chin/facial hair and more annoyingly like half my moustache. It's a fucking pain and sucks. But there is no way in hell I consider this a disability. The same as I do not consider myself disabled if u get a rash say. \n\nHer alopecia is hard to really see as she has an entirely shaved head which is a hairstyle in itself and I could not see any patches of bald skin. The patches on my head are totally bald, like the skin on the palm of a hand. Her hair seems to just be cut short all over. \n\nTo call what Chris Rock said an attack on the disabled is ridiculous.",
            "title_similarity": "0.7084311",
            "sentiment_compound": -0.9616
        },
        {
            "id": "i2presy",
            "score": 1,
            "text": "This! Alopecia effects 1 out of 3 females and even more men. I understand women are very much connected with their hair and it’s a huge part of their identity but people are going way overboard about this. She’s not dying, she doesn’t have cancer, or anything like that. She has hair loss. She still looks prettier than 90% of women on the planet so I’m struggling to be super sympathetic to her honestly.",
            "title_similarity": "0.5881858",
            "sentiment_compound": 0.8742
        },
        {
            "id": "i2pux46",
            "score": 1,
            "text": "If a celebrity has an issue then it can be labeled a disability until such time they are relevant in the media. \n\nI think you are looking for medical definitions of disability and that is like so yesterday. Definitely not in trend.",
            "title_similarity": "0.6989294",
            "sentiment_compound": 0.6682
        },
        {
            "id": "i2qpsuo",
            "score": 1,
            "text": "I had alopecia and it's not a disability.  It didn't hurt physically or cause discomfort, and did not impair my ability to do anything.  \n\nCertainly there is emotional pain, but it wasn't that bad.  I thought the GI Jane joke was complimentary, it's like saying you could still be a beautiful bad ass and be bald.",
            "title_similarity": "0.79284906",
            "sentiment_compound": 0.9773
        },
        {
            "id": "i2qtbd7",
            "score": 2,
            "text": "Will Smith was sitting next to Lupita Nyong'o was wearing extensions. People with and without alopecia wear extensions and wigs to have different hair than they can grow. Jada chose to wear her hair bald. She has no right to complain.",
            "title_similarity": "0.73493314",
            "sentiment_compound": -0.5719
        },
        {
            "id": "i2r8l3t",
            "score": 1,
            "text": "Will actually didn't care until Jada forced him- not a big deal until Jada made it",
            "title_similarity": "0.69753534",
            "sentiment_compound": -0.6836
        },
        {
            "id": "i2u474f",
            "score": 1,
            "text": "Agreed. The term \"ableist\" gets thrown around far too much. \n\nIf you think the joke was in poor taste, fine.  Calling it ableist is a step too far",
            "title_similarity": "0.588193",
            "sentiment_compound": 0.25
        },
        {
            "id": "i2vb1bm",
            "score": 1,
            "text": "I feel like this is completely semantic. The question is whether the joke was bad enough to deserve being punched.  It could or could not be, independent of whether it's ableist.",
            "title_similarity": "0.59842217",
            "sentiment_compound": 0.0516
        },
        {
            "id": "i2w82eb",
            "score": 1,
            "text": "It's not \"just hair\" if it no longer grows. That attitude generally comes from folks who have no problems with their hair.\n\nFuck you.",
            "title_similarity": "0.7158303",
            "sentiment_compound": -0.5334
        },
        {
            "id": "i2wp6we",
            "score": 1,
            "text": "No need go change it because you're right. It's not a disability. It's a condition. It can be hard to deal with and make you insecure but it's not a disability",
            "title_similarity": "0.7655134",
            "sentiment_compound": -0.4019
        },
        {
            "id": "i2y6v7u",
            "score": 1,
            "text": "Yeah it wasn’t ableist, but it was still a kind of shitty thing to say…",
            "title_similarity": "0.5612416",
            "sentiment_compound": -0.6946
        },
        {
            "id": "i3gllcn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.19478062"
        },
        {
            "id": "i3owi48",
            "score": 1,
            "text": "Unless you have the condition it's wise not to assume. The problem I have with you statement is the term 'real disability'. I have a condition called Ehlere Danlos Syndrome, a condition that until recently was very poorly understood by medical professionals and the general public alike. Its a collagen disorder and so basically my whole body from my joints to organs are at varying levels defective. I'm in a great deal of pain now, always have been since childhood and always will be. But I for the most part look healthy and so for many I'm not  'really' disabled, I can walk, talk, see and am not at imminent risk of death so I'm not 'really' disabled by some people's definitions of what constitutes a disability. Ricky Gervais has just put out a video laughing at the thought of people with alopecia being termed disabled. Bill Maher sneered that 'its Alopecia not Leukemia' . For those suffering from chronic illnesses and conditions this sort of separation and distinction of medical issues into worthy and not worthy of attention or sympathy by able bodied people can be very triggering. Women especially are often marginalised within health care institutions as there are a great deal of conditions and illnesses that are poorly understood, hard to diagnose and dismissed as normal womens issues and so women are often gaslit into believing they have to just get on with suffering as unless you have cancer, like Maher suggests, why complain. The problem with people free of illness, especially men, deciding what is and what isn't worthy of being deemed a disability is that it gives people with power the ability to obscure the struggles of people who battle with illnesses and that's just bullying. I don't think at all that was your intention. I think you were genuinely thinking about the well being of disabled people however in talking about 'real' disabilities versus what you deem not to be you are unknowingly engaging in a culture whereby people at vulnerable times in their medical journey can be dismissed  as their suffering doesn't fit the paradigm of what able bodied people consider worthy.Thanks for engaging and listening to the  people who disagreed with btw.",
            "title_similarity": "0.6564731",
            "sentiment_compound": -0.985
        },
        {
            "id": "i3yzct1",
            "score": 1,
            "text": "Sorry, but even those of us in the disability community do not get to define what is disabling for another person. Disability is an individualistic experience.\n\nAlopecia is, indeed, a disability if the person who has it says it is. It is a chronic illness in which your own immune system is attacking your own body. In alopecia, it results in baldness.\n\nNow, imagine being a bald woman in a society in which baldness for men is normalized, but baldness for women is stared at, pointed out, talked about as though they are not there - with cruel comments and leads to intrusive questions.\n\nAutoimmune disorders come with chronic fatigue. Having to deal with, and constantly explain it to, the people and world around you only adds to that exhaustion, as do the constant doctor's visits and medical tests. Add to that the psychological toll it takes on, especially, women - depression, anxiety, diminished self-esteem and self-worth. We live in a world that practically worships women with long, luxurious locks. Some women can pull off looking hot in a short hairstyle. But if you line up a long haired woman, a short haired woman and a bald woman - all equally attractive in face and body - the majority of men are going to pick the bald woman last.\n\nSo, is alopecia a disability? If the person who has it says it is - then it is. The disabled community doesn't need the able-bodied community to speak for us, explain us, define us and dictate to us.\n\nThanks.",
            "title_similarity": "0.7518647",
            "sentiment_compound": -0.9565
        },
        {
            "id": "i4rva10",
            "score": 1,
            "text": "Neither is the skin color. But jokes on skin color aren't accepted right?\n\nThe underlying logic is not to make jokes about they physique that they can't do anything about",
            "title_similarity": "0.7911142",
            "sentiment_compound": -0.2098
        },
        {
            "id": "i5eqv48",
            "score": 1,
            "text": "I guess… autoimmune alopecia (it’s a wide spectrum) can be associated with disability. For example, dermatomyositis disproportionately affects Black (American) women https://www.myositis.org/about-myositis/types-of-myositis/dermatomyositis/. It’s an autoimmune disease that causes muscle weakness/disability/reduction in mobility (a sister of scleroderma, lupus).\n\n https://rarediseases.org/rare-diseases/dermatomyositis/\n\nOverlap with multiple autoimmune diseases and cancer is fairly commonly seen in this autoimmune disease. Alopecia itself is just the visible hair loss of course. Many disabilities may be _invisible_ but no less life-impacting or difficult for the patient/their families to deal with.  Many working people have invisible disabilities, actually (the disabilities still significantly impact their lives). https://www.umass.edu/studentlife/sites/default/files/documents/pdf/Invisible%20Disabilities%20List%20%26%20Information.pdf\n\nMore info: https://www.disabled-world.com/disability/types/invisible/\n\nAccording to the CDC, more than 1 in 4 will experience disability at one point or another…so I veer the direction of _not trying_ to definitively judge based on brief encounters… just my hot take! 🥵\n\n🙏\n\nAnyway, this is kind of a tangent. Obviously we can’t assume Mrs. Smith is affected by some extremely rare disease (I am a rare disease patient myself and actually know a dermatomyositis/multiple times cancer survivor patient, which is why I immediately thought of this case). But…in some cases, alopecia can be in fact associated with disability.\n\nThat said, regarding the whole Chris Rock vs. Will Smith debacle… 😪 I feel bad for Chris Rock… but also for all the supporting folks (emerging awesome wig folks for example…some who also have alopecia! https://www.hausofanomali.com/about) who were looking forward to a fun event/seeing their awesome work seen/talked about… and I also feel bad for Mr./Mrs. Smith and their kids…hope they all can find a path forward.",
            "title_similarity": "0.4840148",
            "sentiment_compound": -0.5004
        },
        {
            "id": "i79lozv",
            "score": 1,
            "text": "The great thing about what is and isn’t a disability or ableist, is that’s it’s not for you to decide. And clearly you don’t have a better understanding of disability.",
            "title_similarity": "0.7725327",
            "sentiment_compound": 0.8658
        }
    ]
}