{
    "CMV: Will Smith should have been ejected from the Oscars immediately and it’s disgraceful that he allowed to go up on stage to accept his Oscar and give a speech.\nWill Smith should have been ejected from the Oscars immediately and it’s disgraceful that he allowed to go up on stage to accept his Oscar and give a speech.\n\nHe literally assaulted Chris Rock, in front of the world and nothing happened. I don’t think he should be charged or anything like that unless of course Chris Rock wanted to do so. \n\nI get why he was offended and think it was a knee jerk reaction- a weird one, given he was laughing until he saw his wife’s face - but how was he able to go up, accept an Oscar and give a speech after literally running onstage in front of the world and assaulting the shows host. It’s bizzare.": [
        {
            "id": "i2pfk5z",
            "score": 1,
            "text": "/u/noosanoo (OP) has awarded 4 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/ts56sn/deltas_awarded_in_cmv_will_smith_should_have_been/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.3759162",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i2pfhqk",
            "score": 45,
            "text": "[removed]",
            "title_similarity": "0.13133733"
        },
        {
            "id": "i2pc14y",
            "score": 3,
            "text": "Depends on what you believe.   Was it staged?",
            "title_similarity": "0.18767266",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2p8p7n",
            "score": 40,
            "text": "People want to be outraged. Right now they're outraged by a slap with little response. If he were removed, people would be outraged that a black man got forcably removed for a minor slap. The race issue would be much worse PR.",
            "title_similarity": "0.76437557",
            "sentiment_compound": -0.9022
        },
        {
            "id": "i2pjmmz",
            "score": 7,
            "text": "Man people are so soft now a days. Crying over a slap? really? A slap? Not even a punch. A slap! Chris Rock wasn’t even this upset and he’s the one that got slapped. People are out here getting blown up and we’re here arguing about a man getting slapped. I hate it here",
            "title_similarity": "0.77951527",
            "sentiment_compound": -0.8899
        },
        {
            "id": "i2p5avb",
            "score": -6,
            "text": "Why? It seems likely that the whole drama was part of the show to bring some relevancy back to a thoroughly ignored awards gala. The security never stepped in, the assaulted never pressed charges, the slap looked contrived, the assaulter won a prize despite being well-known for performances more wooden than Groot, and the joke was milquetoast, at best.\n\nThe fishiness of it all, defies any other logical interpretation except it being a scripted drama. Like WWE.",
            "title_similarity": "0.7910051",
            "sentiment_compound": 0.9517
        },
        {
            "id": "i2pefnk",
            "score": 36,
            "text": "When you say he \"should\", you are implying a goal. Why should anyone do anything? To achieve a certain outcome, I would say. In this case, the organization behind The Oscars, their goal is to maximize entertainment. More entertainment, more ratings, more money. Since they are the ones who could take any action, from their perspective they should not have done anything. In fact, this couldn't have been better for them. Society has been nonstop talking about that night, for something they didn't manufacture (allegedly).\n\n\nYour goal of what you want out of that event doesn't align with the people behind the event. They shouldn't have done anything if you consider the utility they are trying to maximize. \n\nEdit: To clarify, I am not condoning one person assaulting another. The CMV was on whether Will Smith should've been ejected, not whether The Oscars had a moral obligation to take action (such as ejecting him).",
            "title_similarity": "0.75222075",
            "sentiment_compound": 0.3792
        },
        {
            "id": "i2pf2kq",
            "score": -3,
            "text": "For a little slap? Please. \nThe joke was bad and out of line, Smith overreacted. Big deal. Calling this assault, while technically true in the legal sense, is pretty absurd and rather an insult to genuine cases of assault. To deny him the Oscar for that would be massively disproportionate.",
            "title_similarity": "0.7536668",
            "sentiment_compound": -0.8799
        },
        {
            "id": "i2p5laj",
            "score": -12,
            "text": "He didn't need to be ejected because the whole thing was a PR stunt. They're actors; if you watch in slow motion, Chris Rock reacted before physical contact would have occurred. There are reports online from the security guards that they were told not to intervene. (Saw on Twitter, sorry no link.) Chris Rock isn't pressing charges and they've already said he's booking 10 times as many people for his upcoming shows. It was all to get people talking about the Oscars and it worked like a charm.",
            "title_similarity": "0.7834985",
            "sentiment_compound": 0.7108
        },
        {
            "id": "i2pgu16",
            "score": -1,
            "text": "It’s time we recognize verbal abuse to be as much (in my opinion, even more) hurtful as physical one. That includes jokes too.",
            "title_similarity": "0.5508773",
            "sentiment_compound": -0.7841
        },
        {
            "id": "i2pclyg",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.13133733"
        },
        {
            "id": "i2pg0qf",
            "score": 210,
            "text": "I really think this discourse is super tired already, but I'll give it a go. First off, Chris Rock wasn't the host just to clarify that. He was only there to present best documentary, which means that his jokes came relatively out of nowhere when most of the other presenters for the night were a lot tamer and mellow comparatively. That might've added to the anger that Smith felt since it felt mildly disjointed compared to the tone the rest of the night, though obviously it doesn't. \n\nTo the people who acting outraged about this, do you care about the Oscars? I watch every year because I love film and I find the Oscars interesting. Chris Rock and Will Smith have had a personal and professional relationship for 35 years at this point, while Smith was wildly unprofessional to say the least and completely overreacted, when it's two people who known each other for as long a time as that, I don't think we can really have an accurate assessment about all of the factors that lead up to it. \n\nChris Rock apologized publicly to Will Smith as did Will Smith to Chris Rock, neither of the parties involved are making this more than what happened, I don't really understand the fascination with seeing Smith punished even greater for... for what exactly? I've seen plenty of times where long time friends will have a quick fight over something that's said and afterwards both parties are still friends. Should I have called the police? Reported an assault and battery even though the parties involved were already satisfied with the outcome? \n\nTo expect an instant reaction and rules change from a hoity-toity awards show is really odd, since this is such an unprecedented event. I get that it felt weird to have him accept his award, but the alternative is handing out an award when there's no plan for what to do afterwards. There's been posthumous wins before, there's been times actors haven't been in attendance, but there's always been a plan or a surrogate to accept in their place. Is slapping a friend who crossed a line such an extreme action that it warrants kicking the winner of one of the awards out of the theatre after a long career, with zero plan in place to handle it? Maybe, but I think it makes complete sense that after such a jarring and shocking event, there weren't immediate plans and SOPs that they were able to follow since this was completely unprecedented.",
            "title_similarity": "0.7966143",
            "sentiment_compound": 0.9939
        },
        {
            "id": "i2pco6m",
            "score": 8,
            "text": "It is possible this was scripted in an attempt to increase ratings.  That would explain why Chris Rock did not file a police report would could have potentially lead to charges, and also why Rock kept his hands behind his back and continued the show.\n\nIf you acknowledge this was straight from the WWE handbook, then you can see why Will was not ejected.",
            "title_similarity": "0.76163554",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2pgwih",
            "score": -3,
            "text": "man give it the fuck up. we get it, wills a toxic dude. how long are you all sharpening the pitchforks for? and really at the end of the day, how does this affect your day to day life?",
            "title_similarity": "0.6345982",
            "sentiment_compound": -0.594
        },
        {
            "id": "i2pg3li",
            "score": 0,
            "text": "*Snore*",
            "title_similarity": "0.14605722",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2p4qxz",
            "score": 409,
            "text": "[removed]",
            "title_similarity": "0.13133733"
        },
        {
            "id": "i2pa0p8",
            "score": 41,
            "text": "How many CMV posts do we need on this topic. 🤦🏻‍♂️",
            "title_similarity": "0.16146412",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2p91tm",
            "score": -9,
            "text": "He shouldn't have because :\n\n1) It wasn't clear whether it was scripted or not\n\n2) The reason it happened was likely because he was given alcohol. Which they do because they want stuff like this to happen.\n\nEdit: I mean at the time it wasn't clear. It seems pretty clear now.\n\nEdit 2: lol you guys really like to buy into everything that happens on tv. I used to work on reality tv. They like these things happening.",
            "title_similarity": "0.65089816",
            "sentiment_compound": 0.9067
        },
        {
            "id": "i2pbz8m",
            "score": 0,
            "text": "Jim, is that you?",
            "title_similarity": "0.0042012334",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2pjls0",
            "score": 0,
            "text": "did he stabbed? wounded? beaten? sent him to the hospital? tortured? Nope, he slapped a guy because he made a out of line joke about his wife in front on him , it's not reason enough for a business like the Oscar's interested in Ratings to intervene, even less considering one is Will Smith a recognized actor by a lot of people. \n\nprobably as a business they aren't interested on drama nor want The attention in a negative light towards them, Imagine the news instead of This :\n\n \"The Oscar's kick out Will Smith after slapping comedian that mocked his wife \" \n\nmuch worse isn't it? for them, it isn't on their interest any involvement as a business, that's without mentioning the different options that could have happened like  the whole thing being scripted, or that The Oscar's just told their guards:\n \"unless something serious is happening stay still, PR is a bitch so don't do something dumb\"",
            "title_similarity": "0.8701787",
            "sentiment_compound": -0.9351
        },
        {
            "id": "i2pzfys",
            "score": 0,
            "text": "I think he still won, because the academy voted he gave the best performance.  But officially they could rescind the award and say no one wins the best actor category this year.\n\nAn unprecedented decision, but he’s the only idiot who actually struck a person during the award show.  Everyone can read it as unofficially Will Smith still won the award; it’s up to them.\n\nI believe it’s fair to separate the art from the man.  Will Smith is cucked by his wife and a fool, but he did give an Oscar winning performance.  Roman Polanski is a child molester, but he did director some good films.",
            "title_similarity": "0.8203281",
            "sentiment_compound": 0.9698
        },
        {
            "id": "i2q5ni5",
            "score": 0,
            "text": "Agreed. Mistakes happen, but they should be followed up with those who know better standing up for what’s right. I love what Kareem Abdul Jabaar wrote: \n\n\nKareem Abdul-Jabbar (UCLA ‘69) writes:\n\n\"When Will Smith stormed onto the Oscar stage to strike Chris Rock for making a joke about his wife's short hair, he did a lot more damage than just to Rock's face. With a single petulant blow, he advocated violence, diminished women, insulted the entertainment industry, and perpetuated stereotypes about the Black community. That's a lot to unpack. Let's start with the facts: Rock made a reference to Smith's wife, Jada Pinkett Smith, as looking like Demi Moore in 'G.I. Jane,' in which Moore had shaved her head. Jada Pinkett Smith suffers from alopecia, which causes hair loss. Ok, I can see where the Smiths might not have found that joke funny. But Hollywood awards shows are traditionally a venue where much worse things have been said about celebrities as a means of downplaying the fact that it's basically a gathering of multimillionaires giving each other awards to boost business so they can make even more money. The Smiths could have reacted by politely laughing along with the joke or by glowering angrily at Rock. Instead, Smith felt the need to get up in front of his industry peers and millions of people around the world, hit another man, then return to his seat to bellow: 'Keep my wife's name out of your fucking mouth.' Twice. Some have romanticized Smith's actions as that of a loving husband defending his wife. Comedian Tiffany Haddish, who starred in the movie 'Girls Trip' with Pinkett Smith, praised Smith's actions: '[F]or me, it was the most beautiful thing I've ever seen because it made me believe that there are still men out there that love and care about their women, their wives.' Actually, it was the opposite. Smith's slap was also a slap to women. If Rock had physically attacked Pinkett Smith, Smith's intervention would have been welcome. Or if he'd remained in his seat and yelled his post-slap threat, that would have been unnecessary, but understandable. But by hitting Rock, he announced that his wife was incapable of defending herself—against words. From everything I'd seen of Pinkett Smith over the years, she's a very capable, tough, smart woman who can single-handedly take on a lame joke at the Academy Awards show. This patronizing, paternal attitude infantilizes women and reduces them to helpless damsels needing a Big Strong Man to defend their honor least they swoon from the vapors. If he was really doing it for his wife, and not his own need to prove himself, he might have thought about the negative attention this brought on them, much harsher than the benign joke. That would have been truly defending and respecting her. This 'women need men to defend them' is the same justification currently being proclaimed by conservatives passing laws to restrict abortion and the LGBTQ+ community. Worse than the slap was Smith's tearful, self-serving acceptance speech in which he rambled on about all the women in the movie 'King Richard' that he's protected. Those who protect don't brag about it in front of 15 million people. They just do it and shut up. You don't do it as a movie promotion claiming how you're like the character you just won an award portraying. But, of course, the speech was about justifying his violence. Apparently, so many people need Smith's protection that occasionally it gets too much and someone needs to be smacked. What is the legacy of Smith's violence? He's brought back the Toxic Bro ideal of embracing Kobra Kai teachings of 'might makes right' and 'talk is for losers.' Let's not forget that this macho John Wayne philosophy was expressed in two movies in which Wayne spanked grown women to teach them a lesson. Young boys—especially Black boys—watching their movie idol not just hit another man over a joke, but then justify it as him being a superhero-like protector, are now much more prone to follow in his childish footsteps. Perhaps the saddest confirmation of this is the tweet from Smith's child Jaden: 'And That’s How We Do It.' The Black community also takes a direct hit from Smith. One of the main talking points from those supporting the systemic racism in America is characterizing Blacks as more prone to violence and less able to control their emotions. Smith just gave comfort to the enemy by providing them with the perfect optics they were dreaming of. Many will be reinvigorated to continue their campaign to marginalize African Americans and others through voter suppression campaign. As for the damage to show business, Smith's violence is an implied threat to all comedians who now have to worry that an edgy or insulting joke might be met with violence. Good thing Don Rickles, Bill Burr, or Ricky Gervais weren't there. As comedian Kathy Griffin tweeted: 'Now we all have to worry about who wants to be the next Will Smith in comedy clubs and theaters.' The one bright note is that Chris Rock, clearly stunned, managed to handle the moment with grace and maturity. If only Smith's acceptance speech had shown similar grace and maturity—and included, instead of self-aggrandizing excuses, a heartfelt apology to Rock.\"",
            "title_similarity": "0.815909",
            "sentiment_compound": 0.9959
        },
        {
            "id": "i2pgw42",
            "score": 3,
            "text": "I mean there is clearly some mental illness going on. His reactions the whole night were weird. I don't know how to challenge you on this one.",
            "title_similarity": "0.5707931",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i2pts5g",
            "score": 4,
            "text": "If Chris Rock wanted him arrested then yes, but Chris didn't want to press charges. It would have made the night worse to remove him. Moving the night along was more important at that moment, and even Chris Rock knew that, he let it go and kept the night moving so others could have their moments.",
            "title_similarity": "0.6745529",
            "sentiment_compound": -0.6901
        },
        {
            "id": "i2p67zb",
            "score": -10,
            "text": "The reaction of the people in that room to The Slap tells one everything they need to know about Hollywood today: their version of Justice is a standing ovation for the guy that assaulted a black man on stage, right in front of all of them, just a few minutes earlier.",
            "title_similarity": "0.75992703",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i2pkhmc",
            "score": 6,
            "text": "You must have missed the part where he healed the room by telling us how hard god's plan is for him, during his acceptance speech.",
            "title_similarity": "0.7235477",
            "sentiment_compound": 0.1027
        },
        {
            "id": "i2qgfv2",
            "score": 4,
            "text": "It was a bitch slap. Dude was talkin shit bout the dudes wife. It happened it’s over beef done. No reason to drag it out and make it worse. People seem to forget a yee while ago, when people used to have beef, they’d fight it out and get over it and be friends or just avoid each other after that. Letting out the violence makes you get over it faster, keeping that pent up anger just causes more problems. It’s not like they went into a full knuckle brawl and had to call security.",
            "title_similarity": "0.73495036",
            "sentiment_compound": -0.9779
        },
        {
            "id": "i2prpph",
            "score": 44,
            "text": "Y’all gotta stop pearl clutching. Dude slapped another dude for lame joke. It ain’t that serious. If Chris Rock felt it was assault or it warranted intervention it would have happened. Instead both people move on to greener pastures. Smith gets his Oscar and Rock gets a Netflix special of new material. The only people suffering here are those forced to witness the unending discourse about race relations and Oscar decorum (the latter of which is really pretentious and pointless. We gave an Oscar to Shrek, I don’t think we have to care this much about the sanctity of these awards.)\n\nAlso they never took these awards away from Weinstein or Polanski despite overwhelming evidence of their crimes, who cares if Smith had a little diva moment. He got a standing ovation for the audience ignoring him not being able to take a joke? Polanski got one for escaping justice for assaulting a teenage girl. We have bigger fish to fry. \n\nThe real problem here is everyone’s obsession with trivial garbage. None of this matters. Smith shouldn’t give back the Oscar. Rock shouldn’t apologize to anyone. It was a fun moment we should all just laugh off.",
            "title_similarity": "0.8500515",
            "sentiment_compound": -0.1419
        },
        {
            "id": "i2pglcd",
            "score": 0,
            "text": "smith is bigger than the oscars",
            "title_similarity": "0.21115965",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2pkg3z",
            "score": 0,
            "text": "1) it was likely staged, no one who has just insulted someone's wife stands there and giggles as that man comes at him and Smith's \"life imitating art\" comment. Add in the convenient timing of the slap happening just far enough from Smith winning to get out on social media so people would tune in.\n\n2) if it wasn't staged the Oscars isn't immune to controversy and in fact thrives on it",
            "title_similarity": "0.7468423",
            "sentiment_compound": -0.1501
        },
        {
            "id": "i2pshqm",
            "score": 0,
            "text": "No your wrong",
            "title_similarity": "0.13817415",
            "sentiment_compound": 0.091
        },
        {
            "id": "i2pw474",
            "score": 0,
            "text": "What difference does it make if the world was watching? It's a show, not a lesson of morals or culture. People saw what happened, made their conclusions, had fun and topics to discuss.\n\nBoth men involved are adults and were able to solve their issue between themselves without institutions being involved. One man made a move, another one answered. It's great they had this freedom to express themselves. Adults don't like officials to tell them what to do.\n\nFor adults there's no big fair parent who can solve conflicts, unless legal actions are initiated.\n\nPublic discussion is interesting, many victimizing participants, others turning them into evil aggressors, classic stuff. But it's not about the participants, it's about people themselves.\n\nSo, the most reasonable thing to do here is not to desire someone to should have been done something differently in that situation. The most reasonable thing here is to ask yourself: why are you having emotions about it, what does it say about you.",
            "title_similarity": "0.62220836",
            "sentiment_compound": -0.2899
        },
        {
            "id": "i2q5r6n",
            "score": 0,
            "text": "It was a dainty little slap, to call it assault is bigger overreaction than Smiths. Plus we don't know the 'reason' behind it, suppose we'll have to wait for 'the book'.",
            "title_similarity": "0.6130592",
            "sentiment_compound": -0.6361
        },
        {
            "id": "i2qsrxt",
            "score": 0,
            "text": "They are our better people. It's different. Just ask any of them.\n\nI caught on a news program the academy are weighing their options on how to handle this.  The fact they don't consider violence an automatic bad thing proves this.  \"We can't just ban him, revoke his awards, stop giving him movies.  We might lose box office money.\"  If you're big enough, you can get away with things.",
            "title_similarity": "0.67774475",
            "sentiment_compound": 0.7284
        },
        {
            "id": "i2qyx42",
            "score": 0,
            "text": "> He literally assaulted Chris Rock, in front of the world and nothing happened. I don’t think he should be charged or anything like that unless of course Chris Rock wanted to do so.\nI get why he was offended and *think it was a knee jerk reaction*- a weird one, given he was laughing until he saw his wife’s face - but how was he able to go up, accept an Oscar and give a speech after literally running onstage in front of the world and assaulting the shows host. It’s bizzare.\n\nHard to claim it was a knee-jerk reaction when it took him quite a while to get from his seat all the way up onto the stage.",
            "title_similarity": "0.92243624",
            "sentiment_compound": -0.5499
        },
        {
            "id": "i2r1nkw",
            "score": 0,
            "text": "If I walked over to my coworker, smacked him and started yelling stupid shit, they'd send my ass home and possibly even call the cops. What makes this any different?\n\n> I don’t think he should be charged or anything like that unless of course Chris Rock wanted to do so.\n\nWhy not? Will Smith getting charged should have *nothing* to do with Chris Rock. People can try minimizing what Will Smith did, but he chose to assault Chris Rock on international TV. That choice should have the appropriate consequences.",
            "title_similarity": "0.89309067",
            "sentiment_compound": -0.9074
        },
        {
            "id": "i2r9040",
            "score": 0,
            "text": "He had already won the Oscar so they could have asked him to leave but he still deserves the Oscar.",
            "title_similarity": "0.69557744",
            "sentiment_compound": 0.3071
        },
        {
            "id": "i2rhg6v",
            "score": 0,
            "text": "Mr. Smith went up on stage. Come on man, That shit was staged. Stop giving a fuck about these people and what they're doing, or what they're wearin, or how to be more like them. They fo sho don't give a fuck about you.",
            "title_similarity": "0.75902367",
            "sentiment_compound": -0.3087
        },
        {
            "id": "i2riie0",
            "score": 0,
            "text": "Everything happened just right for him not to be. It very much could have been staged for publicity.",
            "title_similarity": "0.45991915",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ruygf",
            "score": 0,
            "text": "I’m sure it was a real slap but it was staged. There actors for Christ sake its their job to deceive people.",
            "title_similarity": "0.6516628",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i2s25rr",
            "score": 0,
            "text": "I agree that he shouldn't have punched Chris Rock in the face however, Chris Rock should also face retaliation and punishment for the disrespect he was showing towards Will Smith's wife \nWhy are we just heating on Will Smith and not the person that started all the b******* that was running his mouth?",
            "title_similarity": "0.8482919",
            "sentiment_compound": -0.5423
        },
        {
            "id": "i2s330j",
            "score": 0,
            "text": "I would have done the same... It should not be a sin to defend your loved ones. Even if Chris Rock was \"joking\" he was making fun of his wife... In front of him... On live TV...\n\nWhat if she was overweight and Chris Rock made a fat joke, people would be agry at him since there is a lot more fat women that would feel aggravated by fat jokes.\n\nIs not ok to joke about someones defects",
            "title_similarity": "0.7386932",
            "sentiment_compound": 0.654
        },
        {
            "id": "i2qd1ti",
            "score": 6,
            "text": "I think he should have been allowed back up, but halfway through the acceptance speech Rock should have snuck up behind him and kicked him as hard as possible in the balls.",
            "title_similarity": "0.7301904",
            "sentiment_compound": 0.5267
        },
        {
            "id": "i2phpuy",
            "score": 1,
            "text": "It’s okay man he’s rich and apologised, the law doesn’t apply.\n\nSomething something white privilege",
            "title_similarity": "0.63529027",
            "sentiment_compound": 0.8126
        },
        {
            "id": "i2pjy51",
            "score": 1,
            "text": "I'll give this a shot.  \n\nThe Oscars is an award show for movies.  One could argue that this type of violence, slapping someone for acting poorly, is not only normalized but it's also occasionally encouraged.    For example, and I get I'm crossing mediums, but I just watched season two episode one of Space Force, where John Malkovich's character slaps Ben Schwartz's character twice to get him out of a panicked state.   What's the functional difference between this type of assault, and what happened at the Oscars?  \n\nSecondly, it would be up to the producers of the show to decide to punish Will Smith for his actions.   We didn't we what happened during the commercials or if they spoke with him before he accepted his Oscar.   Perhaps they asked him if he was calm and he reassured them he was fine.    It's their show, their rules.   \n\nThirdly, Jim Carrey said it best when he said that Will Smith stole the moments for so many other people who worked very hard to win or even be nominated for an Oscar.    If you are planning to escort him out, it's going to make him an even bigger part of the scene, especially for those who might have agreed with him in the moment.",
            "title_similarity": "0.78757566",
            "sentiment_compound": 0.8851
        },
        {
            "id": "i2ppejz",
            "score": -1,
            "text": "I disagree wholeheartedly. He should be arrested and stripped of his cutesy  silly award. He's a pampered publicity hound with a gorgeous wife and millions in the bank,  good health care, lives in a mansion and so on. I would have been in jail...I'm not rich. Last but not list , this selfish act must have set anxiety and ptsd for millions who suffer from it. This was truly hurtful.",
            "title_similarity": "0.7726809",
            "sentiment_compound": -0.8555
        },
        {
            "id": "i2ppvip",
            "score": 1,
            "text": "Newsflash: the Oscars is a ceremony of self-congratulation. Nothing more.",
            "title_similarity": "0.5219591",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2ps2dq",
            "score": 1,
            "text": "i will say Chris Rock's monologue was scripted, even read off a teleprompter, and therefore it should have been vetted.  It's not the speaker's fault entirely.  Smith should take it up with the hosts and the Academy in that case.  Am I disagreeing with you?  To the extent there should have been a heads up.",
            "title_similarity": "0.64577365",
            "sentiment_compound": -0.0366
        },
        {
            "id": "i2pttbu",
            "score": -1,
            "text": "What tiktok has taught me is that this is a black issue since it was two black men. Violence can be both physical and verbal. So when Chris rock was verbally violent it was ok for will smith to retaliate with being physically violent",
            "title_similarity": "0.5986024",
            "sentiment_compound": -0.8934
        },
        {
            "id": "i2q47j1",
            "score": 1,
            "text": "It's called a performance. He would have been if it were real. Shit was theatre",
            "title_similarity": "0.43974763",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i2q4qk6",
            "score": 1,
            "text": "You're assuming the whole thing wasn't a stunt.",
            "title_similarity": "0.23301537",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2rbxdv",
            "score": 1,
            "text": "what will smith did was wrong and bad behavior. whatever consequence occur for him he deserves, yes he should have been escorted out immediately and whatever..but at the same time chris rock deserved to get slapped, if your business is bullying people for laughs then be prepared for pissing people off and what comes from that. if you think violence is not the answer I agree with you, but then will smith slapping chris rock is very low on the list of priorities when it comes to violence as there is a war going on, millions of children and families are being abused, cops killing people, january 6th happend etc etc. I think the media and people are so desperate to make this oscars situation a big deal because we're tired of hearing all the actually important issues that are going on and really make the world an ugly place.",
            "title_similarity": "0.83074355",
            "sentiment_compound": -0.9921
        },
        {
            "id": "i2re5m1",
            "score": -1,
            "text": "Okay?? It happened, it’s over.",
            "title_similarity": "0.19056445",
            "sentiment_compound": 0.3094
        },
        {
            "id": "i2rg17v",
            "score": -1,
            "text": "Why you guys love take away peoples achievements. If he deserves it because of the work, the he deserved it.",
            "title_similarity": "0.5409219",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i2roaes",
            "score": 1,
            "text": "OJ simpson all over again. violent black man who will walk in the eyes of the public because justice would be 'racist'",
            "title_similarity": "0.7222791",
            "sentiment_compound": -0.6705
        },
        {
            "id": "i2rplg0",
            "score": -1,
            "text": "CMV: everybody is making a BFD out of a guy slapping another guy.\n\nPersonally, I give and gave literally zero shits.",
            "title_similarity": "0.7179465",
            "sentiment_compound": -0.8192
        },
        {
            "id": "i2ru3je",
            "score": 1,
            "text": ">Will Smith should have been ejected from the Oscars immediately and it’s disgraceful that he allowed to go up on stage to accept his Oscar and give a speech.\n\nI would argue that the Academy never ever imagined something like this to happen therefore there were no protocols in order.\n\nAnd after \"Oscars so White\", which was amplified by Will Smith's own wife after he failed to be nominated in anything back in 2015, the Academy was extra conscious of the visuals of removing a violent black man against his will in front of the cameras.\n\nImagine for a second that Will, who was visibly unhinged and possibly drunk, physically resists to be escorted and the police/security has to tackle him or tase him. \n\nHorrible horrible horrible visuals.\n\nAlso, the Academy already knew he was going to win (votes are made well in advance) so they decided that letting him stay and deal with the fallout later was the least possible worse choice.\n\n>He literally assaulted Chris Rock, in front of the world and nothing happened. I don’t think he should be charged or anything like that unless of course Chris Rock wanted to do so.\n\nIn the USA, things like battery (physical assault) don't require charges to be lifted.\n\nIt is up to the police's discretion to arrest someone or not.\n\nEven if Chris Rock decides not to lift charges, there is a real possibility that Will Smith is charged with battery and that he settles it to get community service or house arrest.",
            "title_similarity": "0.9426543",
            "sentiment_compound": -0.9744
        },
        {
            "id": "i2s8zyp",
            "score": 1,
            "text": "He should have had that knee jerk reaction when his SON’S friend was ducking his wife. He’s a fucking simp!",
            "title_similarity": "0.756407",
            "sentiment_compound": 0.2714
        },
        {
            "id": "i2sccgf",
            "score": 1,
            "text": "Agree. The average citizen would not have been permitted to go on with his or her evening. Heck, Chris Rock wouldn’t have been permitted had the situation been reversed.",
            "title_similarity": "0.5933744",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2sjsuw",
            "score": 1,
            "text": "They asked him to leave, but he refused. If they tried to \"enforce\" their request, it could likely have become a BLM issue, especially if Smith got violent again when security and/or police tried to escort him out.",
            "title_similarity": "0.7036819",
            "sentiment_compound": -0.7311
        },
        {
            "id": "i2sq7fa",
            "score": 1,
            "text": "I don’t disagree. However, these people don’t do funny. They are all in a stable like horses to some extent forced to exhibit often backward santanic, gender bending, offended moral policing, ultra left leaning, do what I say or you’ll never work in this town again behavior with a touch of pediphilia/blackmail/rape all driving them to keep their mouths shut. So that is what they do.\n\nThe comedians are the bastions of truth. Most at least. That’s why they have reacted the hardest while being in the spotlight. But look at Chris Rock even. The ecoshitstem even had him, a man embarrassed on tv by a public cuck who found the joke funny at first, not talking the way he wanted. Because he would lose all his opportunities or they would smear him.\n\nMy point is it never mattered what Will wanted to do or what should’ve happened to him. It’s all a big masquerade where you play your pawn part. Nothing would’ve ever happened to him as long as he sticks to the ideology of his handlers and people that allow him to be one of the biggest movie stars ever. There’s ALOT of examples of when people start talking out or making sense of shit going south.",
            "title_similarity": "0.76272374",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i2t89lm",
            "score": 1,
            "text": "What if an usher working the Oscars had identically walked up and slapped Chris Rock?\n\n…. Why is the answer at all different because it was a major motion picture star doing the slapping?",
            "title_similarity": "0.79657906",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2pck7f",
            "score": 297,
            "text": "I think people were confused at what happened and if it was scripted or not. A slap happens quickly and by the time security realized what might have happened, will already walked off stage and sat down. He cussed some words but it lasted a total of probably 15 seconds. Chris then continued hosting. So in a short span of what was broadcasted on TV it makes more sense to just let the show go on and not make things bigger than what was over. I think nobody couldvr made the decision to not let will go back on stage.",
            "title_similarity": "0.8076975",
            "sentiment_compound": -0.0444
        },
        {
            "id": "i2pk4ss",
            "score": 2,
            "text": "Let’s focus on war",
            "title_similarity": "0.35790265",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2pvheh",
            "score": 2,
            "text": "He got away with it because he’s a multi-million dollar worth celebrity. Had it been anyone else who did what he did, they immediately would have been escorted out the building.",
            "title_similarity": "0.6727284",
            "sentiment_compound": 0.2263
        },
        {
            "id": "i2qcwzv",
            "score": 2,
            "text": "All I think I’m able to say is that Hollywood is a Petri dish of degeneracy and scum. If we chose to only allow attendees in who have witnessed a hooker die, sexually exploited others or committed felonies; the crowd would look roughly the same. They aren’t normal people. They’re almost another species.",
            "title_similarity": "0.6834662",
            "sentiment_compound": -0.8126
        },
        {
            "id": "i2pn1i9",
            "score": 2,
            "text": "Host an event like this, do extreme research in what all can happen this evening + expect the unexpected and still a very ready team should've been not knowing how to act in the situation.\n\nThe situation might be clear now for most of people and everyone is smart afterwards, right?\n\nSo first you have to believe all the professionals who are keeping up a successful business were interested in this.\n\nPartly yes, because attention.\nMainly no, because if you are managing events you are ALWAYS alert might not catch real sleep nights before because you CONSTANTLY think about what can go wrong.\n\nTherefore to judge like this, you have to believe these people were careless and accepted this.\nI don't believe this happened and from a professional view this doesn't make sense.\n\nThe question in the room is:\n\nWhy did nobody act like everyone wished for afterwards?\n\nShort after, nobody was really certain what happened, why it happened and there for sure has been a feeling of missing information.\n\nWill is a likeable guy, who has been a role model for the whole world for decades.\nWhy did he do this?\n\nCan we ask him what happened and why it happened now?\n\nIf not, is it okay if we let him speak at the Oscars? Are we flexible to change that?\nIs it our fault we didn't check Rocks script well enough?\n\nHas their been any communication after Rock already hit Jada with some words back in 2016?\n\nNot letting him speak would be a very risky intervention with the risk of heavy backlash, no option sounds well.\n\nBut if you act, you can be held accountable for your ways of acting as an organization because you made a political move.\n\nI believe no matter what they've done there would be a backlash and a lot of negativity around the decision.\n\nWhat about keeping the organization out of this whole mess, let's take another perspective:\n\nYou are trying to host a great evening for your family, to praise everyone who excelled in the last time.\n\nYour dad slaps your uncle because he made a comment about your mother that was not good.\n\nYou don't know all the context but you know your dad is not having a good time though over the last 30 years he is one of the best man everyone knows.\n\nHow do you act?",
            "title_similarity": "0.6404996",
            "sentiment_compound": 0.9696
        },
        {
            "id": "i2py3c5",
            "score": 2,
            "text": "Change my view: People need to stop posting the same damn posts about Will Smith over and over again.",
            "title_similarity": "0.717078",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2qyeos",
            "score": 2,
            "text": "In an ideal world, Will Smith would not have known he was going to win the Oscar.  Also, as many noted, he was initially laughing until he saw his wife’s face.\n\nThink about the fact that Jada, also an actor, is sitting at an event with Hollywood elites, and getting her alopecia called out on a global stage, and jokingly typecast into military/butch roles.  That must have been devastating.\n\nAgain in an ideal world, this profound hurt must have hit Will Smith like a ton of bricks, and he reacted in a way most husbands (save Senator Ted Cruz) would react if their wives were hurt.\n\nI think even the Oscar staff did not know how to respond to a natural husbandly response, and did nothing.\n\nAlso Will Smith did not continue his physical attack, point being made.\n\nHe won the Oscar by the strength of his performance and the vote of the Academy.  Rescinding the award could not have been considered and done in the time allowed.  Also again, a very limited set of staff would have known he was going to win, and therefore preventing him from going on stage to get the award for Best Actor was not really an option once his name was called, and he was still in the room.\n\nWhile I agree with the OP in sentiment, the position represents one of a Monday-morning quarterback, with which I must disagree with in practical terms",
            "title_similarity": "0.80158484",
            "sentiment_compound": 0.981
        },
        {
            "id": "i2perfh",
            "score": 1275,
            "text": "Well, I don't disagree, so it's kind of hard to change your view. (I think most people agree Smith should have been removed, and his award should have been accepted on his behalf).\n\nBut I'll bring up a name I mentioned in another thread: Roman Polanski. He drugged and raped a minor in 1977, and then fled America before he could serve any punishment. He can't return to American soil because he's a fugitive. In 2003, the Academy gave him the Best Director Oscar. Fair enough, The Pianist was a fine film, but I think that demonstrates that the Academy doesn't care one bit about ethics, morals, or doing the right thing. They had zero issues giving a man who raped a minor (and it's not speculation, he was charged) one of the most significant Oscar awards (it's considered one of the \"top five\" awards).\n\nMy point is if they didn't have any qualms giving him an Oscar, them not doing anything to Smith at least keeps them consistent. I would have a bigger issue with them taking away Smith's Oscar if they didn't also take away Polanski's. (Or anyone else who has ever done bad things).\n\nSo I guess that's my attempt to change your view, that you need to realize the Academy is a business and they aren't going to make moral or ethical judgments. Oh sure, they'll SAY they care about this and that, but actions speak louder than words.",
            "title_similarity": "0.84147584",
            "sentiment_compound": 0.9522
        },
        {
            "id": "i2poy4u",
            "score": 5,
            "text": "I just read that john wayne wanted to hurt  that indigenous lady who was taking marlon Brando 's oscar and 6 guards had to reetrain him. Also she was booed by clint easrwood and the entire crowd. It was  in 1971 and we still consider these people movie gods. Make no mistake that Hollywood is a business and not an ethical   one.",
            "title_similarity": "0.8314471",
            "sentiment_compound": -0.6207
        },
        {
            "id": "i2qe0fr",
            "score": 16,
            "text": "Why do so many people think Chris Rock was the host of the Oscars?? That’s the real take away here.",
            "title_similarity": "0.6752134",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2pnh1n",
            "score": 23,
            "text": "Three things.\n\nHindsight is 20/20, group/mob mentality is overlooked, people act strange while in shock. \n\nSo yes. In hindsight, it’s very easy to see Will Smith is incorrect, and things should’ve gone down differently. \n\nBut in the moment, people look to their left and right to determine what their reaction should be. If everyone around them is not reacting, then the individual is less likely to react. You see this all the time in any public event where an applause might happen. “No one claps/applauds at first. Then one individual starts it up. Then everyone else follows.” So if that one *ballsy person* does not reject Will’s actions, people are extremely likely to just keep their mouth shut. \n\nAnd further, when an abnormal event happens, and people are “shocked”, they don’t tend to react in a way you might expect. The same way I might say to myself, “If I see a bear outside my car while I’m leaving for work, I’m going to throw my hands up and yell at it, and stand my ground!” Yet when I’m actually walking to my car, and hear a squirrel break a twig, I freeze, swing my head around, and nearly shit my pants. People just act in ways you wouldn’t expect, “in the moment”.",
            "title_similarity": "0.7502167",
            "sentiment_compound": 0.5221
        },
        {
            "id": "i2pep70",
            "score": 1,
            "text": "I think with the way Hollywood glorifies violence in a lot of films (including Oscar winners) it would be a little hypocritical of the Academy to boot Smith out for a slap.",
            "title_similarity": "0.7747698",
            "sentiment_compound": 0.024
        },
        {
            "id": "i2pjay5",
            "score": 1,
            "text": "A rich person hit another rich person in a room full of rich people. If anything I imagine all of their bank accounts will only grow if anything from this incident.\nI imagine this type of thing happens between the rich often it’s just not usually televised. I really don’t understand why anyone cares; you do not know these people, and what you think you know has been carefully crafted and sold to us by them and their teams.",
            "title_similarity": "0.61116016",
            "sentiment_compound": 0.9578
        },
        {
            "id": "i2pjjaq",
            "score": 1,
            "text": "The Oscars exist for them to be watched. Will Smith sticking around after the slap gave them more views and drama and spice than if they just kicked him out. Money/fame/viewership are perfectly valid reasons to base decisions on.",
            "title_similarity": "0.6274427",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i2pjnml",
            "score": 1,
            "text": "The fact that he was even allowed to walk on stage demonstrates how little the Oscars cared/how unorganized the event was security wise. The Oscars is probably delighted this all happened, shocking interruptions are common place at award shows and lead to media buzzes.",
            "title_similarity": "0.6849416",
            "sentiment_compound": 0.7845
        },
        {
            "id": "i2pk2yl",
            "score": 1,
            "text": "I disagree he should’ve been arrested immediately. This is completely stupid and they probably wanted to rating so they let him go on. I’m in shock these idiots clapped. Ten years ago they would’ve been appalled at any actual violence as actions although they portray it all day to kids and think they are saving the world when they give their speeches",
            "title_similarity": "0.8491866",
            "sentiment_compound": -0.9589
        },
        {
            "id": "i2pkiw2",
            "score": 1,
            "text": "The Oscar's have been declining in popularity. Last year was its lowest level yet. These are paid actors, capable of making people believe they feel emotions when they don't. And now everyone is talking about the Oscar's. Do the math. It's still sort of disgraceful but not for the reason the vast majority seem to think. There's no real reason to assume this was anything but a set up to bring the Oscar's back into the public eye. And again, for the people that want to rant about how real it looked, that is literally their job.",
            "title_similarity": "0.7561784",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i2pl2wk",
            "score": 1,
            "text": "Ppl really dont know this was scripted wow",
            "title_similarity": "0.3016879",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i2pl47l",
            "score": 1,
            "text": "Its almost like nationwide godworshipping of celebrities is a mistake?",
            "title_similarity": "0.60417527",
            "sentiment_compound": -0.0498
        },
        {
            "id": "i2pmbr5",
            "score": 1,
            "text": "This is what the Oscars organisers want. Drama, controversy. Anything that makes people watch\n\nNo security guards to stop people just walking up on stage? Pretty sure they are happy for celebs to go up and do something silly\n\nThis is why he can give a speech after. We all talk about it and it makes good telly",
            "title_similarity": "0.758814",
            "sentiment_compound": 0.8506
        },
        {
            "id": "i2pmcsu",
            "score": 1,
            "text": "It probably didn't matter because I honestly think this was either a means to generate talk about the Oscars or to get people to tune in, or to get people to talk about Chris Rock and Will Smith. I mean take this for instance, viewership for the Oscars jumped up by 50% from last year because of the stunt, because without that 50% bump, they would've had the lowest viewership ever if they hadn't had this happen. However, it still turned to be the 2nd worst Oscars in terms of ratings. The Oscars and other awards shows where celebrities jerk each other off for accomplishments on the silver screen and use it to soapbox is just unpopular and they know that the show is failing and continually loses viewership. This was just a means to drive up viewership and get people talking about them. Remember, they're all actors, and Will and Chris are used to taking dives or a light punch, Chris didn't flinch or duck or back away or block, nothing. This had to have been staged.",
            "title_similarity": "0.7029723",
            "sentiment_compound": -0.8927
        },
        {
            "id": "i2pn9kh",
            "score": 1,
            "text": "I think its a publicity stunt ngl. Changr my mind.",
            "title_similarity": "0.31898534",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2pp3mj",
            "score": 1,
            "text": "Try to think of it this way. This whole thing is ridiculous and blown out of proportion. It really doesn't matter what happened. I'm not even sure the Oscar's still matter. \n\nWe should all just stay out of the personal lives of celebrities. Appreciate the entertainment they provide and then move on.",
            "title_similarity": "0.7895267",
            "sentiment_compound": 0.1988
        },
        {
            "id": "i2pr43x",
            "score": 1,
            "text": "Can’t argue with the truth.",
            "title_similarity": "0.114784695",
            "sentiment_compound": -0.0258
        },
        {
            "id": "i2prpfl",
            "score": 1,
            "text": "The Oscar is so much to praise Will Smith. . . . and I completely agree with you on this entire post, but for the sake of trying to sway you in any way possible. . .  I would have felt really bad for the countless others who worked on *King Richard* to make it worth the award to lose that from Wills action. \n\nShould have let ANYONE else available from the movie come take Wills Oscar",
            "title_similarity": "0.77642304",
            "sentiment_compound": 0.1751
        },
        {
            "id": "i2psaip",
            "score": 20,
            "text": "I'm assuming the reason he wasn't ejected was it simply happened so fast and the people in charge probably couldn't come to a consensus AND politely ask him to leave by the time it was Smith's turn to go up on stage.\n\nAnd no, I don't buy the whole \"it was staged\" thing. Putting aside Smith's acceptance speech afterwards when you apply Occam's Razor (the simplest explanation is the most likely) what is more likely:\n\n1. The people who run the Oscars concocted a plan to boost ratings that involved convincing Will Smith, Jada Smith, and Chris Rock to make themselves look really bad on stage for the entire world to see (especially Will Smith, who is one of the most powerful people in Hollywood).\n2. Rock happened to make a bad taste joke and Smith, pushed to the brink by the shame and mockery that have been heaped on him for the last few years, reacted badly.\n\nAll in all 2 is way more likely than 1 simply because it doesn't involve a massive conspiracy.\n\nEdit as of 3/31/2022: And now the Oscar people are saying they did ask Will Smith to leave, but he refused.",
            "title_similarity": "0.8150892",
            "sentiment_compound": -0.6187
        },
        {
            "id": "i2psts1",
            "score": 1,
            "text": "I thought so",
            "title_similarity": "-0.1586496",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2psvgl",
            "score": 1,
            "text": "From the Oscar's point of view, who has supposedly been struggling with viewership, it's good for business. its helps keeps the drama going  keeping Will Smith there and then having him win an award and addressing the situation.",
            "title_similarity": "0.5196478",
            "sentiment_compound": 0.875
        },
        {
            "id": "i2pujp9",
            "score": 1,
            "text": "He is the reason I was made aware that the Oscars were taking place. \n\nAnd if we are talking about Will Smith I think he deserved an Oscar (I don't know why he did this time though; which movie?)\n\nSo I think it was a good thing the joke was made, the face was slapped and the trophy received \n\nIt's amazing.",
            "title_similarity": "0.7017324",
            "sentiment_compound": 0.836
        },
        {
            "id": "i2pvybc",
            "score": 1,
            "text": "Agreed",
            "title_similarity": "-0.20968726",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2px8td",
            "score": 1,
            "text": "The Oscars chose to not do anything. They face social consequences from it.\n\nI take the Oscars even less seriously now, and realize I can't even relate to the crap that gets spewed out from their events.\n\n\"Should have been ejected\" - who should have done it? The management team for this even decided it was less damaging to proceed as normal. They made a decision in the moment. Was it the best decision? Nope. It wasn't even that good.\n\nBut hey, the Oscars and Smith are facing quite a bit of backlash for this, and people now see the Oscars as a drama show instead of a \"prestigious\" even to recognize art and film.",
            "title_similarity": "0.8295699",
            "sentiment_compound": -0.3549
        },
        {
            "id": "i2py9xt",
            "score": 1,
            "text": "I think the politics of the Oscars is the only reason he wasn't asked to leave. He had an award nomination very shortly afterwards. Otherwise I believe he would have been. By ejecting him before his category was announced it would have drawn more attention to his actions. I'm betting if he had already received his award, or not wom but his category was past, he would have been politely asked to leave. Rock too if he wasn't a host.\n\nAssuming the whole thing wasn't staged, which I'm of the opinion it wasn't, but that debate rages on.",
            "title_similarity": "0.79576933",
            "sentiment_compound": -0.2206
        },
        {
            "id": "i2q13lr",
            "score": 1,
            "text": "If only Uncle Phil was around to throw him out.",
            "title_similarity": "0.6794529",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2q29zj",
            "score": 1,
            "text": "They settled things down themselves pretty quickly. Nobody was injured. Nobody's life was threatened. I don't see how forcibly ejecting Will would serve any purpose, and it would only make more of a scene.",
            "title_similarity": "0.4974792",
            "sentiment_compound": -0.3612
        },
        {
            "id": "i2q2rm5",
            "score": 1,
            "text": "He was not ejected because it was fabricated. Pretty clear stage slap in my opinion.",
            "title_similarity": "0.61916167",
            "sentiment_compound": 0.7506
        },
        {
            "id": "i2q33qm",
            "score": 1,
            "text": "Dude, they have an Oscar to Roman Pulanski a few years ago.",
            "title_similarity": "0.44158387",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2q3fap",
            "score": 1,
            "text": "Chris Rock was not the host of the Oscars",
            "title_similarity": "0.46832803",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2q6mpb",
            "score": 1,
            "text": "Why? The Oscar’s staged it for ratings most likely. Like the Kaufman Lawyer thing years ago.",
            "title_similarity": "0.5560641",
            "sentiment_compound": 0.4173
        },
        {
            "id": "i2q6t1z",
            "score": 1,
            "text": "The Oscars is run like any other profiting form of entertainment. The slap was quality content. More people will watch the Oscars if there are more slaps. Is this morally right? No, but it's the right move for the Oscars.",
            "title_similarity": "0.63461196",
            "sentiment_compound": 0.5789
        },
        {
            "id": "i2q71n3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.13133733"
        },
        {
            "id": "i2q8hjm",
            "score": 2,
            "text": "Your suggestion makes sense if it were a restaurant or a bar.\n\nThe Oscars is a business. People behind the scenes have invested money into the event and they want it to go smoothly. It won't help them to just escalate the situation even more and to change the pre-planned schedule.\n\nWhat Will Smith did was dumb, but the show management isn't to blame, they pretended it didn't happen and carried on as planned. Same as Chris Rock.\n\nImagine if a live telecasted show, now had to cut out a segment. Do you know how many TV broadcasting rules and regulations need to be consulted regarding time slots, commercials and such? These things are run by teams of hundreds of staff. That's why they'd prefer to stick to the original schedule as much as possible.",
            "title_similarity": "0.6903289",
            "sentiment_compound": 0.058
        },
        {
            "id": "i2q8i2j",
            "score": 1,
            "text": "Privilege.",
            "title_similarity": "-0.053990126",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2qa976",
            "score": 6,
            "text": "OK I’ll make a legit shot at changing your view.\n\n“Should have been ejected” is a decision to make based on a few things.\n\n1. Legally are they required to eject him, and\n2. What outcome do you want from this decision?\n\nFirstly, No. They were not legally required to eject him.  Being honest it is “possible” that the academy didn’t know if it was staged or not. I would say they had plausible deniability.\n\nSexondly, What outcome is better? Kicking Will Smith out thus returning the show back to it’s boring status quo, or letting him stay and “see what happens next?”. We got a batshit self-unaware acceptance speech and believe me there were cameras focused on him all night to see what he does next.\n\nIt’s important to remember that the “Academy” is bullshit to begin with. It’s a dumb awards show where self-important people give each other handjobs that is sold as some glamourous must-see event. We shouldnt look at this as anything but “something to watch on TV” and we all know train wrecks are much more interesting than when it all goes smooth.  I bet next year’s show has MUCH higher ratings.   Guess why?",
            "title_similarity": "0.74205065",
            "sentiment_compound": 0.9046
        },
        {
            "id": "i2qapfz",
            "score": 1,
            "text": "The Oscars knew Will Smith was winning, they have had poor ratings prior to the pandemic and even worse during it. The Oscars is a business. Why would they eject a box office megastar who is bringing actual drama to their audience. You don’t pull a controlled train wreck. Your forgetting that what we saw live; is timed delayed for that reason. They chose to show it.  Ratings through the roof. Also, this is an accepting crowd, Will Smith got a standing ovation from the audience in attendance. He is guilty of doing what everyone wants to do in that situation but doesn’t because of public opinion. He is human. \nTLDR: A business doesn’t ruin the greatest ratings night they have had in decades, by ejecting a first time ultra famous Oscar award winner for losing his shit understandably.",
            "title_similarity": "0.8222109",
            "sentiment_compound": -0.0387
        },
        {
            "id": "i2qbv7c",
            "score": 3,
            "text": "We're talking about people that think Roman Polanski is a cool guy.",
            "title_similarity": "0.36726248",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i2qctul",
            "score": 1,
            "text": "Yes",
            "title_similarity": "-0.21347868",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2qcu3p",
            "score": 1,
            "text": "The world's on fire, we're getting out of the deadly days of the pandemic, and y'all worried bout a slap at a circle jerk award show, but heres my take. Slaps are to violence what tickling is to bdsm.\n\nA slap over disrespectful comments that doesn't go any further is a bit of an over reaction, but to me, that's about it. \nHow would you react to a woman slapping a man over disrespectful comments at a club or bar? Is that violence and also deplorable on her part?",
            "title_similarity": "0.8147391",
            "sentiment_compound": -0.9218
        },
        {
            "id": "i2qeqoq",
            "score": 1,
            "text": "It was a slap, Rock didn't press charges, who gives a fuck",
            "title_similarity": "0.5760646",
            "sentiment_compound": -0.27
        },
        {
            "id": "i2qf33v",
            "score": 1,
            "text": "No one cares",
            "title_similarity": "0.20944041",
            "sentiment_compound": -0.569
        },
        {
            "id": "i2qf7xc",
            "score": 1,
            "text": "They shouldn’t and did nothing because it’s great for views and Chris Rock was physically okay afterwards. \n\nThe show has been declining for however long and the fact that “it could be staged or it could be real” is great for views and the show staying in mainstream talking points for a few days/weeks afterwards. Also Chris Rock wasn’t the host.",
            "title_similarity": "0.6087742",
            "sentiment_compound": 0.4031
        },
        {
            "id": "i2qg433",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.13133733"
        },
        {
            "id": "i2qh6h7",
            "score": 1,
            "text": "Why would he when everything was staged/scripted?\n\nDayd later and people are still talking about a show that was bleeding viewers massively.",
            "title_similarity": "0.66283154",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2qhfrr",
            "score": 1,
            "text": "It was fully staged, Chris Rock didn't even stumble when he got hit, he is now trending and selling out tickets and media all over the place. The Oscars are big news again. Will Smith and his family are in the news and trending. Everyone is happy.",
            "title_similarity": "0.47457963",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i2qhqer",
            "score": 1,
            "text": "So you are saying his subsequent actions mean that he did not give the best performance of the year as voted by the academy? He still won the award.",
            "title_similarity": "0.65907526",
            "sentiment_compound": 0.5903
        },
        {
            "id": "i2qiqi4",
            "score": 1,
            "text": "But bro God wants him to love and help people....  /s",
            "title_similarity": "0.18133269",
            "sentiment_compound": 0.9186
        },
        {
            "id": "i2qkwr2",
            "score": 1,
            "text": "What would you propose they do then? Assuming they already picked him you have to be there to accept the award right? and they can’t just choose someone else on the fly. It would be more disruptive then the slap was to say “Will Smith won the Oscar for (whatever it was I don’t actually watch the Oscar’s)” and then have nobody there to get it while his wife just sits there. Now if they kicked him off after that or kicked him out until he got his award then sure totally agree.\n\nAlso totally agree with everything else you said if he lost then they should have just made him leave",
            "title_similarity": "0.82504016",
            "sentiment_compound": 0.9521
        },
        {
            "id": "i2ql3az",
            "score": 1,
            "text": "Info: is the issue that he interrupted the oscars or that he slapped someone?\n\nBecause plenty of actors have assaulted (or killed) people and have received awards\n\nThe only difference is that the assault happened during the oscars",
            "title_similarity": "0.8141667",
            "sentiment_compound": -0.8979
        },
        {
            "id": "i2qm4g5",
            "score": 1,
            "text": "It was all a show and no one cares about the billionaires having a tiff when we're suffering to try to make more than minimum wage while the cost of living goes up.",
            "title_similarity": "0.6681129",
            "sentiment_compound": -0.777
        },
        {
            "id": "i2qmbn4",
            "score": 1,
            "text": "Given the Oscars is a vanity show full out of touch dickheads, it seems perfectly suitable that people are going around acting like dickheads",
            "title_similarity": "0.7366512",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i2qmf7b",
            "score": 1,
            "text": "I actually can't argue against you, I can only agree.",
            "title_similarity": "0.24961865",
            "sentiment_compound": 0.5478
        },
        {
            "id": "i2qn4qt",
            "score": 1,
            "text": "I honestly believe this was a publicity stunt because no one knew the oscars was even going on before the meme of him pussywhippin Chris Rock came out.",
            "title_similarity": "0.7956328",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i2qo2u7",
            "score": 3,
            "text": "No. People need to grow up and realize that sometimes you just have to let the thing pass. Rock took it like a champ after he roasted Jada for not being able to grow hair and Will maybe overreacted a bit. I say maybe because I have zero clue what it’s like to be on live TV and suddenly hear my wife or any loved one get ripped for a medical condition. \n\nThis is really not a big deal. It was just a slap. Not even a particularly horrific slap. Ejecting Smith would have been a crazy escalation.",
            "title_similarity": "0.85823894",
            "sentiment_compound": 0.5698
        },
        {
            "id": "i2qoghe",
            "score": 1,
            "text": "The whole thing is a show for entertainment. The ratings after the slap were huge simply because people were waiting for him to get on stage. Had he been ejected they would have lost the ratings bump.\n\nThey don't care about anything but people watching, and this made people watch.",
            "title_similarity": "0.7679771",
            "sentiment_compound": 0.0992
        },
        {
            "id": "i2qpkjm",
            "score": 1,
            "text": "And this is why I think it was fake. \n\nEither, we've solidified in context that as long as you're popular and rich you can do whatever you want. \n\nOr\n\nIt was faked.",
            "title_similarity": "0.44617048",
            "sentiment_compound": 0.5574
        },
        {
            "id": "i2qqbwd",
            "score": 1,
            "text": "well it's because it was staged. literally an awards show for pretending",
            "title_similarity": "0.4861708",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i2qrsw0",
            "score": 1,
            "text": "He should have been allowed to stay because the Oscars are simply a commercial enterprise aimed at making money for people in the industry.  His act of violence has become a viral topic and is of much greater value to the industry then anything any of the actors has ever done.  In a time when people aren’t going to movies in the numbers they once did and most people have no idea who is even up for an Oscar, Smith’s juvenile behavior has people talking about the Oscars long past it’s  “Use by date”.",
            "title_similarity": "0.7151972",
            "sentiment_compound": -0.3947
        },
        {
            "id": "i2qsq4f",
            "score": 2,
            "text": "You keep talking and he'll slap you next.",
            "title_similarity": "0.496262",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i2qupvt",
            "score": 1,
            "text": "Facts,NGL.",
            "title_similarity": "-0.13365567",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2qz4oe",
            "score": 1,
            "text": "I don't really get the argument. What he did was pretty sound to me. Someone angers your wife, and she is rightfully angry, slapping him is a sensible course of action. The joke was pretty bad, especially given her medical condition. Will smith's reaction was rightful.",
            "title_similarity": "0.747431",
            "sentiment_compound": -0.6444
        },
        {
            "id": "i2r13zc",
            "score": 1,
            "text": "This was a staged interaction with both Will's and Chris' consent, so no assault took place.",
            "title_similarity": "0.37271333",
            "sentiment_compound": 0.6825
        },
        {
            "id": "i2r1hk6",
            "score": 1,
            "text": "It’s 100% a fake ploy to get ratings and attention.\nAnd it worked.",
            "title_similarity": "0.3995874",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i2r2lev",
            "score": 1,
            "text": "Agreed. This whole thing is very petty but the reality is many people grew up with WS and it's like the final blows to American society solidifying the decay of humility. WS is supposed to be old school cool, a classic. Makes me shake my head with disappointment and embarrassment.",
            "title_similarity": "0.6650038",
            "sentiment_compound": -0.827
        },
        {
            "id": "i2r3hwd",
            "score": 1,
            "text": "Little late but ima give a backhand attempt at this, for the Oscar's they must've loved this whole exchange. It's what drives ratings. The fact that Will got up there again and gave some weird rambling acceptance speech drives ratings up even further. So from the Oscar's perspective no they shouldn't have kicked Will Smith out. Maybe if Will had punched Chris that would've been different and I agree they should've escorted him out then but for a open handed slap nah. Mess with the bull get the horns.",
            "title_similarity": "0.8098625",
            "sentiment_compound": 0.7783
        },
        {
            "id": "i2r3ty3",
            "score": 1,
            "text": "If you agree the Oscars crowd is very left, then letting him accept the award is ideologically consistent. The left believes physical violence is an acceptable response to offensive speech.",
            "title_similarity": "0.64879334",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2r430k",
            "score": 1,
            "text": "I'm not saying Chris Rock deserved to be slapped but he is a comedian that often says a lot of offensive things. Here are some examples:\n\n[https://www.youtube.com/watch?v=il1sgQUtYs8](https://www.youtube.com/watch?v=il1sgQUtYs8)\n\n[https://www.youtube.com/watch?v=f3PJF0YE-x4](https://www.youtube.com/watch?v=f3PJF0YE-x4)\n\n[https://www.mirror.co.uk/3am/celebrity-news/chris-rocks-most-controversial-jokes-26571850](https://www.mirror.co.uk/3am/celebrity-news/chris-rocks-most-controversial-jokes-26571850)\n\nhttps://www.youtube.com/watch?v=NVwQ2KPwugE&t=177s\n\nWill Smith is far from the only person who has serious beef with Chris Rock. Many people wished they could slap Chris Rock like Will Smith did and Chris Rock is probably aware of that. The Academy Awards did the right thing by not escalating the issue and have the two men settle it.",
            "title_similarity": "0.63524765",
            "sentiment_compound": 0.8426
        },
        {
            "id": "i2r76cs",
            "score": 1,
            "text": "He got an Oscar?",
            "title_similarity": "0.2769041",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2r7e8m",
            "score": 1,
            "text": "At least she let him watch after",
            "title_similarity": "0.09132036",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2r9766",
            "score": 1,
            "text": "This has been covered as nauseum. Yes you’re right in theory, however that is a big move and the reality is that the academy has stated they just didn’t have enough time to get together and discuss it before his award. That is real life.",
            "title_similarity": "0.6767883",
            "sentiment_compound": 0.7351
        },
        {
            "id": "i2rbdq4",
            "score": 1,
            "text": "I think you're making this view with the advantage of hindsight. Certainly the most moral response may have been for the Academy to eject Smith and disallow him from accepting his Oscar, but that's a lot harder of a response to carry out when you have an hour of the show left and have other things to worry about. Not to mention the manner it occurred was fairly quick and Chris Rock effectively carried on after the situation. I think many people were confused on if what they were seeing was a joke or not, even between the two personally.\n\nWould we expect for situation to happen, then immediately the show is stopped or everyone overseeing the show just somehow comes together to collectively meet and vote on what to do in the situation? Within an hour, while the show is still going? The whole show had been planned out likely for weeks/months prior and the winners had already been set in stone along with the associated clips/introductions for them. You're talking about immediately deciding to add ANOTHER wrench into the show by improvising around kicking someone out, and still trying to grasp what the hell just happened, why it happened, and if it were grounds to kick Smith out.\n\nEven the internet seemed to have a first reaction of focusing on the chaos of the slap rather than the morality of Smith in the situation. We were all wondering why it happened. Now that we know why and can view Smith's uneven mental state in full, it's a lot easier for all of us to stand on higher ground.",
            "title_similarity": "0.8552937",
            "sentiment_compound": -0.5514
        },
        {
            "id": "i2rcbvr",
            "score": 3,
            "text": "Like others, I share your opinion, but I think the important thing is consistency with past practices in similar or worse circumstances.  As far as I’m aware, the only comparable thing that previously occurred at an Oscars’ presentation occurred in 1973, when John Wayne tried to rush the stage to attack a woman.  They didn’t kick him out and they didn’t strip him of the Best Actor award he won three years prior for *True Grit*, nor did they expel Clint Eastwood or a bunch of other people who mocked or jeered her.\n\nMaybe times have changed and the reaction should have changed with it, but at least they were consistent.  As far as we know, Rock didn’t ask or insist upon his removal, and we have pretty clear signals from the Academy that there will be long term consequences after appropriate legal and institutional requirements and procedures are followed.  That’s the more important result.",
            "title_similarity": "0.78134084",
            "sentiment_compound": 0.9814
        },
        {
            "id": "i2rd4ik",
            "score": 1,
            "text": "I'm 99% sure it was staged, so why should he have been removed?\n\nOr is this post under the assumption that it isn't staged?",
            "title_similarity": "0.5626788",
            "sentiment_compound": 0.3939
        },
        {
            "id": "i2rg4od",
            "score": 1,
            "text": "OP: How do you feel about Adrien Brody forcibly kissing Halle Berry on stage?",
            "title_similarity": "0.55141276",
            "sentiment_compound": 0.5719
        },
        {
            "id": "i2rj2lw",
            "score": 2,
            "text": "You want to get fired for trying to kick him out??",
            "title_similarity": "0.68628705",
            "sentiment_compound": -0.5661
        },
        {
            "id": "i2rqyth",
            "score": 2,
            "text": "I think there were two thought processes in the moment: \n\n1. It would look bad for the Academy if their Best Actor winner did not appear on stage, even if everyone saw and understood why he was removed.\n2. It would deny Smith the opportunity, if he won, to apologize publicly in the moment, with 20 minutes hopefully being enough time to reflect on how this behavior was wrong.\n\nThere is the possibility that after the slap, someone from the Academy took the Best Actor envelope and made a decision based on the name inside. Had he not won Best Actor, it wouldn't have mattered as much that he wouldn't have been on stage for a potential Best Picture win (with 2 other producers and the director onstage) and they would have removed him from the show.\n\nEdit: [The Academy asked him to leave and he refused.](https://apnews.com/article/oscars-will-smith-entertainment-arts-and-entertainment-51713817b2f8aaf9c2ea5f06bcf234c1?utm_source=Twitter&utm_medium=AP&utm_campaign=SocialFlow) This renders my comment moot.",
            "title_similarity": "0.8091817",
            "sentiment_compound": 0.9504
        },
        {
            "id": "i2rwrai",
            "score": 3,
            "text": "not trying to CYV, but I agree whole-heartedly. his ability to use the platform to appeal to the public as a means to self-excuse his actions with their permission is gaslighting.\n\n&#x200B;\n\nif someone slapped me like that, I'd want to press charges. but I'm sure Chris Rock knew it was an unwinnable situation, especially after so many seemed to forgive Smith on Rock's behalf. Fast forward to Smith partying later, still not having apologized to Rock. No remorse on his part. And I don't care how much of a victim he is of JDP's shit. His actions are still his responsibilities.\n\nAnd furthermore, he not only owes Rock an apology, he owes Rock an apology in front of the entire world. The apology for the offense should be presented at the same level as the offense.\n\nFuck Will Smith. I was pretty much just indifferent to him. But I now have negative respect for him.",
            "title_similarity": "0.8289056",
            "sentiment_compound": -0.3847
        },
        {
            "id": "i2rxumr",
            "score": 1,
            "text": "Crazy how everyone is raging at Will Smith slapping Chris Rock (two friends of 30+ years) but when Woody Allen wins an oscar or some other pedophile does well no one cares",
            "title_similarity": "0.8087875",
            "sentiment_compound": 0.4642
        },
        {
            "id": "i2ry160",
            "score": 2,
            "text": "Yes. F will smith",
            "title_similarity": "0.035988048",
            "sentiment_compound": 0.4019
        },
        {
            "id": "i2s1h94",
            "score": 2,
            "text": "I think the biggest challenge to this being what happened is the lack of precedent. Sporting events have pretty clear rules regarding these things, from 5 minutes for fighting in hockey to ejection for throwing a lunch even if it doesn't land, in basketball. The reality is that the Oscars weren't prepared for this and therefore didn't have a process for it. If you are saying \"people who disrupt (yell, go on stage... choose whatever line you want to draw) the Oscars are kicked out\", I think that is a completely reasonable rule to have in place. To say that it should have been in place without any expectation that it was a rule that is needed, just seems like blame for not knowing he future.",
            "title_similarity": "0.72478557",
            "sentiment_compound": 0.2579
        },
        {
            "id": "i2s46j7",
            "score": 1,
            "text": "CMV: You live a sad life being this enveloped in celebrity drama.",
            "title_similarity": "0.513361",
            "sentiment_compound": -0.4767
        },
        {
            "id": "i2s5hrs",
            "score": 1,
            "text": "Let. It. Go. Wdygaf?",
            "title_similarity": "0.20690933",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2s5tfm",
            "score": 2,
            "text": "I just heard on the radio that someone from the theater (not sure who) approached him during the commercial break and asked him to leave, but he apparently declined and they didn’t push it.\n\nIt was a teaser headline on WGN in Chicago. I didn’t hear the entire story.",
            "title_similarity": "0.6559502",
            "sentiment_compound": -0.4733
        },
        {
            "id": "i2s647d",
            "score": 2,
            "text": "They tried to get him to leave but he refused. It seems like the academy just thought that having him arrested would only blow the whole thing up more than it already was so they made a calculated decision to let it go. \n\nSometimes doing the morally correct thing creates so many unintended consequences that doing nothing becomes the option that causes the least amount of harm. It sucks but if he was arrested Will Smith could have come off as a victim instead of the asshole that he really is. This way, in the court of public opinion he’s still the bad guy.",
            "title_similarity": "0.82571554",
            "sentiment_compound": -0.9709
        },
        {
            "id": "i2s6o4j",
            "score": 1,
            "text": "I could maybe agree with this if the Oscar’s weren’t already a self masturbatory dog and pony show so like disgrace would imply I respect the Oscar’s in the first place",
            "title_similarity": "0.6206857",
            "sentiment_compound": 0.6556
        },
        {
            "id": "i2s83xk",
            "score": 1,
            "text": "It was obviously scripted. Camera caught the whole walk up, rock leans in, mic positioning to receive slap etc Oscars is a joke.",
            "title_similarity": "0.7185782",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i2senjn",
            "score": 1,
            "text": "While I wouldn’t disagree with this view, I’m going to pose to you this possibility: \n\nIt was staged.",
            "title_similarity": "0.3243898",
            "sentiment_compound": -0.3818
        },
        {
            "id": "i2shqk8",
            "score": 2,
            "text": "i saw on CNN that he was politely asked to leave. he said no. look they tried!",
            "title_similarity": "0.6267326",
            "sentiment_compound": -0.126
        },
        {
            "id": "i2slvbb",
            "score": 2,
            "text": "CMV: it's the same as everyone else's.",
            "title_similarity": "0.026704831",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2smthe",
            "score": 1,
            "text": "yes applaud will for doing the right thing not the politically not correct thing thats how it is say something about my wife u will be beat down in the heat of passion from the streets u will respect and mr rock conceded to his wish",
            "title_similarity": "0.6761457",
            "sentiment_compound": 0.926
        },
        {
            "id": "i2so8ai",
            "score": 1,
            "text": "Neither position is valid in my opinion. Much like life itself, it's the nuance that makes the difference.\nThey should have done something between. Maybe hold his award pending review, then he doesn't get to stand in glory after his transgression.\nHe did act, he acted well, and won the award, it should not be stripped for a personal transgression perhaps.",
            "title_similarity": "0.6819112",
            "sentiment_compound": 0.9571
        },
        {
            "id": "i2sp2fz",
            "score": 1,
            "text": "its ratings man",
            "title_similarity": "0.13868767",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2sp2sl",
            "score": 1,
            "text": "Agreed.",
            "title_similarity": "-0.20336838",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i2sqxd9",
            "score": 2,
            "text": "I partially agree with you. Will Smith should have been punished, because that wasn't the best way to handle the situation. But if he got punished, Chris Rock needed to be as well. It's been pointed out that Chris and Will have been friends a long time. Chris has also done a documentary on the importance of natural hair in the Black community, especially for the women. Jada has an autoimmune disease that made her lose her hair. So she lost an important part of herself in both the hair loss and when discovering her disability. Chris knew this. Yet he still made that joke (which was out of the blue anyways). The analogy I've been using is, as a white person if I were to make a joke about a racial minority at the expense of that minority I would be a racist and in the wrong. I would deserve to be punished. So why is it ok for an able bodied person to make a joke about a disabled person at the expense of their disability? Being ableist shouldn't be defended. Someone publicly standing up for a disabled love one against a public ableist is the best response. Will Smith just shouldn't have been physical. He should have gotten up there and called him out for his ableist bs. Out of the 2 actions, I think Will is the more morally correct one. So if he was punished Chris needs to be too.",
            "title_similarity": "0.7066097",
            "sentiment_compound": 0.5185
        },
        {
            "id": "i2t0n1e",
            "score": 1,
            "text": "Talk shit get hit",
            "title_similarity": "0.35099232",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i2t3hfv",
            "score": 1,
            "text": "The fact that you think this wasn't a completly scripted event by this point is absurd, none of it was real.",
            "title_similarity": "0.39829528",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2t4ymw",
            "score": 1,
            "text": "Come on man. The whole fucking thing was staged af",
            "title_similarity": "0.4955915",
            "sentiment_compound": 0.0
        },
        {
            "id": "i2t6e1b",
            "score": 1,
            "text": "I’m relieved that he did something about that joke. Disability and chronic illness jokes actively hurt people, and able-bodied people hardly ever stand up for less-abled people, which is why disability rights weren’t guaranteed under federal law until the 1990’s. I would have slapped Chris Rock and I am glad that someone did. At least his viewpoint was challenged and he has an opportunity to consider if other people were hurt by his joke at Jada’s expense, and what that says about him.",
            "title_similarity": "0.7319617",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i2t7pqk",
            "score": 1,
            "text": "This is kind of a conspiracy but it also challenges you, I think? Anyways, whole thing was a stunt for the Oscars to get some attention, Will and Chris collaborating on it beforehand.",
            "title_similarity": "0.6789185",
            "sentiment_compound": -0.1901
        },
        {
            "id": "i2t9h6c",
            "score": 1,
            "text": "I don’t really disagree with you, but the Academy claims they did ask him to leave and he refused. The optics of physically dragging him out, and dragging a black man out, would be a mess. I still think they should have done it, but his defiance made it a difficult choice.",
            "title_similarity": "0.78917605",
            "sentiment_compound": -0.8897
        },
        {
            "id": "i2t9i8i",
            "score": 1,
            "text": "Will Smith want to smacks Chris Rock,but he can't!https://youtu.be/45fBAGskAog",
            "title_similarity": "0.6982695",
            "sentiment_compound": 0.1511
        },
        {
            "id": "i2td2pt",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.13133733"
        },
        {
            "id": "i2tf5w2",
            "score": 1,
            "text": "I disagree with you, I personally feel like will did What he was supposed to do as a partner In the situation of his wife being made fun of for a disease she has that Already reduces her confidence And that she has stated publicly is a source spot for her\nAlso there was a good chance based on how quickly Chris rock tells jokes That will smith was laughing at the previous joke And not the 1 made at his wife's expense. \nJust like I am fine with somebody going up and punching a Just like I am fine with somebody going up and punching her racist in the middle of the Oscars, If somebody is bullying another person That is less famous and has less social clout than them, They deserve a swift slap (In fairness a punch would be acceptable too), As the saying goes talk shit get hit.\n And lastly his actions at the Oscars have no bearing on the quality of his acting in the film, Just like we don't remove JK's Best seller title even after all of the horrible things she has said",
            "title_similarity": "0.82215697",
            "sentiment_compound": 0.8415
        },
        {
            "id": "i2tg7ru",
            "score": 1,
            "text": "The Oscar’s wanted this kind of drama. They’ve been trying for years to spice up the ceremony and get more attention and here it was. Some even think it’s staged. They’ve had more views and memes made about this years Oscars than ever before, so sadly for Chris Rock, that slap went down in Oscars history.",
            "title_similarity": "0.7468558",
            "sentiment_compound": -0.4618
        },
        {
            "id": "i2tie57",
            "score": 1,
            "text": "Where and how justice and outrage is acted upon is just as important as what justice is enacted. People still see Polanski, Allen, Gibson, Crowe, Bowie and many more examples as heroes or at least respected authorities on film. Where's the global effort to deplatform them for objectively worse actions?\n\nThe problem with the mob going after Smith is that the violence he committed is completely eclipsed by the response. There are people arguing his actions should have him thrown in jail or see 7 figure fines. Is that what a man slapping another man (and intentionally not doing physical lasting harm or starting a brawl) for repetitively publically mocking his wife's medical condition, but people who actively perpetrate far more lasting violences are given much less attention.\n\nPeople in places of privilege cannot hold the oppressed accountable without inherently resorting to suppression of said minority group. The people who are suffering most out of all of this are black women with alopecia. They're the ones getting the brunt of this debate and they're the voices we're hearing the least from.\n\nPlus it's not as if physically defending your wife's honour isn't massively culturally implanted in men. The amount of movies and tv shows (and news stories) applauding men for standing up for women through physical violence is astounding. We teach people that you beat the bad guys with a nice cathartic slap throughout our culture but when a black dude does is everyone feels the need to broadcast their own personal opinion as if it matters at all. Jim Carrey hasn't gone on TV to talk about how [insert pretty much any historical white violence in Hollywood] is deplorable and the perpetrator should be in prison, but he chose to use his energy and his platform to speak about Smith.\n\nThe way the media frames a slap as thuggish brutality as the height of human moral offence, but shares 'both sides' when a kid brings a gun to a rally in a city it's all \"Hey now, calm down and let's debate\". One's a hell of a lot more violent. US police have killed on avg as of posting 3 people a day this year alone. But all this energy and time and focus deserves to be on Will \"I've made it clear before to stop harrassing me and my family to you Chris\" Smith? No.\n\nWhat he did was stupid and rash and yeah pretty ethically debatable. But just because we can talk about it doesn't mean it deserves the energy and attention it is receiving. Especially when Chris Rock immediately said he wasn't pressing charges, and Smith immediately apologised. It's between them. It happened in public, so we all saw it, but it's still between them.",
            "title_similarity": "0.77109313",
            "sentiment_compound": -0.9766
        },
        {
            "id": "i2tk2v4",
            "score": 2,
            "text": "Kevin T Porter said on Twitter he wrote this skit and that it was planned. So can someone explain to me why I’m seeing everywhere posts like this? Even like, the Oscar’s saying it’s possible they’re taking back his award. If it was a skit, why is everyone acting like it’s real and why is he getting repercussions from this?",
            "title_similarity": "0.7041534",
            "sentiment_compound": 0.885
        },
        {
            "id": "i2tmkv4",
            "score": 1,
            "text": "I don't think the SLAP was a big deal.\n\n Obviously we care about it BC it was celebs doing it but most people only care BC it's celebs, not BC of the actual fact of the matter.\n\nEG if an uncle slapped your dad at a party, it may be a big thing but they could talk it out before the nights over. \n\nBut BC it's celebs we have to talk about how baldness is a disease that shouldn't be talked about or how a black man clapping another black man is the representation that we need.",
            "title_similarity": "0.8105065",
            "sentiment_compound": 0.8751
        },
        {
            "id": "i2tmxvo",
            "score": 1,
            "text": "Wow what a unique perspective",
            "title_similarity": "-0.0839499",
            "sentiment_compound": 0.5859
        },
        {
            "id": "i2ueytl",
            "score": 1,
            "text": "Money. Greed. Confusion.",
            "title_similarity": "0.2545161",
            "sentiment_compound": -0.5994
        },
        {
            "id": "i2ut1ay",
            "score": 1,
            "text": "Will Smith was told by the Academy to leave but he refused. It's in today's news.",
            "title_similarity": "0.7169025",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i2uurbf",
            "score": 1,
            "text": "When your dumb ass figures out the difference between a bar and a restaurant, let us know.",
            "title_similarity": "0.5824141",
            "sentiment_compound": -0.7783
        },
        {
            "id": "i2veza1",
            "score": 1,
            "text": "I 100% agree",
            "title_similarity": "-0.017251685",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i2wf6r9",
            "score": 1,
            "text": "Yes!  WOW! F him, her and the elitist who applauded him .I am sick.  I am nobody thom",
            "title_similarity": "0.5606434",
            "sentiment_compound": 0.7916
        },
        {
            "id": "i2yin3y",
            "score": 1,
            "text": "I don’t think it was scripted, but I think will’s actions were more calculated than rational.  If he had just gone into a rampage and started throwing punches at Chris, surely he would have been arrested and kicked out.  But a single slap is small enough for him to get away with.  Chris would look petty if he filed charges against him when he clearly was able to finish hosing without missing a beat.  Chris could have stopped right there and called for security and refused to continue until his assaulted was dealt with, but he barely acknowledged it.\n\nAnd as others have said, this could have been a scripted stunt on many different levels.  It could have been orchestrated from the top but security wasn’t told to make sure it didn’t leak, or it could have been a stunt between will and Chris as part of his speech and joke that they didn’t run past anyone.  But since Chris instantly carried on and will sat back down, it wouldn’t make sense for security to turn it into a scene.  It is security’s job to keep the peace, not to enforce a rigid set of laws indiscriminately.  If Chris wanted protection, all he had to do was say the word.",
            "title_similarity": "0.7520852",
            "sentiment_compound": 0.8759
        },
        {
            "id": "i2zsebp",
            "score": 1,
            "text": "Personaly, i think he should have got the oscars, but he should never be invited back. What he did doesn't make him a bad actor, but he should get consequences.",
            "title_similarity": "0.77386427",
            "sentiment_compound": -0.6956
        },
        {
            "id": "i33kcob",
            "score": 1,
            "text": "i personally agree but I do think reasonable people could say that it's better to carry on, not disrupt the carefully planned event.\n\nif you don't have him come up it throws off the carefully planned event schedule, the lighting cues, the music planned and so on.  so it would be a symbolic gesture (arguably an important one) that would create a lot of havoc for the ordinary workers who have to run the thing, and risks a mistake that makes someone look bad on what might be a major resume-building event for a stage worker or behind-the-scenes tech.",
            "title_similarity": "0.7209186",
            "sentiment_compound": -0.8659
        },
        {
            "id": "i45dvyt",
            "score": 1,
            "text": "I thought they did ask him to leave but Will refused.",
            "title_similarity": "0.5188452",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i4bginc",
            "score": 1,
            "text": "I think he SHOULD be charged with assault, the clear-cut evidence and rashness of his behavior should absolutely be met with consequences. He's a popular guy. No one should be given a chance to see what he did and believe it's okay for them to do it too. \n\nI think the main reason he wasn't removed was because people watching, staff included, didn't think it was anything other than a stunt at the time. I mean, he's will smith. He's not known to be a loose cannon.",
            "title_similarity": "0.7649684",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i4nok2k",
            "score": 1,
            "text": "Waaa waaaa",
            "title_similarity": "-0.08736849",
            "sentiment_compound": 0.0
        },
        {
            "id": "i4rncg4",
            "score": 1,
            "text": "Lets just say if a regular citizen did that to the celebrity, their life would be over.",
            "title_similarity": "0.633613",
            "sentiment_compound": 0.0
        },
        {
            "id": "i50ycd8",
            "score": 1,
            "text": "Jokes: the only thing that protects a person from verbal abuse. SMH\n\nFor example: Having to say “it’s just a joke” is the biggest cop out ever. Just admit you hurt someone and move on.",
            "title_similarity": "0.7039229",
            "sentiment_compound": -0.7603
        },
        {
            "id": "i5wuwx0",
            "score": 1,
            "text": "I agree with you. Merely because of the interviews out there where he spreads this false message of propaganda that he believes violence isn't the answer.\n\nAs a true beliver of if your not strong enough to fight with words, your not strong enough to fight with your fists.\n\nHe also took away from the fact only the 3rd time since the oscars has been a thing a WOMEN won the best director, he spoiled the night for others and should be banned and have is Oscar taken away for his disgusting behaviour.\n\nMay I also add, I'm not on chris rocks side, they are both in the wrong",
            "title_similarity": "0.8721304",
            "sentiment_compound": -0.9002
        },
        {
            "id": "i62n67l",
            "score": 1,
            "text": "I think it was staged to take peoples minds off other more important shady world events. Let that sink in for a bit and maybe it will change your mind.",
            "title_similarity": "0.53892887",
            "sentiment_compound": 0.2716
        },
        {
            "id": "i68fn8r",
            "score": 1,
            "text": "I think it was also so unexpected. It got everybody off guard many thought it was an act at first.",
            "title_similarity": "0.5646975",
            "sentiment_compound": 0.0
        }
    ]
}