{
    "CMV: circumcision of children (without medical reason) should be outright illegal\nImma start this off by saying that in cases where the foreskin needs to be removed for medical reasons, obviously it should still be an option, if the doctor sees it as appropriate. \n\nWhat I'm talking about here is circumcision for religious or cultural reasons, or circumcision in order to prevent any problems that may happen in the future. \n\nFirstly, religious reasons. In cases where a man is circumcised for religious purposes, it should be left until the man is at the age of medical consent (in my country 16). Doing it to a child who can't consent, and who may not even decide to follow your religion is wrong, and should be seen in the same way that fgm is seen.\n\nSecondly, for hygiene reasons. One of the biggest arguments I've seen on here for circumcision is that an intact penis is more susceptible to infections. If the child is taught to clean it properly, then there really won't be any problems. I've had a foreskin my whole life, and I've never had any problems with genital hygiene, it's really not complicated. Of course, a penis that is not cleaned properly is susceptible to infection, but that goes for intact and circumcised penises. \n\nFrankly, unnecessarily removing someone's body parts for any reason is barbaric, and it should be seen as such": [
        {
            "id": "i4vtd7q",
            "score": 1,
            "text": "This post has been **temporarily locked** due to excessive comment rule violations.  The OP **has not necessarily broken any of our posting rules**.\r\n\r\nIf a post gets cross-posted in another sub, this can lead to an influx of rule breaking comments.  We are a small team of moderators, so this can easily overwhelm our ability to remove rule violations.  When this occurs, we must occasionally _temporarily_ lock the post so we can remove the violations before discussion can be restored.\r\n\r\nWe are actively cleaning up the thread now, and will unlock it shortly.  We will try and do this quickly so discussion can continue though the amount of time will vary based on moderator availability.\r\n\r\nThank you for understanding.",
            "title_similarity": "0.6383477",
            "sentiment_compound": 0.2066
        },
        {
            "id": "i42eae5",
            "score": -1,
            "text": "For Jews it is literally a contract from god, an intrinsic part of our religion and our faith, to perform this surgery. To deny it to a jew would be making a life decision for them in and of itself; it would deny them the ability to be a part of our people intrinsically. There is no blank slate you can make a child be where they have no influence from the outside world. They will have an influence whether you like it or not. From a Jewish persons perspective, understand how it is important for us to have our kids, and ourselves, be a part of our community immediately. \n\nI think the medical objections to it are rare (non Jews in the US have it done all the time) and the moral questions from it I think are answered by its relative harmlessness and its importance to us as a people.",
            "title_similarity": "0.72203475",
            "sentiment_compound": 0.6808
        },
        {
            "id": "i426uga",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.251587"
        },
        {
            "id": "i426ojy",
            "score": -20,
            "text": "But the infant doesn’t remember it\n\nAnd you can stop replying to this because I just watched a baby be circumcised on YouTube. I am not supporting circumcision after watching that.",
            "title_similarity": "0.6496236",
            "sentiment_compound": -0.7104
        },
        {
            "id": "i42nbmo",
            "score": 17,
            "text": "[removed]",
            "title_similarity": "0.25131163"
        },
        {
            "id": "i42qsxg",
            "score": 239,
            "text": "This shit again?! God damn enough. I LOVE my circumcised cock",
            "title_similarity": "0.38135633",
            "sentiment_compound": 0.1091
        },
        {
            "id": "i42xllp",
            "score": -28,
            "text": "Regardless of hygiene,[ studies have shown that females prefer circumcised penises overall](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6523040/), so if you value your son's potential chance at finding a suitable partner, you would go ahead with the procedure.",
            "title_similarity": "0.61304724",
            "sentiment_compound": 0.5667
        },
        {
            "id": "i42lend",
            "score": -6,
            "text": "You should actually read about the medical benefits of circumcision \n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC3684945/",
            "title_similarity": "0.5164887",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i426bdn",
            "score": -13,
            "text": "Have you ever tried washing poop put of an infant's uncircumcised foreskin?",
            "title_similarity": "0.5560461",
            "sentiment_compound": 0.0
        },
        {
            "id": "i43bzg8",
            "score": -2,
            "text": "Let me quote Jim Jeffries when he did a Netflix special in London:\n\n“The reason I got my son circumcised is so that when he is older… women will want to fuck him!”\n\nSeriously, hooded dicks are fucking nasty.\n\nBut sure, everything is a kink these days, maybe someone out there is into a dick with smegma in its folds.\n\nOpinions aside, foreskins cause more [UTIs](https://www.firstpediatriccare.com/blog/how-utis-can-become-chronic-if-your-child-isnt-circumcised#:~:text=Why%20is%20an%20uncircumcised%20penis,if%20they're%20not%20circumcised). Think about it: bacteria love places that are damp (foreskins can cause pee, semen and sweat to get stuck in them), dark (in the folds), warm (in between the legs), and have a food source (salt from sweat and protein and sugars from semen). You can wash it yeah but you don’t have to worry about any of that without a foreskin. \n\nAssuming every guy with a foreskin washes it regularly to not have it be a health issue (big if), there’s also a benefit to other people for circumcising. A baby’s foreskin [can](https://edition.cnn.com/2009/HEALTH/11/02/growing.skin/index.html#:~:text=In%20some%20cases%2C%20we%20can,out%20of%20one%20baby%20foreskin.&text=%22In%20some%20cases%2C%20we%20can,at%20Temple%20University%2C%20in%20Philadelphia) be stretched out to the area of up to four (American) football fields in some cases. *That’s over seven fucking acres of skin.* Think about all of the skin grafts that can be used by that.\n\nI rest my case.",
            "title_similarity": "0.6679325",
            "sentiment_compound": 0.6947
        },
        {
            "id": "i42kh21",
            "score": -37,
            "text": "[deleted]",
            "title_similarity": "0.251587"
        },
        {
            "id": "i4258c5",
            "score": 97,
            "text": "> it should be left until the man is at the age of medical consent\n\nSomething worth considering is that it is major surgery to do it on a 16 year old. It is painful and risky. Doing it on an infant where they won’t remember it and where it will heal much better is why they do it at that age. I know this doesn’t justify the practice outright but your suggestion that everyone wait until they’re 16 is not smart. \n\n> but that goes for intact and circumcised penises.\n\nThat’s not true. It is not 6 one way, half a dozen the other. On the one hand you have a circumcised man who doesn’t have to do anything to avoid problems. On the other you have an uncircumcised man who has to judiciously wash to avoid problems. \n\nYes they can achieve the same result but there’s something to be said about the disparity between inputs.",
            "title_similarity": "0.71330774",
            "sentiment_compound": -0.7926
        },
        {
            "id": "i42uctc",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.25158697"
        },
        {
            "id": "i42lhdi",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.25131163"
        },
        {
            "id": "i439kpk",
            "score": 6,
            "text": "Anyone here who is arguing FOR mutilation of children's genitals should be ashamed of themselves and reevaluate their views. You are literally on the side of cutting baby's genitals. No if and or buts about it. Justify it as you like, it's genital mutilation.",
            "title_similarity": "0.8181497",
            "sentiment_compound": -0.743
        },
        {
            "id": "i42fcys",
            "score": 1511,
            "text": "I’m circumcised. Here’s my stance:\n\n1. I have suffered no emotional or psychological damage because of it\n\n2. I have a fully functioning penis\n\n3. I have never in my life had to worry about smegma\n\n4. I do not care at all that a decision was made without my consent. I was a baby. Babies and children can’t consent.\n\nI think your reasoning is valid and totally fine. I also think circumcision is valid and totally fine. Both sides of the argument take extreme outlying cases to justify their positions when in reality I don’t think it’s worth the energy. It’s not a big deal at all one way or the other.",
            "title_similarity": "0.58554757",
            "sentiment_compound": -0.8152
        },
        {
            "id": "i42z5kb",
            "score": 10,
            "text": "I got my kid circumcised, Pretty chill procedure ngl he cried for 1 minute. I was against it at first but \n\nI am also circumcised and I have no negative effects from it. \n\n\nThe people who make a big deal about it I feel like are teenagers/people in their early 20s with zero actual experience with babies and circumcisions.\n\n It's really not that big a deal and from talking to my friends who aren't circumcised and one who didn't get their kid circumcised i''d say I made the right move.",
            "title_similarity": "0.588227",
            "sentiment_compound": 0.9135
        },
        {
            "id": "i42xj5o",
            "score": 2,
            "text": "I’m so happy my parents had me circumcised.",
            "title_similarity": "0.33900815",
            "sentiment_compound": 0.6115
        },
        {
            "id": "i42snql",
            "score": -5,
            "text": "Oh God another one.",
            "title_similarity": "0.090017974",
            "sentiment_compound": 0.2732
        },
        {
            "id": "i43y96g",
            "score": 0,
            "text": "Prior ER Nurse here. I’ve seen a handful of uncircumcised 90 year old dicks. None of them had proper care- either totally dirty or the foreskin got SO tight there was no way to pull it down over the head of the penis. So catheters were just a guess. It was convincing enough for me to be pro circ.",
            "title_similarity": "0.5561787",
            "sentiment_compound": 0.1298
        },
        {
            "id": "i44bzgp",
            "score": 0,
            "text": "No, it’s the parents choice and that is it…. Now I will say as a woman I don’t like uncut guys I just find it unclean.",
            "title_similarity": "0.6586549",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i42kq8p",
            "score": 28,
            "text": "I’m uncircumcised and I’m now having repercussions. My phallus is twisted, idk if it’s because of that though. \nAlso, my girl is a scared of going down on me in case it might smell or be slimy/sticky from pre cum. I shower everyday and apply liquid ball deodorant. \n\nMy girl also says she can’t do everything she likes to do when she goes down on someone because I’m so sensitive that what she likes doing actually hurts me\n\nI am now trying out permanent retraction and keeping my foreskin pulled back at all times. It hurt  at first from being extra sensitive to anything touching it. I am now getting used to the rubbing and clothing to the point that I’m enjoying it. \n\nMy head has began to dry up as well. I started applying coconut oil to prevent it from drying up like a plum seed. \n\nMy phallus now practically never stinks. It might still smell a tiny bit though. \n\nIt’s been a process. \n\nMight even get circumcised in the future, even though I don’t really want to. \n\nIf I have kids I don’t want them circumcised but I do want them to practice permanent retraction. My girl wants them circumcised. I want them to be able to make that decision on their own when they’re older.",
            "title_similarity": "0.5931838",
            "sentiment_compound": 0.5671
        },
        {
            "id": "i42dwsu",
            "score": -5,
            "text": "Why does it even matter? In the US at least, it is the social norm. I have never met someone who complained that they were circumcised. Being circumcised has no real meaning in society, unless you hold certain religious beliefs. It's not like you are changing the baby's gender, removing an organ or a limb. It's literally just a little bit of skin that. What drawbacks are there, other than \"the baby didn't consent\"? It makes it a easier for parents to clean the baby, children can be stubborn and won't always listen when you tell them to clean. You are avoiding possible problems in the future. The minor pros outweigh the minor cons. It may be minor, but it is a quality of life improvement for most people.",
            "title_similarity": "0.7441908",
            "sentiment_compound": 0.4257
        },
        {
            "id": "i42e51d",
            "score": -3,
            "text": "I like to push mine inside out and watch it bloom like a lil flower real fast. If we are worried about foreskin then the world is doomed. Peace and love brothers. Get a foreskin addition if it's really bothering you or maybe a lil winky size turtle neck. Other than that focus on saving the world, not private parts ;}",
            "title_similarity": "0.6195073",
            "sentiment_compound": 0.5279
        },
        {
            "id": "i431jnp",
            "score": -4,
            "text": "If we make circumcising babies illegal, then should we make body piercing illegal?\nWhat else will become illegal until the person can be of age to give consent? Religion? Gender? Eating veggies? lol",
            "title_similarity": "0.8270848",
            "sentiment_compound": -0.8426
        },
        {
            "id": "i42vj4b",
            "score": -4,
            "text": "I made the decision my son would be circumcised after my 88 yr old grandfather had to be circumcised because his foreskin kept growing together making him unable to pee and giving him bladder infections. My son was circumcised with a plastic clip that fell off on its own, no stitches required. My grandfather had to be hospitalized for 3 days and have a surgical procedure. Yes my story is anecdotal, but it’s why I did it.",
            "title_similarity": "0.63384485",
            "sentiment_compound": 0.3182
        },
        {
            "id": "i42bvlm",
            "score": -3,
            "text": "I was circumcised, do I regret not having the choice to get it done, no. \nI didn't have it done to my son solely for the reason being that my wife and I didn't want to deal with the healing, the crying and fussyness on top of being new parents.\nIt is easy to clean under foreskin, but why even be an issue at all when it's not there! You don't miss it, you don't need it. This kind of thing should really not even be on your mind at all.",
            "title_similarity": "0.71478784",
            "sentiment_compound": 0.2725
        },
        {
            "id": "i42r4v0",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i42tjxg",
            "score": 5,
            "text": "I just skimmed 2 medical research blogs on this topic and I’m still in favor of my parents making that decision for me. Fuck the flap, no offense",
            "title_similarity": "0.49964365",
            "sentiment_compound": -0.0155
        },
        {
            "id": "i42rp4d",
            "score": -7,
            "text": "Because an uncircumcised penis looks disgusting.",
            "title_similarity": "0.5575999",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i42x6dv",
            "score": 4,
            "text": "There's nothing wrong with circumcision as long as its done by medical professionals with the right tools which is exactly why it shouldn't be made illegal. If it was, people who are untrained/not medical professionals would end up doing it without sterile tools or would do it with the wrong tools increasing the risk. The only outcome of making it illegal would be increasing underground circumcisions resulting in higher rates of diseases related to improper medical practise",
            "title_similarity": "0.72397447",
            "sentiment_compound": -0.5142
        },
        {
            "id": "i42m80x",
            "score": 3,
            "text": "Some families have UTI concerns they don't even know about because they have been circumsized generationally. My mom took a risk with me and had to circumcise me when I was 4. My father had to do the same as well when he was 8. \n\nThere is a reason this practice is recommended even in a religious context, religion is not just a belief but a way of life. The ancient Greece and Romans had significant issues with UTIs. \n\nAs much as we as a society believe things will never change, things can change, and access to running water will change our outlook on male and female UTI practices including circumcision.",
            "title_similarity": "0.67226255",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i434q90",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i434s0p",
            "score": 0,
            "text": "There are more reasons to need a circumcision at a later age than hygiene (or medical problems cause by a lack of which). In those cases people need the operation at an age they remember the experience, feel the pain... \nI remember reading an AMA by a random dude whose foreskin was to tight had to do the operation and discribed the experience as traumatic, to give you just one (maybe extreme) example.\nThis would have been prevented tho if he had been circumcised at a young age.\nSeeing there are no mayor (mayor being a key word) drawbacks from being circumcised, I don’t see why its a problem",
            "title_similarity": "0.7480169",
            "sentiment_compound": -0.9413
        },
        {
            "id": "i439j9b",
            "score": 0,
            "text": "If I have kids, they will be circumcised. Regardless of all the reason you “shouldn’t” be circumcised, there is still a stigma regarding uncircumcised dicks. Is it a stupid stigma based on bullshit? Do the majority of people not care at all? Ofcourse. But more people are “grossed” out by uncircumcised penises than are grossed out by circumcised penises… (In the US anyway)",
            "title_similarity": "0.6933012",
            "sentiment_compound": -0.7487
        },
        {
            "id": "i43ee57",
            "score": 0,
            "text": "My dick is more photogenic.",
            "title_similarity": "0.24855596",
            "sentiment_compound": -0.5106
        },
        {
            "id": "i43gkmy",
            "score": 0,
            "text": "I'm glad my parents didn't ask me and did it. My brothers had to be removed in his teens due to infection... Glad my parents loved me enough to help me dodge that bullet",
            "title_similarity": "0.6226628",
            "sentiment_compound": 0.9118
        },
        {
            "id": "i43rh2p",
            "score": 0,
            "text": "That would be unconstitutional in the US. Congress shall pass no law establishing religion not prohibiting the free exercise of religion.\n\nYou would essentially be outlawing Judaism.",
            "title_similarity": "0.7461602",
            "sentiment_compound": -0.5996
        },
        {
            "id": "i44e6nk",
            "score": 0,
            "text": "Why post a CMV if you’re simply unwilling to change your view? \n\nYou have your opinion. Others have theirs. If you yourself have no valid reason as to why it’s unhealthy, then stop worrying about other people’s dicks and find something else to be so concerned over.",
            "title_similarity": "0.74993205",
            "sentiment_compound": -0.8481
        },
        {
            "id": "i45c0y8",
            "score": 0,
            "text": "I disagree. I’d rather not deal with the pain of the healing process as an older man, I’d rather have it over & done with as a child.",
            "title_similarity": "0.7516582",
            "sentiment_compound": -0.7096
        },
        {
            "id": "i42ji42",
            "score": -3,
            "text": "In the locker room everyone but one guy was circumcised. They made fun of him for it. He handled it well as he found the jokes funny too.",
            "title_similarity": "0.4250102",
            "sentiment_compound": 0.9253
        },
        {
            "id": "i42zagh",
            "score": -3,
            "text": ">in cases where the foreskin needs to be removed for medical reasons, obviously it should still be an option, if the doctor sees it as appropriate.\n\n“The doctor”?  The US health-care system has its problems, but I am pretty sure there is more than one doctor in the US.\n\n>circumcision in order to prevent any problems that may happen in the future.\n\nMost medical procedures are performed to prevent problems that may happen in the future.\n\nI am not being pedantic here.  I am actually setting you up for an epically brutal Change of View...\n\nIf a substantial number of *doctors* — actual medical doctors not EdDs or something — agree that the health benefits of newborn male circumcision outweigh the risks, then your view would change?\n\nYou aren’t going to reject the science, are you?\n\n> Evaluation of current evidence indicates that the health benefits of newborn male circumcision outweigh the risks; furthermore, the benefits of newborn male circumcision justify access to this procedure for families who choose it. Specific benefits from male circumcision were identified for the prevention of urinary tract infections, acquisition of HIV, transmission of some sexually transmitted infections, and penile cancer. Male circumcision does not appear to adversely affect penile sexual function/sensitivity or sexual satisfaction.\n\nThat is from the [American Academy of Pediatrics](https://publications.aap.org/pediatrics/article/130/3/e756/30225/Male-Circumcision).\n\n[Yeah, science!](https://youtu.be/Dbt-OfbQTpw?t=29)",
            "title_similarity": "0.7602192",
            "sentiment_compound": 0.7423
        },
        {
            "id": "i43szqu",
            "score": -2,
            "text": "Thanks to circumcision I can fuck longer and more forcefully because I’m not oversensitive and don’t have to worry about tearing my frenulum. My penis also stays dry and doesn’t ever sit in a disgusting hot tub of sweat, pre-cum, or pee drip. \n\n10/10 decision by my parents, I’d be pissed if they had cared more about consent than making the advantageous choice for me.",
            "title_similarity": "0.63376546",
            "sentiment_compound": -0.683
        },
        {
            "id": "i42z1bw",
            "score": 0,
            "text": "The American Academy of pediatrics have a position statement that says based on data from 1995-2010 the benefits from circumcision include decreased risk of UTIs in the first year of life and decreased risk of transmission of HIV and STIs in the heterosexual male later in life. While they do not recommend routine circumcision they do believe the data supports the decision to circumcise if the family chooses to. I believe families should have a choice in the matter. I don’t think you or the government should choose whether a family decides to circumcise or not.",
            "title_similarity": "0.72864795",
            "sentiment_compound": -0.0284
        },
        {
            "id": "i43ud60",
            "score": -1,
            "text": "Growing up in America, and more specifically in a junior high locker room in America, we had two uncircumcised dudes. One got the nickname Death Star, and one got the cut when he was in high school. Rumor had it he couldn’t move for a week. \n\nEither way, I’m grateful my parents didn’t wait around until I was 16 to get my thoughts on circumcision.",
            "title_similarity": "0.47906142",
            "sentiment_compound": -0.3182
        },
        {
            "id": "i45lly9",
            "score": 1,
            "text": "I cant stand the \"Im circumcised and I'm fine\" crowd\n\nWe get it, you didn't have any lasting consequences from your child abuse.\n\nDoesn't mean that the practice isn't child abuse and should continue. Nobody gives a fuck how strong you are, we give a fuck about stopping child abuse, which all forms of circumcision, inherently, is.\n\nIt sickens me there's even a discussion to be had here, this is straight up not a matter of perspective, and pro-circumcision folks should be treated like anti vaxxers and flat earthers - ignored completely.",
            "title_similarity": "0.79238737",
            "sentiment_compound": -0.9154
        },
        {
            "id": "i430i6d",
            "score": 93,
            "text": "I wouldn't put male circumcision in the same legal prevention camp as female circumcision for the following reasons:\n\nMale circumcision prevents against certain health conditions, which female circumcision does not. According to studies, circumcision reduces the risk of the following conditions:\n\nurinary tract infections\n\nCarrying or transmitting to their partner certain sexually transmitted infections\n\n Penile cancer and a lower risk of cervical cancer in female sex partners\n\nBalanitis (inflammation of the glans) and balanoposthitis (inflammation of the glans and foreskin)\n\nphimosis (the inability to retract the foreskin) and paraphimosis (the inability to return the foreskin to its original location)\n\n\nMultiple studies/analysis have debunked the myth that circumcision reduces sexual pleasure or sensitivity and they have looked at all sorts of things ranging from ease to arousal, ease to finish, self-reported enjoyment of sex, etc. Female circumcision on the other hand does reduce the capacity for pleasure and enjoyment during sex.\n\n\nThe cultural intent and context around female circumcision is more psychologically harmful. Female circumcision is born out of purity culture or the idea that a woman's worth as a person is defined by her sexual inexperience, whether that be inexperience with multiple partners or inexperience with sexual pleasure. The less she has experienced sexual pleasure, the more value she has. Women are still taught today in many circles including western cultures that their sexual organs exist to please a man rather than to please themselves. Female circumcision physically embodies this principle by ensuring that only a man can take pleasure out of sex with their vagina, rather than them getting to take part in the pleasure or reserving some amount of pleasure for themselves.\n\nThere isn't the same cultural context for men. While some cultures did consider circumcision as a testament to purity as well, others practiced it mainly for health reasons and unlike with women there is a lot of overlap between the religious practice and the physical health benefits. While some men do grow up in circles where they're told that both men and women should remain pure until marriage, they are rarely ever taught that they don't deserve to experience sexual pleasure during the marriage. You would be hard pressed to find a circumcized man who believes that their penis's only purpose is to serve a woman's pleasure and not their own, but this is absolutely the impact of female circumcision on the female psyche and it is extremely harmful for both individual women and their relationships. There is no evidence that circumcized men have less fulfilling or less healthy relationships or sex lives as a result of their circumcision.\n\nSo if you want to claim that no type of medical procedure should be performed on any babies that alters their physiology, that's one thing, but I disagree with the implication that male circumcision constitutes genital mutilation in same way that female circumcision does.",
            "title_similarity": "0.76733565",
            "sentiment_compound": 0.9636
        },
        {
            "id": "i42khsd",
            "score": 122,
            "text": "So your first statement basically claims that parents should not make decisions for their children that they cannot consent to. So should kids not have braces? How far does this “parents shouldn’t make decisions for their kids without consent” go? That’s a tough argument and comes down to whether or not young children have the capacity to make their own decisions.\n\nSo the hygiene argument is a weak one (not yours, the pro circumcision one). Uncircumcised penises have been shown to be less susceptible to infection, but it’s not a clinically relevant result. I agree that children are able to clean themselves, but older adults are not. Have you ever seen a septic elderly gentleman who has a foreskin covered in smegma? It’s rough. \n\nThe “circumcision should be illegal” argument really comes down to why? What are the risks of continuing circumcision? It’s not a risky procedure, great success rates, and a massive study showed that over 95% of sampled men are content with their circumcised penis.",
            "title_similarity": "0.7634626",
            "sentiment_compound": 0.9059
        },
        {
            "id": "i43xy19",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i434r6t",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i43ffvz",
            "score": -1,
            "text": "Sex is better with an uncircumcised penis. I know several women who agree. It took a little “getting past” the difference between that and a circumcised one. But the stigma of uncircumcised is uncalled for. It’s not cleaner and healthier. Men all over the world aren’t having their penises fall off constantly. Bc most of the world is uncircumcised.",
            "title_similarity": "0.5969645",
            "sentiment_compound": 0.2318
        },
        {
            "id": "i43grjl",
            "score": 1,
            "text": "I'd be pissed if I wasn't, no way I'm doing that shit at 16 or something... much prefer none of all the extra skin, no thank you lol.",
            "title_similarity": "0.67083824",
            "sentiment_compound": -0.7369
        },
        {
            "id": "i42lsld",
            "score": 0,
            "text": "INFO What would you want the legal consequences of circumcising your infant to be?",
            "title_similarity": "0.6442332",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i42vbw6",
            "score": 0,
            "text": "I think the clearest reason it is extremely unlikely to be illegalized is that the consensus of the medical community--as represented by the American Academy of Pediatrics and the CDC--is that circumcision is advisable.\n\nIn other words, the major medical associations in the US think that there is--broadly--medical reason.\n\nI don't agree with that advice, and many (the majority in parts of the US) parents choose not follow that advice. But until there is a change in the generally accepted medical position in the US there won't be (and I would argue *shouldn't* be) a legally mandated health practice.",
            "title_similarity": "0.7256299",
            "sentiment_compound": -0.3504
        },
        {
            "id": "i42za0z",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i44x2cf",
            "score": 0,
            "text": "It really doesn’t matter and it isn’t a significant danger to infants. You say you wouldn’t want to have been circumcised without your consent and I’m glad my parents chose to have it done for me. If majority in both camps are happy who cares if it is technically mutilation.  The point being every person born with a penis had the choice made for them and are more than likely happy with the decisions made for them. It really doesn’t matter but im glad it was done as a baby where either way ill never remember it.",
            "title_similarity": "0.6532269",
            "sentiment_compound": 0.7599
        },
        {
            "id": "i43i0m2",
            "score": 5,
            "text": "Medically circumcised guy here. I had to get it when I was young, like 4-5.\n\nI have literally zero fucks to give about it. To me, it's one big nothingburger. I was a child, and parents do things for their children all the time.",
            "title_similarity": "0.40941626",
            "sentiment_compound": -0.1531
        },
        {
            "id": "i430b3p",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i42l4y4",
            "score": -4,
            "text": "Glad my parents had it done!Head out eye open! Not turtle neck pulled over.",
            "title_similarity": "0.4446458",
            "sentiment_compound": 0.555
        },
        {
            "id": "i43x3sv",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.251587"
        },
        {
            "id": "i43xzg5",
            "score": -4,
            "text": "Uncircumcised penises are fucking revolting looking. I'm circumcised, and every single woman I've been with has complimented and told me they vastly prefer it.\nIt's cleaner. It's more attractive. There is a lesser chance of contracting STIs.\nWhy the fuck aren't we all circumcising all our boys?",
            "title_similarity": "0.55778563",
            "sentiment_compound": 0.6361
        },
        {
            "id": "i42lmkn",
            "score": 6,
            "text": "I don't think it should be illegal. There are cases of parents brining in their kids with infections of their penis because they were never taught properly how to clean themselves with their foreskins present. I haven't had that issue with any male, younger or older with a circumcised penis.  \n\n\nI feel that it doesn't need to be illegal due to some families not educating the kids to clean themselves and see this as a way to make it easier. Especially as a baby and they wet themselves until they learn to use the bathroom. There hasn't been long lasting harm of circumcised penises, and those who have gotten it have lived alongside everyone else. Being able to have kids, masturbate and have sex. It would have been made illegal if males had no sensation, which is why it's not illegal today.  \n\nI've worked in plenty of nursing homes, hospitals, pediatric units, ICU units, etc. \n\n\nMost patients that were uncircumcised that I've  had recently were older gentleman that did not clean themselves as much as the should have, and being a younger female it's very awkward trying to push back the foreskin to clean underneath. Especially when they're aware and cannot help me push their foreskin back to clean it. There are plenty of cases where those who do clean the foreskin do NOT put it back into place, causing a restricted blood flow to their penis. \n\nThen there are the older males who turn it into a sexual thing while I'm just trying to keep themselves cleaner and not have an infection grow there.",
            "title_similarity": "0.67074317",
            "sentiment_compound": -0.6793
        },
        {
            "id": "i44bihb",
            "score": 11,
            "text": "There are generally 4 medical rationales given for circumcision:  \n\n\n1. Prevention of HIV\n2. Prevention of HPV\n3. Avoidance of phimosis (I am an uncircumcised man who had this!)\n4. Prevention of UTIs in boys under 3\n\nLet's talk about these individually:  \n**#1, HIV** is the most legitimate one. There's strong evidence that for heterosexual men in areas where HIV is very prevalent risk of contracting HIV is decreased significantly, about 1.8%. Studies here were done in subsaharan africa, where access to contraception is significantly lower. There is no evidence that this same risk mitigation factor applies in developed countries.  \n**#2 Prevention of HPV** \\- There's no evidence that it prevents HPV, however it can very slightly help with clearing the virus https://en.wikipedia.org/wiki/Circumcision#cite\\_note-larke\\_HPV\\_2011-15  \n**#3 Avoidance of phimosis** \\- I'm part of the <0.5% of uncircumcised men who had this problem, and I was in the extreme enough case that I had to have surgery. Basically, my foreskin wasn't sufficiently separated from the head of my penis and when I went through puberty my penis outgrew my foreskin. I had a frenulotomy at 14 years old, a low-risk, out-patient surgery, and in a week the problem was gone. *I do not wish I was circumcised. The risks of circumcision greatly outweigh those of these less invasive procedures.* Imo, getting a circumcision to avoid a highly unlikely problem like this is like removing baby's appendices at birth so they never get appendicitis-- they probably won't get it, and we can deal with it if they do!\n\n**#4 Prevention of UTIs -** It's true, some studies showed a significant reduction in UTIs of boys under 3. However, when studying only infants for whom a high quality of diaper hygiene was administered, the difference in outcomes were no longer statistically significant. IMO, it's fucked up to cut off an important part of your baby's body instead of just cleaning it properly. \n\n&#x200B;\n\nBasically, I don't think circumcisions should be illegal; as you see above there are *some* medical justifications for them and I believe parents should be allowed to make medical decisions for their child based on their own research and if they find any of the above compelling, it's their right.\n\nHowever, I think that physicians have an ethical responsibility to STOP RECOMMENDING THEM. Most of the rationale for circumcision has been completely debunked, and I personally don't find ***any*** of the reasons above (which are all true!) to be compelling justifications for the surgery.\n\n&#x200B;\n\n*Circumcision is proven to reduce penile sensation which can increase risk of sexual dysfunction*. As an uncircumcised man, the head of my penis is extremely sensitive, to the point where having my foreskin retracted in underpants would be uncomfortable (though not intolerable). My understanding is that this the standard uncircumcised experience.  I can't imagine having my exposed penis head against underwear all day. Sensitivity during sex seems like a terrible thing to take away from someone you love for no reason, in my opinion. \n\nhttps://www.researchgate.net/publication/322056383\\_Adding\\_Insult\\_to\\_Injury\\_Acquisition\\_of\\_Erectile\\_Dysfunction\\_from\\_Circumcision",
            "title_similarity": "0.59150875",
            "sentiment_compound": -0.9657
        },
        {
            "id": "i42e59w",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i42xvvn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i43d2rx",
            "score": 1,
            "text": "It is genital mutilation. It was done to me. It should not be available without adult consent to the procedure. It makes for some hilarious  conversations though especially in public. I like to ask “hey Mom, Do you ever think _I should have left my son’s foreskin alone_?”  Questions of that nature seem confrontational yet at some point my parents were all “Fq yeah, cut that off!”",
            "title_similarity": "0.7566319",
            "sentiment_compound": 0.3239
        },
        {
            "id": "i43k6ea",
            "score": 1,
            "text": "Two years ago, i had to be circumcised for medical reason, total’y agree with you, was really better not to be circumcised and totally regret it",
            "title_similarity": "0.7864859",
            "sentiment_compound": 0.3818
        },
        {
            "id": "i43zefn",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.251587"
        },
        {
            "id": "i430mn7",
            "score": 22,
            "text": "one thing i'll say is that its nowhere near as damaging, life-changing, and potentially harmful as fgm. male circumcision is basically just cutting some skin. with fgm youre cutting off a big part of the organ, and significantly reducing the pleasure receptors available. the chance for infection and other unwanted effects is much higher. imagine youre cutting off one testicle, or the tip of your penis.",
            "title_similarity": "0.6801033",
            "sentiment_compound": 0.6126
        },
        {
            "id": "i42gspt",
            "score": -11,
            "text": "One time back in 8th grade, I was at a buddies house where all my friends hung out and partied. He brought a girl over and eventually took her to a room to get a blowjob. 5 min later she came screaming out the room, what the fuck is wrong with his dick?!? Grabbed her bag and dipped out. Everyone was tripping and he came out so upset and told us he was uncircumcised. Fucked him up for life lol. That ladies and gentlemen is why we get it done. Save your son from having a weird dick",
            "title_similarity": "0.44117168",
            "sentiment_compound": -0.9373
        },
        {
            "id": "i435agd",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i42b5i4",
            "score": 51,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i42mt4i",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i4313yv",
            "score": -1,
            "text": "My parents circumcised me when I was a baby, and I am eternally grateful.",
            "title_similarity": "0.33342993",
            "sentiment_compound": 0.4588
        },
        {
            "id": "i432o7i",
            "score": -2,
            "text": "If this is going to be changed in the US at all, Democrats will likely be the ones passing the legislation. They'd also offend a large part of their voter base that is circumcised by telling them that something is wrong with their genitals (which honestly would be hard to swallow for anyone). I'd rather they invest their political capital in more important issues than this, and I don't think there'll ever come a point where this is an issue worth losing voters over.",
            "title_similarity": "0.6847992",
            "sentiment_compound": -0.3197
        },
        {
            "id": "i43vaxl",
            "score": -3,
            "text": "Am circumcised. Easy to clean. Don’t rememeber it happening. I’m pretty happy they clipped my schnitzel.",
            "title_similarity": "0.41445318",
            "sentiment_compound": 0.91
        },
        {
            "id": "i447l7l",
            "score": -2,
            "text": "Speaking as a circumcised Jew: this argument is a gateway to all the other arguments propping up anti-Semitic fantasies. It is a short walk from “they cut off their kids’ foreskins” to “they control the world’s banking systems and so they should all be killed.” So: you are stirring dangerous waters.",
            "title_similarity": "0.65034777",
            "sentiment_compound": -0.8682
        },
        {
            "id": "i44oiik",
            "score": 1,
            "text": "I have had long term relationships with both cut and uncut men. To say that you have a fully functioning circumcised penis is (at no fault of your own) a Little inaccurate.  You only think it's fully functional because you haven't ever been witness to the sexual function of the foreskin.\n\n\n\n It brings sex to another level. There are so many nerve endings in the foreskin that have been completely removed from equation. Not to mention how many oral maneuvers that are just not possible without foreskin.\n\n\n\n\nThe sensitivity you lack was stolen from you. The only reason you don't miss it is that it was taken before you were aware of its existence.  I am on the side of mutilation due to the fact that my current sex life is so much more fulfilling for both parties with him intact.",
            "title_similarity": "0.5920863",
            "sentiment_compound": -0.1022
        },
        {
            "id": "i451y77",
            "score": 3,
            "text": "I was circumcised as a baby and I'm very thankfuk for it! And all the girls I've been with were thankful for it too.",
            "title_similarity": "0.21826243",
            "sentiment_compound": 0.6114
        },
        {
            "id": "i43hxsu",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i42uwvn",
            "score": 14,
            "text": "My husband and I are Christian. I think people at our church tend to get their boys circumcised but I thought that was Old Testament so I don’t really understand the reason for it. My friends who did get their boys circumcised said that it was really horrible hearing the baby cry like that!\n\nMy husband is uncircumcised and he’s never had an infection because of it because like you said, he keeps it clean. He also said it makes sex more enjoyable so there’s that too.\n\nWe chose not to get our baby boy circumcised and we were never pressured into it. I’m glad we didn’t have to see him in that kind of pain.\n\nI guess I kind of agree that people shouldn’t be able to circumcise their babies. But if you have to get one for medical reasons later in life it apparently hurts way more and you’re old enough to remember the pain.",
            "title_similarity": "0.7070991",
            "sentiment_compound": 0.4141
        },
        {
            "id": "i42b8wy",
            "score": 206,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i42gfxf",
            "score": 853,
            "text": "I want to start by saying that I am very anti-circumcision and think it is a very outdated practice. It IS genital mutilation. Full stop. Anyone who says otherwise is kidding themselves. \n\nThat being said I think making the practice illegal would be extremely problematic and would not end in the outcome you’re looking for. Circumcision has been practiced by the Jewish community for thousands of years and is an extremely important, symbolic religious practice. Millions of people are safely circumcised around the globe each year. If you made the practice illegal it would simply lead to back alley circumcisions that would endanger the child. People are not going to give up their religious identity so easily. \n\nI think a much better approach if you want to reduce bodily harm to babies is to have public campaigns in the US to change the culture around circumcising your kid. Doctors almost always assume a baby is going to be circumcised. Most parents barely give it any thought and just say “well, I had it this way and I turned out alright. Might as well have it done to my kid”. The problem is that we as a society are so afraid to talk about the issue since it involves genitalia. The silence around the topic makes people more likely to just go with what was done to them without giving it too much thought. They assume it was done to them or their partner for a good reason and follow suit.\n\nThe key to ending this cycle isn’t to make the practice illegal, it is to talk about it openly and change peoples minds. Talk about it with your friends. Explain to them why it’s wrong and harmful. Make them think about it and they will probably struggle to justify why they are mutilating their child’s genitals unless they have a religious reason for doing so. Dispel the myths that it is safer, more hygienic, or just that uncircumcised penises are “abnormal” or “weird”. \n\nOutright illegality is not the solution you think it is. It’s a cultural issue that needs a cultural solution NOT a legal one",
            "title_similarity": "0.7001761",
            "sentiment_compound": -0.686
        },
        {
            "id": "i45ew47",
            "score": -3,
            "text": "✅ i love my clean circumcized cock\n\n✅ so do the women ive been with \n\n✅ ive had no problems with weird yeasty infections or guck buildup\n\n✅ i dont have to meticulously wash it every time i jog\n\n✅ i dont have mental trauma or hangups linked to that event\n\ncircumcize your children. give them a better dick",
            "title_similarity": "0.51242816",
            "sentiment_compound": 0.8312
        },
        {
            "id": "i45zbi3",
            "score": 3,
            "text": "As a circumcised male, I have to disagree. The risk of potential harm is very low if the circumcision is performed correctly. It prevents multiple issues without creating more. It makes proper cleaning and hygene much easier.\n\nI also know that if I were uncircumcised I would be very uncomfortable with the idea of it, but I certainly do not remember it happening while I was a baby, nor do I suffer any trauma from it.\n\nAs we have seen, there are a great many people who do not adhere to proper hygene. This means such problems would become very commonplace.\n\nUltimately the procedure is relatively minor and prevents potential problems without a serious risk of equal or worse problems.\n\nI mean, if we're going to ban these, there are other, far more risky, and far more invasive, medical procedures that would have to be banned until the age of majority.",
            "title_similarity": "0.67711604",
            "sentiment_compound": -0.9645
        },
        {
            "id": "i42fl30",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i42h3ki",
            "score": 7,
            "text": "/u/bagforlifefullofbees (OP) has awarded 1 delta(s) in this post.\n\nAll comments that earned deltas (from OP or other users) are listed [here](/r/DeltaLog/comments/tzzr45/deltas_awarded_in_cmv_circumcision_of_children/), in /r/DeltaLog.\n\nPlease note that a change of view doesn't necessarily mean a reversal, or that the conversation has ended.\n\n^[Delta System Explained](https://www.reddit.com/r/changemyview/wiki/deltasystem) ^| ^[Deltaboards](https://www.reddit.com/r/changemyview/wiki/deltaboards)",
            "title_similarity": "0.46437457",
            "sentiment_compound": 0.6124
        },
        {
            "id": "i422tva",
            "score": 0,
            "text": "**Note:** Your thread has **not** been removed.\nYour post's topic seems to be fairly common on this subreddit. Similar posts can be found through our [wiki page](http://www.reddit.com/r/changemyview/wiki/mensrights#link) or via the [search function](http://www.reddit.com/r/changemyview/search?q=circumcision&amp;amp;restrict_sr=on).\n\nRegards, the mods of /r/changemyview.  \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/changemyview) if you have any questions or concerns.*",
            "title_similarity": "0.36164132",
            "sentiment_compound": 0.3939
        },
        {
            "id": "i42p02f",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i436v1g",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i43oyfp",
            "score": 0,
            "text": "Agreed. Barbaric is both too strong a description perhaps but also quite fitting. Sort of like a minor surgery on a child who had no say in the matter and now it cannot be undone. How many actually care that it was done to them as a baby, I don’t know. But, I focus more on the point that you’re making. I would think any grown man probably would not want that to be done to him now. It would be much more memorable, I’m sure..not in a good way. That’s the point. It’s not pleasant and it’s not chosen. \n\n☝🏻IMO👌🏻",
            "title_similarity": "0.7238719",
            "sentiment_compound": 0.9462
        },
        {
            "id": "i43x3ru",
            "score": 0,
            "text": "Just curious, do you also believe trans people would have to wait until the age of medical consent for any treatment?",
            "title_similarity": "0.68365055",
            "sentiment_compound": 0.4939
        },
        {
            "id": "i442i5i",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i442oeh",
            "score": 0,
            "text": "\"Anong illegal illegal? Tanginamo supot\" - Taguro",
            "title_similarity": "0.52096874",
            "sentiment_compound": -0.802
        },
        {
            "id": "i4430rb",
            "score": 4,
            "text": "My own personal opinion, have had issues with my foreskin lately and I wish I was circumcised as a child. I plan to have my kids get it to potentially avoid going through my problems.",
            "title_similarity": "0.71679246",
            "sentiment_compound": -0.296
        },
        {
            "id": "i44qfvn",
            "score": 0,
            "text": "ulol supot ka lang",
            "title_similarity": "0.08270819",
            "sentiment_compound": 0.0
        },
        {
            "id": "i45b7z9",
            "score": 0,
            "text": "Op, would you also be against cutting the filliopian tube for that matter?",
            "title_similarity": "0.6604626",
            "sentiment_compound": -0.1027
        },
        {
            "id": "i45f52d",
            "score": 0,
            "text": "Uncut < Cut",
            "title_similarity": "0.28434113",
            "sentiment_compound": -0.2732
        },
        {
            "id": "i45j5rg",
            "score": 0,
            "text": "No one wants to be fucking uncircumcised",
            "title_similarity": "0.573004",
            "sentiment_compound": -0.296
        },
        {
            "id": "i45ji74",
            "score": 0,
            "text": "Circumcision's will reduce your changes of contracting an STD by 50%",
            "title_similarity": "0.36399436",
            "sentiment_compound": 0.0
        },
        {
            "id": "i45qi1e",
            "score": 0,
            "text": "People aren't as hygienic as you think. Trust me.",
            "title_similarity": "0.3743849",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i4692ys",
            "score": 0,
            "text": "Nah it looks better. I'm down for it.",
            "title_similarity": "0.29074568",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i46nrvz",
            "score": 0,
            "text": "I’m circumcised and I don’t care at all. I think if a parent should have the option to abort their child, they should also have the option to circumcise them. Not to mention that it is an integral part of certain religions. \n\nAs for health, there’s really no significant pros or cons to the procedure. I don’t see what’s wrong with giving parents the freedom of what they want to do with their child, even if it’s wrong in your mind.",
            "title_similarity": "0.8233311",
            "sentiment_compound": 0.6622
        },
        {
            "id": "i477cv9",
            "score": 0,
            "text": "One issue that complicates this is that circumcision is much safer on an infant than an adult. Given that circumcision eases hygiene and has no adverse effects if performed correctly, it is a choice parents should have access to.",
            "title_similarity": "0.5851394",
            "sentiment_compound": 0.7359
        },
        {
            "id": "i47b2rb",
            "score": 0,
            "text": "Just get yourself circumcised and stop complaining lol",
            "title_similarity": "0.53944314",
            "sentiment_compound": -0.0516
        },
        {
            "id": "i47inw4",
            "score": 0,
            "text": "My husband was not circumcised as a child. He is a very clean person, but had such terrible itchiness that as an adult that he opted to be circumcized. It solved the problem. \n\nHowever, recovery took weeks and it was very uncomfortable going back to work after a just a couple days. \n\nWhen our son was born, I left the decision up to him. My husband thought it would be better to do it as an infant rather than go through what he did.",
            "title_similarity": "0.64136887",
            "sentiment_compound": -0.6178
        },
        {
            "id": "i4is5pk",
            "score": 0,
            "text": "Infant logic because i was an infant when it happened. Lol I bet getting squeezed out of a vagina hurts like a bitch too so I guess we should all hate our mothers for making us endure that pain without our consent. We didn't ask to be born right?",
            "title_similarity": "0.6760262",
            "sentiment_compound": -0.8825
        },
        {
            "id": "i44qlzv",
            "score": 5,
            "text": "It's genital mutilation....stop",
            "title_similarity": "0.5027902",
            "sentiment_compound": 0.0
        },
        {
            "id": "i42eij8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i430ety",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i43t2hh",
            "score": 1,
            "text": "Many parents are too stupid to clean their infant son’s penis appropriately.",
            "title_similarity": "0.5727514",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i43t7xm",
            "score": 1,
            "text": "Religion",
            "title_similarity": "0.29734206",
            "sentiment_compound": 0.0
        },
        {
            "id": "i44897r",
            "score": 1,
            "text": "There are no medical reasons. Its a religious thing. Its supposed to represent Abrahams covenant with God. Only Jews actually need to do it. Christians are no longer bound by Abrahamic law but still do it as a symbolic thing (some sects dont do it anymore), they aren't required to do it. No idea about Islam though.",
            "title_similarity": "0.68005633",
            "sentiment_compound": -0.5346
        },
        {
            "id": "i44jxyv",
            "score": -1,
            "text": "It’s a slippery slope because what’s next? You force the groups who perform it [to wear a yellow star](https://www.bl.uk/learning/histcitizen/voices/info/yellowstar/theyellowstar.html)?\n\nBut I agree that it has no reason to be for most of the US population, especially when we know that it was originally intended [to prevent boys from masturbating](https://www.circumcisionchoice.com/single-post/kellogg).",
            "title_similarity": "0.7967286",
            "sentiment_compound": 0.2406
        },
        {
            "id": "i44mdhb",
            "score": 1,
            "text": "Im noticing people who have been circumcised argue that it’s fine, or they dont think it matters, cause it turned out fine for them. Meanwhile uncircumcised dudes think your right fucked in the mind for having the tip of your penis lobbed off for no apparent reason. But remove your preconceived notions and one sounds much more fucked up then the other.",
            "title_similarity": "0.7012614",
            "sentiment_compound": -0.8951
        },
        {
            "id": "i44mk8t",
            "score": -1,
            "text": "Another day another circumcision post",
            "title_similarity": "0.318757",
            "sentiment_compound": 0.0
        },
        {
            "id": "i45rro5",
            "score": 1,
            "text": "I really agree with OP, it’s not worth it. If you were circumcised please don’t do it to your kids they won’t gain any added benefit from it. Plus, you won’t have to bother watching your newborn endure such an intense stress at such a formative stage of live. \n\nForeskin:\n+ easier sex\n+ easier masturbation\n+ higher sensitivity\n\n🤝",
            "title_similarity": "0.76861966",
            "sentiment_compound": 0.8892
        },
        {
            "id": "i45s1h6",
            "score": 1,
            "text": "It's mutilation and torture, should be outlawed and illegal in America unless it's a medical requirement. Gtfo with this looks cleaner or religion crap. Inflicting trauma and pain will change that baby's mind forever",
            "title_similarity": "0.8352989",
            "sentiment_compound": -0.9382
        },
        {
            "id": "i45ubot",
            "score": -1,
            "text": "Not arguing if it's right or wrong. But good luck getting paid (in the US) if you're uncircumcised.\n\n I'm cut (,and fine with it) but I have friends who are not and all of them on more than one occasion have been turned down for sex because their partner though their uncircumcised dick looked \"gross\", they were also scared to do things like skinny dipping etc in groups because they were afraid of being seen.\n\n I'd argue that the phycological damage this casued during high school was more damaging than circumsion.\n\nAlso anecdotally the majority of women I know have told me an uncircumcised dick is a turnoff and they wouldn't have sex with that person.\n\nMaybe it's cultural to the US, but it makes you wonder why the majority of males in porn are circumsised, even in non-US made porn?",
            "title_similarity": "0.6257254",
            "sentiment_compound": -0.9493
        },
        {
            "id": "i45vfc9",
            "score": -1,
            "text": "That is a fixation on childrens genital organs, itis not healthy. For millions of years firstborns were murdered and eaten as \"sacrifice\". Then Hebrews and other people like Egyptian started this millimeter wound for a drop of blood - symbolizing that life is dangerous...and it was also felt that cleanliness at that part of the body is essential in that hot weather...and yes, fewr women partners of circumsized men get cancer on the vaginal parts. So it is no bif deal and it is a religious prescription too. It was made illegal under Hitler and Stalin for decades in the Soviet Union but secretly some people did it as no one can be controlled always...\n\nBut it is a favorite hobbyhorse of anti\\_Jewish inciters, so congrats you are in good compny, keep up the good work.",
            "title_similarity": "0.6654296",
            "sentiment_compound": 0.8732
        },
        {
            "id": "i46lsdk",
            "score": -1,
            "text": "Uncircumcised penis’s are gross. That’s all there is to it. I would be very embarrassed if my penis had a skin sleeve over it.",
            "title_similarity": "0.66644263",
            "sentiment_compound": -0.7089
        },
        {
            "id": "i429zzv",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.251587"
        },
        {
            "id": "i436ywk",
            "score": -2,
            "text": "It know kids who had to have it removed at 14 and that hurt.  Why not do it at 0",
            "title_similarity": "0.586511",
            "sentiment_compound": -0.5267
        },
        {
            "id": "i43e6kl",
            "score": -2,
            "text": "Abortion is fine doe 🤷 y’all do you I guess.",
            "title_similarity": "0.40112212",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i43ers6",
            "score": -2,
            "text": "Some guy earlier posted on Reddit that he has constant fungus growing under his foreskin for 10+ years…",
            "title_similarity": "0.26915616",
            "sentiment_compound": 0.1779
        },
        {
            "id": "i43kjx1",
            "score": 2,
            "text": "In Western countries it's already done for medical reasons.",
            "title_similarity": "0.56080794",
            "sentiment_compound": 0.0
        },
        {
            "id": "i43op0y",
            "score": -2,
            "text": "I wish men could correlate the outrage over circumcision with the numerous injustices experienced by women being denied autonomy over their own bodies throughout their entire lives, but that's asking a lot, isn't it. At least there are no laws requiring or prohibiting penile circumcision.",
            "title_similarity": "0.6767888",
            "sentiment_compound": -0.6187
        },
        {
            "id": "i441on6",
            "score": -2,
            "text": "They took my cheese factory :((",
            "title_similarity": "0.3702951",
            "sentiment_compound": 0.0
        },
        {
            "id": "i443zfg",
            "score": 2,
            "text": "There are many countries where males are not circumcised.\n\nIf it's such a great practice, why aren't more countries doing it?\n\nBecause most uncircumcised men would never give it up for anything (I did not use the word \"all\"). There are many reasons why. This tells me it's a ridiculous barbaric practice no matter how you slice it. \n\nIt's silly to make it illegal, regardless.",
            "title_similarity": "0.64590806",
            "sentiment_compound": -0.2439
        },
        {
            "id": "i453qj1",
            "score": 2,
            "text": "Yes true and OBVIOUS. There are no rational arguments FOR cutting off parts of your own baby’s genitalia (with no anesthetic) in their first days of life in this world. I guess complete ignorance of science and ethics, or societal/ religious pressure, are possible reasons one would do this, but not valid ones. Would you slice your baby girls nose off her face with a scalpel as your first act toward your newborn child because everyone else does, or because you were told it will prevent her getting the common cold? This is completely comparable in idiocy and cruelty. Some outlier situations and medical emergencies may exist, but they would be quite uncommon and irrelevant to this debate. How is this even a question? Mutilating a newborn’s genitals comes from either, horrific stupidity or horrific cruelty, both of which are grounds to have your children taken from you. One other consideration is that although rates are dropping significantly, circumcision is and was often recommended by healthcare providers (in the US and Israel specifically). This removes some of the responsibility of the parent, but not all and is wholly tragic, when one realizes the HUGE profit incentive to keep recommending this procedure, or in many cases not even offering a real choice to opt out. Big business profiting from torturing babies. It seems dramatic to say but when all is stripped away, the only motive is money or sick and outdated religious dogma.",
            "title_similarity": "0.76581514",
            "sentiment_compound": -0.9843
        },
        {
            "id": "i45t8u0",
            "score": 2,
            "text": "We all draw a circumcised cock, we all love the esthetics and the hygiene. Whats wrong about that",
            "title_similarity": "0.4590803",
            "sentiment_compound": 0.128
        },
        {
            "id": "i45vqj2",
            "score": 2,
            "text": "I got circumcised and I don’t follow any religion and I’ve never hated my parents or anybody for it",
            "title_similarity": "0.5171562",
            "sentiment_compound": 0.5216
        },
        {
            "id": "i434xza",
            "score": -2,
            "text": "I don’t want a forskin Sir.",
            "title_similarity": "0.46419528",
            "sentiment_compound": 0.0772
        },
        {
            "id": "i43zc3q",
            "score": -4,
            "text": "Specifically your post says not to circumcise in order to avoid problems later. I have a son with effectively one kidney, UTIs pose very little risk in general but can be dangerous if you only have one kidney. Circumcision dramatically reduces the risk of UTI in boys which again is normally not an issue but is if you have one kidney. \n\nEffectively I got him circumcised to avoid problems later. Would you be willing to grant a delta for this example even though in reality it’s “to avoid problems later”?",
            "title_similarity": "0.7093494",
            "sentiment_compound": -0.9252
        },
        {
            "id": "i44nqrr",
            "score": 2,
            "text": "His name was Harvey Kellogg. Seventh Day Adventist that thought the next: \"If you circumcise your child he will masturbate less\". End of story. It ain't natural to be circumsiced.",
            "title_similarity": "0.74887323",
            "sentiment_compound": -0.2755
        },
        {
            "id": "i450pk4",
            "score": 1,
            "text": "Call it what it is MGM. Male genital mutilation. Abolish it.",
            "title_similarity": "0.6293512",
            "sentiment_compound": 0.0
        },
        {
            "id": "i43rp31",
            "score": -8,
            "text": "Bro, uncircumcised dicks are like the most ugly things in existence. If you're circumcised from a baby, your parents did you a huge solid. I couldn't imagine having a worm mole looking dong that I would then have to pay out of my pocket for. ANNDDD a few weeks of recovery.",
            "title_similarity": "0.57900786",
            "sentiment_compound": 0.1045
        },
        {
            "id": "i444umu",
            "score": 7,
            "text": "Can we just talk about how ridiculous it is that people think circumcision is cleaner and will willingly circumcise a baby who then wears a diaper that he shits in with AN OPEN WOUND RIGHT THERE. Like why would you do that.",
            "title_similarity": "0.7069731",
            "sentiment_compound": -0.34
        },
        {
            "id": "i42dwzk",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i42g464",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i4374h8",
            "score": 1,
            "text": "i get what your saying but people who get circumsized later in life get more complications (statistically)",
            "title_similarity": "0.37437665",
            "sentiment_compound": 0.0
        },
        {
            "id": "i437zg0",
            "score": 9,
            "text": "[deleted]",
            "title_similarity": "0.251587"
        },
        {
            "id": "i43fwby",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i43iil6",
            "score": 8,
            "text": "My husband is circumcised, and our son is not. We have never had to do anything special at bath time. Are we missing something? Like he’s getting to the age where he doesn’t really need help anymore at bath time. Is there some secret to proper penis cleaning that we need to teach him before he’s too old? There doesn’t seem to be a difference?",
            "title_similarity": "0.59690034",
            "sentiment_compound": 0.7592
        },
        {
            "id": "i43juxx",
            "score": 1,
            "text": "Unrelated but disgusting question.\n\nI don't know if it's just me but, do all kids have phimosis when they are born up until mid-puberty? Or is the foreskin supposed to be fully retractable from birth?\n\n&#x200B;\n\nI remember for the longest time I could not retract it all the way up until I was like 11. And when I finally did. oh god. 11 years of built of smegma was there.",
            "title_similarity": "0.5303645",
            "sentiment_compound": 0.168
        },
        {
            "id": "i43jwg0",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i43sds6",
            "score": 1,
            "text": "Yup. Also they’ll resent you forever.",
            "title_similarity": "0.42541522",
            "sentiment_compound": -0.1779
        },
        {
            "id": "i441qqw",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.25131157"
        },
        {
            "id": "i444t91",
            "score": 2,
            "text": "There is a surgery to reverse a circumcision. There are many men who get this surgery and also advocate against circumcision. \n\nAlso I dated a guy who's circumcision had been done on the wrong spot and he had a large scar on the side of his dick. There are complications that are rarely mentioned. And there are deaths from circumcision as well. These things need to be considered too.",
            "title_similarity": "0.6375482",
            "sentiment_compound": -0.6486
        },
        {
            "id": "i44bqtg",
            "score": 2,
            "text": "Are we not taking in the massive religious importance!?!? It is a large part of the Jewish/Catholic faith.",
            "title_similarity": "0.42974576",
            "sentiment_compound": 0.7387
        },
        {
            "id": "i44dlgn",
            "score": 2,
            "text": "In my opinion, I think if it is done when you are too young to have any lasting trauma from it, and it has no chance of being detrimental in any way, then it should be allowed. If you had a chance between a 1% chance of cancer or a 0% chance of cancer, and choosing zero would result in a procedure that would remove, say, your appendix and you would be unable to understand or remember the process, you would probably want to pick the zero. In my opinion. However, if you’re old enough to even have a vague memory of it, then it is not worth the possibility of trauma or memorable pain.",
            "title_similarity": "0.7291178",
            "sentiment_compound": -0.9451
        },
        {
            "id": "i44exog",
            "score": 1,
            "text": "Is it your position that a child cannot consent to the procedure?",
            "title_similarity": "0.57615083",
            "sentiment_compound": -0.1695
        },
        {
            "id": "i44gbpt",
            "score": 2,
            "text": "I’m somewhat against it. Neither of my sons are circumcised. That said, my doctor said all her urologist friends wish their patients had been circumcised. When you’re really old and have dementia, it apparently becomes a big issue. Still though, I get where you’re coming from.",
            "title_similarity": "0.63613904",
            "sentiment_compound": 0.7003
        },
        {
            "id": "i44qrzl",
            "score": 3,
            "text": "Didn't circumcise my son.  I am ( at birth ).  He can choose to do it later if he likes.",
            "title_similarity": "0.68277323",
            "sentiment_compound": 0.4215
        },
        {
            "id": "i44wc0j",
            "score": 1,
            "text": "If it makes sex better for women then do it. Relationship issues are paramount. But if it doesn't help sex who gives a duck.",
            "title_similarity": "0.59733665",
            "sentiment_compound": -0.2351
        },
        {
            "id": "i44wmus",
            "score": 3,
            "text": "I'm not a man, but i am a former SW. \n\nUncircumcised men definitely were FAR more likely to have smelly/unclean dicks. Just because uncircumcised men can clean their penises well doesn't mean they do. \n\nMost girls seem to prefer circumcised men and I'm thinking this is the reason. I'm a lesbian so i don't prefer men at all - just commenting on what I saw as a sex worker. And when it came to circumcised men, more often than not they were clean. Uncircumcised men more often than not had enough dick cheese built up to be smelly.",
            "title_similarity": "0.5996929",
            "sentiment_compound": 0.8864
        },
        {
            "id": "i44yo7j",
            "score": 2,
            "text": "There are thousands of important medical decisions that need to be made for children before they even have self awareness",
            "title_similarity": "0.34687623",
            "sentiment_compound": 0.2023
        },
        {
            "id": "i44z6ys",
            "score": 1,
            "text": "I’m just gonna circumcise myself again…",
            "title_similarity": "0.37127447",
            "sentiment_compound": 0.0
        },
        {
            "id": "i453rkp",
            "score": 3,
            "text": "I love my foreskin...",
            "title_similarity": "0.18467642",
            "sentiment_compound": 0.6369
        },
        {
            "id": "i45ancy",
            "score": 13,
            "text": "I feel it's a very american topic because unless it'sfor medical or religious reasons, it's extremly uncommon in Europe.",
            "title_similarity": "0.59687626",
            "sentiment_compound": 0.0
        },
        {
            "id": "i45b7ny",
            "score": 3,
            "text": "lmfao I made a thread about this exact thing, but I was called a Nazi and had my account suspended.",
            "title_similarity": "0.5813124",
            "sentiment_compound": -0.4404
        },
        {
            "id": "i45cm0a",
            "score": 2,
            "text": "I agree with you",
            "title_similarity": "0.007825354",
            "sentiment_compound": 0.3612
        },
        {
            "id": "i45fimz",
            "score": 3,
            "text": "Im a female so I don’t have much opinion on the topic… but \n\nI’m a nurse who has to clean my patients since they are mostly unable to do so. The patients with an uncircumcised penis? 9 out of 10 times they have pus, inability to retract (we have ways to try to force it to retract because we have to clean it), and a lot of other problems that I don’t have with circumcised patients.\n\nJust something I notice.",
            "title_similarity": "0.5556959",
            "sentiment_compound": 0.0
        },
        {
            "id": "i45jmg3",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.25131163"
        },
        {
            "id": "i45lj6y",
            "score": 3,
            "text": "I was 8 years old when I was circumcised. My mom wanted us to make the decision, and of course I wanted to be like my dad. \nA little graphic: I'll never forget, the gauze got stuck to the tip of my penis and my uncle had to hold me down so they could rip it off.",
            "title_similarity": "0.6474236",
            "sentiment_compound": 0.2883
        },
        {
            "id": "i45pupx",
            "score": 2,
            "text": "sounds like someone is being forced by his girlfriend to get circumcised.",
            "title_similarity": "0.47894",
            "sentiment_compound": -0.128
        },
        {
            "id": "i45sruc",
            "score": 2,
            "text": "I am circumcised. I have a big dong. Now I have hair on my dong. Thanks doctors.",
            "title_similarity": "0.31271043",
            "sentiment_compound": 0.4404
        },
        {
            "id": "i45u1wa",
            "score": 5,
            "text": "Buried penis is way more common than you seem to realize. (The skin adheres a bit further than it should at birth and simply needs to be cut back but if it’s not, it restricts the growth and position of the penis.). My wife and I were on the fence about circumcising until the decision quickly became a no brainer. Simple, safe solution or lifelong problems for my son? Yeah, no thanks.",
            "title_similarity": "0.71726143",
            "sentiment_compound": 0.6634
        },
        {
            "id": "i464263",
            "score": 5,
            "text": "We should ban things with the force of law only when there is clear consensus. There is no such consensus on the subject of male circumcision. Even in this thread the majority of men who have had the procedure either don’t mind or believe that it was more beneficial than not.\n\nWhen we pass laws in an absence of consensus, society suffers. Some people will ignore the law, or actively fight against it. Many who do will suffer harm at the hands of the justice system that vastly outweigh the harm you are trying to prevent. Others who obey the law (begrudgingly) will become polarized and radicalized by their opposition. \n\nIn short, were such a law passed today in the US, you would very likely see bizarre coalitions like Q-Anon wackos joining forces with religious Jews and Muslims to oppose it. This would have ramifications far beyond this one issue. I doubt you would like that world better than the one we live in now.",
            "title_similarity": "0.72486436",
            "sentiment_compound": -0.877
        },
        {
            "id": "i466w4w",
            "score": 2,
            "text": "I was circumcised at around age 11 or 12. So i do have the experience of remembering having both a circumcised and uncircumcised penis. Although my parents did suggest it, i never felt forced to do it and i felt that if i had said no, they would have respected my decision. I remember having to change the bandages and needing help because it hurt but it was not excruciating or anything. My young self could handle the pain without needing to yell or cry. I also feel that it has not affected my sensitivity or pleasure in anyways. However, in my opinion, being given the choice of circumcision at a later age was great and I never had to feel resentment if it was decided without me as a baby. Given the choice again, i definetly would still have gotten circumcised but i appreciate having a say in the matter.",
            "title_similarity": "0.68069726",
            "sentiment_compound": 0.8938
        },
        {
            "id": "i46750j",
            "score": 1,
            "text": "And male babies should  have vasectomies with a free coupon to get reversed at age 30",
            "title_similarity": "0.6386636",
            "sentiment_compound": 0.5106
        },
        {
            "id": "i46825r",
            "score": 3,
            "text": "Imo, the only reason this is such a popular argument is because of the religious factor.\n\nNo one gets all upset when someone gets a kid a piercing before age if consent, no one is crusading to allow babies born with 6 fingers keep them all. \n\nI'm circumcised and it has not adversely affected me in any way.\n\nI also had multiple doctors and the hospital my son was born in advise in favor of it. I'm often told on reddit that this is impossible or it is a backwoods hospital... but its a SUNY university hospital, one of the highest ranked in the nation.",
            "title_similarity": "0.65792286",
            "sentiment_compound": 0.1073
        },
        {
            "id": "i468gn1",
            "score": 1,
            "text": "My tonsils and adenoids were removed against my will at an early age to prevent recurring infections",
            "title_similarity": "0.68231416",
            "sentiment_compound": 0.0258
        },
        {
            "id": "i46cqih",
            "score": 3,
            "text": "Comments boil down to: uncircumcised who prefer it because it gives more plesure and circumcised who support it because its all they know. Lol",
            "title_similarity": "0.46803272",
            "sentiment_compound": 0.6705
        },
        {
            "id": "i46ep43",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25131163"
        },
        {
            "id": "i46hxse",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25131163"
        },
        {
            "id": "i46jd5t",
            "score": 1,
            "text": "I think the CDC still recommends circumcision. It is also a cultural norm in the US for people who are middle-class and above. (Immigrants and people that are lower on the socio economic ladder with no health insurance are often not circumcised.)\n\nI am circumcised and don't have any problems with it being done. I also don't have problems with traditions just because they are traditions. Most girls in the US are going to expect it too. I have sons and just recently (a few years ago) watched some kids make fun of another kid for having a 'weird penis' (the kid was not circumcised). They had all just walked out of a locker room where they all changed into their bathing suits.",
            "title_similarity": "0.6022997",
            "sentiment_compound": 0.5597
        },
        {
            "id": "i46k68n",
            "score": 3,
            "text": "So today we've learnt that circumsiced men don't bother wash their d*cks. Eww.\n\nNot surprising considering how many men I see walk out of toilets without ever washing their hands. They don't even glance at the sink, like they don't even do it at home.",
            "title_similarity": "0.43099147",
            "sentiment_compound": 0.4063
        },
        {
            "id": "i46m303",
            "score": 1,
            "text": "As a person who wasn't circumcised because it's not the norm in my country I grew up with phimosis and never related to the porn I watched and had insecurity about my penis because uncircumcised penis without the head popping out doesn't look that majestic.\n\nI wish I was circumcised but I agree that there should be consent and also more sex ed because a lot of people might be going through their teen life thinking they don't fit in but there are billions of men with no circumcision and millions who suffer from phimosis and are insecure about having sex.\n\nAnyway I'm going to get circumcision at the age of 27, wish me luck.\n\nEdit : Grammar.",
            "title_similarity": "0.66649914",
            "sentiment_compound": -0.2059
        },
        {
            "id": "i46qdc2",
            "score": 2,
            "text": "Single mom of a boy here. I struggled with the decision. I ultimately bended to the opinions of others and had my boy circumcised. At 15 we talked about it and I asked him how he felt about it. He told me he would have rather I let him be uncircumcised. 😔 regrets.",
            "title_similarity": "0.64224255",
            "sentiment_compound": -0.5574
        },
        {
            "id": "i46udl2",
            "score": 3,
            "text": "Wholeheartedly agree. When I worked in elder care I adopted the school of thought that circumcision was necessary and the hygiene aspect is what drove that thought, I had to clean dicks everyday and witnessing a few infections here and there-I assumed the procedure is a cure all and every male should get one. \n Now, I work in family medicine and have to participate in these procedures and I can vouch that it is entirely barbaric. Restraining babies to a board and tying their arms and legs down, performing a painful nerve block (babies can’t communicate if it’s effective or not) is entirely traumatic wether or not you recall it, that trauma stays in your psyche. Parents are never in the room while this procedure is done, and I wish they would be…. If changed my views on it entirely seeing it done. (Nearly passed out on my first one)\n What is needed is education for young boys to use proper hygiene practices, stretching out that foreskin to prevent constriction complications, and caregivers need to follow care plans when the patient is no longer able to perform these hygienic practices. :(",
            "title_similarity": "0.65552074",
            "sentiment_compound": 0.7914
        },
        {
            "id": "i47bjyu",
            "score": 3,
            "text": "I don’t understand this comment section. all the circumcised dudes are defending something it was not up to them and they’ll never get to experience what a foreskin feels like. But they still defend their mutilated penis 🤷🏻‍♂️",
            "title_similarity": "0.71725225",
            "sentiment_compound": 0.1901
        },
        {
            "id": "i47bqza",
            "score": 3,
            "text": "People saying they do it for hygiene reasons they should circumsice their ear canals that way they shouldnt worry about wax. Chop your toes while you are at it and then your arm pits to avoid fungus",
            "title_similarity": "0.69049966",
            "sentiment_compound": 0.0531
        },
        {
            "id": "i4c1paf",
            "score": 1,
            "text": "I’m happy my parents did it to me, uncut looks gross af",
            "title_similarity": "0.45984924",
            "sentiment_compound": 0.1531
        },
        {
            "id": "i4c5wwe",
            "score": 1,
            "text": "I doubt I’m gonna change your view but I’m pretty sure you aren’t going to change anyone else’s. One, dictating any religion’s event, for a lack of better words, without a clear and imminent threat to an individuals safety (not cosmetic appearance) with a law is an enormous uphill battle that literally opens the door to challenge basic American founding sentiments. Outside of that, you having a personal opinion and preference without a minimum of medical background in a relevant field or at least a list of cons that surpasses your opinions is an awfully weak reason to legislate the option away from millions of families who may disagree with you. While you certainly may have a point that there is not a sound threat medically to justify it or the religious reasons may be archaic, I personally am glad I’m cut and I would never under any circumstances make that choice at a later age even if I hated having foreskin. That would seem like  a  risky ordeal to the average person as an adult or young adult in my opinion.",
            "title_similarity": "0.7219074",
            "sentiment_compound": -0.6084
        },
        {
            "id": "i4cwybq",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.25131163"
        },
        {
            "id": "i4d3io9",
            "score": 1,
            "text": "Aborting a living being up to and just after birth is barbaric, lets tackle that first. If you don't like people doing this for religious reasons (and those people have been doing it for thousands for years where the males overwhelmingly don't care) is a pathetic attempt to exert control over peoples lives in ways you have no right to. No one is being harmed, move on to matters that really matter and keep your liberal stupidity out of our lives.",
            "title_similarity": "0.8046094",
            "sentiment_compound": -0.9505
        },
        {
            "id": "i4dgdbl",
            "score": 1,
            "text": "Disagree. A circumcised penis looks lovely and stays cleaner. An uncircumcised penis looks like thumb in a turtleneck.",
            "title_similarity": "0.38685796",
            "sentiment_compound": 0.6597
        },
        {
            "id": "i4dui5b",
            "score": 1,
            "text": "I see absolutely no benefit to being uncircumcised",
            "title_similarity": "0.5256706",
            "sentiment_compound": -0.3539
        },
        {
            "id": "i4q48rz",
            "score": 3,
            "text": "I would say that it overall should be banned. For religious AND medical justifications.",
            "title_similarity": "0.7794744",
            "sentiment_compound": -0.4588
        }
    ]
}