{
    "Rarely Seen Paintings by J.R.R. Tolkien Portray a Lush ‘Lord of the Rings’ Landscape The Tolkien Estate recently published a trove of rare, unpublished art by the famed fantasy author on its website\n": [
        {
            "id": "i1irj98",
            "score": 21,
            "text": "[deleted]",
            "title_similarity": "0.14986303"
        },
        {
            "id": "i1j31gy",
            "score": 14,
            "text": "All of these pictures are actually the covers for the edition of the books I have (which I think is from the 70s). I haven't looked at them in years, seeing them here brings back the feels from when I first discovered them!",
            "title_similarity": "0.55217147"
        },
        {
            "id": "i1jmgc1",
            "score": -7,
            "text": "His name is Tolkien? I always thought it was Token",
            "title_similarity": "0.5105672"
        },
        {
            "id": "i1j5ogx",
            "score": 5,
            "text": "These were in a calendar and on the cover of the books.  They are fairly widely published.",
            "title_similarity": "0.38843712"
        },
        {
            "id": "i1k9c23",
            "score": -6,
            "text": "Isn't it spelled \"Token\"?",
            "title_similarity": "0.15571842"
        },
        {
            "id": "i1j5i1e",
            "score": -1,
            "text": "Rarely?",
            "title_similarity": "0.20882142"
        },
        {
            "id": "i1jf1d1",
            "score": 1,
            "text": "Beautiful, yes -- but not unpublished!  I used to have these hanging on my walls!   Got a set of small posters on card stock of Tolkien's paintings when I joined the Fellowship Fan Club back in 1977.  A dozen of them, some more gorgeous than others -- and at least five of them followed me to college and then to my first few apartments, carefully stuck up with blu-tack.",
            "title_similarity": "0.60876215"
        },
        {
            "id": "i1jht7u",
            "score": 1,
            "text": "I have a hobbit book that uses the conversation with smaug piece as the cover. I've had the book for as long as I can remember. Am I missing something?",
            "title_similarity": "0.6429405"
        },
        {
            "id": "i1lfh9h",
            "score": -1,
            "text": "Bit shit aren't they really. Books were good though.",
            "title_similarity": "0.41571105"
        },
        {
            "id": "i1ivaj2",
            "score": 8,
            "text": "Someone posted this yesteday",
            "title_similarity": "0.16962844"
        },
        {
            "id": "i1kenwi",
            "score": -2,
            "text": "HI TOL-KEEN",
            "title_similarity": "0.08994526"
        },
        {
            "id": "i1itzqg",
            "score": 147,
            "text": "These images are in my copy of The Hobbit.  Not all that rare.",
            "title_similarity": "0.5841114"
        },
        {
            "id": "i1jglcd",
            "score": -4,
            "text": "Lol, rarely seen indeed! His paintings are everywhere. The Tolkien Society sells everything from posters to eye glasses cases adorned with his paintings and drawings.",
            "title_similarity": "0.69213927"
        },
        {
            "id": "i1j98w5",
            "score": 4,
            "text": "All but Hobbiton picture are sold at [https://bodleianshop.co.uk/collections/j-r-r-tolkien](https://bodleianshop.co.uk/collections/j-r-r-tolkien)\n\nAnd that is according to them the approved source from the family.\n\nI hope they get the Hobbiton art up in A3 pirnts - was most into that one even if a smaug pic also had been great in my library",
            "title_similarity": "0.6323203"
        },
        {
            "id": "i1j8wr1",
            "score": 6,
            "text": "3 paintings is what they give us. Three.",
            "title_similarity": "0.24248347"
        },
        {
            "id": "i1jizqs",
            "score": -12,
            "text": "Big missed opportunity to sell these as NFTs r/NFTsAreLegitGuys",
            "title_similarity": "0.46244085"
        },
        {
            "id": "i1iufsd",
            "score": 527,
            "text": "Sometimes I feel the movies made Hobbiton just a little too rural. They hobbits did have plenty of mills, a post office and some of the Hobbit holes were enormous!",
            "title_similarity": "0.5651877"
        },
        {
            "id": "i1ix4tk",
            "score": 102,
            "text": "Not only unpublished but _rare_! Unlike other unpublished works where the author made 10,000 photo copies but never released them!",
            "title_similarity": "0.6345762"
        },
        {
            "id": "i1iysvp",
            "score": 48,
            "text": "I got to see a ton of his original art, maps and writings at an exhibit at the Morgan Library in NYC which was incredible. His art makes the books that much better.",
            "title_similarity": "0.49659616"
        },
        {
            "id": "i1j5euo",
            "score": 67,
            "text": "The Smithsonian article is a rehash of an article on the site ArtNet - It's a much better article and more real unseen images. \n\nhttps://news.artnet.com/art-world/j-r-r-tolkien-art-2079698",
            "title_similarity": "0.612553"
        },
        {
            "id": "i1j0jnm",
            "score": 1627,
            "text": "Link to the actual site with the 12 previously unpublished paintings: https://www.tolkienestate.com/painting/the-hobbit/",
            "title_similarity": "0.6208937"
        },
        {
            "id": "i1j2v8i",
            "score": 57,
            "text": "Dude had some talent",
            "title_similarity": "0.15810606"
        },
        {
            "id": "i1j38tf",
            "score": 6,
            "text": "I've seen the barrel one before.  It was used on a cover of an old edition of *The Hobbit* back in the 70s or 80s.  Mom would read it to us.  The copy was lost or destroyed ages ago but that was definitely its cover art.",
            "title_similarity": "0.6358584"
        },
        {
            "id": "i1j84i8",
            "score": 11,
            "text": "Can someone please list for me the pictures which were unpublished? His style is so consistent that I'm having a hard time remembering which plates were in my book of the Hobbit and which weren't. Thank you.",
            "title_similarity": "0.6708372"
        },
        {
            "id": "i1j94tg",
            "score": 4,
            "text": "These were really good illustrations is their any others outside of Lord of the Rings that tolkien made?",
            "title_similarity": "0.60733324"
        },
        {
            "id": "i1j96gf",
            "score": 124,
            "text": "Tolkien was just so overall talented. The barrel one is especially my favorite. They are just so cozy.",
            "title_similarity": "0.47097862"
        },
        {
            "id": "i1jbsp6",
            "score": 12,
            "text": "I swear when I went to the exhibit showing all his artwork, there was a picture he made of Bilbo and gollum from \"riddles in the dark.\" I don't think that image exists anywhere on the internet, I really want to see it again, I remember it being awesome. It's not one of the pieces they just uploaded on the website",
            "title_similarity": "0.70125663"
        },
        {
            "id": "i1jdigz",
            "score": 1,
            "text": "Quick, enjoy them while you can before The Tolkien Society buys em up",
            "title_similarity": "0.47906992"
        },
        {
            "id": "i1jebup",
            "score": 1,
            "text": "I really appreciate the Alan Lee paintings that were inspired by the lotr.",
            "title_similarity": "0.35118246"
        },
        {
            "id": "i1jga9a",
            "score": 5,
            "text": "glad Smaug was not ever meant to be a lousy wyvern",
            "title_similarity": "0.49525568"
        },
        {
            "id": "i1ji71l",
            "score": 4,
            "text": "Due to the capitalization I thought the painting contained something called a \"Lush\". Me not smart.",
            "title_similarity": "0.4743464"
        },
        {
            "id": "i1jlk00",
            "score": 2,
            "text": "Smaug's a stoner, look how high he is.\n\nThat's my headcanon now.",
            "title_similarity": "0.23386261"
        },
        {
            "id": "i1jlykv",
            "score": 2,
            "text": "That's pretty amazing to see it from his mind's eye.",
            "title_similarity": "0.18132418"
        },
        {
            "id": "i1jn9lh",
            "score": 3,
            "text": "Had no idea that guy could paint. These are wonderful",
            "title_similarity": "0.39659685"
        },
        {
            "id": "i1jn9mt",
            "score": 1,
            "text": "I'd saw my own little toe off for an original of one of those.",
            "title_similarity": "0.35007906"
        },
        {
            "id": "i1jo1r2",
            "score": 3,
            "text": "It’s funny reading how Tolkien often downplayed his talents as an artist- sending sketches to his publisher telling them how amateur they were and that they were just for reference to hire a much more skilled illustrator. I think his style is really great!",
            "title_similarity": "0.7105435"
        },
        {
            "id": "i1jppye",
            "score": 1,
            "text": "So smaug is not a wyvern canonically speaking. That's an info to take",
            "title_similarity": "0.42555833"
        },
        {
            "id": "i1jsfcx",
            "score": 1,
            "text": "These were in the old calendars...at least the ones on this web page.",
            "title_similarity": "0.41672593"
        },
        {
            "id": "i1jsjif",
            "score": 1,
            "text": "Wait, they showed these in Paris  2/3 years ago. It's not knew...",
            "title_similarity": "0.4011696"
        },
        {
            "id": "i1juh44",
            "score": 1,
            "text": "I saw a bunch of his artwork when it was exhibited a few years back and was completely blown away. There's a texture to these that you can't see on a monitor and you can really feel the stories.",
            "title_similarity": "0.5487403"
        },
        {
            "id": "i1jv2i1",
            "score": 3,
            "text": "That dragon pic 100% not new it’s in my copy of the hobbit",
            "title_similarity": "0.56179106"
        },
        {
            "id": "i1jwdch",
            "score": 5,
            "text": "My copy of The Hobbit has the \"conversation with Smaug\" painting on the cover :)",
            "title_similarity": "0.61248493"
        },
        {
            "id": "i1k4o58",
            "score": 1,
            "text": "Is there a place where I can purchase official prints of his paintings?",
            "title_similarity": "0.4160126"
        },
        {
            "id": "i1k6iir",
            "score": 1,
            "text": "Breath of the Lotr",
            "title_similarity": "0.09377176"
        },
        {
            "id": "i1kas5x",
            "score": 2,
            "text": "The covers of my first copies of The Hobbit/The Lord of the Rings had the article's images as covers.  I loved that version, read them until the spines and covers gave out.",
            "title_similarity": "0.6179266"
        },
        {
            "id": "i1katvk",
            "score": 1,
            "text": "This comment removed by copyright strike",
            "title_similarity": "0.428841"
        },
        {
            "id": "i1kcjui",
            "score": 1,
            "text": "That one Smaug painting looks like Trogdor 😂",
            "title_similarity": "0.46579254"
        },
        {
            "id": "i1kco5o",
            "score": 1,
            "text": "This is my first time seeing a lot of these pieces. He was such a good illustrator. What a whimsical style",
            "title_similarity": "0.5351805"
        },
        {
            "id": "i1kgwjo",
            "score": 1,
            "text": "I Have a book with the title picture in it and several other rare pictures and oddities, my mom found it for me years ago… the cover slip is in poor condition but the book itself is fair to good .\n\nEdit… actually I think these might be printed in on of my hobbit books that was a leather bound collectors edition. I think all of the ones in this article are in there.",
            "title_similarity": "0.70554674"
        },
        {
            "id": "i1kogo2",
            "score": 2,
            "text": "Unpublished? I've seen ALL of them.",
            "title_similarity": "0.2618779"
        },
        {
            "id": "i1ky5bg",
            "score": 2,
            "text": "That's not unpublished.   My Tolkien calendar has most of those pieces.",
            "title_similarity": "0.44072807"
        },
        {
            "id": "i1kyu97",
            "score": 4,
            "text": "I hate how my first reaction was seeing if there was any with the balrog to put no wings vs wings to rest once and for all.",
            "title_similarity": "0.50071096"
        },
        {
            "id": "i1l0xh9",
            "score": 2,
            "text": "Maybe it'll all be sold to Amazon so they can shit all over it.  Such a disgrace what's happening to this franchise.  Smh",
            "title_similarity": "0.4839794"
        },
        {
            "id": "i1l9dk3",
            "score": 1,
            "text": "I think I've seen \"The Huts of the Raft Elves\" and \"Hobbitton-across-the water\" before, the former possibly a cover illustration of A Hobbit softcover I used to own.",
            "title_similarity": "0.50899446"
        },
        {
            "id": "i1laxv7",
            "score": 2,
            "text": "I have The Hobbit with that thumbnail as the cover.",
            "title_similarity": "0.44834036"
        },
        {
            "id": "i1lcn2g",
            "score": 2,
            "text": "That picture is on my dad's Hobbit book",
            "title_similarity": "0.6356666"
        },
        {
            "id": "i1lhuhp",
            "score": 4,
            "text": "I once saw these paintings in person with a number of other artifacts. The most striking thing about the collection is that he imagined this world going all the way back to childhood. Even the script of the elven language resembles his mother's handwriting.",
            "title_similarity": "0.59556"
        },
        {
            "id": "i1lotfh",
            "score": 1,
            "text": "Punctuation!\n\n\r  \nRarely seen. Paintings by J.R.R. Tolkien Portray a Lush Lord. Of the Rings’ Landscape The Tolkien Estate recently published a trove of. Rare unpublished art by the famed fantasy.\r  \nAuthor on its website",
            "title_similarity": "0.9660697"
        },
        {
            "id": "i1lq428",
            "score": 4,
            "text": "Rarely seen. That's the cover art on the book I read as a child!",
            "title_similarity": "0.5973981"
        },
        {
            "id": "i1lv8kh",
            "score": 2,
            "text": "As someone who is living right between 2 LOTR shooting locations in NZ, it’s crazy how spot on these look to Otago, Fiordland and the Tongariro national park.",
            "title_similarity": "0.4314416"
        },
        {
            "id": "i1lw0k2",
            "score": 1,
            "text": "Such talent... one of the greatest writers in history, also adept at poetry, the brilliant academic and philologist, and also a pretty fantastic painter. Was there anything he couldn't do?",
            "title_similarity": "0.57172275"
        },
        {
            "id": "i1lwfsw",
            "score": 1,
            "text": "Looking for where to buy prints of these paintings.... anyone able to help?",
            "title_similarity": "0.38540605"
        },
        {
            "id": "i1m2c90",
            "score": 7,
            "text": "Not that the truth matters at this point in time, but the article and the premise of this post are incorrect. All of these illustrations have been published in various forms over the years. \n\nThe writer had seemingly misread the the ArtNet article they were reporting on, which states that previously unpublished *family photographs* had been made available.\n\nShame about the naff journalism, but if at least one person sees this, shakes their head and tuts at the whole scenario then I'll be happy, I suppose.",
            "title_similarity": "0.6742612"
        },
        {
            "id": "i1m417o",
            "score": 3,
            "text": "Don’t get how these are rare when they’re the illustrations in the hobbit book I had as a kid, maybe sensationalist title idk",
            "title_similarity": "0.7360661"
        },
        {
            "id": "i1m7fb0",
            "score": 1,
            "text": "I wonder how many more uncovered treasures are out there.",
            "title_similarity": "0.3373344"
        },
        {
            "id": "i1m8qyd",
            "score": 1,
            "text": "Fun fact, \"treasure trove\" is a set phrase from legal french for a \"found treasure.\" *Trove* is a post-positive adjective and not a noun, the plural form is *treasures trove* similar to *courts* martial or *attorneys* general.",
            "title_similarity": "0.5158813"
        },
        {
            "id": "i1med46",
            "score": 1,
            "text": "Folio Society get to work.",
            "title_similarity": "0.15290853"
        },
        {
            "id": "i1mzm59",
            "score": 1,
            "text": "I remember buying a (movie poster) copy of the Hobbit and having a few included postcards of these laying around in the house for years. Didn't think much of them at that time but now I hate how much i've neglected them though it's just a print by the publishers. :(",
            "title_similarity": "0.65295345"
        },
        {
            "id": "i1ndvi7",
            "score": 1,
            "text": "[Here](https://www.tolkienestate.com/painting/) is a link to the section of the website where the drawings can be found.",
            "title_similarity": "0.4981612"
        },
        {
            "id": "i1pryfh",
            "score": 1,
            "text": "Such a talented individual",
            "title_similarity": "0.112728305"
        },
        {
            "id": "i1pxgqh",
            "score": 1,
            "text": "Well these are incredible, actually changes the way I visualize LOTR a little bit.",
            "title_similarity": "0.27678502"
        }
    ]
}