{
    "Teens restoring thousands of books found in school dumpster to donate across Kansas City-area\n": [
        {
            "id": "i1orh1q",
            "score": -1,
            "text": "Sorry to hear that these teens, who were restoring thousands of books, were found in the school dumpster. Hope they're OK.",
            "title_similarity": "0.83748394"
        },
        {
            "id": "i1pch98",
            "score": 0,
            "text": "I pirated absolutely all of my testbooks for university and masters. For every course. No remorse.",
            "title_similarity": "0.5347544"
        },
        {
            "id": "i1nsdci",
            "score": -13,
            "text": "Kids are f-ing stupid.",
            "title_similarity": "0.08356583"
        },
        {
            "id": "i1nntk3",
            "score": 41,
            "text": "Despite the initial downsides, this initiative by the teens should be encouraged if need be  in a broader fashion. Such a program especially if it was led by young people could catch books before they hit the dumpsters and then be used to promote Community Action as well as to provide more environmentally sound ways of disposing or recycling of all this paper.",
            "title_similarity": "0.51399595"
        },
        {
            "id": "i1oa81m",
            "score": -6,
            "text": "My husband and I used to dumpster dive. The local hospital has a thrift store and after they moved buildings and I guess changed who ran it, they started tossing things that could have easily been sold. Brand new baby clothes with tags on them, new blankets still in plastic, nice toys....just tons of nice things! On several occasions almost half the dumpster was FULL of brand new children's books, like never opened brand new! And then you go inside and they have torn up, stained, and worn out children's books for $1 a piece, the books used to be 10¢ a piece. They put nasty clothing out that is stained with holes and want $3 a shirt $5 for pants when they used to be 50¢ to $1 each and if they had holes or whatever they would give them to you for free. They never have deals anymore either. Oh, and they now have the dumpster chained and locked. \n\nI just could never get over the brand new books they tossed and the ratty old books they chose to sell. Makes no sense. Their building is HUGE, they could have put all the books in a giant bin and asked 10¢ each or even given them away for free. The last time I went there, they had several old beaten up cheap looking coffee tables for $30-60, old nasty looking hospital waiting room chairs for $25 each, a pitiful worn down welcome mat for $10.... outrageous prices on shitty stuff. It's a rual area, we only have one other thrift store that is a joke as well. No Goodwill or Salvation Army. A lot of people here are poor. I don't know why they started pricing stuff so high. They started doing that like 5 years ago. And I absolutely do not understand why they toss things people would actually buy, especially BRAND NEW CHILDREN'S BOOKS!",
            "title_similarity": "0.7668843"
        },
        {
            "id": "i1nkegb",
            "score": 54,
            "text": "Oh no, if there's mouse droppings there's urine all over those books too. Those kids are touching books covered in mouse urine and distributing them.",
            "title_similarity": "0.5652278"
        },
        {
            "id": "i1prugf",
            "score": -2,
            "text": "Yeah there all History Books, They know the gig is up with all those lies,lol. Just like all the lies these crooked police tell news stations about what happens in the streets .",
            "title_similarity": "0.5418005"
        },
        {
            "id": "i1o5nt8",
            "score": 34,
            "text": "Sometimes books should stay in the dumpster. My family gave us some of our childhood books for my son. \n\nOne had a character threatening a spanking. \n\nAnother was from the 60s, it was positive about how \"girls can do anything\" but I would rather have a book with positive role models, instead of a cheerleading message that implies that moments ago, girls weren't allowed to do these things.\n\nI have Little House in the Big Woods, however my husband is Native American and I don't think that I can read this book to my son. Farmer Boy is probably okay.",
            "title_similarity": "0.5837563"
        },
        {
            "id": "i1ol8yz",
            "score": 0,
            "text": "That's my high school all right.",
            "title_similarity": "0.24927327"
        },
        {
            "id": "i1qswl5",
            "score": -3,
            "text": "Throwing books away, wasting knowledge, defending ignorance, wasting taxpayer's money. Literally every single thing about this movement is stupid and an absolute embarrassment for the educators supporting this.",
            "title_similarity": "0.43822098"
        },
        {
            "id": "i1qzvfp",
            "score": 0,
            "text": "The kids are alright.",
            "title_similarity": "-0.09446348"
        },
        {
            "id": "i1nz980",
            "score": -27,
            "text": "I fucking hate people and their treatment of books",
            "title_similarity": "0.27289787"
        },
        {
            "id": "i1nqksm",
            "score": 9,
            "text": "....There aren't book recycling programs in schools?",
            "title_similarity": "0.4001153"
        },
        {
            "id": "i1plk7q",
            "score": -1,
            "text": "The kids are alright",
            "title_similarity": "-0.08208534"
        },
        {
            "id": "i1qo7lo",
            "score": 1,
            "text": "I taught an English Lit class at a state college for 8 years.  In those 8 years. We had 5 versions of the same text book. The stories would be the same with maybe 3 taken out and 2 added, ditto the plays and poems. Most of the content in lit books are similar.  \n\nMy son came home from his first community college class on short story and asked me to guess which stories were on his syllabus.  About 3/4 were the same i taught.  Because those are the stories that get printed in the college and high school lit anthologies.",
            "title_similarity": "0.6804824"
        },
        {
            "id": "i1rgddb",
            "score": 1,
            "text": "It's so sad how people just throw out a book. It's great they restored and donated so many!",
            "title_similarity": "0.60132474"
        },
        {
            "id": "i1pphv2",
            "score": -7,
            "text": "Why bother? By and large, kids do not read nowadays.",
            "title_similarity": "0.28199676"
        },
        {
            "id": "i1nr9ai",
            "score": -35,
            "text": "I imagine the people making those decisions to dump books sat in history class thinking, \"yeah, that one sounds like a good idea!\"",
            "title_similarity": "0.59166956"
        },
        {
            "id": "i1q7h41",
            "score": 2,
            "text": "Libraries: Provide books to everyone for free for equal access to knowledge for all.\n\nUniversities: Sell books at exorbitant prices as often as possible only to people who also pay expensive tuition fees.",
            "title_similarity": "0.5910577"
        },
        {
            "id": "i1ok5w7",
            "score": 3,
            "text": "I thought the kids who were restoring books were found in a dumpster. I read it wrong",
            "title_similarity": "0.6295769"
        },
        {
            "id": "i1p7wlz",
            "score": -2,
            "text": "All them books bout evil lution must be destroyed!",
            "title_similarity": "0.32492137"
        },
        {
            "id": "i1qko2b",
            "score": 2,
            "text": "When I worked in a school district, next to the recycling center near the school was a box full of brand new copies of *The Kite Runner*. I suspect a teacher in our rural district bought them, was told they couldn't teach the book, and dumped them at the recycling.\n\nI had an acquaintance who happened to be teaching the book that semester and was short 20 copies. The box had 40.",
            "title_similarity": "0.7784815"
        },
        {
            "id": "i1pc589",
            "score": -3,
            "text": "I've said it before and I'll say it again.\n\nThe kids are alright",
            "title_similarity": "0.13490164"
        },
        {
            "id": "i1qn8nc",
            "score": -4,
            "text": "This shows the taxpayer waste that towns all across the US face. If schools don't use their alloted budget even on ridiculous unneeded new things they won't get as much funding next year. Meaning brand new books and newish books all get thrown out.",
            "title_similarity": "0.6503019"
        },
        {
            "id": "i1oasj9",
            "score": -16,
            "text": "There was a tiktok trend of people removing “problematic” books from their libraries and trashing them. This seems to be an answer to that idiocy and good on them.",
            "title_similarity": "0.58656764"
        },
        {
            "id": "i1nvw6s",
            "score": 346,
            "text": "Please don't do this. A library usually has a very rigid process they go through before deciding to weed a book. Some may have been contaminated, soiled, out of date, or no one had checked them out in the entire time they were in the catalog. If they get donated to another library, they will most likely once again get discarded. \n\nAs much as we want to keep as many books as we can, a library simply cannot have shelve space for everything. What doesn't sell in the book sale must go. We do typically take them to the recycle center though rather than a dumpster.",
            "title_similarity": "0.5870472"
        },
        {
            "id": "i1oalcv",
            "score": -20,
            "text": "Great stuff. Heard of way too many instances of schools throwing books away.",
            "title_similarity": "0.62327754"
        },
        {
            "id": "i1orcuq",
            "score": 6,
            "text": "Want this book with minimal dumpster juice or extra?",
            "title_similarity": "0.28483957"
        },
        {
            "id": "i1p2n1z",
            "score": -7,
            "text": "Yalls is to smrt!! Yalls gotsta be as smrt as me. Sos yalls can thinks 🤔",
            "title_similarity": "0.24408837"
        },
        {
            "id": "i1obhcs",
            "score": -8,
            "text": "So these are actual textbooks they're restoring? Either way, amazing. College textbooks are such a racket. They cost SO MUCH money even when bought used, then when you sell them back they give you like $3 at the school bookstore.",
            "title_similarity": "0.68321216"
        },
        {
            "id": "i1otk40",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "-0.110454515"
        },
        {
            "id": "i1pglbt",
            "score": 8,
            "text": "Another post where people will clutch their pearls and comment without having any understanding of why this happens.",
            "title_similarity": "0.30642524"
        },
        {
            "id": "i1p1prc",
            "score": -11,
            "text": "So all that money to buy things for the school only for them to throw it away just like that.....",
            "title_similarity": "0.5435554"
        },
        {
            "id": "i1od5r3",
            "score": -13,
            "text": "there has to be a parargraph in future history books about the stupid years",
            "title_similarity": "0.43738496"
        },
        {
            "id": "i1p1m1y",
            "score": -13,
            "text": "The fact that people would just dump books like that is incredibly sad. Can’t they donate the books or give them to a library?",
            "title_similarity": "0.5197254"
        },
        {
            "id": "i1oxnr7",
            "score": 49,
            "text": "I'd like to see the copyright dates before getting too worked up. There was a school in MN that was taken to task for \"throwing away our history\" by a bunch of right-wing media wonks when in fact it was really outdated nonfiction",
            "title_similarity": "0.53498596"
        },
        {
            "id": "i1o07qo",
            "score": 57,
            "text": "What if there was a bedbug infestation?",
            "title_similarity": "0.17000636"
        },
        {
            "id": "i1o35ii",
            "score": -27,
            "text": "As an author and avis reader, it pains me to see books treated so...",
            "title_similarity": "0.29809552"
        },
        {
            "id": "i1pv7lz",
            "score": 89,
            "text": "Congratulations to these teens on achieving *absolutely nothing*, except maybe making it harder for local libraries to weed stock. \n\nStories like this are complete bullshit and only get reported because people who like the idea of books but know nothing about the industry think it's noble and inspiring, and they always gloss over the fact that there is no good home to find for any of these old books. Libraries constantly weed old stock *because nobody's reading it*. Bookstores constantly remainder old stock *because nobody's buying it*. And they can't just donate it all and magically make all the misguided booklovers out there happy, because thrift stores are already throwing out whole dumpsterloads of donated books that they've got no space for. \n\nAnd every time the public learns about this they get all indignant and demand that all these books that nobody's ever going to read against should be \"saved\", because the public are fucking morons.",
            "title_similarity": "0.58357966"
        },
        {
            "id": "i1q1i5q",
            "score": 40,
            "text": "They're going to end up in the trash anyway.\n\nThose kids mean well, but the books were being tossed because nobody wanted them.  Librarians look at what doesn't get checked out and cull it to make space for new stuff that *might* get checked out.   Odds, are, wherever these get donated to will do the same, because nobody wants them.  \n\nAt our local schools, boxes and boxes of retired books get left out for people to take during the last couple weeks of school.  And every year, almost all of them end up in the dumpster because nobody takes them.  When I see them sitting out, I dig through them, and it's rare that I find anything worth saving.  They're all cheap paperbacks or crappy juvenile authors, and the ones that *are* any good are dog-eared and torn to shit.  Many of these books were themselves donated by some well-meaning parent or organization trying to \"save\" books.  \n\nThere's no point.  It's just the churn.",
            "title_similarity": "0.6885649"
        },
        {
            "id": "i1nqmlv",
            "score": 383,
            "text": "It is a worthwhile effort, and should be considered before they hit the dumpster.\n\nThe question is whether there are actual users for the discarded books.  Textbooks do get out of date.  Yes - a school may have new copies, but they have those as they were purchased to replace books that are in poor condition or get lost.   A school may replace its 8th grade algebra text every 8-10 years, and teaching techniques may will have evolved in that time.  So the old texts are not worthwhile to use.",
            "title_similarity": "0.58317715"
        },
        {
            "id": "i1ppsur",
            "score": 65,
            "text": "Books are weeded out of libraries. This is normal. \n\nI am an avid reader and lover of books but libraries have a finite amount of space.",
            "title_similarity": "0.5408629"
        },
        {
            "id": "i1nh11d",
            "score": 1625,
            "text": "\"A few of the books, they were new, like there was some in the curriculum two to three years and they just got out of the curriculum\"\n\nWhen I was in college I noticed this. I dropped a psychology class then registered again the next semester and they required a later edition of the textbook. I kept the edition I already had because I was super poor and realized the first day of class that all the page numbers and content was the same, the new edition just added an appendix. Yet that new edition cost like $150 and you could immediately find the old edition for like $20. Again, same content.",
            "title_similarity": "0.6561819"
        },
        {
            "id": "i1p1d7k",
            "score": 1,
            "text": "That would be a neat little thing, students restoring stuff. They learn a new little craft and as well",
            "title_similarity": "0.37476048"
        },
        {
            "id": "i1pp0j2",
            "score": 1,
            "text": "Good. Kansas needs all the books it can find.",
            "title_similarity": "0.51575613"
        },
        {
            "id": "i1prsii",
            "score": 11,
            "text": "Speaking as a thrift store worker, many books that are donated end up being recycled anyways, or thrown out if contaminated",
            "title_similarity": "0.7009787"
        },
        {
            "id": "i1qcek5",
            "score": 8,
            "text": "They’re purchased with public funding. They can be given to students when they have no value, they can be sold in a lot at an auction, or they can be thrown out. \n\nOften libraries try to do all three. \n\nWe used to offer them to teacher classrooms first for classroom libraries. Then we’d let the students take what they wanted. If there were books that were still in good condition we had little libraries in the community where they could go. THEN we would discard them. \n\nIt’s a sad reality, but you can’t like give them to a shelter or donate them to a thrift store. You have limited options because they were purchased with public money and the current ridiculous process is legal…even though it makes little sense.",
            "title_similarity": "0.6666228"
        },
        {
            "id": "i1qheg0",
            "score": 8,
            "text": "Books are a consumable good and recyclable. They have a shelf life. Literally.",
            "title_similarity": "0.3742901"
        },
        {
            "id": "i1qqm2a",
            "score": 1,
            "text": "As someone who does FBA books on Amazon, this would have been a gold mine. Whoa.",
            "title_similarity": "0.39284402"
        },
        {
            "id": "i1qwvp0",
            "score": 7,
            "text": "Good luck finding someone to take them. I was a high school librarian and hated to throw away books but either couldn’t find a home for them or couldn’t afford the shipping to get them there. Stopped throwing them out, however, because if a community member saw them there was hell to pay…and someone always saw them.",
            "title_similarity": "0.5985876"
        },
        {
            "id": "i1r01jm",
            "score": 1,
            "text": "Why dump them and not recycle?",
            "title_similarity": "0.10286519"
        },
        {
            "id": "i1r95ei",
            "score": 1,
            "text": "Books aren’t the cheapest to begin with. \n\nWith how many books are there I’m surprised the school didn’t try to sell it to at least get money instead of throwing them all out.",
            "title_similarity": "0.5553397"
        },
        {
            "id": "i1raji8",
            "score": 8,
            "text": "Literally no one cared about those books until they were put into the trash which is part of the whole reason they were tossed in the first place. They make it sound like the school did something bad when that's part of the procedure to discarding books that every public and school library in the nation follows. As long as the volunteers feel good about themselves for repurposing trash to help others, it's worthy of honorable recognition.",
            "title_similarity": "0.6331186"
        },
        {
            "id": "i1rrb6z",
            "score": 1,
            "text": "And yet every time I try to rehome a small collection of books, nobody wants em. Must be a logistics gap or something.",
            "title_similarity": "0.4384868"
        },
        {
            "id": "i1rrrd8",
            "score": 1,
            "text": "KNOWLEDGE",
            "title_similarity": "-0.15893161"
        },
        {
            "id": "i1ti5jh",
            "score": 1,
            "text": "Fun fact - politicians have been instructing school\nLibraries to grow out “old” books for years. \n\nGlad to see this sub cares. \n\nNow keep caring",
            "title_similarity": "0.69792175"
        },
        {
            "id": "i1ucki6",
            "score": 1,
            "text": "I think there's a gross misunderstanding in the kind of books that are thrown away. Most are either outdated (telling us about the glorious new invention: the CD), not popular in circulation, or something that was checked out so many times it was falling apart.",
            "title_similarity": "0.5330056"
        },
        {
            "id": "i1v3w4h",
            "score": 1,
            "text": "For all their moral posturing, librarians destroy a startling number of books.",
            "title_similarity": "0.49795488"
        },
        {
            "id": "i1yaxxl",
            "score": 1,
            "text": "This is so awesome and definitely made my day. Much respect to these amazing teens :-)",
            "title_similarity": "0.17601132"
        },
        {
            "id": "i2dzwmz",
            "score": 1,
            "text": "How awesome!! What terrific students! My mom was a 1936 graduate of Lincoln!",
            "title_similarity": "0.4172896"
        }
    ]
}