{
    "Ted Cruz May Have Just Boosted Sales For The Anti-Racist Children's Book He Attacked\n": [
        {
            "id": "i1y9tbh",
            "score": 1,
            "text": "As a reminder r/books is focused on thoughtful discussion of books, see rule 1. If you are wanting to talk politics visit a political subreddit. Rule 2 makes it clear that conversations need to be in a civil tone, and family friendly. Public figures are *not* excluded from this rule, even if they deserve to be.",
            "title_similarity": "0.4941828"
        },
        {
            "id": "i1wto9i",
            "score": -37,
            "text": "It is a really good book. I preordered it when it came out. My daughters love it. (Ok, the eldest loves it for content, and the youngest thinks it has cute babies and is potentially chewy)",
            "title_similarity": "0.5754792"
        },
        {
            "id": "i1ycfc3",
            "score": 1,
            "text": "It's sad that in America attempts to teach children to have introspection when it comes to race are deemed attacks on white people.",
            "title_similarity": "0.69443053"
        },
        {
            "id": "i1wumdm",
            "score": 17,
            "text": "Yet another big litigious debate, that could just be a conversation. If people were capable of civil debate, rather than seeing everything as a 'culture war'.",
            "title_similarity": "0.5459649"
        },
        {
            "id": "i1wsmr4",
            "score": 49,
            "text": "Conservative doesn’t understand they already lost the culture war years ago, take 512",
            "title_similarity": "0.55857146"
        },
        {
            "id": "i1x6r2o",
            "score": 25,
            "text": "Cruz obviously should read the book.  Maybe he would learn something - though the text may be too difficult for him, and the anti-racist themes too abhorrent to his views.\n\nFor those interested - the book is reasonably acclaimed as far as adult themed children’s books go.  It’s not bed time reading.  It’s an early reading level book about how to explore and address racism in day to day society and what young readers can themselves do.  Yes - evil I know.  \n\nThe author is the Mellon Professor at Boston University and is the Director of Antiracist Research at the school.  He has written several books, and his book, Stamped from the Beginning, the Definitive History of Racist Ideas in America won the Best Non- Fiction Award from the National Book Publishers Association.  Anti-Racist Baby - has a episode on Netflix’s show Bookmarks.  He did all the network morning shows (Today, GMA etc) when it came out.  \n\nKids encounter racism in their lives and it can be helpful to for kids and parents to work through those issues together - and continuing into the future.  It’s not a one-time thing.",
            "title_similarity": "0.7813594"
        },
        {
            "id": "i1xppb9",
            "score": 4,
            "text": "As a Texan it frustrates me that the leadership here wastes time trying to ban books to appease their supporters rather than address the real issues of our state.\n\nEdit: not sure why I'm being downvoted... I'm saying the attempt to ban books in Texas is a bad thing...",
            "title_similarity": "0.655473"
        },
        {
            "id": "i1yd8ba",
            "score": 2,
            "text": "I’m surprised Ted Cruz can read.",
            "title_similarity": "0.41562295"
        },
        {
            "id": "i1y00jm",
            "score": 1,
            "text": "If I didn't already own this book for my children, this incident would have made me go buy it.",
            "title_similarity": "0.6807134"
        },
        {
            "id": "i1xwapp",
            "score": -7,
            "text": "“Do you agree … that babies are racist?” Cruz asked Jackson. (Jackson said she didn’t know the book and had no say over what books were taught at Georgetown Day School, the first integrated school in the nation’s capital.)\n\nLiberals like to redirect to distract from the elephant in the room. The main topic here is that she refused to answer the question.",
            "title_similarity": "0.62225795"
        },
        {
            "id": "i1yeb8p",
            "score": 1,
            "text": "Every time they try it this happens. I love it.",
            "title_similarity": "0.15455332"
        },
        {
            "id": "i1xvwud",
            "score": 36,
            "text": "It’s a racist garbage book.",
            "title_similarity": "0.5331434"
        },
        {
            "id": "i1x5tzw",
            "score": -4,
            "text": "Can we rename it from the “Streisand Effect” to the “Ted Cruz Effect?”",
            "title_similarity": "0.38387635"
        },
        {
            "id": "i1xf8kt",
            "score": -21,
            "text": "Racists get really offended when you insinuate that they’re racist",
            "title_similarity": "0.56070733"
        },
        {
            "id": "i1xbxvc",
            "score": -10,
            "text": "Imagine being upset by the idea that racism is taught and not inherent within us.",
            "title_similarity": "0.55194"
        },
        {
            "id": "i1xjxr8",
            "score": 14,
            "text": "Nvm I don't even know why I bother. I used tobthinkbpeople were mostly decent and that they were just mistaken when it came to this kind of thing. Of course if a book is about how racism is bad, that's fine and not a problem. This book isn't about that. And instead of being honest and admitting that it's about teaching innocent white kids they are inherently racist and need to atone for that, yall just keep lying to yourselves and everyone else.",
            "title_similarity": "0.7512261"
        },
        {
            "id": "i1xy7ck",
            "score": 3,
            "text": "This guy is fucking moron.",
            "title_similarity": "0.3446212"
        },
        {
            "id": "i1xetxg",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.043664865"
        },
        {
            "id": "i1xjs1p",
            "score": -3,
            "text": "So... he's anti-anti-racist?",
            "title_similarity": "0.5779885"
        },
        {
            "id": "i1yb22m",
            "score": -2,
            "text": "That book does seem pretty fucking cringe though but I must admit I have not read this book for babies.  Flipping through some of the pictures out there though, this is so ridiculously hamfisted and completely unsuitable for kids.   \n\n\nWhy not have a book celebrating diversity? Family in all shapes and sizes? Why specifically proclaim ''ANTI RACIST! YOU ARE EITHER RACIST OR ANTI RACIST!! RACISM IS A PROBLEM DON'T DENY IT!'' I have like a reflex, it's so overdone, so weirdly forced that I don't want anything to do with this weird book or the writer, even if the message is good..  \n\n\nTry better bro, failing to write a good baby book is pretty sad :s",
            "title_similarity": "0.675822"
        },
        {
            "id": "i1yc5pk",
            "score": 6,
            "text": "Cool political spam in a book subreddit. How typical of reddit.",
            "title_similarity": "0.6391315"
        },
        {
            "id": "i1xl0gp",
            "score": -2,
            "text": "Legit would put a sticker on the front of the book.\nTed Cruz doesn't approve this message. \n\nIt would make it fly off the shelves.",
            "title_similarity": "0.64305025"
        },
        {
            "id": "i1xm139",
            "score": 1,
            "text": "And he may have eaten a chicken sandwich.  How bout we focus on what's actually happening",
            "title_similarity": "0.42448047"
        },
        {
            "id": "i1xb3w1",
            "score": 25,
            "text": "I like how the implied point is that because the book is popular, Cruz is wrong. \n\nAs if popularity determined reality.",
            "title_similarity": "0.70843613"
        },
        {
            "id": "i1xhaqk",
            "score": 1,
            "text": "Fuck yeah, I also want to see what the sheep are programming themselves with.  This shit will probably be in a museum one day.",
            "title_similarity": "0.35845205"
        },
        {
            "id": "i1xj8b5",
            "score": 1,
            "text": "Or he may not have..since it literally says right in the article that they're unclear whether the book was already doing that well before yesterday and attempts to reach out to Amazon haven't been successful.",
            "title_similarity": "0.5301588"
        },
        {
            "id": "i1xatnw",
            "score": -26,
            "text": "Do conservatives ever get tired of being on the \"losing\" and \"wrong\" side?  Look at history - basically everything they are against or the about becomes acceptable and fine later on.",
            "title_similarity": "0.5618432"
        },
        {
            "id": "i1xr3mz",
            "score": 12,
            "text": "Whether or not you like Ted Cruz, we can all agree the book is dumb",
            "title_similarity": "0.5690162"
        },
        {
            "id": "i1yfhci",
            "score": 7,
            "text": "Both the book and Ted Cruz are unnecessary. I'd never spend money to support either. Seems like many Americans have forgotten how to use their heads and want others to conform to their viewpoints or feel the wrath.",
            "title_similarity": "0.52619994"
        },
        {
            "id": "i1wzmus",
            "score": -30,
            "text": "From Amazon review:  Too many words not in a 2yr Olds vocabulary. \n\nHow to say I can't read without saying I can't read. Maybe this is Ted's problem as well.",
            "title_similarity": "0.48750052"
        },
        {
            "id": "i1xl3ux",
            "score": 44,
            "text": "That book is disgusting.",
            "title_similarity": "0.3333671"
        },
        {
            "id": "i1xpp2t",
            "score": 0,
            "text": "He doesn't care. It's not actually about the book, it's about pandering and riling up the base for the midterms. All this right wing culture war stuff is utterly insincere; most of them don't actually care either way, they just exploit it for political advantage.",
            "title_similarity": "0.60463405"
        },
        {
            "id": "i1y3ooc",
            "score": 0,
            "text": "I heard Ted Cruz pisses his pants on purpose, because he likes the warm feeling on his legs?",
            "title_similarity": "0.62177855"
        },
        {
            "id": "i1xsawy",
            "score": 0,
            "text": "Sheep saw a product that aligned with their chosen propaganda outlet and had to obtain a copy....or the Huffington post is a corrupt propagandist rag that will allow anything but truth in their publications.",
            "title_similarity": "0.6253042"
        },
        {
            "id": "i1ybk65",
            "score": -2,
            "text": "Why is this man alive?",
            "title_similarity": "0.17652006"
        },
        {
            "id": "i1xb49v",
            "score": 30,
            "text": "Anti racist baby? WTF how can a baby even be racist?",
            "title_similarity": "0.6454555"
        },
        {
            "id": "i1xhki2",
            "score": -7,
            "text": "Ted Cruz, go fuck yourself.",
            "title_similarity": "0.28587002"
        },
        {
            "id": "i1xwhgm",
            "score": 13,
            "text": "You people are mentally ill.",
            "title_similarity": "0.2537362"
        },
        {
            "id": "i1yelta",
            "score": 9,
            "text": "This book sucks ass.\nTed cruz sucks ass.",
            "title_similarity": "0.4913408"
        },
        {
            "id": "i1xo6li",
            "score": 3,
            "text": "the man is the human equivalent of a bed sore...but that book is wack as fuck",
            "title_similarity": "0.4165306"
        },
        {
            "id": "i1xosk2",
            "score": 3,
            "text": "I was listening to \"The Daily\" podcast on this line of questioning and I legit thought the audio on my phone had stopped because of how long Judge Ketanji paused after Ted Cruz was asking his asinine question about if babies are racist. Judge Ketanji kept such a level headed, calm approach to this nonsense.\n\nI digress... I will make sure the library I work for has this book and if it doesn't it will be ordered.",
            "title_similarity": "0.58166534"
        },
        {
            "id": "i1xpnsc",
            "score": 5,
            "text": "My town just had tornados and my Senator is in DC complaining about children's books.",
            "title_similarity": "0.5403077"
        },
        {
            "id": "i1y47ec",
            "score": 40,
            "text": "Why is nobody acknowledging the book itself (this IS r/books) is hyper-ideological trash written by one of the worst public voices on race in America? Kendi and his ideas make everything so much worse.\n\nDon't people understand yet that 'anti-racism' doesn't mean or seek to achieve zero-racism, but reinforces and demands differential treatment by skin color?",
            "title_similarity": "0.6550052"
        },
        {
            "id": "i1xbn9v",
            "score": 2,
            "text": "This nonsense happens on both sides of the political spectrum. Anytime you single out things you don't like, you are only giving press to it. And that's counterintuitive if your goal is to marginalize something.\n\n&#x200B;\n\nIt's a fine line I suppose. Millions of people today know about a book that yesterday they did not. I understand why a person would want to make others aware of something they deem bad. But it's also just as likely to give the thing \\*moar\\* reach than if you had just not talked about it at all.  That's the culture war for you. Nobody gets out with clean hands.",
            "title_similarity": "0.6563976"
        },
        {
            "id": "i1xdaax",
            "score": 1,
            "text": "Fools never learn. Funny enough Libs sometimes make this same mistake.",
            "title_similarity": "0.43824428"
        },
        {
            "id": "i1xy99b",
            "score": 0,
            "text": "I went on Amazon after seeing bits of his tirade on TikTok.\n\nYou can tell the reviews have been hijacked by mad conservatives. Theyre calling it « radical views. »\n\nWho knew im a radical for teaching my nephew that people come in all different colors and that were all humans.",
            "title_similarity": "0.6557613"
        },
        {
            "id": "i1xkjt6",
            "score": 15,
            "text": "The book sucks but consumption is the only way most people can conceive of acting on the world around them. Bad guy hates book? Buy book, this will hurt bad guy",
            "title_similarity": "0.5658207"
        },
        {
            "id": "i1y41s2",
            "score": 6,
            "text": "doubtful\n\nbut this sub is propaganda so...",
            "title_similarity": "0.44800323"
        },
        {
            "id": "i1y3a2r",
            "score": 0,
            "text": "Honestly I was embarrassed by the questions they asked like nothing to really do with what she’s going to do.",
            "title_similarity": "0.445505"
        },
        {
            "id": "i1x80n7",
            "score": -24,
            "text": "Just bought this book for my baby nephew. Did the same with the Broken butt book.\n\nKeep slamming and banning these books, conservatives! It's creating a great list for my boy.\n\n&#x200B;\n\nHe's a bit young for Persepolis, but we'll get there!",
            "title_similarity": "0.6943922"
        },
        {
            "id": "i1xezo6",
            "score": -10,
            "text": "I would run out and buy it if I didn’t already own it.\n\nImagine being mad at a book that tells you not to be racist.",
            "title_similarity": "0.68757975"
        },
        {
            "id": "i1xq3eq",
            "score": 9,
            "text": "Unfortunately, the book really isn't a good baby book, but not because babies are racist.",
            "title_similarity": "0.60900587"
        },
        {
            "id": "i1xvt86",
            "score": -5,
            "text": "Good. That book sells well in my store already.",
            "title_similarity": "0.38555163"
        },
        {
            "id": "i1x6x3e",
            "score": 36,
            "text": "God Ted Cruz some how gets stupider every time he speaks. This book has nothing to do with anything about the Judge. It's like someone asked Ted to tell us he's racist without saying he's racist.",
            "title_similarity": "0.5912398"
        },
        {
            "id": "i1xchr8",
            "score": -11,
            "text": "I wonder if conservatives will go after every single kids book that teaches them any kind of moral lesson. \nAren’t kids taught not to steal, not to lie, not to physically hurt people, etc. from a young age? \nI remember books about say a cartoon duck who’s a little different, and the message is to treat everyone equal even if they’re different. When did this type of thing become too grown up for kids? Don’t conservatives teach babies the Bible? Pretty sure I had a Noah’s ark picture book as early as 2. So Gods destruction of humanity is fine, but anti racism is too adult?",
            "title_similarity": "0.6544807"
        },
        {
            "id": "i1x83qm",
            "score": -1,
            "text": "He sure does read a lot of children's books.",
            "title_similarity": "0.36107898"
        },
        {
            "id": "i1xuaua",
            "score": -2,
            "text": "Then he's probably glad that the book isn't the point. \n\nHe's trying to stay relevant so the left hates him. that's how republicans get elected now. \n\nyes, you're helping him.\n\nDownvote me all you want. It's as helpful to you as upvoting the post was. Congrats, you did less than zero. You'd be willing to do anything to fix these problems except the things that will help.",
            "title_similarity": "0.6740265"
        },
        {
            "id": "i1xwomw",
            "score": 3,
            "text": "\"so you're saying babies are racist?\" No Ted, you're a racist.",
            "title_similarity": "0.6689391"
        },
        {
            "id": "i1y3sn5",
            "score": -4,
            "text": "Ted Cruz can’t read.",
            "title_similarity": "0.20759177"
        },
        {
            "id": "i1y64si",
            "score": 2,
            "text": "What is anti-racism? Is it just being against racism in general?",
            "title_similarity": "0.5953005"
        },
        {
            "id": "i1y7xuv",
            "score": -3,
            "text": ">He lamented that it teaches children that babies are taught to be racist, not born racist, and that they are encouraged to admit if they have been racist and to talk about it.\n\n\"Racist Babies, we were born this way!\"\n\n \\--Ted Cruz or something",
            "title_similarity": "0.7014251"
        },
        {
            "id": "i1y1fm6",
            "score": 24,
            "text": "Whatever your thoughts on this book, Kendi is an avowed racist and should not be supported.",
            "title_similarity": "0.523632"
        },
        {
            "id": "i1xqtc5",
            "score": -6,
            "text": "Love it. Just bought it. Fuck Ted Cruz.",
            "title_similarity": "0.41236335"
        },
        {
            "id": "i1x5x2r",
            "score": -33,
            "text": "They shouldn't be learning anything about race at all while they're still seeing the world objectively, plus the subject is too deep to grasp or teach for them. Critical Race Theory is interesting but it's too deep a topic for elementary school teachers that are not well versed in its long essays worth of on-going college level research studies. Taught wrong and it can easily be misinterpreted as some anti-white racist indoctrination.",
            "title_similarity": "0.6411116"
        },
        {
            "id": "i1xi6r7",
            "score": -4,
            "text": "Make it so. \n \nHe’s such a pathetic, pandering sack of shit.",
            "title_similarity": "0.3084273"
        },
        {
            "id": "i1xpsuw",
            "score": -3,
            "text": "And yes, children are taught to be racist.\n\nEver see a baby get scared of a person of different race?  I have.",
            "title_similarity": "0.65187395"
        },
        {
            "id": "i1y0p8a",
            "score": 5,
            "text": "Ted Cruz doesn't actually care if this book sells well and he doesn't actually want the government to ban anything. The point of his waging culture war is just to get the base riled up so that they keep voting for him, distracting from the fact that in terms of policy he only serves his true masters, the American oligarchy.",
            "title_similarity": "0.61882806"
        },
        {
            "id": "i1y6ats",
            "score": 2,
            "text": "You mean \"critiqued\" not all criticism is an \"attack\" I don't even need to see the context to know this is flat out wrong. Nice clickbait title.",
            "title_similarity": "0.50838655"
        },
        {
            "id": "i1xsueb",
            "score": 1,
            "text": "The parents who would already show this to their kids will and the people who aren’t indoctrinated still won’t. Sales don’t actually mean these books are being read. You think people really got into Goya beans when they had a run after Trump endorsed their products? No, probably still in many peoples pantries",
            "title_similarity": "0.62241983"
        },
        {
            "id": "i1y24kh",
            "score": 1,
            "text": "So Ted Cruz believes racism is genetic???",
            "title_similarity": "0.5713393"
        },
        {
            "id": "i1xuhwz",
            "score": -8,
            "text": "That book looks dope as hell. I don't even have a baby and I kinda want a copy. \n\nBut it raises a question of why we even allow Ted Cruz to exist. Like ok treason is one thing, and racism is another thing, and sexism is another thing, and having your only policy position be how can i inflict violence on minority groups is another thing, and treating this all like it's a game just to collect soundbites to play to racist supporters is another thing, and being wildly incompetent at all actual responsibilities of your job is another thing, and wait i forgot where I was going with this.",
            "title_similarity": "0.6771655"
        },
        {
            "id": "i1y48bh",
            "score": 24,
            "text": "r/books, please shut up",
            "title_similarity": "0.17271319"
        },
        {
            "id": "i1wya6j",
            "score": 12,
            "text": "Streisand Effect",
            "title_similarity": "0.095280774"
        },
        {
            "id": "i1xcj7h",
            "score": -9,
            "text": "Ted Cruz is the human equivalent of a runny shit. Unpleasant from start to finish.\n\nHe has the mental capacity of a toddler. I wouldn't be surprised if he hasn't fully grasped object permanence yet.\n\nAny time this fat worthless sack of grease tries to \"own the libs\" it always backfires and blows up in his face. Yet somehow he's still getting elected in Texas.\n\nI have to wonder what he thought he might accomplish with this new idiotic stunt. Every time I see his face I'm reminded he has the most punch worthy face right next to his friend Gaetz, but I will admit its impressive how he manages to stay upright with no spine.",
            "title_similarity": "0.6095277"
        },
        {
            "id": "i1xtnn5",
            "score": -8,
            "text": "I don’t even have a baby and I just ordered it. Anyone know of a good place to donate it?\n\nEdit: I received the book and gave it a read. I honestly do not understand how anyone has a problem with this unless you haven’t read it or you are in fact a racist.",
            "title_similarity": "0.6329416"
        },
        {
            "id": "i1xabyj",
            "score": -2,
            "text": "Is there another product or company that is circling the drain that could use a boost? \n\nHave them drop an anti-bigot product and hope Teddy asks about it only to boost those sales, too",
            "title_similarity": "0.757505"
        },
        {
            "id": "i1xczo3",
            "score": -1,
            "text": "Man, if I were noted shitheel Ted Cruz, I'd have investments in liberal leaning book companies since every time their books' names come out of my mouth, people who hate me buy them in droves.",
            "title_similarity": "0.6326113"
        },
        {
            "id": "i1xe3hq",
            "score": -2,
            "text": "FUCKING GOOD.",
            "title_similarity": "0.09612779"
        },
        {
            "id": "i1xpu3x",
            "score": 3,
            "text": "That's glorious! These morons attacking and banning books are doing more for literacy than if they had just shut the fuck up and let people enjoy things.",
            "title_similarity": "0.74432653"
        },
        {
            "id": "i1xxtfq",
            "score": 3,
            "text": "My kid loved Antiracist baby about a year ago.  Now he is deathly afraid of Chocolate Mayor Humdinger from Paw Patrol.  You win some, you lose some.",
            "title_similarity": "0.6255567"
        },
        {
            "id": "i1xffmb",
            "score": 31,
            "text": "Did he really attack a Supreme Court candidate for ... a children's book she didn't write?",
            "title_similarity": "0.60722864"
        },
        {
            "id": "i1xlprf",
            "score": 15,
            "text": "I used Amazon’s look inside feature for that book and honestly, it seems like an atrocious board book. The language is entirely too complicated for a small child. Neutrality? Really? I get that making an enjoyable childrens book isn’t the “point” of these kinds of books. But why not make the effort?",
            "title_similarity": "0.604107"
        },
        {
            "id": "i1xjwb2",
            "score": 26,
            "text": "Has anyone actually read this book? It’s not for children. It’s written for adults judging by the language in it. It teaches nothing about acceptance and love and unity. It’s also really badly written, with grammar mistakes everywhere.",
            "title_similarity": "0.44343722"
        },
        {
            "id": "i1x6ans",
            "score": -4,
            "text": "r/showerthoughts",
            "title_similarity": "0.14184159"
        },
        {
            "id": "i1x6v6a",
            "score": 3,
            "text": "“If You hate Ted Cruz, and Who doesn’t? Buy Our Book!”",
            "title_similarity": "0.6333009"
        },
        {
            "id": "i1xc5gj",
            "score": 3,
            "text": "Some of my favorite racists are Cuban pinheads in power.",
            "title_similarity": "0.5287647"
        },
        {
            "id": "i1y1piz",
            "score": -4,
            "text": " Crazy what threatening the release of illicit videos of suckin duck will make a man do",
            "title_similarity": "0.5896485"
        },
        {
            "id": "i1yelc8",
            "score": -2,
            "text": "4d chest. I meant to do that.",
            "title_similarity": "0.12997629"
        },
        {
            "id": "i1xcki2",
            "score": -6,
            "text": "Literally every time one of these dumbasses does something dumb with a book or song my wife buys it just to piss them off.",
            "title_similarity": "0.5944886"
        },
        {
            "id": "i1xilt5",
            "score": -8,
            "text": "A certain user posed about this on a obvious right wing infested sub reddit. Obviously it was a white male and for some reason he genuinely thought this book was for babies. Later explained it wasn't and went on about having POC friends and how he is \"colour blind\"",
            "title_similarity": "0.6990497"
        },
        {
            "id": "i1wslwm",
            "score": 33,
            "text": "El Plan.",
            "title_similarity": "0.04361164"
        },
        {
            "id": "i1x8hof",
            "score": 3,
            "text": "Well it’s part of the curriculum at the school his daughters attend, so he should be familiar with it.",
            "title_similarity": "0.4028365"
        },
        {
            "id": "i1xiu5c",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.043664865"
        },
        {
            "id": "i1xlk2l",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.02672686"
        },
        {
            "id": "i1xptyk",
            "score": 0,
            "text": "Bahahaha I love it",
            "title_similarity": "0.10576508"
        },
        {
            "id": "i1xt4xq",
            "score": 0,
            "text": "I don’t know why Rafael Cruz is complaining about affirmative action, there is truly only one way such a dumb person could have gotten into Harvard and Princeton.",
            "title_similarity": "0.50738436"
        },
        {
            "id": "i1xuo95",
            "score": 0,
            "text": "He doesn’t care. In fact, I wouldn’t be surprised if you could tie profits back to him somehow.",
            "title_similarity": "0.45464554"
        },
        {
            "id": "i1xxbeh",
            "score": 0,
            "text": "Can you believe that people vote for this traitor to represent them ?….fuck ya",
            "title_similarity": "0.56377554"
        },
        {
            "id": "i1x847q",
            "score": -1,
            "text": "It was all a ruse! Teddy is actually a great guy!!!",
            "title_similarity": "0.48221105"
        },
        {
            "id": "i1xa7lt",
            "score": 1,
            "text": "Some media generates sales boosting controversy themselves. Good to see it still happens organically.",
            "title_similarity": "0.60618913"
        },
        {
            "id": "i1xcn7u",
            "score": 1,
            "text": "I have some ideas now! He should...\n\n* attack the Texas power grid\n* attack independent store owners\n* attack abuse survivors\n* attack therapists and therapy\n* attack literally anything we need more support for\n\nSince for some unknown and mysterious reason everything he attacks gets better publicity, these are actually good things!",
            "title_similarity": "0.6812995"
        },
        {
            "id": "i1xugwh",
            "score": -1,
            "text": "Assuming he's not a complete idiot, which I believe, this demonstrates how highly he thinks of the people he's wrangling votes from. He's doing this because it will get him more votes and is betting that outrage directed at a children's book will far outweigh looking like an idiot and making a mockery of an essential part of our government.  \n\n\nI'd say it's an astounding lack of street smarts, but odds are he's right and will accomplish the desired effect. Sad.",
            "title_similarity": "0.7780404"
        },
        {
            "id": "i1xvxk1",
            "score": 1,
            "text": "Is it actually a real book?",
            "title_similarity": "0.2904268"
        },
        {
            "id": "i1xwsst",
            "score": -1,
            "text": "My independent bookstore in a small town in MO  sells this book and I’ve had at least three old white women complain about it.",
            "title_similarity": "0.41156596"
        },
        {
            "id": "i1y7u6p",
            "score": 1,
            "text": "They hate books that are anti-them.",
            "title_similarity": "0.41830295"
        },
        {
            "id": "i1y9vx7",
            "score": 1,
            "text": "Ted Cruz is a waste of breath.",
            "title_similarity": "0.3187123"
        },
        {
            "id": "i1xa4yz",
            "score": 8,
            "text": "Streisand just called, she wants her effect back.",
            "title_similarity": "0.3167879"
        },
        {
            "id": "i1xygj5",
            "score": 2,
            "text": "I bought New Kid whenever they trashed it. I'll hafta buy this one too!",
            "title_similarity": "0.54279184"
        },
        {
            "id": "i1xzf5b",
            "score": 2,
            "text": "Feel like this is a setup for the right to continue to steal progressive rhetoric. \n\n> He lamented that it teaches children that babies are taught to be racist, not born racist...\n\n\"If babies are born racist, then adults just can't help being racist, that's who they are!\" 😑",
            "title_similarity": "0.7340425"
        },
        {
            "id": "i1y3d09",
            "score": 2,
            "text": "Huffpost is just aids now. So many popups and sound from.... somewhere. Love the message but f huffpo",
            "title_similarity": "0.5248987"
        },
        {
            "id": "i1y6m8d",
            "score": 2,
            "text": "Because I support the message and want more kids to have access. Also, fuck Cancun Cruz.",
            "title_similarity": "0.5040884"
        },
        {
            "id": "i1y80aa",
            "score": 2,
            "text": "Just out of curiosity, what were the other books listed on that board of his? I feel like those are also worth a read.",
            "title_similarity": "0.5657947"
        },
        {
            "id": "i1y9q9a",
            "score": -2,
            "text": "Yes, but all he cared about was getting people talking about him on Twitter. He won y'all, he played you all like damn fiddles.",
            "title_similarity": "0.46771902"
        },
        {
            "id": "i1ww4iy",
            "score": 236,
            "text": "Ted Cruz, a stellar graduate of the School of Unintended Consequences.\n\nMakes one wonder how he's still in office.",
            "title_similarity": "0.50800776"
        },
        {
            "id": "i1x7l7c",
            "score": 3,
            "text": "It's kind of like when they started putting parental advisory warnings on music albums made them more popular with teenagers and they sold better. Or if a particular brand of heroin causes a bunch of addicts to overdose, all the other addicts want it because it must be pretty good.",
            "title_similarity": "0.7139056"
        },
        {
            "id": "i1xphwy",
            "score": 2,
            "text": "Add to it the fact that he did not pick out this book,  he did not shop for this book, he probably never heard of this book until some staff member brought it to him.  Because they said he needed some book to hold up to emphasize a talking point.",
            "title_similarity": "0.4921446"
        },
        {
            "id": "i1y7krg",
            "score": 3,
            "text": "Does anyone have the clip where she responds to Ted Cruz with \"Senator... *(silently) oh my god you're so fucking stupid do you really want me to fucking roast you in front of Congress, you potato-faced Captain Planet villain? Ok, compose yourself, Ketanji. Make him wait a few more seconds. He has lost any scrap of shame that he may have once had, but at least everybody else in the country will stew in the uncomfortable silence and can dwell on how fucking horrible he is.* ... ... ... I... don't think babies are born rasict...\"\n\nHeard the audio, but I would like to see it.",
            "title_similarity": "0.53292793"
        },
        {
            "id": "i1ybrw4",
            "score": -3,
            "text": "It's like how Republicans but my pillow.",
            "title_similarity": "0.30960268"
        },
        {
            "id": "i1x7alh",
            "score": 383,
            "text": "> “Do you agree … that babies are racist?” Cruz asked Jackson. \n\nI feel like Cruz would hold up a copy of Animal Farm and ask if animals are communists.",
            "title_similarity": "0.6797786"
        },
        {
            "id": "i1xcxuq",
            "score": 506,
            "text": "This is all just a precursor so that he eventually can sell his autobiography, the similarly titled “Racist Baby”",
            "title_similarity": "0.6930587"
        },
        {
            "id": "i1xnp8j",
            "score": 13,
            "text": "The war against racist babies is coming.",
            "title_similarity": "0.6228267"
        },
        {
            "id": "i1xe1py",
            "score": 138,
            "text": "I know articles like this make people feel good, but does anyone here believe Ted Cruz and his ilk care? If you're buying a book because Ted Cruz complained about it you're clearly not his intended audience, but the wave of \"take that, racists!\" articles after each of these stunts only serves to push awareness of the stunt further. That's what they care about, the book itself is irrelevant to them beyond its use as a tool to get their name in headlines, along with raising awareness of whatever their current nonsense flash point is.",
            "title_similarity": "0.7926475"
        },
        {
            "id": "i1x9t37",
            "score": 5,
            "text": "Forbidden fruit tastes sweeter. Just ask the music artists that the PMRC put on The Filthy Fifteen. I’m sure they were laughing and thanking Tipper Gore all the way to the bank.",
            "title_similarity": "0.58205307"
        },
        {
            "id": "i1xnflt",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.02672686"
        },
        {
            "id": "i1xs25y",
            "score": 4,
            "text": "My gosh, after a bit of background searching, the internet space around this book is so thick it takes my breath away just thinking about it.",
            "title_similarity": "0.4499703"
        },
        {
            "id": "i1x9jzj",
            "score": 6,
            "text": "Anytime literally any politician shits on a book you see this happen. It's the same thing that happened to matt walsh's book about trans kids.",
            "title_similarity": "0.5487287"
        },
        {
            "id": "i1x7k8u",
            "score": 42,
            "text": "He's fine with that. He doesn't really care. It's just theater.",
            "title_similarity": "0.24804057"
        },
        {
            "id": "i1x8bob",
            "score": 1189,
            "text": "Hates big government; wants a book banned.",
            "title_similarity": "0.41752547"
        },
        {
            "id": "i1x6pxr",
            "score": 3197,
            "text": "[removed]",
            "title_similarity": "0.02672686"
        },
        {
            "id": "i1x4hev",
            "score": 40,
            "text": "all PR is good PR - as they say",
            "title_similarity": "0.27255914"
        },
        {
            "id": "i1y6ihd",
            "score": 9,
            "text": "He knows it, and he doesn't give A SHIT. This is only performative theater for free airtime for his base. He doesn't give two shits about the books themselves. He cares about himself and himself only.",
            "title_similarity": "0.3980532"
        },
        {
            "id": "i1wz2hn",
            "score": 1498,
            "text": "We talk about this in the bookselling business all the time. It's like Br'er Rabbit: Oh, please, Mr. Conservative, don't tell people not to buy and read my books! That would be just the most terrible thing for sales!",
            "title_similarity": "0.54323375"
        },
        {
            "id": "i1xbnzi",
            "score": 1799,
            "text": "I'm pretty sure he's just showboating for a future run as Prez again, and doesn't care about or believe anything that he actually says. It's all a grift.",
            "title_similarity": "0.4371906"
        },
        {
            "id": "i1y3xus",
            "score": 139,
            "text": "I’ve read the book. It’s totally written for the parents. Nice illustrations. Too advanced concepts and language, for example they drop the term “policy change”. Come on now! Haha, best children’s book about race is the Sesame Street book “We’re all different, we’re all the same”.",
            "title_similarity": "0.6046843"
        },
        {
            "id": "i1ycw5i",
            "score": 170,
            "text": "I’ll give one thing to Cruz, “do you believe babies are racist” is my new go-to icebreaker.",
            "title_similarity": "0.6459161"
        },
        {
            "id": "i1x9d4z",
            "score": 5,
            "text": "Plot twist: he has stock in something associated with this book for sure.",
            "title_similarity": "0.4362787"
        },
        {
            "id": "i1xefvv",
            "score": 1,
            "text": "I don't think Ted Cruz cares, the prop did what it was supposed to do. In fact, if people who don't fall for it actually pick the book up, that further creates a divide that he can exploit.",
            "title_similarity": "0.73061174"
        },
        {
            "id": "i1xi0hk",
            "score": 1,
            "text": "That's what always happens when politicians attack anything though... What's the point of this? Lol\n\nLook at what happened to guns and ammo when Obama was president. Look what happened to Dr Suess books.\n\nIt's probably the BEST form of marketing you can ask for. Lol get a politician to attack your product and profit. Lmao it's a shitty life pro tip haha",
            "title_similarity": "0.66837656"
        },
        {
            "id": "i1xl2r9",
            "score": 1,
            "text": "Plot Twist : Ted is a sheep in wold's clothing",
            "title_similarity": "0.24196708"
        },
        {
            "id": "i1xmen4",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.043664865"
        },
        {
            "id": "i1xq02d",
            "score": 2,
            "text": "Next months’ news:  Ted Cruz bought stock in the publisher just before the hearings!",
            "title_similarity": "0.45030665"
        },
        {
            "id": "i1xsvvy",
            "score": 1,
            "text": "That’s how culture war bullshit works. This is just another cross-promotion.",
            "title_similarity": "0.5562748"
        },
        {
            "id": "i1xvoap",
            "score": 1,
            "text": "The cover art looks like the straps are pinning the baby's arms up. Is this an inside joke or just dumbass design by the artist?",
            "title_similarity": "0.580005"
        },
        {
            "id": "i1xvs43",
            "score": 1,
            "text": "Ive never heard of the book before. And I have no need to read a book made for children at this point.",
            "title_similarity": "0.25555208"
        },
        {
            "id": "i1xwvbw",
            "score": 1,
            "text": "This is basically the formula for any outrage profits. \n\nOne political side says that something is problematic, the other side rushes to buy/listen/watch whatever it is in spite.",
            "title_similarity": "0.64090663"
        },
        {
            "id": "i1xxz8t",
            "score": 1,
            "text": "Lots of free speech supporters in here",
            "title_similarity": "0.2785277"
        },
        {
            "id": "i1xy1tp",
            "score": 3,
            "text": "Ok, but also: \"As of Tuesday night, “Antiracist Baby,” which came out two years ago, is currently one of the bestselling children’s books on Amazon in multiple categories, including the bestselling children’s book on prejudice and racism.\"\n\nThat is an EXTREMELY specific category.\n\nIt's a bit like saying your book is the top seller in farm animal themed riddle books targeted at Hispanic teens from broken homes.",
            "title_similarity": "0.62460184"
        },
        {
            "id": "i1y0hp6",
            "score": 1,
            "text": "I thought it was \"your kids gay, even before abcdefghijklmnopqrstuvw... opens its eyes\" book?",
            "title_similarity": "0.60694325"
        },
        {
            "id": "i1y119p",
            "score": 3,
            "text": "[“Thanks to Ted Cruz, The End of Policing is now the #1 Best Seller in Gov. Social Policy,” Vitale tweeted Tuesday night, sharing a screenshot of his 2018 book now at the top of Amazon’s charts. “Every purchase now comes with a vial of Ted Cruz tears.”]\n\n\nAmazing. XD",
            "title_similarity": "0.54918873"
        },
        {
            "id": "i1y2r5a",
            "score": 4,
            "text": "I looked at the book. It looks kinda dumb tbh? I feel like it's concepts that will completely blow over most kids heads. Oh well",
            "title_similarity": "0.5724087"
        },
        {
            "id": "i1y4d8o",
            "score": 5,
            "text": "Last big fuss I got copies of *Maus* and George Takei's *They Called Us Enemy*.",
            "title_similarity": "0.52688974"
        },
        {
            "id": "i1y5bz9",
            "score": 1,
            "text": "Streisand Effect",
            "title_similarity": "0.095280774"
        },
        {
            "id": "i1y7bvu",
            "score": 2,
            "text": "Yep, this is what happens every time. From Maus to Dr Seuss",
            "title_similarity": "0.07337879"
        }
    ]
}