{
    "Dolly Parton's Imagination Library program hits milestone in Northeast Ohio with 1 million books mailed: The Imagination Library program sends children ages 5 and younger one free book each month\n": [
        {
            "id": "i3mnzyk",
            "score": -19,
            "text": "Yep, East Coast only\n\nEdit: I guess just excludes the southwest then. \n\nThank you to all who are providing constructive feedback instead of just downvoting because I'm wrong which I've already admitted.",
            "title_similarity": "0.24333358"
        },
        {
            "id": "i3msn20",
            "score": -29,
            "text": "And trust me a lot of these books are never used and end up at the goodwill. Source: used to help run IL. y’all be hating but it is the truth.",
            "title_similarity": "0.3853327"
        },
        {
            "id": "i3nhrpq",
            "score": 0,
            "text": "This is Amazing! It could also be in r/Wholesome maybe receive more attention.",
            "title_similarity": "0.042765588"
        },
        {
            "id": "i3povbr",
            "score": 0,
            "text": "And they all end up in thrift stores.\n\nI resell books as a hobby. At any time I can find 1.6 million of these books in thrift stores on a weekly basis. 99% are still in their original plastic shrink wrap.",
            "title_similarity": "0.7631988"
        },
        {
            "id": "i3ncpzd",
            "score": -5,
            "text": "Signed up for my little one when she was 1 year old, got January and March books but not a February book. We have too many to begin with so don’t mind and if things don’t go down the gutter with the economy can contribute as well",
            "title_similarity": "0.7196069"
        },
        {
            "id": "i3nl85k",
            "score": 8,
            "text": "Can people donate gently used books? I have so many kids books my son has grown out of and have nothing to do with, I'd love to know they were actually being read rather than sitting on a goodwill shelf?",
            "title_similarity": "0.5792056"
        },
        {
            "id": "i3md4f9",
            "score": -82,
            "text": "[removed]",
            "title_similarity": "-0.17726786"
        },
        {
            "id": "i3mre2m",
            "score": 37,
            "text": "They launched this program in our city right before our son was born, it’s amazing. We have more books than we know what to do with. Dolly is a genuine treasure.",
            "title_similarity": "0.67286223"
        },
        {
            "id": "i3mppyy",
            "score": 52,
            "text": "Dolly Parton is a treasure.",
            "title_similarity": "0.19361016"
        },
        {
            "id": "i3mqz7z",
            "score": 296,
            "text": "We signed up for this when my daughter was born. She's two now and gets excited for her new book in the mail each month. Dolly Parton is a national treasure.",
            "title_similarity": "0.8080697"
        },
        {
            "id": "i3msh7y",
            "score": 13,
            "text": "Highly recommend this to any parents if it's available in your area!",
            "title_similarity": "0.38280076"
        },
        {
            "id": "i3mttj4",
            "score": 415,
            "text": "Great program. Our two year old can say “Dolly Parton” and recognize pictures of her. He loves getting the new books every month. \n\nThe books they get are targeted to their age too. e.g little ones get picture books and baby sign language books etc….\n\nAlso they don’t repeat books. So if you have two (or more) kids the younger ones don’t end up getting the same ones you already got.\n\nCan’t believe it’s free",
            "title_similarity": "0.7520437"
        },
        {
            "id": "i3my047",
            "score": 37,
            "text": "Gotta say there is nothing better than taking my three year old to the mailbox and he has a book there addressed directly to him!  It's like Christmas every month for the little guy.",
            "title_similarity": "0.7712171"
        },
        {
            "id": "i3n27na",
            "score": 94,
            "text": "My daughter's favorite book came from this program.  We read it so many times the cover and pages fell out.  I contacted them to tell them how much she loved it, and they sent her 2 more copies.\n\nShe's a national treasure.",
            "title_similarity": "0.6899473"
        },
        {
            "id": "i3n73ml",
            "score": 2,
            "text": "I find it fascinating that some of our finest artists are multi-talented! And Dolly is such a great person as well!",
            "title_similarity": "0.24144928"
        },
        {
            "id": "i3n87ec",
            "score": 14,
            "text": "My daughter is about to turn 7, we received a book every month from the time she was born till she was 5.  Half our book shelf is soft cover “Dolly” books.  This program is so important!",
            "title_similarity": "0.81823134"
        },
        {
            "id": "i3n9iy1",
            "score": 1,
            "text": "My son is part of the program!!! Thank you, Dolly!!!",
            "title_similarity": "0.37702098"
        },
        {
            "id": "i3nddiy",
            "score": 8,
            "text": "Ive tried to sign my daughter up for the past 5 months but our area is full.\n\nYall enjoy your books!",
            "title_similarity": "0.72565556"
        },
        {
            "id": "i3nj2er",
            "score": 56,
            "text": "Dolly Parton might be low key one of the smartest people in the world. She threads the social and political needle better than anyone else I've seen. Her EQ rating is probably off the charts.",
            "title_similarity": "0.428241"
        },
        {
            "id": "i3nj458",
            "score": 2,
            "text": "Her books filled my kid's shelves. We thank Dolly every time we finish one of her books and see her on the last page.",
            "title_similarity": "0.68958426"
        },
        {
            "id": "i3nmg71",
            "score": 2,
            "text": "We had it for my daughters first couple years but then whoever was sponsoring it for our area decided to stop for whatever reason and we lost it.",
            "title_similarity": "0.4376666"
        },
        {
            "id": "i3nn0zt",
            "score": 2,
            "text": "It's such a lovely program I was so excited when we got the option to sign up here in Ireland. The kids really love the book each month and something new for the endless bedtime stories is always great.",
            "title_similarity": "0.61712873"
        },
        {
            "id": "i3nybcb",
            "score": 2,
            "text": "I signed my niece up for it. It's a great program.",
            "title_similarity": "0.41069782"
        },
        {
            "id": "i3nzfhk",
            "score": 7,
            "text": "Is only for...Ohio-ians? Ohioers? Or only for Americans?\n\nCan Canadians get in on this?",
            "title_similarity": "0.30705273"
        },
        {
            "id": "i3o0t61",
            "score": 30,
            "text": "No one is mentioning it but if you don't have this in your area there are ways to get it.  My small town had a fundraiser to raise the money. I think the goal was $10,000 total for the whole town.  I would definitely join your local community planning committee to see about options for getting this program. It really is worth the effort.",
            "title_similarity": "0.64298713"
        },
        {
            "id": "i3o2g0u",
            "score": 1,
            "text": "Been getting these for the past 2 years for my youngest and they are amazing",
            "title_similarity": "0.62951267"
        },
        {
            "id": "i3o7qoh",
            "score": 6,
            "text": "My son is part of this program and we love it! He's not old enough to get excited about \"Dolly mail\" yet, but he adores books and loves getting a new one to look at each month.",
            "title_similarity": "0.6581114"
        },
        {
            "id": "i3o8kbr",
            "score": 3,
            "text": "Dolly Parton is a Mensch. Giving children books to read is a gift for life.\n\nDolly Parton wrote ‘Jolene’ and ‘I will always love you’ on the same day. A spectacular talent with a heart of gold.\n\nDolly Parton is how you do life right.",
            "title_similarity": "0.58983755"
        },
        {
            "id": "i3o8r2f",
            "score": 1,
            "text": "Dolly Parton is and always will be an icon. She cares so much",
            "title_similarity": "0.2637402"
        },
        {
            "id": "i3od28m",
            "score": 2,
            "text": " What I like about it is they are actually quality books, not some half hearted attempt.  My kids enjoy getting them in the mail.",
            "title_similarity": "0.32896918"
        },
        {
            "id": "i3odme9",
            "score": 2,
            "text": "I have raved about the Dolly Parton Imagination Library to all of my friends. I signed up my child when they were less than a week old, and the first book arrived only a few weeks later. Everyone of them has been a banger; they have loved each one of them and the quality has been great. My child has enjoyed some of them even more than the other books that people have bought them. My local chapter also sends out an email every month with tips and ideas for local events. \n\nIf there is a criticism I could give, it’s that one or two of them have arrived damaged in the mail, but I know that’s a mail problem and nothing to do with the Imagination Library.",
            "title_similarity": "0.79381233"
        },
        {
            "id": "i3oetbr",
            "score": 2,
            "text": "I would dearly love for my little girl to get to meet Dolly before she passes. My daughter seems to think she’s her aunt since she keeps sending her books with her picture in them!",
            "title_similarity": "0.5376035"
        },
        {
            "id": "i3ohja0",
            "score": 7,
            "text": "United Way in my area funds the Imagination Library program. If it isn’t available in your area, check with your local United Way program to see if they might sponsor. It’s a program that fits very well under their National pillars.",
            "title_similarity": "0.48297936"
        },
        {
            "id": "i3ok6hc",
            "score": 1,
            "text": "Any post that is Dolly Parton-related: CTRL-F \"national treasure\"\n\n\nevery time",
            "title_similarity": "0.49005204"
        },
        {
            "id": "i3ol4bx",
            "score": 19,
            "text": "Congratulate all of the local volunteer groups in Ohio who raise the money and orchestrate the book distribution after buying from Dolly's vendors. Without them, there would be nothing.",
            "title_similarity": "0.69316614"
        },
        {
            "id": "i3op8gb",
            "score": 1,
            "text": "I'm like literally 2 minutes from the county line that takes part in this.",
            "title_similarity": "0.4713854"
        },
        {
            "id": "i3opwxn",
            "score": 1,
            "text": "My boys benefit from this program and as a result she’s a bit of a saint in this house.",
            "title_similarity": "0.30239463"
        },
        {
            "id": "i3osrmc",
            "score": 1,
            "text": "My daughter gets These books and loves them. She’s really great",
            "title_similarity": "0.43236762"
        },
        {
            "id": "i3oxgt4",
            "score": 2,
            "text": "Run a local chapter in my town. AMA.",
            "title_similarity": "0.33330065"
        },
        {
            "id": "i3p0yb1",
            "score": 2,
            "text": "Never particularly been a fan of her music, but as an exemplary human being, she is Top Shelf.\n\nDollywood recently gave all their employees the benefit of getting a 100% free ride to college if they want it.",
            "title_similarity": "0.5868392"
        },
        {
            "id": "i3p1pg2",
            "score": 1,
            "text": "I'm really sad this isn't available in our area. My little loves books.",
            "title_similarity": "0.32406226"
        },
        {
            "id": "i3p4f59",
            "score": 1,
            "text": "Or 2 if you are like me and you MiL heard you say you signed your son up for dolly partons library, then a month later, signed her grandson up because she heard someone talking about it once…likely me a month prior.",
            "title_similarity": "0.74980944"
        },
        {
            "id": "i3p5wy6",
            "score": 5,
            "text": "I signed up for this the day after my son was born, while still in the hospital, he's almost 6 months and I look forward to getting these every month! I can't wait until he's old enough to look forward to it, too!\n\nAlso, just an FYI, this program is funded locally - it's run by your local library and they are also responsible for securing the funding. \n\nPlease remember to support local libraries and businesses that donate to community programs like this one!",
            "title_similarity": "0.7281511"
        },
        {
            "id": "i3p6bb9",
            "score": 2,
            "text": "Gosh I love this program so much. Love the books. I’m so grateful. Every time we read books from her, we get to the last page that has her pic and say “gracias Dolly Parton!”",
            "title_similarity": "0.56659186"
        },
        {
            "id": "i3p6h3e",
            "score": 1,
            "text": "I just got my son's first book this week!! Dolly is a Saint.",
            "title_similarity": "0.719831"
        },
        {
            "id": "i3p8lpy",
            "score": 1,
            "text": "I can’t get over how awesome Dolly Parton is. For some reason, over the past handful of years I’ve stumbled across so many stories and anecdotes that illustrate this fact. Honestly I’m not very familiar with her music (I know Jolene, that’s about it!) but that doesn’t matter, she’s just a quality human being. I just bought a tshirt with young Dolly’s headshot emblazoned on the front. Hoping I get questioned about who it is so I can proselytize on her behalf!",
            "title_similarity": "0.55124587"
        },
        {
            "id": "i3pejkl",
            "score": 1,
            "text": "Hey we’re part of that!! I love getting the books for my son and he loves reading with me and looking at all the pictures. It’s a wonderful program!!",
            "title_similarity": "0.45365888"
        },
        {
            "id": "i3pgxjd",
            "score": 1,
            "text": "As someone whose favourite activity is reading I really appreciate this.",
            "title_similarity": "0.16602415"
        },
        {
            "id": "i3pj4h4",
            "score": 1,
            "text": "We don't deserve Dolly",
            "title_similarity": "-0.097861305"
        },
        {
            "id": "i3pjney",
            "score": 1,
            "text": "They’re in Braille too! My son is learning Braille and it’s such a great surprise when he gets one in the mail.",
            "title_similarity": "0.493393"
        },
        {
            "id": "i3pkkpa",
            "score": 1,
            "text": "I've lived in two states with this program and had all three of my kids receive these books. Only a few repeats among the bunch. That's nearly 180 books we've received for free! Only a couple of books left before my last kid ages out. Not only has it been good for their reading, but also for personal time with each kid that is always enjoyable.",
            "title_similarity": "0.789958"
        },
        {
            "id": "i3po57m",
            "score": 1,
            "text": "We’re in Nashville so it started here a long time ago now but my babies are a decade apart and both got books from Ms. Dolly from birth and love her dearly.\n\nThe first time around I had signed up at our local library but by the second kiddo was born they had someone in hospital solely dedicated to signing babies up, so happy to see that growth :)",
            "title_similarity": "0.7304671"
        },
        {
            "id": "i3ptbnr",
            "score": 1,
            "text": "This is amazing.",
            "title_similarity": "-0.059942923"
        },
        {
            "id": "i3ptifx",
            "score": 1,
            "text": "She is literally the only famous person I can think of off top of head who I have zero qualms about adoring))",
            "title_similarity": "0.33873087"
        },
        {
            "id": "i3pvisv",
            "score": 1,
            "text": "We are apart of this program and I can’t say enough about how amazing it is for my son!!",
            "title_similarity": "0.28119493"
        },
        {
            "id": "i3pw1jd",
            "score": 1,
            "text": "Dolly Parton is a superhero. I love reading things like this and much respect to her for launching such an amazing program for children!",
            "title_similarity": "0.5001287"
        },
        {
            "id": "i3pwapz",
            "score": 1,
            "text": "I live in East Tennessee \n\nDolly has carried our region on her back for decades now \n\nHer generosity is boundless",
            "title_similarity": "0.62445533"
        },
        {
            "id": "i3pxg92",
            "score": 1,
            "text": "This is a great program.",
            "title_similarity": "0.016556231"
        },
        {
            "id": "i3pya14",
            "score": 1,
            "text": "She is incredible \nHer book program is incredible \nAs a father of a bilingual daughter she sent her bilingual books. \n\nAmazing.",
            "title_similarity": "0.62314534"
        },
        {
            "id": "i3q0ing",
            "score": 2,
            "text": "I'm from Tennessee and am proud to share that with Dolly. She's a wonderful person and continually does stuff to better her community. Literacy has been an issue for decades here, and especially in Appalachia. Dolly saw a need and met it.",
            "title_similarity": "0.5611835"
        },
        {
            "id": "i3q1dru",
            "score": 1,
            "text": "We love our Dolly Parton books! Between those and our library trips, I’m hoping my baby loved to read as she gets older. We’re working on the 1000 books before kindergarten now! Today alone was at least 4 lol.",
            "title_similarity": "0.757759"
        },
        {
            "id": "i3q4g5d",
            "score": 1,
            "text": "I didn’t know this! I just signed my babies up!",
            "title_similarity": "0.32442957"
        },
        {
            "id": "i3qbel2",
            "score": 1,
            "text": "She's the greatest living American. She's very kind, a savvy businessperson and the most impactful person I can think of. I never recognized all the things she had done until recently, to my shame. I wish my fellow Americans followed her more than certain others.",
            "title_similarity": "0.4812929"
        },
        {
            "id": "i3qkeit",
            "score": 1,
            "text": "Wow this is really wonderful.I wish there was a program like this in India too.",
            "title_similarity": "0.22482912"
        },
        {
            "id": "i3r4z2c",
            "score": 1,
            "text": "B.S.  We went online and tried to register.  In rural Texas we're just shit out o luck.",
            "title_similarity": "0.3696848"
        },
        {
            "id": "i3vui3f",
            "score": 1,
            "text": "Dolly Parton is my hero. I even like her paintings.",
            "title_similarity": "0.30931818"
        }
    ]
}