{
    "'The Boy in the Striped Pyjamas' Set Holocaust Education Back by Decades. Now It's Getting a Sequel.\n": [
        {
            "id": "i40ioee",
            "score": 1,
            "text": "This post has been locked due to an unusually high number of rule-breaking comments. Thanks to all those who participated in civil, on-topic discussion.",
            "title_similarity": "0.3366922"
        },
        {
            "id": "i3waqs2",
            "score": 59,
            "text": "it only set back holocaust education if it's used as education materials instead of a work of fiction",
            "title_similarity": "0.47428513"
        },
        {
            "id": "i3xiexs",
            "score": 0,
            "text": "The very first part of this argument is untrue. Most Germans had no idea to what extent the Holocaust was occuring. The Nazis had a camp at Terezin, which was the only camp they showed off to the German people as well as international organizations, which showed a highly propogandized version of a camp. This is basically the exact opposite of \"every one knew exactly what was happening\". Feels like the Goldhagen V Browning argument all over again and I think you can tell I agree with Browning over Goldhagen. 2 it relies on guilt by association/collective guilt which is a terrible argument and in itself has been used to legitimize all sorts of atrocities in the past and was even used by the Nazis to try and legitimize the Holocaust.",
            "title_similarity": "0.43594152"
        },
        {
            "id": "i3wovae",
            "score": 5,
            "text": "I misread the section containing these quotes. They were provided by children after reading the book in school. Nevertheless, the quotes suggest the book creating a softer opinion of the very perpetrators of one of the worst atrocities ever committed. Yes, it's important to remember that Germans in general were not all directly responsible or even supportive of the Holocaust. But the SS officers who ran the camps? Hell no they get no pass.\n\n\n\n~~Holy fuck the dude's quotes just reek of Nazi apologism.~~  \n>~~We always think of the Nazis as the bad guys~~  \n~~It is too easy to feel sorry for the Jews  \neveryone is always (…) going to sympathize with the Jews~~  \n~~it doesn’t matter who was the bigger victim, they (Nazis and Jews) were all still victims~~\n\n~~DUDE WHAT THE FUCK~~",
            "title_similarity": "0.5105761"
        },
        {
            "id": "i3wi0ut",
            "score": 26,
            "text": "It's not the author's fault that people are stupid enough to think Bruno's death ended the Holocaust. It's not his fault that people use this fiction book as a way to teach about the Holocaust without expanding on the subject. I'm completely baffled at the stupidity of this topic, I agree that the book shouldn't be used to teach about the Holocaust (it is fiction and inaccurate) but to blame the book for setting Holocaust education back by decades??? \n\nBlame the education system, not the author. Blame the (adult) idiots who have little understanding of real life events and think an inaccurate fiction book makes for sufficient knowledge on a devastating event.",
            "title_similarity": "0.4609751"
        },
        {
            "id": "i3wicqc",
            "score": -1,
            "text": "Perhaps this movie should be treated as such and not used for educational purposes?\n\nI mean there are plenty of movies out there based on true events with crpa thrown in to suit the story and entertain.\n\nIf the movie isn't true to the real life reality then don't use it to educate people.\n\nThe movie was good, I enjoyed it... It was very emotional at the end, but I also knew alot of what happened in the movie wouldn't have been possible in reality but I went in to it expecting a movie and not a documentary.",
            "title_similarity": "0.31282377"
        },
        {
            "id": "i3wdbtu",
            "score": -12,
            "text": "What did it do to set back Holocaust education by decades? Obviously I have heard of it as it’s such a famous book but never actually read it.",
            "title_similarity": "0.6645386"
        },
        {
            "id": "i3wgwya",
            "score": -7,
            "text": "\"Set Holocaust Education Back by Decades\"\n\nEducation comes from school and other sources, not from a single fictional book.",
            "title_similarity": "0.653059"
        },
        {
            "id": "i3wqi0z",
            "score": 13,
            "text": "Reading some of these comments it’s obvious to me that some of you really like the idea of banned books and censorship, just not when it’s books you like.",
            "title_similarity": "0.2573419"
        },
        {
            "id": "i3wkkhf",
            "score": 10,
            "text": "It only set back Holocaust education if the book is being used as educational material or a reference, not a work of fiction. Not the author's fault.",
            "title_similarity": "0.4198291"
        },
        {
            "id": "i3wu79b",
            "score": 0,
            "text": "I mean it’s a shitty representation of the true horrors, but the title seems a bit excessive. If that’s all someone read to ‘learn’ about the holocaust, I highly doubt any other book would’ve educated them much better.",
            "title_similarity": "0.41411814"
        },
        {
            "id": "i3x4p2u",
            "score": 1,
            "text": "People are so pretentious and uptight. It’s a piece of fiction, it doesn’t have to be historically accurate. I thought it was great.",
            "title_similarity": "0.22173332"
        },
        {
            "id": "i40b2pe",
            "score": 0,
            "text": "How does a work of fiction set holocaust education back by decades?\n\nWhere's the breakdown in education that allows that many people to take it as historically accurate? Where's the research on it setting things back by decades?\n\nThe thread title seems disingenuous but I am open to learning why it's not, if that's the case.",
            "title_similarity": "0.69092864"
        },
        {
            "id": "i3xik9y",
            "score": -3,
            "text": "Omg, calm tf down. The intent of the book was obviously well in nature. Could you imagine if children’s books had zero censorship regarding their mental development? If we just left in all the child rape, human experimentation, canabalism, etc. etc.?",
            "title_similarity": "0.40035793"
        },
        {
            "id": "i3x36l3",
            "score": 4,
            "text": "I'll admit to some...confusion. I don't quite understand what is wrong with this book. Let me be clear. I'm not necessarily defending the book or the author. I'm just expressing my own lack of information and where I'm not seeing things add up. Please feel free to educate me or contradict me in the comments. I'm seeking understanding.\n\nFrom what I gather from the article and the comments the author is kind of a douche but I don't see how that relates to this being a terrible Holocaust narrative. There were two main historical inaccuracies addressed in the article. The first was that Shmuel probably would have been killed early since he was scrawny and weak and a child. Okay that is fair I guess but the concentration camps did have some kids in them so I never saw that as a major issue. Or at the very least not as egregious as some historical inaccuracies. The second is that Bruno would have known about the Holocaust and its horrors and I just feel like...that's wrong? For starters a shit ton of Germans didn't know the full extent of the Holocaust. They were told to hate Jews and most did but a significant number of Germans didn't know what was going on. But Bruno is the son of a kommandant? Yet it is clearly established in the book that his parents, particularly his mother are overprotective of him and want him to hold onto the innocence of childhood for as long as he can. That's a very reasonable human reaction to being involved in the largest military conflict the world had ever seen. Plus we see that Bruno's dad, being kommandant, his sister, and even his mother to some extent all agree with the Nazi regime. Its only Bruno who is currently a sheltered child who has hit the age where he asks questions non stop who expresses any apprehension and even then it is mostly just him asking why things are the way they are. If these are the only two inaccuracies of note I fail to see the big deal\n\nNow the \"people learn the book and movie and think its real\" thing doesn't surprise me. Wow the government run education screws up again. Never would have guessed. Still I've now been taught and have taught this book (admittedly I taught as a substitute teacher so I wasn't setting any curriculum or assignments). I know its anecdotal but it was always taught in English class as a work of fiction. I haven't seen any educational professional teach it in history class as history.  I'm not surprised there are people who are poorly educated but I fail to see how this book is the reason for it. \n\nThe article also said this sequel would be a cash grab and that may be the case but I don't think the premise is a terrible idea. An ex-Nazi grappling with the knowledge of what they helped perpetuate and trying to accept the horrors they were a part of and find a way to sleep at night? Sounds like a interesting premise. Lot's of room there to explore big themes and big emotions. \n\nLike I said above I am just trying to understand why this is so maligned. I don't think the article did a good job of that. I am totally down to learn more and adapt my opinion.",
            "title_similarity": "0.31352448"
        },
        {
            "id": "i3x3aa2",
            "score": -9,
            "text": "It’s a fiction book.  Stfu, Auschwitz museum.",
            "title_similarity": "0.39969036"
        },
        {
            "id": "i3wq4ml",
            "score": 12,
            "text": "You mean a fictional story isn't 100% factual? Dang that's crazy.",
            "title_similarity": "0.18551078"
        },
        {
            "id": "i3wxf7f",
            "score": 2,
            "text": "Controversial opinion, but I thought Boy in the Striped Pyjamas was funny. Not ha ah funny, dark humour? Ironically funny?\n\nIt was set up like a like a joke with a punch line.",
            "title_similarity": "0.36122796"
        },
        {
            "id": "i3xgdbv",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.06327176"
        },
        {
            "id": "i3yq1a5",
            "score": 0,
            "text": "It’s a bit odd to be ripping on a work of fiction for not being a historically accurate documentary of World War 2. \n\nYou may as well bring Jurassic Park into a biology class to teach people genetics",
            "title_similarity": "0.437513"
        },
        {
            "id": "i3wneme",
            "score": 3,
            "text": "For those who haven't seen the movie or read the book, how did it set it back?",
            "title_similarity": "0.39362973"
        },
        {
            "id": "i3wv05i",
            "score": -2,
            "text": "Why does this book get so much hate man? Like I get that it isn't historically accurate, but it's a good way to get children acquainted with the Holocaust on a beginner level",
            "title_similarity": "0.48600873"
        },
        {
            "id": "i3wcnm0",
            "score": -44,
            "text": "humanizing Nazis is wrong and all Germans were in on it - ok, guess the world is black and white and there are no nuances",
            "title_similarity": "0.2968373"
        },
        {
            "id": "i3wjeqs",
            "score": 5,
            "text": "Damn I had no idea there was controversy on this. Brilliant film, never touched the book, and tbh I  treated it as a fictional film and not some new historical point of reference when I watched it. If the book was intended or advertised to be an accurate portrayal of an innocent German child during the holocaust, then ya that’s really messed up.",
            "title_similarity": "0.40430295"
        },
        {
            "id": "i3ws18v",
            "score": 3,
            "text": "It did not set holocaust education back at all.",
            "title_similarity": "0.16919689"
        },
        {
            "id": "i3x3p33",
            "score": -5,
            "text": "This book doesn't have \"inaccuracies\" it's straight up holocaust revision designed to turn real horror into sentimental trash. Despite the ending being tragic on the surface, the book is designed to comfort you and hide you from the real nature of the holocaust",
            "title_similarity": "0.30586463"
        },
        {
            "id": "i3whi3x",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.09456033"
        },
        {
            "id": "i3x1vhq",
            "score": 1,
            "text": "I disagree with a number of the criticisms of the book in the linked article. Particularly:\n\n> The reader’s attention remains with the experience of the concentration camp commandant and his wife whose son has been killed in what is portrayed as a tragic accident.\n\n> Because the focus of the story remains on Bruno’s family, the book does not engage with the main tragedy of the Holocaust: that none of the people in the gas chamber should have been there.\n\nI don’t think the book was dismissing the horrible-ness of the treatment of the prisoners. I saw it as something similar to Mcconaugey’s closing court statement in Mississippi Burning where he describes the horrible crime, pauses, then says “now imagine she is white”. The point of focusing on the family’s tragedy was to emphasize that it was also a tragedy for the prisoners. Something many people at the time did not think was worthy of taking action to stop.",
            "title_similarity": "0.48443866"
        },
        {
            "id": "i40ap5h",
            "score": -1,
            "text": "\"Set Holocaust education back by Decades\" is a bold statement... Clickbait",
            "title_similarity": "0.74829805"
        },
        {
            "id": "i3xrrol",
            "score": 6,
            "text": "The man's a joke. He copy and pasted a Zelda recipe for poison into one of his serious historical fiction novels, and when the book he wrote about a trans child was criticised by members of the trans community on Twitter for being inaccurate and including potentially harmful misinformation, he threw a huge tantrum and wrote a whole 'comic novel' (which is about as funny as a burst fistula) about Twitter mobs and woke online culture. \n\nTo this day, he constantly whinges about cancel culture and how much of an undeserving, misunderstood victim of it he is, when in truth he was just called to account for his repeated lack of research. He's a deeply unpleasant person, and the fact that this inaccurate drivel is getting a sequel is infuriating.\n\n(Edit: downvote me all you like! He's a joke.)",
            "title_similarity": "0.4832901"
        },
        {
            "id": "i3wobl9",
            "score": -1,
            "text": "Just read the summary of the book. So it basically let a Nazy Commandant in Auschwitz play the martyr role with a stupid redemption arc?\n\nI'm not much of a fan of this trope, where the empathy is primarily with the abuser. I have noticed it a few times before, in the move Zero Dark Thirty, the 24 series, and Doctor Who (the Harriet Jones arc). It also plays a role in Bojack Horseman, but here, the creators are aware of its shortcomings, and turn it around. (Really great show, by the way)\n\nBut all that said, that book seems to be the most extreme example ever.",
            "title_similarity": "0.53444505"
        },
        {
            "id": "i3wv2wn",
            "score": 0,
            "text": "Honest question: \n\nThe author wrote this as a work historical *fiction*, why are people upset with the author when its the educators choosing to teach it as historically accurate?",
            "title_similarity": "0.4540772"
        },
        {
            "id": "i3xywgw",
            "score": -2,
            "text": "What about the armenian genocide. nobody pays attention to that one because it has political stigma",
            "title_similarity": "0.22119805"
        },
        {
            "id": "i3yh7i8",
            "score": 1,
            "text": "I'm not sure you can solely blame the book. What about the thousands of teachers not explaining historical fiction properly? Or maybe change the curriculum to not include historical fiction until the students are older and have the facts first?",
            "title_similarity": "0.5785935"
        },
        {
            "id": "i3z0ur3",
            "score": -1,
            "text": "Not that I want to argue, and I haven't read the actual book, but in what way did it \"Set holocaust eduction back by decades\"?",
            "title_similarity": "0.63694155"
        },
        {
            "id": "i3zrzup",
            "score": 0,
            "text": "Idk, thinking back as a kid in the public school system, I thought the book and film were a decent enough introduction into a very extreme topic. It should just be prefaced as a fictional story regarding a real historical event. It's like no one here has kids or at least understands that you can't just throw straight pictures/videos/readings of something like the Holocaust at a child who is just getting into learning about that time in history and expect them to understand the magnitude of it.",
            "title_similarity": "0.5748935"
        },
        {
            "id": "i3wvqd5",
            "score": 0,
            "text": "the holocaust is soooooo last decade",
            "title_similarity": "0.67149305"
        },
        {
            "id": "i3wx2tr",
            "score": 0,
            "text": "I just read the summary of the book in TFA, and I disagree with the author's conclusions.  It seems plenty horrible, and not redemptive of any nazis.",
            "title_similarity": "0.34607512"
        },
        {
            "id": "i3x4bq7",
            "score": 0,
            "text": "I have never read it, or have i seen the movie. How did it stunt holocaust education?  Serious question here :)",
            "title_similarity": "0.40464535"
        },
        {
            "id": "i3xoyse",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06327176"
        },
        {
            "id": "i3xuab7",
            "score": 0,
            "text": "I've not read the book but I've seen the film and I thought it was very good to be honest. I have a little knowledge of the Holocaust so I always assumed it was fiction and not a true story, but I can see why those who don't would assume the opposite and why that's dangerous. Not sure what a sequel will achieve, the dude must of ran outta money.\n\nIf this thread has taught me anything it's that the Germans are doing a fantastic job of educating their people about what happened and are not afraid to cast light on their past atrocities. It can only be a positive thing and should be commended.",
            "title_similarity": "0.47078416"
        },
        {
            "id": "i3y1z3g",
            "score": 0,
            "text": "But… who reads books?",
            "title_similarity": "0.19897297"
        },
        {
            "id": "i3yaksp",
            "score": 0,
            "text": "I wish someone would write a book about all the Ukrainians that died because of the Iron Curtain. There's also all the Chinese who died because of Mao. There's even all the ethnic cleansing of Germans throughout Eastern Europe after WWII. Just what we need is another book about the Jews that died even though their numbers aren't even half of that of any of the above genocides I mentioned.",
            "title_similarity": "0.48704648"
        },
        {
            "id": "i3ysv26",
            "score": 0,
            "text": "Anyone want to explain why the book set it back?",
            "title_similarity": "0.4230979"
        },
        {
            "id": "i3yvkz9",
            "score": 0,
            "text": "Why is it so bad? I’ve only seen the movie years ago and it never struck as something so deplorable",
            "title_similarity": "0.4275591"
        },
        {
            "id": "i3zyvi6",
            "score": 0,
            "text": "... Isn't that novel and movie...you know.... Fiction? Lmao such a bs title. The novel didn't change how millions of people looked at the holocaust.",
            "title_similarity": "0.5110296"
        },
        {
            "id": "i40e98c",
            "score": -3,
            "text": "its fiction..... jfc more ppl believe in the bible than this BS, at least its categorized correctly....",
            "title_similarity": "0.3898886"
        },
        {
            "id": "i3zbo6l",
            "score": -1,
            "text": "This reminds me of all American movies set in the wild west and during the Colombus discovery of America and native indian genocide. Absolutely a “history is written by the victors” kind of viewpoint. \n\nAmerican children are being taught the superiority feeling of their country and people in history, actually their society is being build on genocide. The native indian holocaust.\n\nSame as how the events of Hiroshime and Nagasaki are being taught as “necessary for peace” at the time. While it was actually a massive war crime and thus genocide against civilians.",
            "title_similarity": "0.55759573"
        },
        {
            "id": "i3x2cj1",
            "score": 4,
            "text": "you can’t blame books for your problems.",
            "title_similarity": "0.17130399"
        },
        {
            "id": "i3wtnt2",
            "score": -5,
            "text": "I see a lot of people complaining about the book but zero people actually explaining what’s wrong with the damn book",
            "title_similarity": "0.2755109"
        },
        {
            "id": "i3xahsf",
            "score": -6,
            "text": "I’m going to prescribe a chill pill for the writer of this article. Is it crass and unwise to inaccurately depict a fictional story around the deaths of millions of people? Yes, no one is saying it’s not, but the title sounds like pure clickbait until you read the article and that’s what the writer is actually repeating.\n\nBoy in the Striped Pajamas did not set Holocaust education back a month, much less plural decades. Portraying a labor camp where a child is able to live and have conversations with an outsider does not lead anyone to believe that the Nazis were running a daycare. Is it inaccurate? Fuckin duh, but it’s like no one has read a story before.\n\nArgue that it’s callous to portray it as such, or that it broke your suspension of disbelief, but this writer didn’t have any suspension to begin with. If you’re not willing to imagine an unlikely scenario as the basis of a story, you’re bad at reading books. A story is a contract between writer and reader to create a world that may not abide by the same rules as ours, but clickbait articles gotta get ad rev somehow, I guess.\n\nAnd Bruno’s death is supposed to be comeuppance? In what way? The story is framed as a tragedy beyond a child’s comprehension. The whole narrative supports that these evils are beyond the scope of a child’s perception, as a means of making the Holocaust that much more starkly evil.\n\nIt’s not revolutionary, but guess what? I watched the movie when I was twelve, the same year I read Night and went to a Holocaust museum. Not only did it not “set Holocaust education back by decades”, it was perfectly in line with the Holocaust education that students were receiving.",
            "title_similarity": "0.58390677"
        },
        {
            "id": "i3wtyet",
            "score": -3,
            "text": "What a brutal story. To quibble over inaccuracies means that entire point of the story is being missed.",
            "title_similarity": "0.26242387"
        },
        {
            "id": "i3xet53",
            "score": -1,
            "text": "Could try not reading it .. Thats an easy solution to books you dont like.",
            "title_similarity": "0.18859336"
        },
        {
            "id": "i3xey4x",
            "score": 1,
            "text": "The article is kinda half right. Yes overall the focus of the story is a bit odd and maybe apologist, but its not entirely unthinkable that a boy wouldnt be aware that death was going on the camp, as certainly not every German was.",
            "title_similarity": "0.35950398"
        },
        {
            "id": "i3xhkx5",
            "score": -1,
            "text": "Why do people in this thread hate this book so vehemently?",
            "title_similarity": "0.22551735"
        },
        {
            "id": "i3xmeel",
            "score": 1,
            "text": "actually I watched a documentary about right after the war how the allies made the German people clean up the camps. bury the bodies ect... and most of them had no idea despite living nearby. they felt like they had nothing to do with the holocaust yet were apart of it by being forced as if they were guilty by association.",
            "title_similarity": "0.48215187"
        },
        {
            "id": "i3xn4fw",
            "score": -1,
            "text": "Bunch of fucking little snobbies in here lol",
            "title_similarity": "0.22722307"
        },
        {
            "id": "i3xrd2i",
            "score": -1,
            "text": "Boy in the Striped Pyjamas is one of those books that makes me see red with rage.\n\nIt’s frankly one of the few books which actually caused the world to get actively worse.",
            "title_similarity": "0.4761275"
        },
        {
            "id": "i3xy1ul",
            "score": -1,
            "text": "I just saw the movie, I took it as fictional, what does the book say that has people convinced it was real?\n\nRead the article: my contempt for humanity is through the roof, but I don’t know if I blame the author more than general educational standards across the globe. It’s fucking fiction. Jesus Christ people are stupid.",
            "title_similarity": "0.3929977"
        },
        {
            "id": "i3zqcaj",
            "score": -1,
            "text": "Everyone crying over book banning and now saying they should be banning some?\nDoesn't work like that. \nHe should be allowed to write anything he wants.",
            "title_similarity": "0.40621045"
        },
        {
            "id": "i3wkap7",
            "score": -12,
            "text": "[deleted]",
            "title_similarity": "0.09456038"
        },
        {
            "id": "i3wjow3",
            "score": 4,
            "text": "Even as fiction the story is just atrocious. I wish I could take back the time I wasted on it.",
            "title_similarity": "0.30779445"
        },
        {
            "id": "i3yl3yz",
            "score": 1,
            "text": "I feel like this article incorrectly places the blame on the author of the book instead of on the teachers who are supposed to teach the kids. The book is a work of fiction and as far as I know, the author has always been open about that.",
            "title_similarity": "0.4240687"
        },
        {
            "id": "i3yppkz",
            "score": 1,
            "text": "Wait why is everyone mad at this book? I haven’t read it, just seen the movie. I never thought of it as something that was historically accurate. It comes off as fiction to me. I kinda appreciated how the story developed through the little German kid’s perspective. What other problems were there with the story?",
            "title_similarity": "0.39706063"
        },
        {
            "id": "i3zukoq",
            "score": -1,
            "text": "News flash:\n\nHansel and Gretl doesn't accurately depict the reality of old women living alone in the woods in gingerbread houses.  \n\nDo the research, people, or don't presume to publish!",
            "title_similarity": "0.30703646"
        },
        {
            "id": "i40i1vi",
            "score": -2,
            "text": "The hate John Boyne is getting here is beyond absurdity",
            "title_similarity": "0.22049016"
        },
        {
            "id": "i3wlj0r",
            "score": 20,
            "text": "Given the studies where respondents thought this was based on a true story, the damage is 1000% on the teachers. If you have HF material and you don’t go back and say: “this is what *really* happened, that is a failure to educate. \n\nHistorical fiction is *by definition* a question of “what if.” If it was a portrayal of “what was” then it would be academic or biographical, not fiction. Some HF is more accurate than others based on the documentation available, but at the end of the day the author has a specific story they want to tell. \n\nI haven’t read *The Boy in the Striped Pyjamas* since it came out after I graduated, and some of this really sounds like it stretches the limits of credulity, but given the plot synopsis it sounds like the author was trying to explore the question of “what if” you didn’t know the truth. Which, as a little kid, seems pretty plausible. I don’t know about the parents, but then again, it’s not like parents don’t flat out lie to their children. That people take that question as a portrayal of fact is a failure to educate on the nature and purpose of fiction, which frankly bears out every time I read reviews on goodreads or amazon. It flabbergasts me how many people think *The Other Boleyn Girl* is a true portrayal of Anne’s character. It’s *possible,* but that doesn’t make it *true.* Many details are correct and occur on the correct timeline but there is absolutely no way to know what the real Anne Boleyn was thinking or what happened behind closed doors.\n\nCharacters lie. Characters misperceive things because of their age or education or culture. If you, as a teacher, use a work of historical fiction and don’t deliberately separate character and narrative from fact, stick to memoirs. We read *Night* by Elie Wiesel and *The Diary of Anne Frank.* \n\nTo be fair, there are numerous examples of fiction shaping the cultural perception due to this failure to educate. It has been going on for a long, long, time, so I’m not going to pretend there’s some kind of golden age of literacy where everyone understood what the fuck they were reading, BUT the conversation should be about how we’re teaching, how we can be more effective, how we can engage students in real conversation, how to draw parallels between current events (border camps, anyone?),  how we can show students to research properly, go back to source material and differentiate between “plausible” and merely “possible,” how we can support teachers in that environment, how we can support parents to reinforce learning, and how libraries, museums and other institutions can offer support. The *real* conversation we need to have is not about authors of fiction writing fiction, but about redefining the purpose of education to have an end goal of producing people who are capable of processing a much wider array of information when the purpose of education as it stands is to process instruction.",
            "title_similarity": "0.57185507"
        },
        {
            "id": "i3wnfvn",
            "score": 9,
            "text": "\"For I am just a child of a Nazi officer, I do not know of this hatred for the Jews and am only being friendly to a boy like me who sits in a fenced area. However my death will redeem my father\" It's fucking ludicrous",
            "title_similarity": "0.48484296"
        },
        {
            "id": "i3z9z5a",
            "score": 4,
            "text": "I have just spoken to my Year 10 daughter about this. \n\nBad news:\nThey were shown the film in a history lesson at school.\n\nGood news:\n The assignment was to write down why it was so inaccurate historically,  how the plot failed to show the suffering and for advanced students,  how the power of mis information can change how a population reacts. They equated it to Nazi propaganda.\n\nSome hope restored.",
            "title_similarity": "0.5922451"
        },
        {
            "id": "i3wl4lr",
            "score": -8,
            "text": "sounds like if you hate that book you would probably also hate. \"JOJO RABBIT\"",
            "title_similarity": "0.32028484"
        },
        {
            "id": "i3wr7o7",
            "score": -9,
            "text": "What about Taika Waititi's horrible movie Jojo Rabbit?",
            "title_similarity": "0.38318026"
        },
        {
            "id": "i3wn460",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.09456038"
        },
        {
            "id": "i3wqvmx",
            "score": -4,
            "text": "I watched the movie version years ago in theaters randomly.  When I was young, I would just buy a ticket, and spend the whole day seeing whatever movies was out.\n\n What was inaccurate about the stuff in the movie?",
            "title_similarity": "0.4789557"
        },
        {
            "id": "i3ws6sc",
            "score": -3,
            "text": "I've never seen the movie or read the book. Why are they so bad?",
            "title_similarity": "0.25199994"
        },
        {
            "id": "i3x1cj0",
            "score": 0,
            "text": "Never read the book or seen the movie. Some eli5 how inaccurate the book is?",
            "title_similarity": "0.28466848"
        },
        {
            "id": "i3x53k2",
            "score": 0,
            "text": "Just read Night. Fuck this tool.",
            "title_similarity": "0.18893176"
        },
        {
            "id": "i3x5mdt",
            "score": 0,
            "text": "I've read it but Maus is likely better.",
            "title_similarity": "0.3633897"
        },
        {
            "id": "i3xosv1",
            "score": 0,
            "text": "Except now it's the Sisterhood of the Travelling Pyjamas and it's a story of the bond of womanhood between different camps. 🤣",
            "title_similarity": "0.41437864"
        },
        {
            "id": "i3xvtfc",
            "score": 0,
            "text": "Can someone explain to me the inaccuracies in the first movie? I watched it when i was like 15 yrs old so i dont remember much, just that it made me really sad at the time. Id really like to know more, especially after just now, finding out who John Boyne is, and how much of a fucking imbecile he must be.",
            "title_similarity": "0.5287644"
        },
        {
            "id": "i3xy4ge",
            "score": 0,
            "text": "I've never read the book or seen the movie, how was it detrimental to holocaust education?",
            "title_similarity": "0.34539604"
        },
        {
            "id": "i3xysgg",
            "score": 0,
            "text": "What are some of the major inaccuracies I read the book like 8 years ago and remember it being kinda generic and boring",
            "title_similarity": "0.41444242"
        },
        {
            "id": "i3xzsb5",
            "score": 0,
            "text": "Out of the loop, never actually sat down to read the book or watch the film. How does it negatively impact Holocaust education? What’s the take on that?",
            "title_similarity": "0.41822517"
        },
        {
            "id": "i3y0lje",
            "score": 0,
            "text": "I mean, in the UK I watched it in school and it was basically the only thing close to a compelling way to making it stick, I think without it I'd be much less sympathetic. Obviously if it edged out something better then that'd bad, but if it was going to be replaced with more accurate but uncompelling textbooks then I'd probably be less of a right's activist than I am today.",
            "title_similarity": "0.44564304"
        },
        {
            "id": "i3y2lbn",
            "score": 0,
            "text": "Can someone ELI5 why this book is inaccurate? I saw the movie as a child but it’s been a while…",
            "title_similarity": "0.55622125"
        },
        {
            "id": "i3y9qe3",
            "score": 0,
            "text": "The boy in the striped pyjamas 2: Gaseous boogaloo",
            "title_similarity": "0.4339938"
        },
        {
            "id": "i3yaa6p",
            "score": 0,
            "text": "What's wrong with this man? \nWhy not go for broke?\n\nSet the sequel in modern day Palestine.\n\nSee how that goes.",
            "title_similarity": "0.55590254"
        },
        {
            "id": "i3yclp8",
            "score": 0,
            "text": "Wait, so is the movie that is based on this book is in some ways different to the book and improved or something, when the movie has such a great reception by movie critics and movie fans? On IMDB it has for example a really high 7,8/10 score",
            "title_similarity": "0.39470726"
        },
        {
            "id": "i3ydlgn",
            "score": 0,
            "text": "I am bit out of the loop here, can someone explain the controversy around this book? I read a long long time but don't really remember anything about it.",
            "title_similarity": "0.3921985"
        },
        {
            "id": "i3yh4k2",
            "score": 0,
            "text": "Never read it, just how bad are the inaccuracies",
            "title_similarity": "0.15419182"
        },
        {
            "id": "i3ypvf3",
            "score": 0,
            "text": "bAn ThE bOoK",
            "title_similarity": "0.18412821"
        },
        {
            "id": "i3z9d1d",
            "score": 0,
            "text": "My heart breaks for the Jewish people of the Holocaust but as far as children being taught in schools that “The Boy in Stripped Pajamas” was true is the fault of the teachers. I own the movie & found it to be a tear jerker but by the same token I also knew it was fiction. I can definitely understand the anger of the Jewish people because the Holocaust was a very dark & painful time in History that should never be forgotten nor repeated but if the schools now have Black History Month & Hispanic Heritage Month maybe it would be a good idea to also have Jewish History Month so kids can learn the true history of WWll & the suffering & killing of the Jewish People aka The Holocaust. I honestly think it’s important for kids to learn the truth about the Holocaust & whatever books used should be chosen by one of the Jewish Organizations so there’s no problem w/if the kids are being taught fiction or non-fiction. In school we had to read Anne Frank & it’s definitely worth reading.",
            "title_similarity": "0.51957834"
        },
        {
            "id": "i3zogfj",
            "score": 0,
            "text": "Lol use getting mad at him, man got paid millions by doing lazy work. I used to do that all time in school but man truly scammed the whole school industry.",
            "title_similarity": "0.5473665"
        },
        {
            "id": "i3zvofy",
            "score": 0,
            "text": "As I said in another post about this:\n\n\nNOOOOOOOOOO GOD\n\nno god please no, NO\n\nNOOOOOOOOOOOOOOOOOOOOO",
            "title_similarity": "0.18484479"
        },
        {
            "id": "i404c2r",
            "score": 0,
            "text": "The Boy in the Spotted Pyjamas",
            "title_similarity": "0.37692213"
        },
        {
            "id": "i405ajb",
            "score": 0,
            "text": "I am sorry but can anyone explain why The Boy in the Striped Pyjamas has set Holocaust education back by decades? \n\nI am very ill-informed about this part of history and I have realized this only recently. School textbooks in my country are not as thorough with world history as they should be and there are a lot of gaps in my knowledge as a result. Also, weirdly in some ways, they praised Hitler for his intelligence(!!!)- not directly, but it felt like that to me.\n\nI had read the book in 8th grade and had been really moved by it( even though I did not think it was a true story). I want to understand this better. Please educate me.",
            "title_similarity": "0.65457034"
        },
        {
            "id": "i3x71g1",
            "score": 6,
            "text": "I remember being very frustrated with how stupid the German child was for not knowing anything. \n\nBut I figured that must have been why an idiot like Hitler was able to trick them all into believing he was gonna take over the world.",
            "title_similarity": "0.40555382"
        },
        {
            "id": "i3y7pcj",
            "score": 5,
            "text": "I mean, yeah it was completely unrealistic (a German kid ends up sneaking into a Concentration camp…come on now) but so was Life is Beautiful and that’s considered one of the greatest films in history\n\nI think Holocaust education and Hollywood depictions should just be separated entirely",
            "title_similarity": "0.5353609"
        },
        {
            "id": "i3wgklj",
            "score": 66,
            "text": "If I was this author I would’ve pulled the book out of embarrassment. What a shame",
            "title_similarity": "0.36004674"
        },
        {
            "id": "i3zx8e1",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.06327176"
        },
        {
            "id": "i3wsp4o",
            "score": 1,
            "text": "It's a historical fiction, written in a day by someone with absolutely no historical credit whatsoever. You can hardly be surprised it belongs in the bin.",
            "title_similarity": "0.33628637"
        },
        {
            "id": "i3wsp6d",
            "score": 1,
            "text": "Read the book it was a good read but I couldnt stop the feeling that the only thing the book was trying to be was sad and trying to be as impactful as possible.",
            "title_similarity": "0.28346327"
        },
        {
            "id": "i3wz3ah",
            "score": 1,
            "text": "Wait someone fill me in this is a genuine question. I dont think we read the book at my school just watched the movie so why did it \"set Holocaust education back\"\n\nedit: I read through the article and I thought it was common knowledge that it was fiction but I can see how some people take it as truth. The stats are worrying and yeah I can't believe they prioritize this book over Anne Frank's diary which wasn't read at my school either",
            "title_similarity": "0.48199004"
        },
        {
            "id": "i3x1gz5",
            "score": 1,
            "text": "Fiction isn't for education. \nFact and fiction are different.\nIs the Bible educational?",
            "title_similarity": "0.32812327"
        },
        {
            "id": "i3x2wpk",
            "score": 1,
            "text": "Wait, people hate this book? When I was in school teachers constantly shoved it up our arse when crying about the Holocaust.",
            "title_similarity": "0.45233062"
        },
        {
            "id": "i3x5snf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06327176"
        },
        {
            "id": "i3x6sh8",
            "score": 1,
            "text": "The brother of the german kid who befriended the jew one grew up and entered politics to buy gas from the Russians.",
            "title_similarity": "0.58538604"
        },
        {
            "id": "i3xbhkf",
            "score": 1,
            "text": "\"Set holocaust education back for decades.\"\n\nWhat is holocaust education doing for us? Look at the world; there is a genocide of muslims going on in China right now, and the world isn't doing shit about it.",
            "title_similarity": "0.5976204"
        },
        {
            "id": "i3xdw9k",
            "score": 1,
            "text": ">When accused of promoting historical inaccuracies, Boyne has claimed that fiction doesn’t need to be accurate. However, when criticized for his lack of research and subject knowledge, he’s insisted that he’s a longtime “serious student” of Holocaust-related literature who knows the history despite having made an endless string of errors. Rather than admit he might have done something wrong, he’s publicly argued with the Auschwitz Museum on the topic of the Holocaust instead.\n\n\"I know I'm right, but even if I wasn't right, it wouldn't matter. But I am right.\"",
            "title_similarity": "0.43734464"
        },
        {
            "id": "i3xg2mq",
            "score": -1,
            "text": "nomduit gf",
            "title_similarity": "0.15931876"
        },
        {
            "id": "i3xhss4",
            "score": 1,
            "text": "Wait what? Can someone get me up to date on this. Watched the movie The Boy in Striped Pajamas in 6th grade as part of a history lesson… thought it was heartbreaking but don’t remember much other than that.",
            "title_similarity": "0.5611056"
        },
        {
            "id": "i3xpl5c",
            "score": 1,
            "text": "I've only heard of the book.  Never read it or watched the movie.  What's so bad about it?",
            "title_similarity": "0.27040336"
        },
        {
            "id": "i3xqr3p",
            "score": -1,
            "text": "The boy with the striped pajamas 2: Bruno’s revenge.\n\nHonestly, I can’t wait.",
            "title_similarity": "0.57545495"
        },
        {
            "id": "i3xrm70",
            "score": 1,
            "text": "I know a lot people enjoyed the movie version....but it was literally one of the worst movies I've ever seen.  I hated every second of it",
            "title_similarity": "0.33503434"
        },
        {
            "id": "i3xv8xl",
            "score": 1,
            "text": "It's fiction, isn't it?",
            "title_similarity": "0.082393356"
        },
        {
            "id": "i3xvs68",
            "score": -1,
            "text": "Wait, what wrong with The Boy in the Striped Pajamas? I read it and it's one of my favourite books. \n\nI don't particularly remember the details, but what always stood out to me was the naivety of both children and how they had no idea what was going on. And the death scene at the end was so emotionally raw for me. I think it portrays the child like innocence quite well.",
            "title_similarity": "0.45425397"
        },
        {
            "id": "i3xwufi",
            "score": 1,
            "text": "We don’t talk about Bruno",
            "title_similarity": "0.07675105"
        },
        {
            "id": "i3xxtxg",
            "score": -1,
            "text": "Im not understanding this article. The book is fiction, however I didn't read it. Watched the movie and I didn't see any totally impossible scenarios for a fictitious story. I did only see it once and it was when it first came out. Seemed powerful and impactful at the time though.",
            "title_similarity": "0.31849515"
        },
        {
            "id": "i3y5rdq",
            "score": 1,
            "text": "I wasn't aware this book was controversial. Can someone explain?",
            "title_similarity": "0.26704895"
        },
        {
            "id": "i3y6ws7",
            "score": -1,
            "text": "What is wrong with you people?  When did the author act like his story was fact",
            "title_similarity": "0.31485084"
        },
        {
            "id": "i3yb91i",
            "score": 1,
            "text": "Had no idea this book was used to teach. I mean it's a decent fictional non-fiction book but not to teach with.",
            "title_similarity": "0.29349244"
        },
        {
            "id": "i3yfkrs",
            "score": -1,
            "text": "In Boyce’s defence he has written very good books since this one. His writing style is excellent. That said I hated ‘The Boy in the Striped Pyjamas’",
            "title_similarity": "0.53514844"
        },
        {
            "id": "i3yh9l9",
            "score": -1,
            "text": "I really don’t see the issue.",
            "title_similarity": "-0.058500063"
        },
        {
            "id": "i3yjyki",
            "score": -1,
            "text": "Could someone explain to me how detrimental \"the boy in the striped pyjamas\" was?",
            "title_similarity": "0.43440413"
        },
        {
            "id": "i3yjziy",
            "score": -1,
            "text": "I never read this one. Is it bad? I only heard good things about it before",
            "title_similarity": "0.3416317"
        },
        {
            "id": "i3yn97w",
            "score": -1,
            "text": "Never read the book but I loved the movie. Is that also hated?",
            "title_similarity": "0.33770075"
        },
        {
            "id": "i3yrnlw",
            "score": 1,
            "text": "my philosophy teacher played that movie to my class when we were learning about hannah arendt and morals\n\nwhat exactly is bad about the film and how does it affect education about the holocaust?? genuinely curious",
            "title_similarity": "0.47150475"
        },
        {
            "id": "i3ytbol",
            "score": 1,
            "text": "Wait how did this movie set Holocaust education back decades?",
            "title_similarity": "0.7889133"
        },
        {
            "id": "i3yz726",
            "score": -1,
            "text": "They should do it Wicked style and tell it from the Bad Guys point of view.",
            "title_similarity": "0.2566124"
        },
        {
            "id": "i3z0qtp",
            "score": 1,
            "text": "Never seen it but I thought it was a respected film. What did they misrepresent or whatever?",
            "title_similarity": "0.2628643"
        },
        {
            "id": "i3z0u7l",
            "score": 1,
            "text": "I had no idea about this book being so damning. Dear god, why are they teaching this in schools?!",
            "title_similarity": "0.38282382"
        },
        {
            "id": "i3z2tsd",
            "score": 1,
            "text": "isn't that a bit unfair?  of course german children and famalies knew about the holocaust.  and were a part of it.\n\nbut it's still a good story.",
            "title_similarity": "0.50618464"
        },
        {
            "id": "i3z49nh",
            "score": -1,
            "text": "it's all fantasy and fiction, folks. \n\nand if you say it aloud you lose your job.",
            "title_similarity": "0.2794529"
        },
        {
            "id": "i3z5p0c",
            "score": 1,
            "text": "They're probably just mad because the author is Irish.",
            "title_similarity": "0.23590732"
        },
        {
            "id": "i3za7l2",
            "score": 1,
            "text": "As someone who’s only seen the movie, and not read the books, what are the inaccuracies? \n\nIt’s been a while since i’ve seen the film, so some things are vague and some are easier to remember",
            "title_similarity": "0.36977357"
        },
        {
            "id": "i3zezoq",
            "score": 1,
            "text": "I am uneducated so I am sorry but can someone tell me why he set the education for the holocaust back with the book? Thanks!",
            "title_similarity": "0.5664931"
        },
        {
            "id": "i3zfept",
            "score": 1,
            "text": "I read this book but didn't remember the story very well, it just didn't do much for me. \n\nI know it's not the case of the book,  but I was under the impression that not all civilians were aware of the extent of the cruelty that was happening. In my understanding, there was a huge attempt from Nazi propaganda to hide the reality of the concentration camps from the population and minimize the atrocities in order to gain public sympathy. Am I wrong to think that?",
            "title_similarity": "0.3322751"
        },
        {
            "id": "i3zv0ur",
            "score": 1,
            "text": "They made me read this in public school in California and told me about zero of the inaccuracies this is the first time I'm hearing this",
            "title_similarity": "0.42847306"
        },
        {
            "id": "i4027tp",
            "score": 1,
            "text": "Skip this one and read his other book The Hearts Invisible Furies, it’s a masterpiece",
            "title_similarity": "0.43533826"
        },
        {
            "id": "i4079l0",
            "score": 1,
            "text": "you saw him in stripes...\n\nnow see him in a way you never have before\n\nThe Boy in the Flannel Pyjamas",
            "title_similarity": "0.5665469"
        },
        {
            "id": "i408lny",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.06327176"
        },
        {
            "id": "i40bf33",
            "score": -1,
            "text": "I'm not sure if I like this.",
            "title_similarity": "0.08835957"
        },
        {
            "id": "i40bm05",
            "score": -1,
            "text": "The man in the striped pyjamas?",
            "title_similarity": "0.34578863"
        },
        {
            "id": "i3wbxa9",
            "score": 341,
            "text": "Never read it. How is the book detrimental to learning?",
            "title_similarity": "0.28073457"
        },
        {
            "id": "i3wvqg3",
            "score": -8,
            "text": "What are the historical inaccuracies? To say it put “holocaust education back by decades” seems like abit of a stretch. We had to read this book for English class in the uk and It didn’t seem like an accurate depiction but it also didn’t seem like it was *that* far off.",
            "title_similarity": "0.6520578"
        },
        {
            "id": "i3wh9zq",
            "score": 7,
            "text": "I didn’t even manage to finish it, I could see how it was going to end within a few pages, I I checked I was right and didn’t bother",
            "title_similarity": "0.33809584"
        },
        {
            "id": "i3wusjp",
            "score": 2,
            "text": "I think 99.99999 percent of people who read this book or watched the movie had completely forgotten about it and moved on, even if they enjoyed it.",
            "title_similarity": "0.4550677"
        },
        {
            "id": "i3wv5sr",
            "score": 2,
            "text": "My intro to the holocaust was Schindlers List. My dads a cinephile & I watched it when I was pretty young. We read Night in English class, then watched The Pianist in high school. I always questioned people my age who raved about the boy in the striped pajamas because there’s such BETTER material out there.",
            "title_similarity": "0.62623096"
        },
        {
            "id": "i3wxmr1",
            "score": 2,
            "text": "Night was my first literary exposure to the Holocaust. I remember lots of crying.",
            "title_similarity": "0.540863"
        },
        {
            "id": "i3x1ckm",
            "score": -2,
            "text": "This book is NOT a historical education book! It's a kids' story. Parents and teachers should stop treating this book as such and then complaining about its historical inaccuracies. I first read this book in year 8 english lessons - not in history - and I loved it! And I, for one, can't wait for the sequel.",
            "title_similarity": "0.5385821"
        },
        {
            "id": "i3x9bio",
            "score": 2,
            "text": "I loved that book. Just going to say that. Never saw it as nonfiction. I bawled my eyes out.",
            "title_similarity": "0.43653658"
        },
        {
            "id": "i3xmsxc",
            "score": 2,
            "text": "My former GF's stepfather was \"heer\" (army) and wounded by bomb and ended up a guard.  His name was Karlheinz. \n\nKarlheinz came to the US, finished his PHD and taught, married my GF's mother,....\n\nHe was not shy about discussing his time in the Wehrmacht.  \n\nHis first guard duty was a camp of Red Triangles, then a camp of different color triangles.  He said there were several colored triangles for different types of prisoners.  I don't think this included POW.  I wish I had asked.\n\nHis final duty was a processing prisoners for transport: Yellow Stars.  \n\nHe took both on hands, looked into me in tears, and swore that he new they were Jews, but did not know what became of them.  He did not know they were being exterminated, and he did not know anyone who knew.  \n\nHe claims that had the Final Solution been known, the people would have revolted, just like they would in the US,... \n\nI reminded him of the Indian relocation and displacement programs in the US and he asked if it was common knowledge at the time.  It was Public Policy, submitted to congress, debated, voted upon and enforced by the President.\n\nAccording to him, jamming prisoners in boxcars was business as usual.  Russian prisoners were universally hated and abused ( he didn't like Russians ), but he claims everyone thought the Jews were being deported and those who were in the camps were either political prisoners, or being processed for deportation.",
            "title_similarity": "0.62504625"
        },
        {
            "id": "i3xuesd",
            "score": -2,
            "text": "What was so inaccurate about this book..it wasn't about pro Holocaust denial or sympathetic to the Nazis.  The idea that a Germani boy and a Jew boy could be friends because they didn't know or understand the hate the Nazis had against the Jews isn't a far-fetched reality of what was going on at the time.",
            "title_similarity": "0.387226"
        },
        {
            "id": "i3yav4s",
            "score": -2,
            "text": "It seems a bit narcissistic to assume OTHER PEOPLE are going to take this as a history lesson.\n\nIt's fiction, and anyone with half a brain should be able to make that distinction. Let the rest continue to be blissful in their ignorance and their wonderment at how awesome it was that Abraham Lincoln, America's 16th President, hunted vampires.",
            "title_similarity": "0.4527302"
        },
        {
            "id": "i3ycbbo",
            "score": -2,
            "text": "I doubt I can laugh as much as I did during the first one....",
            "title_similarity": "0.35439295"
        },
        {
            "id": "i3ycty7",
            "score": -2,
            "text": "I don’t know who this story is for . It’s too gruesome for children and adults know how it will end within a few pages . Can someone tell me who it is supposed to be geared toward? It’s been a long while since I read it but I remember being confused by that .",
            "title_similarity": "0.51774913"
        },
        {
            "id": "i3ydksl",
            "score": 2,
            "text": "The sequel: Going camping",
            "title_similarity": "0.39414966"
        },
        {
            "id": "i3yu3a6",
            "score": 2,
            "text": "I always thought this book was a good tool to teach younger people about the Holocaust but who tf would ever teach it without addressing the historical inaccuracies up front",
            "title_similarity": "0.52224"
        },
        {
            "id": "i403zra",
            "score": 2,
            "text": "I'd argue it didn't since a majority of people have never heard of the book.",
            "title_similarity": "0.2548723"
        },
        {
            "id": "i407xib",
            "score": -2,
            "text": "“Bald man complains about holocaust on twitter”\n\nIt’s a mediocre book get over it people.",
            "title_similarity": "0.3685392"
        },
        {
            "id": "i40apuc",
            "score": -2,
            "text": "We don't talk about Bruno, no no.",
            "title_similarity": "0.09064263"
        },
        {
            "id": "i40dq8y",
            "score": 2,
            "text": "We read the book AND watched the movie. It made me so uncomfortable with how they presented it especially after reading n at least two real accounts from the Holocaust AND hearing from someone that was in the Twin experiments,.",
            "title_similarity": "0.42477"
        },
        {
            "id": "i3wvgg4",
            "score": 57,
            "text": "Here in Ireland, John Boyne has devolved into something of a minor Jk Rowling figure. IE, espouses obnoxious and harmful rhetoric and then cries cancel culture despite still be able to land cushy book deals.",
            "title_similarity": "0.38593614"
        },
        {
            "id": "i3worqh",
            "score": 4,
            "text": "I hope the sequel is \"the man in the striped pyjamas\" and its Arnold Schwarzenegger playing an Austrian jew bent on revenge and just guns down half the nazi army commando style.",
            "title_similarity": "0.61067855"
        },
        {
            "id": "i3wxk3j",
            "score": 3,
            "text": "I don't often stop to say things like this, but for him I'll make an exception... Fuck Boyne, fuck his book, and fuck him again with a baseball bat for writing a sequel. What a piece of shit.",
            "title_similarity": "0.4711374"
        },
        {
            "id": "i3x6qyq",
            "score": 3,
            "text": "How can you have a sequel? The boy is dead.\n\nI know redditors read \"holocaust education set back decades\" and probably think he's a holocaust denier but the issue people have is that he has German people like the boy's mother and sister as basically being unaware that Nazis like their dad hated jews when historically we know they were saturated with propaganda and most supported Hitler in blaming the Jews for everything.\n\nHe isn't denying the holocaust, in fact he uses it to write of how a stupid (probably mentally challenged?) 9 year old german boy winning a Darwin award. Is the next book gonna take place in heaven/hell? What's so bad about his books is that he's removing culpability of the german people (much like how we ignore all the racist stuff FDR and his cronies did and the 'greatest generation' that mostly supported racial segregation and demonized minorities.)",
            "title_similarity": "0.65382874"
        },
        {
            "id": "i3xgksg",
            "score": 3,
            "text": "I haven't seen the movie, nor read the book, but wow. Just by the posts here and what I got from Wikipedia, this is crazy. The film received a lot of praise, and the book received mixed reviews. Was this just the result of a lazy writer, or is there a big agenda behind this reshaping of history?",
            "title_similarity": "0.41819608"
        },
        {
            "id": "i3xp2vl",
            "score": 3,
            "text": "The Sisterhood of the Travelling Pyjamas.",
            "title_similarity": "0.39834994"
        },
        {
            "id": "i3xpve2",
            "score": -4,
            "text": "Ma son and I were searching comedies on Netflix and came across this... did not expect him to be put to death.  #unexpected",
            "title_similarity": "0.42240894"
        },
        {
            "id": "i3y0rnc",
            "score": -2,
            "text": "“Something I don’t like! Quick! Destroy it!”\nThe irony.",
            "title_similarity": "0.19671899"
        },
        {
            "id": "i3ygcrh",
            "score": 3,
            "text": "Heard how antisemetic this book is, have absolutely no interest in reading the sequel.",
            "title_similarity": "0.22382566"
        },
        {
            "id": "i3yrefo",
            "score": 3,
            "text": "Damn, I had no idea until today that there was a problem with TBiSP. My school showed us the movie when we were learning about the holocaust.",
            "title_similarity": "0.58342147"
        },
        {
            "id": "i3z3gci",
            "score": 2,
            "text": "My mother in law loves the book so I read it. I thought it was absolute bullcrap. However, it seems to me that some of the criticism in the article is a bit over the top, as dumb as the book is. They take offence in the fact that the death of the Nazi commander's son is the big climax, claiming that it belittles the suffering of Jewish victims. But really in his childish way, the author wanted to create this (utterly, utterly predictable) epiphany where the nazi commander understands that he's murdering people's children and that he might be the baddie. I read ten pages and said \"yeah, the German boy is going to end up in the gas chamber and then this hack of an author is going to wank all over being M. Night Shamalayan\".  \nI understand that teachers are looking for a way to make pupils understand the holocaust on an emotional level but this book ain't it.",
            "title_similarity": "0.49893227"
        },
        {
            "id": "i406vex",
            "score": 3,
            "text": "I’ve never read the book or seen the movie. Can someone ELI5 what they got wrong that caused an uproar",
            "title_similarity": "0.3291939"
        },
        {
            "id": "i3wu0t2",
            "score": 209,
            "text": "I hate this book so much. \n\nIf you wanna read a good book from a German perspective go read Number the Stars. That's a good book. 1) The German children aren't oblivious idiots - they're not fully aware but they know their friends are being targeted and they are against it. 2) The German family actually risks their safety to help their Jewish neighbors. 3) It doesn't profit from tragedy - the Jewish family is able to escape. \n\nLois Lowry is my favorite author and I could remember distinctly pieces from Number the Stars well into adulthood. Why aren't we studying THAT book? Why did the absolute nonsense Boy in Striped Pyjamas get all this attention and curriculum when, amongst all the other shit it gets horribly wrong, it doesn't even understand German language? Hell it doesn't understand basic child development - the main character is ten and acts like he's six!\n\nEdit: My bad! The family was Danish! I mis-remembered that detail.",
            "title_similarity": "0.47308114"
        },
        {
            "id": "i3x2yyb",
            "score": 4,
            "text": "I fucking hate John Boyne. He's probably the closest a bestselling author can come to lolcow status. Everything he's ever churned out just reeks of smarmy ineptitude.",
            "title_similarity": "0.44190443"
        },
        {
            "id": "i3xeqve",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.06327176"
        },
        {
            "id": "i3ydrch",
            "score": -4,
            "text": "Well yeah, the book is fiction. The point isn’t historical accuracy, it’s to make young readers feel sympathy for the victims of the holocaust as well as the Germans who did not support it.",
            "title_similarity": "0.41926205"
        },
        {
            "id": "i3ym6w9",
            "score": 5,
            "text": "Granted the author is a jackass and has a lot of responsibility for the consequences of his story, but why the hell would a bunch of educators use a fiction book with such glaring issues to teach about the Holocaust? Apparently the educators don't understand enough about the Holocaust to teach about it, are incapable of an ounce of critical thinking, haven't read the book, or all of the above.",
            "title_similarity": "0.41622812"
        },
        {
            "id": "i3zmv82",
            "score": 4,
            "text": "Based on the quotes from those kids, I would guess that Nazi sympathizers are the ones teaching this material and that's why they choose this book.",
            "title_similarity": "0.48316625"
        },
        {
            "id": "i402nfh",
            "score": 4,
            "text": "I agree it's a bad thing to frame historically inaccurate fiction as truth. However, I don't agree with the article's implication that humanizing the Nazis is a bad thing. It's important that we understand that Nazis were people like us, and we too can easily be led to support monstrous evil. \n\nAlso I never got the sense that Bruno's death in the story was framed as if it somehow atoned for the Holocaust. I just thought it was for shock value. You're wondering if Shmuel will die or escape, and then they both die and you're not expecting it. Ouch. Plus what other people have said about the slaughter operation not being able to tell the Jew from the Gentile.",
            "title_similarity": "0.38636723"
        },
        {
            "id": "i40goz1",
            "score": 4,
            "text": "This book is sooo horrible. I hate that schools still teach it, I had to read this because of school. This book focuses too much on the struggles of Nazi's when it's perfectly clear jews have it harder. The \"alternate point of view\" thing doesn't and shouldn't work in this situation.",
            "title_similarity": "0.42659956"
        },
        {
            "id": "i3wjcbd",
            "score": 34,
            "text": "Whoa. I remember when people were praising this book to high heaven. What happened?",
            "title_similarity": "0.3858137"
        },
        {
            "id": "i3wk6ne",
            "score": 162,
            "text": "I will also say, the number of people in this thread who are reacting to this with semantics over the decades comment or that it shouldn't be a teaching tool are willfully missing that this book literally is being used as a teaching tool and that, yes, in fact, that should stop. There are people who are taught things through bad fictional lenses and then consider their knowledge to not only be correct, but nominally complete as far as curiosity is concerned, and they will never explore a topic again.\n\nNow, is the author at fault for how people use his book? No...unless he suggests that it's entirely accurate and a realistic fiction piece while doing the most bare bones of research himself and also, you know, actively feeding into dangerous misconceptions about a genocide. Then it becomes a bit of a problem. One that goes beyond him, sure, but still certainly one he's enabling.",
            "title_similarity": "0.5042918"
        },
        {
            "id": "i3wvewq",
            "score": 4,
            "text": "Holocaust exploitation is a special kind of sickening. Fuck people like him.",
            "title_similarity": "0.38271087"
        },
        {
            "id": "i3xuznd",
            "score": -6,
            "text": "“Set Holocaust education back by a decade”\n\nLol, what?! Ive never even seen this movie.",
            "title_similarity": "0.68307936"
        },
        {
            "id": "i407zbu",
            "score": 4,
            "text": "I was shown this movie in school and it seemed fine. We all knew it wasn't completely accurate or anything and it seemed like it was just trying to show the horrors of the holocaust in a way that little kids could understand.",
            "title_similarity": "0.42246032"
        },
        {
            "id": "i3wplkv",
            "score": 51,
            "text": "Read Night or Maus instead.",
            "title_similarity": "0.23834488"
        },
        {
            "id": "i3yv43d",
            "score": 35,
            "text": "> a 2009 study by the London Jewish Cultural Centre showed that 70% of readers thought it was based on a true story, and many even thought Bruno’s death ended the Holocaust. \n\nA real testament to how unfathomably stupid people really are.",
            "title_similarity": "0.53938174"
        },
        {
            "id": "i3wnafl",
            "score": 18,
            "text": "So glad I had the option to teach Maus at my middle school, instead of this book.",
            "title_similarity": "0.5057763"
        },
        {
            "id": "i3wx4ie",
            "score": 5,
            "text": "John Boyne is SUCH a hack. I recently read The Heart's Invisible Furies and was SO disappointed. I was actually stunned to learn that Boyne is gay, because the novel shows NO introspection about what the queer experience is like, despite having a gay main character. All of his characters are cardboard cutouts.",
            "title_similarity": "0.43057382"
        },
        {
            "id": "i401drk",
            "score": 6,
            "text": "Okay, I'll bite. How exactly did this book \"set Holocaust education back by decades\"?",
            "title_similarity": "0.8089198"
        },
        {
            "id": "i3wtm3q",
            "score": 203,
            "text": "The Boy In The Striped Pyjamas 2: Electric Boogalo",
            "title_similarity": "0.43579912"
        },
        {
            "id": "i3wz92o",
            "score": 27,
            "text": "I remember reading this in fifth grade and being so pissed off that my teacher made us write a “new, happy” ending for the book. Like… me as a 10 year old thought that was so uncomfortable and wrong, come on\n\nThank god my eighth grade teacher made us read and watch a bunch of interviews and Anne Frank works. Still uncomfortable, but in a way it *should* be",
            "title_similarity": "0.6010498"
        },
        {
            "id": "i3y0q1j",
            "score": 27,
            "text": "The Boy In The Striped Pyjamas is Holocaust fanfic",
            "title_similarity": "0.6653092"
        },
        {
            "id": "i3xpf6y",
            "score": 10,
            "text": ">...the most widely read book about the Holocaust among students aged 12-18, surpassing Anne Frank’s Diary (by a shocking 59.1%) and even history textbooks.\n\nWow. I had never heard of this book before and it is kind of shocking how predominant it remains in curriculums.\n\nI find myself thankful for my teachers. We had a whole unit on the Holocaust in the 8th grade. We had a summary pulled from a textbook. We viewed numerous historical photos of the camps, the mass graves, the victims, and the perpetrators. We also read *The Diary of Anne Frank*, *Night*, and watched *Schindler's List*. Most importantly we had a survivor of Auschwitz come and speak to our class in person about his experiences. He apparently had never done much public speaking about it and was a patient of one of my classmate's parents. I was in the front row and he made eye contact with me for much of his talk, in the way that people do when they feel anxious about the size of the crowd they are speaking to. Needless to say it had a profound impact on me and remains with me to this day.\n\nMeanwhile, many children are starting off with this book, coming away with these kinds of impressions:\n\n>“We always think of the Nazis as the bad guys and this shows that the Holocaust didn’t just affect the Jews (…) but the problems that Nazi families might encounter and what their problems were,” said Dan, a year 9 student. “It is too easy to feel sorry for the Jews (…), I don’t mean that in a rude way, it is just like, everyone is always (…) going to sympathize with the Jews (…) when you see it from like Bruno or the mother’s perspective it seems a bit different because they had to live with that,” said Jack, year 12. The most egregious quote though is “they (the Nazis) couldn’t do anything about it because they (…) basically got killed off if they didn’t do what he (Hitler) said (…) it doesn’t matter who was the bigger victim, they (Nazis and Jews) were all still victims of Hitler’s control in some shape or form,” from Erica, year 11.\n\nEducation matters. Historical accuracy matters. These impressions will likely stay with these children for the rest of their lives.",
            "title_similarity": "0.62590003"
        },
        {
            "id": "i3wmfmd",
            "score": 669,
            "text": "A student asked me if I show this movie in class and I emphatically said no and then went into the list of reasons why I don’t show this movie because of the historical inaccuracies and such. \n\nWell I’ve had this sort of talk for years, but this year didn’t expect a kid to decide to try and use my refusal to show this movie against me haha. The kid in question was upset I was discussing how slavery was bad, I read his official complaint this was the reason, but when he couldn’t get me in trouble for “anti-white racism,” he started spreading rumors I was a Holocaust denier by referencing my distaste for this book and movie. Thankfully admin and the students knew me and how insane of an accusation that was and had my back, but not looking forward to the future of education.\n\nAll that to say, don’t waste your time with this book. If you want to read a story designed to make you sad and such then sure this story will make you sad but don’t try and view it as something historical. If you want a (reasonably) historical book on the Holocaust read “Night.”",
            "title_similarity": "0.47715747"
        },
        {
            "id": "i3x0zru",
            "score": 10,
            "text": "THANK YOU!! I have been saying this for so long and got downvoted to hell in r/films. Ridiculous book.",
            "title_similarity": "0.5397458"
        },
        {
            "id": "i3ymmlf",
            "score": 10,
            "text": "Everything I’ve seen of this author is so unbelievably bad. The man is a hack, plain and simple.",
            "title_similarity": "0.23988548"
        },
        {
            "id": "i3wkt1x",
            "score": 464,
            "text": "I haven't read the book, just seen the movie. It has always seemed to me a film without morals, there is no redemption, the Nazis do not understand that what they do is wrong, they are only destroyed by the loss of their own child. The whole story felt like a \"Ha ha, you lost a child too, you deserved it!\"",
            "title_similarity": "0.38723496"
        },
        {
            "id": "i3wll4l",
            "score": 110,
            "text": "My school assigned us The Diary of Anne Frank. To me that makes much more sense if you want children to read about the subject.",
            "title_similarity": "0.48307535"
        },
        {
            "id": "i3wb9a5",
            "score": 349,
            "text": "I had to read that for a graduate Children's Lit class and felt like throwing it across the room. It's insipid.",
            "title_similarity": "0.54620236"
        },
        {
            "id": "i3x49un",
            "score": 40,
            "text": "I don't understand why a work of fiction would be used to teach kids about WWII...why not use Anne Frank's diary? Or textbooks? Works Of fiction should be recommended by teachers, but not used to teach real events as complex and as delicate as the Holocaust.",
            "title_similarity": "0.45850664"
        },
        {
            "id": "i3ws7ng",
            "score": 24,
            "text": "2 Stripped 2 Pajamas",
            "title_similarity": "0.23488253"
        },
        {
            "id": "i3yifvt",
            "score": 26,
            "text": "I hated this book, purely for it's last few sentences. I can't quote verbatim, but it said \"these type of things never happen anymore\", referring to the Holocaust. Which, once I learned of all of the genocides since, has infuriated me.",
            "title_similarity": "0.45042014"
        },
        {
            "id": "i3x1pha",
            "score": 32,
            "text": "Why would a historical fiction be used in education? Just finished reading \"A Gentleman in Moscow\", and while I enjoyed it, it shouldn't be used to teach Russian and Soviet history. I don't know much about the author, but I'd blame educators if they think this is the book for teaching about the holocaust.",
            "title_similarity": "0.4838282"
        },
        {
            "id": "i3wpz0n",
            "score": 377,
            "text": "One of these days I’m going to snap and start a “Stop Giving Unnecessary Sequels to Self-Contained Pieces of Media” Kickstarter or something.",
            "title_similarity": "0.5139373"
        },
        {
            "id": "i3wg76r",
            "score": 1491,
            "text": "Tattooist of Auschwitz is similar trash. Always a minor red flag to me when someone breathlessly recommends these books to me.",
            "title_similarity": "0.48919505"
        },
        {
            "id": "i3x5jl6",
            "score": 1024,
            "text": "Ihm from Germany and have a degree in history. I'm pursuing a master of education right now to teach history at high school level. I clicked and I was like \"huh what are they talking about. Yeah, the story is unrealistic but whatever, everybody knows it's just a story\" and then I read the article. I had no idea what batshit crazy ideas people got from this book in other countries lol. The movie (not so much the book) is decently popular here, but man: using the book to teach about the Shoa?! That's nuts. I mean how can you have a degree in history AND education and then...throw it out of the window to use a FICTIONAL DRAMA to teach history?! A Geschichtserzählung (history story telling) can, according to Prof. Dr. Sauer (he's the best known expert on history didactics in Germany), ease kids into a topic at the introductory stage of a lesson but should NEVER be used beyond that. Especially not as a Quelle (source) or replacement for legit secondary accounts (Darstellungstexte) and definitely also not to formulate any kind of judgement, neither on the topic within the frame of its historical context nor against today's moral values (Such- und Werturteil). \n\nThis is gonna get buried but wow did that article open up my eyes regarding how the Shoa is taught outside of Germany. If you get a teaching degree in history here, this is the most important topic, basically. There is tons of research on how this topic can be taught in the most effective way etc.",
            "title_similarity": "0.56849605"
        },
        {
            "id": "i3wsesd",
            "score": 205,
            "text": "I’m definitely biased because I don’t read much fiction and have read plenty of non-fiction books from the period but perhaps we should be using non-fiction books for historical education purposes.\n\nThe Choice by Edith Eva Eger is very underrated as a Holocaust book.  I think had it been written earlier it would be one of THE books on the Holocaust.  It takes you through a real story much like a fiction book would except it’s all real and the author, who survived the Holocaust as a child also discusses life after the event and the book is filled with wisdom and life lessons.  Fantastic read for a students imo.",
            "title_similarity": "0.5521565"
        },
        {
            "id": "i3wh3y9",
            "score": 140,
            "text": "If you want true holocaust education from media, you should see War And Remembrance, Ep II. One of the most painful and hardest things ever shown on TV. No sugarcoating there.",
            "title_similarity": "0.5131303"
        },
        {
            "id": "i3wgzmu",
            "score": 5406,
            "text": "The Book Thief is a MUCH better book that addresses the same subject and has literary merit.",
            "title_similarity": "0.26487195"
        },
        {
            "id": "i3wici2",
            "score": 1404,
            "text": "i was surprised at how horrified i was after reading Maus but then i realized it’s because most of the books i read in school about it write from the German perspective, including this and the Book Thief",
            "title_similarity": "0.4611874"
        },
        {
            "id": "i3wiatd",
            "score": 4477,
            "text": "I‘m German and we also read the book, but our history teacher told us about the mentioned inaccuracies of the book. Also WW2 and especially the Holocaust are a major topic in German education, an entire year of history class is completely dedicated to the time period.",
            "title_similarity": "0.5895244"
        },
        {
            "id": "i3wqwxj",
            "score": 4242,
            "text": "> a 2009 study by the London Jewish Cultural Centre showed that 70% of readers thought it was based on a true story, and many even thought Bruno’s death ended the Holocaust.\n\nFuck me I mean the book is bad but believing that the death of a single child stopped the murder of millions of *people*, including disabled, gays, Slavic and Jewish people, is insane.",
            "title_similarity": "0.55117893"
        },
        {
            "id": "i3wj9th",
            "score": 13510,
            "text": "A good a time as any to bring up that this writer also copy pasted a recipe from Breath of the Wild in a section of a book explaining the manufacture of dyes. So we get sentences saying to use oktorok eyeballs and literal sapphires in the creation of red and blue dye respectively. He's not known for doing an iota of research.",
            "title_similarity": "0.50206184"
        },
        {
            "id": "i3wijrm",
            "score": 1,
            "text": "That jew boy could’ve easily expressed how shit it was in there to that other boy but instead he let the deceit and confusion play out so he could lead that child to death.",
            "title_similarity": "0.4450884"
        },
        {
            "id": "i3wn3i2",
            "score": 1,
            "text": " I’ve never read a holocaust book like “Night” that book messed me up for while.",
            "title_similarity": "0.44210032"
        },
        {
            "id": "i3wrrmd",
            "score": 1,
            "text": "Friends, he wrote a book about a boy who becomes best buddies with Hitler (The Boy at the Top of the Mountain).\n\n&#x200B;\n\nWhich will no doubt be lapped up.",
            "title_similarity": "0.6485537"
        },
        {
            "id": "i3wvhge",
            "score": 1,
            "text": "Should be telling that until this point I had an impression that this was something good and I should read / watch it. \n\nIt’s been on my list since the movie came out but I never went for it. \n\nI had missed all the controversy all these years",
            "title_similarity": "0.50966626"
        },
        {
            "id": "i3wvzbn",
            "score": 1,
            "text": "This movie has become a standard the show for 5th-6th graders where I live.",
            "title_similarity": "0.3931439"
        },
        {
            "id": "i3wwlry",
            "score": 2,
            "text": "I never realized this was a book in curriculums. When I went through school I remember that we read Night, Eva's story, and Anne Frank's diary.  but everyone seemed pretty clear that Boy in striped pajamas was not remotely close to the same thing.",
            "title_similarity": "0.50435936"
        },
        {
            "id": "i3wwr8a",
            "score": 1,
            "text": "The real life equivalent of how “African Child” was the worst thing to come out of Africa since apartheid. (I’m referencing the movie *Get Him to the Greek.*)",
            "title_similarity": "0.47208834"
        },
        {
            "id": "i3wxa3t",
            "score": 1,
            "text": "I liked the movie. I had no idea the book was so... hilariously bad.",
            "title_similarity": "0.3303666"
        },
        {
            "id": "i3wxyxt",
            "score": 5,
            "text": "Horrible book. Can't understand why it's so well known...",
            "title_similarity": "0.27594241"
        },
        {
            "id": "i3wyene",
            "score": 1,
            "text": "I had no idea of the background of this book, I always remember my A Level English teacher tell us how great the book was. Thanks for sharing this article",
            "title_similarity": "0.49707446"
        },
        {
            "id": "i3wyhb5",
            "score": 1,
            "text": "regardless of the other points of the book. a SEQUAL to a holocaust book? a SEQUAL\n\n&#x200B;\n\nBrunos BACK. and this time...its personal",
            "title_similarity": "0.5784705"
        },
        {
            "id": "i3wyogn",
            "score": 3,
            "text": "There are so many outrageous holocaust books. look up For Such a Time by Kate Breslin",
            "title_similarity": "0.49383417"
        },
        {
            "id": "i3wzrnk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06327176"
        },
        {
            "id": "i3x0bh2",
            "score": 3,
            "text": "I hated the movie, so glad this is getting attention",
            "title_similarity": "0.31703502"
        },
        {
            "id": "i3x0if3",
            "score": 6,
            "text": "“I have lived a thousand years” is absolutely incredible. Vladka Meed’s “on both sides of the wall” is fantastic too. \nTBITSP is utter trash. What a slap in the face to actual survivors.",
            "title_similarity": "0.5055231"
        },
        {
            "id": "i3x197o",
            "score": 6,
            "text": "I was tutoring a high school kid several years ago who had to read this and I spent the whole time explaining everything that was incorrect about it. \n\nThe worst trash I’ve ever had to read.",
            "title_similarity": "0.61162955"
        },
        {
            "id": "i3x1luc",
            "score": 1,
            "text": "Hitler 2? PogU",
            "title_similarity": "0.43302393"
        },
        {
            "id": "i3x4zlh",
            "score": 1,
            "text": "I never took this book/movie as fact but I'm also a history nerd for WW2 and The Holocaust. \nI even had discussed it with my kids who share an interest in that period in history that it wasn't factual.",
            "title_similarity": "0.5318128"
        },
        {
            "id": "i3x5axh",
            "score": 3,
            "text": "My introduction to the Holocaust was The Diary of Anne Frank and The Devil's Arithmetic. A few years later I had to watch Schindler's List.",
            "title_similarity": "0.65175325"
        },
        {
            "id": "i3x5h4q",
            "score": 1,
            "text": "e better movie is Europa, Europa..I think it's based on a book",
            "title_similarity": "0.48850843"
        },
        {
            "id": "i3x5uia",
            "score": 1,
            "text": "Has anyone listened to the podcast \"On Auschwitz\"? Episode 3 talks about problematic literature and they mention the problems with books like this. Very interesting stuff.",
            "title_similarity": "0.45257962"
        },
        {
            "id": "i3x5ygu",
            "score": 2,
            "text": "Loved the movie (loved seems like a terrible descriptive word given the context)but yeah it really doesn’t comport with reality, the book even less so. There’s plenty of actual Jewish literature and media on the subject (Schindlers list, book thief etc) that a sequel isn’t remotely needed",
            "title_similarity": "0.3570735"
        },
        {
            "id": "i3x671w",
            "score": 3,
            "text": "The Man Who Broke into Auschwitz is a great book about what it was like",
            "title_similarity": "0.5147143"
        },
        {
            "id": "i3x7ho8",
            "score": 64,
            "text": "When I was in middle school (Italy) my Italian teacher made us read many books about WW2, the ones I remember are: Anne Frank's Diary, \"If this is a man\" by Primo Levi, \"Reunion\" by Ulman and \"And Agnese chose to die\" by Agnese Viganò. I saw The boy in the striped pyjamas during class in high school, I didn't even know it was based on a book until now lol but, fortunately, I never thought it was an accurate depiction. I think it's strange that teachers tell kids to read this book instead of Anne Frank's diary.",
            "title_similarity": "0.6066716"
        },
        {
            "id": "i3x88a4",
            "score": 1,
            "text": "Mind if I ask whats wrong with the book? I’ve heard of it but haven’t seen the movie or read it. I didn’t realize it was so inaccurate.",
            "title_similarity": "0.3363638"
        },
        {
            "id": "i3x8r2i",
            "score": 1,
            "text": "I urge you all to read 'The Volunteer' by Jack Fairweather detailing the life of Witold Pilecki. It's an extraordinary book, and it reads like fiction although being a piece of non-fiction.",
            "title_similarity": "0.44379967"
        },
        {
            "id": "i3x8zq7",
            "score": 11,
            "text": "So in high school when I was a sophomore our world history teacher Coach Parkey kind of got fed up with the fact that he was supposed to teach the holocaust by having a bunch of 15 and 16-year-olds read a book and watch a movie designed for elementary schoolers that was completely inaccurate . So we completely skiped that book and he actually taught us the real history and the day we were supposed to watch the movie we watched Schindler’s list parents complained not because of the holocaust or anything but because there was some nudity in the movie. Things got pretty heated with some parents even saying that he should go to jail for showing “pornography” to children and he just said screw it I’m going to resign. thing is he was the head football coach and the team was on their way to win the state championship and that was way more important to the higher ups at the school so everything was resolved as long as he held his hand over the projector whenever there was an nude scean.",
            "title_similarity": "0.56679475"
        },
        {
            "id": "i3xajko",
            "score": 1,
            "text": "The Devil's Arithmetic is what I remember reading in elementary school. just saw that apparently they made a movie of it back in 1999 with Kristen Dunst.",
            "title_similarity": "0.53444344"
        },
        {
            "id": "i3xb0z1",
            "score": 5,
            "text": "I won't read or watch the movie, it's clearly meant to just be emotional torture porn.",
            "title_similarity": "0.17701097"
        },
        {
            "id": "i3xbs5r",
            "score": 2,
            "text": "Everyone I know who saw the movie said it was really good, this is a really interesting take to learn about now",
            "title_similarity": "0.2781753"
        },
        {
            "id": "i3xc4uq",
            "score": 5,
            "text": "This and the Tatooist from Aushwitz ain't got nothing on Polish Holocaust literature. I had nightmares after reading it. Here are some titles in case someone gets interested:\n\n- Medallions - Zofia Nałkowska\n- This Way for the Gas, Ladies and Gentlemen - Tadeusz Borowski\n\n\nSome of the most disturbing readings of my life. I had those books on my literature classes and I can assure I had problems for a few days after reading them. They were certainly eye-opening too.",
            "title_similarity": "0.5474583"
        },
        {
            "id": "i3xc965",
            "score": 1,
            "text": "Prisoner B-3087. Read that instead.",
            "title_similarity": "0.35233125"
        },
        {
            "id": "i3xc9er",
            "score": 3,
            "text": "this book is as historically accurate as Hogan's Heroes",
            "title_similarity": "0.2628535"
        },
        {
            "id": "i3xcs7w",
            "score": 2,
            "text": "Back when Netflix dvd rentals were a thing... I got this instead of whatever it was I had rented once.",
            "title_similarity": "0.40366733"
        },
        {
            "id": "i3xcyhq",
            "score": 1,
            "text": "Currently reading “People Love Dead Jews” by Dara Horn, which is unrelentingly critical of this type of “literature.” I cannot recommend her book highly enough!",
            "title_similarity": "0.36494827"
        },
        {
            "id": "i3xe0j7",
            "score": 1,
            "text": "Wonder if there will be a movie too?",
            "title_similarity": "0.23090428"
        },
        {
            "id": "i3xe3wz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06327176"
        },
        {
            "id": "i3xebfv",
            "score": 1,
            "text": "Can someone explain to me why it set holocaust education back? I'm not really from the US so think the holocaust is treated differently down here.",
            "title_similarity": "0.5114389"
        },
        {
            "id": "i3xf0yq",
            "score": 2,
            "text": "I’ve only ever seen the film but what did this book do to set back education of the Holocaust?",
            "title_similarity": "0.5494152"
        },
        {
            "id": "i3xjvsz",
            "score": 8,
            "text": "I think the greatest books/movies about the holocaust are first-hand accounts. \n\nThe Pianist (2003) is an incredible movie. Schindler list as well.\n\nAnd in terms of books, I think Primo levi's book \"If this is a man\" is a masterpiece, same for \"Night\" by Elie Wiesel, they are though, in my memory, very dark.\n\nI really liked \"You've got to tell them\" by Ida Grinspan. It's originally in french and probably hard to find in english but it's a \"hopefull\" testimony of the holocaust, she describe things how it was and how she experienced them (And she was 14 when she was deported to Auschwitz...) but she also talks about the solidarity amongs prisonners, how they lift each others spirits to survive, how they physically helped each other to walk during the evacuations of the camps and how she managed to rebuild her life after her deportation and the destruction of her family.",
            "title_similarity": "0.52240586"
        },
        {
            "id": "i3xjx76",
            "score": 1,
            "text": "Is the movie as inaccurate as the book?",
            "title_similarity": "0.31760436"
        },
        {
            "id": "i3xkyrt",
            "score": 1,
            "text": "who is publishing this trash?",
            "title_similarity": "0.15831593"
        },
        {
            "id": "i3xlqjn",
            "score": 1,
            "text": "I really liked the story but yeah I could understand that the inaccuracies and misinterpreting this as a true story is harmful",
            "title_similarity": "0.16841403"
        },
        {
            "id": "i3xlwes",
            "score": 1,
            "text": "I remember this guy giving a writing lecture as an introduction when the writing program I attended started (the first day) and he was a nervous mess, stuttering and sweating while reading a few pages of paper. More proof the program was a crock of shite.",
            "title_similarity": "0.54395425"
        },
        {
            "id": "i3xm1ml",
            "score": 1,
            "text": "This John Boyne sounds like a real knucklehead",
            "title_similarity": "0.33501402"
        },
        {
            "id": "i3xmxaw",
            "score": 3,
            "text": "“Night” was a wonderful book, glad that was what I was given in Hs",
            "title_similarity": "0.28967676"
        },
        {
            "id": "i3xp4bb",
            "score": 2,
            "text": "Unironically, teaching Jojo Rabbit would be far more helpful.",
            "title_similarity": "0.3421173"
        },
        {
            "id": "i3xpdd3",
            "score": 5,
            "text": "Well that is a seriously fucked up narrative, but a concise lesson on how we need to guard our history from those that would corrupt it",
            "title_similarity": "0.2748404"
        },
        {
            "id": "i3xpw4m",
            "score": 2,
            "text": "In our school we read this in English Lit not History. Tf are some schools doing using fictional books in History lessons",
            "title_similarity": "0.45543325"
        },
        {
            "id": "i3xs4fr",
            "score": 1,
            "text": "I hear this all the time.",
            "title_similarity": "0.17772782"
        },
        {
            "id": "i3xs6f7",
            "score": 3,
            "text": "If anyone is looking for an actual, legitimate account of the Holocaust, Elie Wiesel’s *Night* is a soul crushing masterpiece.",
            "title_similarity": "0.45743415"
        },
        {
            "id": "i3xtabt",
            "score": 3,
            "text": "Night by Elie Wiesel, always the better choice",
            "title_similarity": "0.34776223"
        },
        {
            "id": "i3xtahp",
            "score": 4,
            "text": "Maus gets banned but this bullshit gets a sequel.",
            "title_similarity": "0.42791843"
        },
        {
            "id": "i3xtg29",
            "score": 3,
            "text": "Please tell me Number the Stars is not as bad. I loved that book as a kid",
            "title_similarity": "0.3568134"
        },
        {
            "id": "i3xuify",
            "score": 3,
            "text": "I loathe *The Boy in the Striped Pajamas*. I have no familial connection to the Holocaust, nor I am Jewish, nor a member of any of the other ethnic groups, but I was furious at its depiction in the book.\n\nI get in historical fiction some things must be changed to have a better narrative. But there are so many inaccuracies, it’s almost a masterpiece in how NOT to do historical fiction. Combine with the sloppy treatment, it’s just a horrible read.",
            "title_similarity": "0.3912266"
        },
        {
            "id": "i3xvq93",
            "score": 2,
            "text": "We had to read this in our Holocaust unit in middle school. Luckily, I had already read a ton of Holocaust books from the Jewish perspective in elementary school like Hana’s Suitcase and Daniel’s Story. They started our education early.",
            "title_similarity": "0.66548693"
        },
        {
            "id": "i3xvt5z",
            "score": 3,
            "text": "Boyne was a guest instructor for the fiction writing cohort while I was in grad school. He looooved his little fan club of students. I was in the creative nonfiction cohort where I was introduced to the work of Primo Levi. I think I got the better deal.",
            "title_similarity": "0.58076537"
        },
        {
            "id": "i3xwkhu",
            "score": 5,
            "text": "*screams in historian*",
            "title_similarity": "0.2960524"
        },
        {
            "id": "i3xwpsh",
            "score": 1,
            "text": "Can’t lie, the movie they made out of it was hilarious",
            "title_similarity": "0.25994915"
        },
        {
            "id": "i3xy76o",
            "score": 1,
            "text": "The boy in the striped pajamas 2 Electric Boogaloo",
            "title_similarity": "0.35458553"
        },
        {
            "id": "i3xyluj",
            "score": 3,
            "text": "Can I get a literal tldr on the book in the context of why it's so bad for Holocaust education because I have never read the book",
            "title_similarity": "0.48813003"
        },
        {
            "id": "i3y0new",
            "score": 2,
            "text": "This is something that I'd expect to appear as a fictional easter egg in some parody movie or a(n old) Simpsons episode.",
            "title_similarity": "0.5250397"
        },
        {
            "id": "i3y1k4x",
            "score": 1,
            "text": "I watched that movie like only twice and I didn't really analyze it just saw it as a sad movie about the holocaust didn't know until now there was a controversy surrounding it or that it was problematic.",
            "title_similarity": "0.41733408"
        },
        {
            "id": "i3y2mau",
            "score": 2,
            "text": "Same as that tattooist of auchwitz",
            "title_similarity": "0.28481686"
        },
        {
            "id": "i3y30cq",
            "score": 3,
            "text": "We watched the movie in high school, the end of my sophomore year (spring 2009). I liked it, but my teacher also made it a point to say it was not based on a real story or anything. I never knew people actually thought this was a real story, let alone based teachings around it as fact.  Big yikes.",
            "title_similarity": "0.50847596"
        },
        {
            "id": "i3y3nmm",
            "score": 1,
            "text": "I read this book as a kid and honestly haven’t thought about it at all since, but actually yeah it is super weird",
            "title_similarity": "0.36946782"
        },
        {
            "id": "i3y4xfc",
            "score": 2,
            "text": ">Nazi redemption arc\n\nAlso, the assertion that the reader was made to feel sorry for Bruno and Shmuel didn't matter to the reader.\n\nIm sorry what?? I'm sure there is a lot of room for criticism based on the inaccuracies on the book, but jfc some of these accusations seem completely unfounded.",
            "title_similarity": "0.32419583"
        },
        {
            "id": "i3y58c8",
            "score": 3,
            "text": "I'm confused why anyone would use this book as a learning resource. It's clearly a fictional tale, but anything even potentially educational could be found in more and better detail almost anywhere else.",
            "title_similarity": "0.34887248"
        },
        {
            "id": "i3y5o1y",
            "score": 5,
            "text": "So badly written. The most cliché, one dimensional, hateable Nazi characters. They weren't written like real people, they were written like the bad guys in a wrestling plot. \n\nNot saying Nazis are great people, but they are at least people, with unique thoughts and personalities. Couldn't get more than halfway through this drivel for morons.",
            "title_similarity": "0.3622436"
        },
        {
            "id": "i3y6kre",
            "score": 1,
            "text": "I haven't read the book, now I never will, and the wikipedia synopsis (of the movie) pisses me off.... \n\nBut how are you doing a sequel to this piece of shit?",
            "title_similarity": "0.4061145"
        },
        {
            "id": "i3y7vp0",
            "score": 5,
            "text": "I wasn't aware of the problems with that book, thanks for posting this.",
            "title_similarity": "0.22320624"
        },
        {
            "id": "i3y8krj",
            "score": 3,
            "text": "Read Maus instead.. and then read it again.",
            "title_similarity": "0.42386872"
        },
        {
            "id": "i3y9alv",
            "score": 1,
            "text": "Damn, this sucks.",
            "title_similarity": "0.05164621"
        },
        {
            "id": "i3y9bnr",
            "score": 1,
            "text": "I guarantee this won't make anyone's award list.  Young people today have zero connection with the atrocities of yesteryear as they watch Russia do the same thing to Ukrainians.",
            "title_similarity": "0.31077263"
        },
        {
            "id": "i3y9g1c",
            "score": 2,
            "text": "This is why JoJo Rabbit is the best film to understand the level of brainwashing the youth had.",
            "title_similarity": "0.40952575"
        },
        {
            "id": "i3y9l7c",
            "score": 5,
            "text": "I don’t know about this book, but my teacher taught Maus in the classroom and it was an amazing read.",
            "title_similarity": "0.38595957"
        },
        {
            "id": "i3ya22v",
            "score": 5,
            "text": "The fact that English teachers use this book as an instructional aide is a scathing indictment on the state of modern public education. The article breaks the book down in a way that any English 101 university student could reasonably be expected to interpret the text, and yet even this basic level of comprehension hasn't been displayed.",
            "title_similarity": "0.39890414"
        },
        {
            "id": "i3yatrs",
            "score": 7,
            "text": "This book is awful.  I did it with my 9th grade students last year.  It went on forever with a very simple plot line,  no character development, and errors all through it.  Students had zero empathetic connection with the Boy because it was so weakly written.  Learning that this “author” basically cut and paste it with no research isn’t shocking.  \nWhat is shocking is taking a  complex historical event and minimizing it into virtually nothing.",
            "title_similarity": "0.47932875"
        },
        {
            "id": "i3ybat0",
            "score": 6,
            "text": "I hated the movie and have no desire to read the book. All I could think of was why was this made. There are so many true stories from the Holocaust and WW2 that are amazing that why would someone invent such a crappy story",
            "title_similarity": "0.39657384"
        },
        {
            "id": "i3ybjho",
            "score": 7,
            "text": "Read it a few years ago and could not believe how it trivialised things, and simply got things wrong. \n\nImmediately googled it and read about how it had made a Rabbi cry. \n\nIt's an awful, awful book. It should be proscribed. Boyne needs a Will Smith slap x1000 to get him to realise the damage he's done.",
            "title_similarity": "0.55586827"
        },
        {
            "id": "i3ybt5l",
            "score": 1,
            "text": "I mean this in the most serious way possible:\nI wonder if he survived and if he didn’t how his family would have reacted when they realized what happened",
            "title_similarity": "0.45236897"
        },
        {
            "id": "i3yc2nq",
            "score": 1,
            "text": "I remember how much i cried while watching it",
            "title_similarity": "0.23755163"
        },
        {
            "id": "i3yd92h",
            "score": 1,
            "text": "At least Alex Haley made a better job of it for Roots!",
            "title_similarity": "0.37135482"
        },
        {
            "id": "i3yee4o",
            "score": 3,
            "text": "For those wanting to understand a bit better the problems with this work of fiction there is a great piece [here](https://holocaustlearning.org.uk/latest/the-problem-with-the-boy-in-the-striped-pyjamas/)",
            "title_similarity": "0.55043024"
        },
        {
            "id": "i3yemuu",
            "score": 3,
            "text": "I had no idea this book was so popular or widespread. Maybe I was never exposed to it because it was too new when I was in school, but going over the plot synopsis…yeah. That’s a bucket of tone deaf yikes.",
            "title_similarity": "0.530601"
        },
        {
            "id": "i3yfk52",
            "score": 3,
            "text": "If you want a goof holocaust book read Night.",
            "title_similarity": "0.43360156"
        },
        {
            "id": "i3yg5r4",
            "score": 6,
            "text": "I fucking hated that book because it was so inaccurate. 🤦‍♀️\nI’m Jewish and have taught about the Holocaust before. You wouldn’t believe how often I had to explain why the book was inaccurate.",
            "title_similarity": "0.4893658"
        },
        {
            "id": "i3yg910",
            "score": 3,
            "text": "How is a book like that even getting a sequel? It's self contained.",
            "title_similarity": "0.3341752"
        },
        {
            "id": "i3yht99",
            "score": 1,
            "text": "Every man dies alone",
            "title_similarity": "0.24721485"
        },
        {
            "id": "i3yjo8j",
            "score": 5,
            "text": "This was on our school curriculum in Ireland when I was 13. We all slated the book to our teacher. Besides from being unrealistic historically, we all thought it was unrealistic that a 9 year old could be that naive.",
            "title_similarity": "0.49789956"
        },
        {
            "id": "i3yl530",
            "score": 11,
            "text": ">Boyne protests that his work is “just a fable,” but this doesn’t detract from the views of children after reading the book, many of which are quoted in the study mentioned above. “We always think of the Nazis as the bad guys and this shows that the Holocaust didn’t just affect the Jews (…) but the problems that Nazi families might encounter and what their problems were,” said Dan, a year 9 student. “It is too easy to feel sorry for the Jews (…), I don’t mean that in a rude way, it is just like, everyone is always (…) going to sympathize with the Jews (…) when you see it from like Bruno or the mother’s perspective it seems a bit different because they had to live with that,” said Jack, year 12. The most egregious quote though is “they (the Nazis) couldn’t do anything about it because they (…) basically got killed off if they didn’t do what he (Hitler) said (…) it doesn’t matter who was the bigger victim, they (Nazis and Jews) were all still victims of Hitler’s control in some shape or form,” from Erica, year 11.\n\nWow. This book is nuts. Imagine how these kids would have reacted if they had known 99% of the population hated the Jews. Definitely think if they use this book as a teaching tool at all that it be taught in context. It would make a good lesson, \"Why this book is total bullshit.\"",
            "title_similarity": "0.49398082"
        },
        {
            "id": "i3yl5a6",
            "score": 6,
            "text": "In case anyone doesn't believe people would really think it's a real story, when I was a kid and interested in dinosaurs my dad, 30+, genuinely believed they had coexisted with humans, and he's by no means an idiot. I also vividly remember at fourteen having to tell a girl, who'd shared about 70% of all my lessons since age eight, the difference between countries and continents and which Africa was. Other people were surprised I was so amazed she didn't know.",
            "title_similarity": "0.5077636"
        },
        {
            "id": "i3ypuno",
            "score": 4,
            "text": "I mean for me the book was kinda meh as far as it was written - however whatever versions they had at my high school had one blaring problem. \n\nThe cover showed a picture of the purple triangle - the patch used for Jehovah's witnesses. \n\nAs far as I know the child in the book in the camp is supposed to be Jewish - and they wore the star of David.\n\nIdk for a book that's supposed to be based in history that just irked me.",
            "title_similarity": "0.57306933"
        },
        {
            "id": "i3yq0qo",
            "score": 1,
            "text": "The hell?",
            "title_similarity": "0.057016835"
        },
        {
            "id": "i3yqhd0",
            "score": 4,
            "text": "Ugh.  I wish I had never heard of this piece of shit.\n\nI mean ... I don't really, it's always better to know.  But ugh.  What an obvious revisionist project.  It stumbles into every apologetic trap known to Holocaust denialism.\n\nBut ultimately readers are what make a book a bestseller.  I guess the taste for diminishment is as strong as it ever was.  Boyne and his publisher merely counted on that fact.",
            "title_similarity": "0.6003331"
        },
        {
            "id": "i3yqk6z",
            "score": 1,
            "text": "I mean, maybe we should address the fact that so many people don’t seem to know what fiction means.",
            "title_similarity": "0.25916362"
        },
        {
            "id": "i3yqpcu",
            "score": 2,
            "text": "I'm about as mad as seeing the Tattooist author deny authorities criticisms on her book and just continue to write sequels, which romanticise the victims of the holocaust. \n\nSickening.",
            "title_similarity": "0.49037695"
        },
        {
            "id": "i3yqx37",
            "score": 3,
            "text": "I was introduced to Schindler’s List in high school German class. I’m still pained with the image of a woman having to choose between her two daughters or have them both taken. I think about my own children and what it might be like if I had to choose, how could I choose, how evil can we be to force someone to have to choose?",
            "title_similarity": "0.5226021"
        },
        {
            "id": "i3yshxb",
            "score": 4,
            "text": "This sounds like a cashgrab to me",
            "title_similarity": "0.15571597"
        },
        {
            "id": "i3ytbhn",
            "score": 1,
            "text": "So, not to be that asshole in the room, but it's marketed and sold as fiction right? So why are we upset at the author and book.....not the teachers in education using it? \n\n/shrug \n\nI'm a big believer in letting someone write/say whatever the hell they want, so I can't really fault the man for publishing whatever the hell he wants. Based on the comments, it's so hilariously bad, I can't even fathom why people think the failiure is on the books existence; seems clear to me that this is equivalent of a bunch of teachers and people pushing the whole anti-vaxx thing, so they're the ones that need to be yelled at",
            "title_similarity": "0.40650475"
        },
        {
            "id": "i3yw2qu",
            "score": 5,
            "text": "Kids should have to read \"Night\" like I did",
            "title_similarity": "0.35986388"
        },
        {
            "id": "i3ywcqo",
            "score": 1,
            "text": "Interesting how the german, generally positive perspective seems to differ from the international, negative response. And not because Germans perceive the book as glorifying, but because it is used as fiction, that helps to introduce people to the horrors that was the holocaust.",
            "title_similarity": "0.3487422"
        },
        {
            "id": "i3ywktv",
            "score": 3,
            "text": "Fuck that guy and fuck those books in particular!",
            "title_similarity": "0.25864437"
        },
        {
            "id": "i3yxw1b",
            "score": 1,
            "text": "I don’t like fiction about the Holocaust for this reason. I’ll only read non-fiction about it.",
            "title_similarity": "0.27353397"
        },
        {
            "id": "i3yy8p7",
            "score": 1,
            "text": "This is the transphobe dude",
            "title_similarity": "0.32459104"
        },
        {
            "id": "i3yyksp",
            "score": 3,
            "text": "Yikes-aroni. That many kids have it in their curriculum? Yeesh. \n\nEducation has always had a hard time even broaching the topic of the Holocaust. This trash is out here making it worse.",
            "title_similarity": "0.54279083"
        },
        {
            "id": "i3yz9v2",
            "score": 3,
            "text": "In a way it's a very good movie. Afterwards, if you do some intersection you have to ask yourself why you cared more for the little boy instead of the entire camp of people and what implications that has for a populace.",
            "title_similarity": "0.44489354"
        },
        {
            "id": "i3z0j74",
            "score": 2,
            "text": "From the studio that brought you \"2 Striped 2 Pajamas\" comes:\n\nDiary of Anne Frank 2: Anne Franker.\n\nand\n\nSchindler's Little Black Book.",
            "title_similarity": "0.41380984"
        },
        {
            "id": "i3z0ygq",
            "score": 2,
            "text": "I have heard of this book but had no idea it was so shitty.  Wow",
            "title_similarity": "0.3312544"
        },
        {
            "id": "i3z1rmk",
            "score": 1,
            "text": "\"this time it's personal\"",
            "title_similarity": "0.122803934"
        },
        {
            "id": "i3z41wt",
            "score": 3,
            "text": "Woah, I’m glad I read this article. I’ll make sure to not read that book to my class!",
            "title_similarity": "0.39985818"
        },
        {
            "id": "i3z4h1a",
            "score": 1,
            "text": "If there's anyone Nintendo should take down for copyright, it's this guy.",
            "title_similarity": "0.39236236"
        },
        {
            "id": "i3z5q1k",
            "score": 2,
            "text": "Godddd.  This Holocaust Awareness tech tree is ridiculous!",
            "title_similarity": "0.3534526"
        },
        {
            "id": "i3z65u2",
            "score": 1,
            "text": "2 Faust, 2 Holocaustening?",
            "title_similarity": "0.3817127"
        },
        {
            "id": "i3z7coi",
            "score": 1,
            "text": "FInally a great news !!",
            "title_similarity": "0.1959434"
        },
        {
            "id": "i3z7rfl",
            "score": 1,
            "text": "Well sh¡t. This is in my tbr pile.  Good to know it's wildly inaccurate. I had heard such good things about the film too. 😕",
            "title_similarity": "0.3621563"
        },
        {
            "id": "i3z9km9",
            "score": 5,
            "text": "This asshole literally gave ammunition to holocaust deniers. How the hell do you write a sequel to the holocaust, the 1948 arab-israeli war?",
            "title_similarity": "0.5501096"
        },
        {
            "id": "i3zc526",
            "score": 2,
            "text": "I highly urge anyone that reads WWII/Holocaust non-fiction to read The Boy Who Followed His Father into Auschwitz. THIS is the book that should be assigned reading in schools everywhere.",
            "title_similarity": "0.6851802"
        },
        {
            "id": "i3zdhm1",
            "score": 1,
            "text": "Why tf would it need a sequel",
            "title_similarity": "0.3629967"
        },
        {
            "id": "i3zhhxx",
            "score": 2,
            "text": "Leaving aside everything else, how do you write a sequel to this book? It literally ends with the kids getting gassed.",
            "title_similarity": "0.5903189"
        },
        {
            "id": "i3zhqdx",
            "score": 1,
            "text": "I got this in my school pack, never read it though, what the hell would a sequel do for a book set nearly 100 years ago?",
            "title_similarity": "0.6163671"
        },
        {
            "id": "i3zhyzo",
            "score": 4,
            "text": "The author has grown to be deeply unpopular on Irish Twitter due to saying \"Well actually\" to the Auschwitz Memorial Twitter account when they highlighted inaccuracies in Boyne's book and also due to what was regarded by some as a poorly researched book on trans kids. This was to the extent that he wrote a subsequent book where a protagonist gets publicly cancelled.\n\nHe's also apparently quick to bring in the lawyers if he faces criticism from those he feels aren't worthy of giving it.",
            "title_similarity": "0.39565897"
        },
        {
            "id": "i3znza6",
            "score": 5,
            "text": "Holy shit this is terribly misleading for children to read as an introduction into Holocaust education \n\n>”We always think of the Nazis as the bad guys and this shows that the Holocaust didn’t just affect the Jews (…) but the problems that Nazi families might encounter and what their problems were,” said Dan, a year 9 student. “It is too easy to feel sorry for the Jews (…), I don’t mean that in a rude way, it is just like, everyone is always (…) going to sympathize with the Jews (…) when you see it from like Bruno or the mother’s perspective it seems a bit different because they had to live with that,” said Jack, year 12. \n\n>The most egregious quote though is “they (the Nazis) couldn’t do anything about it because they (…) basically got killed off if they didn’t do what he (Hitler) said (…) it doesn’t matter who was the bigger victim, they (Nazis and Jews) were all still victims of Hitler’s control in some shape or form,” from Erica, year 11.",
            "title_similarity": "0.51493025"
        },
        {
            "id": "i3zpjoq",
            "score": 1,
            "text": "We watched the movie in school, but we all went on knowing it wasn't a true story.",
            "title_similarity": "0.36785668"
        },
        {
            "id": "i3zr38t",
            "score": 1,
            "text": "Hold the fucking phone…people actually think that this really happened, and that brunos death ended the holocaust? Thats a real thing that people actually believe???",
            "title_similarity": "0.48153087"
        },
        {
            "id": "i3zrlfo",
            "score": 3,
            "text": "Yeah nazis weren’t british either. I could never get over that when watching the movie.",
            "title_similarity": "0.30102462"
        },
        {
            "id": "i3zsxy6",
            "score": 2,
            "text": "I remember watching the movie in school a couple years later I saw Schindler's list. A movie that I thought was much better at showou the horrors of the mass extermination. I do get the issues that this article takes up but seems some of the blame should be placed at the school syyand not the book itself.",
            "title_similarity": "0.55045474"
        },
        {
            "id": "i3zy323",
            "score": 3,
            "text": "When I was going to school to become a teacher, we did a whole unit on this book for my upper elementary literacy class. We read it, character mapped it, etc. It was in grained into us how useful this book would be as a stepping stone to talk about the Holocaust. I can totally see the other edge of this book. I didn't like it at the time and thought there was better literature out there. I can see how children of all ages can take this to heart and that's wrong.",
            "title_similarity": "0.6269555"
        },
        {
            "id": "i3zys1r",
            "score": 1,
            "text": "So, I haven’t read the book, I’ve seen the movie. But holy shit this article is disturbing in the showcasing of ignorance student’s have toward the Holocaust. My grandfather taught me A LOT about the Holocaust and WW2, so my education on the topic could be considered an outlier, but fuck me. Do people think the Nazi party was Indiana Jones shit or something?",
            "title_similarity": "0.5341773"
        },
        {
            "id": "i4011e8",
            "score": 3,
            "text": "This will get buried under but I have only seen the movie and didn't see much wrong with it. What am I missing?",
            "title_similarity": "0.24922366"
        },
        {
            "id": "i401558",
            "score": 3,
            "text": "\"and many even thought Bruno’s death ended the Holocaust\"\n\nmy lord",
            "title_similarity": "0.5412104"
        },
        {
            "id": "i4028tt",
            "score": 1,
            "text": "I can't believe a thread in r/books made me angry all day.",
            "title_similarity": "0.42717248"
        },
        {
            "id": "i402dfa",
            "score": 1,
            "text": "This is why I never watched the bad movie based on the book",
            "title_similarity": "0.34820473"
        },
        {
            "id": "i403mrz",
            "score": 3,
            "text": "When it comes to novels about the Holocaust that are readily accessible to young readers, *Number the Stars* is a much better option. But for older students, nothing beats a non-fiction account - or even a dramatized version - of actual experiences. It can be the work of survivors like Elie Wiesel, Primo Levi, and Viktor Frankl, or survivors' family members like Art Spiegelman, or those that didn't survive at all like Anne Frank. Their stories should always take precedence over wholly invented tales like *The Boy in the Striped Pyjamas*.",
            "title_similarity": "0.6037723"
        },
        {
            "id": "i404198",
            "score": 2,
            "text": "I just saw this on Netflix the other day and I was wondering if I should watch it, guess I found the answer to that.",
            "title_similarity": "0.4289918"
        },
        {
            "id": "i406zvp",
            "score": 1,
            "text": "My lord, what a reverse Schindler",
            "title_similarity": "0.2160298"
        },
        {
            "id": "i40hj5q",
            "score": 1,
            "text": "I haven't read it, is the book actually that bad?",
            "title_similarity": "0.22078258"
        },
        {
            "id": "i40iami",
            "score": 2,
            "text": "When I was in school in London in 2011 this was part of the curriculum. I've never heard it was false or denounced by Auschwitz Memorial. This is horrific can't imagine how much more horrific that feels to families of victims 😔.",
            "title_similarity": "0.55438054"
        }
    ]
}