{
    "Jennette McCurdy is releasing her memoir ‘I’m Glad My Mom Died’ which will discuss the abuse she went through during child stardom\n": [
        {
            "id": "i4immrf",
            "score": 2,
            "text": "Family is so so overrated.",
            "title_similarity": "0.3473384"
        },
        {
            "id": "i4ij9mr",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.15367894"
        },
        {
            "id": "i4iosme",
            "score": 0,
            "text": "Did she ever tell the world wtf that fucked up video she made addressed to Dan schnider was about?. Does she speak about Dan schnider and the fucked up things that happened to all those nick child stars?. I have to know.",
            "title_similarity": "0.63759375"
        },
        {
            "id": "i4ip1rk",
            "score": 0,
            "text": "I’m actually extremely interested.",
            "title_similarity": "0.039950423"
        },
        {
            "id": "i4i2za5",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "0.15367894"
        },
        {
            "id": "i4il36g",
            "score": 3,
            "text": "I'll buy it. Hell yeah, I love her.",
            "title_similarity": "0.3225971"
        },
        {
            "id": "i4l5ok1",
            "score": 0,
            "text": "Jennette is what I consider to be a bad bitch. Been through hell and came out unbroken, untainted and positive. Doesnt have victim mentality, handles her business and moves forward.",
            "title_similarity": "0.54759943"
        },
        {
            "id": "i4i6u1p",
            "score": 5,
            "text": "The Dan Schneider Chronicles",
            "title_similarity": "0.08593436"
        },
        {
            "id": "i4iovdu",
            "score": 5,
            "text": "Not sure if I’m alone but I’m shocked by the cover. $27.99 for a paperback? Crazy.",
            "title_similarity": "0.40025097"
        },
        {
            "id": "i4jgtp3",
            "score": 1,
            "text": "Disney kids tend to grow up messed the hell up.",
            "title_similarity": "0.3716871"
        },
        {
            "id": "i4hygjy",
            "score": 21,
            "text": "I hope she talks about Dan Schneider.  He’s trash.",
            "title_similarity": "0.51792276"
        },
        {
            "id": "i4hpt78",
            "score": 28,
            "text": "Hoo boy, that's a heavy title.",
            "title_similarity": "0.064034946"
        },
        {
            "id": "i4iufpq",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.15367894"
        },
        {
            "id": "i4i8y9y",
            "score": -30,
            "text": "27.99? no thanks",
            "title_similarity": "0.10117482"
        },
        {
            "id": "i4ibdxy",
            "score": 4,
            "text": "Good for her",
            "title_similarity": "0.16588199"
        },
        {
            "id": "i4ja4je",
            "score": -3,
            "text": "What a vibe that title is",
            "title_similarity": "0.057027742"
        },
        {
            "id": "i4ju7lx",
            "score": -3,
            "text": "She seems well",
            "title_similarity": "0.02475136"
        },
        {
            "id": "i4k9f7b",
            "score": -3,
            "text": "Never heard of her",
            "title_similarity": "0.18960224"
        },
        {
            "id": "i4hpmbj",
            "score": 9,
            "text": "Well I never watched her on TV but ill definitely be reading it.",
            "title_similarity": "0.4060001"
        },
        {
            "id": "i4lvn6s",
            "score": 0,
            "text": "Y'all think we're gonna get some Dan Schneider tea?",
            "title_similarity": "0.3437292"
        },
        {
            "id": "i4hv1pz",
            "score": 16,
            "text": "I have no idea who this is, but if I saw the book on a shelf, I'd at least read the back cover. That title is quite the attention grabber.",
            "title_similarity": "0.38480604"
        },
        {
            "id": "i4lag1r",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.15367894"
        },
        {
            "id": "i4j8phm",
            "score": 1,
            "text": "If she doesn’t reveal any dirt on Dan, this should put those ugly internet rumors to bed. \n\nI’m a fan of her, love seeing her pictures. Will def check this out.",
            "title_similarity": "0.6091736"
        },
        {
            "id": "i4jiwt0",
            "score": 1,
            "text": "This will be the first book I read in about 10 years. I’m so excited.",
            "title_similarity": "0.3316067"
        },
        {
            "id": "i4jlt4o",
            "score": 1,
            "text": "I saw her one woman by the same name and it was absolutely incredible. Very exciting for this book!",
            "title_similarity": "0.45961756"
        },
        {
            "id": "i4kc8rt",
            "score": 1,
            "text": "The picture on the cover is awesome.",
            "title_similarity": "0.014158431"
        },
        {
            "id": "i4klb1s",
            "score": 1,
            "text": "Hey, it’s my cousin.",
            "title_similarity": "0.32232022"
        },
        {
            "id": "i4hljjy",
            "score": 20,
            "text": "Already pre-ordered!!",
            "title_similarity": "0.10177482"
        },
        {
            "id": "i4hmkwn",
            "score": 15,
            "text": "Ooh I’ve just preordered this",
            "title_similarity": "0.18382801"
        },
        {
            "id": "i4ib1x2",
            "score": 9,
            "text": "Dan Schneider on suicide watch",
            "title_similarity": "0.4653169"
        },
        {
            "id": "i4j0n38",
            "score": -8,
            "text": "Eminem energy",
            "title_similarity": "0.09704564"
        },
        {
            "id": "i4k210u",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "0.15367894"
        },
        {
            "id": "i4hxkba",
            "score": 17,
            "text": "If that's how she honestly feels, the title of the book fits.",
            "title_similarity": "0.27855468"
        },
        {
            "id": "i4hyvil",
            "score": 8,
            "text": "She's narrating the audiobook? That's gonna be fun. Time to re-up my Audible subscription...",
            "title_similarity": "0.5169204"
        },
        {
            "id": "i4j03nc",
            "score": 2,
            "text": "What an insane title. I cannot wait.",
            "title_similarity": "0.15153027"
        },
        {
            "id": "i4j6aj7",
            "score": 2,
            "text": "Her podcast is good",
            "title_similarity": "0.22318012"
        },
        {
            "id": "i4jl2vo",
            "score": -2,
            "text": "Dude title is a nood and mine isnt even dead yet, just to me",
            "title_similarity": "0.13157536"
        },
        {
            "id": "i4huwm1",
            "score": 31,
            "text": "Every time my nieces have Nickelodeon or Disney on I wonder what horror the actors have endured.",
            "title_similarity": "0.71206224"
        },
        {
            "id": "i4hp832",
            "score": 73,
            "text": "Getting Camus' \"The Stranger\" vibes from the title\n\n&#x200B;\n\nBut I also read before about Jenette, she's definitely had it hard and I hope this book does good.",
            "title_similarity": "0.6093352"
        },
        {
            "id": "i4kcmpb",
            "score": -20,
            "text": "Expecting people to pay $27.99 for this krep is the *real* abuse!",
            "title_similarity": "0.45694226"
        },
        {
            "id": "i4ibyln",
            "score": -66,
            "text": "I feel for her because of the abuse. I understand that this is one of the ways she is coping. But the way she just constantly focuses on this in public as a way to make money just isn't for me. If it suits others, then that's great. Just not for me, thanks.",
            "title_similarity": "0.5332791"
        },
        {
            "id": "i4j07hh",
            "score": 3,
            "text": "That’s gotta be an all-timer of a book title",
            "title_similarity": "0.2681049"
        },
        {
            "id": "i4j3slm",
            "score": 4,
            "text": "I don't know anything about this but the title intrigues me. I will definitely read this.",
            "title_similarity": "0.32107097"
        },
        {
            "id": "i4k0mmp",
            "score": 3,
            "text": "I kinda hope that this makes distancing yourself from toxic family members more acceptbale. \n\nWhen my grandfather died in 1984, for reasons too complex to get into here, my father cut off all contact with his two brothers and his sister. Several years ago he told me he held them no ill will but had no idea if they were even alive. \n\nWhen his two brothers died their obituaries didn't even mention my Dad as a surviving sibling. My Dad told me when he dies he wants his siblings mentioned in his obituary because to not do so would be an insult to his parents. \n\nMoral of the story... just because someone is family doesn't obligate you to them if they're a shitty person.",
            "title_similarity": "0.6276588"
        },
        {
            "id": "i4ipqp6",
            "score": 37,
            "text": "Imagine your legacy as a parent being your child being glad you're dead.",
            "title_similarity": "0.7338358"
        },
        {
            "id": "i4hv8jb",
            "score": -33,
            "text": "[deleted]",
            "title_similarity": "0.2133964"
        },
        {
            "id": "i4i6hg0",
            "score": 15,
            "text": "I stopped watching iCarly around the time I was 12 and was too old to ever watch Sam & Cat so I haven’t thought about this chick in YEARS.\n\nAnd yet … something about this book makes me want to read it so bad. This might be the first non fiction book I read in 4 years",
            "title_similarity": "0.54285944"
        },
        {
            "id": "i4hvlj0",
            "score": -95,
            "text": "Imagine hating a person so much that that you title your book that... \n\nThat being said, it's doing it's job I don't know her, and don't particularly care about her, but I'd easily pick that up in a store and leaf through it.\n\nEdit: \"I don't know her.\"  downvote city for not knowing her backstory and just commenting on the surprising amount of hate in the title. \n\nReddit.. where you need to know what everyone else knows otherwise you're the worse.   Thanks for Reminding me why I stay off this subreddit.",
            "title_similarity": "0.5746546"
        },
        {
            "id": "i4iwpcj",
            "score": 4,
            "text": "Parents who push children into stars always turn out as freak stories. I'm glad she was brave enough to tell her story in the end.",
            "title_similarity": "0.69396186"
        },
        {
            "id": "i4jxwp2",
            "score": 5,
            "text": "I want to gift this book to my mom on mothers day.",
            "title_similarity": "0.65277153"
        },
        {
            "id": "i4hsy68",
            "score": 6,
            "text": "I can only imagine that it is a tough thing to have to go through. I wish we lived in a world where books and stories like this could put an effective stop to child actor/actress abuse. \n\nI dont think people should be forced in or out of acting roles but i will say that she should do more stuff, upon watching the new episodes of icarly on paramount, i realized how much she and eventually gibbys actor carried the shows humor. I understand it would probably be traumatic for either of them to return to that set especially since dan schnieders name still appears on the opening credits as creator.",
            "title_similarity": "0.6226814"
        },
        {
            "id": "i4ja6io",
            "score": -7,
            "text": "She should meet this baby named Stewie Griffin",
            "title_similarity": "0.46384615"
        },
        {
            "id": "i4joju6",
            "score": 6,
            "text": "I’m curious if she’s going to name names. She worked very closely with Dan Schneider and there have been rumors of abuse for years with him and various other higher ups at Nickelodeon. \n\nHe was very abruptly let go a few years ago when MeToo was at its peak despite being their highest earning producer for like 20 years.",
            "title_similarity": "0.6464933"
        },
        {
            "id": "i4i9f61",
            "score": 20,
            "text": "I love the cover picture even more than the title. In the comments on the article she got read for coming off as flippant despite her intentions, but I completely understand that pained smile she's making.",
            "title_similarity": "0.5409609"
        },
        {
            "id": "i4if6vb",
            "score": 8,
            "text": "I love how it already has reviews on good reads from people who aren't even pretending they've read the book already.",
            "title_similarity": "0.31525832"
        },
        {
            "id": "i4j1t14",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.15367894"
        },
        {
            "id": "i4jwi62",
            "score": 7,
            "text": "Felt great when I learned my rapist died in a car crash, so I get it. Good for her.",
            "title_similarity": "0.724069"
        },
        {
            "id": "i4k8emd",
            "score": 6,
            "text": "She seems like a funny, smart person who's turned a lot of her rage/grief into humor and empathy, which is relatable. That's chill. I'd read this.",
            "title_similarity": "0.41114393"
        },
        {
            "id": "i4ilhqq",
            "score": 7,
            "text": "My biodad still talks to my siblings (acts as spy) from my abusive biomom, whom I call the incubator.\n\nSibling's in town, and asked him if I wanted to see her kids\n\nI told dad the only time I want to hear him talk about them is if they left 10k in a briefcase on the porch and aren't around, or the incubator is dead.\n\nI never wish her dead. But sometimes, I think it would be a sigh of relief to wake up to news that she was.",
            "title_similarity": "0.70287997"
        },
        {
            "id": "i4jnjq3",
            "score": -7,
            "text": "Is thr mom's name not mentioned anywhere in the article? What a weird omission, the main subject.",
            "title_similarity": "0.43490255"
        },
        {
            "id": "i4hz26d",
            "score": -46,
            "text": "...I wonder if Jordan Peterson got a copy.\n\nEDIT: \nI fail to see what I said thats downvote worthy.",
            "title_similarity": "0.3731557"
        },
        {
            "id": "i4isfy9",
            "score": 10,
            "text": "Is this the book that buries Dan Schneider?",
            "title_similarity": "0.29447505"
        },
        {
            "id": "i4jbshw",
            "score": 9,
            "text": "I really wonder sometimes if we shouldn't just outlaw acting for people under 15, and classify it all as exploitation. What percentage of child performers are even okay by adulthood? Pretty sure it's less than half.",
            "title_similarity": "0.4572394"
        },
        {
            "id": "i4l56fm",
            "score": 10,
            "text": "jeanette used to date a friend of mine so tangentially i spent various holidays and get togethers with her during their time together. she was always very nice but a bit guarded and quiet. she was extremely thin and often would pick at her food in a way that i recognized all too well (as a person with a history of eating disorders.)\n\ni mentioned to a mutual friend that i didn’t see her and her bf (my friend) interacting much aside from always sitting together and that as a result i couldn’t quite get a read on their relationship/connection. \n\nthe mutual friend looked me dead in the eyes and said something like, you cannot even fathom what she’s been through and that she’s even here with us, living a normal life and not horribly addicted or dead is essentially a miracle. \n\nit’s always stuck with me, especially as a reminder to not judge people bc they could be carrying a burden heavier than i could possibly imagine.",
            "title_similarity": "0.54400796"
        },
        {
            "id": "i4hvzxc",
            "score": -73,
            "text": "Not sure if I agree with the title, but I’ll be reading nonetheless…so I guess it worked.",
            "title_similarity": "0.32786763"
        },
        {
            "id": "i4jz31h",
            "score": 10,
            "text": "I’m so glad she went with this title. Some people do not seem to understand that there are parents out there who never deserve to be apart of their child’s life. People love to universally say “oh but they’re your mother/father they may not show it but I’m sure they love you” some parents truly do not love their children and will ruin them for their own gain",
            "title_similarity": "0.6038774"
        },
        {
            "id": "i4hodiz",
            "score": 302,
            "text": "This is why I hate Nickelodeon. They always treated anyone who worked with them like shit, whether they be the cartoonists who created the shows, the actors of the shows, the animators of the shows. In fact, I'd say the fragile nature of creator driven shows and the rise of child star based sitcoms led to the fall of the Network.",
            "title_similarity": "0.57587886"
        },
        {
            "id": "i4iz6gb",
            "score": 11,
            "text": "I'm interested to see what Wil Wheaton thinks of this book. He's been very open with his experience growing up a child actor and the difficulty he had with his parents and family because of it.",
            "title_similarity": "0.5317099"
        },
        {
            "id": "i4knx95",
            "score": -10,
            "text": "On the other hand, she's a multi millionaire now because of her mom.",
            "title_similarity": "0.55848414"
        },
        {
            "id": "i4i26ho",
            "score": 11,
            "text": "Jessica Jones has a running side story about an awful showbiz mom, it's great.",
            "title_similarity": "0.72102046"
        },
        {
            "id": "i4hrmyq",
            "score": 64,
            "text": "Great title. I never watched the show, but I've heard about the emotional and sexual abuse her mother put her through and it reminded me of another memoir of a Canadian child actor I read last year that also involved a sexually abusive mother. I'm definitely interested in reading this.",
            "title_similarity": "0.8160994"
        },
        {
            "id": "i4i2f5d",
            "score": 62,
            "text": "This is a bit off-topic, but my daughter recently got into the show she's in after iCarly, Cat and Sam or something. Can anyone explain Arianna Grandes voice in that show? I know it's not her real speaking voice, just trying to figure out why they went with that.",
            "title_similarity": "0.6305289"
        },
        {
            "id": "i4hu3u4",
            "score": 113,
            "text": "i don’t know much about her story or background but i remember seeing her and her mom at in-and-out burger back in the day near toluca lake. i used the bathroom after her and she just looked really sad. figured it was just a bad day. for the record the only thing i said to her was thank you (for holding open the bathroom door). i’ll definitely get this book",
            "title_similarity": "0.6543404"
        },
        {
            "id": "i4hv4l0",
            "score": 15,
            "text": "100% would pick up this book based on the title alone, which I guess is likely the point.",
            "title_similarity": "0.33226702"
        },
        {
            "id": "i4ksb7q",
            "score": -13,
            "text": "While I'm not overly familiar with the specifics of her relationship with her mom, that title is just sensationalist garbage, basically a clickbait book title. Even if that's exactly how you feel, I don't know man, just seems in poor taste. I mean whatever she needs to do to heal, but that sounds like a title a PR agent or book agent came up with for sales.",
            "title_similarity": "0.63633436"
        },
        {
            "id": "i4i1c8w",
            "score": -102,
            "text": "[removed]",
            "title_similarity": "0.15367894"
        },
        {
            "id": "i4i84fu",
            "score": 17,
            "text": "All power to you Jennette. Child Abuse is a serious issue in the entertainment industry, since the time of Judy Garland.",
            "title_similarity": "0.648239"
        },
        {
            "id": "i4ihdn5",
            "score": -15,
            "text": "[deleted]",
            "title_similarity": "0.2133964"
        },
        {
            "id": "i4ijn64",
            "score": 15,
            "text": "Growing up a ward of the state sucked in many ways, but if my mom didn't kill herself I'd probably be way worse off today.  She was a manic depressive who could go on abusive streaks and who ended up with very few friends before she died, likely because she wasn't all that nice to be around.  The fact that she's dead doesn't make me happy, but I'm thankful for the opportunities it brought my life.  Bad parents lead to bad odds of success in life, and things like abuse tend to follow patterns from parent to child",
            "title_similarity": "0.6971406"
        },
        {
            "id": "i4iw9ux",
            "score": -42,
            "text": "Seriously, who gives a f*ck.  They got a bad deal in life, who didn't?  At least most of us don't try to monetize it.",
            "title_similarity": "0.44064462"
        },
        {
            "id": "i4ij5zs",
            "score": 19,
            "text": "My abusive mother tried like hell to shove me into show business from a young age. I was out by the 10 and she resented me from then on for not being her ticket out of all of her white trashy mistakes.\n\nI have a much empathy for Jennette; I’ve had this book on preorder since it was announced.",
            "title_similarity": "0.76409924"
        },
        {
            "id": "i4i301y",
            "score": 130,
            "text": "And for anyone judging the title - DON’T. Her mom both physically and sexually abused her growing up.. I’m so proud of her for standing up for herself",
            "title_similarity": "0.74218434"
        },
        {
            "id": "i4iwank",
            "score": -22,
            "text": "Chapter one: When my mommy sold me to Jeffery Epstein",
            "title_similarity": "0.71402955"
        },
        {
            "id": "i4hn67e",
            "score": 370,
            "text": "Saw her Eric Andre interview. She has a good sense of humor",
            "title_similarity": "0.3102656"
        },
        {
            "id": "i4imph3",
            "score": -56,
            "text": "[removed]",
            "title_similarity": "0.15367894"
        },
        {
            "id": "i4iio3h",
            "score": -25,
            "text": "God I hope nothing happens to her. These type of things come out and suddenly....a mysterious death.",
            "title_similarity": "0.5495571"
        },
        {
            "id": "i4iq7fd",
            "score": -27,
            "text": "[removed]",
            "title_similarity": "0.15367894"
        },
        {
            "id": "i4hrmko",
            "score": 103,
            "text": "Reminds me of Sarah Lynn.",
            "title_similarity": "0.3663142"
        },
        {
            "id": "i4i8h7g",
            "score": 68,
            "text": "Is it just me, or does the book cover resemble something that came out during the 1980s? On a more serious note, here's hoping the book does well for Jennette, especially in regards to helping her heal from what she went through.",
            "title_similarity": "0.6028431"
        },
        {
            "id": "i4hs9dr",
            "score": 31,
            "text": "damn. this is so out of my genres but I actually would be interested in reading this.",
            "title_similarity": "0.30685547"
        },
        {
            "id": "i4hvg4t",
            "score": 1569,
            "text": "I love the book title. Too often in this society we teach people that your parents are the be all end all. When in fact a lot of people have really shitty parents that are horrible people. They should be able to speak on it whatever way they want.\n\nEdit: my first Reddit award !! Wow 😍 thank you kindly stranger",
            "title_similarity": "0.6996043"
        },
        {
            "id": "i4hq9lb",
            "score": 1092,
            "text": "**r/raisedbynarcissists has entered the chat**",
            "title_similarity": "0.25124606"
        },
        {
            "id": "i4ha8uh",
            "score": 4807,
            "text": "I empathize with the author. There are so many, too many, terrible stories about young YouTube Star’s, Nickelodeon actors etc. being hurt by adults. I hope the author gets what she needs by writing this and getting it out there. I can imagine it would be cathartic. \n\nWow. It’s an attention grabbing title.",
            "title_similarity": "0.6714978"
        },
        {
            "id": "i4hjswv",
            "score": 755,
            "text": "I'm not sure if I'll end up reading it, but I think any time we can put this kind of behavior by parents into the spotlight, it can help get conversations started that will hopefully help not just future child stars but future children in general.",
            "title_similarity": "0.40157765"
        },
        {
            "id": "i4hrctf",
            "score": 275,
            "text": "Saw her one woman show before COVID which was named after her memoir \n\nStellar performance. Perfect and much more hard hitting in an intimate venue.",
            "title_similarity": "0.62329364"
        },
        {
            "id": "i4i1s0d",
            "score": 76,
            "text": "Good on her. I hope writing it was healing and therapeutic for her, and she gets lots of money from it.\n\nAbusive parents can fuck right off.",
            "title_similarity": "0.65527904"
        },
        {
            "id": "i4i3wxt",
            "score": 77,
            "text": "As someone who has a very strained relationship with my mother, I can not wait to read this. The idea of this kind of cathartic storytelling really moves me. \n\nReally happy for her",
            "title_similarity": "0.6653683"
        },
        {
            "id": "i4hgrdu",
            "score": 894,
            "text": "She has a great interview with the financial diet where she talks about this topic from a finances of being a child star perspective, I'm excited to read the book.",
            "title_similarity": "0.57627714"
        },
        {
            "id": "i4hy0en",
            "score": 204,
            "text": "Love the Judy Blume vibe of the cover\n\n\nFixed my spelling",
            "title_similarity": "0.38315094"
        },
        {
            "id": "i4i838d",
            "score": 490,
            "text": "The title makes me think she may have a wry sense of humor like Carrie Fisher. I'll definitely check it out.",
            "title_similarity": "0.48843545"
        },
        {
            "id": "i4i3ryz",
            "score": 830,
            "text": "That is a TITLE (meant as a compliment). I’m honestly tired of the “you can’t speak ill of the dead” or “you can’t insult your family” narratives. Fuck that! Some dead people were terrible people, and some family members are terrible people. I’m glad this is the title",
            "title_similarity": "0.65403104"
        },
        {
            "id": "i4huoia",
            "score": 123,
            "text": "I watched her shows with my kids and always found her to be a comedic genius. When she didn’t do the iCarly reunion I mentioned it to my wife and she said that Jennette McCurdy had a podcast. I listened to it and enjoyed it. I’ll read the book because I think it will be great. Kudos on the title, the truth will set you free.",
            "title_similarity": "0.602836"
        },
        {
            "id": "i4hido5",
            "score": 2860,
            "text": "So excited for this! I haven’t listed to all of it but her podcast has some great episodes as well.",
            "title_similarity": "0.38534832"
        },
        {
            "id": "i4hr31y",
            "score": 175,
            "text": "Good for her",
            "title_similarity": "0.16588199"
        },
        {
            "id": "i4i3i16",
            "score": 4408,
            "text": "I'm just glad Jennette made it out of stardom alive.",
            "title_similarity": "0.4680492"
        },
        {
            "id": "i4i26ap",
            "score": 2,
            "text": "Me too!",
            "title_similarity": "0.018429283"
        },
        {
            "id": "i4i43ib",
            "score": 3,
            "text": "I wonder if she'll say it finally...",
            "title_similarity": "0.3239615"
        },
        {
            "id": "i4i7mxa",
            "score": 7,
            "text": "Woah I did not know anything other than her mom had cancer. I need to read this.",
            "title_similarity": "0.70068336"
        },
        {
            "id": "i4iclj5",
            "score": 3,
            "text": "I pre-ordered this and can't wait to listen to it!",
            "title_similarity": "0.24593052"
        },
        {
            "id": "i4ied6c",
            "score": 16,
            "text": "Real interested to read her memoir, I didn't grow up with iCarly, but I'd watch it all the time with my niece and nephew when they were young, and I've always been interested in why she never did much else in film and TV.\n\nAlso, that's a very heavy title, I've heard her speak kinda vaguely about how toxic her mom was, gonna be real interesting to see what she details in her memoir.",
            "title_similarity": "0.7368933"
        },
        {
            "id": "i4igs4m",
            "score": 41,
            "text": "I met her once, she looked like she had been filming all day, she looked exhausted but was still nice enough to take a picture with my coworker who loved her.",
            "title_similarity": "0.55884445"
        },
        {
            "id": "i4ih9d9",
            "score": 4,
            "text": "I thought this been released.",
            "title_similarity": "0.16936836"
        },
        {
            "id": "i4ihxgy",
            "score": 2,
            "text": "Oh how I wish.",
            "title_similarity": "0.13257068"
        },
        {
            "id": "i4ii0eq",
            "score": 3,
            "text": "I loved her in icarly.  I thought she played her character well.  Was always wondering what happened to her.  So sad after reading the article that she went through that.  Its great she found her footing and worked her way out of her problems so quickly.  Most child stars arent so lucky.",
            "title_similarity": "0.6652166"
        },
        {
            "id": "i4ijst6",
            "score": 2,
            "text": "I hope there are many revelations about Nickelodeon and the Schneider",
            "title_similarity": "0.24592793"
        },
        {
            "id": "i4iksvf",
            "score": 2,
            "text": "I wanted to see that show! But I wasn't going to go to LA for it.\nTour, Jennette!",
            "title_similarity": "0.421421"
        },
        {
            "id": "i4il9il",
            "score": 2,
            "text": "I heard her lament over her feelings on this subject in an interview and sounds pretty sad she had to go through that",
            "title_similarity": "0.7149843"
        },
        {
            "id": "i4im4ca",
            "score": 4,
            "text": "I’ve loved Jennette since iCarly and all the more so when I learned about the abuses she went through. Been waiting for this memoir for a while now and I’m so excited! Honestly, I can say the same as the title except for my Dad.",
            "title_similarity": "0.65931404"
        },
        {
            "id": "i4iqyow",
            "score": 3,
            "text": "B A S E D",
            "title_similarity": "0.06357102"
        },
        {
            "id": "i4ire90",
            "score": 10,
            "text": "Not many abuse victims get to survive or succeed in a way that allows them to tell their story. I am looking forward to reading this.",
            "title_similarity": "0.47448564"
        },
        {
            "id": "i4is8b0",
            "score": 3,
            "text": " Theres so many terrible instances of parents taking advantage of their kids it’s ridiculous. Im glad this story is out and hopefully more people speak up!",
            "title_similarity": "0.60902977"
        },
        {
            "id": "i4ittjt",
            "score": 1,
            "text": "I mean the title caught my eye. Holy fuck lol",
            "title_similarity": "0.23609185"
        },
        {
            "id": "i4iuxpp",
            "score": 4,
            "text": "We really take child actors for granted, don't we? They perform to entertain us, but they have their own issues that are sidelined because \"they're just a kid\". It takes an enormous commitment to enter show business when you're young. You'll miss out on milestones your peers experience and it's a fast-paced world that might not be safe for everyone.",
            "title_similarity": "0.50778"
        },
        {
            "id": "i4ivnu2",
            "score": 2,
            "text": "God, i love her 🥺",
            "title_similarity": "0.29123032"
        },
        {
            "id": "i4iwglz",
            "score": 1,
            "text": "Is this based on her podcast (by the same name)? I’ll be checking this out when it comes to my local library.",
            "title_similarity": "0.48380175"
        },
        {
            "id": "i4iy5m5",
            "score": 1,
            "text": "Damn bro. Powerful",
            "title_similarity": "0.041626617"
        },
        {
            "id": "i4j0h74",
            "score": 3,
            "text": "I usually stay away from true stories because they always make me so sad. But I feel the need to support her healing process. I think I may pick this one up. She deserves to be open about what happened to her.",
            "title_similarity": "0.6145668"
        },
        {
            "id": "i4j2qws",
            "score": 9,
            "text": "Not surprising, the kind of people who push their kids into this kind of thing are usually fucked in the head, trying to live their failed dreams through their children. \n\nMy buddy wants to set his 5 year old up with a Twitch account so he can stream, I would never imagine doing something like that.",
            "title_similarity": "0.61824924"
        },
        {
            "id": "i4j4f64",
            "score": 2,
            "text": "I love her podcast",
            "title_similarity": "0.3003323"
        },
        {
            "id": "i4j8bgu",
            "score": 2,
            "text": "Genuinely super chill and a funny actress. She also happens to be the hottest celebrity imo, but very sad about her trauma and how she was treated. Saw her on a podcast and seemed very open and laidback",
            "title_similarity": "0.64068115"
        },
        {
            "id": "i4jbsdm",
            "score": 2,
            "text": "I saw her one woman show. It was extremely good.",
            "title_similarity": "0.40225303"
        },
        {
            "id": "i4jfdlx",
            "score": 3,
            "text": "I completely understand. I feel for her.",
            "title_similarity": "0.21722749"
        },
        {
            "id": "i4jfo4r",
            "score": 21,
            "text": "I also never felt such relief as when my dad died. It was such a burden off my back. No more feeling rejected. No more feeling disgusted. It's all so very freeing.",
            "title_similarity": "0.4099689"
        },
        {
            "id": "i4jgdl5",
            "score": 33,
            "text": "We do our society a great disservice when we repeat the lie that all parents love their children, let alone that they do so unconditionally, simply as a function of being a parent. \n\nBecause when we have parents who don't love us, the only thing a child is neurologically capable of asking, is \"What's wrong with me?!\" We don't have a societal verbiage for crappy parents, so we turn it inward and blame ourselves. \n\nMy entire life changed trajectory when a high school guidance counselor told me the shocking truth: everyone deserves good parents who love and respect them, but not everyone gets those parents. \n\nFuck abusive parents. I'm glad her mom's dead too. I'm looking forward to the day I become an adult orphan.",
            "title_similarity": "0.6639414"
        },
        {
            "id": "i4jhubj",
            "score": 1,
            "text": "bold title, not unjustified",
            "title_similarity": "-0.1072696"
        },
        {
            "id": "i4ji7al",
            "score": 2,
            "text": "*Sweats Dan Schneider foot gravy*",
            "title_similarity": "0.2208841"
        },
        {
            "id": "i4jr4w0",
            "score": 3,
            "text": "Love her and her podcast so I'm very excited for this!",
            "title_similarity": "0.33888957"
        },
        {
            "id": "i4jvuaj",
            "score": 3,
            "text": "Please check out the podcast episode she did with the Financial Diet- McCurdy is such a humble human being and the level of self reflection is raw",
            "title_similarity": "0.47148758"
        },
        {
            "id": "i4jwzft",
            "score": 4,
            "text": "I get it. I am not a child Star but Finally being able to say exactly this freed me.",
            "title_similarity": "0.30900192"
        },
        {
            "id": "i4jypj1",
            "score": 7,
            "text": "Always wondered what happened to her, as she was one of the more effortlessly funny and effective kids on those shows. Sad to find out about the BS behind the scenes, and glad she seems to have made it to the other side of this. I hope she continues to grow and do well and put distance between her and that mess.",
            "title_similarity": "0.57657593"
        },
        {
            "id": "i4k3y12",
            "score": 1,
            "text": "That girl reminds me of dhrek these days. She's like an onion with way more layers than I expected.",
            "title_similarity": "0.35330808"
        },
        {
            "id": "i4k438f",
            "score": 7,
            "text": "I have no idea who she is, but we are the same age so I feel like I should know. I only recognize icarly by the name. \n\nI hope she can get what she needs out of this book. My grandma finally died and so I can relate to this books title. \n\nI always told people “did you cry in history class when you found out hitler died? That’s how we all felt about grandma” \n\nAnd I get weird looks lmao I’ve never known a loving grandma",
            "title_similarity": "0.7748152"
        },
        {
            "id": "i4kebor",
            "score": 3,
            "text": "Maybe this will be the spark that ignites a #metoo re child abuse in the entertainment industry. It's still the one thing that is not talked about nearly enough.",
            "title_similarity": "0.57399094"
        },
        {
            "id": "i4kflpy",
            "score": 2,
            "text": "As someone of the brightly colored Babysitters Club era with a narc mom: everything about this book is perfect and I’m about to preorder it",
            "title_similarity": "0.52224183"
        },
        {
            "id": "i4kg8iz",
            "score": 2,
            "text": "Dang, I knew she’s dealt with a lot of disordered eating, but I didn’t know there was more than that. Jennette McCurdy was one of my favorite actresses when I was a kid, and it’s so sad that she was going through abuse: Definitely going to read her book.",
            "title_similarity": "0.7691914"
        },
        {
            "id": "i4ki04v",
            "score": 4,
            "text": "Didn’t she say at one point she wasn’t allowed to take showers without her mother fully observing the entire ordeal?? I feel absolutely awful for her :/",
            "title_similarity": "0.6840676"
        },
        {
            "id": "i4kk66v",
            "score": 2,
            "text": "You know what, good and glad for her.",
            "title_similarity": "0.22307593"
        },
        {
            "id": "i4kkwf8",
            "score": 3,
            "text": "That's such an intense title, I look forward to reading this.",
            "title_similarity": "0.23390496"
        },
        {
            "id": "i4knoc4",
            "score": 2,
            "text": "Seeing how fucked up Disney and Nickelodeon stars turn out, im really glad how well she came out of it all.",
            "title_similarity": "0.539158"
        },
        {
            "id": "i4kpzzk",
            "score": 7,
            "text": "Remember how fucked her characters relationship with her mom was on iCarly? Now I wonder how much acting she really had to do to portray a teenage girl who hated her mother",
            "title_similarity": "0.7931236"
        },
        {
            "id": "i4ks3og",
            "score": 2,
            "text": "It's like the same mom she had in icarly lol",
            "title_similarity": "0.52138466"
        },
        {
            "id": "i4ksiqi",
            "score": 6,
            "text": "She is such a well spoken person i imagine her written work will be very high quality",
            "title_similarity": "0.21040237"
        },
        {
            "id": "i4ksux3",
            "score": 5,
            "text": "I expect a full chapter on her experience at The Eric Andre Show.",
            "title_similarity": "0.4105149"
        },
        {
            "id": "i4ktt6g",
            "score": 4,
            "text": "I will definitely be interested to read it, from what I've heard her life has been severely impacted by being a child actor",
            "title_similarity": "0.58910656"
        },
        {
            "id": "i4ky50e",
            "score": 4,
            "text": "Best thing that ever happened to me was cutting my mom out of my life.",
            "title_similarity": "0.666758"
        },
        {
            "id": "i4l1m22",
            "score": 1,
            "text": "dfg drh",
            "title_similarity": "0.1000417"
        },
        {
            "id": "i4l6mpf",
            "score": 2,
            "text": "After learning about the abuse she suffered, I cannot watch the episode of law and order SVU she is in the same. I wonder if any of her acting in that episode was real because it sure does look like it.",
            "title_similarity": "0.69754267"
        },
        {
            "id": "i4l7e8d",
            "score": 2,
            "text": "Wow, I had no idea. Will definitely look into reading this. I always loved Jennette McCurdy. I swear, sometimes some of the happiest seeming people bear the greatest, invisible (to us) burdens.",
            "title_similarity": "0.509832"
        },
        {
            "id": "i4l836v",
            "score": 2,
            "text": "Good for her. Aren’t Millie bobbies parents also similar in that they depend on her, a child still imo at 18 to pay all the bills? Jfc",
            "title_similarity": "0.5569504"
        },
        {
            "id": "i4l8sp9",
            "score": 2,
            "text": "Now that's how you get me to buy a book.",
            "title_similarity": "0.31253177"
        },
        {
            "id": "i4layem",
            "score": 3,
            "text": "$27.99?! Holy shit!!",
            "title_similarity": "0.20516063"
        },
        {
            "id": "i4ligai",
            "score": 2,
            "text": "Based on what she had to endure at the hands of that woman, I'd be glad her mom is dead too.",
            "title_similarity": "0.8113261"
        },
        {
            "id": "i4ljhnn",
            "score": 2,
            "text": "I wonder if Dan Schnieder will be brought up. Or is he legally bulletproof at this point?",
            "title_similarity": "0.20546064"
        },
        {
            "id": "i4lm3sv",
            "score": 2,
            "text": "Don’t blame her. Parents of child stars are insane.",
            "title_similarity": "0.52969635"
        },
        {
            "id": "i4lmhuk",
            "score": 2,
            "text": "Very interested to read what she has to say about Dan Schneider",
            "title_similarity": "0.3639912"
        },
        {
            "id": "i4lp13y",
            "score": 1,
            "text": "Can mine die too while she's at it?",
            "title_similarity": "0.6015997"
        },
        {
            "id": "i4lr9ci",
            "score": 2,
            "text": "Her show was after \"my time\" but I will DEFINITELY be reading this, based solely on the title alone.",
            "title_similarity": "0.5311906"
        },
        {
            "id": "i4lrhv8",
            "score": 3,
            "text": "[Wil Wheaton's similar memoir](https://wilwheaton.net/2021/10/still-just-a-geek-an-annotated-memoir/), recently updated and annotated, was also just released.  Wil's writings have helped me a lot in my own recovery from similarly evil family, I look forward to reading Jennette's as well.",
            "title_similarity": "0.629972"
        },
        {
            "id": "i4lu8sb",
            "score": 1,
            "text": "I am so ready for this. Dan is about to have a world of hurt open up on him.",
            "title_similarity": "0.37493625"
        },
        {
            "id": "i4lvy61",
            "score": 2,
            "text": "That cover is a brilliant parody of Sweet Valley High book covers in the 80s!",
            "title_similarity": "0.3444148"
        },
        {
            "id": "i4lwmku",
            "score": 2,
            "text": "Isn’t it sad knowing what she went through now that they wrote her storyline to be that she had a trashy and abusive mom in the show too? And she suffered from ED but one of Sam’s character traits would be how much she overrate. It will never cease to amaze me how adults in Hollywood have no problem exploiting these children like this.",
            "title_similarity": "0.73964643"
        },
        {
            "id": "i4lypnt",
            "score": 1,
            "text": "Funny book title",
            "title_similarity": "0.2055747"
        },
        {
            "id": "i4ny18x",
            "score": 1,
            "text": "I will definitely be reading this!",
            "title_similarity": "0.15973979"
        }
    ]
}