{
    "Tianamen Square before the crackdown\n": [
        {
            "id": "h0mw3b2",
            "score": 1,
            "text": "\n**Please note:**\n\n* If this post declares something as a fact proof is required.\n* The title must be descriptive\n* No text is allowed on images\n* Common/recent reposts are not allowed\n\n*See [this post](https://redd.it/ij26vk) for more information.*\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/interestingasfuck) if you have any questions or concerns.*",
            "title_similarity": "0.38980216",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0nboh2",
            "score": 8,
            "text": "Oh you thought you could be happy? BOOM!...…Communism.",
            "title_similarity": "0.3256727",
            "sentiment_compound": 0.6114
        },
        {
            "id": "h0n4pdc",
            "score": 3,
            "text": "Can't help but notice alot of downvotes here......",
            "title_similarity": "0.42058486",
            "sentiment_compound": -0.1603
        },
        {
            "id": "h0nmm70",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.4618945"
        },
        {
            "id": "h0nt9ge",
            "score": -2,
            "text": "Check out r/sino they should all kill themselves lol. Dumbasses.",
            "title_similarity": "0.43653214",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0ncb5i",
            "score": 32,
            "text": "Never Forget China is the enemy",
            "title_similarity": "0.47930726",
            "sentiment_compound": -0.428
        },
        {
            "id": "h0ne0j0",
            "score": 1,
            "text": "I'm surprised to see this on Reddit.  Big media isn't covering it.   Most of the big tech companies are shadow banding anyone that posts comments or videos about it.  You have to go to the fringe websites to even know about it.",
            "title_similarity": "0.35693386",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0o4kdx",
            "score": -1,
            "text": "And yet everyone of you here still supports the ccp with your cheap China made garbage.  A lot of you commenting probably are awaiting an amazon delivery today too...of which company you’ll bitch about it’s working conditions first chance you get..only to play another amazon order.",
            "title_similarity": "0.2990231",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h0nbaxs",
            "score": -60,
            "text": "And yet people in the west want to be communists.",
            "title_similarity": "0.33456466",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0ne5h2",
            "score": -38,
            "text": "[deleted]",
            "title_similarity": "0.4618945"
        },
        {
            "id": "h0ne0nr",
            "score": -47,
            "text": "Tiananmen Square before what? Nothing happened there",
            "title_similarity": "0.5967537",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nbyj5",
            "score": 5,
            "text": "The sad part is that the people they fought for don’t acknowledge them. Even the ones that have left the country and live in the West and have access to the information.",
            "title_similarity": "0.36263502",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h0o6p08",
            "score": 3,
            "text": "At the same time these protestors also lynched and burned soldiers alive. NSFW warning:\n\nhttps://old.reddit.com/r/pics/comments/nrp1xq/pla_soldier_after_lynching_by_tiananmen_square/\n\nhttps://contact.photoshelter.com/image/I00001AdyBQ7Z.QY",
            "title_similarity": "0.44982234",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0nhpea",
            "score": -28,
            "text": "Now show the pictures of them burning unarmed soldiers alive\n\n[NSFL](https://preview.redd.it/j4i30xrxscr31.png?auto=webp&s=8202ce269ebf0ca98c83bc2a2ca216ed624c6bc1)\n\nGo watch some Chai Ling speeches if you actually think it was some kind of fucking woodstock. It was an attempted revolution. You don't have to support the CCP to realize that this is like showing a picture of Trump supporters having a picnic before storming the capitol. The military didn't just say 'hm I feel like murdering people with tanks today' ffs.",
            "title_similarity": "0.34004134",
            "sentiment_compound": -0.2163
        },
        {
            "id": "h0nkj7l",
            "score": -17,
            "text": "https://worldaffairs.blog/2019/06/02/tiananmen-square-massacre-facts-fiction-and-propaganda/\n\nHas anyone every tried to disprove this?",
            "title_similarity": "0.58566487",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0neiuj",
            "score": -54,
            "text": "[deleted]",
            "title_similarity": "0.4618945"
        },
        {
            "id": "h0ndacy",
            "score": 10,
            "text": "sorry to seem dumb but what happened? from what i gathered i know it’s a massacre but like when and where did this happen",
            "title_similarity": "0.48316175",
            "sentiment_compound": 0.2382
        },
        {
            "id": "h0n91fr",
            "score": -1,
            "text": "CCP should burn in hell for all eternity while Hitler sucks them off.",
            "title_similarity": "0.34844932",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h0q3wbd",
            "score": -1,
            "text": "Why didn't you post one for the Tulsa race massacre or the Kent State massacre or the Philadelphia bombings or the Bogside Massacre or the tens of other atrocities committed by the anglo world?",
            "title_similarity": "0.38841987",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0o47g8",
            "score": 0,
            "text": "It's so sad to think most of the people in the picture would die later by the hands of their own government, Never forget,  The Tianamen square massacre",
            "title_similarity": "0.47969753",
            "sentiment_compound": -0.7668
        },
        {
            "id": "h0ncqo1",
            "score": -8,
            "text": "This is the most candid happiness you'll see in China. Most videos of people being \"happy\" are propaganda videos.",
            "title_similarity": "0.1881395",
            "sentiment_compound": 0.7635
        },
        {
            "id": "h0nqw9r",
            "score": 3,
            "text": "Shout out to the tankies that this communism is liberation",
            "title_similarity": "0.3575541",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nex7y",
            "score": -34,
            "text": "Chinese here. I truly believe if that happened China would have split into a patchwork of multiple countries who would still be doing as well as any landlocked former USSR nation. Or turned into something like India, although the world's largest democracy, still has huge issues that a democracy can't address appropriately. A united culture/identity is important, especially one 5000 years old. Feel free to downvote but hope you can empathize.\n\nBringing 1.3 billion people literally out of the 1800s into modernity in the span of 40 years is unprecedented. Sorry that 300-3000 had to die for it.\n\nI believe the wealthiest Chinese cities will slowly usher in more progressive reforms to the rest of the country once people start making more money and able to concentrate on the higher hierarchy of needs attainments.\n\nMoreover, if you look at any destabilizing event in the last 500 years in China, millions if not tens of millions of people ended up dead directly or indirectly. 5000 years of imperial autocracy won't turn democratic overnight. Much of Chinese culture is built around Confucian ideals of piety and obedience.",
            "title_similarity": "0.40088058",
            "sentiment_compound": 0.6059
        },
        {
            "id": "h0n9lvb",
            "score": 5,
            "text": "Saddest thing is that a whole bunch of these people are going to be nothing but minced human remains soon.",
            "title_similarity": "0.43224287",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0ngjvd",
            "score": -10,
            "text": "Democracy is getting crushed in other parts of the world... Thats another china virus thats infecting every country and theres no vaccine for this one",
            "title_similarity": "0.4037995",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h0n06iq",
            "score": 43,
            "text": "So we’re staring at dead people. Rip people sorry you had a crazy commie dictator do you dirty.",
            "title_similarity": "0.33384293",
            "sentiment_compound": -0.872
        },
        {
            "id": "h0nbxf7",
            "score": -18,
            "text": "My man thought he was about to get that nut",
            "title_similarity": "0.4141358",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nft0s",
            "score": -20,
            "text": "People don't point out that these protestors are youth communists.",
            "title_similarity": "0.33642036",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n2vwq",
            "score": 6,
            "text": "Old school cool right there.",
            "title_similarity": "0.31846452",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0nfm9a",
            "score": 6,
            "text": "CCP- I gotta murder these people.",
            "title_similarity": "0.40912333",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0n490f",
            "score": 52,
            "text": "West Taiwan is the worst.",
            "title_similarity": "0.44305986",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h0ndz41",
            "score": -3,
            "text": "I just wanna leave a comment before this gets removed",
            "title_similarity": "0.47560418",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0ne4yy",
            "score": -27,
            "text": "Thank chinus for the coronavirus",
            "title_similarity": "0.31979284",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0n98le",
            "score": 1,
            "text": "My first thought was, \"These poor souls should be remembered, and we lament what might have been.\"\n\nMy second thought was, \"*Definitely* before McDonald's, KFC, and Pizza Hut blanketed the country.\"\n\nThat thought earned me another century in Purgatory, I'm sure...",
            "title_similarity": "0.38448432",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0o267t",
            "score": -1,
            "text": "Yeah and some soldiers actually raped corpses and ate some of the victims.   \nYes really. There are pictures.",
            "title_similarity": "0.2429446",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0on3ov",
            "score": 1,
            "text": "The daily Tianamen Square post on Reddit. I wish people would stop upvoting this, it's just conservatives/reactionaries trying to stoke anti-chinese hatred. They need a scapegoat, an enemy and China is it. We don't need another cold war. The world doesn't need any more conflict.",
            "title_similarity": "0.42073184",
            "sentiment_compound": -0.9468
        },
        {
            "id": "h0oz011",
            "score": 1,
            "text": "https://worldaffairs.blog/2019/06/02/tiananmen-square-massacre-facts-fiction-and-propaganda/amp/\n\nHere are a few more examples of what western journalists once said about what happened in Tiananmen Square in June 1989:\n\nCBS NEWS: “We saw no bodies, injured people, ambulances or medical personnel — in short, nothing to even suggest, let alone prove, that a “massacre” had occurred in [Tiananmen Square]” — thus wrote CBS News reporter Richard Roth. https://www.cbsnews.com/news/there-was-no-tiananmen-square-massacre/\n\nBBC NEWS: “I was one of the foreign journalists who witnessed the events that night. There was no massacre on Tiananmen Square” — BBC reporter, James Miles, wrote in 2009. http://news.bbc.co.uk/2/hi/asia-pacific/8057762.stm\n\nNY TIMES: In June 13, 1989, NY Times reporter Nicholas Kristof – who was in Beijing at that time – wrote, “State television has even shown film of students marching peacefully away from the [Tiananmen] square shortly after dawn as proof that they [protesters] were not slaughtered.” In that article, he also debunked an unidentified student protester who had claimed in a sensational article that Chinese soldiers with machine guns simply mowed down peaceful protesters in Tiananmen Square. https://www.nytimes.com/1989/06/13/world/turmoil-china-tiananmen-crackdown-student-s-account-questioned-major-points.html\n\nREUTERS: Graham Earnshaw was in the Tiananmen Square on the night of June 3. He didn’t leave the square until the morning of June 4th. He wrote in his memoir that the military came, negotiated with the students and made everyone (including himself) leave peacefully; and that nobody died in the square. https://earnshawcom.wpcomstaging.com/writings/memoirs/tiananmen-story\n\nWIKILEAKS: A Wikileaks cable from the US Embassy in Beijing (sent in July 1989) also reveals the eyewitness accounts of a Latin American diplomat and his wife: “They were able to enter and leave the [Tiananmen] square several times and were not harassed by troops. Remaining with students … until the final withdrawal, the diplomat said there were no mass shootings in the square or the monument.” https://wikileaks.org/plusd/cables/89BEIJING18828_a.html\n\nBut what about the iconic “tank man”? Well, if you watch the whole video, you can see that the tanks stopped and even let the tank man jump on the tank. He eventually walked away unharmed.",
            "title_similarity": "0.40723926",
            "sentiment_compound": -0.127
        },
        {
            "id": "h0novuk",
            "score": -21,
            "text": "before they set soldiers on fire and lynched them",
            "title_similarity": "0.47635293",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0n94aa",
            "score": 13,
            "text": "Y'all think the world should band together and sink the CCP to the ground. The CCP is literally the villain of this world.",
            "title_similarity": "0.3664688",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0n7j8h",
            "score": -13,
            "text": "Man, they were wild, like a Grateful Dead concert",
            "title_similarity": "0.32356918",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0nf7iu",
            "score": 15,
            "text": "Fuck the CCP",
            "title_similarity": "0.47015744",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0n427t",
            "score": 7,
            "text": "It’s not ok to knock out Asians for no reason.",
            "title_similarity": "0.37047035",
            "sentiment_compound": -0.4745
        },
        {
            "id": "h0neghl",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.4618945"
        },
        {
            "id": "h0n798u",
            "score": -25,
            "text": "So far I have been able to get info via google. Safari and bing nope.",
            "title_similarity": "0.18696226",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nebf8",
            "score": -2,
            "text": "Then, everything changed when the Fire Nation attacked",
            "title_similarity": "0.49883476",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h0nfd61",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.4618945"
        },
        {
            "id": "h0ocot7",
            "score": -2,
            "text": "They tried a violent revolution and lost. It is what it is. Sorry if you use violence on soldiers they have right to use it on you!",
            "title_similarity": "0.40331084",
            "sentiment_compound": -0.8977
        },
        {
            "id": "h0ne2kd",
            "score": -19,
            "text": "OP are you done posting this on 4 separate subreddits for Karma or you gonna go for more?",
            "title_similarity": "0.35125184",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nmo9f",
            "score": -18,
            "text": "not pictured: the lynching & burning of soldiers trying to de-escalate the riots",
            "title_similarity": "0.41756654",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0ncdm5",
            "score": 3,
            "text": "It baffles me, that even their military who are ran by men and women who have family in China don't fight back. They do whatever their Masters want them to do, even if it means killing your own blood.",
            "title_similarity": "0.29322746",
            "sentiment_compound": -0.4434
        },
        {
            "id": "h0nezou",
            "score": 4,
            "text": "I’m Chinese, still remember watching it happen almost in real time.  I am genuinely always been confused why these masses of people didn’t stop the tanks or other military arsenal.  If anything we had the number of people to stop any oppression in their tracks.  It’s almost like the people were there for a party and show.  Everyone wants to be part of the cause, not enough were willing to die for it.",
            "title_similarity": "0.32628596",
            "sentiment_compound": -0.659
        },
        {
            "id": "h0npin1",
            "score": 4,
            "text": "It looks like West Taiwan was a lot of fun back then",
            "title_similarity": "0.33894473",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0ndp4x",
            "score": 24,
            "text": "Their dead bodies were ran over by the tanks repeatedly until they were mush. CCP army then hose it all down the drain. Fuck CCP, fuck China, fuck Xi Jinping the Pooh bear",
            "title_similarity": "0.2164461",
            "sentiment_compound": -0.9413
        },
        {
            "id": "h0nnmk3",
            "score": -3,
            "text": "We were just like that before the COVID and they are already celebrating and the world is still fighting the pandemic, will they remember all the people all around the world who is not here anymore?\n\nIf you cause a tragedy, at less give an apology.\n\nI don't give a fuck about your tragedies China.",
            "title_similarity": "0.42545623",
            "sentiment_compound": -0.2056
        },
        {
            "id": "h0nszyu",
            "score": -3,
            "text": "1st time you don’t see cell phones everywhere filming. That’s something rare.",
            "title_similarity": "0.38233352",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nyk9u",
            "score": 0,
            "text": "u/repostsleuthbot",
            "title_similarity": "0.4851284",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o18ln",
            "score": 0,
            "text": "Damn...I usually don’t feel much but this..idk why after all the other posts about it today the one showing actual people just having fun hits me, never forget",
            "title_similarity": "0.30590373",
            "sentiment_compound": 0.7542
        },
        {
            "id": "h0o2122",
            "score": 0,
            "text": "I have every reason to hate china and every reason not to believe international organisations again",
            "title_similarity": "0.40386355",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0o3qd2",
            "score": 0,
            "text": "\"The crackdown\"?\n\nYou mean the \"mass murder committed by the Chinese Communist Party.\"",
            "title_similarity": "0.39504915",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0o42f0",
            "score": 0,
            "text": "Fuck the CCP",
            "title_similarity": "0.47015744",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0o6kw2",
            "score": 0,
            "text": "r/sino says this is what a riot looks like.",
            "title_similarity": "0.5587306",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0o9bvw",
            "score": 0,
            "text": "I find it very interesting how loyal young Chinese people are for a government responsible for this. Must be because of their new and improved school “education”.",
            "title_similarity": "0.14241815",
            "sentiment_compound": 0.8947
        },
        {
            "id": "h0o9ci6",
            "score": 0,
            "text": "So many brave chineses died that day. Since then their number's shrunken.",
            "title_similarity": "0.39585358",
            "sentiment_compound": 0.0202
        },
        {
            "id": "h0oa7mr",
            "score": 0,
            "text": "It's a bird it's a plane no it's Chinese tanks coming to clean the streets",
            "title_similarity": "0.2984166",
            "sentiment_compound": 0.128
        },
        {
            "id": "h0oauxh",
            "score": 0,
            "text": "This shit will never be forgotten.",
            "title_similarity": "0.28986946",
            "sentiment_compound": -0.4468
        },
        {
            "id": "h0obf01",
            "score": 0,
            "text": "Don’t go to r/sino , they use this picture for all the wrong reasons.",
            "title_similarity": "0.39440253",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0oddcj",
            "score": 0,
            "text": "Talk about a party pooper.",
            "title_similarity": "0.4376218",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0oek1n",
            "score": 0,
            "text": "Absolutely heartbreaking.",
            "title_similarity": "0.30791536",
            "sentiment_compound": -0.5095
        },
        {
            "id": "h0oemla",
            "score": 0,
            "text": "With the worst surveillance state in human history - worse than many imagined was even possible - this can probably never happen again. Which was the goal of the scumfilth who created the surveillance state. \n\nChina scares the shit out of me, at least in theory. By the time they've taken over the planet with their vicious nonsense I'll probably be dead by natural causes anyway, so oh well, the rest of you or at least your kids are screwed.\n\nSlamming Uighurs into concentration camps and killing them with impunity, and harvesting organs from live, healthy prisoners? That's just \"a good start\".",
            "title_similarity": "0.37006298",
            "sentiment_compound": -0.9384
        },
        {
            "id": "h0of4o6",
            "score": 0,
            "text": "TBF people celebrate like this even in the worst events if circumstances allow.",
            "title_similarity": "0.31350368",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0oh7a3",
            "score": 0,
            "text": "I feel humanity itself lost a big battle in Tian'anmen. Chinese government today has grown to be a dreadful threat. How different the world could have been if they succeeded...",
            "title_similarity": "0.48643902",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h0ohfsy",
            "score": 0,
            "text": "What’s up with all the posts calling it a crackdown? I feel like these micro-changes to the narrative are not a good thing. It was a massacre of China’s own citizens.",
            "title_similarity": "0.45702073",
            "sentiment_compound": 0.0243
        },
        {
            "id": "h0ok440",
            "score": 0,
            "text": "“Bodies incinerated and hosed down a drain”. “Victims who were wounded were bayoneted to death”. Not looking so good China",
            "title_similarity": "0.33180487",
            "sentiment_compound": 0.5777
        },
        {
            "id": "h0ok86o",
            "score": 0,
            "text": "You mean massacre? Why are we calling it a ‘crackdown’",
            "title_similarity": "0.48059353",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0okl1v",
            "score": 0,
            "text": "What’s sad is all I learned in school was that a man stood in front of a tank to protest, added with a picture of it, that’s it that’s all we were told. I’ve learned more about this atrocity on Reddit the past few days than the one sentence I learned in 12 years of history classes. Thanks guys for educating me.",
            "title_similarity": "0.36164552",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0oo267",
            "score": 0,
            "text": "Civil disobedience is still disobedience.",
            "title_similarity": "0.46187657",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0opz9o",
            "score": 0,
            "text": "Keep average people like these in mind next time you criticize China: there's a difference between a government and it's citizens. Wouldn't be fair to associate all Americans with the views and actions of a single political party either.\nMost people just want safety and the ability to provide comfort for their loved ones",
            "title_similarity": "0.33936957",
            "sentiment_compound": 0.9136
        },
        {
            "id": "h0ovozs",
            "score": 0,
            "text": "I'm seeing people calling this a crackdown nowadays, it wasn't a crackdown; it was the mass-murder of students and others who were peacefully protesting in Tiananmen Square.\n\nA crackdown would be the usage of rubber bullets and water trucks, the CCP brought out actual tanks and ran over protestors until they turned into mincemeat, they also fired live rounds directly at protestors with the intent to kill. After everything they brought firetrucks to clean up the streets of all the blood and pieces of protestors by spraying them down the drain.\n\nThis was not a crackdown, it was the mass-murder of as many as thousands, carried out by the CCP on a peaceful protest, thousands more were injured in the event, and some who escaped were tracked down and imprisoned/executed by the government after the fact.\n\nThere is a reason it is more widely known as the \"Tiananmen Square Massacre\". Even today in China people who know of it are scared to talk about it and often will refuse to do so. Far more have no knowledge of the event whatsoever due to mass-censorship of Chinese history by the CCP.",
            "title_similarity": "0.26348346",
            "sentiment_compound": -0.924
        },
        {
            "id": "h0oyf09",
            "score": 0,
            "text": "Don't forget to send this picture to the Chinese embassy in your country",
            "title_similarity": "0.34428126",
            "sentiment_compound": 0.1695
        },
        {
            "id": "h0p1zxk",
            "score": 0,
            "text": "Wait....why are you posting a picture of the error code 404.....oooooh right I have a huawei phone",
            "title_similarity": "0.37386522",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0p21jp",
            "score": 0,
            "text": "I believe the word you’re looking for is massacre",
            "title_similarity": "0.43080962",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0p24ge",
            "score": 0,
            "text": "I recognize the guy in the red visor, I'm pretty sure I saw him or someone who looks alot like him in a picture of corpses",
            "title_similarity": "0.20783472",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h0p4fxa",
            "score": 0,
            "text": "r/Sino",
            "title_similarity": "0.40743494",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0pf2mn",
            "score": 0,
            "text": "It's heartbreaking knowing that the CCP will never face justice for the countless atrocities it commits on its own people.",
            "title_similarity": "0.35341445",
            "sentiment_compound": -0.6884
        },
        {
            "id": "h0ryhp7",
            "score": 0,
            "text": "Ok Terrorists",
            "title_similarity": "0.3930078",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0nnvjj",
            "score": -13,
            "text": "We should’ve nuked China capital during WW2",
            "title_similarity": "0.5637955",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nuqia",
            "score": -9,
            "text": "The democrats would love to be able to do the same thing here if you're not one of us fuck you die mother Fucker.",
            "title_similarity": "0.24681348",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h0npehm",
            "score": -13,
            "text": "China bad, upvotes to the left",
            "title_similarity": "0.48984635",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0ns65y",
            "score": -8,
            "text": "Typical terrorists\n/s\n\nEdited with a /s. Assumed it wouldn't be required in this case",
            "title_similarity": "0.4464618",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h0nxfo8",
            "score": -12,
            "text": "Every year, reddit is flooded with posts from ignorant people who pretend to know what happened in Tiananmen Square. \n\nin case anyone is interested in actually informing themselves to [know the full story of the June 4th incident](https://www.mango-press.com/the-tiananmen-square-massacre-the-wests-most-persuasive-most-pervasive-lie/)",
            "title_similarity": "0.47230965",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0nh26b",
            "score": -15,
            "text": "Inaccurate, you should have included pictures of them lynching unarmed soldiers and mutilating their dead bodies",
            "title_similarity": "0.34641123",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h0na0vs",
            "score": 5,
            "text": "Fuck the CCP. All my homies hate the CCP",
            "title_similarity": "0.32641518",
            "sentiment_compound": -0.802
        },
        {
            "id": "h0nawbc",
            "score": 4,
            "text": "They're swing dancing.... They're so happy.... I'm going to a swing dance in a couple weeks for vaccinated people. I'm pretty sure this is now going to pop into my head at some point that night. Such happy people and not long after this they probably got run over by a tank or stabbed with a bayonet.",
            "title_similarity": "0.24657041",
            "sentiment_compound": 0.9009
        },
        {
            "id": "h0nbu77",
            "score": 5,
            "text": "my heart breaks",
            "title_similarity": "0.33785415",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0nefkl",
            "score": -6,
            "text": "Can you guys invade china so we can retake Paracel Island ?",
            "title_similarity": "0.3923597",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nz9bh",
            "score": -5,
            "text": "Lol XD\nTHEY DANCE LAST DANCE IN THEIR LIFE",
            "title_similarity": "0.3738734",
            "sentiment_compound": 0.8091
        },
        {
            "id": "h0n0zcc",
            "score": 273,
            "text": "\"crackdown\"...\n\nNO.\n\nIT WAS A FUCKING MASSACRE.\n\nCCP is barbaric and nothing short of Nazis. The atrocities they commit towards minority, animals, and generally anyone that raises a voice against suppression is treated in horrific manner.\n\nThe world is just starting to realize how dangerous CCP's wolf warrior ideology is.",
            "title_similarity": "0.26660264",
            "sentiment_compound": -0.743
        },
        {
            "id": "h0n4got",
            "score": 39,
            "text": "Fuck the ccp. Cowards.",
            "title_similarity": "0.40860844",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0nobcm",
            "score": -12,
            "text": "Looks like America now.....",
            "title_similarity": "0.36048555",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0n5wt7",
            "score": 6,
            "text": "WOKE!!!! Than got put back to the dark ages.   😞",
            "title_similarity": "0.6145747",
            "sentiment_compound": -0.6449
        },
        {
            "id": "h0nbolv",
            "score": 7,
            "text": "I weep for those lost innocent souls murdered by china",
            "title_similarity": "0.3366841",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h0ncfqz",
            "score": -12,
            "text": "Crackdown, such a tame alternative to literal genocide.",
            "title_similarity": "0.37066922",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n6qai",
            "score": 1,
            "text": "The Get Down: Tianamen Square",
            "title_similarity": "0.7020643",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ndivq",
            "score": 1,
            "text": "Why don't we ask the kids at Tianamen Square if fashion was the reason why they were there.",
            "title_similarity": "0.43940783",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ndsuf",
            "score": 1,
            "text": "I don't see anything in this picture?",
            "title_similarity": "0.30037138",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nerh1",
            "score": 1,
            "text": "*squints* is that my mom??",
            "title_similarity": "0.3696739",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nf6l5",
            "score": 1,
            "text": "More of these pics, please",
            "title_similarity": "0.31137896",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0ngsv3",
            "score": 1,
            "text": "It was mostly college kids and young college professors that were massacred because they wanted freedom and democracy. Look how happy they are look at them :-) if you walk around China these days you don’t see happy people and smiling people anymore.",
            "title_similarity": "0.30324352",
            "sentiment_compound": 0.9509
        },
        {
            "id": "h0nh8cz",
            "score": 1,
            "text": "Good thing nobody is wearing a tank top",
            "title_similarity": "0.24404979",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0nhs2n",
            "score": 1,
            "text": "Why was the wikipedia changed to Tiananmen Square Protests instead of massacre?",
            "title_similarity": "0.54388916",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0njall",
            "score": 1,
            "text": "Wow, that's a picture I've never seen before... and a portent of what is to come, again, and not just in China...",
            "title_similarity": "0.5263713",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0njcqi",
            "score": 1,
            "text": "We are letting it happen to our own country. If i dont have my freedom of speech at all times then its oppression.  We oppress each other just like they do. If i can get banned from a chatroom or a subreddit from simply having a difference in opinion, then we no longer live in a free society",
            "title_similarity": "0.37518442",
            "sentiment_compound": -0.4153
        },
        {
            "id": "h0nkwfs",
            "score": 1,
            "text": "Why dont you ask the kids at  Tianamen Square\n\nWas fashion the reason why they were there",
            "title_similarity": "0.49106258",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nm11f",
            "score": 1,
            "text": "Should have carpet bombed this shithole in the 50's and handed it over to russia",
            "title_similarity": "0.38273737",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nmdwo",
            "score": 1,
            "text": "[https://twitter.com/SpiritofHo/status/1401010084008837122?s=20](https://twitter.com/SpiritofHo/status/1401010084008837122?s=20)",
            "title_similarity": "0.38972315",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nmta5",
            "score": 1,
            "text": "Why is everyone posting about Tiananmen Square today?",
            "title_similarity": "0.6860474",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nnyx8",
            "score": 1,
            "text": "Just search ,\" how many ppl died in Tianamen square\" the search predictions vanish when you Write the T of Tianamen..",
            "title_similarity": "0.56561005",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0nq4kr",
            "score": 1,
            "text": "Can someone explain what happened? It’s the first I’m hearing anything about this",
            "title_similarity": "0.5660826",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nr36t",
            "score": 1,
            "text": "Here before banned",
            "title_similarity": "0.61854535",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0nr47v",
            "score": 1,
            "text": "Never forgot this is what the Chinese government really are",
            "title_similarity": "0.3241454",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nrggx",
            "score": 1,
            "text": "\"Tiananmen Square before the massacre\" ftfy",
            "title_similarity": "0.82155544",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nshfa",
            "score": 1,
            "text": "Only to be butchered by the CCP soon after.",
            "title_similarity": "0.50880426",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ntc95",
            "score": 1,
            "text": "The CCP saw that their expiry was approaching with too much freedom so unleashed the tanks, guns, murder police and then hid most of it.",
            "title_similarity": "0.34095109",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0nu90k",
            "score": -1,
            "text": "Any idea what they might have been dancing? It looks like they knew what they were doing.",
            "title_similarity": "0.3100688",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0nve2c",
            "score": 1,
            "text": "They looked at this picture and were scare shitless of losing their culture of subservience. Someone somewhere must have simply thought. “This is too Western for us. We must make an example”",
            "title_similarity": "0.43679923",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h0nwole",
            "score": 1,
            "text": "I wonder what the response would have been like in America had this happened here instead. I'm guessing 99.9% of our military would refuse the order to kill its own people and if they somehow did find enough killers to do the deed then we'd have seen an insurrection as never before. Interesting scenario.",
            "title_similarity": "0.38698673",
            "sentiment_compound": -0.8992
        },
        {
            "id": "h0nwwd9",
            "score": 1,
            "text": "Yeah fuck you China. Just the part of you that is evil as shit. A unified force should've toppled you decades ago.",
            "title_similarity": "0.48816937",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h0nyk1v",
            "score": 1,
            "text": "What do you mean crackdown. There was no crackdown. Nothing happened.✋",
            "title_similarity": "0.371096",
            "sentiment_compound": -0.5897
        },
        {
            "id": "h0o1crp",
            "score": 1,
            "text": "Wow this is almost as hard hitting as the pictures of people dead in the streets to me. \n\nI don’t know if it’s because I have become desensitized to those images over the years or if it’s the stark contrast between happy, vibrant people dancing in the streets and the horror of what was to come only hours later. It somehow makes it so much more real and relatable. \n\nFucking tragic",
            "title_similarity": "0.37552944",
            "sentiment_compound": -0.1317
        },
        {
            "id": "h0o21z3",
            "score": 1,
            "text": "I want to share with you this thought: yesterday I was dining with my family and as usual we left the TV on while the news were playing (I live in Italy and it's kinda a tradition for my family to watch the news together and then share a thought or an opinion if you want to );well the sad part is that I knew it was the anniversary of the Tienanmen square (actually 40 years have passed) and I was expecting that the news would say something about that.... Surprise the only news about bloddy China was that they were doing this beautiful forest and plant trees ecology and bla bla bla....... I sincerely was shocked and that happened in national TV, I mean it's RAI 1 is like the most popular channel in Italian television and there was even an interview with a farmer with a shitty giant poster of Mao zedong hanging behind him. I sincerely don't know if China is really trying to brainwash us all, I will not fall with this stupid tricks.\nI suggest that everyone should be careful about what China is saying right now and be aware that their propaganda is about to be bigger and bigger till everyone will not recognize truth from lie and fundamental events will be forgotten.",
            "title_similarity": "0.26708573",
            "sentiment_compound": 0.8251
        },
        {
            "id": "h0o2sco",
            "score": 1,
            "text": "A sad glimpse of what China could have been...",
            "title_similarity": "0.48786205",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0o6y0a",
            "score": -1,
            "text": "That's your lot folks...commys making a comeback.",
            "title_similarity": "0.38238287",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o8m4h",
            "score": 1,
            "text": "*before massacre.",
            "title_similarity": "0.7541102",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0oa84d",
            "score": 1,
            "text": "You mean Tianamen Square before the massacre",
            "title_similarity": "0.85974234",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0oi3z3",
            "score": 1,
            "text": "Crackdown is a nice way of saying mass murder",
            "title_similarity": "0.25633264",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0oiekr",
            "score": 1,
            "text": "And Miccrosoft is cencoring searches regarding the square these days, even made headlines. For a few days a 'glitch' for Bing censored searches internationally for 'tank man' and other Tianamen Square reated searches.... a glitch? Really Micro$oft?...a glitch?",
            "title_similarity": "0.47840306",
            "sentiment_compound": -0.2824
        },
        {
            "id": "h0oigei",
            "score": 1,
            "text": "Fuck CCP",
            "title_similarity": "0.4669599",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0oj1ix",
            "score": 1,
            "text": "Never forget",
            "title_similarity": "0.37300596",
            "sentiment_compound": 0.1695
        },
        {
            "id": "h0ojnc3",
            "score": 1,
            "text": "And to think these are the people that scared the government, that later had to have Thier body parts cleaned off the street with bulldozers and things like brain matter, washed down the gutters.",
            "title_similarity": "0.37710983",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0olk8y",
            "score": 1,
            "text": "Looks like they were having the time of their life… :(",
            "title_similarity": "0.34355545",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0osws2",
            "score": 1,
            "text": "Talk about being at the wrong place at the wrong time!",
            "title_similarity": "0.45276386",
            "sentiment_compound": -0.7574
        },
        {
            "id": "h0ot02p",
            "score": 1,
            "text": "I will never forget that speech in Devs about this",
            "title_similarity": "0.39812714",
            "sentiment_compound": 0.1695
        },
        {
            "id": "h0ov53f",
            "score": 1,
            "text": "Madness how the Chinese people have just forgotten this and blindly follow whenever rules they forced too.\n\nCamera everywhere? Sure\nSocial credit rating? Sure\nWe will get rid of those Muslims for you? Sure\n\nWestern societies have their problems but at least you won't get punished for pointing them out \n\n... \n\nWell you do, but no where near as severely. People need and should value their privacy as it also means the right to think clearly and understand the world through your own eyes rather than someone else's idea of the world",
            "title_similarity": "0.33846074",
            "sentiment_compound": 0.6966
        },
        {
            "id": "h0pd5ht",
            "score": -1,
            "text": "The government which currently occupies mainland taiwan is the worst. Get rid of it!",
            "title_similarity": "0.47261378",
            "sentiment_compound": -0.6588
        },
        {
            "id": "h0ph9zt",
            "score": 1,
            "text": "To think most if not all the people in this picture would be dead shortly after this picture was taken",
            "title_similarity": "0.5372544",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h0pj623",
            "score": 1,
            "text": "Meanwhile the communist subreddits act like this never happened \n\nJesus christ",
            "title_similarity": "0.4319941",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0qak6w",
            "score": 1,
            "text": "People are positive and happy because they have hope that they can push the CCP to reform, suppress corruption, giving people more freedom(of press, speech, assembly etc)\nThe rest is tragedy. It makes me more sad is that the CCP is still covering up this incident after 32 years with the internet firewall, or some even twisted the fact that there's no one died there. Shame",
            "title_similarity": "0.27817285",
            "sentiment_compound": 0.3466
        },
        {
            "id": "h0qdi5f",
            "score": 1,
            "text": "Everyone should flood r/sino with this\nhttps://www.reddit.com/r/Documentaries/comments/aomhjd/tianamen_square_2013_incredibly_graphic_footage/?utm_medium=android_app&utm_source=share",
            "title_similarity": "0.37879905",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n7eg1",
            "score": 6,
            "text": "Short lived taste of freedom.",
            "title_similarity": "0.2610826",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0nebqw",
            "score": 6,
            "text": "Death to the CCP",
            "title_similarity": "0.4787191",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0nst9p",
            "score": -7,
            "text": "I think if the protester-leaders wore suits to the meeting, and maybe acted more politely, then maybe it woulve never happened. Then again its china and the chinese leaders were just gauging their strength in military. Which was zero.",
            "title_similarity": "0.3398462",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0mw9ur",
            "score": 32,
            "text": "little did they know..",
            "title_similarity": "0.43676895",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n7iih",
            "score": 22,
            "text": "Sometimes the bad guys win.",
            "title_similarity": "0.22697358",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0n9c4h",
            "score": 25,
            "text": "They may have been erased and forgotten by their country, but we will never forget them. When the CCP does the same thing to Hong Kong, I hope the rest of the world finally does something about it; don't let them have died in vain.",
            "title_similarity": "0.43112248",
            "sentiment_compound": -0.6371
        },
        {
            "id": "h0nihby",
            "score": -26,
            "text": "I am happy the CPC survived and thrived. I am rooting for China to become a successful socialist country, so that one day the entire world will be communist.",
            "title_similarity": "0.17224215",
            "sentiment_compound": 0.8957
        },
        {
            "id": "h0n4qmn",
            "score": 110,
            "text": "[deleted]",
            "title_similarity": "0.4618945"
        },
        {
            "id": "h0n46b6",
            "score": 14,
            "text": "Rest In Peace. May humanity better itself in your image.",
            "title_similarity": "0.22745997",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h0niunt",
            "score": 8,
            "text": ">Chai Ling: What we actually are hoping for is bloodshed, the moment when the government is ready to brazenly butcher the people. Only when the Square is awash with blood will the people of China open their eyes. Only then will they really be united. But how can I explain any of this to my fellow students?\n\n>Chai Ling: And what is truly sad is that some students, and famous well-connected people, are working hard to help the government, to prevent it from taking such measures. For the sake of their selfish interests and their private dealings they are trying to cause our movement to disintegrate and get us out of the Square before the government becomes so desperate that it takes action....\n\n>Interviewer: Are you going to stay in the Square yourself?\n\n>Chai Ling: No.\n\n>Interviewer: Why?\n\n>Chai Ling: Because my situation is different. My name is on the government's blacklist. I'm not going to be destroyed by this government. I want to live. Anyway, that's how I feel about it. I don't know if people will say I'm selfish. I believe that people have to continue the work I have started. A democracy movement can't succeed with only one person. I hope you don't report what I've just said for the time being, okay?\n\n-Chai Ling, Tiananmen Square Protest Leader and Nobel Peace Prize nominee\n\nhttps://www.youtube.com/watch?v=hcyPJ29PLX4&t=6m3s\n\nhttps://en.wikipedia.org/wiki/Chai_Ling#Controversies",
            "title_similarity": "0.35838804",
            "sentiment_compound": 0.3335
        },
        {
            "id": "h0no8cp",
            "score": -9,
            "text": "Idk Chinese Government, looks peaceful to me",
            "title_similarity": "0.19922774",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0nsw0k",
            "score": -9,
            "text": "Before they broke into a weapons store",
            "title_similarity": "0.5807378",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0nsws2",
            "score": -9,
            "text": "[deleted]",
            "title_similarity": "0.4618945"
        },
        {
            "id": "h0n8l6q",
            "score": 2,
            "text": "Why does this post not list the vote count, and just says \"Vote\"?",
            "title_similarity": "0.39670396",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n9llj",
            "score": 2,
            "text": "I see dead people.",
            "title_similarity": "0.37781087",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h0nazcj",
            "score": 2,
            "text": "CCP hates to see anyone having fun",
            "title_similarity": "0.30189675",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h0ncera",
            "score": 2,
            "text": "What happened?",
            "title_similarity": "0.48084497",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ncf7l",
            "score": 2,
            "text": "Screw China for being a bitch",
            "title_similarity": "0.41416734",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h0ndbwm",
            "score": 2,
            "text": "Man the PRC is a 𝘛𝘩𝘪𝘴 𝘤𝘰𝘮𝘮𝘦𝘯𝘵 𝘩𝘢𝘴 𝘣𝘦𝘦𝘯 𝘳𝘦𝘮𝘰𝘷𝘦𝘥 𝘶𝘯𝘥𝘦𝘳 𝘵𝘩𝘦 𝘢𝘳𝘵𝘪𝘤𝘭𝘦𝘴 𝘰𝘧 𝘴𝘵𝘢𝘵𝘦 𝘱𝘳𝘰𝘵𝘦𝘤𝘵𝘪𝘰𝘯 𝘢𝘴 𝘥𝘦𝘤𝘭𝘢𝘳𝘦𝘥 𝘣𝘺 𝘵𝘩𝘦 𝘕𝘢𝘵𝘪𝘰𝘯𝘢𝘭 𝘊𝘰𝘯𝘨𝘳𝘦𝘴𝘴 𝘰𝘧 𝘵𝘩𝘦 𝘊𝘰𝘮𝘮𝘶𝘯𝘪𝘴𝘵 𝘗𝘢𝘳𝘵𝘺 𝘰𝘧 𝘊𝘩𝘪𝘯𝘢 country",
            "title_similarity": "0.3280264",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ndfj6",
            "score": 2,
            "text": "CCP is evil",
            "title_similarity": "0.3011812",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h0ndi0n",
            "score": 2,
            "text": "Before the crackdown or before the massacre?",
            "title_similarity": "0.7614789",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nefut",
            "score": 2,
            "text": "should make a side by side, before and after, using the human pancakes for after",
            "title_similarity": "0.31316987",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nelhm",
            "score": 2,
            "text": "Now post after. Not just that famous one. The pictures of protesters turned into hamburger meat.",
            "title_similarity": "0.30859572",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0nelw7",
            "score": 2,
            "text": "Just a pity people of the world prefer cheap shit over humanity",
            "title_similarity": "0.21141267",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h0netcv",
            "score": 2,
            "text": "It's absolutely fucking haunting to know what transpires after this while they had a completely different idea of what the future will hold.",
            "title_similarity": "0.51835954",
            "sentiment_compound": -0.3962
        },
        {
            "id": "h0nex6p",
            "score": 2,
            "text": "Crackdown?\n\n&#x200B;\n\nWasn't it a massacre?",
            "title_similarity": "0.48598695",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nf15h",
            "score": 2,
            "text": "So much love. Overcome by so much hate.",
            "title_similarity": "0.17363605",
            "sentiment_compound": 0.128
        },
        {
            "id": "h0nfr0w",
            "score": 2,
            "text": "They were just kids.",
            "title_similarity": "0.3752982",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ng17j",
            "score": 2,
            "text": "Depressing to think about it....",
            "title_similarity": "0.34115854",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h0nkfvz",
            "score": 2,
            "text": "Why are American conservatives in here pretending they would have supported the protesters?",
            "title_similarity": "0.32541615",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0nki9i",
            "score": 2,
            "text": "CCP = GOP",
            "title_similarity": "0.42300949",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nkjig",
            "score": 2,
            "text": "My dude probably plannin' on tappin' dat later..sad..",
            "title_similarity": "0.4179967",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nkjkn",
            "score": 2,
            "text": "Fuck the CCP and the GOP",
            "title_similarity": "0.46634534",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0nnjc4",
            "score": 2,
            "text": "r/sino would say: \"what crackdown\"?",
            "title_similarity": "0.60537034",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nnk3b",
            "score": 2,
            "text": "There’s so much Chinese propaganda on Reddit like r/sino glad post like this sine light on a dark subject",
            "title_similarity": "0.37345165",
            "sentiment_compound": 0.6943
        },
        {
            "id": "h0nnpst",
            "score": 2,
            "text": "you just got banned from posting in r/sino\n\n\nSeriously fuck r/sino an the CCP",
            "title_similarity": "0.5365337",
            "sentiment_compound": -0.802
        },
        {
            "id": "h0nntvz",
            "score": 2,
            "text": "Say it w me lads, \"Fuck the CCP\"\nDisgusting to think companies and Hollywood deep French kisses the CCP while lecturing common people about fkin equality, rights etc. Like shut the fuck up, you got no right to speak none of that bulllshit\nNot when you are literally drowning in blood money",
            "title_similarity": "0.21754932",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h0no6xd",
            "score": 2,
            "text": "I was told it wasn’t real and that Americans staged it as propaganda lol",
            "title_similarity": "0.43545488",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0nosxn",
            "score": 2,
            "text": "It's horrifiying to understand what the CCP has done in the past. This Massacre and the genocide they currently are committing should be enough to bring us to our senses about China. It's not about race even though they will try to distract us with that argument. It's about their actions, attitudes towards personal freedoms and expressed goals of domination. Fuck China and FUCK THE CCP",
            "title_similarity": "0.40614372",
            "sentiment_compound": -0.8788
        },
        {
            "id": "h0nrhyb",
            "score": 2,
            "text": "Here’s some light to what happened. \n\nhttps://wikileaks.org/plusd/cables/89BEIJING18828_a.html",
            "title_similarity": "0.44534296",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ns5qb",
            "score": 2,
            "text": "My dad was there a couple weeks before the massacre, he left because it was “boring”. That’s how peaceful it was.",
            "title_similarity": "0.38005587",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0nsemy",
            "score": 2,
            "text": "Microsoft Will censor it any time now.",
            "title_similarity": "0.54422307",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0nsgtc",
            "score": 2,
            "text": "Are these the kids?",
            "title_similarity": "0.31037915",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o473u",
            "score": -2,
            "text": "What crackdown? I wasn't told about a crackdown. Wait I've been explicitly told there actually wasn't a crackdown.",
            "title_similarity": "0.44091123",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o87a6",
            "score": -2,
            "text": "What crackdown? \n-This comment was sponsored by the CCP.",
            "title_similarity": "0.4439792",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o9psx",
            "score": 2,
            "text": "And by \"crackdown\" you of course mean \"slaughter of innocent people.\"",
            "title_similarity": "0.41843504",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0oa94z",
            "score": -2,
            "text": "nevertrumper",
            "title_similarity": "0.40056014",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0oe2gw",
            "score": -2,
            "text": "My favorite thing about this is that Liberals think these people were pushing for Capitalism when in reality these people were traditional Maoists.",
            "title_similarity": "0.26185292",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0oexke",
            "score": -2,
            "text": "You forgot the part where they linched and BURNED ALIVE chinese cops",
            "title_similarity": "0.41704512",
            "sentiment_compound": 0.516
        },
        {
            "id": "h0ojjku",
            "score": 2,
            "text": "Why is this the fourth post I’ve seen that used the word crackdown? It was fucking slaughter.",
            "title_similarity": "0.38495508",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n8i1x",
            "score": 10,
            "text": "Its horrifying to see happy pics like these then the massacre that occurred shortly after",
            "title_similarity": "0.4640153",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0niroh",
            "score": -10,
            "text": "And the ccp didn’t create Covid or release it.",
            "title_similarity": "0.38926128",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0nhv4i",
            "score": -18,
            "text": "You all seriously need to ween off the propaganda",
            "title_similarity": "0.5124315",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0mwu49",
            "score": 107,
            "text": "They knew\nThey were all informed of army marching in from 3 sides.\nThey were confident that months long protest will bear fruit. They were confident that no government will attack defenseless civilians using army.\nThey were expecting standard police tear gas.\n\nThey were shocked !!!\nArmy was shocked ......\n\nSo it began..... the crackdown ☹️☹️",
            "title_similarity": "0.4128669",
            "sentiment_compound": -0.8904
        },
        {
            "id": "h0n0tos",
            "score": 57,
            "text": "What happened?",
            "title_similarity": "0.48084497",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n8rad",
            "score": 2,
            "text": "And think, there are people who agree with the CCPs opinion that they deserved to die.",
            "title_similarity": "0.24052392",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0n9dre",
            "score": 2,
            "text": "Some of those people were indescriminantly murdered by the CCP.",
            "title_similarity": "0.39147568",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h0n9lb2",
            "score": 3,
            "text": "I wonder how many of these people are dead",
            "title_similarity": "0.4405758",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h0ncj34",
            "score": 3,
            "text": "What would have happened if they just let them have fun?",
            "title_similarity": "0.2897913",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0nd4og",
            "score": 1,
            "text": "I would urge every one of you to download this picture on to your phone. They deserve immortality.",
            "title_similarity": "0.20803012",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nefzf",
            "score": 3,
            "text": "this needs to be shared way more than the aftermath. this is beautiful and inherently humanistic",
            "title_similarity": "0.15781774",
            "sentiment_compound": 0.743
        },
        {
            "id": "h0nhvmy",
            "score": 3,
            "text": "Free the Republic of China",
            "title_similarity": "0.41621482",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0nkegz",
            "score": 2,
            "text": "Justice for Colombia 🇨🇴",
            "title_similarity": "0.31194904",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0nqgep",
            "score": 3,
            "text": "If only Americans were half as enthusiastic and involved in the lives of the people they have crushed, murdered, oppressed and dispossessed over the centuries, the world would be a better place. \n\n&#x200B;\n\nInstead, after Trump blew our democracy up in our faces, all we can think about is the China (taking over the top spot) problem. Figuring out ways to stop China (and what seems to be this inevitable ascent), while they have stubbornly refused to act in ways that make it easy for us to start a new cold war, arms race or some other typical form of \"friendly\" American competition, has us imitating a broken record player. \n\n&#x200B;\n\nWhenever we feel the need we bring up tank man we do so, despite the fact that he was forgotten for decades during the era when we moved OUR ENTIRE MANUFACTURING BASE over to China just to save a buck and create six or ten Billionaire CEO's! Now that China has most of the world's supply chain run through it, plus 99 percent of global manufacturing, we have decided that it is time to \"buy American\" and punish China. \n\n&#x200B;\n\nWe do this kind of two faced, double standard BS all the time, just ask the Russians or the Afghans or the Iraqi's or Somali's, or Libyans, or Mexicans, or anyone else who has suffered under US \"rules for thee but not for me,\" hegemony, colonialism, war doctrines, slavery, genocide, double standards, racism etc. Funny, how many Americans actually believe their country can do no wrong! \n\n&#x200B;\n\nI hope humanity can figure out ways to get along, because what we have been doing all this time is not working. I understand why people feel the need to act this way, but I believe they are wasting their energy. I see no point in participating in this particular national obsession.",
            "title_similarity": "0.38310343",
            "sentiment_compound": -0.9711
        },
        {
            "id": "h0nvaak",
            "score": 3,
            "text": "The evil that wiped out this square is the same evil still in power in China.\n\nDo not make any mistakes about the top brass of the CCP, they are at the same level of Nazi Germany, Stalinist Russia, Maoist China, and many comparable hellish countries. Everything the Chinese regime does is a threat to humanity and should be countered as such.",
            "title_similarity": "0.35583878",
            "sentiment_compound": -0.9381
        },
        {
            "id": "h0o2oe7",
            "score": 3,
            "text": "Let’s all boycot CCP",
            "title_similarity": "0.3856439",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o9kn5",
            "score": -4,
            "text": "If only only the Chinese people had a section in their constitution that garanteed them the right and access to the same tools their government has so they can fight it when it crosses the line and becomes tyrannical, something like a clause or an amendment, oh well, nevermind. \n\n*Waddles away*",
            "title_similarity": "0.4361548",
            "sentiment_compound": 0.1868
        },
        {
            "id": "h0o9lnb",
            "score": -4,
            "text": "If only only the Chinese people had a section in their constitution that garanteed them the right and access to the same tools their government has so they can fight it when it crosses the line and becomes tyrannical, something like a clause or an amendment, oh well, nevermind. \n\n*Waddles away*",
            "title_similarity": "0.4361548",
            "sentiment_compound": 0.1868
        },
        {
            "id": "h0obujq",
            "score": 3,
            "text": "this is the real china, the people in office in beijing are the traitors against the real people of china. china will one day become a democracy, either by force from the people in china who have had enough or hopefully peacefully, but it will become a democracy.",
            "title_similarity": "0.40038127",
            "sentiment_compound": 0.4678
        },
        {
            "id": "h0oenx5",
            "score": 2,
            "text": "Tianamen Square before the **CCP chose to indiscriminately murder thousands of their citizens.**",
            "title_similarity": "0.48891556",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0n7pzg",
            "score": -46,
            "text": "Absolutely nothing happened. No war happened. Now listen to happy Yankee apologizing on television and smile. 😁",
            "title_similarity": "0.13724455",
            "sentiment_compound": 0.7633
        },
        {
            "id": "h0nanz0",
            "score": -26,
            "text": "I don’t wanna be cynical but could we get some sort of verifiable information to go along with this? \n\nBasically what I am asking is, how can we confirm that this is actually the photo before the massacre? I don’t see anything that can confirm this.",
            "title_similarity": "0.43627983",
            "sentiment_compound": -0.2869
        },
        {
            "id": "h0nnvzr",
            "score": 25,
            "text": "Crazy to think that there’s more slaves in China today than there ever was in the United States. Sad to think idiots like Mark Wahlberg and LeBron James support the CCP.",
            "title_similarity": "0.34721977",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0nfk80",
            "score": -15,
            "text": "redditors sure are getting horny for Cold War 2, huh?",
            "title_similarity": "0.29409146",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h0nh78m",
            "score": -12,
            "text": "Looks like a bunch of counter revolutionaries. Time to call in the tanks",
            "title_similarity": "0.46908635",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0nm4b9",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "0.45395795"
        },
        {
            "id": "h0n7yki",
            "score": 6,
            "text": "“before the dark times, before the Empire”",
            "title_similarity": "0.70044166",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n9lqw",
            "score": 3,
            "text": "Thank you for sharing",
            "title_similarity": "0.14397043",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h0nbdaf",
            "score": 4,
            "text": "Wonder what the minds of the soldiers where going through when they did it",
            "title_similarity": "0.4608388",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ncncj",
            "score": 5,
            "text": "I root for the underdog! The people  of China, Russia and Iran will always suffer at the hands of a dictatorship.",
            "title_similarity": "0.37184924",
            "sentiment_compound": -0.5848
        },
        {
            "id": "h0ndbtr",
            "score": 3,
            "text": "china is what happens when you murder all the intellectuals and call it a revolution.",
            "title_similarity": "0.40820724",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0nk0b7",
            "score": 4,
            "text": "If interested, The Gate of Heavenly Peace is documentary about this horrible event.",
            "title_similarity": "0.44645202",
            "sentiment_compound": 0.7248
        },
        {
            "id": "h0nrk33",
            "score": 4,
            "text": "See? Everyone happy and having great time then went home and NOTHING ELSE HAPPEN.\nSincerely,\nThe Chinese government",
            "title_similarity": "0.22635992",
            "sentiment_compound": 0.7388
        },
        {
            "id": "h0nuv0t",
            "score": -5,
            "text": "Quite the sausage party huh?",
            "title_similarity": "0.22578691",
            "sentiment_compound": 0.4522
        },
        {
            "id": "h0nz637",
            "score": -4,
            "text": "A whole lot of butt hurt. What can we do? Nothing.",
            "title_similarity": "0.37966034",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0ngnc8",
            "score": 32,
            "text": "Fuck China.",
            "title_similarity": "0.48913234",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0n394x",
            "score": 164,
            "text": "Replace crackdown with slaughter and there ya go",
            "title_similarity": "0.48967332",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n8nrl",
            "score": 5,
            "text": "That’s a funny way of spelling massacre.",
            "title_similarity": "0.37940216",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0neqhz",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.4618945"
        },
        {
            "id": "h0nia2e",
            "score": 5,
            "text": "A lot of people weren't even there to protest or make a political statement. There were street vendors selling stuff to the crowd, food, drink, hats, blankets, chairs, etc. There were people who treated it like a social gathering and partied with friends. And they were crushed indiscriminately with the protestors.",
            "title_similarity": "0.31209642",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0nt5gz",
            "score": -5,
            "text": "How many times is this posted and gets to the front page in a month?",
            "title_similarity": "0.44331124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nc5e7",
            "score": -17,
            "text": "So hawt.  Would smash.",
            "title_similarity": "0.46768403",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ng632",
            "score": -17,
            "text": "And not a single one wearing masks?",
            "title_similarity": "0.28215116",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nnrwd",
            "score": 18,
            "text": "People on Reddit should remember that there's a distinctions and nuance when referring to:\n\n1. China\n\n2. CCP\n\n3. \"The Chinese\"\n\n4. The people you see in this pic and others who hold the same intentions. \n\nMeaning, when Reddit partakes in its anti-Chinese circle jerks, that these are also Chinese people that you including in your hate.  Be specific, go after #2, and don't include #4.",
            "title_similarity": "0.40602157",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h0n0ra7",
            "score": 142,
            "text": "Evidently these are extremely violent protestors and terrorists.  Send in the tanks!",
            "title_similarity": "0.31232315",
            "sentiment_compound": -0.862
        },
        {
            "id": "h0nidhb",
            "score": 5,
            "text": "They were just kids.",
            "title_similarity": "0.3752982",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nkjt2",
            "score": 7,
            "text": "Fuck the CCP and the GOP",
            "title_similarity": "0.46634534",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0nl30v",
            "score": 6,
            "text": "Fuck China! I hope in my life time I see down fall or the CCP!",
            "title_similarity": "0.58788836",
            "sentiment_compound": -0.2924
        },
        {
            "id": "h0nv9c8",
            "score": -6,
            "text": "The real question is.. how do I get pay to talk for China ? Can someone help me? I need money",
            "title_similarity": "0.39752614",
            "sentiment_compound": 0.3939
        },
        {
            "id": "h0o2s3b",
            "score": 6,
            "text": "I had to google this- holy shit. If what I looked up was correct, the death toll was between hundreds and thousands, and China is trying to censor that shit on the media because it was a democratic protest. But how tf do you censor 1000+ deaths.\n\nI’m hoping that this somehow leads to China giving their people more rights. This actually kinda makes me wanna protest in China ngl\n\nedit: If they keep on killing their own people it’s going to backfire some way or another. Mass genocide over and over again, killing loved ones, putting soldiers through that, having the word get around, it’s gonna come back to bite you, even if you censor it. The people are going to continue to fight. You kill innocent people over peaceful protests? Okay, let’s take it up a notch! At least I would. How do you think black people got their rights in this country? How do you think trans/lgbt people got rights in this country?\n\nThe people are going to be persistent. If this happened in 1989 (if I remember correctly), then it’ll happen again. I do believe the people can make a change, but the people as a WHOLE need to make the change. Once the country sees that the government is slaughtering citizens, something will be done about it. What would ANY government do if 10,000 citizens protested? If hundreds or thousands died, there would be survivors. Word would spread. Even then, 10,000 citizens? You gotta be kidding me. This extreme violence is ridiculous. They were peaceful. Just disband the protest. \n\nIt only starts with one. Once you start killing loved ones, sons, daughters, mothers, fathers, husbands, wives, that’s when the real damage occurs and when people will really start to change and turn against you. Keep on killing your citizens. Do it. See how it works out. 🙃\n\nSorry I needed to rant lmao I get heated over these things",
            "title_similarity": "0.3913618",
            "sentiment_compound": -0.9935
        },
        {
            "id": "h0oc69v",
            "score": -6,
            "text": "Anti Chinese propaganda in full force by the us government",
            "title_similarity": "0.3968609",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0mzfix",
            "score": 23,
            "text": "It’s always a party until the government shows up",
            "title_similarity": "0.5579066",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0ndud8",
            "score": -23,
            "text": "Yet the Biden crowd still loves them some Chinese govt",
            "title_similarity": "0.16337094",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0ng6xy",
            "score": -22,
            "text": "Lol at everyone here who knows as much as a headline told them talking about a massacre that didn’t happen 🤦🏼‍♀️",
            "title_similarity": "0.48847747",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0nlko8",
            "score": -7,
            "text": "Why don’t you ask them if fashion was the reason why they were there…",
            "title_similarity": "0.41747713",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n8swd",
            "score": 42,
            "text": "[deleted]",
            "title_similarity": "0.4618945"
        },
        {
            "id": "h0n7uof",
            "score": 95,
            "text": "After this happened the British government should’ve declared that they wouldn’t hand Hong Kong back.",
            "title_similarity": "0.5031216",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0nqw1e",
            "score": -8,
            "text": "I don't recall remembering this.. Its never happened",
            "title_similarity": "0.391308",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n6cdi",
            "score": 96,
            "text": "I remember not just this date but the days leading up to it well. I was so happy for the protesters and I had such hope that things would change. \n\nI am GenX and proud. I experienced in the middle of Kansas, MTV debut, Tianamen Square and the fall of the Berlin Wall. \n\nMy heart breaks for Hong Kong and all of China, but then again  I learned of the Tulsa Massacre from THE TV. \n\nI just don't and never will understand why people....for lack of a better phrase, are so mean.",
            "title_similarity": "0.32238665",
            "sentiment_compound": 0.9767
        },
        {
            "id": "h0n5scs",
            "score": 35,
            "text": "Holy shit. I have never seen this. Why is this not taught along with the usual iconic photographs?",
            "title_similarity": "0.45321685",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0nh7wm",
            "score": 11,
            "text": "What does Lebron have to say now that he’s out of the playoffs?",
            "title_similarity": "0.5158093",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nybgx",
            "score": -11,
            "text": "She cute. Dunno about a tank but I'd definitely run train over her",
            "title_similarity": "0.21377316",
            "sentiment_compound": 0.6757
        },
        {
            "id": "h0n1ceu",
            "score": 764,
            "text": "FUCK THE CCP",
            "title_similarity": "0.47015744",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0nbmls",
            "score": -12,
            "text": "Chinanagans!",
            "title_similarity": "0.43827266",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n4t5a",
            "score": 258,
            "text": "Yeah, it's crazy to think about all the little things that happened before 'tank man'. It was basically Woodstock in Beijing before premier Li decided he couldn't handle the shame of students continuing to occupy the square.",
            "title_similarity": "0.47587672",
            "sentiment_compound": 0.33
        },
        {
            "id": "h0nfzh4",
            "score": 65,
            "text": "My god, to see people who didn’t know what r/sino was and weren’t brainwashed. If you’re in China and you’re reading this - THE WHOLE WORLD IS WITH YOU! GO TO ANY COUNTRY YOU WANT, they’ll have you. You were once great because of happy",
            "title_similarity": "0.30790836",
            "sentiment_compound": 0.9047
        },
        {
            "id": "h0n74ro",
            "score": 129,
            "text": "Before the ~~crackdown~~ massacre",
            "title_similarity": "0.79773384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ngynr",
            "score": -14,
            "text": "that dude is thinking about getting in that girl's pants",
            "title_similarity": "0.19873804",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nhjma",
            "score": 14,
            "text": "This is how liberty dies. With thunderous applause",
            "title_similarity": "0.34786582",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h0n71pe",
            "score": 43,
            "text": "What the hell happened. Why is the CCP like this",
            "title_similarity": "0.47286624",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0mz3w9",
            "score": 229,
            "text": "I didn’t realize it took place on June 4th until I just googled it.",
            "title_similarity": "0.43848425",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nhwt9",
            "score": 50,
            "text": "So many paid China trolls. It’s hilarious. Funny part now is everyone is wary. China murdered many of these people after this photo",
            "title_similarity": "0.34520787",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0n9jat",
            "score": 19,
            "text": "People aren't the problem. Governments are.",
            "title_similarity": "0.26804736",
            "sentiment_compound": 0.3089
        },
        {
            "id": "h0nbyk9",
            "score": -26,
            "text": "Got any photos of Kent State? Or BLM? Or Occupy?",
            "title_similarity": "0.4186924",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mzvxz",
            "score": 1480,
            "text": "and they totally got away with it and we all buy chínese goods",
            "title_similarity": "0.32447147",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n1jcm",
            "score": 1293,
            "text": "Love the Chinese people. Hate the authoritarian Chinese government. Praying for brighter days for the Chinese people.",
            "title_similarity": "0.26029223",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h0n7cw5",
            "score": 136,
            "text": "They look so happy, my god—so f***ing sad, I can still hardly believe it, even now after all these years",
            "title_similarity": "0.2358852",
            "sentiment_compound": 0.3902
        },
        {
            "id": "h0ncj9i",
            "score": -32,
            "text": "they brought it upon themselves. Shouldnt be dancing in public. Long Live CCP",
            "title_similarity": "0.5294305",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n5tqx",
            "score": 1827,
            "text": "You spelled massacre wrong.",
            "title_similarity": "0.4763143",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0npn9t",
            "score": 104,
            "text": "I know very well of the things that happened in Tiananmen... but everytime I look at this picture, it just reminds me that every death toll there was a human being with a story - thousands of students, many of who were about my age, each and every one of them were just wanting to voice their opinions on what direction their nation ought to go in.\n\nTo think that they died a death not even fit for livestock as a result... It really makes one think again and it is a sobering reminder that democracy is a fragile thing that needs to be continually defended.",
            "title_similarity": "0.38494617",
            "sentiment_compound": -0.9673
        },
        {
            "id": "h0n942l",
            "score": 396,
            "text": "I was about to make a joke about how “nothing happened there at all, no need to worry” but it just made me think about how that’s literally still their tactic to this day and they’re able to get away with it enough to carry on being tyrants. Now I’m just mad.",
            "title_similarity": "0.377221",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h0ng5so",
            "score": 362,
            "text": "In what is known as the Tiananmen Square Massacre (Chinese: 天安门大屠杀; pinyin: Tiān'ānmén dà túshā), troops armed with assault rifles and accompanied by tanks fired at the demonstrators and those trying to block the military's advance into Tiananmen Square.\nen.m.wikipedia.org › wiki › 1989_...\nCCP murdered thousands of protesters in fear that the peaceful protesters would create a civil war in demanding more freedoms. \"Tankman\" for holding up the Tanks he was executed 14 days later; other sources alleged he was executed by firing squad a few months after the Tiananmen Square protests.\nen.m.wikipedia.org › wiki › Tank_...\nTank Man - Wikipedia\nCCP are an evil against it own people's.",
            "title_similarity": "0.34907085",
            "sentiment_compound": -0.9807
        },
        {
            "id": "h0nidgt",
            "score": 128,
            "text": "Imagine being the guy that looks at that and says \"Send in the tanks\"",
            "title_similarity": "0.25997186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mwjpz",
            "score": 3096,
            "text": "These were the people who stood up to tanks. Who stood up to guns and oppression. And got shot and killed and ground up and washed down the drain.",
            "title_similarity": "0.3403667",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h0nd1m6",
            "score": 327,
            "text": "Before the crackdown? You mean massacre right?",
            "title_similarity": "0.68282366",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nh1mp",
            "score": 179,
            "text": "Fuck the CCP",
            "title_similarity": "0.47015744",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0nhztx",
            "score": 2670,
            "text": "My 5th grade English teacher was there during the massacre. She was at her hotel a few blocks away and the hotel manager pulled the fire alarm so everyone would come down to the lobby. She said that all the guests were sitting on the ground everywhere and the front desk staff was going over a plan on how they were all going to walk to the American embassy because that was the safest place for them to all go. Then a man stood up and said \"We are from the American embassy and we came here because we thought we were safer here.\" So they made a new plan to get to the train station and they were all going to take the train and cross the border. But they had to cross the square. When they got to the square she said that there were bodies everywhere. She had a camera around her neck and she snapped a picture. A man on a bike said “ No no no!” and stole her camera. He made it a few yards away before the soldiers shot him dead for having a camera. He saved her life. They made it to the train and left the station. Some time later, as they were approaching the border, their train was stopped in the wilderness by soldiers. Apparently many Chinese citizens were on the roof of the train trying to escape. She said that from her window she could see the military pulling people down from the roof and lined them all up and shot them dead with a firing squad. Then the train was allowed to cross with the Americans and Europeans onboard. I'm 31 years old now and I will never forget that story. \n\nEDIT.... Can't help but wonder if this is the man that stole the camera... \n\n[https://cdn.i-scmp.com/sites/default/files/styles/660x385/public/d8/images/2019/05/24/0chinac-u201091036456uec-u201103576482s0-287x204print-scmp.jpg?itok=pW7GBQyk](https://cdn.i-scmp.com/sites/default/files/styles/660x385/public/d8/images/2019/05/24/0chinac-u201091036456uec-u201103576482s0-287x204print-scmp.jpg?itok=pW7GBQyk)",
            "title_similarity": "0.27237988",
            "sentiment_compound": -0.9307
        },
        {
            "id": "h0n2ogj",
            "score": 2711,
            "text": "Chilling what happiness seemed to feel like only to have a dark cloud call over you and change everything.",
            "title_similarity": "0.4689779",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h0ncqck",
            "score": 634,
            "text": "They were just kids.",
            "title_similarity": "0.3752982",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mzhau",
            "score": 14732,
            "text": "[deleted]",
            "title_similarity": "0.4618945"
        },
        {
            "id": "h0n4lzb",
            "score": 10,
            "text": "Imagine if Woodstock happened in China",
            "title_similarity": "0.5139384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n8q53",
            "score": 18,
            "text": "#:(",
            "title_similarity": "0.3846417",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0na1by",
            "score": 2,
            "text": "Full speed ahead!",
            "title_similarity": "0.30695623",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nb4e3",
            "score": 3,
            "text": "Hold me closer, tiny dancer",
            "title_similarity": "0.15139586",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nc815",
            "score": 2,
            "text": "Amazing",
            "title_similarity": "0.23350032",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0nccs0",
            "score": 3,
            "text": "What crackdown? Nothing happened on June 4, 1989 on Tiananmen Square with several thousands students!",
            "title_similarity": "0.42012382",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nctu8",
            "score": 6,
            "text": "I remember even from the US it seemed like there was no way to put the genie back in the bottle. Boy was I wrong.",
            "title_similarity": "0.45016232",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0nde64",
            "score": 2,
            "text": "Cool. I’ve never seen this before.",
            "title_similarity": "0.40642977",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0ndrta",
            "score": 3,
            "text": "Is there a timeline of wat exactly occurred on that day?",
            "title_similarity": "0.6038791",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ndxrs",
            "score": 2,
            "text": "All kids",
            "title_similarity": "0.22706547",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ne5g8",
            "score": 2,
            "text": "Some humans depravity knows no bounds. It's a damn shame seeing these people, laughing, having fun, enjoying life. Knowing those same faces will be washed down the drain, void of it.\n\nRest in peace to everyone who died then.",
            "title_similarity": "0.24613401",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0ne6kj",
            "score": 6,
            "text": "People having *fun* and enjoying *life*?!? We must stop this now! \n\n-Communist China, probably",
            "title_similarity": "0.41902345",
            "sentiment_compound": 0.7539
        },
        {
            "id": "h0ne8bj",
            "score": 5,
            "text": "Sino so mad over all the coverage today.",
            "title_similarity": "0.4416179",
            "sentiment_compound": -0.5413
        },
        {
            "id": "h0negk0",
            "score": 12,
            "text": "Anyone not who does not know the whole story of Tianamen square needs to listen to the episode of stuff you should know that covers it. It is inspirational and heart breaking. Linked below. \n\nHi\r\n\r\n  Thought you might like this episode of Stuff You Should Know, entitled The Massacre at Tiananmen Square.\r\n\r\nThis message was sent from RSS Radio http://rssr.link/1iEJp",
            "title_similarity": "0.4020307",
            "sentiment_compound": 0.9022
        },
        {
            "id": "h0nekro",
            "score": 2,
            "text": "Is it just me, or am I the only person who feels as if  history will tell a story similar to this in the USA?",
            "title_similarity": "0.39820862",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nel0c",
            "score": 3,
            "text": "I saw a really good documentary where is just show video footage of what was going on before/during/after the whole massacre thing . I wish I remembered what it was called to link but it might be on YouTube somewhere",
            "title_similarity": "0.327669",
            "sentiment_compound": 0.4491
        },
        {
            "id": "h0nelln",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.4618945"
        },
        {
            "id": "h0nev7h",
            "score": 2,
            "text": "If it feels good, stop! -George Carlin",
            "title_similarity": "0.40984744",
            "sentiment_compound": 0.2481
        },
        {
            "id": "h0neyrc",
            "score": 2,
            "text": "The HIMYM we actually want to see.",
            "title_similarity": "0.37297732",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0nf1d7",
            "score": 2,
            "text": "They thought a new future was coming :(",
            "title_similarity": "0.46085244",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0nf9w4",
            "score": 2,
            "text": "Wow, do you have any other pics from that time?",
            "title_similarity": "0.4171789",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0nfa6a",
            "score": 2,
            "text": "I see little shorty feeling herself 🙌 wholesome",
            "title_similarity": "0.12558982",
            "sentiment_compound": 0.0571
        },
        {
            "id": "h0nfaq7",
            "score": 2,
            "text": "A lot of young fellow and many forgetful old people think democracy is a given. It \n\n*Indian here",
            "title_similarity": "0.31169426",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0nfe5k",
            "score": 2,
            "text": "Chinese RT Game",
            "title_similarity": "0.41596508",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nfk9g",
            "score": 3,
            "text": "Seeing stuff like this Just remind me the sad reality we live in, where governments have become enemies of the of People they were supposed to represent.",
            "title_similarity": "0.39328852",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0nfme2",
            "score": 2,
            "text": "🕯",
            "title_similarity": "0.37366045",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nfphp",
            "score": 2,
            "text": "time for [\"Nothing to my Name\"](https://www.youtube.com/watch?v=m7uk0-vlpP0) 一無所有 - 崔健 CuiJian father of Chinese Rock, this is the song adopted by the students to be anthem of their protest, also [one of the songs](https://coconuts.co/hongkong/lifestyle/from-80s-rock-to-patriotic-anthems-6-songs-associated-with-tiananmen-square/) associated with Tiananmen",
            "title_similarity": "0.40710208",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0nfq5z",
            "score": 2,
            "text": "Makes you think the only true way to make changes is not through peaceful protest but violence.",
            "title_similarity": "0.41663027",
            "sentiment_compound": -0.7347
        },
        {
            "id": "h0nfr2q",
            "score": 11,
            "text": "I'm by no means an expert but I bet if you try to mention this in China you'd probably be arrested or something scary\n\n&#x200B;\n\nAlso the optimism before the pain and tragedy it's heartbreaking",
            "title_similarity": "0.4421198",
            "sentiment_compound": -0.9676
        },
        {
            "id": "h0nfs43",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.45395795"
        },
        {
            "id": "h0nfsy2",
            "score": 4,
            "text": "Before the Chinese Communist Party (CCP) fucked everything up!!! China needs to get rid of the CCP!!!",
            "title_similarity": "0.52283114",
            "sentiment_compound": -0.5951
        },
        {
            "id": "h0nfx59",
            "score": 2,
            "text": "Geez, kind of has a Woodstock vibe in this photo. And probably a similar energy. Look, think, and consider... Too often people forget to do so, and as we see it denies us the opportunity to learn from the past.",
            "title_similarity": "0.38657922",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0nfxxc",
            "score": 2,
            "text": "You mean “before the massacre ordered by a dying mad man”?",
            "title_similarity": "0.47919187",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0nfyez",
            "score": 2,
            "text": "They're all dead, aren't they?",
            "title_similarity": "0.40190867",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h0ng095",
            "score": 2,
            "text": "When China still had some culture remaining until it all got squashed",
            "title_similarity": "0.56843305",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ng1vl",
            "score": 2,
            "text": "Almost too good to be true",
            "title_similarity": "0.26055366",
            "sentiment_compound": 0.6621
        },
        {
            "id": "h0ng2ij",
            "score": 2,
            "text": "The picture in the background of moa is trippy.",
            "title_similarity": "0.38085133",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ng5pm",
            "score": 2,
            "text": "I think this photo makes the whole event so much worse than tank man has",
            "title_similarity": "0.3553425",
            "sentiment_compound": -0.5233
        },
        {
            "id": "h0ngaea",
            "score": 2,
            "text": "I feel like a movie could be made starring the two people in the picture. And how they got killed during the * cough *",
            "title_similarity": "0.37845427",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0ngciq",
            "score": 2,
            "text": "Where Honk Kong is heading",
            "title_similarity": "0.54448307",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nge3j",
            "score": 2,
            "text": "That’s a funny way of spelling “massacre”. This picture is haunting.",
            "title_similarity": "0.39890587",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0ngiat",
            "score": 2,
            "text": "I was there on the 25th anniversary by complete coincidence. I only realized it because Reddit wasn’t blocked (I was in Shanghai mostly but Beijing for a few days). Tiananmen Square was just a HOT block of concrete with a million tourists taking “peace sign” poses in front of Moa Zedongs portrait. I mean I did too, seemed like the thing to do. Wasn’t till I got back to the hostel and had WiFi and saw on Reddit what date it was. It shook me to the fucking core. I stood there, a dumbass American tourist, taking turns normalizing the complete erasure of the event. It’s been remodeled several times, it’s a pretty nice town square. Beautiful buildings. Not a single hint that anyone was respecting the tragedy at all. I knew OF it, I knew the square I was in, but to be in the same steps the tank, soldiers, students and protestors were…and got a selfie. It sickening how power and erasure is so effective.",
            "title_similarity": "0.37911433",
            "sentiment_compound": 0.6991
        },
        {
            "id": "h0ngl6b",
            "score": 2,
            "text": "Makes me think of the BLM protests last summer",
            "title_similarity": "0.48487315",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0ngr1o",
            "score": 2,
            "text": "CCP sucks cock",
            "title_similarity": "0.25271466",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0ngr25",
            "score": 2,
            "text": "If I'm not wrong, all these people were killed and then ran over multiple times by tank tracks until turned to pulp and then wanted down the sewage, right?",
            "title_similarity": "0.28846776",
            "sentiment_compound": -0.449
        },
        {
            "id": "h0ngr4t",
            "score": 2,
            "text": "It's a really sad day and a tragic story, but what's been really disgusting is how in the US the Republicans will \"stand in solidarity\" with the Chinese who died in that massacre just to have another attack at the CCP. These same ghouls never mention the Tulsa Massacre, and support a racist president who calls covid-19 the \"kung flu\". It really makes me angry",
            "title_similarity": "0.28344902",
            "sentiment_compound": -0.9812
        },
        {
            "id": "h0ngsqu",
            "score": 2,
            "text": "Never forget 64 🙏🙏",
            "title_similarity": "0.408911",
            "sentiment_compound": 0.1695
        },
        {
            "id": "h0ngt42",
            "score": 2,
            "text": "You can vote on this every day with your money. \n\nNo matter how nice a product, how good a bargain, it stays on the shelf/catalog/hanger if it’s made in China. \nIn my case also if it’s made in Turkey or Brazil.",
            "title_similarity": "0.30415243",
            "sentiment_compound": 0.7526
        },
        {
            "id": "h0ngtjy",
            "score": 4,
            "text": "The two most sad things about this, is what happened with the tanks and then the fact that Chinese gouverment have been so successfull in removing this from history inside China, that nobody know that it ever took place. Except of course, those that were there. If they survived to this date at all.\n\nJust remember, that if Reddit was not banned inside China before, then it sure am now. The third sad part of it all.",
            "title_similarity": "0.3940114",
            "sentiment_compound": 0.1499
        },
        {
            "id": "h0ngtqb",
            "score": 2,
            "text": "I wonder how many protests that changed history looked like this before the authorities showed up in force.",
            "title_similarity": "0.59859025",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h0ngu2f",
            "score": 2,
            "text": "Does anyone worry this might happen in the US?",
            "title_similarity": "0.49199674",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0ngu7o",
            "score": 3,
            "text": "Hardly any women. Is this from decades of China’s one child policy?",
            "title_similarity": "0.45581156",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ngwx4",
            "score": 2,
            "text": "r/accidentalrenaissance",
            "title_similarity": "0.47944224",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nh0rs",
            "score": 3,
            "text": "Before the mass murder*",
            "title_similarity": "0.6820138",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0nh2dr",
            "score": 2,
            "text": "Declining US empire cope.",
            "title_similarity": "0.5039809",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nh384",
            "score": 2,
            "text": "Why are they renaming a MASSACRE a crackdown?",
            "title_similarity": "0.49297953",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nh3nn",
            "score": 2,
            "text": "I wonder how much foreign policy known or secret affected the decision of the government to act. Governments always cling to power on the backs of the people it gains its power from. We talk of foreign influences and the like but what about the forces we weaken to shift power ourselves. What a tragedy that we must dance with swords and secrets!! One day I hope all people can unite and create a future together",
            "title_similarity": "0.34914228",
            "sentiment_compound": -0.5905
        },
        {
            "id": "h0nh50f",
            "score": 2,
            "text": "Looks like a good place to be",
            "title_similarity": "0.17516395",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h0nh8we",
            "score": 2,
            "text": "Can someone fill me in on what this is; what is happening & is this a current event? Thank you",
            "title_similarity": "0.44859314",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0nh982",
            "score": 3,
            "text": "More heartbreaking than interesting",
            "title_similarity": "0.275919",
            "sentiment_compound": -0.0847
        },
        {
            "id": "h0nhazn",
            "score": 2,
            "text": "He’s looking sharp!",
            "title_similarity": "0.2856471",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nhdqa",
            "score": 3,
            "text": "FUCK THE CCP!!!",
            "title_similarity": "0.46668816",
            "sentiment_compound": -0.6571
        },
        {
            "id": "h0nhgu5",
            "score": 2,
            "text": "I wonder where these people are now I hope they got away before everything went down",
            "title_similarity": "0.5643338",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0nhot3",
            "score": 2,
            "text": "I wonder how many of the poor bastards in this photo are still alive",
            "title_similarity": "0.26533145",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h0nhqrq",
            "score": 2,
            "text": "R.I.P. and God be with all fighters for, and defenders of democracy.",
            "title_similarity": "0.244381",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0nhums",
            "score": 4,
            "text": "I was at grad school around 1994 at Michigan Tech with a guy who was actually at Tiananmen square.  I now wish I had been smart enough at the time to listen to him talk more, but I remember a kind of deep sorrow/misery in that guy.",
            "title_similarity": "0.399104",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0nhuvt",
            "score": 3,
            "text": "*Tiananmen square before the massacre.",
            "title_similarity": "0.80784583",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nhxb9",
            "score": 2,
            "text": "Top ten moments before disaster",
            "title_similarity": "0.57577384",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0nhyuk",
            "score": 533,
            "text": "When the students’ sit-in first started, the mood was pretty positive! I was in 3rd grade in Beijing at the time, my dad’s whole lab rode to Tiananmen on their bikes to support them. He took me on one of their rides, I sat on the back luggage rack while they rode around ringing their bicycle bells. Lots of people were there, everyone looked excited. And then… so much heartbreak.",
            "title_similarity": "0.19323704",
            "sentiment_compound": 0.8027
        },
        {
            "id": "h0ni2dp",
            "score": 2,
            "text": "Yes fuck the ccp",
            "title_similarity": "0.4746625",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h0ni4b1",
            "score": 2,
            "text": "Before the what?",
            "title_similarity": "0.6542877",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ni57l",
            "score": 2,
            "text": "Seeing this from an outsiders perspective it must be absolutely grueling mentally for anyone to have been alive when this all happened or even happened to have been there yourself to witness the massacre and to still have your own government gaslighting you is just something I wouldn't have thought I'd see in this day and age.",
            "title_similarity": "0.39889055",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0ni7qm",
            "score": 2,
            "text": "can someone ELI5 what happened at Tianamen Square before the military showed up?  Thanks.  World history class didn't cover this subject at all.",
            "title_similarity": "0.5439427",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0niav1",
            "score": 2,
            "text": "What’s crazy is they don’t even know what happened over there",
            "title_similarity": "0.40529978",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0nic7k",
            "score": 2,
            "text": "I always wondered if there’s anyone alive that escaped and remembers that day. Like they see how new generations don’t even know that the massacre occurred.",
            "title_similarity": "0.46482822",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0nifw9",
            "score": 3,
            "text": "Get that pussy Daniel Son!!!",
            "title_similarity": "0.36705124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nig9y",
            "score": 1,
            "text": "If I cant dance, I dont want to be part of your revolution.\n\n--Emma Goldman",
            "title_similarity": "0.43752766",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h0nimf7",
            "score": 2,
            "text": "As a grown ass man with a beard, this made me bawl my eyes out for these people.",
            "title_similarity": "0.12196359",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0niq2r",
            "score": 2,
            "text": "In-tere-stin-GAS-FUCK",
            "title_similarity": "0.41007006",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nir6g",
            "score": 2,
            "text": "*Massacre.... the title should say “before the massacre”.\nOne love.",
            "title_similarity": "0.6257402",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0nitby",
            "score": 2,
            "text": "They seemed so happy and free, now the Chinese are like zombies",
            "title_similarity": "0.06295225",
            "sentiment_compound": 0.8958
        },
        {
            "id": "h0nitkc",
            "score": 1,
            "text": "Vibe like Woodstock, except they had a way worse outcome. Terrible to think about.",
            "title_similarity": "0.3861197",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0niu64",
            "score": 2,
            "text": "That is why the people of Hong Kong is fighting so hard against the Chinese government... Praying for them! 🙏",
            "title_similarity": "0.3543779",
            "sentiment_compound": -0.2865
        },
        {
            "id": "h0niv72",
            "score": 2,
            "text": "CCP is cancer",
            "title_similarity": "0.3481264",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h0nj58o",
            "score": 2,
            "text": "That whole thing with Deng was a honeypot to bring out young people with ideas of freedom, so they could be crushed.",
            "title_similarity": "0.33465368",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0nj65r",
            "score": 2,
            "text": "My mom was there as a journalist. Never talked about it much, only mentioning she lost dozens of friends there. She took a bunch of pictures, but the film was destroyed by our family. If those pictures were ever found, I probably wouldn't be here today.",
            "title_similarity": "0.39571065",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0nj6x3",
            "score": 2,
            "text": "It's so saddening to see they had no idea what was coming up.",
            "title_similarity": "0.4322554",
            "sentiment_compound": -0.6901
        },
        {
            "id": "h0nj7oz",
            "score": 2,
            "text": "All of these comments about the dark future ahead for these individuals. But nothing about the absolute tyranny citizens are put through because of corrupt governments.",
            "title_similarity": "0.32141137",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0njazv",
            "score": 2,
            "text": "Its like the mayor in the town of footloose saying you dance to much...except with tanks and of course all the tyranny",
            "title_similarity": "0.31877685",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0njdd6",
            "score": 1,
            "text": "Was fashion the reason why they were there",
            "title_similarity": "0.3962202",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0njdo7",
            "score": 2,
            "text": "I never really understood what happened here, can someone explain?",
            "title_similarity": "0.45921868",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0njg66",
            "score": 2,
            "text": "Makes you wonder how many of the people in this photo were murdered by the Chinese government",
            "title_similarity": "0.38574234",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h0njgdm",
            "score": 2,
            "text": "Wonder how many folks just in this frame didn't make it home that day.",
            "title_similarity": "0.51541865",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0njhza",
            "score": 45,
            "text": "Such a heartbreaking photo. When people still had hope that things could be different.",
            "title_similarity": "0.49005613",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0njm9z",
            "score": 2,
            "text": "The people’s China we want to see.",
            "title_similarity": "0.45288944",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0njmqs",
            "score": 3,
            "text": "It wasn't a crackdown, it was a massacre.",
            "title_similarity": "0.32473844",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0njoou",
            "score": 2,
            "text": "Regime change.  Now.  \n\nChinese Communism is an existential threat to the entire planet.\n\nPandemics.  Genocide.  Pollution.  Economic warfare.  Surveillance state tactics.  So much more.  Why is the world tolerating this cancer on the planet?",
            "title_similarity": "0.3910391",
            "sentiment_compound": -0.8968
        },
        {
            "id": "h0njvgb",
            "score": 4,
            "text": "And people wonder why I am so against the CCP government. We should have crushed Mao alongside Japan.",
            "title_similarity": "0.40355885",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0njvqu",
            "score": 3,
            "text": "Democracy was so close yet so far… now corrupt ccp and poor brainwashed people are the ones left.",
            "title_similarity": "0.35494697",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0njw3t",
            "score": 2,
            "text": "This is the group that tankies will say we’re evil, brainwashed militants. It’s so much more depressing when one sees this picture. Really gives human life and contrast to the image in which some of these happy, good people are depicted laying slaughtered in the streets.",
            "title_similarity": "0.30793524",
            "sentiment_compound": -0.2398
        },
        {
            "id": "h0njyzl",
            "score": 2,
            "text": "They all look so happy",
            "title_similarity": "0.027964456",
            "sentiment_compound": 0.6948
        },
        {
            "id": "h0njz3f",
            "score": 14,
            "text": "Part of any totalitarian states control method. Kill the gene pool of dissidents, courageous, rebellious traits. Then you will have a docile society that is easy to manage",
            "title_similarity": "0.29641458",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0nk3rx",
            "score": 3,
            "text": "I hate this planet sometimes... people are so beautiful, yet bureaucracy seems to destroy that beauty.",
            "title_similarity": "0.2406478",
            "sentiment_compound": 0.38
        },
        {
            "id": "h0nk43a",
            "score": 6,
            "text": "Such a sad photo..",
            "title_similarity": "0.32416648",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0nk926",
            "score": 3,
            "text": "That looks like freedom",
            "title_similarity": "0.20653361",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h0nkg7v",
            "score": 3,
            "text": "\"MOMENTS BEFORE FREEDOM ENDED\" (1982, COLORIZED)",
            "title_similarity": "0.59652126",
            "sentiment_compound": 0.7125
        },
        {
            "id": "h0nkghv",
            "score": 3,
            "text": "Man that government really outgha get ahold of their people.",
            "title_similarity": "0.40678352",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nkhur",
            "score": 4,
            "text": "Careful. China will probably cancel you.",
            "title_similarity": "0.5805551",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0nkiib",
            "score": 2,
            "text": "If only they knew",
            "title_similarity": "0.37370932",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nkj0h",
            "score": 4,
            "text": "Crackdown means massacre in this instance.",
            "title_similarity": "0.49117965",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nkk44",
            "score": 2,
            "text": "I remember this scene in \"The Gate of Heavenly Peace\" documentary.",
            "title_similarity": "0.30611748",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h0nkk6y",
            "score": 2,
            "text": "“And that, I think, was the handle—that sense of inevitable victory over the forces of Old and Evil. Not in any mean or military sense; we didn’t need that. Our energy would simply prevail. There was no point in fighting—on our side or theirs. We had all the momentum; we were riding the crest of a high and beautiful wave. . . .”",
            "title_similarity": "0.24640161",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0nkrgf",
            "score": 3,
            "text": "They're just excited for the friendly happy tank parade about to begin. Like Memorial Day. Later the guy with groceries was just asking directions for where the afterparty was because he wanted to give them all the snacks he brought. Any photos with red looking puddles were just... uh... spilled fruit punch. But those don't exist because most partiers forgot to take photos of the festivities! They were having too much fun!",
            "title_similarity": "0.18683705",
            "sentiment_compound": 0.9557
        },
        {
            "id": "h0nkrsk",
            "score": 2,
            "text": "But a western tankie on Reddit says they are incels who deserved to be ran over!!!1111!1!1",
            "title_similarity": "0.4037942",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nktjm",
            "score": 2,
            "text": "Reminds me of Woodstock.",
            "title_similarity": "0.42799392",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nkwtx",
            "score": 2,
            "text": "To think that most probably everyone in this picture is dead is....kinda dreadful",
            "title_similarity": "0.41134062",
            "sentiment_compound": -0.802
        },
        {
            "id": "h0nl083",
            "score": 3,
            "text": "This is how I wish Chinese people would live",
            "title_similarity": "0.40894523",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0nl23x",
            "score": 3,
            "text": "Reddit is removing post about tianamen square",
            "title_similarity": "0.6054881",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nl4so",
            "score": 3,
            "text": "Same arch in everything: kids think old people are fools, old people grow more foolish the older they get and fear the foundations they imagine are some how being betrayed by young foolishness. \n\nAnd a generation later the entire culture has shifted toward the gravity of that youthful foolishness but what's resulted was clearly imagined by nether the old or the young, that generation earlier; all those kids dying for the foolishness.\n\nOh, and btw, they rinsed the gore from death and crushed bodies off the street with hoses.",
            "title_similarity": "0.29616225",
            "sentiment_compound": -0.9568
        },
        {
            "id": "h0nlbce",
            "score": 2,
            "text": "Way before.....",
            "title_similarity": "0.61059374",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nleab",
            "score": 2,
            "text": "Crime docus be like:\nThey were all happy. \nUntil they weren't",
            "title_similarity": "0.2453219",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0nlfax",
            "score": 1,
            "text": "This will get this people killed",
            "title_similarity": "0.45606142",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h0nljwa",
            "score": 1,
            "text": "Everyone in this photo is sporting some SWAG",
            "title_similarity": "0.27713338",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nlpen",
            "score": 2,
            "text": "Crackdown or Massacre?",
            "title_similarity": "0.50713855",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nlprp",
            "score": 4,
            "text": "Try posting this on r/Sino",
            "title_similarity": "0.4818207",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nlt7m",
            "score": 1,
            "text": "Nice artwork!!",
            "title_similarity": "0.18816376",
            "sentiment_compound": 0.5242
        },
        {
            "id": "h0nltvr",
            "score": 1,
            "text": "Spot the commie",
            "title_similarity": "0.4221524",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nluyx",
            "score": 2,
            "text": "This is so sad knowing what happened afterwards. It almost looks like it was gonna be their version of summer of love.",
            "title_similarity": "0.44868612",
            "sentiment_compound": 0.3465
        },
        {
            "id": "h0nlvm2",
            "score": 2,
            "text": "What happened at the square?",
            "title_similarity": "0.5990605",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nlw4t",
            "score": 2,
            "text": "They are all dead and were hosed off the concrete",
            "title_similarity": "0.3046971",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h0nm1fr",
            "score": 2,
            "text": "ACAB",
            "title_similarity": "0.41112515",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nm522",
            "score": 5,
            "text": "I got an alt account banned from r/Sino today after posting a link to the pictures of the massacre. It’s crazy how fast they are to mute or ban you.",
            "title_similarity": "0.5215951",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h0nm71v",
            "score": 3,
            "text": "this is a little personal, but it really puts into perspective for me how one of these people could've been my dad. (He wasn't formally in the demonstration, but he was on a train home from beijing a week or so before the 'event') \n\nEdit: Clarifications no one asked for:\n\nIts easy to think this happened in a single day, but the truth is the demonstration occured over the course of multiple days, ending in the massacre.\n I'm fortunate enough to live in America where my dad is comfortable about recalling his experience and the general shock this had on the public. My details of his retelling are a bit fuzzy, but one thing that really stuck with me was how he recalled how 'happy' everyone was. The ideas shown in the pic where fairly popular, and it was like this big thing students and young people flocked to bejing for. The almost scariest part of it us how my dad says no one truly knows what happened. The military had already tried and given up on quelling the demonstration weeks prior. Then the massacre occurred.",
            "title_similarity": "0.39439029",
            "sentiment_compound": 0.9505
        },
        {
            "id": "h0nm7yx",
            "score": 2,
            "text": "Imagine what the world would be like today, had the government made concessions to their young people.",
            "title_similarity": "0.4347039",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0nm8mf",
            "score": 1,
            "text": "“That’s the devil’s dance! It must be stopped...”",
            "title_similarity": "0.4826379",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nmdd5",
            "score": 3,
            "text": "Remember Tiananmen",
            "title_similarity": "0.583885",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nmek3",
            "score": 2,
            "text": "This makes me want to cry",
            "title_similarity": "0.28461725",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0nmhd0",
            "score": 1,
            "text": "Thanks, John Cena.",
            "title_similarity": "0.28866553",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0nmhkk",
            "score": 2,
            "text": "Was fashion a reason why they were there?",
            "title_similarity": "0.37371436",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nmlyl",
            "score": 2,
            "text": "Do these people know that there's a free world out there",
            "title_similarity": "0.22426338",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0nmm95",
            "score": 2,
            "text": "We need to upvote this like mad",
            "title_similarity": "0.45632336",
            "sentiment_compound": -0.0836
        },
        {
            "id": "h0nmpj1",
            "score": 2,
            "text": "China will never erase this from memory or history.",
            "title_similarity": "0.38024637",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nmr1c",
            "score": 2,
            "text": "The People of China deserve freedom.",
            "title_similarity": "0.27022257",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0nmxh4",
            "score": 2,
            "text": "You mean before the massacre...",
            "title_similarity": "0.7295582",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nn33n",
            "score": 1,
            "text": "Authoritarians are scumbags. To think millions want authoritarianism in the US is sickening...",
            "title_similarity": "0.35691747",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0nn4sn",
            "score": 2,
            "text": "Before the massacre you mean.",
            "title_similarity": "0.7228434",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nn86q",
            "score": 1,
            "text": "What's a crackdown, you mean the massacre?",
            "title_similarity": "0.49926156",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nnb1s",
            "score": 2,
            "text": "One of the biggest loads of horse shit Americans were fed when President Bill Clinton signed a free trade agreement with China was: \"Improving China's GDP will [magically] lead them towards democracy.\"\n\nWe are still waiting...",
            "title_similarity": "0.29457745",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h0nnbtn",
            "score": 2,
            "text": "Tank man could have been the dancing man in the center. Any of those men in white shirts and dress pants. One of those protesters decided to stand up to a line of tanks. He wasn’t some more than mere mortal hero on a quest. He was one of those citizens who just decided to stand up for what he knew was right on his way home from running errands. An everyman who decided to stand up against the army that was coming to squash the peaceful student protests. He had no idea that his act of resistance would go down in history the way it did. All he knew was that he probably wouldn’t survive, but protesting was worth dying for.",
            "title_similarity": "0.29440677",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h0nne3s",
            "score": 2,
            "text": "Little do they know...",
            "title_similarity": "0.4193105",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nngpv",
            "score": 2,
            "text": "Photo by Mark Avery/AP",
            "title_similarity": "0.4722302",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nnhd8",
            "score": 2,
            "text": "Tiananmen*",
            "title_similarity": "0.5786183",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nnjcy",
            "score": 1,
            "text": "Sounds like a made up place",
            "title_similarity": "0.32942092",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0nnjyj",
            "score": 2,
            "text": "Where are the tanks?",
            "title_similarity": "0.3409941",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nntsp",
            "score": 1,
            "text": "what happened there?",
            "title_similarity": "0.49651462",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nnvqz",
            "score": 3,
            "text": "Calling what happened there a crackdown is like calling eating dog shit unsettling.",
            "title_similarity": "0.26109788",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0nnwbw",
            "score": 2,
            "text": "I am in need of context",
            "title_similarity": "0.40669388",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nnxxf",
            "score": 2,
            "text": "They are dressed and look so western.",
            "title_similarity": "0.26464283",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0no1om",
            "score": 2,
            "text": "Wow theres gotta be at least 5 people in the protest.",
            "title_similarity": "0.35826093",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0no550",
            "score": 2,
            "text": "Why does the famous photo feel less depressing than this…",
            "title_similarity": "0.32628298",
            "sentiment_compound": -0.3197
        },
        {
            "id": "h0no9ep",
            "score": 2,
            "text": "Why don’t you ask the kids at Tienanmen Square\n\nWas fashion the reason they were there?",
            "title_similarity": "0.4554576",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0noa5v",
            "score": 2,
            "text": "Wow! State entities exercising violent coersion to maintain controll? Whoever heard of such a thing? Good thing we live in the West! Never happen here, no siree Bob!",
            "title_similarity": "0.39708284",
            "sentiment_compound": 0.7117
        },
        {
            "id": "h0noa77",
            "score": 2,
            "text": "Before the what?",
            "title_similarity": "0.6542877",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0noanx",
            "score": 2,
            "text": "Tiananmen 2.0 is right around the corner and it’s going to emanate from Hong Kong with all those highly educated ambitious and militant young people who seek to overthrow their authoritarian shackles.",
            "title_similarity": "0.37095574",
            "sentiment_compound": 0.5233
        },
        {
            "id": "h0noasl",
            "score": 2,
            "text": "All those people slaughtered by machine guns, and then run over by tanks, turning their bodies into pink slime.",
            "title_similarity": "0.15549195",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nobyn",
            "score": 2,
            "text": "If there was ever published an approximate death toll from this fucking evil massacre, I never heard it.  I don't think I want to, really.",
            "title_similarity": "0.38083625",
            "sentiment_compound": -0.8694
        },
        {
            "id": "h0nockt",
            "score": 2,
            "text": "Why does CCP hate dancing?",
            "title_similarity": "0.3061225",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0nocq3",
            "score": 3,
            "text": "It's quite upsetting how this turned out to be... Even more upsetting to see history repeat itself in Hong-Kong as well and how the situation has turned there. I seriously hope I can see the change in my lifetime but I'm afraid I wont. :(",
            "title_similarity": "0.52003264",
            "sentiment_compound": 0.2182
        },
        {
            "id": "h0nodf3",
            "score": 2,
            "text": "And they were ground to mush by tanks.",
            "title_similarity": "0.35664988",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nofmm",
            "score": 2,
            "text": "I remember the liberty statue they constructed and I thought “Jesus Christ, they’re actually going to do it and be free”. Fuck.",
            "title_similarity": "0.3897491",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0noh47",
            "score": 2,
            "text": "It was basically the Hippie revolution coming alive in China...only to be crushed by gunfire and tanks.",
            "title_similarity": "0.42494288",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0nox9h",
            "score": 2,
            "text": "The true story behind this never stops to hurt me. Some people are just really lucky where they are born, don't take it for granted.",
            "title_similarity": "0.16937007",
            "sentiment_compound": 0.8783
        },
        {
            "id": "h0noxdx",
            "score": 3,
            "text": "What actually happened here",
            "title_similarity": "0.49974287",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0noxre",
            "score": 2,
            "text": "What can we do to prevent the CCP from becoming even more powerful?",
            "title_similarity": "0.43465203",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h0noyim",
            "score": 2,
            "text": "\"Cackdown\" is horrible way to describe what happened.",
            "title_similarity": "0.3715441",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0np413",
            "score": 2,
            "text": "I wonder where they are now 😔",
            "title_similarity": "0.4859339",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0np7nb",
            "score": 1,
            "text": "Crackdown???",
            "title_similarity": "0.55921614",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0np8np",
            "score": 2,
            "text": "Very important world event , rip to all fallen protesters.. They'll never be forgotten...",
            "title_similarity": "0.43240333",
            "sentiment_compound": -0.1633
        },
        {
            "id": "h0npmfb",
            "score": 2,
            "text": "The CCP is the only modern comparison to nazis.",
            "title_similarity": "0.33377004",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0npnkw",
            "score": 1,
            "text": "Crackdown is definitely not the word I would use...",
            "title_similarity": "0.40482545",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0npnwp",
            "score": 2,
            "text": "You know I can't remember ever seeing a picture of people in China ever looking that happy.",
            "title_similarity": "0.38992536",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0npoeo",
            "score": 3,
            "text": "The world needs to see more pictures like these",
            "title_similarity": "0.39396378",
            "sentiment_compound": 0.4173
        },
        {
            "id": "h0nps52",
            "score": 3,
            "text": "Crackdown seems to be underplaying what happened here",
            "title_similarity": "0.47864562",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nq39u",
            "score": 2,
            "text": "This movement has not died",
            "title_similarity": "0.22121349",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h0nq49s",
            "score": 2,
            "text": "Nothing bad happened to those people whatsoever",
            "title_similarity": "0.2162342",
            "sentiment_compound": 0.431
        },
        {
            "id": "h0nq4ni",
            "score": 3,
            "text": "Before the massacre*",
            "title_similarity": "0.73648274",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nq632",
            "score": 2,
            "text": "life was a different place back then",
            "title_similarity": "0.4937603",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nq8k7",
            "score": 2,
            "text": "The saddest part to me is the loss of such great people. Smart, respectful, likely educated and optimistic people who peacefully protested. \n\nA lot of the best types of people that make up or world were lost here by scum.",
            "title_similarity": "0.265869",
            "sentiment_compound": 0.891
        },
        {
            "id": "h0nq9f4",
            "score": 2,
            "text": "\"bUt ThEy WeRe CaPiTaLiSt AgiTaToRs SeNt By ThE WeSt!!!!1!11!\"\n\nShut the fuck up. They sang the national anthem and the Internationale for as long as the protest was going on.\n\nThey did not have a wish to instate a capitalist system. They had a wish to make their socialist society free from the oligarchy run by the corrupt Party.",
            "title_similarity": "0.29957378",
            "sentiment_compound": -0.6
        },
        {
            "id": "h0nqh2u",
            "score": 3,
            "text": "Let's call it what it was, a massacre.",
            "title_similarity": "0.48207948",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nqhb2",
            "score": 2,
            "text": "This makes my heart hurt :( \n\nFuck the CCP",
            "title_similarity": "0.3723147",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0nqlfz",
            "score": 2,
            "text": "Jesus Christ. This is somehow just as chilling as the day before the stand picture.",
            "title_similarity": "0.49351692",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0nqs1z",
            "score": 2,
            "text": "Who knew that dancing was what really sparked it? Footloose at the state level.",
            "title_similarity": "0.40854663",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nqvv1",
            "score": 3,
            "text": "How dared they ask for more democracy within the party?",
            "title_similarity": "0.3684006",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0nr24t",
            "score": 3,
            "text": "Wow.\n\nThis is a picture of the China that could have been.",
            "title_similarity": "0.45627785",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0nrbsm",
            "score": 1,
            "text": "June 4, 1989 has roots in the May 15 (I believe) movement of 1919 (I believe) to modernize China, and its governance, and stop corruption.",
            "title_similarity": "0.4789424",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0nrgl9",
            "score": 3,
            "text": "I think crackdown is a really poor way to describe a massacre. It really lessens the severity of what occurred. Words are really important and this year I am seeing and organised media led drive to call this even a crackdown and in part, start to gloss over what was a government slaughtering its own people in order to quell a pro-democratic uprising. There are so many people that don't understand the severity of this event and I don't think it's useful to use words that lessen the impact that this should have on all of us and our desire to continue to strive for a better future.",
            "title_similarity": "0.36691707",
            "sentiment_compound": 0.2249
        },
        {
            "id": "h0nrr3q",
            "score": 2,
            "text": "There is no war in ba sing se",
            "title_similarity": "0.26170325",
            "sentiment_compound": 0.4847
        },
        {
            "id": "h0nrtta",
            "score": 2,
            "text": "Mainland Taiwan could’ve been so cool. Oh well.",
            "title_similarity": "0.3296196",
            "sentiment_compound": 0.6547
        },
        {
            "id": "h0nrvlu",
            "score": 2,
            "text": "To go from smiling and dancing and feeling safe to being sprayed down into the drains. It’s hardly comprehensible.",
            "title_similarity": "0.19744122",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h0ns6f0",
            "score": 3,
            "text": "Fuck Chinas disgusting, corrupt, and evil governments. Fuck them all.",
            "title_similarity": "0.32898697",
            "sentiment_compound": -0.9413
        },
        {
            "id": "h0ns9be",
            "score": 3,
            "text": "This post alone has almost as many upvotes as r/Sino has members",
            "title_similarity": "0.36174783",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0nsbbt",
            "score": 21,
            "text": "\"Crackdown\" you mean massacre",
            "title_similarity": "0.51676023",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nsdb3",
            "score": 3,
            "text": "*Footloose* with the bad ending.",
            "title_similarity": "0.48024476",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0nse28",
            "score": 2,
            "text": "Here before this gets removed",
            "title_similarity": "0.61359584",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nsfbb",
            "score": 2,
            "text": "Chinese soldier: “Well anyway. As comrade Mao said, I started blastin”",
            "title_similarity": "0.4202109",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nshis",
            "score": 3,
            "text": "This history cannot be lost.  I just read the UK cable. 10,000 civilians massacred and bodies run over by tanks....?  So sad.  Our children's children need to have access to the truth. This cannot happen again.  Now im scared to write this as I don't want any trouble if I ever want to visit china.",
            "title_similarity": "0.37942624",
            "sentiment_compound": -0.3167
        },
        {
            "id": "h0nsi9i",
            "score": 2,
            "text": "Sir it looks like the populus is having a good time, relaxed and dancing care free in the streets. Are you thinking what I'm thinking? SHUT IT DOWN, BRING IN THE TANKS!",
            "title_similarity": "0.21684001",
            "sentiment_compound": 0.937
        },
        {
            "id": "h0nsk22",
            "score": 2,
            "text": "is it just me or do i see twosetviolin in this picture",
            "title_similarity": "0.4000156",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nssri",
            "score": 2,
            "text": "… uncle?",
            "title_similarity": "0.35623652",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nsvga",
            "score": 3,
            "text": "Imagine still living under medieval rule in 2021",
            "title_similarity": "0.36995333",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nsxxa",
            "score": 3,
            "text": "The distant portrait of Mao Zedong in the background is really ominous... Like he's watching all of them celebrate a moment of unity before he came down with an iron fist.",
            "title_similarity": "0.39392984",
            "sentiment_compound": 0.5839
        },
        {
            "id": "h0nsyv8",
            "score": 2,
            "text": "He looks like hes about to kick her legs out from under her.",
            "title_similarity": "0.32458597",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0nt338",
            "score": 2,
            "text": "This picture made me sad :((",
            "title_similarity": "0.33141476",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0nt9tf",
            "score": 2,
            "text": "/r/LastImages",
            "title_similarity": "0.5431679",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ntgqq",
            "score": 2,
            "text": "I remember we all held our breath.... with the slim hope that love would conquer the fascists. \n\nWhen you hope for stuff like that, it’s ok to be naive.",
            "title_similarity": "0.2630313",
            "sentiment_compound": 0.8957
        },
        {
            "id": "h0ntnpb",
            "score": 2,
            "text": "I've never seen happier Chinese.",
            "title_similarity": "0.349707",
            "sentiment_compound": -0.4168
        },
        {
            "id": "h0ntogu",
            "score": 2,
            "text": "You mean before the mass public execution?",
            "title_similarity": "0.7051085",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ntx27",
            "score": 3,
            "text": "https://www.reddit.com/r/Conservative/comments/nsiznf/may_35th_1989_the_chinese_communist_party/",
            "title_similarity": "0.4692024",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nuhys",
            "score": 2,
            "text": "They had no idea.",
            "title_similarity": "0.3800199",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0nukrl",
            "score": 2,
            "text": "it’s incredibly heartbreaking when you realize everyone in that picture have likely been killed",
            "title_similarity": "0.42916182",
            "sentiment_compound": -0.8313
        },
        {
            "id": "h0numve",
            "score": 2,
            "text": "China is one of the worst human rights abusers",
            "title_similarity": "0.35430294",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h0nuoh7",
            "score": 2,
            "text": "FUCK THE CCP.",
            "title_similarity": "0.47427806",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0nussl",
            "score": 3,
            "text": "*Mass murder",
            "title_similarity": "0.4759223",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0nutgw",
            "score": 2,
            "text": "Man I see so much hope. Fuck tyranny and fuck the CCP. And Zionist, those guys are a bunch of cunts too.",
            "title_similarity": "0.26447403",
            "sentiment_compound": -0.8396
        },
        {
            "id": "h0nuw7r",
            "score": 2,
            "text": "This is so tragic",
            "title_similarity": "0.35218045",
            "sentiment_compound": -0.5949
        },
        {
            "id": "h0nuymc",
            "score": 8,
            "text": "China lost 2000+ of it's best and brightest that June 4th day.",
            "title_similarity": "0.38807768",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h0nv0ck",
            "score": 2,
            "text": "Fuck CCP. They are constantly trying to whitewash the history by giving out false statements saying that Hoàng Sa Trường Sa are belinn to them.",
            "title_similarity": "0.43033683",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0nv3t9",
            "score": 2,
            "text": "China is a good place. But fccp",
            "title_similarity": "0.30320287",
            "sentiment_compound": 0.2382
        },
        {
            "id": "h0nvmd4",
            "score": 2,
            "text": "When they had the ideation of the freedom of protest. So sad what happened next.",
            "title_similarity": "0.5411434",
            "sentiment_compound": -0.2002
        },
        {
            "id": "h0nw0di",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.45395795"
        },
        {
            "id": "h0nw0ka",
            "score": 2,
            "text": "What happened there",
            "title_similarity": "0.51514506",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nw277",
            "score": 7,
            "text": "Now almost the same type of massacre is happening in Myanmar.",
            "title_similarity": "0.47791556",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nw3i9",
            "score": 2,
            "text": "Weird, looks like freedom.\n\nFreedom isn't free people. And no that doesn't just refer to wars and soldiers. It means think when you vote.",
            "title_similarity": "0.391642",
            "sentiment_compound": 0.4015
        },
        {
            "id": "h0nw4ji",
            "score": 2,
            "text": "Crack up before the crack down m. \n\n\n...I'ma juss go..",
            "title_similarity": "0.61769724",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nw911",
            "score": 3,
            "text": "Before the massacre*\n\nThe chinese government killed its own citizens. Let's call it like it is.",
            "title_similarity": "0.4778626",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0nwdxk",
            "score": 3,
            "text": "Anyone know who owns the rights to this photo?\n\nI’d love to print and frame",
            "title_similarity": "0.31902665",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0nwfiu",
            "score": 3,
            "text": "I want to engage with every one of the thousands of comments here and elsewhere about this, but it makes me so depressed. That people died in the most horrible of ways and there's basically nothing I can do about it except learn more of the horrifying ways the CCP acted then and now",
            "title_similarity": "0.34569162",
            "sentiment_compound": -0.9737
        },
        {
            "id": "h0nwi7a",
            "score": 1,
            "text": "Why did OP just post a blank image?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nObvious /s",
            "title_similarity": "0.47766864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nwn2e",
            "score": 3,
            "text": "How did they forget?!",
            "title_similarity": "0.50851274",
            "sentiment_compound": -0.2942
        },
        {
            "id": "h0nwnr2",
            "score": 5,
            "text": "Didn’t they (the Chinese government) end up even bulldozing over some of the students over and over again until they (for lack of better terms) made them look like ground meat? Cause I have a visceral memory of being shown ||ground people being hosed from the streets|| from a picture someone took and somehow smuggled out.. could be mis-remembering, it feels like it’s a real one but I really hope it’s not and that someone will tell me as such. \n\nBut yeah, totes just a crackdown that we all forget about and our governments still seem to all support chinas still. \n\nMakes ya wonder if any of our governments or other up-and-comers might try and do something similar after seeing how well it’s been working out for China.",
            "title_similarity": "0.36617506",
            "sentiment_compound": 0.9184
        },
        {
            "id": "h0nwyy4",
            "score": 4,
            "text": "China is more cruel than North Korea but people ignore it because their gaming consoles and mobile phones are manufactured there.",
            "title_similarity": "0.28449",
            "sentiment_compound": -0.7
        },
        {
            "id": "h0nxbkl",
            "score": 2,
            "text": "Guys, democracy only works if the population is educated and the system is close to flawless. Please look at the US in the last election... there are white people running around spreading conspiracy. I believe democracy will reach most country eventually, but many countries are not even ready for this system yet, like countries in Africa and even the US.",
            "title_similarity": "0.31694776",
            "sentiment_compound": 0.3038
        },
        {
            "id": "h0nxgf0",
            "score": 2,
            "text": "Why have people started referring to it as ‘crackdown’ instead of ‘massacre’?",
            "title_similarity": "0.53576976",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nxiqe",
            "score": 2,
            "text": "Chinas been fucked up for the last 5 presidents(dictators) theyve had",
            "title_similarity": "0.39724916",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h0nxkeq",
            "score": 3,
            "text": "This is incredibly sad",
            "title_similarity": "0.30048347",
            "sentiment_compound": -0.5256
        },
        {
            "id": "h0nxoh8",
            "score": 2,
            "text": "r/sino",
            "title_similarity": "0.40743494",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nxvdk",
            "score": 2,
            "text": "Before tank nation attack",
            "title_similarity": "0.6428891",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0nxy68",
            "score": 2,
            "text": "Making babies before the uplift. Fuck yeah",
            "title_similarity": "0.4847591",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0ny5cl",
            "score": 3,
            "text": "Murders>Crackdown.\n\nFUCK CHINA",
            "title_similarity": "0.47426498",
            "sentiment_compound": -0.6408
        },
        {
            "id": "h0nyhwd",
            "score": 3,
            "text": "*MASS MURDER. YOU MEAN MASS MURDER.",
            "title_similarity": "0.4663211",
            "sentiment_compound": -0.886
        },
        {
            "id": "h0nyucl",
            "score": 1,
            "text": "[The Tianamen Square Goddess of Democracy Statue.](https://en.m.wikipedia.org/wiki/Goddess_of_Democracy) \n\n33 Feet tall statue with the same ideal as our Statue of Liberty.",
            "title_similarity": "0.2585144",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h0nywiq",
            "score": 12,
            "text": "r/sino is in shambles right now",
            "title_similarity": "0.45775712",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nyz13",
            "score": 2,
            "text": "That escalated quickly!",
            "title_similarity": "0.34394023",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0nzosb",
            "score": 3,
            "text": "I am learning from this thread: Doesn't matter how terrible the atrocity you mention or how much evidence you have for it.     \n1. There are always a bunch of apologists for it.     \n2. There is also a bunch of people who deny it ever happened because it doesn't fit into their view of the world.     \n3. Then there is a bunch of people who are being paid to influence others to say that \"it was not as bad as it has been reported\" and \"maybe they deserved it anyway\".",
            "title_similarity": "0.30364943",
            "sentiment_compound": 0.2071
        },
        {
            "id": "h0nzv61",
            "score": 2,
            "text": "Chinas flag is pretty damn red while violets aren’t really too blue\n\nI came to browse by controversial and so did you",
            "title_similarity": "0.2668675",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0o0370",
            "score": 2,
            "text": "A bit depressing that such a happy picture is such a sad photo..",
            "title_similarity": "0.2594137",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0o04ts",
            "score": 2,
            "text": "Most of the people in this picture are very likely dead",
            "title_similarity": "0.42938635",
            "sentiment_compound": -0.6786
        },
        {
            "id": "h0o056f",
            "score": 2,
            "text": "A communique from a British diplomat resident in Beijing at the time was declassified a couple of years ago and sets out in bleak detail what was witnessed.\n\nThe following stands out for me as probably the most horrifying description:\n\n>APCS THEN RAN OVER BODIES TIME AND TIME AGAIN TO MAKE QUOTE PIE UNQUOTE AND REMAINS COLLECTED BY BULLDOZER.",
            "title_similarity": "0.5394459",
            "sentiment_compound": -0.6115
        },
        {
            "id": "h0o0crn",
            "score": 2,
            "text": "Was this taken before the massacre?",
            "title_similarity": "0.67767465",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o0gmq",
            "score": 1,
            "text": "China Bad 46 million dead under mao alone",
            "title_similarity": "0.38527152",
            "sentiment_compound": -0.8689
        },
        {
            "id": "h0o0kc5",
            "score": 1,
            "text": "Long live communism, die capitalist scum!!!!!!",
            "title_similarity": "0.42790353",
            "sentiment_compound": -0.7243
        },
        {
            "id": "h0o0noo",
            "score": 1,
            "text": "I am gonna keep this image. This is the most beautiful protest I have seen. They all look happy and alive. I wish this was China today. Just thr right amount of traditionalism and modernism mixed in.",
            "title_similarity": "0.24468687",
            "sentiment_compound": 0.8982
        },
        {
            "id": "h0o0ofu",
            "score": 1,
            "text": "I can’t see anything happening",
            "title_similarity": "0.29127574",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o0pzx",
            "score": 1,
            "text": "Isn’t this the same kid who stood in front of the tanks?",
            "title_similarity": "0.3216353",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o0qrc",
            "score": 1,
            "text": "Why does China still try to suppress it even though it's blatantly obvious now? Even the Chinese know.",
            "title_similarity": "0.44229668",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o0rg3",
            "score": 1,
            "text": "Why the fuck would you amass power, only to replace this shit with a fucking police state?",
            "title_similarity": "0.40954328",
            "sentiment_compound": -0.8294
        },
        {
            "id": "h0o0wgl",
            "score": 1,
            "text": "FUCK THE CHINESE GOVERNMENT!!!",
            "title_similarity": "0.4391622",
            "sentiment_compound": -0.6571
        },
        {
            "id": "h0o17qo",
            "score": 1,
            "text": "Imagine how great of a country China would be if their ppl were free and their government wasn't authoritarian and evil",
            "title_similarity": "0.31757537",
            "sentiment_compound": 0.8983
        },
        {
            "id": "h0o1d9p",
            "score": 1,
            "text": "I remember seeing a very moving documentary about the Tiananmen protest and massacre as a child. Shortly before the tanks rolled in one of the female student leaders gave a speech to the frightened protesters. It was an old parable about a colony of ants on top of a grassy hill, and a fire was coming up the hill. The ants decided they needed to huddle together and make a big ball to roll down the hill through the fire to safety. The ants on the outside would burn, but the colony would survive. She said \"we are like the ants on the outside\". Really chokes me up thinking about it. They really had the best interest of their society at heart. These are the kind of citizens that any society should be so proud to have.",
            "title_similarity": "0.25556445",
            "sentiment_compound": 0.9652
        },
        {
            "id": "h0o1dxv",
            "score": 1,
            "text": "Now all of China knows you're here",
            "title_similarity": "0.32212126",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o1iu3",
            "score": 1,
            "text": "Inb4 this gets removed and/or locked",
            "title_similarity": "0.47346807",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o1ocy",
            "score": 3,
            "text": "Here’s what happened right after. (Not for the weak stomached.)\n\nhttps://archive.ph/2020.07.12-074312/https://imgur.com/a/AIIbbPs",
            "title_similarity": "0.5117731",
            "sentiment_compound": 0.3412
        },
        {
            "id": "h0o2dhl",
            "score": 1,
            "text": "What happened?!",
            "title_similarity": "0.47409886",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o3ekr",
            "score": 2,
            "text": "Can someone explain what the Tianamen Square massacre was? I've never had a chance to learn it and I'm genuinely interested",
            "title_similarity": "0.43794543",
            "sentiment_compound": 0.2406
        },
        {
            "id": "h0o3lxf",
            "score": 1,
            "text": "Is that ash catchem?",
            "title_similarity": "0.4342869",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o3p1m",
            "score": 1,
            "text": "Looks like everyone was Kung-Fu fighting.",
            "title_similarity": "0.28930846",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o3qso",
            "score": 1,
            "text": "What leads a person to join an army and kill other people such as these?",
            "title_similarity": "0.3565218",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0o3sfy",
            "score": 1,
            "text": "Never forget that the CCP wants to control the narrative and do everything they can to paint China in a positive light.",
            "title_similarity": "0.2563374",
            "sentiment_compound": 0.6447
        },
        {
            "id": "h0o4ip8",
            "score": 2,
            "text": "This would make an INCREDIBLE painting or poster.",
            "title_similarity": "0.29988396",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o6kss",
            "score": 1,
            "text": "T-T",
            "title_similarity": "0.35356772",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o70cg",
            "score": 2,
            "text": "Taiwan exists.",
            "title_similarity": "0.41629475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0o762t",
            "score": 2,
            "text": "I just don't understand. Why can't they just admit they fucked up and move on? Everyone knows it happened. Is it really losing face? Each year it drags on, it becomes more and more shameful for the government. Just admit it and move on.",
            "title_similarity": "0.47179824",
            "sentiment_compound": -0.917
        },
        {
            "id": "h0o9mwu",
            "score": 2,
            "text": "\"so dance, dance like it's the last, last time of your life...\"",
            "title_similarity": "0.4196242",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0o9zga",
            "score": 1,
            "text": "Is that the same man in a suit that confronted the tanks?  I remember watching the tank scene when i was a real little kid i was in kindergarten or first grade at the time.",
            "title_similarity": "0.26910132",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h0oa667",
            "score": 3,
            "text": "I went to Tiananmen Square. Before The Chinese showed up, it was a happy place. They had flowering meadows and rainbow skies, and rivers made of chocolate, where the children danced and laughed and played with gumdrop smiles.",
            "title_similarity": "0.11920479",
            "sentiment_compound": 0.9042
        },
        {
            "id": "h0oadyi",
            "score": 1,
            "text": "I went to Beijing and visited here. What a shame",
            "title_similarity": "0.52250725",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0occh2",
            "score": 1,
            "text": "I would really like to know what ever happened to the girl dancing in the picture. Does anybody know?",
            "title_similarity": "0.27938464",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h0ocp3w",
            "score": 1,
            "text": "We had a Chinese lodger (at university) when that happened, who was taken from our house to their London embassy to be told the party line. Chilled me to the bone, and I was just a kid. Not cool China",
            "title_similarity": "0.46750194",
            "sentiment_compound": 0.1872
        },
        {
            "id": "h0ocs4g",
            "score": 1,
            "text": "I need a history lesson, what exactly happened?",
            "title_similarity": "0.5484928",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0of11c",
            "score": 1,
            "text": "CCP: well anyways I started blasting...",
            "title_similarity": "0.44486427",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0ohzjn",
            "score": 2,
            "text": "China bad, upvotes plz",
            "title_similarity": "0.52369106",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0ol1gw",
            "score": 1,
            "text": "Maybe they can make a Hollywood movie about this atrocity. No [wait](https://www.washingtonpost.com/opinions/2021/05/31/hollywood-just-cant-stop-groveling-china/).",
            "title_similarity": "0.47277045",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0ol9jt",
            "score": 2,
            "text": "Mainland China would fracture and may become ultra nationalist if US style democracy replaced CCP rule.\n\nA country needs to be ready to change systems or else WW3 would have occurred.",
            "title_similarity": "0.51913416",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0om7ij",
            "score": 1,
            "text": "*massacre not \"crackdown\"",
            "title_similarity": "0.38906375",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0om9cm",
            "score": 2,
            "text": "109k upvotes for a Chinese propaganda photo. Nice work bots.",
            "title_similarity": "0.295456",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0on032",
            "score": 1,
            "text": "More like tankdown",
            "title_similarity": "0.47545582",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h0on5qj",
            "score": 1,
            "text": "I don’t understand what you mean, absolutely nothing ever happened in Tiananmen Square. There was never any historical events that ever occurred in Tiananmen Square no definitely not ever. It’s just a regular old area where nothing ever happens.",
            "title_similarity": "0.32783762",
            "sentiment_compound": -0.3089
        },
        {
            "id": "h0on6k7",
            "score": 1,
            "text": "*Massacre",
            "title_similarity": "0.47590637",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0on95x",
            "score": 2,
            "text": "Considering so many people talking about this. No one can deny that it is true and it did happen. On the other hand, why no one say anything about Nanjing Massacre that Japanese did to Chinese?",
            "title_similarity": "0.32209656",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0ongnf",
            "score": 1,
            "text": "For how many of them was this their last photo?",
            "title_similarity": "0.5680222",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0onyvz",
            "score": 1,
            "text": "I feel horrible knowing that many of those people are dead",
            "title_similarity": "0.36692566",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h0onzgo",
            "score": 1,
            "text": "What is this about?",
            "title_similarity": "0.42241102",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0oopni",
            "score": 2,
            "text": "I wonder what they were listening to.  What’s your guess?",
            "title_similarity": "0.3648478",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0oor4h",
            "score": 3,
            "text": "**MASSACRE***",
            "title_similarity": "0.50994027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0opae3",
            "score": 1,
            "text": "ITS TIANANMEN",
            "title_similarity": "0.6134057",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0opdyq",
            "score": 1,
            "text": "Whats Tianamen Square and whys everyone talking about it today?",
            "title_similarity": "0.6726061",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0opi6e",
            "score": 1,
            "text": "Fuck Winnie the Pooh",
            "title_similarity": "0.2903824",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0opke3",
            "score": 1,
            "text": "Massacre",
            "title_similarity": "0.4703292",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0oqp76",
            "score": 1,
            "text": "I am a peasant someone please give me the gist of what happened here",
            "title_similarity": "0.3635546",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0oqyt1",
            "score": 1,
            "text": "Tiananmen*",
            "title_similarity": "0.5786183",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0oyt9e",
            "score": 1,
            "text": "Whyyyy don’t you aaask the kids at Tianamen Squaaarre",
            "title_similarity": "0.44789612",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0p5taj",
            "score": 2,
            "text": "What a lovely looks like a couple sure Hope's nothinh bad happens",
            "title_similarity": "0.17540167",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0p5wbe",
            "score": 1,
            "text": "I'm sorry but, can some one please explain what happened here, im not sure about what happened",
            "title_similarity": "0.49203575",
            "sentiment_compound": 0.0918
        },
        {
            "id": "h0p63l0",
            "score": 1,
            "text": "John Xina!!!!!!!!!!!!! He loves the CCP and genocide!!!!",
            "title_similarity": "0.14492327",
            "sentiment_compound": 0.7067
        },
        {
            "id": "h0p65xo",
            "score": 1,
            "text": "Nothing happened there in 1989 😤",
            "title_similarity": "0.49516624",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0pbpgh",
            "score": 1,
            "text": "Im sorry im just a teenager who doesnt know shit but what was the crackdown ?",
            "title_similarity": "0.4316853",
            "sentiment_compound": 0.2052
        },
        {
            "id": "h0pg8rx",
            "score": 2,
            "text": "Dancing to Western music only leads to one thing...",
            "title_similarity": "0.30761737",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0psrp4",
            "score": 2,
            "text": "This is the saddest image Ive seen in a long while",
            "title_similarity": "0.4249041",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h0pzsh8",
            "score": 1,
            "text": "The students were opposed to liberalization of markets right? I always want to believe they were pro democracy but that wasn't the case?",
            "title_similarity": "0.26480263",
            "sentiment_compound": 0.1306
        },
        {
            "id": "h0qsbhd",
            "score": 2,
            "text": "I was absolutely happy at first then I got immediately sad.",
            "title_similarity": "0.21028146",
            "sentiment_compound": 0.2247
        },
        {
            "id": "h0qyr41",
            "score": 2,
            "text": "All of the “ hope and dreams” and then ..... let us never forget",
            "title_similarity": "0.32431135",
            "sentiment_compound": 0.5523
        },
        {
            "id": "h0r2cb4",
            "score": 2,
            "text": "Crackdown or Massacre?!",
            "title_similarity": "0.4995498",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0rm9dr",
            "score": 2,
            "text": "This photo is so heartbreaking. It captures youth perfectly. Young, idealistic people who want to make a difference and stand up for what’s right, taking a carefree moment to dance and spin, completely unaware of what was about to happen.",
            "title_similarity": "0.16163841",
            "sentiment_compound": 0.6175
        },
        {
            "id": "h0tvvng",
            "score": 2,
            "text": "https://media.pri.org/s3fs-public/styles/w2304/public/images/2019/06/20190601tiananmen1.jpg?itok=U82BFm1s",
            "title_similarity": "0.49312565",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vdug0",
            "score": 2,
            "text": "This makes my heart hurt.",
            "title_similarity": "0.3243615",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0xibir",
            "score": 2,
            "text": "Happy cakeday",
            "title_similarity": "0.19955315",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1gt4xd",
            "score": 1,
            "text": "This is really sad 😔",
            "title_similarity": "0.33690184",
            "sentiment_compound": -0.4243
        },
        {
            "id": "hetqvsy",
            "score": 1,
            "text": "Is it to my understanding most of the people in this photo are presumed dead? I thought it was a couple dozen people?? I feel so bad about misinformed for so long on this",
            "title_similarity": "0.40923566",
            "sentiment_compound": -0.9216
        },
        {
            "id": "i1208dg",
            "score": 1,
            "text": "What crackdown?",
            "title_similarity": "0.5425161",
            "sentiment_compound": 0.0
        }
    ]
}