{
    "My girlfriend, who is studying math at university, is a huge math nerd. It's her birthday in a bit. Any math-related gift ideas would be amazing.\nWhat would you, as someone who likes math, like to receive? \n\nAny cute/inspiring books? Thats pretty much the only math thing I can come up with.": [
        {
            "id": "i0vxod1",
            "score": 0,
            "text": "[This](https://www.amazon.com/dp/B08XN7S6D3) is a pretty cool gift",
            "title_similarity": "0.41801164"
        },
        {
            "id": "i0wmkb3",
            "score": 2,
            "text": "Find local math professors that she's interested.  Email them and ask them if they would be up for getting lunch with you and your girlfriend.  Make it a surprise for her; go to lunch and have an amazing math professor there.  :)",
            "title_similarity": "0.74564326"
        },
        {
            "id": "i0w6w8q",
            "score": 2,
            "text": "Buy her Godel Escher Bach…",
            "title_similarity": "0.3654981"
        },
        {
            "id": "i0vs4hw",
            "score": 7,
            "text": "Buy her Euclid's elements, there's a cute version on Amazon.",
            "title_similarity": "0.47058222"
        },
        {
            "id": "i0w28qf",
            "score": 0,
            "text": "You could always force her to apply some of her math skills via a treasure-trail of math related clues. Design some ciphers, a couple geo-caches so she's triangulating stuff, make up some puzzles where each one points her to the next location. People who like analytical problem solving may enjoy that... and then at the end of the treasure-hunt are her birthday gifts.",
            "title_similarity": "0.8096891"
        },
        {
            "id": "i0xdtu9",
            "score": 0,
            "text": "This notebook:\nhttps://www.atomstoastronauts.com/collections/best-sellers/products/maths-a5-hardcover-notebook\n\nA redditor created it during the pandemic.",
            "title_similarity": "0.673537"
        },
        {
            "id": "i0yeqkd",
            "score": 0,
            "text": "Get her some hagoromo chalk.",
            "title_similarity": "0.34113973"
        },
        {
            "id": "i0ytimy",
            "score": 0,
            "text": "Bake a cake or pie that is literally shaped 3.14 I guess it would be four pies",
            "title_similarity": "0.41388285"
        },
        {
            "id": "i0wcegf",
            "score": 1,
            "text": "The Princeton Companion to Mathematics, a book by a field's medalist comes to mind.",
            "title_similarity": "0.6399403"
        },
        {
            "id": "i0wpdgq",
            "score": 1,
            "text": "Perhaps Six Easy Pieces by Feynman if she's into physics as well.",
            "title_similarity": "0.5972734"
        },
        {
            "id": "i0wd765",
            "score": 9,
            "text": "If her life run around maths, don't you think is better gift to her a non-math stuff?",
            "title_similarity": "0.7531096"
        },
        {
            "id": "i0w0nhu",
            "score": 2,
            "text": "A friend gave me mathematical apocrypha. Stories about being studying math. Some personal stuff in there too, kinda neat",
            "title_similarity": "0.76363957"
        },
        {
            "id": "i0xahfz",
            "score": 2,
            "text": "I've heard the Princeton Companion to Mathematics is a fantastic book to have for any budding mathematician, might get it for myself as a gift someday (there's also a version focusing on applied math): [https://press.princeton.edu/books/hardcover/9780691118802/the-princeton-companion-to-mathematics](https://press.princeton.edu/books/hardcover/9780691118802/the-princeton-companion-to-mathematics)\n\nMore academic than some of the other book recommendations on this thread since the target audience of the book is advanced math undergraduates and up.\n\nAnd I'm seconding all the people who recommend the Hagoromo chalk - it is so satisfying to use",
            "title_similarity": "0.7698413"
        },
        {
            "id": "i0w055s",
            "score": 2,
            "text": "https://www.amazon.com/Mathematicians-Apology-Canto-Classics/dp/110760463X/ref=nodl_\n\nThis is not a textbook, but a memoir written by GH Hardy, one of the finest mathematicians of the 20th century.",
            "title_similarity": "0.6736574"
        },
        {
            "id": "i0w5bmj",
            "score": 2,
            "text": "On my birthday, I always do something related to my age. This year, I turned 28, so I got a roll of nickels to hand out to anyone who wishes me a happy birthday. Nickel is the 28th element. I don't know of anything extravagant for this idea, so I wouldn't make it the only gift. But if she's the type of person who really likes and keeps thoughtful trinkets, then throwing something in could be a really cute add-on.\n\nSome other things I've done: 24 I brought 2 dozen donuts to work to share. 25 I handed out quarters for a quarter century. 26 I don't actually remember, but 26 is kinda a boring number anyway. 27 was great, 3³ I brought in a bunch of three-point pastries like scones, turnovers, and samosa. I brought in a bunch of paper cube-things and tetrahedrons to decorate my desk. I made a paper chain that was the digits of pi in base three. It was a grand ole time.",
            "title_similarity": "0.7389525"
        },
        {
            "id": "i0w1z20",
            "score": 9,
            "text": "Perhaps a slide rule with a case?",
            "title_similarity": "0.1206566"
        },
        {
            "id": "i0vre8u",
            "score": 72,
            "text": "Get her some pie.\n\nI'll show myself out.",
            "title_similarity": "0.32914448"
        },
        {
            "id": "i0vs07a",
            "score": 29,
            "text": "Honestly? Personally I'd just want a reference lol. Shit is expensive and if it's one I'll use often/can't easily be found online/would just be cool to have, I'd want one.\n\nProbably not the best gift idea though if she likes more thoughtful gifts.",
            "title_similarity": "0.5567041"
        },
        {
            "id": "i0w8vjz",
            "score": 11,
            "text": "For casual reading, A Mathematician's Apology by G. H. Hardy might be nice?",
            "title_similarity": "0.55061007"
        },
        {
            "id": "i0vr2re",
            "score": 90,
            "text": "The symmetry of things by Conway.\n\nGood looking book that contains some actually interesting nontrivial math.\n\nOr one of these books depending on her level of knowledge: \n\nVisual Group Theory\n\nVisual Complex Analysis\n\nVisual Differential Geometry\n\n\nIf she‘s into physics:\n\nGauge fields, knots and gravity by baez\n\nOr a sculpture like this:\n\nhttps://bathsheba.com/crystal/calabiyau/ \n\n(I really like the E8 laser crystal on that website because i know lie theory)",
            "title_similarity": "0.73064125"
        },
        {
            "id": "i0w2ncj",
            "score": 27,
            "text": "[deleted]",
            "title_similarity": "-0.025377432"
        },
        {
            "id": "i0vs4pq",
            "score": 89,
            "text": "A Klein bottle\nhttps://youtu.be/9NlqYr6-TpA\nFunny math shirt",
            "title_similarity": "0.57979715"
        },
        {
            "id": "i0w1a7i",
            "score": 356,
            "text": "Hagoromo chalk, if you can get your hands on it. Mathematicians love this stuff",
            "title_similarity": "0.55998635"
        },
        {
            "id": "i0w72ba",
            "score": 155,
            "text": "I recommend asking her whether she'd like something math-related first, I DON'T like it when I get something physics or math-related unless it is something next level entirely, but that's just me",
            "title_similarity": "0.7488662"
        },
        {
            "id": "i0w8fhx",
            "score": 74,
            "text": "I quite like the xkcd books, what if ? (And others that i don't remember the name)Not just maths but science in general",
            "title_similarity": "0.6650568"
        },
        {
            "id": "i0vuuvl",
            "score": 399,
            "text": "Maybe not as “Mathy” as some of these other ideas, but mathies spend a lot of time writing, by hand, in pen and pencil. Buying her nice writing implements and notebooks would probably be sweet. \n\nFor me, I get most of my mathematics implements at art stores. I use heavy duty mechanical pencils usually meant for serious drawing, and large sketch books with high quality heavy stock paper. \n\nThese things are pricier than run-of-the-mill equipment ($30 for a pencil and $15 for a book sort of deal) but they don’t break the bank, and you can spend as much or as little as you want by buying multiples of these gifts.",
            "title_similarity": "0.70182335"
        },
        {
            "id": "i0vvnl3",
            "score": 107,
            "text": "I’ve got tons of book recommendations! I love reading about math’s history and learning how math is connected to everything. I’ve read and highly recommend the following books:\n\n- *How Not to be Wrong* by Jordan Ellenburg\n- *Shape* by Jordan Ellenburg\n- *Humble Pi* by Matt Parker\n- *Naked Statistics* by Charles Wheelan\n- *Euclid’s Window* by Leonard Mlodinow\n- *The Drunkard’s Walk* by Leonard Mlodinow\n- *Something Deeply Hidden* by Sean Carrol",
            "title_similarity": "0.7363381"
        },
        {
            "id": "i0vq9ue",
            "score": 33,
            "text": "*The Annotated Alice* would be a cool (and cute) gift. The 150th anniversary version was published in 2015, so you might find it in bookstores. It's also available on Amazon.",
            "title_similarity": "0.6211548"
        },
        {
            "id": "i0vtchu",
            "score": 5,
            "text": "Something from MathGear UK would do nicely. It’s a shop with mathematical curiosities made by mathematical/scientific presenter Matt Parker and Steve Mould.",
            "title_similarity": "0.61587"
        },
        {
            "id": "i0vtn0e",
            "score": 4,
            "text": "I really enjoyed An Imaginary Tale by Paul J. Nahin. It isn’t a textbook for studying, but more of a semi-casual history of complex numbers.\n\nAnother non-book idea is to get her something like a picture/sculpture of a beautiful mathematical object (a fractal might work). If she’s into those sorts of things it could be nice.",
            "title_similarity": "0.7509326"
        },
        {
            "id": "i0vtt91",
            "score": 92,
            "text": "Hey, what field does she work in?",
            "title_similarity": "0.194266"
        },
        {
            "id": "i0vv43i",
            "score": 7,
            "text": "i think it depends on the topic of math that she likes. if you would ask me what books as a math person i'm preferred on logic or puzzles",
            "title_similarity": "0.71392435"
        },
        {
            "id": "i0vxjqm",
            "score": 2,
            "text": "Actually a family member got me a math coffee tumbler. All time favorite math gift I've gotten and use it daily.",
            "title_similarity": "0.71105874"
        },
        {
            "id": "i0vyefg",
            "score": 20,
            "text": "If she drinks coffee or tea, get her a math mug. The math mug I got from my brother last Christmas was my favorite simple gift that I received",
            "title_similarity": "0.7810712"
        },
        {
            "id": "i0vyhoy",
            "score": 2,
            "text": "Get her an empty box with a miniature sign in it saying \"OUTSIDE\". Then you can claim that you've given her the world!",
            "title_similarity": "0.39050978"
        },
        {
            "id": "i0vz5w1",
            "score": 6,
            "text": "Various [Klein bottles](https://www.kleinbottle.com).",
            "title_similarity": "0.17342353"
        },
        {
            "id": "i0vzxo5",
            "score": 5,
            "text": "Get her a necklace with a math symbol",
            "title_similarity": "0.5860457"
        },
        {
            "id": "i0w0j5w",
            "score": 1,
            "text": "https://www.amazon.com/Lost-Math-Beauty-Physics-Astray/dp/0465094252",
            "title_similarity": "0.5671596"
        },
        {
            "id": "i0w0jk1",
            "score": 1,
            "text": "I have an affinity for clocks where the numbers have been replaced by equivalent math expressions. [Something like this](https://www.pinterest.com/pin/15973773665116452/).\n\nSadly the quality of the expressions varies a lot, the one in the picture is the best I found on a quick googling. I got one as a gift and it is, like, elementary school level stuff, which was a little disappointing. So it might be a risk.",
            "title_similarity": "0.77233654"
        },
        {
            "id": "i0w1m5r",
            "score": 1,
            "text": "If she's working with mechanical pencils: a couple of nice ones. maybe not the only gift but I know I was happy when someone bought me a set of Pentel Graphgear 1000",
            "title_similarity": "0.75316703"
        },
        {
            "id": "i0w1scb",
            "score": 4,
            "text": "As a math/physics major, I’ve given my girlfriend a list of textbooks I would like to read bc they seem interesting, but can’t justify buying since they don’t necessarily pertain to my research or course load.\n\nFor my birthday  she got me spivaks differential geometry volume 2, which offers a historical approach to differential geometry and includes translataions of papers by gauss and Riemann. It was the best gift I’ve gotten in a while.",
            "title_similarity": "0.886848"
        },
        {
            "id": "i0w1xgk",
            "score": 5,
            "text": "She might enjoy a glass Klein bottle!\n\nhttps://www.kleinbottle.com",
            "title_similarity": "0.39083862"
        },
        {
            "id": "i0w20f6",
            "score": 1,
            "text": "My favorite is this https://mathsgear.co.uk/collections/special-occasions/products/amicable-numbers-pair-of-keyrings-nerd-romance.   It's about amicable numbers (Google it!) In general this site has a nice collection of items for math people, I highly recommend it.",
            "title_similarity": "0.7507247"
        },
        {
            "id": "i0w2ado",
            "score": 2,
            "text": "idk how much you're willing to spend, but the Remarkable Ttable is amazing for heavy notebook users and I find it awesome for mathematics notations. i have all my reference books on it as pdfs with heavy notations. Way more organized than dozens of notebooks",
            "title_similarity": "0.65331876"
        },
        {
            "id": "i0w2kno",
            "score": 3,
            "text": "[A glass Klein bottle](https://www.kleinbottle.com/)\nSomething from [https://mathsgear.co.uk/](mathsgear)\n[Some 3Blue1Brown merch] (https://store.dftba.com/collections/3blue1brown)",
            "title_similarity": "0.48383752"
        },
        {
            "id": "i0w2nfh",
            "score": 9,
            "text": "150 flowers:\n\n50 virginica\n\n50 versicolor\n\n50 setosa",
            "title_similarity": "0.28712612"
        },
        {
            "id": "i0w3z17",
            "score": 5,
            "text": "Hire an a cappella group to sing https://youtu.be/UTby_e4-Rhg\n\nOr learn it yourself with a friend/or playing as a backtrack. \n\nAnd flowers and a nice dinner",
            "title_similarity": "0.45823026"
        },
        {
            "id": "i0w45pk",
            "score": 2,
            "text": "A toroflux! They’re super cool, and actually quite math-y (being a torus knot). A mathologer video featuring them:\n\nhttps://youtu.be/VK7XR-wlpAk",
            "title_similarity": "0.6478603"
        },
        {
            "id": "i0w47z9",
            "score": 2,
            "text": "Not a book but if she likes Geometry a [Klein Bottle hat and a Mobius Strip scarf](https://www.kleinbottle.com/klein_bottle_hats.htm#HatandScarf) sound like cool gifts, an aunt made one for me inspired in the ones in the link.",
            "title_similarity": "0.723122"
        },
        {
            "id": "i0w4ft1",
            "score": 1,
            "text": "Faber Castell clutch pencils.  Love em for math work!",
            "title_similarity": "0.6502657"
        },
        {
            "id": "i0w5aen",
            "score": 1,
            "text": "[https://www.google.com/search?q=green+fractals&tbm=isch](https://www.google.com/search?q=green+fractals&tbm=isch)\n\nWall paint smth. {your color} + fractals",
            "title_similarity": "0.37122428"
        },
        {
            "id": "i0w63se",
            "score": 1,
            "text": "A Galtons Board",
            "title_similarity": "-0.030485202"
        },
        {
            "id": "i0w6pub",
            "score": 1,
            "text": "Elements of Euclid",
            "title_similarity": "-0.038644314"
        },
        {
            "id": "i0w6y21",
            "score": 3,
            "text": "I got my brother a Klein Stein a while ago. It's from Acme Klein Bottles, the guy has Klein bottles bent into all shapes and sizes --they're really quite cool! The guy even sent us an album of a bunch of photos he took while getting it ready to ship out, and he includes a _thick_ packet of neat topology things in the box.\n\nIf she spends a lot of time doing math, writing utensils! I personally use a Pentel Orenz Nero 0.2 for most of my math, it is a _fantastic_ pencil, particularly for small handwriting since it uses the thinnest leads available (mine gets microscopic). If small handwriting isn't a concern, I also recommend the Rotring 600/800 and the Pentel Sharp Kerry.\n\nIf she's more about pens, I love doing math in fountain pen. The LAMY 2000 is probably the best fountain pen I've used for math, since its cap is super easy to pop on and off constantly and it never seems to dry out, but the western nib sizes mean that even extra-fine is still a little broad. And it's pricey.\n\nNotebooks are neat too. I recommend Moleskine because they're well made and compact for their number of pages, my primary math notebook for most of school has been a standard-size Moleskine gridpaper with 1500 digits of pi laser-etched on the front and Dirac's equation on the back.\n\nMoleskine's paper quality is fine for pencil, but feathers a lot with pens. Rhodia has similarly well-made notebooks but with nicer, heavier paper -the tradeoff being that they have far fewer pages.\n\nAlso a hug. Mathematicians like hugs too.",
            "title_similarity": "0.7341645"
        },
        {
            "id": "i0w7ls6",
            "score": 1,
            "text": "As pi day was only 2 days ago, maybe a cake with a pi on it?",
            "title_similarity": "0.5044513"
        },
        {
            "id": "i0w8j6f",
            "score": 5,
            "text": "something from vsauce? \n https://www.curiositybox.com/",
            "title_similarity": "0.26033542"
        },
        {
            "id": "i0wc5r5",
            "score": 2,
            "text": "Atoms to astronauts has some notebooks and mugs with science jargon printed on. \n\nDefinitely not gift of knowledge of math like a book. But it is useful whish is also how I like to think about a good gift.",
            "title_similarity": "0.6121421"
        },
        {
            "id": "i0wdor9",
            "score": 2,
            "text": "The Princeton Companion To Mathematics\n\nThe Princeton Companion to Applied Mathematics \n\nEncyclopedia of Mathematics",
            "title_similarity": "0.5173011"
        },
        {
            "id": "i0we0m2",
            "score": 1,
            "text": "I 3D printed a Klein Bottle a few months ago. Will do a Trefoil Knot this Friday. I guess she would like this kind of mathematical objects IRL",
            "title_similarity": "0.7246896"
        },
        {
            "id": "i0we2bl",
            "score": 12,
            "text": "You could [crochet a hyperbolic plane](https://theiff.org/press/interweave.html).",
            "title_similarity": "0.32450837"
        },
        {
            "id": "i0we6g8",
            "score": 1,
            "text": "Have you heard about “e: the story about a number” by moar ??",
            "title_similarity": "0.24645609"
        },
        {
            "id": "i0wew60",
            "score": 1,
            "text": "If she’s anything like me and my cohort, a puzzle or a good board game is a good option",
            "title_similarity": "0.5749418"
        },
        {
            "id": "i0wfieu",
            "score": 1,
            "text": "Hmmmm depends on budget.\n\n1. If you are willing to spend hundreds (maybe thousand), then a tablet to write and save notes would be amazing. Some even has softwares that translates your handwritten math work into pdf (this is freaking amazing in my opinion).\n\n2. If she prefers pen and paper, then a hard copy of a book is probably a good idea. Maybe ask her advisor or classmates what she’s into, and get a book for her. Better yet, ask her directly so you don’t end up getting a duplicate.\n\n\nDessert: some math jokes during her celebration would be good!",
            "title_similarity": "0.85945904"
        },
        {
            "id": "i0wgfai",
            "score": 1,
            "text": "A drawing tablet, nice notebooks/writing utensils, a better desk, or anything that makes writing easier. \n\n\nAlso, she will probably love games/puzzles the involve logic.",
            "title_similarity": "0.6182506"
        },
        {
            "id": "i0wh8xj",
            "score": 1,
            "text": "Euler's identify snapback hat.\n\nhttps://mathmerch.xyz/products/eulers-identity-snapback-hat-2",
            "title_similarity": "0.3905562"
        },
        {
            "id": "i0whtth",
            "score": 1,
            "text": "random but my bf is my math teacher's son and we both are mathies.\n\nI can now say maths is my life.",
            "title_similarity": "0.77939904"
        },
        {
            "id": "i0wi5wy",
            "score": 1,
            "text": "Any Springer book would do the trick :p",
            "title_similarity": "0.4329141"
        },
        {
            "id": "i0wib8x",
            "score": 1,
            "text": "\"Chaos\" by J. Gleick, or if she's into fantasy/scifi with a math theme, \"white light\" by Rucker",
            "title_similarity": "0.6693567"
        },
        {
            "id": "i0wii04",
            "score": 1,
            "text": "get her some *pie.*\n\nsorry but i dont know where you can find an *e.*",
            "title_similarity": "0.4479521"
        },
        {
            "id": "i0wipvv",
            "score": 1,
            "text": "This is hit or miss, but you can get leggings or scarves covered in math. Depends how Ms. Frizzle she is. I love my math infinity scarf!",
            "title_similarity": "0.7135823"
        },
        {
            "id": "i0wk3h5",
            "score": 1,
            "text": "Zometool set!",
            "title_similarity": "0.14416973"
        },
        {
            "id": "i0wk8st",
            "score": 6,
            "text": "Are you sure she would enjoy a \"mathy\" gift rather than something romantic?",
            "title_similarity": "0.5036006"
        },
        {
            "id": "i0wkeqm",
            "score": 1,
            "text": "At the end of the day, she is still a girl. Give her flowers, a kiss and a few dollars (in the form of gift certs?) - that's the math part. I'm serious! (This coming from a girl who adores math guys! ++ they can get whatever they like that you don't know about) :D",
            "title_similarity": "0.79260266"
        },
        {
            "id": "i0wknb7",
            "score": 1,
            "text": "Give her a pie and make sure you reference it’s leftovers from pie day. March14. Funny little joke",
            "title_similarity": "0.5463259"
        },
        {
            "id": "i0wl8bu",
            "score": 1,
            "text": "I once had a t-shirt that said \"Got milk, need pi!\" And it was my favorite t-shirt of all time. But it's probably better for those who are old enough to remember the ubiquitous \"got milk?\" ads.",
            "title_similarity": "0.62886435"
        },
        {
            "id": "i0wludm",
            "score": 1,
            "text": "The Unemployed Philosophers Guild has some neat stuff, mugs etc.  https://philosophersguild.com/",
            "title_similarity": "0.48451388"
        },
        {
            "id": "i0wlweh",
            "score": 1,
            "text": "A gömböc - the shape that shouldn't exist",
            "title_similarity": "0.11991425"
        },
        {
            "id": "i0wmusg",
            "score": 1,
            "text": "Get her two pies and put them in a box labeled τ",
            "title_similarity": "0.37336832"
        },
        {
            "id": "i0wolgw",
            "score": 1,
            "text": "It's generally inadvisable to get someone something from their hobby unless you do a bunch of research! Ask her what her field is, and find out from peers what topics she geeks out on!",
            "title_similarity": "0.56289077"
        },
        {
            "id": "i0wpcg7",
            "score": 2,
            "text": "Alice's Adventures in Wonderland by Lewis Carroll",
            "title_similarity": "0.35181272"
        },
        {
            "id": "i0wpdp6",
            "score": 1,
            "text": "A Klein bottle bottle opener. https://bathsheba.com/math/klein/",
            "title_similarity": "0.43154177"
        },
        {
            "id": "i0wpe3e",
            "score": 1,
            "text": "https://press.princeton.edu/books/hardcover/9780691199221/do-not-erase I cannot recommend this book enough, it’s really interesting and honestly a little artsy as well as math-y. This and some hagoromo chalk would be an amazing gift",
            "title_similarity": "0.7004255"
        },
        {
            "id": "i0wpj3g",
            "score": 1,
            "text": "A Klein bottle is always sweet. Our class chipped in and bought one for our teacher and he really loved it",
            "title_similarity": "0.5838758"
        },
        {
            "id": "i0wprko",
            "score": 1,
            "text": "Buy her a Klien Bottle. Mathematicians love Klien Bottles.",
            "title_similarity": "0.6522566"
        },
        {
            "id": "i0wq8wl",
            "score": 1,
            "text": "here's an etsy shop with some cute/fun math puns\n\nhttps://www.etsy.com/ca/shop/TheChemistTree",
            "title_similarity": "0.64537454"
        },
        {
            "id": "i0wsje5",
            "score": 1,
            "text": "7x7 Rubiks Cube. 3x3 is boring fast, evens have parity. More than 7 takes too long and is pillowed. 7x7 is the perfect one",
            "title_similarity": "0.5633977"
        },
        {
            "id": "i0wxcy6",
            "score": 1,
            "text": "I just got a book called “Curves for the mathematically curious” that could be good for her",
            "title_similarity": "0.7070624"
        },
        {
            "id": "i0wxuc1",
            "score": 1,
            "text": "A \"Get out of Cantor space free\" card.",
            "title_similarity": "0.19364718"
        },
        {
            "id": "i0wyg8i",
            "score": 1,
            "text": "Make her a pie",
            "title_similarity": "0.3143282"
        },
        {
            "id": "i0wzckg",
            "score": 1,
            "text": "Make a Pie for her.",
            "title_similarity": "0.3448155"
        },
        {
            "id": "i0x08mc",
            "score": 1,
            "text": "A complete proof to the Riemann Hypothesis",
            "title_similarity": "0.34176624"
        },
        {
            "id": "i0x2ow0",
            "score": 1,
            "text": "A lot of the comments are great ideas but mines a goofy one. How about 31 pizzas? Not rational but a pi joke.",
            "title_similarity": "0.49040845"
        },
        {
            "id": "i0x4512",
            "score": 1,
            "text": "If they also appreciate design then **Oliver Byrne’s** version of the **Elements of Euclid** is *awesome*. ([Described here](https://www.maa.org/press/periodicals/convergence/mathematical-treasures-oliver-byrnes-euclid))  \nReprinted by Taschen: [can be bought here](https://www.taschen.com/pages/en/catalogue/classics/all/47706/facts.oliver_byrne_the_first_six_books_of_the_elements_of_euclid.htm?change_user_country=US&gclid=CjwKCAjwlcaRBhBYEiwAK341jQOTxEPMN40smJPTIY4NB23Qcoipk9tFQ0Hyshyx6Ll1SHkbMPNx5BoCmaQQAvD_BwE)\n\n\nAlso some posters based on the visual renditions of proofs in the book: e.g. [this one](https://www.c82.net/euclid/posters/?utm_medium=website&utm_source=archdaily.com)",
            "title_similarity": "0.6056204"
        },
        {
            "id": "i0x5nmh",
            "score": 1,
            "text": "Dunno what your style is, but there are loads of mathsy designs on a massive range of products available [here](https://www.redbubble.com/people/JLERogers/shop?asc=u).",
            "title_similarity": "0.5490741"
        },
        {
            "id": "i0x7ttv",
            "score": 1,
            "text": "It would help to know whether she is an undergraduate or a graduate student and what year is she (sophomore, junior, 2nd year grad student, ...)",
            "title_similarity": "0.5365339"
        },
        {
            "id": "i0xaat8",
            "score": 1,
            "text": "I think *Surreal Numbers: How two ex-students turned on to pure mathematics and found total happiness* by Donald Knuth is equal parts cute and interesting. It's a fairly basic story designed to introduce the reader to the surreal number system, which is a way of defining the real numbers (along with infinitesimals and arbitrary large numbers) using sets. They were developed by John Conway and also show up in the study of combinatorial games. The book is, in my opinion, a very good balance between readable and technical. \n\nI would also recommend one of the textbooks on combinatorial game theory, titled *Winning Ways for your Mathematical Plays*. It is written in playful language (so not as dry as some other textbooks), but introduces interesting and powerful theory.\n\nThere's also *Godel, Escher, Bach*, which is, in my option, touchstone reading for anyone interested in math and logic.",
            "title_similarity": "0.7676053"
        },
        {
            "id": "i0xb6r3",
            "score": 1,
            "text": "You can find Klein bottles which are neat mathematical objects",
            "title_similarity": "0.4167362"
        },
        {
            "id": "i0xbq7b",
            "score": 2,
            "text": "an infinity necklace",
            "title_similarity": "0.1795304"
        },
        {
            "id": "i0xc935",
            "score": 1,
            "text": "Texas instrument",
            "title_similarity": "-0.043370493"
        },
        {
            "id": "i0xch37",
            "score": 1,
            "text": "There is a wine educated guess. Pretty cool nerdy label\n\nhttps://www.wine.com/product/roots-run-deep-educated-guess-napa-cabernet-sauvignon-2019/817211?state=CA&s=GoogleBase_CSE_817211_PS106__type_Wine_RedWine_CabernetSauvignon&showpromo=true&promo=PS106&region_id=000027&utm_source=google&utm_medium=cpc&utm_term=&utm_campaign=Google_Shopping_Smart_Wine&gclid=EAIaIQobChMIq_mFyLTL9gIVQQPnCh2GnwyHEAQYAiABEgKeoPD_BwE&gclsrc=aw.ds#",
            "title_similarity": "0.48392078"
        },
        {
            "id": "i0xcsol",
            "score": 1,
            "text": "\"1, 2, 3, Infinity\" by Geofge Gamow. It starts with people who are subconscious lightning calculators and continues on..a fascinating read. Then take her to a puzzle store. There are many puzzles that are math based. Most cities have one, and Japan has one in every neighborhood. \"Eureka\" is our store in Boston. There are also puzzle conferences, \"IPP\" is vetted to puzzle nerds only. G4G, \"Gathering For Gardner\" is every other year, a celebration of the work done by Martin Gardner. You will meet mathematicians from all over the world. I became close friends with a couple of very famous maths there. http://www.puzzleparty.org/\nhttps://www.gathering4gardner.org",
            "title_similarity": "0.7666429"
        },
        {
            "id": "i0xcvin",
            "score": 1,
            "text": "A Pi shaped pie. Call it a Pi squared",
            "title_similarity": "0.26821595"
        },
        {
            "id": "i0xip77",
            "score": 1,
            "text": "I have a math clock on my wall and I love it. All the hour points have been replaced with formulas and symbols and such.",
            "title_similarity": "0.66578305"
        },
        {
            "id": "i0xivc4",
            "score": 3,
            "text": "A fountain pen and some ink! Mathematicians write a lot and a nice pen can make it fun.\n\nI'm a physicist and a [pilot metropolitan ](https://www.gouletpens.com/collections/best-selling-fountain-pens/products/pilot-metropolitan-fountain-pen-black-plain?variant=11884884426795)  was the best gift I've ever received.",
            "title_similarity": "0.725032"
        },
        {
            "id": "i0xjzp0",
            "score": 3,
            "text": "The best gift is something that someone doesn't realize they need. My mother refused to purchase a smart phone for years and walked around with her flip phone. I finally bought her a smart phone. Now she loves them.\n\nGet her something she doesn't want to pay for but would begrudgingly make her life easier. Avoid trying to replace anything she has an emotional bond with or would require significant adjustment. Look at reviews from some math program perhaps and find the best, easiest one to use and purchase her a subscription for a few months. If she tries it an loves, get the annual for her later on.",
            "title_similarity": "0.79135036"
        },
        {
            "id": "i0xl7ry",
            "score": 1,
            "text": "Get her a necklace chain of your choice and a pendant that says ℝ/ℤ on it",
            "title_similarity": "0.42993075"
        },
        {
            "id": "i0xn36u",
            "score": 1,
            "text": "Someone once bought me a set of non-transitive dice. Interesting mathematically.",
            "title_similarity": "0.5557665"
        },
        {
            "id": "i0xo1al",
            "score": 1,
            "text": "Is her area of interest algebra, analysis, number theory, geometry, or something else?",
            "title_similarity": "0.4740827"
        },
        {
            "id": "i0xqpkm",
            "score": 1,
            "text": "If you want a “thing” that is just decorative instead of a book I like the idea (as others have suggested) of a Clifford Stoll Klein bottle or maybe a Gömböc.\n\nI once got a stupid irrational number clock which is silly but I’ve grown fond of.",
            "title_similarity": "0.63266385"
        },
        {
            "id": "i0xrlp4",
            "score": 1,
            "text": "I have seen klein bottles mentioned as well as earrings, but not yet have I seen someone speak of [the klein bottle earrings...](https://www.kleinbottle.com/tiny_klein.html)",
            "title_similarity": "0.49269646"
        },
        {
            "id": "i0xteeg",
            "score": 1,
            "text": "Bake her a pi",
            "title_similarity": "0.39580578"
        },
        {
            "id": "i0xuzpr",
            "score": 1,
            "text": "Crest of the Peacock is a neat mix of casual reading + mathematical reading.",
            "title_similarity": "0.48363948"
        },
        {
            "id": "i0xvc2t",
            "score": 1,
            "text": "Buy her the wolfram app",
            "title_similarity": "0.4519225"
        },
        {
            "id": "i0xvv8i",
            "score": 2,
            "text": "Mathematical Impressions by Anatoly Fomenko\n\nIt's a picture book full of mathematical art. One of my favorite pieces.",
            "title_similarity": "0.6197616"
        },
        {
            "id": "i0xxi68",
            "score": 1,
            "text": "You could bake her a Pi.",
            "title_similarity": "0.40444273"
        },
        {
            "id": "i0xz058",
            "score": 1,
            "text": "Infinity notebooks pretty epic, drawing pad for a laptop",
            "title_similarity": "0.55800235"
        },
        {
            "id": "i0y06ak",
            "score": 1,
            "text": "I've always wanted these:\n\nhttps://mathsgear.co.uk/products/math-stack-playing-cards\n\nThere's lots of other fun little mathy things on that website too, so I'm sure there's something there for every lover of math.",
            "title_similarity": "0.70505846"
        },
        {
            "id": "i0y0g8v",
            "score": 1,
            "text": "Just ask her what book she wishes she had. Include flowers. BOOM. Happy girlfriend.",
            "title_similarity": "0.6133435"
        },
        {
            "id": "i0y11vb",
            "score": 19,
            "text": "Came for the LaTeX jokes. Leaving disappointed.",
            "title_similarity": "0.37525076"
        },
        {
            "id": "i0y2g0y",
            "score": 2,
            "text": "instead of cake, get her Pi?\n\n&#x200B;\n\n&#x200B;\n\nI'll show myself out.",
            "title_similarity": "0.5398365"
        },
        {
            "id": "i0y3eao",
            "score": 1,
            "text": "Whatever you get her I'm sure will be great. If it was me, along with a solid gift I would bake a pi (shaped) pie and likely bake a circular cake but decorate it as a pie chart where you could list some things you really love about her (30% looks, 50% personality, 15% communication, 5% *inside joke or something funny like \"the butt\"). It would probably mean a lot to her if you went the extra mile and did it all yourself and put some quality thought into the pie chart cake. \n\nExtra points if you practice a few times in advance to get decorations and taste down.",
            "title_similarity": "0.65779513"
        },
        {
            "id": "i0y4i8l",
            "score": 1,
            "text": "Theres a book called fermats last theorem that my dad bought me a while ago. Im not very far into it but it seems super interesting, and if shes as into cool maths stories as me she’ll love it",
            "title_similarity": "0.84101254"
        },
        {
            "id": "i0y545t",
            "score": 7,
            "text": "327 watermelons",
            "title_similarity": "0.13860916"
        },
        {
            "id": "i0y6e07",
            "score": 1,
            "text": "I still really want some math posters. \n\nI want one showing the graphs of different interesting functions, and then I want another with some important equations.\n\nMaybe some smaller ones of basic proofs that I actually know lol like FTC or Mean Value. \n\nBut I want them to look pretty enough to put in my house.",
            "title_similarity": "0.7126087"
        },
        {
            "id": "i0y6ft1",
            "score": 1,
            "text": "I had an ex-gf that was a math nerd as well, and I got her a necklace that had a Mobius strip ring on on the chain. She like it a lot, and it was pretty with or without the mathematical symbolism.",
            "title_similarity": "0.78307176"
        },
        {
            "id": "i0y6yyp",
            "score": 1,
            "text": "[Galton board](https://www.amazon.com/Four-Pines-Publishing-Galton-Board/dp/B078Y7RN6Y)",
            "title_similarity": "0.32504833"
        },
        {
            "id": "i0y7gl4",
            "score": 1,
            "text": "Don't call her math nerd. She is smart, a genius, I don't know. She loves mathematics, numbers, algebra. Love and intelligence have positive connotation. The word nerd has always a negative connotation. You can buy her a book. Ask her, which Springer book does she need?",
            "title_similarity": "0.8448888"
        },
        {
            "id": "i0y7kmi",
            "score": 2,
            "text": "A gold plated abacus. And a TI 82. She doesn’t need them but they will remind her that not everyone is a human calculator. Or maybe some word games to keep her thoughts limber.",
            "title_similarity": "0.6622715"
        },
        {
            "id": "i0y81de",
            "score": 1,
            "text": "It's a baby toy but I think the geometry would delight any mathematician: the [skwish](https://www.manhattantoy.com/collections/skwish) from the Manhattan Toy Company\n\nBathsheba Grossman and Hanusa Design both make math jewelry, though they're pretty pricy.",
            "title_similarity": "0.765992"
        },
        {
            "id": "i0y8bfh",
            "score": 1,
            "text": "I’ve seen a blanket with the digits of Pi printed on it on snd on.",
            "title_similarity": "0.308505"
        },
        {
            "id": "i0y8d86",
            "score": 1,
            "text": "Tickets to a production of the play Proof (good luck on the timing lol)",
            "title_similarity": "0.44939345"
        },
        {
            "id": "i0y9nn0",
            "score": 1,
            "text": "https://www.etsy.com/listing/1140090861/nautilus-gears-fidget-toy-adhd-toy?ref=var_v1_share",
            "title_similarity": "0.3574229"
        },
        {
            "id": "i0yao76",
            "score": 1,
            "text": "Workbook with solutions and breakdowns of a subject she likes but finds challenging",
            "title_similarity": "0.46480983"
        },
        {
            "id": "i0yays2",
            "score": 1,
            "text": "Get her a reservation at Hilbert's Hotel. 😜\nOr perhaps Douglas Hofstadter’s : Gödel, Escher, Bach",
            "title_similarity": "0.3638699"
        },
        {
            "id": "i0yd1m5",
            "score": 1,
            "text": "My sister knitted me a blanket with alternating colour stripes, that match the Fibonacci sequence.",
            "title_similarity": "0.49874577"
        },
        {
            "id": "i0yd9p7",
            "score": 1,
            "text": "My groomsman cake at my wedding was a short cylinder and the top was the unit circle. On the sides I had the sine and cosine graphed. That could be a birthday cake idea.",
            "title_similarity": "0.6002307"
        },
        {
            "id": "i0yi24q",
            "score": 1,
            "text": "Everybody needs [underwear](https://www.cafepress.com/+mobius-strip+underwear).",
            "title_similarity": "0.37442988"
        },
        {
            "id": "i0yik0h",
            "score": 1,
            "text": "A Klein Bottle?\n\nTo echo another commenter, a nice set of mechanical pencils or neat pens? I still have my Alvin drafting pencils from undergrad and love them. For pens, Retro 54 makes decent pens with cool designs.",
            "title_similarity": "0.6293392"
        },
        {
            "id": "i0yjh5f",
            "score": 1,
            "text": "Stemmerch.eu or whatever it's called comes to my mind. Im not sure how great a gift it would be, as I am quite terrible at giving gifts, but I love maths, and if I got something from there I would be super happy. Most of the stuff there is funny, at least to people who get the math puns.\nThere are lots of things that joke about engineers there, and many people (including myself) find that extremely hilarious",
            "title_similarity": "0.7459527"
        },
        {
            "id": "i0ykt4s",
            "score": 1,
            "text": "Give her a 69 😎",
            "title_similarity": "0.305286"
        },
        {
            "id": "i0yl1kb",
            "score": 1,
            "text": "Check MolecularMotifs on Etsy. They have some GORGEOUS golden ratio jewelry. My mom bought me a necklace years ago, and it still looks fabulous, clearly made from quality materials",
            "title_similarity": "0.63850904"
        },
        {
            "id": "i0yl8lt",
            "score": 1,
            "text": "There's a lot of good math glasswear like these bowls and cups\n\n&#x200B;\n\nbowls: [https://www.amazon.com/Proof-Pudding-Bowls-Four-Ceramic/dp/B01C9D0FQO](https://www.amazon.com/Proof-Pudding-Bowls-Four-Ceramic/dp/B01C9D0FQO)\n\n&#x200B;\n\nCups: https://www.uncommongoods.com/product/math-glasses-set-of-4",
            "title_similarity": "0.6063113"
        },
        {
            "id": "i0ylmvs",
            "score": 1,
            "text": "Give her a math calculation which turns into Morse then turns into binary then into Latin eventually revealing that the note says “I love you :)”",
            "title_similarity": "0.68110204"
        },
        {
            "id": "i0yn0cv",
            "score": 1,
            "text": "If she is into drinking tea or coffee, you could get mug her a mug with math equations and expressions on it.",
            "title_similarity": "0.63781655"
        },
        {
            "id": "i0yotka",
            "score": 2,
            "text": "My time to shine!\n\nGet her “Discrete Mathematics with Ducks”. All the questions and examples are duck related. Very cute college level textbook for math nerds.\n\nGot my girl this the summer we started dating and we’re engaged now.",
            "title_similarity": "0.78016627"
        },
        {
            "id": "i0yotqf",
            "score": 1,
            "text": "The XKCD books probably aren't a bad idea  \n\n\nhttps://www.amazon.com/dp/B09RWY83WG?searchxofy=true&binding=kindle\\_edition&ref\\_=dbs\\_s\\_aps\\_series\\_rwt\\_tkin&qid=1647480594&sr=8-2",
            "title_similarity": "0.5739771"
        },
        {
            "id": "i0yqsip",
            "score": 1,
            "text": "Make her a pi shaped pie instead of a cake?",
            "title_similarity": "0.47969577"
        },
        {
            "id": "i0yrzc3",
            "score": 1,
            "text": "This isn’t that great but I celebrated my birthday a day early one year and so I made the cake lady put “happy 23 364/365 birthday”",
            "title_similarity": "0.67723185"
        },
        {
            "id": "i0ys22e",
            "score": 1,
            "text": "You can likely find something fun here: https://mathsgear.co.uk\n\nThere's something for everyone",
            "title_similarity": "0.4941066"
        },
        {
            "id": "i0yts7v",
            "score": 1,
            "text": "Does she drink tea or coffee?  I have a mug with the Greek alphabet on it that is nice to use for reference when using Greek letters in equations.",
            "title_similarity": "0.52133524"
        },
        {
            "id": "i0yxh3g",
            "score": 1,
            "text": "Bake a squared pie for her and get her fancy fountain pens with good paper. And 13 roses.",
            "title_similarity": "0.5543277"
        },
        {
            "id": "i0yxxjy",
            "score": 1,
            "text": "I don’t know if someone said this, but the WFF ‘N Proof game. This game of mathematical logic has it all!  An underrated game with wonderfully complete logical notation.  Also, the booklet is important.  I haven’t found anywhere else that explains the cubes in quite as detailed a way as the full instruction booklet.",
            "title_similarity": "0.70777375"
        },
        {
            "id": "i0yyub4",
            "score": 1,
            "text": "A calibi-yau manifold etched in glass\n\nIt could possible represent what space looks like in the smallest scale to account for an 11-dimensional universe\n\nPlus, they're gorgeous:\nhttps://bathsheba.com/crystal/calabiyau/",
            "title_similarity": "0.45302054"
        },
        {
            "id": "i0z0us4",
            "score": 1,
            "text": "I'd buy her a copy of Goedel, Escher, Bach. It's a nerdy book quite lovely written.",
            "title_similarity": "0.6250286"
        },
        {
            "id": "i0z1qqq",
            "score": 1,
            "text": "I echo the hagoromo but also want to add to the book recommendations, Mathematics for Human Flourishing by Francis Su. I’m almost done with it. I’m in the beginning of my PhD, which has been brutally difficult, and parts of the book reminded me reasons I forgot of why I like doing this.",
            "title_similarity": "0.7480486"
        },
        {
            "id": "i0z3xvf",
            "score": 2,
            "text": "There are Vector Field Socks, Zeta Spiral T Shirt, Knot Theory Tie, Fourier Series Socks, and other promotional merch on 3b1b's youtube channel [store](https://www.youtube.com/c/3blue1brown/store).",
            "title_similarity": "0.390801"
        },
        {
            "id": "i0z46dk",
            "score": 1,
            "text": "69",
            "title_similarity": "0.044460826"
        },
        {
            "id": "i0z4889",
            "score": 1,
            "text": "A pi.",
            "title_similarity": "0.081216566"
        },
        {
            "id": "i0z6mua",
            "score": 1,
            "text": "Any many sided, really cool, obscure geometrical model. I once had a professor who made these as a hobby and had them all in his office. So cool.",
            "title_similarity": "0.65146685"
        },
        {
            "id": "i0z8lp4",
            "score": 1,
            "text": "As someone who’s college gf was getting her masters in math.. I bought her a Dr Pepper and candy before her student teaching. Hopped up on sugar we went to food carts and got high af. We biked around and made out. \nMath isn’t what your person wants for their birthday.  You can’t keep up with math brains, don’t try.",
            "title_similarity": "0.77505255"
        },
        {
            "id": "i0z9fuq",
            "score": 3,
            "text": "Clifford Stoll makes hand blown Klein bottles out of glass in various sizes. In particular, he makes the cutest little Klein bottle earrings! He is quite the character and excellent in almost any way you can imagine. Take a look at his website! (Just search his name in Google)",
            "title_similarity": "0.61007833"
        },
        {
            "id": "i0z9kca",
            "score": 2,
            "text": "[https://www.youtube.com/watch?v=VC7Z284HwD0](https://www.youtube.com/watch?v=VC7Z284HwD0)\n\n&#x200B;\n\nI say you should recite this poem, v beautiful in my humble opinion",
            "title_similarity": "0.4179151"
        },
        {
            "id": "i0zc29d",
            "score": 1,
            "text": "I like the Remarkable tablet. It's like paper, but you can organize, search, read and take notes over top of PDFs, and it has templates for dots, grids, etc.",
            "title_similarity": "0.51863444"
        },
        {
            "id": "i0zcno3",
            "score": 1,
            "text": "Pi",
            "title_similarity": "0.027767323"
        },
        {
            "id": "i0zdibn",
            "score": 1,
            "text": "Proof finisher stamps (QED) https://stemerch.com/products/custom-stamps?\\_pos=1&\\_sid=8e24d9aba&\\_ss=r",
            "title_similarity": "0.39547756"
        },
        {
            "id": "i0zgaqg",
            "score": 1,
            "text": "A suanpan abaccus or an analog mechanical calculator",
            "title_similarity": "0.19507635"
        },
        {
            "id": "i0zh7w7",
            "score": 1,
            "text": "There’s some really cool things on [here.](https://mathsgear.co.uk)",
            "title_similarity": "0.457195"
        },
        {
            "id": "i0zhyfp",
            "score": 3,
            "text": "I love the book “Flatland: a romance of many dimensions” \nYou can buy it super cheap (it’s also free on the Apple Books app, but that’s not much of a present I guess). \n\nIt’s a fun book. It’s mathy, but it’s also just a good read. And it’s pretty short, if she’s not into reading. \n\nI wouldn’t make it a main present. But maybe a bonus second present.",
            "title_similarity": "0.6636791"
        },
        {
            "id": "i0zkj9z",
            "score": 2,
            "text": "Some type of puzzle, I have a set of towers of Hanoi. You can actually find the minimum amount of steps by using binary! \nSet the card game is also super popular with math nerds\nSome good expo markers\nAbacus",
            "title_similarity": "0.6899886"
        },
        {
            "id": "i0zlulo",
            "score": 1,
            "text": "Get her birthday pie instead of Cake too",
            "title_similarity": "0.5850049"
        },
        {
            "id": "i0zmx0d",
            "score": 1,
            "text": "How about a Pi?",
            "title_similarity": "0.1341388"
        },
        {
            "id": "i0zmxh9",
            "score": 1,
            "text": "A tshirt with some math related xkcd images printed.",
            "title_similarity": "0.5064781"
        },
        {
            "id": "i0zo74d",
            "score": 2,
            "text": "Bake her some apple pi\n\nThen tell her she's the apple of your peye",
            "title_similarity": "0.51344466"
        },
        {
            "id": "i0zx8hj",
            "score": 1,
            "text": "ear rings with fibonacci symbolism :)",
            "title_similarity": "0.23617777"
        },
        {
            "id": "i0zxjvh",
            "score": 1,
            "text": "Pie instead of cake",
            "title_similarity": "0.2602971"
        },
        {
            "id": "i102xj1",
            "score": 1,
            "text": "Math girls by Hiroshi Yuki. Pretty cute books",
            "title_similarity": "0.67101866"
        },
        {
            "id": "i10cyz5",
            "score": 1,
            "text": "Klein Bottle! There’s a guy at UC Berkeley who sells them online. Super eccentric topologist. Cool guy, and cool math. It’s a surface with only 1 side and 0 edges!",
            "title_similarity": "0.5945982"
        },
        {
            "id": "i10f6ww",
            "score": 1,
            "text": "Numberphile has several math-related items for sale (mostly apparel and mugs): [https://numberphile.creator-spring.com](https://numberphile.creator-spring.com/)\n\nOne of the new British 50-pound notes with the portrait of Alan Turing on it might make a nice gift (probably more appropriate as a gift if you are \\*not\\* in Britain, otherwise it's just money).  I think it's very pretty, and there are few official tributes to mathematicians.",
            "title_similarity": "0.7610772"
        },
        {
            "id": "i117l3b",
            "score": 1,
            "text": "Hi, I'm in grade 9 math and i'm currently doing algebra, anyone was once confused when trying to separate the question into brackets when there letters like x, y and z match?",
            "title_similarity": "0.74855316"
        },
        {
            "id": "i127218",
            "score": 1,
            "text": "Get her a Galton Board.",
            "title_similarity": "0.23483413"
        },
        {
            "id": "i12gp65",
            "score": 2,
            "text": "You should ask her if there's any textbooks she really likes and get her a physical copy of it.",
            "title_similarity": "0.57802963"
        },
        {
            "id": "i17lbk8",
            "score": 1,
            "text": "You could get her a math themed mug, e.g.\n\n[https://www.cafepress.com/mf/19172157/berationalgetreal\\_mugs?productId=192717989](https://www.cafepress.com/mf/19172157/berationalgetreal_mugs?productId=192717989)\n\n[cafepress.com/mf/112514000/my-password-is-the-last-8-digi\\_mugs?productId=244991045](https://cafepress.com/mf/112514000/my-password-is-the-last-8-digi_mugs?productId=244991045)\n\n[https://www.cafepress.com/mf/93187235/its-complex\\_mugs?productId=1401800695](https://www.cafepress.com/mf/93187235/its-complex_mugs?productId=1401800695)\n\n[https://www.cafepress.com/mf/109087172/hippotenuse-large\\_mugs?productId=9087111](https://www.cafepress.com/mf/109087172/hippotenuse-large_mugs?productId=9087111)",
            "title_similarity": "0.68015534"
        },
        {
            "id": "i18zmwo",
            "score": 3,
            "text": "As someone who likes math, I would want to receive presents unrelated to math. I am always getting bad math gifts from relatives. **Get her a girlfriend gift, not a math student gift.**\n\nThe only potentially good suggestion here is fancy writing stuff. If you go with that, my suggestion would be a pilot metropolitan, some nice [ink](https://www.gouletpens.com/collections/bottled-ink) in her favorite color, and a rhodia notepad.\n\nFor real, some people really don't like kitchy math stuff, especially corny tshirts or horrible shit like [this](https://www.amazon.com/Decodyne-Math-Wall-Clock-Equation/dp/B01IABQ4FU). I wouldn't get a book, either. The chances are very low that you'll get her one that's good, related to the type of math she's interested in, and not something she already has. Even if you do, math books are dense and they're an obligation, she probably already has a pile of them she's mad at herself for not getting to yet.",
            "title_similarity": "0.80040246"
        },
        {
            "id": "i1x1chb",
            "score": 1,
            "text": "How about a graphical calculator, or graphical calculator apps on mobile?",
            "title_similarity": "0.28124595"
        }
    ]
}