{
    "EMS | Open letter from Russian mathematicians against the war in Ukraine\n": [
        {
            "id": "i0zncrl",
            "score": 3,
            "text": "In a country that controls its media I doubt that it will have any impact in Russia, especially since it is not signed.  And if it were signed, I bet some of them would go missing.",
            "title_similarity": "0.47977751"
        },
        {
            "id": "i111jv8",
            "score": 7,
            "text": "Support this but the second sentence has me paused:\n\n>The standard of living in a country and its position in the world are largely determined by the level of its science.\n\nAre we taking a massive liberty in concluding a causal direction here? \n\nedit: I might be being petty here if they are just using language loosely. Also maybe the translation is related.",
            "title_similarity": "0.41000462"
        },
        {
            "id": "i0zta79",
            "score": -17,
            "text": "That’ll help",
            "title_similarity": "-0.034953404"
        },
        {
            "id": "i107yv4",
            "score": 12,
            "text": "It's cool to see this \"push\" by russian intelectual circles and celebrities, it really helps to appreciate there's a difference between the government and the people. I remember at the beginning of the month there was another open letter by russian chess players https://www.chess.com/news/view/stop-the-war-44-top-russian-players-publish-open-letter-to-putin",
            "title_similarity": "0.70152664"
        },
        {
            "id": "i0zchwk",
            "score": 37,
            "text": "The page is removed. What does that tell you?",
            "title_similarity": "0.2668962"
        },
        {
            "id": "i12evo1",
            "score": 7,
            "text": "For people who cannot access it:\n\n> Mathematicians against war\n\n> President of the Russian Federation\n\n> V. V. Putin\n\n>bMr. President!  \n\n> We, mathematicians working in the Russian Federation, strongly protest against the military invasion of the territory of Ukraine launched by the Russian army on February 24, 2022.\n\n> The standard of living in a country and its position in the world are largely determined by the level of its science. Scientists around the world are working on problems that have no national and territorial restrictions, for the well-being of all mankind; international cooperation, lack of borders for the dissemination of knowledge and humanistic values are the foundation on which science is built. Our long-standing efforts to strengthen the reputation of Russia as a leading mathematical centre have been completely devalued in consequence of unprovoked military aggression initiated by our country.\n\n> Mathematics has always been one of the few areas of fundamental science in which Russia has maintained a leading world position. As confirmation of this, Russia was supposed to host the most prestigious mathematical conference in the world, the International Congress of Mathematicians, in the summer of 2022. The International Mathematical Union cancelled this decision in connection with the Russian attack on Ukraine. In a situation where our country has become a military aggressor and, as a result, a rogue state, Russia's leading positions in world mathematics will be irretrievably lost.\n\n> In the orders of the President of December 4, 2020, mathematics was named a priority area for the development of the Russian Federation; goals were identified both in the field of fundamental science and in education. These goals, of course, cannot be achieved in the current conditions, when the lives of our closest colleagues – scientists in Ukraine, with whom we have been connected by many years of successful joint work, are daily exposed to danger, the source of which is the Russian army, and when Russia has found itself in international isolation, without the possibility of intensive scientific exchange and cooperation with scientists from other countries.\n\n> We are convinced that no geopolitical interests can justify casualties and bloodshed. War will only make the country lose its future, for which we work.\n\n> We demand an immediate cessation of military actions and the withdrawal of Russian troops from the territory of Ukraine.",
            "title_similarity": "0.7876941"
        },
        {
            "id": "i1018lc",
            "score": 94,
            "text": "It is removed because a new law has been enacted in Russia that puts people who sign such petitions at a risk like 15 years in jail, so showing the names to the public is dangerous.",
            "title_similarity": "0.6284818"
        },
        {
            "id": "i11xqfs",
            "score": 1,
            "text": "just imagine if politicians were mathematicians :thinking\\_face:",
            "title_similarity": "0.37176794"
        }
    ]
}