{
    "Scientists discover bacteria that transforms waste from copper mining into pure copper, providing an inexpensive and environmentally friendly way to synthesize it and clean up pollution. It is the first reported to produce a single-atom metal, but researchers suspect many more await discovery.\n": [
        {
            "id": "gvobpz9",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.60294175",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gvosdy8",
            "score": 0,
            "text": "Wow this is huge. Copper is such a used material. You would be amazed the amount of copper that gets used in a school for plumbing/heating/ electrical.",
            "title_similarity": "0.5970769",
            "sentiment_compound": 0.8519
        },
        {
            "id": "gvpf4he",
            "score": -11,
            "text": "Oh great... another tech-bro non-solution to the consequences of capitalism.\n\nI'll just throw it on the pile with all the millions of others.",
            "title_similarity": "0.48547667",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvow21t",
            "score": -3,
            "text": "Thats not synthesizing. Its a natural process. Unless scientists designed the bacteria themselves",
            "title_similarity": "0.5982568",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvozvbl",
            "score": -1,
            "text": "Inexpensive is a bit of a stretch for a study that required multiple scientists to produce a tiny amount of pure copper.",
            "title_similarity": "0.6636083",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvou458",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "-0.03944024"
        },
        {
            "id": "gvovkgz",
            "score": 3,
            "text": "I think we need to start looking into microbes for solutions to a lot of problems that we have. The natural world has answers, we just have to listen and pay attention...which now that i type that out...probably wont happen...",
            "title_similarity": "0.60084665",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gvowt13",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "-0.03944024"
        },
        {
            "id": "gvomztj",
            "score": 10,
            "text": "It's only a matter of time before poop copper is on the market",
            "title_similarity": "0.44288477",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gvp3xa2",
            "score": -1,
            "text": "Meh, call me when they start turning garbage into pure gold.",
            "title_similarity": "0.4971761",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gvp4vdd",
            "score": 1,
            "text": "I feel like I see posts like this every other week. How many of these actually get put into action? I feel like this would be all over the internet if this actually was used during production/mining.",
            "title_similarity": "0.40795916",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gvp6lq5",
            "score": 1,
            "text": "What the ever loving fuck is this protozoan GOAT doing hiding beneath our noses? Ugh i fucking love science so hard.",
            "title_similarity": "0.5054536",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gvpctd6",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.03944024"
        },
        {
            "id": "gvp25f0",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.03944024"
        },
        {
            "id": "gvoodmt",
            "score": 130,
            "text": "[removed]",
            "title_similarity": "-0.03944024"
        },
        {
            "id": "gvobwfn",
            "score": 131,
            "text": "[deleted]",
            "title_similarity": "-0.011032669"
        },
        {
            "id": "gvoqsrh",
            "score": 19,
            "text": "I wonder if this could be adapted to test the water from circuit board etching processes. Seems highly beneficial.",
            "title_similarity": "0.6188313",
            "sentiment_compound": 0.4927
        },
        {
            "id": "gvod1rh",
            "score": 20,
            "text": "Don't nitrifying bacteria also \"take\" copper ions to do their work? I used to try and read all the articles about these bacteria, but it's been a while.",
            "title_similarity": "0.7236863",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvosna2",
            "score": 261,
            "text": "biology flair should perhaps be alchemy instead",
            "title_similarity": "0.4915627",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvoi0z5",
            "score": 481,
            "text": "maybe they have designed a system to prevent the copper from causing membrane damage.  \n\n‘Excess copper causes a decline in the membrane integrity of microbes, leading to leakage of specific essential cell nutrients, such as potassium and glutamate. This leads to desiccation and subsequent cell death.’ Wiki\n\nIt could be good if bacteria could do the same for other metals.",
            "title_similarity": "0.7358396",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvogl5m",
            "score": 932,
            "text": "[removed]",
            "title_similarity": "-0.03944024"
        },
        {
            "id": "gvp0a3k",
            "score": 2234,
            "text": "Copper-mining pollution is incredibly persistent. [Parys Mountain](https://en.wikipedia.org/wiki/Parys_Mountain) on the Welsh island of Anglesey is still basically a moonscape after large-scale copper extraction and refining that took place there over 200 years ago.",
            "title_similarity": "0.5770038",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvove9x",
            "score": 277,
            "text": "[removed]",
            "title_similarity": "-0.03944024"
        },
        {
            "id": "gvovh1v",
            "score": 36,
            "text": "[removed]",
            "title_similarity": "-0.03944024"
        },
        {
            "id": "gvow79x",
            "score": 1,
            "text": "This is some pretty swanky job automation",
            "title_similarity": "0.32666892",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvoxxri",
            "score": 3,
            "text": "I heard you like copper with your copper...",
            "title_similarity": "0.4809153",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvoy596",
            "score": 3,
            "text": "I want a genetically modified gut bacillus that makes little gold nuggets which I can plop out.",
            "title_similarity": "0.6324115",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gvoz3ns",
            "score": 237,
            "text": "Similar stuff: look up bacteria which eat up oil spills and radioactive waste, etc... there’s so many exciting developments and as an environmental microbiologist I love how this part of science is advancing",
            "title_similarity": "0.70696825",
            "sentiment_compound": 0.7076
        },
        {
            "id": "gvp1uhu",
            "score": 1,
            "text": "can you transcribe the gene to a chiken for example and make it lay golden eggs\n\nfor example",
            "title_similarity": "0.4404973",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvp2p4s",
            "score": 2,
            "text": "I think I remember being taught that it's hypothesized that some gold deposits were created by bacteria.",
            "title_similarity": "0.65926397",
            "sentiment_compound": 0.25
        },
        {
            "id": "gvp3kx2",
            "score": 17,
            "text": "[deleted]",
            "title_similarity": "-0.011032669"
        },
        {
            "id": "gvp3vez",
            "score": 1,
            "text": "Where can I order some to produce gold, my dear?",
            "title_similarity": "0.43041754",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gvp4dtu",
            "score": 2,
            "text": "the first to produce a single-atom metal? i thought there were [rock bacteria that precipitated gold around them to protect them from dangerous aqueous gold compounds/solutions](https://www.nature.com/news/gold-digging-bacterium-makes-precious-particles-1.12352)",
            "title_similarity": "0.7619612",
            "sentiment_compound": -0.128
        },
        {
            "id": "gvp4yee",
            "score": 1,
            "text": "I always wonder what happens to research like this about plastic eating/waste reducing bacteria. They seem to be the answer to many pollution problems yet they dont show up on commercial/city level agenda? Why?",
            "title_similarity": "0.6833888",
            "sentiment_compound": -0.1431
        },
        {
            "id": "gvp6122",
            "score": 1,
            "text": "Gold bars coming right up.",
            "title_similarity": "0.21660556",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvp65vw",
            "score": 2,
            "text": "Reminds me of a research hole I went down a few years ago where someone in India was selling a bacterial inoculant that would make your cow poop monoatomic gold. Turns out there were ancient stories about this kind of “alchemy”. I stored it in the “cool but impractical” drawer of my brain. But this study makes me wonder...",
            "title_similarity": "0.7086462",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvp6chd",
            "score": 1,
            "text": "I’m waiting for the gold version of that bacteria",
            "title_similarity": "0.54822505",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvp6o9w",
            "score": 1,
            "text": "Well, this is a pretty valuable discovery. Hopefully it'll help copper mining become a greener operation, and not just because copper makes a green patina when it oxidizes.",
            "title_similarity": "0.7608139",
            "sentiment_compound": 0.9153
        },
        {
            "id": "gvp6tc5",
            "score": 1,
            "text": "Leave it to Bacillus to do interesting stuff.  B. anthracis causes anthrax.  B. licheniformis can be used to process gold into nanocubes.",
            "title_similarity": "0.66164494",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvp7b91",
            "score": 1,
            "text": "It cleans AND produces copper. A big win.",
            "title_similarity": "0.591956",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gvp7f2l",
            "score": 2,
            "text": "I’ve seen copper /iron eating bacteria in nature. It’s pretty common in souther texas. There will be lil slime trails of iron oxide coming out of the ground from bacteria eating it",
            "title_similarity": "0.61123115",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvp7zvl",
            "score": 1,
            "text": "Bacteria that poop copper.\n\nAcid in stomachs eat stomachs.\n\nMetals that radiate energy.\n\nWhat a wacky universe.",
            "title_similarity": "0.53343457",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvp8785",
            "score": 1,
            "text": "It's all fun and games until the copper atom causes apoptosis.",
            "title_similarity": "0.6086392",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gvp88za",
            "score": 1,
            "text": "Careful about the turbo-flesh-eating-bacteria though.",
            "title_similarity": "0.49360594",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gvp99tj",
            "score": 6,
            "text": "They need to get out to Butte Montana, stay!",
            "title_similarity": "0.30864912",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvp9lcw",
            "score": 1,
            "text": "This is why biodiversity is worth saving kids",
            "title_similarity": "0.48577744",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gvpah1g",
            "score": 1,
            "text": "Let me know when they find one for silver and gold, preferably bacteria that dines on lead.",
            "title_similarity": "0.66481626",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvpazi0",
            "score": 1,
            "text": "Thanks, aliens! They’re always bailing us out.",
            "title_similarity": "0.30494547",
            "sentiment_compound": 0.4926
        },
        {
            "id": "gvpbd01",
            "score": 1,
            "text": "It’s like ‘wow Mother Nature finding a way to take care of our problems’\n\nAs were in the 6th mass extinction",
            "title_similarity": "0.46475875",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gvpbrzy",
            "score": 1,
            "text": "Well, if this can be extended to other metals, like Gold for instance, I really look forward to it. Right now, the process of mining gold is extremely resource-intensive and very polluting (From the top of my head, rock is mined then crushed, and some sort of acid is used to dissolve anything that's not gold into sludge, which can then be separated from the gold).\n\nIn addition, this could potentially be used to access all sorts of minerals that are currently in too small concentrations to see. Imagine pumping seawater from a place with little life (such as harbors) into a facility stocked with various bacteria designed to filter out a specific element, getting copper, gold, and perhaps all sorts of rare earth metals that exist in sea-water at ratios of 1 in a million or less. It would be slow, of course, but if done carefully would be so much less harmful to the environment than current methods of mining, and wouldn't really depend on location, as water mixes constantly (though some ocean currents might have higher concentrations than others).",
            "title_similarity": "0.66240686",
            "sentiment_compound": 0.3716
        },
        {
            "id": "gvpc24w",
            "score": 1,
            "text": "Whenever we talk about a bacteria that can do X, like eat nuclear material or oil, at what rate?",
            "title_similarity": "0.58064926",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvpd8wt",
            "score": 1,
            "text": "Great! If only they could find a quicker way to rebuild this warp drive.",
            "title_similarity": "0.5188739",
            "sentiment_compound": 0.6588
        },
        {
            "id": "gvpd9wx",
            "score": 1,
            "text": "Omg yes! *puts on Christian hat* Between these guys, the Chernobyl radiation eaters, and the things scientists are getting to turn plastic into water, we might actually meet the thousand year deadline!",
            "title_similarity": "0.6977519",
            "sentiment_compound": 0.508
        },
        {
            "id": "gvpdcx5",
            "score": 1,
            "text": "So we have \"unofficially\" found the philosophers stone and we are going to release it in small amounts saying it's \"a new form of bacteria\" I bet you an arm and a leg that there will be a \"bacteria\" that can do the same with gold. They wouldn't release it if there is because it would crush the value of gold.\n\n\n\n\n       This is all just me being stupid. Not sarcasm just me being stupid.",
            "title_similarity": "0.747067",
            "sentiment_compound": -0.6524
        },
        {
            "id": "gvpfz08",
            "score": 1,
            "text": "Cool article...can't wait to never hear about this being implemented in the future/ever again",
            "title_similarity": "0.34727886",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gvpg2ik",
            "score": 1,
            "text": "So the 5 year old in me reads this as...\n\nThese bacteria eats up waste from cooper mining and shits out pure copper?",
            "title_similarity": "0.59079206",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gvpgbb8",
            "score": 32,
            "text": "Well, the novelty of this find is not that it produces copper, rather that it makes single atom isolates of copper. Copper mining using bacteria is a well-known and commercially viable process called biomining (or biohydrometallurgy to be extra fancy), and accounts for 20% of yearly copper mining in Chile.",
            "title_similarity": "0.77978456",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gvph6ru",
            "score": 1,
            "text": "This could have big implications for copper-nickel mining in Northern Mn which has been an extremely contentious issue there for decades.\n\nI would need to see this process heavily vetted though before I would even consider supporting new mines in MN.",
            "title_similarity": "0.5637506",
            "sentiment_compound": 0.1045
        },
        {
            "id": "gvph75z",
            "score": 1,
            "text": "What’s the scientific name for the bacteria?",
            "title_similarity": "0.49535495",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvphldg",
            "score": 1,
            "text": "Good timing now we don't have to destroy the Native burial grounds in Arizona",
            "title_similarity": "0.52074087",
            "sentiment_compound": 0.6956
        },
        {
            "id": "gvpht17",
            "score": 1,
            "text": "The more I think about this and the more I analyze the possibilities, the more it makes my head hurt.  So are the bacteria just eating everything but the left over copper and then the copper is just left there all by itself or are they somehow synthesizing copper?",
            "title_similarity": "0.59945726",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvpi5dt",
            "score": 4,
            "text": "pure copper.... the highest quality copper ingots :D  buy buy buy :D  bthe bacteria should be named ea nasir bacteria for beautiful irony  :D",
            "title_similarity": "0.6909186",
            "sentiment_compound": 0.9501
        },
        {
            "id": "gvpj2rf",
            "score": 1,
            "text": "Where’s the golden pooper?!",
            "title_similarity": "0.1374642",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvpjjah",
            "score": 1,
            "text": ">When ingested by people, it can cause symptoms ranging from headaches and vomiting to liver and kidney failure and, when consumed in high enough concentrations, even death.\n\nWe are among the organisms that **need** copper. You can reportedly eat so much that the liver can't store it anymore and starts spilling it out in large amounts, but that is unlikely to happen by accident, as copper starts tasting disgusting at concentrations where that isn't even remotely a threat.",
            "title_similarity": "0.61637163",
            "sentiment_compound": -0.9581
        },
        {
            "id": "gvpkhmu",
            "score": 1,
            "text": "Next can we find the germ that poops gold? Thanks!",
            "title_similarity": "0.55543333",
            "sentiment_compound": 0.4926
        },
        {
            "id": "gvpklsd",
            "score": 1,
            "text": "So - what can we do with monoatomic copper?",
            "title_similarity": "0.4767449",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvpn3tn",
            "score": 1,
            "text": "What is \"single-atom\" metal?",
            "title_similarity": "0.27650422",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvpn5a2",
            "score": 1,
            "text": "Mining through microbes has been in the works for some time. Good to hear there is some progress!",
            "title_similarity": "0.560629",
            "sentiment_compound": 0.7177
        },
        {
            "id": "gvpnht3",
            "score": 1,
            "text": "Studying the tiniest beings can lead to the biggest discoveries.",
            "title_similarity": "0.39253148",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvpnji2",
            "score": 1,
            "text": "This sure is interesting but I'm uncertain with the biological impact of this bacteria in larger quantity.",
            "title_similarity": "0.57790965",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gvpo0rs",
            "score": 1,
            "text": "Just imagining bacteria eating waste and pooping out pure copper. As amazing as that sounds, I can't wait until they do the same with gold.",
            "title_similarity": "0.7301849",
            "sentiment_compound": 0.25
        },
        {
            "id": "gvpog3i",
            "score": 1,
            "text": "A discovery of witches, the name of it",
            "title_similarity": "0.2654813",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvpoigg",
            "score": 1,
            "text": "If this is actually feasible it’ll be like real life alchemy.",
            "title_similarity": "0.4093188",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvpolzt",
            "score": 1,
            "text": "Surely it just oxydises right away?",
            "title_similarity": "0.15041377",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvpp1jn",
            "score": 1,
            "text": "I keep seeing posts similar to this. The question now is when does this and similar innovations become mainstream?",
            "title_similarity": "0.2542272",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvpp5ff",
            "score": 1,
            "text": "I think bacteria mining/ refinement will be extremely valuable in the future, but this accomplishment is easily replicated with junk.  The researchers used copper sulfate solution, which is common in mine runoff.   Copper sulfate reacts with iron, to plate copper onto the iron.  The current method for recovering copper from this type of runoff is simply to stick scrap steel into the water, and pull it out once valuable copper reaches a significant level.    Bacteria may deal with lower concentration than iron can practically handle, and the article maentions monatomic copper, so there are some short term potential applications.",
            "title_similarity": "0.85669005",
            "sentiment_compound": 0.9021
        },
        {
            "id": "gvpp6lo",
            "score": 1,
            "text": "Is this a naturally occurring strain? I am curious about whether it will change the current models of how ores form.",
            "title_similarity": "0.44580236",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvppd2e",
            "score": 1,
            "text": "How is this news? This has been done in Chile for a while now",
            "title_similarity": "0.32964614",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvpqoy0",
            "score": 1,
            "text": "Hope the bacteria are copping well with their new job",
            "title_similarity": "0.603022",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvpr48t",
            "score": 1,
            "text": "So copper being made from copper waste therfore unlimited copper from now on",
            "title_similarity": "0.51091313",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvprgbj",
            "score": 1,
            "text": "Tweakers are gonna be pissed",
            "title_similarity": "0.20519403",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gvprmam",
            "score": 1,
            "text": "Also nearly all animal life is dependent on bacteria for survival as only bacteria and some archaea possess the genes and enzymes necessary to synthesize vitamin B12, also known as cobalamin, and provide it through the food chain.",
            "title_similarity": "0.6106396",
            "sentiment_compound": 0.296
        },
        {
            "id": "gvpro31",
            "score": 1,
            "text": "And it will still never be utilized because it might hurt corporate profits. Just like hundreds of other \"groundbreaking\" technologies that could be much better, cheaper, sustainable, etc., but threaten the status quo.",
            "title_similarity": "0.5782814",
            "sentiment_compound": -0.2382
        },
        {
            "id": "gvpt197",
            "score": 1,
            "text": "So alchemy... alchemy is now a real thing.\n\nSweet.",
            "title_similarity": "0.28945202",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gvptdpn",
            "score": 1,
            "text": "More copper per copper",
            "title_similarity": "0.30207175",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvptrix",
            "score": 1,
            "text": "Fun fact: 20% of copper production uses biomining. A process in which bacteria convert copper ores to a more processable state.",
            "title_similarity": "0.7189333",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gvpu0s8",
            "score": 1,
            "text": "Quick, buy up those cheap houses in north Butte right now!!",
            "title_similarity": "0.502449",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvpuidd",
            "score": 1,
            "text": "Very cool stuff but we're going to have a very complicated who owns what bacteria problem in terms of copyright laws unless whoever funded research decides to make it open source",
            "title_similarity": "0.6703207",
            "sentiment_compound": -0.4124
        },
        {
            "id": "gvpusej",
            "score": 1,
            "text": "That is revolutionary.",
            "title_similarity": "0.081201464",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvpvkqo",
            "score": 1,
            "text": "why are there so many bacteria that can do stuff like this?",
            "title_similarity": "0.43364692",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvpxkj1",
            "score": 1,
            "text": "As someone who specializes in this exact sort of stuff, I find this very neat but unfortunately the vast, vast majority of problematic minerals in copper mine waste are iron sulfides. Geomicrobiology is cool though and I'm glad to see it on the front page.",
            "title_similarity": "0.7336019",
            "sentiment_compound": -0.4495
        },
        {
            "id": "gvpxo3s",
            "score": 1,
            "text": "this is nice wonder if there are other bacterias that work with other metals in the same way?",
            "title_similarity": "0.6569142",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvpy3x4",
            "score": 1,
            "text": "Gold ? \nAlchemist Bacteria",
            "title_similarity": "0.49265492",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvpy4nb",
            "score": 1,
            "text": "Now we need to find a bacterium that eats lead and shits bullets",
            "title_similarity": "0.59023416",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvpz04p",
            "score": 1,
            "text": "Put them in the Berkeley Pitt.",
            "title_similarity": "0.18003654",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvpz5a2",
            "score": 1,
            "text": "The synthesis of elemental copper from copper solutions is quite a feat and is of great ecological and economical interest. I cannot and do not want to argue with that, but the cited original paper raises some suspicions.\n\n1.) The methods parts mentions a staining of the bacteria with osmiumtetroxide and uranylacetate. Both elements should show up in the EDS spectra as well. However the intensity at 1.91 keV (Os-M) is pretty low and consists of only background intensity.\n\n2.a) Both osmium and uranium are very heavy elements and should scatter the electron wave similar if not more than single copper atoms. How do the authors know they are looking at copper atoms and not osmium or uranium atoms/ions? The EDS is too noisy and the EELS show no traces of copper.\n\n2.b) They identify single atoms via their diameter in conventional TEM images? How? Why is the atom bright and not dark? Image formation in conventional TEM is very prone to user error. The user can change the size and contrast of the features just by slightly turning the focus knob. A better way to prove the single atom hypothesis, is to use HRSTEM as the intensity in HRSTEM images correlates roughly to the atomic number squared. Copper atoms should therefore light up strongly relative to the low atomic number background of other cell components.\n\n3.) There are no backscatter electron detectors in TEM. At least not to my knowledge. The images look like HAADF images anyhow, so my guess is that the authors have that mixed up. Maybe a translation error?\n\n4.) XPS is not a microscopy technique. They found elemental copper in drop casted samples. There is no evidence that the copper ions were reduced to elemental copper INSIDE the cells.\n\nMy summary of the paper:\nThey found bacteria which can survive high copper concentrations and found elemental copper after 48 hours. Which is neat. Oh yeah... and we used a new fancy electron microscope to try to explain the copper formation but we have little to no evidence for our hypothesis.",
            "title_similarity": "0.84400535",
            "sentiment_compound": 0.8532
        },
        {
            "id": "gvpz64e",
            "score": 1,
            "text": "Here we go, Butte America!",
            "title_similarity": "0.16665788",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvpzf8g",
            "score": 1,
            "text": "Does this happen fast enough to actually be viable for copper production?",
            "title_similarity": "0.6125964",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvq05vp",
            "score": 1,
            "text": "Does this mean that one day Butte Montana won’t have to live in fear of toxic water overflow?",
            "title_similarity": "0.5606724",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gvq17jd",
            "score": 1,
            "text": "You mean wire might become cheaper instead of skyrocketing at some point.",
            "title_similarity": "0.38941085",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvq1904",
            "score": 1,
            "text": "Element 115 bacterium here we come. I propose it be called Boblazaria.",
            "title_similarity": "0.49009055",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvq1ce9",
            "score": 1,
            "text": "All of out problems can be solved by nature. Much of what we have to day is thanks to nature. But if we cut, burn, and harvest those ecosystems we will be destroying all that potential invaluable resources.",
            "title_similarity": "0.61584526",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gvq1j5c",
            "score": 1,
            "text": "There was a paper that claimed the same for gold but nothing ever came from it. The mechanism for copper is more clear but I wouldn’t invest in a commercial application of this technology. It usually only works in rather narrow parameters and with low efficiency",
            "title_similarity": "0.6145575",
            "sentiment_compound": 0.664
        },
        {
            "id": "gvq1jen",
            "score": 1,
            "text": "This ends with the entire world being made of copper, doesn't it?",
            "title_similarity": "0.4628125",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvq1n2a",
            "score": 1,
            "text": "Is this how we get to post-scarcity world?",
            "title_similarity": "0.30334303",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvq304p",
            "score": 1,
            "text": "Full Metal Biochemist",
            "title_similarity": "0.43882936",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvq36hr",
            "score": 1,
            "text": "One step closer to Orson Scott Card’s sci fi insects that eat dirt and incorporate ore into their carapace.",
            "title_similarity": "0.46359167",
            "sentiment_compound": -0.34
        },
        {
            "id": "gvq4nue",
            "score": 1,
            "text": "Thank you for sharing this!",
            "title_similarity": "0.14260212",
            "sentiment_compound": 0.68
        },
        {
            "id": "gvq4v3u",
            "score": 1,
            "text": "This is but one example from a rich field of study.  Just Google bacterial extraction of metals from waste.  This kind of chemistry is currently being done on an industrial scale in various places.  And yes there are bacterium able to clean up radioactive waste; *Deinococcus radiodurans* which tolerates high intensity radiation.",
            "title_similarity": "0.80757594",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gvq554l",
            "score": 1,
            "text": "Doesn’t Geobacter sulfurreducens do the same thing though? They claim this is the first but I feel like similar bacteria have been researched for the last decade. Researchers also found that this geobacter grows well on copper.",
            "title_similarity": "0.7539237",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gvq6fy3",
            "score": 1,
            "text": "This superiority complex we have as hand is going to wipe us out.",
            "title_similarity": "0.3144642",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gvq6miz",
            "score": 1,
            "text": "Alchemy....  you say.... hhhmmm :::twirling mustache::::",
            "title_similarity": "0.23869525",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvq6rsx",
            "score": 1,
            "text": "Soooo alchemy is real now?",
            "title_similarity": "0.21107547",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvq772b",
            "score": 1,
            "text": "When are we gonna find(bio-engineer) the Gold Au bacteria....",
            "title_similarity": "0.6812823",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvq7rl0",
            "score": 1,
            "text": "Well alright crank these little guys out let’s start a farm.",
            "title_similarity": "0.33031887",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gvq7ywm",
            "score": 1,
            "text": "now let's teach them to lay out circuits",
            "title_similarity": "0.24767326",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvq7zh9",
            "score": 1,
            "text": "Honestly, doesn't even surprise me. Earth started as a rocky, mineral wasteland, makes sense something would have evolved to be able to derive energy from that somehow.",
            "title_similarity": "0.64580727",
            "sentiment_compound": 0.5083
        },
        {
            "id": "gvq8g1k",
            "score": 1,
            "text": "Amazing. It’s true what they say. The glass is always half full. We got brains we should be capable of fighting climate change",
            "title_similarity": "0.6162539",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gvq8jma",
            "score": 1,
            "text": "Saw ‘single atom metal’ and my first thought was that would make great thermite.",
            "title_similarity": "0.5604187",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvq8l08",
            "score": 1,
            "text": "I’m getting SERIOUS Formic vibes from this... the future is getting more and more like the Enderverse, and i’m all for it.",
            "title_similarity": "0.24824327",
            "sentiment_compound": 0.2555
        },
        {
            "id": "gvq8y06",
            "score": 1,
            "text": "Ok ok ok, im a little more hopeful. I like I like.",
            "title_similarity": "0.18532151",
            "sentiment_compound": 0.8996
        },
        {
            "id": "gvq91j9",
            "score": 1,
            "text": "When are scientists going to realize that bacteria is our worlds version of rpg / manga Slime?",
            "title_similarity": "0.6307074",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvq9a7a",
            "score": 1,
            "text": "Guys new copper bacteria dropped",
            "title_similarity": "0.5924747",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqa71h",
            "score": 1,
            "text": "So basically natural alchemy!",
            "title_similarity": "0.3322152",
            "sentiment_compound": 0.4714
        },
        {
            "id": "gvqavui",
            "score": 1,
            "text": "Need this in subnautica (no one will get this joke)",
            "title_similarity": "0.37373477",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvqb8aj",
            "score": 1,
            "text": "If only we could do this with nuclear power",
            "title_similarity": "0.4651663",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqd1vp",
            "score": 1,
            "text": "Seems like bacteria can do anything at this point.",
            "title_similarity": "0.35024565",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvqd7tz",
            "score": 1,
            "text": "I have wondered for a while if that's how we are eventually going to terraform Mars. Either by introducing some bacteria that we have found, or genetically engineering some.",
            "title_similarity": "0.5625677",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqetaa",
            "score": 1,
            "text": "So in the future crackheads won't be ripping it out of walls.",
            "title_similarity": "0.3026768",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqfw6v",
            "score": 1,
            "text": "Mother Nature fixing herself",
            "title_similarity": "0.29384592",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqhy8n",
            "score": 1,
            "text": "Copper slurry into copper.",
            "title_similarity": "0.36953264",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqioh3",
            "score": 1,
            "text": "Do such discoveries actually make into real life application?",
            "title_similarity": "0.2737292",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqktth",
            "score": 1,
            "text": "Just in time for copper to reach all time highs",
            "title_similarity": "0.32381088",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gvqm5sr",
            "score": 1,
            "text": "It can revolutionize the solutions for environmental pollution!",
            "title_similarity": "0.5934392",
            "sentiment_compound": 0.2481
        },
        {
            "id": "gvqmg7z",
            "score": 1,
            "text": "Does this mean that we’ll get to keep making pennies?",
            "title_similarity": "0.30783835",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqmmn4",
            "score": 1,
            "text": "If they could make these little critters extract aluminum it would be huge. Getting aluminum from ore (bauxite) is a miserable pain in the ass.",
            "title_similarity": "0.58058995",
            "sentiment_compound": -0.8271
        },
        {
            "id": "gvqmn3p",
            "score": 1,
            "text": "Nice, that’s what we like to cheaper and effective solutions for pollution",
            "title_similarity": "0.5509886",
            "sentiment_compound": 0.8442
        },
        {
            "id": "gvqng8w",
            "score": 1,
            "text": "This is probably huge for Arizona",
            "title_similarity": "0.22691183",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gvqniyu",
            "score": 1,
            "text": "Read website domain name as alchemictimes.\n\nAll is one, and one is all.",
            "title_similarity": "0.29970878",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqo14m",
            "score": 1,
            "text": "I always wondered if this is how some deposits of metals were created.",
            "title_similarity": "0.48927298",
            "sentiment_compound": 0.25
        },
        {
            "id": "gvqo6bu",
            "score": 1,
            "text": "When are they going to deploy it on horseshoe crab blood?",
            "title_similarity": "0.42732456",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqo6z3",
            "score": 1,
            "text": "What company do these scientists work for?",
            "title_similarity": "0.47446942",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqpmlm",
            "score": 1,
            "text": "Bacteria are awesome!! In all senses of the word. Really great! Awe inspiring and terrifying  all at the same time.",
            "title_similarity": "0.46068797",
            "sentiment_compound": 0.8668
        },
        {
            "id": "gvqpssc",
            "score": 1,
            "text": "She was my professor at UH for one of my undergrad classes. So proud of her!!",
            "title_similarity": "0.42546362",
            "sentiment_compound": 0.6783
        },
        {
            "id": "gvqptag",
            "score": 1,
            "text": "I've been teaching about bioleaching in my GCSE science lessons for at least 10 years, I'm sure. Not a new technology, surely?!",
            "title_similarity": "0.5876707",
            "sentiment_compound": 0.6696
        },
        {
            "id": "gvqqihf",
            "score": 1,
            "text": "This is a great example of why we should learn to harness nature rather than invest in half baked solutions that challenge our own species' survival",
            "title_similarity": "0.5213785",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gvqqoa4",
            "score": 1,
            "text": "Will this help the Berkeley Pit?!",
            "title_similarity": "0.36430955",
            "sentiment_compound": 0.4574
        },
        {
            "id": "gvqrs6t",
            "score": 1,
            "text": "I love copper. It’s so beautiful in every stage.",
            "title_similarity": "0.39981437",
            "sentiment_compound": 0.8804
        },
        {
            "id": "gvqu0t4",
            "score": 1,
            "text": "Didn’t Hideo Kojima predict something like that?",
            "title_similarity": "0.21424183",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvqu8bo",
            "score": 1,
            "text": "So if biology can do this, why cant we synthesize this with nanobots",
            "title_similarity": "0.58584344",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqvjbd",
            "score": 1,
            "text": "In a certain way, I think that science we’ll lead the future of residuals to be solved by other biological elements, specially, but not only, bacteria and fungos as I really trust this is a part if the solution. Probably, other scientists who have more expertise will maybe do objections and I’m hoping that I can learn more about this topic, but normally and following the Gaia theory biology tends in solving it’s own problems, not alone and with the effort of humans and the progresses that we need to do, and that’s why I think that this new bacteria are being discovered, because the same pollutions is creating new bacteria to destroy it.",
            "title_similarity": "0.69654214",
            "sentiment_compound": 0.9072
        },
        {
            "id": "gvqxro6",
            "score": 1,
            "text": "there is an organism that poops out copper?",
            "title_similarity": "0.4943574",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvqyhys",
            "score": 1,
            "text": "Be really good for them to mass produce this bacteria for the Pebble Mine project",
            "title_similarity": "0.73013735",
            "sentiment_compound": 0.4927
        },
        {
            "id": "gvqz37u",
            "score": 1,
            "text": "This sounds cool so I look forward to never hearing about this ever again.",
            "title_similarity": "0.36115235",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gvqzget",
            "score": 1,
            "text": "Thiobacilus ferroxidans and them there yellowboy brothers would like a wee word in the shell like....",
            "title_similarity": "0.4224613",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvr10ho",
            "score": 1,
            "text": "It is not the copper that is the problem with copper mining. It is the arsenic and heavy metals in the tailings as well as the sulfuric acid used in the processing that are highly problematic.",
            "title_similarity": "0.64611095",
            "sentiment_compound": -0.5849
        },
        {
            "id": "gvr1k3d",
            "score": 1,
            "text": "Send some to Butte Montana ASAP, one the size of a shopping mall please.",
            "title_similarity": "0.32423326",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gvr3io2",
            "score": 2,
            "text": "I wonder if it would be more effective to search for similar microbes or to analyze this one's genome and tweak it to reclaim other metals/clean up pollution.",
            "title_similarity": "0.72202766",
            "sentiment_compound": 0.5256
        },
        {
            "id": "gvr6tit",
            "score": 1,
            "text": "where can i buy? I want bacteria to clean my apartment",
            "title_similarity": "0.5176795",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gvr85uk",
            "score": 1,
            "text": "This is pretty incredible! It is essentially what alchemy was chasing before chemistry and general science was around",
            "title_similarity": "0.5983824",
            "sentiment_compound": 0.5411
        },
        {
            "id": "gvra5a0",
            "score": 3,
            "text": "Had anything like this ever actually gone anywhere? I’ve seen countless things like this and cancer cures on here but we got plenty of that and plenty of garbage",
            "title_similarity": "0.47071695",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gvrc6cc",
            "score": 1,
            "text": "A friend of mine already does this for gold and silver. Haven’t spoken to him for a while, but wouldn’t be surprised if he’s adding copper to his repertoire",
            "title_similarity": "0.6051147",
            "sentiment_compound": 0.5346
        },
        {
            "id": "gvrfg0i",
            "score": 1,
            "text": "You can't make something from nothing, but one mans trash is another man's treasure.",
            "title_similarity": "0.39843413",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvrfrnn",
            "score": 1,
            "text": "This was my dad's job when I was a kid. We lived in an old mining town and he would be sent to other countries like China and Chile to visit their plant and help keep their bacteria alive.",
            "title_similarity": "0.6306744",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gvrhsib",
            "score": 1,
            "text": "FYI this isn’t exactly new, it’s been know that these sulfur reducing organisms can be used in bio mining, and it’s already being done!",
            "title_similarity": "0.7322594",
            "sentiment_compound": 0.4263
        },
        {
            "id": "gvrjt0n",
            "score": 1,
            "text": "I live in the biggest copper mine superfund site in the world. I would like to know, as we have a pit of toxic water, from copper waste, and it would be great to take my fear of deadly cancers off my worry list. (Not kidding). When is this going to be practically applicated?",
            "title_similarity": "0.70407724",
            "sentiment_compound": -0.381
        },
        {
            "id": "gvrkpqu",
            "score": 1,
            "text": "Is it possible to genetically modify these bacterium to instead transform waste from other types of mining? I imagine it would have to be for elements that have very similar properties to copper.",
            "title_similarity": "0.8044944",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvrmvla",
            "score": 1,
            "text": "BRB,  have to go buy the Berkley pit real quick.",
            "title_similarity": "0.35647306",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvrp5bz",
            "score": 1,
            "text": "Bacteria are man's best friend!",
            "title_similarity": "0.5108002",
            "sentiment_compound": 0.8268
        },
        {
            "id": "gvrpx5w",
            "score": 1,
            "text": "Next stop! Berkeley Pit!",
            "title_similarity": "0.2198073",
            "sentiment_compound": -0.4184
        },
        {
            "id": "gvrtw3x",
            "score": 1,
            "text": "There is always a catch-22 in situations like this. Next thing you know this bacteria devours other things that we actually need.",
            "title_similarity": "0.45488012",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvrvui3",
            "score": 1,
            "text": "What company is working on this",
            "title_similarity": "0.19015172",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvrvw91",
            "score": 1,
            "text": "Don’t worry. Republicans will find a way to bury this thing before it benefits humanity.",
            "title_similarity": "0.519608",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gvryhtb",
            "score": 1,
            "text": "So your telling me if they evolve enough they’ll be able to eat a burrito and poop a diamond encrusted turd?",
            "title_similarity": "0.44293094",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvrziqo",
            "score": 1,
            "text": "Insert alchemy joke here.",
            "title_similarity": "0.2510373",
            "sentiment_compound": 0.296
        },
        {
            "id": "gvs3815",
            "score": 1,
            "text": "Expect the rights of this to get bought up by copper producers.  Great for the environment, but the price of copper will suffer if even the waste can inexpensively be turned into copper.",
            "title_similarity": "0.749504",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gvs5tg6",
            "score": 1,
            "text": "They looked at this and said \"yes, we can make money off of this thus it is worth researching\"  \n\n\nYay!",
            "title_similarity": "0.46479663",
            "sentiment_compound": 0.807
        },
        {
            "id": "gvsd7j2",
            "score": 1,
            "text": "Butte Montana needs this",
            "title_similarity": "0.22977373",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvss6ir",
            "score": 1,
            "text": "ELI5 - How do you \"discover\" bacteria?",
            "title_similarity": "0.4901675",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvt56nn",
            "score": 1,
            "text": "Is that the copper waste coming out from the other end?!",
            "title_similarity": "0.46579987",
            "sentiment_compound": -0.4753
        },
        {
            "id": "gvttbbs",
            "score": 1,
            "text": "Please clean up the berkely pit in butte MT",
            "title_similarity": "0.4834494",
            "sentiment_compound": 0.6124
        }
    ]
}