{
    "Rising income inequality is not an inevitable outcome of technological progress, but rather the result of policy decisions to weaken unions and dismantle social safety nets, suggests a new study of 14 high-income countries, including Australia, France, Germany, Japan, UK and the US.\n": [
        {
            "id": "gvtasi0",
            "score": 5,
            "text": "All you fools. The EPI has been hollering this for years. \n\nIt has already been proven that union membership rates scale exactly 100% perfectly with the amount of income going to the top 10%   \n\n [https://files.epi.org/pdf/138705.pdf](https://files.epi.org/pdf/138705.pdf)",
            "title_similarity": "0.4044814",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvta1jh",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "0.16597238"
        },
        {
            "id": "gvtbmzl",
            "score": 34,
            "text": "Why the obsession with wealth inequality when standards of living continue to rise globally?",
            "title_similarity": "0.63004",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gvtbn4s",
            "score": 44,
            "text": "Unions are to blame, also (US).  Speaking out of both sides of their mouths or pockets. A couple of examples:\n\n1 - Their administrative arm made a very cozy and lucrative bed next to politicians and executives.  In short, they sold out.  \n\n2 - They dig their heels into onerous anti-technology clauses that made it impossible to work with them while reducing continuing training for their own members.  They gutted their ranks instead of doing the hard work of evolving the workforce for success into the future.\n\n3 - They adopted a pro-illegal immigration stances due to their politics.  This created an incredible downward force on wages.\n\nIn short, they are part of their own problems.  There are many other reasons.",
            "title_similarity": "0.6823068",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gvtdthr",
            "score": 18,
            "text": "My parents were born in poverty prior to the \"War on Poverty.\" In their day, being poor meant being cold, hungry and ragged, and they did everything they could to get out of it, and succeeded. \n\nPoverty is a lot more comfortable nowadays, so the impetus to escape it isn't as strong.",
            "title_similarity": "0.5991782",
            "sentiment_compound": -0.9102
        },
        {
            "id": "gvtcxiy",
            "score": 1,
            "text": "Creating a persistent class of people dependent on government will alleviate class inequality...",
            "title_similarity": "0.64938724",
            "sentiment_compound": 0.296
        },
        {
            "id": "gvtc6w5",
            "score": 0,
            "text": "The sooner our species starts to recognise that the root of economics is politics and that it's more like Catholicism than engineering the better off we'll all be.",
            "title_similarity": "0.6871733",
            "sentiment_compound": 0.6901
        },
        {
            "id": "gvtb5x6",
            "score": 0,
            "text": "So much to control for so little time. Wild claim about something you couldn't possibly control for but hey ho.",
            "title_similarity": "0.48535872",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvt8p23",
            "score": -13,
            "text": "Technology enables globalization that in effect removes bargain power from the workers in west. To say that it is not inevitable is quite a weak claim.",
            "title_similarity": "0.72799706",
            "sentiment_compound": -0.3353
        },
        {
            "id": "gvtat1n",
            "score": -2,
            "text": "Yeah, so join the IWW.",
            "title_similarity": "0.14255832",
            "sentiment_compound": 0.5709
        },
        {
            "id": "gvtaygs",
            "score": 16,
            "text": "It’s complete BS and a serious issue but it is not a conspiracy. It is a pursuit of profit by leveraging those with little power in less skill positions to reduce what is typically the highest cost in a business.",
            "title_similarity": "0.62956715",
            "sentiment_compound": 0.8108
        },
        {
            "id": "gvtk5pp",
            "score": -4,
            "text": "And neither is it a bad thing, necessarily. \n\nIt's a natural consequence of people differing in capacity, knowledge, decision making, strive and a load of different factors. \n\nThe important measure of progress is whether living standards increase across all levels of society, not income inequality. Countries who strive for equity gain neither equity or prosperity, but countries who strive for free market enterprise increase prosperity across the board.",
            "title_similarity": "0.6581771",
            "sentiment_compound": 0.9011
        },
        {
            "id": "gvtajv8",
            "score": 16,
            "text": "Yeah its for sure not monetary policies creating inflation driving asset and commodity prices up and pricing normal people out of everything and anything.",
            "title_similarity": "0.6365489",
            "sentiment_compound": 0.6264
        },
        {
            "id": "gvtf48m",
            "score": 141,
            "text": "[deleted]",
            "title_similarity": "0.17311929"
        },
        {
            "id": "gvtbln2",
            "score": 0,
            "text": "Well and to line the corporations pockets with as much of a profit margin as possible, at their workers expense of course.",
            "title_similarity": "0.5505056",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvtig4d",
            "score": 2,
            "text": "What? Capitalism that rewards greedy sociopaths is bad for society? No way",
            "title_similarity": "0.6865722",
            "sentiment_compound": -0.644
        },
        {
            "id": "gvtb4ce",
            "score": 129,
            "text": "The study doesn't mention social safety nets. Also, it finds that only 23% of the decline in labour's share of income is due to decline in unionization. Way to have a title that pushes your agenda even if the science doesn't support it.\n\nMuch more important factor seems to be relocation of jobs to poorer countries. Looks like globalization is actually reducing inequality by raising the living standards of the global poor.",
            "title_similarity": "0.7907239",
            "sentiment_compound": -0.5263
        },
        {
            "id": "gvt4n0x",
            "score": 66,
            "text": "[deleted]",
            "title_similarity": "0.17311929"
        },
        {
            "id": "gvtgrta",
            "score": 6,
            "text": "Huh, the socialists were right again.  Who knew?",
            "title_similarity": "0.3167386",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtelw5",
            "score": 8,
            "text": "So my question is, if we're gonna have an open discussion about income inequality, are we then gonna have separate discussions such as;\n\n1. Skilled vs unskilled labor\n\n& \n\n2. Non-biased analysis as to why the people with low income have said low income?",
            "title_similarity": "0.7124939",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gvtbr61",
            "score": 24,
            "text": "Rising income inequality has also been the natural tendency of humanity. Historically, even back to the middle-ages there has been significant income inequality; only recently (ie. 1900s) was there a significant decrease in income inequality. We have been living in largely the exception, rather than the rule.",
            "title_similarity": "0.68983674",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvt9t2d",
            "score": 13,
            "text": "What social programs have been dismantled/defunded in these countries, anyone know?",
            "title_similarity": "0.6565081",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtd0p4",
            "score": -1,
            "text": "more than 45% of working americans that pay taxes last year alone circulated 43 trillion. then you learn that a little more than 10% of americans who earned 70 trillion did not put back into revenue. and then the 1% who also earned just around 100 trillion and did not put back into revenue. 170 trillion of wealth never being taxed. what’s national debt again? oh i know. to remind us we are still elite trash.",
            "title_similarity": "0.5936577",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gvtc8bq",
            "score": 49,
            "text": "It's almost like the supply and demand curve of a janitor doesn't change just because a company does better than it did last year.",
            "title_similarity": "0.48487845",
            "sentiment_compound": 0.5584
        },
        {
            "id": "gvtru0l",
            "score": 0,
            "text": "Daily complaint of r/science for having everything besides science",
            "title_similarity": "0.46203232",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvtfyjr",
            "score": 12,
            "text": "The Social - Economic review isn't a real journal. Try again",
            "title_similarity": "0.6890334",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtjugj",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.16597238"
        },
        {
            "id": "gvt7vyg",
            "score": -37,
            "text": "[removed]",
            "title_similarity": "0.16597238"
        },
        {
            "id": "gvt9egi",
            "score": -6,
            "text": "\"Where the conditions to which material progress everywhere tends are most fully realized—that is to say, where population is densest, wealth greatest, and the machinery of production and exchange most highly developed—we find the deepest poverty, the sharpest struggle for existence, and the most of enforced idleness.\"\n\nFor the solution, join us in r/Georgism",
            "title_similarity": "0.4668709",
            "sentiment_compound": 0.8442
        },
        {
            "id": "gvtghvh",
            "score": -3,
            "text": "We need a new economic system.\n\nThis has been clear to some people for over a hundred years, though many implementations of alternatives have been futile or ripe for authoritarians to take over.\n\nWe need to revolutionize money itself to stop incentivizing the worst in people.",
            "title_similarity": "0.72439784",
            "sentiment_compound": -0.765
        },
        {
            "id": "gvtho6v",
            "score": 3,
            "text": "Yes, IF the unions aren't self serving and corrupt.",
            "title_similarity": "0.55397666",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gvtblf6",
            "score": 2,
            "text": "I have a feeling that people, including politicians dont have a clue how to make this work.",
            "title_similarity": "0.57030016",
            "sentiment_compound": 0.128
        },
        {
            "id": "gvtk32j",
            "score": 1,
            "text": "But also a result of stagnant wages and the 1% hoarding",
            "title_similarity": "0.5605701",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtkzul",
            "score": 1,
            "text": "Any marxist economist could've told you that for over a hundreds years.",
            "title_similarity": "0.3779754",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtl1oi",
            "score": 1,
            "text": "People need to re-empower the unions and tax the rich more.",
            "title_similarity": "0.64711565",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gvtj2w7",
            "score": 238,
            "text": "[removed]",
            "title_similarity": "0.16597238"
        },
        {
            "id": "gvtgr9f",
            "score": 0,
            "text": "Also has a lot to do with lifestyle choices and education decisions. So many people go to college and rack up $50k+ in debt. Many have double that. The result are monthly loan payments equivalent to a mortgage. We also have more tangible things than previous generations: more cars with average cost of $25k not to mention insurance and gas, we travel more than people did in the 40s -70s, we have $800 phones which we replace every 2-3 years and pay $75 month for service. We have cable tv and streaming services which are fairly expensive. We eat out or buy prepared meals which is more costly than buying raw ingredients and putting a meal together from scratch. So many of us buy $2 or $3 coffees daily- something unheard up 30 years ago.",
            "title_similarity": "0.4466274",
            "sentiment_compound": -0.4005
        },
        {
            "id": "gvtgxf0",
            "score": 0,
            "text": "I think it's funny that people complain about inequality when if you take everything in the world and give a portion to each human being and get rid of the State, inequality will get back in no time. With people making bad decisions about what to do with their part of the world.",
            "title_similarity": "0.7206787",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gvtqhxn",
            "score": 0,
            "text": "I wouldnt trust any article written by a buzzfeed writer",
            "title_similarity": "0.5680654",
            "sentiment_compound": -0.4023
        },
        {
            "id": "gvu8zo0",
            "score": 0,
            "text": "You could fight back and buy GME.",
            "title_similarity": "0.4911471",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gvv11qx",
            "score": 0,
            "text": "The comments section is filled with capitalist bootlickers",
            "title_similarity": "0.38924405",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvv5ces",
            "score": 0,
            "text": "Income inequality isn't inherently bad. If the vast majority of people's lives improve while a handful of people's lives improve a shitton more, who cares? That just sounds petty to me.",
            "title_similarity": "0.65088665",
            "sentiment_compound": 0.8787
        },
        {
            "id": "gvtb338",
            "score": 222,
            "text": "[removed]",
            "title_similarity": "0.16597238"
        },
        {
            "id": "gvtuors",
            "score": 2,
            "text": "Weird, it’s like the exact thing that political theorists have been saying for nearly 40 years is true. Neoliberal capitalist policies have grown a vast wealth disparity.",
            "title_similarity": "0.5153407",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gvtkib7",
            "score": 4,
            "text": "It’s pretty clear the low skill labor supply is outstripping demand. That’s kind of the end of it.",
            "title_similarity": "0.45574206",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvttee0",
            "score": 18,
            "text": "Wealth disparity is the inevitable outcome of an unregulated capitalist system.",
            "title_similarity": "0.60604405",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvth1y8",
            "score": 5,
            "text": "The world seemed to function ok when your boss made 10-20 times what you made and now in some cases it's well over 1000x. I think it's hit a point where that needs to stop.",
            "title_similarity": "0.45201892",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvtihu8",
            "score": -5,
            "text": "I love how \"individual decisions\" are NEVER a part of the income inequality debate..\n\nDuring the summer, My son started mowing local neighborhood lawns when he was 11yo..  He's now 15 and has $10k saved..  His friends however, sat on thier asses and played video games all summer each year..  \n\nAccording to the income inequality folks, it's not fair that my son has $10k and other kids dont..They completely overlook the fact that my son worked his tail off and the other kids were lazy and didn't work at all...  \n\nPlus the fact that there is nothing stopping my son's peers from doing the same thing..  (No one is holding a gun to thier head and demanding they play video games all summer)\n\nIncome inequality boils down to personal decisions every time..",
            "title_similarity": "0.46078154",
            "sentiment_compound": 0.8216
        },
        {
            "id": "gvt4k0e",
            "score": 8,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.56600374",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gvt9kow",
            "score": -31,
            "text": "14 high-income countries?  Why don't you look at their stock markets over the last two decades.    This is a trash article.",
            "title_similarity": "0.7201695",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtcfa0",
            "score": -2,
            "text": "You could however argue that it's an inevitable outome of corporate technological progress driven by the stock market\n\nAnd since that's the actual reality you could absolutely argue it's inevitable",
            "title_similarity": "0.6238669",
            "sentiment_compound": -0.3167
        },
        {
            "id": "gvtf88m",
            "score": 4,
            "text": "The people are getting taken advantage of because the bureaucracy system and political system is highly esoteric. They can slither around with their words and put the general population at a lull. Too busy staring at the physicality of the members and not enough on what’s being written and what’s being really done and the reprecutions and the outcome. The level of pacifism and misinformation makes it such that it’s like how scammers take advantage of the elderly or how anyone can take candy from a baby.  \n\nIt’s time to actually get mad, together.",
            "title_similarity": "0.626433",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtrlpf",
            "score": -3,
            "text": "You bunch of communists always wanting to steal someone elses money.",
            "title_similarity": "0.5002827",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gvtelj5",
            "score": 1,
            "text": "Yes. Starting in the 70s this has been purposefully done. The sad thing is, somehow, most of us still haven't realized the slow effect of what's happened.",
            "title_similarity": "0.5319921",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gvtf4u3",
            "score": 1,
            "text": "The Statement is a strawman fallacy. Inequality has nothing to do with technology and no one has ever said this.",
            "title_similarity": "0.4566657",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvtf6ic",
            "score": 1,
            "text": "Join a union, trade association or community action committee in your area and participate to make your voice heard! ... Maybe I'll try to do that to. =P",
            "title_similarity": "0.27292737",
            "sentiment_compound": 0.6731
        },
        {
            "id": "gvtffgs",
            "score": 1,
            "text": "In other words, automation isn't making available jobs worth less. It's the corporate policies and greed of the Ultra Rich Class that is driving the devaluation of jobs.",
            "title_similarity": "0.73242164",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvth1lh",
            "score": 1,
            "text": "This is just a model, a pretty imperfect one we might say, that doesn’t account for many important factors, like the latest economic shakedowns or the accelerated technological developments bases on advanced automation and AI. This model treats similarly the realities of technological impact on workforce in the 80s with today’s adoption of self-ordering kiosks in fast food restaurants, for example. Looks more like a desperate effort to justify progressive approach to support labor unions development than a solid and reliable economic model.",
            "title_similarity": "0.7496741",
            "sentiment_compound": 0.8089
        },
        {
            "id": "gvtvwnc",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.16597238"
        },
        {
            "id": "gvu9940",
            "score": 1,
            "text": "also doesn't help that over 40% of the worlds reserve currency has been printed in the past year.  Asset holders get rich, cash holders get poorer.  Buy bitcoin.",
            "title_similarity": "0.54404354",
            "sentiment_compound": 0.3274
        },
        {
            "id": "gvtd1pi",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "0.16597238"
        },
        {
            "id": "gvtbhsy",
            "score": -7,
            "text": "Sometimes scientists do a study to prove something that everyone else already knew and i love it. Way to go science, you discovered something political economists discovered over a hundred years ago.",
            "title_similarity": "0.53083694",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gvtigsc",
            "score": 5,
            "text": "It mostly comes down to one policy... Money printing.",
            "title_similarity": "0.3515129",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtg3y4",
            "score": -3,
            "text": "I went to vacation in Miami this week. The amount of wealth on display has got to be the biggest slap in the face I've ever seen. Every single boat in the marina probably cost more than my house, I'd be driving down the road and see the nicest super cars and tell my wife well there goes 5 of our houses down the road. I'm convinced miami is so expensive so it can keep normal people out, to keep us dumb to what's going on and we never revolt against the rich.",
            "title_similarity": "0.53352803",
            "sentiment_compound": 0.9432
        },
        {
            "id": "gvtvwxl",
            "score": 2,
            "text": "It's a result of capitalism and exploiting the working class. Until we remove coercive and illegitimate hierarchies from our society this is going to keep happening.",
            "title_similarity": "0.61824465",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvtcqzn",
            "score": -9,
            "text": "How is income inequality rising? Please specify.",
            "title_similarity": "0.53525996",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gvtegck",
            "score": 12,
            "text": "[removed]",
            "title_similarity": "0.16597244"
        },
        {
            "id": "gvth9ci",
            "score": 3,
            "text": "What's the relation between income and social safety net? I thought social safety net is to help the needs of people with low or no income, not to increase their income directly?",
            "title_similarity": "0.63752747",
            "sentiment_compound": 0.5264
        },
        {
            "id": "gvth9y0",
            "score": 4,
            "text": "This is why it is important to differentiate between capitalism and democracy, as many are all too willing to ascribe the benefits of democracy to capitalism. \n\nWhen capitalism rose to prominence it was a vast improvement on feudalism, but it was mostly the wealthy who were able to take advantage of the new opportunity and ordinary citizens only had a slightly higher chance of advancement. Most of the rights we enjoy today had to be fought for through direct action or through the ballot box and in many instances against capitalism.\n\nI'd argue the US is more capitalist than most of Europe and because of that its democracy is less representative and its ordinary citizens have less labour rights and freedoms (due to lack of universal healthcare for instance).",
            "title_similarity": "0.72246003",
            "sentiment_compound": 0.8855
        },
        {
            "id": "gvtoq0u",
            "score": 4,
            "text": "Thanks Ronald Reagan may you rot in hell.",
            "title_similarity": "0.3890289",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvtpr8l",
            "score": 3,
            "text": "I was in a union for broadcasting. I had to pay dues, and had to pay a fee to join the union. Because we were getting a new union contract, we had to forgo raises for a few years. Sure not all unions are the same, but why do people so heavily support unions? It seems they are there for when you need them but I never needed them. If anything they seem they are in place so people can be grand fathered in or have special privilege because they are in the union or the union may receive special projects or treatment. I feel like people here the word union and assume they’re there to help the common man, when they’re probably just being exploited.",
            "title_similarity": "0.5919552",
            "sentiment_compound": 0.9718
        },
        {
            "id": "gvuuwn0",
            "score": 3,
            "text": "The study could not be more wrong. The sole reason responsible for the ever rising inequality is the inflationary monetary system the whole world is under. Monetary inflation, that is the creation of new money out of thin air, enriches those who get it first and impoverishes those who get it last. And you can have a single guess who gets it when. Hint: you, peasant, you don't get it first.\n\n  \n\n\nEveryhting else is merely a symptom of this disease.",
            "title_similarity": "0.7296378",
            "sentiment_compound": 0.7328
        },
        {
            "id": "gvvb4i4",
            "score": 7,
            "text": "Unions, that's a slippery slope because its 100% dependent on the KIND/TYPE of Union. I was part of a Union for 5 years and HATED it. It encouraged laziness and doing the bare minimum. It promoted not helping each other (not even people within the Union). It also encouraged and reinforced that the worker could do nothing wrong. That union was Teamsters.  \n\n\nI saw a man walk on a moving conveyor belt - a serious OSHA violation and major safety risk. He was escorted out of the building by management, as he should. 3 days later, had his old job back, all of his pay and vacation. Why? Because Teamsters doesn't give a single F about regulations or people making mistakes. You can do almost whatever you want EXCEPT hurt the union.  \n\n\nThat's not a place I want to be a part of. I remember one day I decided to work through my lunch (we only had 15min lunches, part time job) and I decided to do so because my area was overrun with work. I knew that 15min of work while none of the conveyers were running and I could be completely clean with an easy finish to my day. I had TWO long time union dudes up my ass, threatening to report me because I was working on my lunch. I promptly told them they can go to hell because I'm not going to have the rest of my day be a living hell because you want me not to work through my lunch. Absolutely asinine. One of the worst places I ever worked with the worst practices and people.  \n\n\n  \nNow, other Unions probably do it right. Teamsters can burn in a chemical fire.",
            "title_similarity": "0.58135927",
            "sentiment_compound": -0.9813
        },
        {
            "id": "gvteeqd",
            "score": 0,
            "text": "Isn't it just the Pareto Law?",
            "title_similarity": "0.3642727",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtewm8",
            "score": 0,
            "text": "It's only that way because we allow it to be. Even if there was some sort of mechanism by which inequality would increase as technology does, it'd still be our responsibility to be on top of such instability causing issues and address them.",
            "title_similarity": "0.6000252",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvtfbkf",
            "score": 2,
            "text": "Well yes we all knew that the developed countries can afford to keep a percentage of its population on welfare or subsidie the low paid workers. But why would capitalism redistribute wealth. It doesn't want to, it's not news",
            "title_similarity": "0.6795695",
            "sentiment_compound": 0.7019
        },
        {
            "id": "gvtfp5q",
            "score": 0,
            "text": "This is most certainly true but it’s also trivial",
            "title_similarity": "0.18230698",
            "sentiment_compound": 0.409
        },
        {
            "id": "gvtgbpk",
            "score": 0,
            "text": "I feel like a study wasn’t really necessary to figure this out, but it’s nice to have the facts.",
            "title_similarity": "0.3877003",
            "sentiment_compound": 0.6652
        },
        {
            "id": "gvtget2",
            "score": 0,
            "text": "Of course. There is no tech that simply forces money to go into a single guy pockets.\n\nIt is a construct. Media favors certain party that favors the media owner which happen to have also other industries etc.\nInnovation is actually giving more and more room to poor people to grow strong and to ask more, we have unlimited acces to information and education on the internet.\n\nYet some people chose to believe, eg, that the trickle down was possible, and the flat tax help the poors. That is people fault and it makes me quite angry. \n\nYou have to vote who gives you the benefits. Start ask! No rich guy votes against its interest, a lot of poor people does.",
            "title_similarity": "0.6981522",
            "sentiment_compound": 0.7014
        },
        {
            "id": "gvtgl41",
            "score": 0,
            "text": "The backlash from other economists when their previously peer is reviewed published models were then used to show that de-unionizing is bad for most people makes me pretty goddam skeptical of anything economists say.",
            "title_similarity": "0.74418247",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gvtgr41",
            "score": 0,
            "text": "Well yea, imagine calling people essential then paying them 12$ an hour during a pandemic",
            "title_similarity": "0.53132015",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvtgro3",
            "score": 0,
            "text": "Being right isn't good enough. Use all the data you want, you don't have power.",
            "title_similarity": "0.54562914",
            "sentiment_compound": -0.2746
        },
        {
            "id": "gvti4of",
            "score": 0,
            "text": "I could have told you that without throwing money at for a bunch of folks to do a study. \n\nIf you left it up to businesses people would never retire. When you only look at the bottom line everything and everyone else becomes irrelevant. Same thing with GDP, it has no factor in it for overall human happiness.",
            "title_similarity": "0.6311693",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvtiwad",
            "score": 0,
            "text": "I'm guessing that wealth inequality had more to do with technology though",
            "title_similarity": "0.6508415",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvtj30y",
            "score": 0,
            "text": "But if we tax the rich they'll stop trickling stuff down onto our faces.",
            "title_similarity": "0.5976752",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvtj96t",
            "score": 0,
            "text": "you mean rich people getting richer isn't an accident?",
            "title_similarity": "0.37850508",
            "sentiment_compound": 0.8609
        },
        {
            "id": "gvtlaet",
            "score": 0,
            "text": "In the history of the world, when has there ever been equality?. This is a delusional idea, people are different, unique and thus there will always be inequality. If I’m an extrovert,business oriented and confident in my abilities the current opinion by some is that I shouldn’t benefit from those qualities.",
            "title_similarity": "0.7507019",
            "sentiment_compound": 0.802
        },
        {
            "id": "gvtli7g",
            "score": 0,
            "text": "Yeah but that study literally just says \"larger income inequality started happening when unions dying so that has to be it\". It's quite a joke.\n\nLarger income inequality is almost solely because of:\n\n1. Credit Cards \n2. Fiat\n3. Practically slavery in other countries\n\nYou think TVs rise in price every year because everyone can afford them? Wrong. They rise in price every year because most people who can't afford them buy them off of credit cards so they can keep pushing the price as long as people have credit. If people had no credit, or no one bought anything they couldn't afford, the prices of things would drop, even ever so slightly. The mark up on parts is astonishing at this point.\n\nYou think the insanely rich would be able to balloon to the point of being pseudo-monopolies if money was backed by anything? Absolutely not.\n\nYou think they'd have the work force if some sort of legal slavery wasn't involved? Absolutely not.",
            "title_similarity": "0.705685",
            "sentiment_compound": -0.6423
        },
        {
            "id": "gvtlvji",
            "score": 0,
            "text": "I guess I am not understanding what \"social safety nets\" have to do with income inequality.  Safety nets are a protection against income inequality, not a solution to it.\n\nIt's a bit like saying, \"Cancer rates are rising because chemotherapy rates are dropping\"",
            "title_similarity": "0.80506635",
            "sentiment_compound": 0.1872
        },
        {
            "id": "gvtn1n4",
            "score": 0,
            "text": "It is a waste to have a union. They dont fight and protect the workers as they did in the past. They are more for the employers now.",
            "title_similarity": "0.66606426",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvtndjy",
            "score": 0,
            "text": "So the conservative agenda",
            "title_similarity": "0.30805025",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtnqo7",
            "score": 0,
            "text": "Ask the USPS how well the union has done for the overall good of the company.",
            "title_similarity": "0.44468543",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvto9t9",
            "score": 0,
            "text": "Its always things like \" if you increase wages they will leave\" fine let them leave and take away their right to sell in your country. Its always threats the workers get",
            "title_similarity": "0.6132653",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvtteu9",
            "score": 0,
            "text": "So what you are saying is that income equality is a good thing.",
            "title_similarity": "0.3501492",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvttjv6",
            "score": 0,
            "text": "While this is partially true, one of the main issues is the rise of the “nationless elite.” They now shift their assets and power around the world at will & modern countries can’t seem to come together to make sure they are properly reined in in any way. They have avoided all real taxes, are able to use their money to manipulate government policies, and offer no real benefit to humanity.",
            "title_similarity": "0.7367481",
            "sentiment_compound": -0.0721
        },
        {
            "id": "gvu7w9w",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.1731193"
        },
        {
            "id": "gvu863z",
            "score": 0,
            "text": "We have workers and we have \"leaders\". God I hate the term leaders now, because it usually isn't a leader. It's usually someone with connections and is highly overpaid for a job that's not needed or low on the totem pole. \n\nA big issue in today's job market is overhiring. There's 50 people doing the job 5 could do (yes, work would be much harder, but pay could be rebalanced). \n\nWe have management to managers and managers over those managers and a few more layers of managers. This is another massive waste. \n\nThere are policies by both the right and left that strain small business (yes we have greedy small businesses that push the limits, but most are legitimate companies trying to earn a living for everyone). Policies usually push them to hire more people and offer benefits usually not wanted by employees, then neither employee or company can afford those benefits while a company such as Walmart does this and have the majority of the workforce on government programs (tax payers are paying for employees food and healthcare while the company gets a tax break). We could reverse and do these things for small businesses which would completely revamp the middle class. \n\nAnother issue across the world is the failure to negotiate pay and say no. Don't accept the first offer. Don't accept right away. Don't accept a predetermined pay rate. All these things tell employers you aren't valuable, don't value yourself, don't care, are replaceable, and you will be the first to leave. I've helped hire so many people and it's shocking how many say yes to the first low ball offer.",
            "title_similarity": "0.64536947",
            "sentiment_compound": -0.9601
        },
        {
            "id": "gvu8nbx",
            "score": 0,
            "text": "Scipinion?  Tailored research and selective reporting to support desired conclusions.  Notice that it completely ignores that poverty wasn’t alleviated without income inequality.  It’s pretty desperate trying to ignore the fact that eliminating income equality in China has almost eliminated extreme poverty.  The only way that income equality is possible is to make everybody poor.",
            "title_similarity": "0.7154599",
            "sentiment_compound": -0.8476
        },
        {
            "id": "gvuimiw",
            "score": 0,
            "text": "“Income inequality” is political propaganda. It is used as an excuse to increase the power of the State and decrease liberty. It has more to do with getting politicians elected than increasing standards of living.",
            "title_similarity": "0.76063836",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvujshp",
            "score": 0,
            "text": "Technology replaces the workforce in almost every sector. When you remove half the body of a union overall is weaker in its influence. This was proven with the IAM, USW, and teamsters in the 1990'. Every introduction of technology has a displacement. The displacements of manufacturing were supposed to be absorbed by service and technology sectors. In truth service sector employment is a lower wage level and tech absorption is limited to those educated to enter. Currently the income disparities in economies are the change of policies which allow corporations to rule.",
            "title_similarity": "0.7392167",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvukvmb",
            "score": 0,
            "text": "What about the lazy with 7 kids that don't want to work.",
            "title_similarity": "0.41491312",
            "sentiment_compound": -0.4063
        },
        {
            "id": "gvumnh3",
            "score": 0,
            "text": "How about go make your own future and stop wanting Government or Unions to be your Mommy?",
            "title_similarity": "0.5778418",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvvi4es",
            "score": 0,
            "text": "I mean police unions seem to be doing _very well_. They are basically the pinnacle of what every union wants to become. At which point I guess people will start not liking them any more?\n\nCan reasonable pay be possible without locking everything down in  a union?",
            "title_similarity": "0.58054817",
            "sentiment_compound": -0.2236
        },
        {
            "id": "gvviq25",
            "score": 0,
            "text": "Poverty is a problem, income I equality is not.",
            "title_similarity": "0.3566986",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gvvv0s6",
            "score": 0,
            "text": "Safety net to catch people is one thing. Having people live off of loopholes in that net is another. The real issue is people not aspiring for better than minimum.",
            "title_similarity": "0.6100045",
            "sentiment_compound": 0.1012
        },
        {
            "id": "gvtlw6m",
            "score": 71,
            "text": "Edit: I’m not going to address the individual comments because you guys are repeating facts that are correlative not causative. This is the same argument made about robots taking away people’s jobs. Why is that a bad thing? Because the system is set up to punish you for not working, even if it isn’t necessary. Which comes right back around to exploitation. The reason technology advancements are hurting the working class has always been because of the people exploiting the working class. It isn’t a technology issue. It’s a people issue. And the longer you look at where they want you to look, the more they get away with. Divide and conquer has always been their strategy.\n\nIt’s a huge joke to even suggest technology had a hand in it. Every advancement we make is a better future for the working class until the point where a working class is no longer needed. Robots? Because better. More efficiency? Better. It’s always better. It’s only the people exploiting us that stop it from being better. They’re the problem.",
            "title_similarity": "0.710073",
            "sentiment_compound": 0.2758
        },
        {
            "id": "gvtjh2u",
            "score": 27,
            "text": "Income inequality is not the problem. It's WEALTH inequality that we should be concerned with.",
            "title_similarity": "0.49443054",
            "sentiment_compound": 0.7344
        },
        {
            "id": "gvtk3zw",
            "score": 31,
            "text": "There is more to life than production, profit, and shareholder value.\nHumans need to wake up.",
            "title_similarity": "0.51164144",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gvt92bl",
            "score": -37,
            "text": "[removed]",
            "title_similarity": "0.16597238"
        },
        {
            "id": "gvtelih",
            "score": -1,
            "text": "I don't think its so much increasing as it is just going back to what its been for 1000s of years.\n\nIt was only the industrial revolution that evened the playing field for a while.",
            "title_similarity": "0.5469539",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gvtesvd",
            "score": -1,
            "text": "No one has ever said that inequality is a result of technology. The saying is that inequality is a result of capitalism.\n\nYour title is a strawman.",
            "title_similarity": "0.60368305",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvtft99",
            "score": -1,
            "text": "This has been going on since the 20’s. It’s why communism was made the enemy of the west. Far to close to socialism for capitalists taste. Socialist policies ain’t good for business. Put spies in those unions and bust ‘em from the inside. Better the poor get poorer and become more willing to ignore the blatant indentured servitude they find themselves in.",
            "title_similarity": "0.7387221",
            "sentiment_compound": -0.7239
        },
        {
            "id": "gvtg8m5",
            "score": 1,
            "text": "I always see people saying stuff like “down with capitalism!” But the thing is I don’t think there’s anything inherently wrong with some good old fashioned capitalism. We’re just doing it wrong",
            "title_similarity": "0.6178949",
            "sentiment_compound": -0.6114
        },
        {
            "id": "gvtgp9b",
            "score": -1,
            "text": "Did everyone forget about the Panama Papers? Or are these keywords banned on Reddit? Can anyone see this comment?",
            "title_similarity": "0.62674356",
            "sentiment_compound": -0.6641
        },
        {
            "id": "gvtgsh9",
            "score": -1,
            "text": "Instead of income inequality, we should be addressing ability inequality. Some people have very high IQs, 3 PhDs, and work 80 hours a week, while others have no education, low IQ, lazy, and barely work at all. We need everybody in society to rise to the level of 80 hour/week workers with multiple PhDs or else society is doomed.  The government should require everybody to work at least 80 hours a week, and make sure everybody has high IQ, so smart hard workers do not create inequality and have an unfair advantage. \n\nAlso beauty inequality. Some people are just good looking, tall, fit, attractive, with great hair and nice eyes, smooth skin, perfect teeth, but others are just fat and ugly, with warts all over their skin, decaying/missing teeth. Totally unfair!  The government needs to step in to fix this problem because it is unfair that some people are better looking than others.",
            "title_similarity": "0.62571394",
            "sentiment_compound": -0.7401
        },
        {
            "id": "gvtnjsu",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.1731193"
        },
        {
            "id": "gvtnkfa",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.17311929"
        },
        {
            "id": "gvtoary",
            "score": -1,
            "text": "Trying to \"right\" income inequality is a fools folly.",
            "title_similarity": "0.6540603",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gvtp3m7",
            "score": -1,
            "text": "Hopefully a giant asteroid comes and fucks earth up. Humans are a disease to planet earth :(",
            "title_similarity": "0.49025238",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gvtr0km",
            "score": 1,
            "text": "So?\n\nWhat can anyone do about it now? Amazon, Facebook, and Disney are unstoppable. They are too big now.\n\nThey are buying companies every year. Do you know how many companies Disney alone has acquired in the last 10 years?",
            "title_similarity": "0.46604195",
            "sentiment_compound": -0.3899
        },
        {
            "id": "gvtrz1h",
            "score": -1,
            "text": "I honestly think we should just revert back to the 1880’s/90’s it would be so much easier and there would be no need to worry about politics and that garbage",
            "title_similarity": "0.48440427",
            "sentiment_compound": 0.2449
        },
        {
            "id": "gvtt6j6",
            "score": 1,
            "text": "How does income equality and social safety net fit in the same sentence? The presence of a social safety net indicates the lack of income inequality",
            "title_similarity": "0.56947553",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gvtt74g",
            "score": 1,
            "text": "The paper has a serious issue that makes it hard to reason about: they switch frequently between discussing the \"labour share\", \"wages\", and \"income\". These terms are not the same, and we should expect to see very significant differences in the outcome based on which is used. They do very little comparison.\n\nTheir Annex A provides a very general summary of how these numbers COULD be calculated with many optionals, but does not lay out how they WERE calculated or the effects of those differences.\n\nTheir article describes large sectorial differences. Of course: in many high-cost-of-employment sectors, more compensation comes in the form of stock. They list stock compensation as optionally being included in the labour share. Is it? Does it explain much of the sectoral variation? They do not say.\n\nTheir measurement period (1960-2010) saw enormous changes in family composition and labor participation. Both of those can have a large impact on compensation. Did they?\n\nThe same measurement period saw a change in the average age of the population. Is income to retirees counted as labor share or not? Do changes in average age explain an important part of the difference?\n\nWorkers in the US can be both wage-earners and stock-holders (people approaching retirement are frequently seeing more returns on their investments than on their labor). How is this counted? IIRC, most stocks and bonds are held by people in the bottom 80% of income, so this effect can be large.\n\nThis paper spends very little to grappling with the validity of its results (\"do these numbers reflect something meaningful in the real world?\") and very little on alternate explanations for what they found. There is significant literature for both, so there is no excuse for not spending the time to engage with the field.\n\nI stopped reading after appendix A's breezy treatment of significant factors, so if the real paper was after that, let me know.",
            "title_similarity": "0.77513593",
            "sentiment_compound": 0.9495
        },
        {
            "id": "gvttbj3",
            "score": 1,
            "text": "Who funds these studies, and what do they a actually hope to gain?  Studies around income inequality seem to pop up on reddit fairly often, so it seems like there is ample, documented evidence of it.\n\nIs there some entity that is actually trying to use this study to drive the change required to tackle this inequality?",
            "title_similarity": "0.6209854",
            "sentiment_compound": 0.8564
        },
        {
            "id": "gvttinj",
            "score": -1,
            "text": "Unions should be destroyed. Nothing has hastened the decrease in American jobs faster in the past 40 years than unions. \n\nIf people still had those jobs they wouldn’t need social safety nets. People with master’s degrees in women’s studies like that one in the article pic would still work at Starbucks though.",
            "title_similarity": "0.6707771",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvtuqck",
            "score": -1,
            "text": "Why do people accept low paying jobs?",
            "title_similarity": "0.51846707",
            "sentiment_compound": 0.128
        },
        {
            "id": "gvtv2i2",
            "score": 1,
            "text": "Wait, so it's planned? Omg!/s",
            "title_similarity": "0.12681796",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtvgua",
            "score": -1,
            "text": "Unions puzzle me. On the one hand, when works collectively bargain they’re generally able to get better deals. On the other hand, unions are usually why bad cops, like Dereck Chauven, don’t get fired.",
            "title_similarity": "0.6470539",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gvu0zwp",
            "score": -1,
            "text": "I'm sure a studies like these are totally not done with the intent to confirm a pre-conceived conclusion or anything.",
            "title_similarity": "0.44634002",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gvubip3",
            "score": -1,
            "text": "It is, however an inevitable outcome of capitalism.",
            "title_similarity": "0.3867969",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvuc7ze",
            "score": -1,
            "text": "Or locking down countries and closing small businesses but allowing large businesses to run unhindered. Covid has been the largest transfer of wealth ever.",
            "title_similarity": "0.60052854",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gvufeem",
            "score": 1,
            "text": "Have you ever heard of the federal reserve? Because that’s the main reason for wealth inequality.",
            "title_similarity": "0.6391288",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvt7ftg",
            "score": 382,
            "text": "[removed]",
            "title_similarity": "0.16597238"
        },
        {
            "id": "gvub9nl",
            "score": 9,
            "text": "I strongly recommend [Goliath by Matt Stoller](https://www.goodreads.com/en/book/show/40538538-goliath) to get good overview of how we ended up were we are as a function of policy and of monopoly power.",
            "title_similarity": "0.5264121",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gvtg670",
            "score": 2,
            "text": "I posit unions are part of the problem and are obsolete with rational and reasonable labor laws... e.g. minimum wage and labor taxes should be rational and reasonable, not what they currently are.",
            "title_similarity": "0.7345487",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gvto6ng",
            "score": -2,
            "text": "They are coming up with alot of different ways to say \"people are lazy\"",
            "title_similarity": "0.4459861",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gvtoga5",
            "score": -2,
            "text": "A corporate town would probably be better than a government run town",
            "title_similarity": "0.5523633",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvtrr6k",
            "score": 2,
            "text": "It's almost like class warfare is a real thing",
            "title_similarity": "0.33522624",
            "sentiment_compound": 0.0697
        },
        {
            "id": "gvtv7wj",
            "score": 2,
            "text": "Wow ! Who could have possibly predicted that ?",
            "title_similarity": "0.29841125",
            "sentiment_compound": 0.6239
        },
        {
            "id": "gvub8js",
            "score": 2,
            "text": "Biden is causing this",
            "title_similarity": "0.20365629",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvdufu",
            "score": 2,
            "text": "This is EXACTLY why the riskiest thing you can do is work for someone else. I’m sure I’ll hear from the faint of heart who can’t imagine working for themselves. Earn your true value. That’s all I’m saying.",
            "title_similarity": "0.43861538",
            "sentiment_compound": 0.8481
        },
        {
            "id": "gvtc8ls",
            "score": 300,
            "text": "[removed]",
            "title_similarity": "0.16597238"
        },
        {
            "id": "gvtn7w0",
            "score": 165,
            "text": "Class War has always been the real issues",
            "title_similarity": "0.3949018",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gvtd22e",
            "score": 47,
            "text": "How have the unions been weakened in Germany and France? The same can be said of the social safety net.",
            "title_similarity": "0.6625253",
            "sentiment_compound": 0.128
        },
        {
            "id": "gvtd8cs",
            "score": -5,
            "text": "The Australian liberals have done a great job at erroding quality of life over the last two decades",
            "title_similarity": "0.37600848",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvtb35j",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "0.16597244"
        },
        {
            "id": "gvt9oul",
            "score": 699,
            "text": "If this stuff interests you, check out the book [Four Futures](https://www.versobooks.com/books/1847-four-futures). It's all about what the world might look like when we assume increasing automation but don't know yet who will control the benefits of that tech (labor or capital), or how we'll do with the climate (stabilized or collapse).",
            "title_similarity": "0.7190071",
            "sentiment_compound": 0.09
        },
        {
            "id": "gvtty9f",
            "score": 31,
            "text": "Yesterday we had a community cleanup event and I spent ten minutes listening to some regular ass people talking about how businesses shouldn’t be paying higher wages during the pandemic because “people will get used to it and not want to work for less” - how the hell do we counter this deep level programming people have from a lifetime of propaganda?",
            "title_similarity": "0.6376358",
            "sentiment_compound": -0.884
        },
        {
            "id": "gvtrvkc",
            "score": 79,
            "text": "They didn't seem to focus at all on the elephant in the article: \"Offshoring to mostly low-wage countries, a proxy for undermining labor's bargaining power by taking advantage of cheapened labor in less developed countries explained 44% of the decline in the wage share of the GDP\"",
            "title_similarity": "0.70853937",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gvtdaix",
            "score": 3660,
            "text": "I've heard it described as \"neo-feudalism\" and it seems apt. How hard would it be for apple to buy swaths of land and to literally turn their campus into its own fiefdom. I know far fetched but the only wall you need to divide those inside from those outside the safety of the wall is a corporate ID.",
            "title_similarity": "0.67146164",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gvti1q8",
            "score": 693,
            "text": "I know in Canada, major employers just manufacture overseas and make their profit from countries who have no labour standards.\n\nWhat is the solution to that?",
            "title_similarity": "0.64821374",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gvt8ktw",
            "score": 1490,
            "text": "[removed]",
            "title_similarity": "0.16597238"
        },
        {
            "id": "gvtfqtp",
            "score": 1,
            "text": "Japan has a crucial difference though, because their falling population means that they haven’t had any rise in house price to salary ratio for a number of years. All the other developed countries with rising populations have spiralling property prices. This means that stagnating incomes in Japan don’t have the same impact as elsewhere. For example, in UK between 1997-2007 house prices grew from 3x to 8x salary, and proportion spent on housing costs rose from 20% of income to 53% of income amounting to an effective 33% extra income tax. That rise took place under a supposed left wing government in UK.\n\nHousing costs make up a greater share of lower income households expenditure, so relentlessly rising house prices are ruinous for the financial well being of ordinary workers.",
            "title_similarity": "0.71959007",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gvtgyiy",
            "score": 1,
            "text": "Bookmarked to show crazy people who say rejecting technology and going back to communal farming would be the quickest path to equality.",
            "title_similarity": "0.5947807",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gvthjrx",
            "score": 1,
            "text": "I mean it's capitalism working as intended.",
            "title_similarity": "0.3473422",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvthowo",
            "score": 1,
            "text": "I wonder how much of the recent focus on the power of the tech industry is a proxy war between established wealth and and new entrants that have begun to assert more power.",
            "title_similarity": "0.72723544",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gvthy3m",
            "score": 1,
            "text": "I will say that the overwhelming focus on bottom line and cost savings has driven a lot it. The market requires you to be reducing costs at any means necessary in order to stay competitive and often times that means wages and headcount.",
            "title_similarity": "0.54275846",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gvthz8k",
            "score": 1,
            "text": "A groundbreaking study of agricultural systems suggests a cow says \"Moooo\"",
            "title_similarity": "0.30943227",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvti8zr",
            "score": 1,
            "text": "Lolol a whole research paper on the already known outcomes of capitalism.",
            "title_similarity": "0.5385388",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtio5y",
            "score": 1,
            "text": "Temporarily embarrassed millionaires.",
            "title_similarity": "0.4534731",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gvtiq8f",
            "score": 2,
            "text": "Idk, the logic of rising inequality is pretty clear to me.\n\n* As the progress goes on, existing technologies are optimized, allowing the same quantity/quality of product to be produced at a lower cost. This allows people who own the production to generate higher income even if the final price goes down.\n\n* As more and more production sequences are automated, production owners need less employees, thus cutting on their own expenses and reducing a number of available jobs. More income inequality.\n\n* As the progress goes on, pushing research even further requires more and more investment, limiting research of top tier tech to companies/individuals with highest income. And top tier tech brings us back to one of two previous points.\n\nSounds pretty damn inevitable, the only question is what you can do about it.",
            "title_similarity": "0.6993602",
            "sentiment_compound": 0.9321
        },
        {
            "id": "gvtiuz8",
            "score": 1,
            "text": "That title is a bit misleading. \n\nIt’s moreover those that made huge profits (usually those with access to technological advantages) later used that power to gain political influence, which then in turn lead to the creation of such social policies. \n\nThose policies then helped those in power further grow their wealth, which lead to larger economic disparity.",
            "title_similarity": "0.6214899",
            "sentiment_compound": 0.9136
        },
        {
            "id": "gvtj8s6",
            "score": 1,
            "text": "Why is this even  in  r/science? Shouldn't there be other subreddits like economics or social science for things like this?",
            "title_similarity": "0.6719464",
            "sentiment_compound": 0.6553
        },
        {
            "id": "gvtjcbf",
            "score": 1,
            "text": "IMO, the income inequality was boosted by the economic policies of Reagan & Thatcher, which have protected corporations sacrificing the workforce. \n\nThese policies, while very effective in the short-term, require corrections to adapt to a dynamic economy which were not made.\n\nMaybe COVID will push for a worldwide adjustment of the economic system. We will only see it in a few years.",
            "title_similarity": "0.76692456",
            "sentiment_compound": 0.8858
        },
        {
            "id": "gvtje0y",
            "score": 1,
            "text": "I don't think the goal of capitalism is income equality though. Take minimum wage, for example. In the United States there is a federal minimum wage but it differs across state lines.   On a global scale, a farmer can perform labour similar to those in other countries but the value associated with that labour will not the same. You might even say inequality is built into or inseparable from the free market.",
            "title_similarity": "0.7668357",
            "sentiment_compound": 0.8573
        },
        {
            "id": "gvtjgrp",
            "score": 1,
            "text": "The push for the gig economy is the next step",
            "title_similarity": "0.48900828",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtjips",
            "score": 1,
            "text": "Seems obvious, but glad they are studying it (at least).",
            "title_similarity": "0.18924409",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvtjoev",
            "score": 1,
            "text": "The difference in income is going to other countries where all our things are made. There more and more ppl are rising out of poverty at the cost of our declining middle income earners.",
            "title_similarity": "0.6338465",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gvtjzj8",
            "score": 1,
            "text": "It is the inevitable outcome of Capitalism, however.",
            "title_similarity": "0.4507699",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtk0ue",
            "score": 1,
            "text": "A system (money) invented by people is distributed bases on decisions (politics) made by people.  Yes?",
            "title_similarity": "0.49239868",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gvtk1xy",
            "score": 1,
            "text": "This is just a fancy way of saying that it’s the government’s fault.",
            "title_similarity": "0.6154785",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvtkf9x",
            "score": 1,
            "text": "target doesnt support unions",
            "title_similarity": "0.52386105",
            "sentiment_compound": -0.3089
        },
        {
            "id": "gvtkgii",
            "score": 1,
            "text": "The article doesn’t mention anything specific about social safety nets. I wonder which ones that have been repealed that they are referring to.",
            "title_similarity": "0.56075567",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvtkk4r",
            "score": 1,
            "text": "“High income countries” lolololololololol",
            "title_similarity": "0.33014214",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtlcht",
            "score": 1,
            "text": "Patent reform could go a long way to helping technology driven inequalities.  Every eventual outcome is dystopian but some are a lot more pedantic than others.",
            "title_similarity": "0.6970727",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gvtlgd6",
            "score": 1,
            "text": "Don't forget the greed of the ownership class",
            "title_similarity": "0.44777176",
            "sentiment_compound": 0.4449
        },
        {
            "id": "gvtltl5",
            "score": 1,
            "text": "I hope labor saving devices become more prevalent so all labor can live like Kings and Queens that they demand.",
            "title_similarity": "0.45319146",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gvtm3bq",
            "score": 1,
            "text": "A basic college economics course teaches that for machine dollars earned, a portion of those dollars must be reinvested into society for the human dollars earned that machines replace or instability is inevitable.",
            "title_similarity": "0.6452521",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtmavf",
            "score": 1,
            "text": "Whenever I read stories like this, they make me realize that these people aren't discovering the first case of this happening. We may be getting taken advantage of, y'all.",
            "title_similarity": "0.54264295",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gvtmbt8",
            "score": 1,
            "text": "You can counter this effect by changing your mindset. It can require some tremendous sacrifices, like limited to no contact to the people in your life. Another important aspect is to limit your intake of information that reinforces the believe that it's impossible to change your life from poverty to wealth, by for example being extremely selective about what you allow your brain to be exposed to in the media, on social media and not least sites like Reddit, Twitter, Facebook and other places like that. This is due to the confirmation bias:  \n\n\nIf 0.1% of the world's population holds a certain believe and you see that believe being reinforced by hundreds of people every day, your subconscious mind will translate that into common sense.\n\n&#x200B;\n\n\\- - - \n\n&#x200B;\n\nAnyone who has overcome drug and alcohol addiction understands the importance of cutting ties with your old environment, especially the people in it. The same goes for recovery from toxic relationships. That process is quite long, hence the mantra \"no contact.\"\n\n&#x200B;\n\nThe way the news and social media is set up, is by hacking our attention span, keeping us clicking for more and more of the same. If that is bad news, your world view will become negative. If it's good news, your world view will become positive.\n\nWhen we are in a good mood, according to Chris Voss, the former FBI hostage negotiator, we are ca. 30% more intelligent. Hence, if you want out of poverty, start by changing your thoughts from negative to positive, since that will lead to more future optimistic decisions in the present.",
            "title_similarity": "0.71693707",
            "sentiment_compound": 0.8306
        },
        {
            "id": "gvtmdk1",
            "score": 1,
            "text": "Huh... how’d that happen?",
            "title_similarity": "0.13877791",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtmhdl",
            "score": 1,
            "text": "\"Wage share of GDP\" thats one way to discredit an article very fast. Hell, in all my years I have never heard of someone using output per effective capita as a proxy for income inequality. \n\n\nMost income inequality papers, or those who need a measure of inequality, will use the gini coefficient, typically on equivalised income. Sure there's problems with that measure but its a lot more consistent than using output per effective capita.\n\n\nLooked around a bit and heres the results for gini coefficient for the stated countries. Around 1990-2017 \nUS, and maybe UK has increased. (Couldn't find consistent evidence for UK but id imagine it increased). \nGermany, France, Japan have either decreased or stayed the same.",
            "title_similarity": "0.7365718",
            "sentiment_compound": 0.8385
        },
        {
            "id": "gvtmiqv",
            "score": 1,
            "text": "That's a lot of words to say \"greed\"",
            "title_similarity": "0.2912127",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvtmkc9",
            "score": 1,
            "text": "It's not the lack of unions and safety nets, it's literally just because the people whose decision it is to divvy up pay will choose to give themselves more.",
            "title_similarity": "0.56202066",
            "sentiment_compound": 0.5207
        },
        {
            "id": "gvtmozb",
            "score": 2,
            "text": "There will always be income inequality. And income inequality globally had decreased substantially over the past hundreds of years. \"Poverty\" is quite low globally, and it's decreasing, mostly due to technology. Few people in the US live in poverty, and they either live in \"poor\" areas and don't move or they live in affluent areas and are temporarily poor due to a combination of bad planning, bad luck and/or illness. I've been asked by poor/homeless appearing people for $2 for a cup of coffee in Austin, TX. I consider a $2 cup of coffee a luxury as it has no nutritional value and if one likes coffee, it's nice, but not necessary by any means.\n\nMost of the time, \"poor Americans\" drive cars and have a place to live and food to eat.\n\nThere is the Reddit push for $15-20/hr minimum wage, and that is absurd. \"Minimum wage\" jobs, meaning the lowest barrier to entry and level of experience and skills required often pay $12 or more/hr because nobody will work for true minimum wage unless they have legal problems and it's a risk to hire the people or they are being exploited by not so nice people.\n\nIn countries like Australia, France, Germany, UK or Japan unless these countries are significantly different than the US, if one works 5-6 days a week, they will be able to take care of themselves. Now, having 10-15 kids, or even much less, now that is expensive, but also a choice so to speak. If one wants to bring that many new people into the world, then they will have to either be quite wealthy already or be prepared to be quite poor. I haven't known anybody with more than 3-4 kids in quite some time, and 0-2 seems quite normal these days, and yes, kids are quite expensive.",
            "title_similarity": "0.5717217",
            "sentiment_compound": -0.9563
        },
        {
            "id": "gvtn6bh",
            "score": 1,
            "text": "Even if this was true, I dont care about income inequality. And you shouldn't either. Should everyone make nearly the same for any and all professions?\n\nA big misconception is that life is a zero sum game, meaning if rich people get richer, than poor people therefore must be getting poorer. But that is totally not true at all. With the exception of the occasional recession, the rich and poor are both getting richer. It's just that the rich get richer faster. And yes this is still true when you consider inflation.\n\nI know this isn't true everywhere, but take Anerica for example. Our poor people have smartphones and are overweight. that is rich compared to people in Somalia.",
            "title_similarity": "0.69594795",
            "sentiment_compound": 0.9234
        },
        {
            "id": "gvtn7q7",
            "score": 1,
            "text": "And with 27 trillion debts the system is a devils loop",
            "title_similarity": "0.53064466",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gvtng3w",
            "score": 1,
            "text": "Ok but no one ever thought income inequality was linked to technological progress..?",
            "title_similarity": "0.5273041",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvtnmaq",
            "score": 1,
            "text": "Back in the 90's trade treaties were sold to the public as a way to lower prices of goods. All these companies did, was lower their input labor costs at the expense of manufacturing jobs in the U.S. and prices stayed the same, thus they got a higher profit margin.\n\nMoving our manufacturing en masse to China in the hope they would walk away from communism did not work.",
            "title_similarity": "0.71871954",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvtnq0h",
            "score": 1,
            "text": "The system doesnt work. Even the middle class cannot afford to own their own homes anymore.",
            "title_similarity": "0.60233516",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtnug4",
            "score": 1,
            "text": "Is raising minimum wage rlly the long term solution? \n\nIs inequality not inevitable statistically speaking? I’m just thinking of monopoly and how the closer you get to the end of the game, the greater the inequality becomes, and therefore, the more obvious it becomes who’s going to win. \n\nI’m no economist, I just feel like raising minimum wage is a faux way of keeping the game going.",
            "title_similarity": "0.74805003",
            "sentiment_compound": 0.8504
        },
        {
            "id": "gvtnvas",
            "score": 1,
            "text": "Sure, these things don't just happen.  The question is, is the attempt by powerful people to weaken unions and dismantle social safety nets an inevitable occurrence?  I'd bet it is.",
            "title_similarity": "0.75782764",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvtnzj1",
            "score": 1,
            "text": "It's the inevitable outcome of systems that create it. Systems of passive income create billionaires.",
            "title_similarity": "0.39833418",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvto3fk",
            "score": 1,
            "text": "When those policy decisions are based on principle and long standing precedent, they are harder to change.",
            "title_similarity": "0.516835",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtoaiq",
            "score": 1,
            "text": "Nothing beats banking/finance culture when it comes to shake downs\n\nThank you for all the fish",
            "title_similarity": "0.31341225",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gvtollx",
            "score": 1,
            "text": "How does this mesh with the hard data that shows social safety nets are increasing in expenditure and scope in all developed countries year over year?",
            "title_similarity": "0.5557235",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvtondo",
            "score": 1,
            "text": "When in history hasn't this always been the case I don't know why people think that somehow it's just going to end magically because it won't wealth begets wealth.",
            "title_similarity": "0.5569819",
            "sentiment_compound": -0.6435
        },
        {
            "id": "gvtoqnx",
            "score": 1,
            "text": "Are you implying we could do better as a society? No mames, wey.",
            "title_similarity": "0.5416884",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gvtp481",
            "score": 1,
            "text": "Let’s just call it like it is: GREED!!!",
            "title_similarity": "0.33764774",
            "sentiment_compound": -0.4232
        },
        {
            "id": "gvtpbk0",
            "score": 1,
            "text": "But you wouldn’t need unions if companies looked out for their employees.. (I know, I know it’s about profit, the sole purpose of a corporation $)",
            "title_similarity": "0.50228775",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gvtpd7l",
            "score": 1,
            "text": "It's pretty obvious who benefits when people are taught to accept the premise that cost cutting measures like technological progress, automation, and offshoring are somehow grounded in the laws of nature rather than simple minded greed. \n\nIt's not the robots we have to worry about as much as investors, CEOs, lobbyists, and politicians who work for them.",
            "title_similarity": "0.61284256",
            "sentiment_compound": 0.765
        },
        {
            "id": "gvtpduh",
            "score": 1,
            "text": "I mean it seems obvious to me that technological advances should result in more wealth and free time for everybody. Just imagine the most extreme example where all work in the world was automated. At that point no person would have to work and everyone should share in the wealth and free time it affords and have more than their basic needs met. Instead more wealth is being hoarded by the wealthy and the middle and lower class are growing poorer each year. Income inequality is the biggest issue of our lifetime if not the biggest issue of the human race for all time.",
            "title_similarity": "0.5854309",
            "sentiment_compound": 0.9481
        },
        {
            "id": "gvtpfu3",
            "score": 1,
            "text": "Well, isn't it a no-brainer? A worker today is something like four times more productive than they would be in the fifties. Those productivity gains did not, however, profit workers on the whole, especially not in the US.",
            "title_similarity": "0.6004324",
            "sentiment_compound": 0.5565
        },
        {
            "id": "gvtps26",
            "score": 1,
            "text": "There’s always going to be a lot of people who make $0 for whatever personal reasons. So as incomes rise, so will inequality. It’s a good thing.",
            "title_similarity": "0.51991916",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvtpyt2",
            "score": 1,
            "text": "I'd say it's alittle bit of both, people get replaced by advanced machinery constantly.",
            "title_similarity": "0.39309695",
            "sentiment_compound": 0.25
        },
        {
            "id": "gvtq25z",
            "score": 1,
            "text": "I found this unsatisfying, maybe because it’s just a “teaser” for the paper(?).  On the on hand it mentions something that is economic:  “more women” = a supply/demand statement.  Good.\n\nBut then it talks about the weakening of union power.  That seems not a cause but a symptom.  From an economic perspective, what is happening that would cause euro voters to support weakening unions?",
            "title_similarity": "0.7990823",
            "sentiment_compound": 0.264
        },
        {
            "id": "gvtqawm",
            "score": 1,
            "text": "The DoD has sited it as a national security risk along with climate change.",
            "title_similarity": "0.5283444",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gvtqce3",
            "score": 1,
            "text": "We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.--That to secure these rights, Governments are instituted among Men, deriving their just powers from the consent of the governed, --That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness.\n\n-Declaration of Independence\n\nThis section of the document is still as relevant as ever. Revoke your consent and stage a work strike until our government modernizes and submits to significant reforms that seem most likely to effect our Safety and Happiness. Not just for the rich and powerful. *US only but I would love nothing more than to see this same sentiment across the globe.",
            "title_similarity": "0.51672685",
            "sentiment_compound": 0.9674
        },
        {
            "id": "gvtqdan",
            "score": 1,
            "text": "Am I wrong to think that income inequality is not the cause of so many problems as it is a symptom of other problems? I dont know much about economics but it seems like attacking income inequality directly is less effective than identifying the problems that cause the wrong kind of inequality.",
            "title_similarity": "0.78819835",
            "sentiment_compound": -0.8634
        },
        {
            "id": "gvtqthq",
            "score": 1,
            "text": "Has anyone seen a study that documents how the allocation of corporate gross income has changed over the years.\n\nI suspect that the allocation among Capital cost, cost of Materials, cost of wages, executive bonuses, and shareholder profits has changed substantially.\n\nI.E. That today's executives are increasing their percentage take and shareholder profits at the expense of wages.\n\nThat would be another piece of evidence in support of the author's conclusions",
            "title_similarity": "0.65827715",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gvtr0mn",
            "score": 1,
            "text": "What we need is good old fashioned unions who aren’t afraid to picket and clobber scabs.",
            "title_similarity": "0.48772877",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvtrbd5",
            "score": 1,
            "text": "Surprise, no surprise",
            "title_similarity": "0.058153793",
            "sentiment_compound": 0.0736
        },
        {
            "id": "gvtrchg",
            "score": 1,
            "text": "I was confused by the idea that technological progress was leading to rising income inequality, as opposed to ... our capitalistic systems.",
            "title_similarity": "0.80877775",
            "sentiment_compound": 0.128
        },
        {
            "id": "gvtrk6s",
            "score": 1,
            "text": "This is exactly what’s going on. I’ve been thinking about buying a new place. I’ve been told now the normal person has tons of competition from speculation companies. Not for whole apartments single family homes which should be illegal. People shouldn’t be competing with companies to buy houses.",
            "title_similarity": "0.7056188",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvtrow3",
            "score": 1,
            "text": "I don't know why this is news, [Scientific American explained this mathematically years ago.](https://www.scientificamerican.com/article/is-inequality-inevitable/)",
            "title_similarity": "0.6255245",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvts4b6",
            "score": 1,
            "text": "It’s wild reading about the computer age in the time period prior to the internet, or even the PC. The romanticism and progressive attitude that our technologies would liberate us from passionless labor and hard lives, freeing up our time to spend with our love ones and live meaningful lives.",
            "title_similarity": "0.58997506",
            "sentiment_compound": 0.8591
        },
        {
            "id": "gvts9zn",
            "score": 1,
            "text": "Not sure if it’s been mentioned here yet, but The Great Risk Shift by Jacob Hacker discusses this in depth. \n\nAs a “fun” side note, he published it in *2007* I can only imagine what he’d say now.",
            "title_similarity": "0.538972",
            "sentiment_compound": 0.5452
        },
        {
            "id": "gvtschr",
            "score": 1,
            "text": "The rich have been trying to destroy to social democracies since they first came about.",
            "title_similarity": "0.6596793",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gvtsei7",
            "score": 1,
            "text": "Interesting. So that could help explain why teacher and police unions are so strong in the US - they are more about protecting their members from liability than about creating higher salaries or winning better benefits.",
            "title_similarity": "0.6612304",
            "sentiment_compound": 0.9596
        },
        {
            "id": "gvtsnmq",
            "score": 1,
            "text": "Can someone please sum this up in a sentence or so?",
            "title_similarity": "0.14384255",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gvtsy17",
            "score": 1,
            "text": "I guess freedom is too radical of an idea... what a shame.",
            "title_similarity": "0.47671393",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvtszte",
            "score": 1,
            "text": "Yes ,technical progresses dont want to rise income inequality ,but close the gap between poverty and filthy rich .Unfortunately ,finally it is somehow inevitably manipulated by capital giants making capital return surpass the average economical yield rate. Unions indeed act as a moderator to coordinate assignment of booties,but sometimes will be overtly criticized due ot its hamper against technical progress.",
            "title_similarity": "0.802636",
            "sentiment_compound": -0.5942
        },
        {
            "id": "gvtt1yf",
            "score": 2,
            "text": "Wages need to appreciate, the minimum wage needs to track an index and keep up with inflation and productivity, and other higher paid workers need to demand more",
            "title_similarity": "0.5868627",
            "sentiment_compound": 0.296
        },
        {
            "id": "gvtt8iy",
            "score": 2,
            "text": "The rich politicians screwing over the poor and middle working class because they can't make big, fat \"donations\".",
            "title_similarity": "0.6559956",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gvtv6w6",
            "score": 1,
            "text": "Bring back the mob too",
            "title_similarity": "0.33926708",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtvfkk",
            "score": 1,
            "text": "Scientific research finds in favor of historical materialism? Can't wait for the \"facts and logic\" crowd to get ahold of this...",
            "title_similarity": "0.51890767",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gvtw854",
            "score": 1,
            "text": "Actually, it IS an inevitable outcome of technological advancement.  That’s not to say it can’t and shouldn’t be mitigated, but technology and the owners of technology can (almost) completely bypass  the traditional labour market, and actually OWN the means of production.  The whole foundation of Marxism is that the workers should own their own labour as a means of production and therefore share in the profits of that production-  under that same lens, the owners and developers of labour obsolescing technology now own the means of production. \nLet’s do a thought experiment.  There is a factory that employs 1000 workers who each make 1000$ a week. Let’s even say that this factory is owned as a cooperative, and all the workers feel that this wage is absolutely fair for their work.  Everybody is happy. \nNow let’s say somebody comes along and builds a competing factory that can do exactly the same thing as the first factory but doesn’t need any labour- or let’s be more realistic and say that it needs only 100 workers.  If there is 1,000,000 a week paid in wages in the first factory, then doesn’t it follow that 1mil in weekly wages is still fair in the second factory? \nWhether you agree that it is or not, these two factories that produce the same output and sell the same items at the same price will have just as much revenue, but one has far more money left over at the end of week.\nSo what’s fair to do with this money? Shouldn’t everybody keep it? Shouldn’t the 100 employees be making 10,000$ a week?  Or should the company continue to pay each worker 1,000 a week since that’s apparently a fair wage for work?  It’s an inevitable evolution of greater efficiency in business. And it inevitably results in fewer people making more money.  This will happen regardless of a strong union - I’m all for organized labour, myself.  But tell me where I’m my example anything had to do with union busting? As for social safety nets, even the strongest safety net- let’s assume a universal basic income- won’t prevent a hyper stratification of those at the very top.\nAll this happens because of specialization.\nLook at today’s labour market-  there is currently a huuuge labour gap. 100s of thousands of high paying job openings, and 100s of thousands of unemployed.  How does that happen? There’s a mismatch.  Those who are specialized or have specialized skills are in high demand.  And if a company can’t find a person to fill the void, the void is increasingly being filled by technology.",
            "title_similarity": "0.68380684",
            "sentiment_compound": 0.9946
        },
        {
            "id": "gvtx8gq",
            "score": 1,
            "text": "I would argue that much of the decline in blue collar earning power stems from neoliberal economic policies that only consider macroeconomic effects.  Consider some of the economic research by David Autor, David Dorn, and Gordon Hanson (2013), where the examined the impact of PNTR with China from the perspective of local labor market performance.  While no one really discusses PNTR with China (except for Bernie Sanders on occasion), PNTR caused US labor markets to shed millions of blue collar jobs in certain sectors which also weakened union bargaining power.   From an aggregate economic perspective, PNTR probably increased US GDP and that’s what most policy makers focus on.  However, those gains largely flowed to high-income earners in more capital-intensive sectors which has accelerated upper-middle professional classes pulling away from blue collar workers economically.\n\nMight be overly simplistic, but I tend to think about a lot of policy impacts in terms of the old Heckscher-Ohlin model.  OECD countries tend to have an abundance of capital-intensive sectors and a scarcity of labor-intensive or blue collar capacity when compared to the rest of then world.  So the more neoliberal economic agendas are advanced, the more (typically high-income earners) capital-intensive sectors will benefit at the expense of the more blue collar workers in non-service sectors.  Decline of union bargaining power is a symptom not a cause.  It’s really policy decisions that have caused sectors that tend to be unionized in OECD countries to decline.  The effect of automation is also often overstated.\n\nImao, policy makers in OECD countries need to pay more attention to local labor market impacts at the sector level rather than couching policies in terms of macroeconomic performance.  While many policies may increase national GDP, they may also run the risk of transferring more wealth from those at the bottom of the income spectrum to those at the top.  In other words, policy makers need to focus less on oversimplifying economic policies in terms of macroeconomic GDP growth a consider effects across labor markets.",
            "title_similarity": "0.75873643",
            "sentiment_compound": 0.9468
        },
        {
            "id": "gvtyz2l",
            "score": 1,
            "text": "So capitalism is the problem? Yeah, makes sense",
            "title_similarity": "0.49990007",
            "sentiment_compound": -0.128
        },
        {
            "id": "gvtz4la",
            "score": 1,
            "text": "Is there an organization out there named the global council  of studying the extremely obvious?",
            "title_similarity": "0.39339525",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtz70v",
            "score": 1,
            "text": "40 years of Koch Network will do that to a society.",
            "title_similarity": "0.32070935",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvtzmv9",
            "score": 1,
            "text": "Except that unions work to keep potential new employees that can replace them out. So no",
            "title_similarity": "0.5654183",
            "sentiment_compound": -0.4341
        },
        {
            "id": "gvu09ki",
            "score": 1,
            "text": "No kidding? Next they will find no air in space...crazy stuff",
            "title_similarity": "0.4539975",
            "sentiment_compound": -0.3603
        },
        {
            "id": "gvu0m7c",
            "score": 1,
            "text": "Oh wait, whats this, from the abstract of the study:   \n\n\nOur findings suggest that the wage share declined due to a fall in  labour’s bargaining power ***driven by offshoring to developing countries***  and changes in labour market institutions such as union density, social  government expenditure and minimum wages.   \n\n\n  \nSeems the headline skipped over that part, which the author of the study seems to think is the primary reason.",
            "title_similarity": "0.7551913",
            "sentiment_compound": 0.296
        },
        {
            "id": "gvu0p6y",
            "score": 1,
            "text": "damn if only there was a word for the economic system that has brought us into this hellscape",
            "title_similarity": "0.6452296",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvu0qjw",
            "score": 1,
            "text": "Here's the truth of it in a song. This is what Corporations want.\n\n>Some people say a man is made outta mud\nA poor man's made outta muscle and blood\nMuscle and blood and skin and bones\nA mind that's a-weak and a back that's strong\nYou load 16 tons, what do you get?\nAnother day older and deeper in debt\nSt. Peter don't you call me, 'cause I can't go\nI owe my soul to the company store\nI was born one mornin' when the sun didn't shine\nI picked up my shovel and I walked to the mine\nI loaded 16 tons of number nine coal\nAnd the straw boss said, \"Well, a-bless my soul\"\nYou load 16 tons, what do you get?\nAnother day older and deeper in debt\nSt. Peter don't you call me, 'cause I can't go\nI owe my soul to the company store\nI was born one mornin', it was drizzlin' rain\nFightin' and trouble are my middle name\nI was raised in the canebrake by an ol' mama lion\nCan't no high toned woman make me walk the line\nYou load 16 tons, what do you get?\nAnother day older and deeper in debt\nSt. Peter don't you call me, 'cause I can't go\nI owe my soul to the company store\nIf you see me comin', better step aside\nA lotta men didn't, a lotta men died\nOne fist of iron, the other of steel\nIf the right one don't get you\nThen the left one will\nYou load 16 tons, what do you get?\nAnother day older and deeper in debt\nSt. Peter don't you call me, 'cause I can't go\nI owe my soul to the company store",
            "title_similarity": "0.59019744",
            "sentiment_compound": -0.8059
        },
        {
            "id": "gvu1eg5",
            "score": 1,
            "text": "the largest contributor right now to the wealth gap is monetary policy of \"liquidity\". The asset inflation that we have seen is a direct result of central banks and their policies of excess liquidity. Asset prices increase and that adds wealth to those who own assets while those who do not own assets get further and further priced out.\n\nReddit need only look at housing prices and homeownership. Every year that home prices 10% and your income stays stagnant is another year you are further priced out from ever owning a home. Home ownership will eventually be a thing for the wealthy and everyone else  will be renters. \n\nLook up the Cantillon effect. This is what is going on. This is how the top 1% practically doubled their wealth in a year when everything was shut down to some degree.",
            "title_similarity": "0.6638161",
            "sentiment_compound": 0.9606
        },
        {
            "id": "gvu1mux",
            "score": 1,
            "text": "So could we please stop doing it now? Or do these people only understand that power flows from the end of a ....",
            "title_similarity": "0.5256045",
            "sentiment_compound": 0.0935
        },
        {
            "id": "gvu1zgr",
            "score": 1,
            "text": "Depends on the country, in Argentina unions are basically a mafia. Im not against them as a concept, but as they are here, now, at the very least it does not work",
            "title_similarity": "0.70340246",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvu26e8",
            "score": 1,
            "text": "Also known as \"Reaganomics\"",
            "title_similarity": "0.30862138",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvu2lil",
            "score": 1,
            "text": "Avg. North American CEO's compensation as a ratio to their employees is about 278:1.\n\nThat gap keeps widening.",
            "title_similarity": "0.5918888",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvu2ri4",
            "score": 1,
            "text": "Thank you for sharing this!",
            "title_similarity": "-0.015853154",
            "sentiment_compound": 0.68
        },
        {
            "id": "gvu2wp7",
            "score": 1,
            "text": "In Norway cashiers earn 30% more than in the US. (Adjusted for cost of living). And I would say Norway and the US have similar level of technological progress.",
            "title_similarity": "0.41540927",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvu3njc",
            "score": 1,
            "text": "Yep, and this has been know long before this study was published. I did a report on UBI and learned a lot about automation and future tech, as well as job displacement. Before studying I thought I knew a lot about all those things, but there really is so much more to it.",
            "title_similarity": "0.52036375",
            "sentiment_compound": 0.2846
        },
        {
            "id": "gvu3sk1",
            "score": 1,
            "text": "Some folks are meant to be chives",
            "title_similarity": "0.22836451",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvu3y9e",
            "score": 1,
            "text": "neoliberalism is a political project, not an economic one.",
            "title_similarity": "0.48438942",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvu484a",
            "score": 1,
            "text": "somebody help me, explain like im 5 whats the problem with income inequality? are we all supposed to make the same money",
            "title_similarity": "0.61579955",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvu48z8",
            "score": 2,
            "text": "But they earned all that money they hoard, what are we supposed to do? Take it from them?\n\nYes, they've been robbing us blind year by year, is time to take back.",
            "title_similarity": "0.4998942",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvu4htx",
            "score": 1,
            "text": "Nope. It’s because capitalism requires an underclass to operate. The world runs on slave labor and exploitation",
            "title_similarity": "0.6291377",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvu505h",
            "score": 1,
            "text": "The way I read that is income inequality is (or at least can be) an inevitable outcome of technological progress, and policies that have weakened unions and dismantled social safety nets have removed protection against that. Those policies have no bearing on whether income inequality is an organic effect of technological progress.",
            "title_similarity": "0.74700814",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gvu51yv",
            "score": 1,
            "text": "Government got us here, and somehow more government is going to get us out",
            "title_similarity": "0.48670596",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvu5aw7",
            "score": 1,
            "text": "The problem is not technology or even unions- it is landlords! The common right of man to land has been ignored- we need a land value tax. Tax land not man!\n\nr/georgism",
            "title_similarity": "0.60372984",
            "sentiment_compound": -0.4912
        },
        {
            "id": "gvu5p4o",
            "score": 1,
            "text": "Jobs are not equal. Cultures are not equal. Geography is not equal. So why would a thing that depends on those things be equal?",
            "title_similarity": "0.66818225",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvu6qu8",
            "score": 1,
            "text": "On the one hand, you are correct, on the other hand, I, a knowledge worker/technology worker born in 1968, would never join the union because it would never “get” me. I would be much better off fending for myself, raising my own skills, and negotiating the best salary for myself. Why in the hell is this not an allowed thought process to happen in 2021? Back in the late 80s when I was doing contract work, I was much better served by improving my Microsoft word typing speed than by trying to join a union, which is a construct from my grandfather‘s age, if not my parents age.",
            "title_similarity": "0.69024086",
            "sentiment_compound": 0.9314
        },
        {
            "id": "gvu6x02",
            "score": 1,
            "text": "In other words scientists have once again discovered that everything socialists have been saying about Capitalism for the past 150 years is in fact correct.",
            "title_similarity": "0.41840023",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvu71p6",
            "score": 1,
            "text": "Also propaganda to make people believe that unions and social safety nets are evil communism. RIP dad's reason and logic skills.",
            "title_similarity": "0.7076279",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gvu74vp",
            "score": 1,
            "text": "Remove union fees and they'll come back.",
            "title_similarity": "0.40858307",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvu7cvy",
            "score": 1,
            "text": "Put plain and simply rich people spend their money on staying rich and as a direct cause you and I make next to nothing",
            "title_similarity": "0.36057693",
            "sentiment_compound": 0.802
        },
        {
            "id": "gvu7slp",
            "score": 1,
            "text": "It's good we have studies to confirm something that's pretty obvious so it becomes irrefutable, just wish it would have a larger impact on policy makers, but sadly companies and the wealthy always come first",
            "title_similarity": "0.6134425",
            "sentiment_compound": 0.5346
        },
        {
            "id": "gvu7tgb",
            "score": 1,
            "text": "Its also a byproduct of extended periods of peace as Walter Schiedel's The Great Leveler has taught us",
            "title_similarity": "0.3200898",
            "sentiment_compound": 0.8225
        },
        {
            "id": "gvu7u5g",
            "score": 1,
            "text": "Unions are an obsolete tool that are used to support the unions bureaucracy and administrators",
            "title_similarity": "0.5716027",
            "sentiment_compound": 0.128
        },
        {
            "id": "gvu7u5p",
            "score": 1,
            "text": "Why so many deleted top comments?",
            "title_similarity": "0.42657283",
            "sentiment_compound": 0.2648
        },
        {
            "id": "gvu8tv1",
            "score": 1,
            "text": "Studies like this change the mind of zero Fortune 500 executives and maybe a few dozen politicians on all levels of government.",
            "title_similarity": "0.54036367",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvu9ovl",
            "score": 1,
            "text": "And yet absolutely nothing is mentioned about how high middle class income taxes are, how inflation perpetually steals wealth from the poor, and how increased government spending primarily benefits the rich.",
            "title_similarity": "0.640082",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvu9yni",
            "score": 1,
            "text": "Requiem for the American dream. \nNoah chomsky had a documentary on Netflix that basically said the same thing like 8 years ago.",
            "title_similarity": "0.36540207",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gvuaxio",
            "score": 1,
            "text": "*weaken unions* \n\nSingapore government laughing. Why weaken when you can install fake unions where its chief was the ruling party’s Minister until he lost in the recent election. And yet he retained the Union chief job, how ironic. It also runs the biggest supermarket chain that didn’t pay additional bonus to its employees when it gained a lot from COVID-19 and its local competitor did.",
            "title_similarity": "0.7072437",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gvubjdl",
            "score": 1,
            "text": "On the topic of unions it’s super important to differentiate the 2 very different paths unions took in the US and Germany independent of government legislation.\n\nIn the US when the AFL and CIO merged there was a huge debate between craft and industrial unionism. The first focused on specific craft expertise ensuring high pay and quality standards for a specific profession.  The later focused on mass unionization of everyone in one location to monopolize the labor and push up wages for everyone.\n\nThe first approach adds economic value to society by ensuring high quality work whereas the 2nd doesn’t and simply pushes money to workers with monopolistic pricing power.\n\nIn the US Craft unionism lost to industrial unionism whereas in Germany the unions are more like Craft unions where the unions care about quality standards even more than management.  The results speak for themselves.",
            "title_similarity": "0.750214",
            "sentiment_compound": 0.9601
        },
        {
            "id": "gvublu4",
            "score": 2,
            "text": "Since markets are open for free trade for goods and labor, unions have little leverage over management.  It’s relatively easy for companies to move operations to areas with less regulatory burden.  Unions thrive in organizations that are dependent to their location, like government.",
            "title_similarity": "0.4833449",
            "sentiment_compound": 0.7251
        },
        {
            "id": "gvubs00",
            "score": 1,
            "text": "Proud union member in the movie biz!  Actually I am part of 2 unions and a guild!  Amazing to be able to make a living as an artist - making art that people around the world enjoy!  My quality of life increased massively when I was able to join!  My conservative corporate friends who I grew up with despise unions.",
            "title_similarity": "0.53380436",
            "sentiment_compound": 0.9457
        },
        {
            "id": "gvuc2h2",
            "score": 1,
            "text": "Technology makes it continually easier for businesses to produce more output (goods) and make more profit, with less and less labor input required (workers’ time and wages paid). That’s always true, regardless of whatever policy steps we might take to solve this “problem.”\n\nIt definitely *is* a problem in this sense: if we are expecting the average person to receive their income from wages.\n\nIn this set up, efficiency benefits to businesses are monetary *costs* to the rest of us. Better goods production paradoxically leads to poorer people.\n\nBut what if we question that assumption?\n\nIncomes don’t have to come from jobs. They can be supplemented directly— i.e. with a basic income.\n\nThe more efficient businesses get in aggregate, and the less they need to pay people to serve as laborers, the higher this basic income could be. The more goods we could purchase, and the more free time we could enjoy. Why not? Why should we assume a normal economy requires every person report to a boss Mon-Fri, to deserve access to the economy’s goods?\n\nFraming issues like poverty and inequality in terms of its effects on *workers* is a trap.\n\nThe economy doesn’t care about workers. It’s (supposed) to be a system for distributing goods efficiently. You know: food, shelter, clothing, entertainment— all the stuff we like to buy.\n\nA sufficiently generous basic income can align what’s good for businesses, with what’s good for people. Framing everything in terms of workers is holding us all back from greater prosperity.",
            "title_similarity": "0.60613894",
            "sentiment_compound": 0.9926
        },
        {
            "id": "gvuc6tf",
            "score": 1,
            "text": "Well ya. Problem is, the loud ass politicians and big businesses through blame, and the idiots eat it all up and then go vote. For example: *gestures broadly*",
            "title_similarity": "0.5862684",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gvucus5",
            "score": 1,
            "text": "Let’s not pretend unions were blameless victims. They became so powerful and so bloated that auto assembly workers in Detroit worked 2 days on and 2 days off but got paid for all 4 days. Why wouldn’t a rational person be in favor of dismantling them!",
            "title_similarity": "0.6264061",
            "sentiment_compound": 0.7183
        },
        {
            "id": "gvudema",
            "score": 1,
            "text": "Isn't it right that people that study harder in the right subjects and progress in the right careers earn more?\nSome person investing in a career in say being a doctor should earn more than a person working in a fast food joint.\nAfter all the person studying gas maybe lost 9 years income etc.",
            "title_similarity": "0.6764785",
            "sentiment_compound": 0.128
        },
        {
            "id": "gvuejr9",
            "score": 1,
            "text": "The weakening of unions is the saddest thing and the most explicit example of people voting against their own interests. If unions were bad for employees, then employers wouldn’t spend thousands to millions of dollars to prevent them from forming",
            "title_similarity": "0.7370341",
            "sentiment_compound": -0.8271
        },
        {
            "id": "gvuepsk",
            "score": 1,
            "text": "Does anyone have the full paper for this? Thank you.",
            "title_similarity": "0.19370966",
            "sentiment_compound": 0.4357
        },
        {
            "id": "gvuevll",
            "score": 1,
            "text": "Complete lie. The social safety nets and large unions are the mechanisms used to get you to vote in your own demise. The unions are apart of the big money in politics bringing about policies that strip you of your wealth. The social safety nets are the lies the government sells you to convince you they need to steal your money, despite the fact that the social safety nets are the very thing that is killing your earning potential in the first place. All this does is facilitate the government getting to syphon whatever money out of the transaction that they want. That IS the system used to pull all of the money back towards the top.  Without this all businesses could pay you more and all labor would be more productive in an earnings capacity, multiple times over what the social \"safety nets\" provide. Literally, social security returns less than any private investments you could have made with your own money.  Medicare is used to create close to a single buyer system for healthcare which means the government single handedly gets to set the price of drugs and medical services. The same government thats in the pocket of big pharma.\n\nQuit listening to this nonsense. they're lying to get you to vote for, and support, the very thing that is destroying you.",
            "title_similarity": "0.70497435",
            "sentiment_compound": 0.1962
        },
        {
            "id": "gvuf0td",
            "score": 1,
            "text": "Why is this in the \"science\" subreddit? \n\n Anyway, in Canada it has been the opposite - social safety net is constantly getting bigger and more comprehensive, and unions getting more power.  Government unions, in particular, seem to drive more policies than the legislatures themselves!",
            "title_similarity": "0.6512085",
            "sentiment_compound": 0.6581
        },
        {
            "id": "gvuf99j",
            "score": 1,
            "text": "Don't forget the mass importantion of workers from less developed countries for the main purpose of lowering wages, reducing social cohesion, and shifting demographics in favor of The Party.",
            "title_similarity": "0.7149128",
            "sentiment_compound": 0.6207
        },
        {
            "id": "gvufw1h",
            "score": 1,
            "text": "I assume we are going to ignore globalization and China in their discussion?",
            "title_similarity": "0.6106427",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gvugc41",
            "score": 1,
            "text": "As much as I want to agree with this, it’s a **really** crappy bit of writing. It doesn’t belong on this sub and it’s depressing and that it’s got 45k.",
            "title_similarity": "0.55953795",
            "sentiment_compound": -0.5709
        },
        {
            "id": "gvuh1wl",
            "score": 1,
            "text": "Jeez, took a few courses on poverty in college and this 10 years ago and this is nothing new. Research at that time said the same...",
            "title_similarity": "0.45127633",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gvuj0gn",
            "score": 1,
            "text": "\"the economy's productivity is increasing, but people's wages are not increasing at a commensurate rate\" If prices fall with increased productivity, one can see ones purchasing power increase despite having the same wage as before.",
            "title_similarity": "0.6447352",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gvuj397",
            "score": 1,
            "text": "Cryptocurrency. Cardano. Income inequality doesn’t need to exist.",
            "title_similarity": "0.42665127",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvujnsy",
            "score": 1,
            "text": "I would have expected the housing market to be the biggest factor in the UK. I bought my house in 2010 and within a few years it had gone up in value enough that it went out of my own price range. An equivalent house on sale today in my town is now 58% more expensive than what I paid.",
            "title_similarity": "0.6112052",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvuk01k",
            "score": 1,
            "text": "I guess the rising tide only lifted all the boats in the Cayman Islands?",
            "title_similarity": "0.42010707",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvuk8cn",
            "score": 1,
            "text": "Of course it has nothing to do with science but post it anyways.",
            "title_similarity": "0.33773386",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvukn16",
            "score": 1,
            "text": "Your wage equals your bargaining power",
            "title_similarity": "0.25433296",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvul6g5",
            "score": 1,
            "text": "I’m not sure about everyone else, but I can speak for Americans by saying it is totally intentional.  This shift is 100% planned...",
            "title_similarity": "0.4120706",
            "sentiment_compound": -0.1232
        },
        {
            "id": "gvulsh8",
            "score": 1,
            "text": "We must force companies to further dilute by issuing more shares to customers and employees",
            "title_similarity": "0.6192304",
            "sentiment_compound": 0.3597
        },
        {
            "id": "gvum3lr",
            "score": 1,
            "text": "The rich are getting richer. Guess what, the poor are getting richer too. The sub is turning into drivel.",
            "title_similarity": "0.44825917",
            "sentiment_compound": 0.8074
        },
        {
            "id": "gvum5lg",
            "score": 1,
            "text": "I'll never understand how the same people who don't want to raise minimum wage are the same people that complain about people being on welfare and getting government assistance.",
            "title_similarity": "0.7087972",
            "sentiment_compound": -0.4063
        },
        {
            "id": "gvumi7t",
            "score": 1,
            "text": "**Neoliberals:**\n\n^crickets",
            "title_similarity": "0.25444904",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvun5yv",
            "score": 1,
            "text": "Well, yeah. In any company, people are responsible for setting wages based on their profits, someone makes those decisions. They *could* choose to distribute it more evenly among the workers that did a lot of the work in generating that profit, but it seems those that set the wages feel like they do 100+ times more, or are 100+ times more deserving for some reason. I don’t doubt that certain decisions they make can swing profit much higher or lower, but that seems like it’s the value of the thing they are in charge of, not the value of their own labor that makes it worth so much more, and that is based on the contributions of all the workers. Upper management of a fast food chain doesn’t sling burgers, yet everything they make is based off the work of those who do.",
            "title_similarity": "0.6237997",
            "sentiment_compound": 0.9387
        },
        {
            "id": "gvunaiu",
            "score": 1,
            "text": "Government needs to pass law that ensure livable wages. Everyone, especially the rich, needs to pay tax. Unions are not needed.",
            "title_similarity": "0.6077306",
            "sentiment_compound": 0.7251
        },
        {
            "id": "gvunl82",
            "score": 1,
            "text": "We keep insisting on giving our problems to the people who make money off of our problems.",
            "title_similarity": "0.50955033",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gvunqmk",
            "score": 1,
            "text": "This is obvious to anyone that has enough brainpower to look at society with a critical eye, although those people are sadly getting rarer by the minute.",
            "title_similarity": "0.43666923",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gvuotx0",
            "score": 1,
            "text": "Which of those countries mentioned is dismantling social safety nets?",
            "title_similarity": "0.57992905",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvuowso",
            "score": 1,
            "text": "We can agree that it’s the result of poor policy meant to make the rich richer and the poor poorer...\n\nBut can we get over this idea that unions are some bastion of morality?  Plenty of industries are dominated by unions just as corrupt, or more so, than non union leadership.",
            "title_similarity": "0.66808766",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gvuox2i",
            "score": 1,
            "text": "It just stupid suggestion.",
            "title_similarity": "0.31466523",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gvup4o8",
            "score": 1,
            "text": "Wow it's almost like money and power are constantly used to ensure the system works in your favor.",
            "title_similarity": "0.4046843",
            "sentiment_compound": 0.8836
        },
        {
            "id": "gvup858",
            "score": 1,
            "text": "I've heard it depicted as \"neo-feudalism\" and it appears to be adept. How hard would it be for apple to purchase areas of land and to in a real sense transform their grounds into its own fiefdom. I know fantastical yet the solitary divider you need to separate those inside from those external the wellbeing of the divider is a corporate ID.",
            "title_similarity": "0.65320575",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gvupa1w",
            "score": 1,
            "text": "That fact that the authors received a \"lot of backlash\" from fellow economists for daring to say that labor and business policies actually determine negative outcomes for workers tells you who most economists work for and how deeply biased they are pro-capital.",
            "title_similarity": "0.7177824",
            "sentiment_compound": -0.5563
        },
        {
            "id": "gvuq9x9",
            "score": 1,
            "text": "Not true\n\nIt's both being interconnected.  Bethlehem steel alone, in the 1940s, employed 300,000 people.  The entire steel industry today in the US employs 68,000.  \n\nUnions' power is in numbers, and the numbers are down.",
            "title_similarity": "0.46935296",
            "sentiment_compound": -0.5158
        },
        {
            "id": "gvuqbbn",
            "score": 1,
            "text": "Wait until machines replace us like horses were replaced by machines.",
            "title_similarity": "0.47415406",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvuqhk9",
            "score": 1,
            "text": "Just compare productivity with wages over the past 70 years and you'll start to wonder why countries like america \"can't afford\" universal healthcare.  More wealth than ever is being generated and yet less of it is going to the people.",
            "title_similarity": "0.6477952",
            "sentiment_compound": 0.7178
        },
        {
            "id": "gvuqm0y",
            "score": 1,
            "text": "Is growing inequality a result of class warfare by wealthy elitism?",
            "title_similarity": "0.69267285",
            "sentiment_compound": 0.25
        },
        {
            "id": "gvury4h",
            "score": 1,
            "text": "A buddy of mine said a while back.....soon there won't be any jobs at all. Just container ships from China, all brokered by Amazon.",
            "title_similarity": "0.45355612",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gvus8d0",
            "score": 1,
            "text": "Obviously, conservative policies, as usual, ruining the world slowly but surely. Add to that mix the privatisation of public services and tax reduction to the wealthy.",
            "title_similarity": "0.70121706",
            "sentiment_compound": 0.765
        },
        {
            "id": "gvus8sa",
            "score": 1,
            "text": "Welcome to the Cororate DNC.  Where politicians use social issues to appear “progressive” meanwhile just pander to large corporations.\n\nNotice under Biden administration... unions have not gotten stronger.  Amazon union hopes ... disappear.   And now corporations are suddenly for women’s rights, voting rights,  trans issues ,, etc.  It’s as if corporate safe topics are simply used to market themselves as “progressive” but any real progressive issues that impact the power structure of our nation like income inequality,  unions,  universal health care ... just get lip service and pushed to the background.",
            "title_similarity": "0.7744092",
            "sentiment_compound": 0.8779
        },
        {
            "id": "gvus93t",
            "score": 1,
            "text": "Technological progres simply provides continuously increasing gains on investments. This inevitably means those with wealth will get richer faster than those without increasing income inequality.\n\nGiven technology is destroying jobs, this cannot be fixed with unions.\n\nUBI or a similar alternative is the only viable sustainable long term solution here.\n\nThis I say as someone who will be fine with or without UBI, honestly since I will be a net tax contributor I would be better without if not for the fact society may well collapse without it.",
            "title_similarity": "0.6946999",
            "sentiment_compound": 0.7795
        },
        {
            "id": "gvusiwv",
            "score": 1,
            "text": "Even if unions were as strong as ever employers could just get around the unions by outsourcing.  The world is a lot smaller now.",
            "title_similarity": "0.62220323",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gvusqpr",
            "score": 1,
            "text": "r/science posting what people have been saying for decades",
            "title_similarity": "0.27010754",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvutyru",
            "score": 1,
            "text": "Policy decisions made by the voters through their poor elected choices as they continue decade after decade to vote for self promoting assholes.",
            "title_similarity": "0.6323189",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gvuu9pa",
            "score": 1,
            "text": "The smarter we become the more we’ll realize that working together is the logical way to achieve a healthy society and ecosystem. I hope to see the narcissism fall away from every culture that feeds inequality and ill health.",
            "title_similarity": "0.5915141",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gvuuewv",
            "score": 1,
            "text": "Rosie there can buck this rivet  mmm",
            "title_similarity": "0.16381618",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvuujc1",
            "score": 1,
            "text": "The word \"suggests\" does not mean it is a fact, ot means that it really means nothing and is unproven.",
            "title_similarity": "0.3738844",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvuuq72",
            "score": 1,
            "text": "Unions are why we have abusive police and rapist teachers.",
            "title_similarity": "0.5634466",
            "sentiment_compound": -0.8779
        },
        {
            "id": "gvuv78x",
            "score": 1,
            "text": "I think bernie Sanders could have saved you the trouble of the study",
            "title_similarity": "0.53675187",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gvuvb0j",
            "score": 1,
            "text": "If you think about it, historically technology has never been what caused inequality in human societies. It's not like everyone was equal during the Egyptian age or the middle ages... If anything the industrial revolution was the first time that workers rights were formalized. In addition technology has been a ladder for people who were part of the middle class to rise in importance and fortune. It can be a tool for oppression as well of course, but it isn't an inherent problem with technology. It's humanity.",
            "title_similarity": "0.6866574",
            "sentiment_compound": 0.5621
        },
        {
            "id": "gvuvbdz",
            "score": 1,
            "text": "No it’s from capitalism",
            "title_similarity": "0.43784922",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvuvtl6",
            "score": 2,
            "text": "Central banks and their disgusting policies are the driving factors for wealth inequality. Financial repression, fraudulent economic statistics, and mandatory currency debasement only helps the wealthy.",
            "title_similarity": "0.7268362",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gvuwhx7",
            "score": 1,
            "text": "It doesn't help when unions have turned into a profitable business whom only care about themselves.\n\nUnions used to be great and I'm sure there are some really good ones still. But many have become corrupted. Some unions who are supposed to be representing workers appear to be representing the companies themselves. This seems evident with some of the recent implementations which have negatively affected workers yet have union approval (eg removal of penalty rates etc).\n\nThere are also some unions who think they are representing workers but instead are doing them bad. One company I worked for had a union who would routinely strike for pay increase demands. They already had a decent wage. The company ended up losing contracts and shutting shop and 3000 workers became redundant in a day.",
            "title_similarity": "0.6736002",
            "sentiment_compound": -0.3782
        },
        {
            "id": "gvuworl",
            "score": 1,
            "text": "Gee who would've thought . It's almost like the entire system is rigged against the bottom 98% .  Also it's almost like republicans make it so tax breaks are great for rich people, just take that money back out of social security later . \n\nBut a tax increase !?! You are out of your damn mind , we can only lower taxes for billionaires .",
            "title_similarity": "0.6850743",
            "sentiment_compound": 0.2242
        },
        {
            "id": "gvuxew6",
            "score": 1,
            "text": "Anybody found the report without paywall?",
            "title_similarity": "0.33455616",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvuxh7f",
            "score": 1,
            "text": "in no way does rising income inequality have anything to do with rising taxes on both businesses and private citizens",
            "title_similarity": "0.5642998",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvuy8a6",
            "score": 1,
            "text": "An expected result if you don't invest in appreciating assist.",
            "title_similarity": "0.4240936",
            "sentiment_compound": -0.3412
        },
        {
            "id": "gvuyoi5",
            "score": 1,
            "text": "Nope. It is due to a massive increase in the labor force due to globalization starting in the ~70-80s. This leads to a global redistribution of wealth amongst workers across the global that has been going on ever since. Policy makers have no way to stop the consumer from buying goods and services from cheaper global sources. They could have put up tariffs, but it is hard to say if that would have done more harm than good protecting inefficiency.\n\nEntrepreneur took advantage of the trade arbitrage and ever lowing interest rates to maximize returns as governments fought the inevitable by taxing future earnings. Those entrepreneurs and smart money took their share of those inefficient handouts to enrich themselves further. Do not hate the player hate the game, they are just playing the cards dealt.",
            "title_similarity": "0.7016526",
            "sentiment_compound": 0.8076
        },
        {
            "id": "gvuyqoi",
            "score": 1,
            "text": "Arent most of you guys pro-lockdown? Why would you be surprised that stuff like this happen then?",
            "title_similarity": "0.56351835",
            "sentiment_compound": 0.5803
        },
        {
            "id": "gvuyyl1",
            "score": 1,
            "text": "Yeah spending on welfare has definitely decreased...",
            "title_similarity": "0.42499265",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gvuzij2",
            "score": 3,
            "text": "in Australia in the 1980s there were about six levels of welfare payment (youth/disability/single parent etc).  A conservative government decided to reform the sector and streamlined it to about three payments, it took millions in hiring and training staff for the review process and needed Dr reviews, to classify people.  The cost of doing it far outstripped any savings.  The result was, people on the fringes, say who had medical issues but looked okay, got demonized as the three payments didnt fit them e.g. they just needed access to cheaper meds not the full range of support services.  So in attempting to reform the sector, they made it harder for people, but, a bunch of Drs got paid lots, and, a politicial party was re-elected on the lie that their reforms were saving money - it took twenty years to realise the reforms cost more than they ever saved.  And 'the people' who needed it got less access to services...and the legacy of that broken model is still being fixed today.  Largely the safey net is back in place and people arent hunted like they were in the 1980s over welfare.  Mainstream news shows targeted kids on welfare and did stories about them - they singled families out (the paxtons)....was horrible to watch.",
            "title_similarity": "0.70467246",
            "sentiment_compound": -0.2686
        },
        {
            "id": "gvuzuca",
            "score": 1,
            "text": "No social phenomenon has a single cause, or is caused by one factor to the exclusion of other factors. If you don't believe that automation has an adverse impact on the value of unskilled labor, you're wearing ideological blinders. There is no union in the world that is going to preserve the jobs of truckers when self-driving vehicles arrive, no more than unions could preserve the jobs of bank tellers after the advent of ATMs.\n\nThat said, the principal non-technological force driving down wages of middle class is trade policy, which makes it easy for businesses to engage in labor arbitrage, substituting the labor of people in countries with a low standard of living for that of countries with a high standard of living.",
            "title_similarity": "0.6740154",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gvv0n8l",
            "score": 1,
            "text": "Says the organizations handing out other people's money.",
            "title_similarity": "0.28334028",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvv0qd6",
            "score": 3,
            "text": "Waiting for the Musk Bros to chime in with how this is cool, actually, and how we should all just accept it as the cost of cool technology!",
            "title_similarity": "0.38157913",
            "sentiment_compound": 0.7574
        },
        {
            "id": "gvv1o5t",
            "score": 1,
            "text": "Is it dumb to think we don’t have enough time data to even form a conclusion on stuff like this?",
            "title_similarity": "0.50987065",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gvv29g8",
            "score": 1,
            "text": "Why is Conan O'Brien there",
            "title_similarity": "0.24592718",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvv2ip7",
            "score": 1,
            "text": "If you can find a way for union to stop helping the very bad workers and help the good workers earn more money I would back them.",
            "title_similarity": "0.632434",
            "sentiment_compound": 0.204
        },
        {
            "id": "gvv2lr0",
            "score": 1,
            "text": "Why is this in a science subreddit?\n\nEconomics is barely a science. We don't have more than one earth with the same population and same scarcity of resources to test, measure, and compare results for changes. \n\nAnd to top it off most economists are also merely cheerleaders for some ideological stance that they support.",
            "title_similarity": "0.70046747",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gvv3c6h",
            "score": 1,
            "text": "In a rational society based on maximising happiness tech growth leads to fully automated communism\nEarth has no rational countries so it’ll never \nhappen and the average person is to stupid to stop the capitalist filth because the one time communism was tried it failed due to a lack of Automation",
            "title_similarity": "0.64732945",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gvv3thn",
            "score": 1,
            "text": "A situation where corporations will work their employees to the bone until they automate and replace you. All while telling you how lucky you are to be employed by them.",
            "title_similarity": "0.45065016",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvv4hx2",
            "score": 1,
            "text": "Yes. This. Unquestionably. 110%.",
            "title_similarity": "0.17768759",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gvv4ilm",
            "score": 1,
            "text": "Obvious thing is obvious says report about obvious thing",
            "title_similarity": "0.05510863",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvv4pw0",
            "score": 1,
            "text": "It’s not. It’s an inherent function of capitalism though.\n\nWhat technology is doing is what Fred Hampton called “heightening the contradictions.” That is, the inherent benefit behind technological advances is contradictory to the inherent clause of capitalism. Technology makes work easier and more efficient, yet capitalism is built on the most amount of work being done for the least amount of value given back to the laborer to keep profit margins as high as you can. This means capitalism embraces technology, but it provides less work opportunities for “low-skill” laborers. We don’t have an economy or education system built to figure out what to do with these people, so we stick them in “shitty” jobs and pay them like crap. That number of people keeps growing as technology replaces their jobs.",
            "title_similarity": "0.74727607",
            "sentiment_compound": 0.8372
        },
        {
            "id": "gvv52r6",
            "score": 1,
            "text": "Here I was thinking the decline of unions was due to industrial migration away from labour intensive manufacturing towards technology intensive manufacturing.",
            "title_similarity": "0.6963472",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvv5eaf",
            "score": 1,
            "text": "yeah and letting billionaires take way more then they give.",
            "title_similarity": "0.43592897",
            "sentiment_compound": 0.296
        },
        {
            "id": "gvv5fy6",
            "score": 1,
            "text": "Wait until robotics and ai become mainstream. They wont need humans for physical labour anymore and we will either have world war 3 or some mass disease that will take out 70% of the population. Just my wild conspiracy theory guess",
            "title_similarity": "0.66593504",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gvv5hub",
            "score": 1,
            "text": "This has been true since the invention of steam power and early capitalism.",
            "title_similarity": "0.2641133",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvv5v66",
            "score": 1,
            "text": "Sounds like people have never heard of the Matthew principal or studied history. \n\nIncome inequality ≠ bad life for the bottom either.",
            "title_similarity": "0.6497035",
            "sentiment_compound": -0.25
        },
        {
            "id": "gvv5xt3",
            "score": 1,
            "text": "Bet the study was conducted by people whove never built a business",
            "title_similarity": "0.36735806",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvv60xk",
            "score": 1,
            "text": "when was anyone ever arguing that technology was the contributor to income inequality. The tools that wealth is made with has nothing to do with how we allocate that wealth....",
            "title_similarity": "0.65931857",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gvv68zc",
            "score": 1,
            "text": "Inequality is growing in Denmark too where we have strong unions and good social safety net.",
            "title_similarity": "0.5630359",
            "sentiment_compound": 0.8658
        },
        {
            "id": "gvv6djt",
            "score": 1,
            "text": "I was very surprised this was on r/science and not /r/YangForPresidentHQ",
            "title_similarity": "0.48996407",
            "sentiment_compound": 0.2944
        },
        {
            "id": "gvv6ejx",
            "score": 1,
            "text": "Unions tend to reduce production and cause random strikes. It conveniences not just the business owner, but the public too.\nPeople not happy with their jobs should leave/switch.\nCurrent population levels make it hard to do so, but that's the way forward looking into the future.",
            "title_similarity": "0.6891204",
            "sentiment_compound": -0.7466
        },
        {
            "id": "gvv6v8j",
            "score": 1,
            "text": "The root cause of wealth inequality is money printing. Money printing causes inflation which hurts those living paycheck to paycheck by slowly eroding their purchasing power over time while those who can hold their wealth in hard assets are able to avoid the effects of inflation. As money printing continues the wealth gap grows larger. Helicopter money will only make inflation worse as more and more money chases after scarce resources. Further eroding the purchasing power of the working class while those who hold hard assets see the demand and therefore the value for those assets go up against a currency that keeps getting debased. \n\n[https://wtfhappenedin1971.com/](https://wtfhappenedin1971.com/)",
            "title_similarity": "0.74538577",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gvv70i8",
            "score": 1,
            "text": " If only there were people that would have talked about this sooner... Someone should start a political movement to stop this. Something about empowering labourers and increasing social security. If only there were a part of the political spectrum that would cover ideas like that...",
            "title_similarity": "0.67173254",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gvv766i",
            "score": 1,
            "text": "Maybe it's just because people are lazy",
            "title_similarity": "0.42413554",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gvv8evk",
            "score": 2,
            "text": "It’s not surprising. The only thing the poor can do is live the rest of their life in poverty and die in poverty.",
            "title_similarity": "0.3773269",
            "sentiment_compound": -0.9373
        },
        {
            "id": "gvv96i6",
            "score": 1,
            "text": "Unequal is wealth is better than equal poverty",
            "title_similarity": "0.47133315",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gvv9o8q",
            "score": 1,
            "text": "may i suggest that sorted mating and  advancing of women in the work force can explain almost all of the rising income i quality among house hold. globalization is another one.",
            "title_similarity": "0.4835509",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvv9qhd",
            "score": 1,
            "text": "Shocker. Having an economic system that allows owners to exploit their workers and simultaneously dictate the legislation that is passed leads to wealth inequality",
            "title_similarity": "0.66395825",
            "sentiment_compound": 0.296
        },
        {
            "id": "gvv9r6a",
            "score": 1,
            "text": "As long as there is money in politics it will never change.",
            "title_similarity": "0.3179107",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvva30k",
            "score": 1,
            "text": "Buy yourself some GME, it’ll pay off a lifetimes worth of salary",
            "title_similarity": "0.43026072",
            "sentiment_compound": 0.128
        },
        {
            "id": "gvvadrb",
            "score": 1,
            "text": "Unions do so much good for wages. I worked non union jobs for years and I got raises because the unions fought for better wages and my employer had to up ours to keep us.",
            "title_similarity": "0.52918875",
            "sentiment_compound": 0.5829
        },
        {
            "id": "gvvam43",
            "score": 1,
            "text": "Looks almost like that German couple was rights. I can't recall their names, the ones that said that capitalism is inherently exploitative and is directly stealing from the workers; and workers should instead get the totality of their work.",
            "title_similarity": "0.72755325",
            "sentiment_compound": -0.3597
        },
        {
            "id": "gvvb83g",
            "score": 1,
            "text": "> Rising income inequality is not an inevitable outcome of technological progress\n\nWho the hell thought that? I have heard it kills jobs/industrys but never anyone put forward it causes income inequality anywhere, even reddit...and heard people blame a spaghetti  mknter for all the worlds ills here",
            "title_similarity": "0.72871506",
            "sentiment_compound": -0.7391
        },
        {
            "id": "gvvb9bd",
            "score": 1,
            "text": "And it won’t change, the poor pay more taxes than anyone, why would the politicians vote away their pay check.",
            "title_similarity": "0.6107273",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gvvbc76",
            "score": 1,
            "text": "Noam Chomsky has been saying this for 30 years.",
            "title_similarity": "0.1005183",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvbvru",
            "score": 1,
            "text": "And why was it possible to make those policy changes? Technological progress. It’s fundamentals all the way down.",
            "title_similarity": "0.60111797",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gvvc8lm",
            "score": 1,
            "text": "Rising inequality is an inevitable outcome of capitalism",
            "title_similarity": "0.6205301",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvci7j",
            "score": 1,
            "text": "People don't understand that it's a fact of nature and life that in every endeavor there are a tiny number of high performers, and a vast majority of basically terrible performers.\n\nMost companies fail. A tiny number succeed. The top people in academia are incredibly exceptional. The vast majority don't even come close. The best NBA players are so talented that even the best college player will likely go 0-100 against any one of them 1-on-1.\n\nThe world is simply designed to create a huge gap between success and failure. I think it has something to do with how being brutal about success and failure ensures that all living species can continue.\n\nOur personal inclinations to \"save people\" is quite unusual and unique. It's more of a high consciousness thing we do. It's not necessarily \"correct\" any more than we should make all the lions into vegetarians in order to protect the zebras.\n\nHumans have empathy for other humans, and we don't want people to suffer. But we can't ignore the fact that there will always be a small number of people who are better able to manipulate the system. By the very fact that they are smarter. You can't \"undo\" this with policies or government or anything else because anything you create, smart people will outsmart it.\n\nIn the gut of every parent raising a child, they know this is true. It's why we encourage our kids to do well in school. We know the benefits of education and being smart.",
            "title_similarity": "0.61215675",
            "sentiment_compound": 0.989
        },
        {
            "id": "gvvcj3r",
            "score": 1,
            "text": "I haven't read the article so I cannot critique it, but FWIW this article was published in a Sociology journal, not an Economics journal.\n\nEdit: typo",
            "title_similarity": "0.5403264",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvd7i0",
            "score": 1,
            "text": ">**Rising income inequality is not an inevitable outcome of technological progress, but rather the result of policy decisions to weaken unions and dismantle social safety nets, suggests a new study of 14 high-income countries, including Australia, France, Germany, Japan, UK and the US.** \n\nWe call that end stage capitalism.  The system our parents and grandparents grew up in has been greatly bastardized and twisted.  It's just imperialism with a bunch of feel good woke labels.",
            "title_similarity": "0.9503195",
            "sentiment_compound": 0.0799
        },
        {
            "id": "gvvdddy",
            "score": 2,
            "text": "They’re deciding to have a bloody revolution",
            "title_similarity": "0.47448808",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gvvdho0",
            "score": 1,
            "text": "That 44% of the loss is from outsourcing is startling. Call it nationalism if you like, but an elected official has more obligation to his constituents than to foreigners and should not weigh the wellbeing of the two equally when making economic policy.",
            "title_similarity": "0.78345025",
            "sentiment_compound": 0.0644
        },
        {
            "id": "gvvdrk5",
            "score": 1,
            "text": "China is afraid its people. But we are not.  We will continue the inequality. WE ARE NOT AFRAID.",
            "title_similarity": "0.5972762",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvehj0",
            "score": 1,
            "text": "Can someone give me an argument on why income inequality is intrinsically bad ?\n\nPoverty is intrinsically bad. Obviously.\n\nBut let’s assume that the the less rich person in the world has the purchasing power of a 2021 Californian making 50.000 usd/year. How is that person worse off than someone making 10.000.000 usd/year?\n\nObviously we are pretty far off that case, just putting up an extreme case to discuss why income inequality would be intrinsically bad.",
            "title_similarity": "0.7040614",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gvveoag",
            "score": 1,
            "text": "At least in the US, several professional unions are as strong as ever. The AMA for example continues to be successful at dramatically increasing income inequality (U.S. doctors average compensation is $300k).  \n\nOther policy choices that aren't mentioned here are the dramatic explosion in patents during the 90s. Apple and its employees are heavily compensated partially because it is illegal to make and sell a similar phone without paying Apple hundreds of dollars per device for use of their software patents, a class of patents which simply did not exist prior to the 90s. Second, the dramatic increase in licensure requirements locking most workers out of most fields of work. Finally, the dramatic increase in government regulation which has dramatically increased barriers to entry and therefore income inequality (when so many jobs require expensive education by law, those that cannot afford such will face far lower wages).",
            "title_similarity": "0.66321045",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gvvf4ju",
            "score": 1,
            "text": "Oh I'm sorry, I thought this was /science and not /politics",
            "title_similarity": "0.43857408",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gvvfzwh",
            "score": 4,
            "text": " Almost every banking system across the world has governments printing money and buying it's own securities as a way to keep the cash flowing. When people talk about socialism they do not understand that we are already a socialist country. A..The entire idea of free market system collapsed in 2008 as to big to fail meant that the world system could not allow the consequences of years of corporate greed on the social fabric of western culture. We're talking Mad Max..no exaggerating.  So the deal was made  that  government was supposed to bail out the system for a short time. As of April of 2021, the Fed, the central EU bank, the UK are all printing billions and billions of dollars every month  in \"Quantitative Easing\" to allow this system to keep going B... The problem is that there is nothing tied to the value of our money except the faith in the American Government to back the dollar. This faith in the dollar makes the American currency basically the fiat currency of the world. So the entire economic system is basically based on the stability of the social fabric of the  US. This should scare any thinking person to death. Social inequality is the result of policy decisions based on the power of tech companies to buy the outcome they want and to absolutely avoid paying thier fair share of income. Uber and lyft winning the ballot proposal in Cal so thier drivers be excluded from being employees and only a 7/8th legislative majority can over turn it is a prime example. These companies buy the law  and then tell you how great they are making your life while operating massive warehouses and paying the employees nothing. The governments  have pay for the healthcare, the social costs, Everything. This way of life where the government subsides the elite and then panders to special interests has absolutely destroyed the social fabric and sustainability of our lives. If you noticed, more and more retail chains vanish and our choices are limited to major corporations and thier distribution systems. Those of you who are young will live to see food shortages, medicine shortages, and lack of things you took for granted. Amazon should frighten you. Our dependency on a few companies controlling everything and our government system being in sync with corporate culture has astonished me at the speed it's happened.",
            "title_similarity": "0.74307317",
            "sentiment_compound": -0.2115
        },
        {
            "id": "gvvg0l6",
            "score": 1,
            "text": "In the realm of Corporal Obvious here...",
            "title_similarity": "0.054737467",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvgf81",
            "score": 1,
            "text": "Hm... So the dismantling of aspects of society put in place to prevent a specific problem result in the return of said specific problem. Go figure.",
            "title_similarity": "0.57979715",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gvvgkuv",
            "score": 1,
            "text": "It's interesting that a lot of the anger and outrage here is directed at the companies, rather than the local, state and federal laws (and the politicians that pass them) that not only enable these things, but often encourage them. \n\nEven arguing that these companies frequently manipulate, and outright buy politicians, it doesn't excuse the politicians for going along with it. No one's holding a gun to their heads.\n\nI think people react like this, because for most of us, it seems easier to do something about corporations than governments. But when you think it through, other than boycotting, our only power over them is through legislation. Which brings us back to the source of the problem: government. \n\nOur politics are badly broken. And out of control corporations have contributed to it, but are mostly just taking advantage of it.\n\nMy personal opinion, is that completely removing money or goods or favors, from politics, is the only way to begin reforming broken government - thereby removing the influence that corporations have over legislation and us.",
            "title_similarity": "0.70030403",
            "sentiment_compound": -0.9519
        },
        {
            "id": "gvvgsm8",
            "score": 1,
            "text": "It’s not “survival of the fittest” anymore...it’s survival of the richest.",
            "title_similarity": "0.41341826",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gvvgv09",
            "score": 1,
            "text": "Unions have outlived their usefulness for a century now. There is a reason why companies left the rust belt, why pay someone double because they Eli g to a union when you can pay someone half as much and get the same product. I live in the south, factory jobs pay better than other jobs (outside of jobs that require a college degree) without unions. \nUnions shouldn’t be allowed to donate money to political parties just like corporations should be banned.",
            "title_similarity": "0.70629615",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvvgxuf",
            "score": 1,
            "text": "Yea it's no coincidence that inequality rose dramatically in the 80s at the same time that neo liberalism was destroying the post war consensus welfare state and working class organizations like unions.\n\nNeo liberalism was and is a political movement to reestablish capitalist class power to roll back what ever gain's the working class did make post WW2",
            "title_similarity": "0.7443927",
            "sentiment_compound": -0.802
        },
        {
            "id": "gvvhkbn",
            "score": 1,
            "text": "It was called Reaganomics and we knew this to be true 40 years ago.  Glad the brainiacs have caught up.",
            "title_similarity": "0.29844555",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gvvi9xr",
            "score": 2,
            "text": "Not an inevitable outcome of technological progress but one of capitalism.",
            "title_similarity": "0.6292832",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gvvj04p",
            "score": 1,
            "text": "Income inequality is a result of unchecked population growth.  The reality is, pour people are breeding faster than everyone else, by a large margin.",
            "title_similarity": "0.5533278",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gvvkt6g",
            "score": 1,
            "text": "I don’t think you are drawing the connection between technology and alienation from specialized labor. The inherent nature is that technology and removes the barrier of expertise that enables laborers to demand a higher wage for their work and hence removes collective bargaining that those in the working class had in the attainment of wages.",
            "title_similarity": "0.72291887",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvvldf7",
            "score": 2,
            "text": "In the U.S., much of the Deep South was under the thumb of cotton/textile mills for decades (this was true in the Northeast earlier). It was only dissolved when they took textile manufacturing overseas. Generations lived in mill-owned housing, some paid workers in mill script good only in the company store. The company even owned the churches. It was ugly. Union organizers were either chased from mill towns or worse. \nOrganized labor's stumbles over the last 70 years can be righted. There is no good outcome to a return to mill towns.",
            "title_similarity": "0.61529034",
            "sentiment_compound": -0.4777
        },
        {
            "id": "gvvledk",
            "score": 2,
            "text": "If income inequality exists, policy can change it",
            "title_similarity": "0.54294336",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvnbc9",
            "score": 1,
            "text": "At the rate we’re currently going, both sides of the spectrum: rich & poor are in for a rude awakening.",
            "title_similarity": "0.5131423",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gvvokdf",
            "score": 1,
            "text": "Everyone under the 1% will always be a slave to the establishment that's just how the world works sadly and there's nothing we can do about it because policy after policy is going to be enforced and the poor are only going to get poorer.",
            "title_similarity": "0.6339644",
            "sentiment_compound": -0.8126
        },
        {
            "id": "gvvoygh",
            "score": 1,
            "text": "Low wages.  No chance to get ahead because you can't save enough to buy a house, which is really how to improve your economic status. A home provides security, builds equity, but requires a down payment most people can't come up with,  no matter howx hard they work.",
            "title_similarity": "0.6393031",
            "sentiment_compound": -0.1688
        },
        {
            "id": "gvvp4na",
            "score": 1,
            "text": "Why is this in *science* sub?\n\nIncome (I think you mean wealth) inequality is a possible symptom, if not inevitable.  With no progress we are all as poor as can be, so you are right, with a society lacking all productivity we all equally starve to death.  With progress we need to figure out the beneficiaries of the progress.  Both beneficiaries of the creation of the reason for progress and the beneficiaries of the results. And it is hard, and maybe not reasonable to make sure that is entirely equal.",
            "title_similarity": "0.7505735",
            "sentiment_compound": 0.8679
        },
        {
            "id": "gvvpnik",
            "score": 1,
            "text": "It is almost if capitalism is anti scientific",
            "title_similarity": "0.6391505",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gvvrk1p",
            "score": 1,
            "text": "This is basically what I tell people who oppose social engineering (yes, mostly family).  \n\n\nWe're already highly social engineered, and if someone doesn't act out to engineer the world as they value it to be, someone else will. Someone else IS.",
            "title_similarity": "0.72179055",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvvsqau",
            "score": 1,
            "text": "Oh so... sort of an empirical derivation of the Marxist hypothesis",
            "title_similarity": "0.4219686",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvtri7",
            "score": 1,
            "text": "Anti capitalism\n\nPro china. \n\nPro communism\n\nOur OP.",
            "title_similarity": "0.5904113",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gvvvge1",
            "score": 1,
            "text": "I remember subscribing and reading the science subreddit because it had science in it.  And now we get this garbage.  Is there like a \"true science\" or \"real science\" instead of these agenda driven dubiously sourced material?",
            "title_similarity": "0.5749508",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gvvxlj5",
            "score": 1,
            "text": "I mean...Were there any arguments to prove that the cause is tech progress?..",
            "title_similarity": "0.5047746",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gvw1jhg",
            "score": 2,
            "text": "There’s nothing wrong with capitalism as long as it’s properly controlled. Same with any system, communism, socialism. They all work. It’s human greed (for power/money) that gets in the way.",
            "title_similarity": "0.45963144",
            "sentiment_compound": -0.0377
        },
        {
            "id": "gvw1ywx",
            "score": 1,
            "text": "Good article but fails to address the ease of offshoring jobs or the affects of huge influxes of immigrants, both legal and otherwise.\n\nStronger unions will just drive that many more jobs into the arms of cheap labor waiting offshore and pouring over the border.",
            "title_similarity": "0.7330136",
            "sentiment_compound": 0.8225
        },
        {
            "id": "gvw22q6",
            "score": 1,
            "text": "Political Science isn’t science",
            "title_similarity": "0.40439487",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvw2h75",
            "score": 1,
            "text": "Software engineers make too much. Govt should cap their pay and equity.",
            "title_similarity": "0.6661285",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gvw3lrn",
            "score": 1,
            "text": "It’s the result of central banking and modern monetary theory primarily but cool",
            "title_similarity": "0.519337",
            "sentiment_compound": 0.4497
        },
        {
            "id": "gvw3mel",
            "score": 1,
            "text": "Quite interesting indeed",
            "title_similarity": "0.054906886",
            "sentiment_compound": 0.4576
        },
        {
            "id": "gvw3zzm",
            "score": 1,
            "text": "What if I told you, that taking more of our money to fund the social safety nets while the big money takes a cut for providing the service, is the reason we are broke. Not the other way around. If you keep more of your money your less broke.",
            "title_similarity": "0.6611018",
            "sentiment_compound": -0.5584
        },
        {
            "id": "gvw41mw",
            "score": 1,
            "text": "Stop buying from Amazon and big corporations.",
            "title_similarity": "0.564528",
            "sentiment_compound": -0.128
        },
        {
            "id": "gvw4d2y",
            "score": 2,
            "text": "This seems like it’s trying to cover for big tech and automation. \n\nRising home prices, stagnated wages, decline in marriage rates, growing power of monopolies is leading to the wealth gap. \n\nHas much more to do then dismantling safety nets and unions.",
            "title_similarity": "0.7689427",
            "sentiment_compound": 0.8481
        },
        {
            "id": "gvw4l66",
            "score": 1,
            "text": "I fully support liberal ideas. Higher wages, affordable healthcare and education, etc. \n\nHowever there will always be income inequality and that's OK. It is absolutely made worse by technological advancements. Obviously the more people you can do business with the more potential there is to earn money and that wasn't so easy 50+ years ago. \n\nIt should *never* matter how much the guy on top is making as long as the guy at the bottom is being treated fairly. If he's not, yeah, we need to do something. But if you make a fair wage and can afford a modest life and your boss makes a trillion dollars a year - so what?",
            "title_similarity": "0.7022852",
            "sentiment_compound": 0.1685
        },
        {
            "id": "gvw5pim",
            "score": 2,
            "text": "Equity needs hard work and social cooperation. Society is for everyone. The rick forget how much infrastructure and wuality of life improves the whole city and society in general for a better coexistance. Why is that a bad thing, why is there such wealth dispraportion and powerty, mass incrasaration and non community based policing practices. Australia i say has been on the better path, police are far more polite and respectful and appear at least to be held to public scrutiny, but hrdly anything ever truely happens to them. My 2c worth, but its no brainer to grow the benifits for the benifit of society as wealth, prosperity and technology grows humanity. Banifits shouldnt be going backwards. As they have been under nioliberalism.",
            "title_similarity": "0.66061115",
            "sentiment_compound": 0.7953
        },
        {
            "id": "gvwap58",
            "score": 1,
            "text": "Who said that income inequality was an inevitable outcome of technological progress?  Its fundamentally an outcome of unchecked greed!",
            "title_similarity": "0.71117735",
            "sentiment_compound": 0.1007
        },
        {
            "id": "gvwaz0t",
            "score": 1,
            "text": "Or ya know, we are too good at keeping people alive nowadays and there are just too many peasants.   Back in the day if you were lazy you starved and died.  Nowadays they give you all sorts of money to be a POS drain on society.",
            "title_similarity": "0.49932516",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gvwg83h",
            "score": 1,
            "text": "\\> using industry-level data for 14 Organisation for Economic Co-operation and Development (OECD) countries \n\nOh so not Singapore, which has more inequality than the US and a high unionization rate, all with few if any of the problems commonly claimed to be due to excessive inequality.\n\n\\>Saying it's \"our\" money implies something close to an uniform contribution to the pot\n\nOkay this is because the labor pool grows incommensurately with the demand for labor. It isn't an equal pay issue.",
            "title_similarity": "0.7905394",
            "sentiment_compound": -0.2509
        },
        {
            "id": "gvwhvgk",
            "score": 1,
            "text": "That's just loser speak for being crushed by smart champions like me",
            "title_similarity": "0.5098274",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvwoioe",
            "score": 1,
            "text": "Isn't it more to do with ignorant taxation?\n\nTax system is designed to tax individuals but automation technology is replacing people and not incurring any tax.\n\nCompanies are getting actively rewarded for replacing people when logically an automation tax should be put in place to ensure the government still receive money for the loss of income from no longer having a person in that job paying tax... \n\nDoesn't really work in a free trade economy as business will just move over seas...",
            "title_similarity": "0.6940228",
            "sentiment_compound": 0.8689
        },
        {
            "id": "gvwq6vj",
            "score": 1,
            "text": "Income inequality? Tf? **Yeah so what?** Ah my boy europe is still trying to be socialist after that has already failed flat on it's face, in every single country that attempted it. It's only been few decades and people have already forgotten about the history. It's sad☹️",
            "title_similarity": "0.59079313",
            "sentiment_compound": -0.8418
        },
        {
            "id": "gvwqkz1",
            "score": 1,
            "text": "Income inequality is a failed Marxian concept.  All that matters is minimum income or wealth levels.  The best form of support is a job.  Growing economies are the best way to eliminate poverty coupled with sensible social welfare support",
            "title_similarity": "0.6520355",
            "sentiment_compound": 0.9042
        },
        {
            "id": "gvwumq9",
            "score": 1,
            "text": "Technological progress was supposed to go hand-in-hand with appropriate taxation of firms to establish a strong social safety net. That kind of advocacy goes back to the Industrial Revolution. Obviously, that didn't happen because business decided the best option for the bottom line was to rent politicians and carve massive loopholes in tax codes.",
            "title_similarity": "0.7857087",
            "sentiment_compound": 0.9201
        },
        {
            "id": "gvwuzr2",
            "score": 2,
            "text": "It's an inevitable outcome of capitalism. Ever worsening wealth inequality is a direct flaw of capitalism, whereas political inequality is just the wealth inequality representing itself in politics.\n\nIt has nothing to do with technological progress. Technology is a blunt tool entirely subservient to its users. Until we get sentient AIs. Then we'll serve as biomass for their reactors.",
            "title_similarity": "0.70925987",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gvxt0jb",
            "score": 1,
            "text": "You can buy a new iPhone in your country for $1000 or you can manufacture it in your country for $1 an hour but you can’t do both.",
            "title_similarity": "0.5904844",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvxtrb0",
            "score": 1,
            "text": "It's your fault your government represents and protects corps.",
            "title_similarity": "0.59457207",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gvyl6op",
            "score": 1,
            "text": "This isn't the first time a study has concluded such findings. I wish the US government would pay attention and rike back anti union laws that started under Reagan unward as well as repealing all right to work laws",
            "title_similarity": "0.7483034",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvymsdp",
            "score": 2,
            "text": "It’s the result of the government tirelessly printing money, which devalues the dollar, increasing the monetary value of assets held by the wealthy. \n\nThis isn’t about unions. It’s about how myopic Congress is.",
            "title_similarity": "0.6976739",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gvyquzu",
            "score": 1,
            "text": "Sociology isn’t science....",
            "title_similarity": "0.35702577",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw64bam",
            "score": 1,
            "text": "Or, and hear me out, its a function of the removal of sound money from our global economy (sound money being money backed by limited assets, historically gold and silver), resulting in inflationary pressures that benefit the largest holders of assets and punish prudent savers and low/middle classes.\n\nIf you need recent evidence, look at how the \"COVID recovery cash\" has funneled directly into the top 0.01%. Alternatively, look at how the number of US millionaires has gone from about 10 million people to 50 million people in the past 10 years.",
            "title_similarity": "0.7043084",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gw6oxs8",
            "score": 1,
            "text": "Wealth is distribute incredibly more equitably than at any other point in history. Technological progress was never in question.\n\nThis sounds more like propaganda than science.",
            "title_similarity": "0.5001873",
            "sentiment_compound": 0.759
        },
        {
            "id": "gxy11j7",
            "score": 1,
            "text": "This has almost nothing to do with unions and safety nets and almost everything to do with central banks.",
            "title_similarity": "0.41950518",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxy5tq2",
            "score": 1,
            "text": "Sounds like the Divergent movies broken into 5 fractions.",
            "title_similarity": "0.25609347",
            "sentiment_compound": -0.1531
        }
    ]
}