{
    "A large, longitudinal study in Canada has unequivocally refuted the idea that epidural anesthesia increases the risk of autism in children. Among more than 120,000 vaginal births, researchers found no evidence for any genuine link between this type of pain medication and autism spectrum disorder.\n": [
        {
            "id": "gvux50y",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.45049444",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gvvlmh1",
            "score": 1,
            "text": "I have a son with Autism... my wife couldn't get an epidural because the person who gives it was dealing with other people.\n\nI guess if I heard it could have, it may have given me something to blame later in life.",
            "title_similarity": "0.6545123",
            "sentiment_compound": -0.34
        },
        {
            "id": "gvvkh1k",
            "score": -6,
            "text": "Autism is a genetic disease that you inherit. Nothing else causes autism. I guess unless there’s some way to make a recessive gene dominant.\n\nEdit: Ok nvm. I guess there’s more to than just recessive genes\n\nEdit: Ok please forget everything I said. I was wrong.",
            "title_similarity": "0.6087777",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gvvj4tn",
            "score": 1,
            "text": "Wait, people actually think this? Ha! Hahahahahaha! Man, there is no limit to the human imagination. Definitely something I've learned in the past few years.",
            "title_similarity": "0.32148665",
            "sentiment_compound": 0.2695
        },
        {
            "id": "gvvncd3",
            "score": 0,
            "text": "Never heard of this. Even from my anti vaxer, natural birth loving, placenta eating, knuckle head friends.",
            "title_similarity": "0.5477337",
            "sentiment_compound": 0.802
        },
        {
            "id": "gvvksig",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.095294945"
        },
        {
            "id": "gvv8zhd",
            "score": 18,
            "text": "meanwhile, common name brand baby food has been found to contain lead.  What if lead poisoning causes brain damage?",
            "title_similarity": "0.51811135",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gvvarmf",
            "score": -17,
            "text": "If we were to place bets with the assurance that an undeniable root cause would eventually be found, and with the assumption that most cases of **the more functional** examples of ASD were caused by external factors, my money would be on an imbalance in the gut microbiome.\n\n*Edit, since perhaps my comment seemed negative, as opposed to a genuine and somewhat informed opinion based on my search to understand my own place on the spectrum, here are some of the recent sources that have led me to this conclusion:*\n\nhttps://www.nature.com/articles/s41380-020-0778-5\n\nhttps://www.sciencedaily.com/releases/2019/05/190530101143.htm\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC7848646/",
            "title_similarity": "0.44759154",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gvviljq",
            "score": 2,
            "text": "You can throw all the data you at them. It won't matter. Best case you will get the people on the fringe.",
            "title_similarity": "0.16932562",
            "sentiment_compound": -0.5334
        },
        {
            "id": "gvwrgdd",
            "score": 0,
            "text": "If men had babies 100% of them would be getting an epidural if time allowed.",
            "title_similarity": "0.49572963",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvw0hrr",
            "score": 2,
            "text": "When are Antivaxxers going to be declared what they really are? A hate group for autistic people.",
            "title_similarity": "0.4619043",
            "sentiment_compound": -0.6077
        },
        {
            "id": "gvvpvt8",
            "score": -17,
            "text": "I'd be looking at their sugar rich diets instead.",
            "title_similarity": "0.27111626",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gvvhteg",
            "score": 46,
            "text": "I'll say it again and again, as someone with Autism who can more clearly define what his issues are than a lot of his peers; I strongly believe Autism is caused not by vaccines, not by any sort of birth issue but by a dysfunction within the brain itself. \n\nLeading theory for me is that the neurons fire off in a way different pattern than \"normal\" people and the regions are maybe used in a slightly different way.\n\nMy dad liked to go after vaccines clinics (for causing my autism) when I was a baby but knowing his personality, I think he only did that to try and get money from them.",
            "title_similarity": "0.68363404",
            "sentiment_compound": -0.1415
        },
        {
            "id": "gvvhslf",
            "score": -23,
            "text": "Try looking at the hormones the put in our foods!!!!",
            "title_similarity": "0.30499464",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvqnyp",
            "score": -11,
            "text": "Look into pesticides on our produce and report back to us",
            "title_similarity": "0.2270625",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvtucl",
            "score": 36,
            "text": "Also why is being autistic so demonized... it’s really not a bad thing. It makes actually autistic people feel ashamed fir being who they are... I’m autistic, trust me...",
            "title_similarity": "0.36795783",
            "sentiment_compound": 0.5129
        },
        {
            "id": "gvvulvu",
            "score": 3,
            "text": "Are we now looking for a list of things to that don’t cause autism, instead of learning to understand people with autism?",
            "title_similarity": "0.37260914",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvwglb6",
            "score": -3,
            "text": "They already know bacterially induced brain damage is what causes autism.\n\nLow immunoglobulin count usually through lack of breast milk in favour of formula [allows infections into the brain and causes damage.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6086890/#:~:text=The%20identification%20of%20brain%2Dtargeted,for%20some%20children%20with%20ASD.)\n\nAutism is just brain damage sorry not sorry 90% improvement rate in infants treated cannot be ignored.\n\nDon't let anti breast feeding campaigns by pharmaceutical companies tell you that your body is inedequate.",
            "title_similarity": "0.6426817",
            "sentiment_compound": -0.7604
        },
        {
            "id": "gvv00l2",
            "score": 64,
            "text": "TIL Babies born by C-section are known to have higher rates of autism. Is that just due to C-sections being more common with older mothers?",
            "title_similarity": "0.556093",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvqiyk",
            "score": 0,
            "text": "Genuine Leather is not real leather! Just saying.( We took epidural.)",
            "title_similarity": "0.40400973",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvw3fva",
            "score": 0,
            "text": "Did people really just grow up and start blaming every thing that is normal for autism? Everything I’ve read on the topic of autism seems to say the “rise” in autism is more attributable to just misdiagnosing kids with autism or to the fact that more women than ever are having kids at an older age. I feel like I’ve found more evidence for those two things than any evidence that suggests vaccines or epidurals cause autism. Is it social media’s fault? It’s troubling when I start to see pretty intelligent people I’ve known for years start to believe vaccines are harming us.",
            "title_similarity": "0.67623055",
            "sentiment_compound": -0.6868
        },
        {
            "id": "gvwt3bs",
            "score": 0,
            "text": "\"Genuine link\" is not a very scientific way of putting it",
            "title_similarity": "0.34380805",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvwunmw",
            "score": 0,
            "text": "Cool, now do studies linking autism with the date of birth, the parents political alignment, their taste in fruits or the number of decimals of pi they can correctly cite ...",
            "title_similarity": "0.52143526",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gvx6de0",
            "score": 0,
            "text": "Because the research was retrospective, it could not confirm causation, and doctors were quick to point out just how many confounding factors were unaccounted for.\n\nFrom the study. Headline not matching the study.... not in the science sub!!",
            "title_similarity": "0.732303",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvvvy3",
            "score": 10,
            "text": "Why do people keep attaching things like this or vaccines to autism and not things like pestcides or micro plastic?",
            "title_similarity": "0.61701584",
            "sentiment_compound": 0.1002
        },
        {
            "id": "gvvesaf",
            "score": 44,
            "text": "Would be cool if the witch hunt on what made me me could just stop. Let the scientific community spend their time on figuring out what causes autism instead of having to react to idiots who want to eradicate the condition at any cost.",
            "title_similarity": "0.55007374",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gvvmvon",
            "score": -1,
            "text": "Is it clear at this point that pitocin is also exonerated?",
            "title_similarity": "0.18911128",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gvvog18",
            "score": 1,
            "text": "This is why science deniers use moving goal posts. If it's not this they'll move on to something else like the doctors gloves have powder that obviously causes autism.... then when they forget or think you've forgotten they'll blame epidural again",
            "title_similarity": "0.61041224",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gvvouyp",
            "score": 1,
            "text": "Had me concerned in the first half. Ngl",
            "title_similarity": "0.13144836",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvrce6",
            "score": 1,
            "text": "There are pros and cons of epidurals, but the risks and downside are maternal. I decided not to get epidurals for labor, but I kept the option open since the pros can sometimes rapidly outweigh the cons once labor starts.",
            "title_similarity": "0.5568352",
            "sentiment_compound": -0.631
        },
        {
            "id": "gvvtyj3",
            "score": -1,
            "text": "yeah, everyone knows it's societal problems that cause autism (or lack of acceptance thereof) I'd always say it's a gateway to opioid abuse or addictions.",
            "title_similarity": "0.5378258",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gvvud6d",
            "score": 1,
            "text": "3 kids here no epidural with any ...last child has high functioning autism I’m pretty sure my husband has it just never diagnosed they both have many similar quirks",
            "title_similarity": "0.7212433",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gvvvke8",
            "score": 1,
            "text": "Nice as it is to know yet another procedure isn't accidentally responsible for a lifelong condition, it would be nicer to have found an avoidable cause.",
            "title_similarity": "0.28137863",
            "sentiment_compound": 0.6979
        },
        {
            "id": "gvvxttp",
            "score": 1,
            "text": "Why is this even a question...? Once the baby is birthed it is as developed as it's going to be.....",
            "title_similarity": "0.2798397",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvwcneu",
            "score": 1,
            "text": "Parents of autistic children will never stop trying to find some externality to blame. It’s incredible.",
            "title_similarity": "0.44135296",
            "sentiment_compound": -0.1311
        },
        {
            "id": "gvwfqx2",
            "score": -1,
            "text": "Finding no evidence isn't the same as 'unequivocally refuting' . . . unequivocally refuting isn't really the language of the empirical method, but it does make for a more sexy headline. \n\nThe study is still very rigorous and the researchers should be applauded for helping squash misinformation! Kudos",
            "title_similarity": "0.48843783",
            "sentiment_compound": 0.8805
        },
        {
            "id": "gvwhp6b",
            "score": -1,
            "text": "Without the epidural most of us will never be born",
            "title_similarity": "0.42493314",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvwnrd8",
            "score": -1,
            "text": "It’s strange that we still need to do these kind of studies to show people who hate women that they deserve pain medication in labour",
            "title_similarity": "0.47124916",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gvwstn1",
            "score": -1,
            "text": "Come on already. Autism is caused by gut bacteria imbalance. But there are many yet unknown triggers for it.",
            "title_similarity": "0.4822471",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvwxkkd",
            "score": -1,
            "text": "what's wrong with being autistic?",
            "title_similarity": "0.29359517",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvwz5fi",
            "score": -1,
            "text": "It’s probably all the pesticides in the foods we’re eating now that is causing it. Would not surprise me if roundup passes into the baby if you were pregnant and eat anything gmo that was sprayed with that crap. Something is causing this insane spike in autism in kids. \n\nEither all the pesticides or the aluminum they’re spraying in the air",
            "title_similarity": "0.5756008",
            "sentiment_compound": -0.7607
        },
        {
            "id": "gvx396l",
            "score": -1,
            "text": "I think a c-section is more likely to result in autism. That and not breast feeding",
            "title_similarity": "0.5028281",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvf1m1",
            "score": 55,
            "text": "I remember reading a study where AI was able to predict which pregnant women would have children with autism by analyzing their plasma. So far it has been 100% accurate.",
            "title_similarity": "0.55204535",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvq0u3",
            "score": -8,
            "text": "Please correct me if I'm wrong (no, seriously do) but I thought they already found a link between autism and anti-depressant (or similar type of) meds in the mothers during pregnancy.\n\nI thought this was one of the main reasons a lot of drugs say do not take if pregnant or stop taking it if you become pregnant.",
            "title_similarity": "0.6460532",
            "sentiment_compound": -0.5499
        },
        {
            "id": "gvvii0s",
            "score": 16,
            "text": "Autism is still a long way from being understood so how about we leave the Autism research to the Doctors and all those people who “research”(YouTube videos) grow up and stop spreading misinformation about everything.  Seriously get a life you are an embarrassment to society.",
            "title_similarity": "0.6572417",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gvvl5qn",
            "score": -2,
            "text": "Here come the define \"genuine link\" comments",
            "title_similarity": "-0.04499786",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvncsh",
            "score": 2,
            "text": "But, but, But that’s not how people FEEL about it.",
            "title_similarity": "0.2591769",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvpxr3",
            "score": 2,
            "text": "Did they go “Because its aspartame!!!” And then high five forever into infinity?",
            "title_similarity": "0.35912335",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvxuxi",
            "score": 2,
            "text": "For the last freaking time: Autism is hereditary!",
            "title_similarity": "0.5267347",
            "sentiment_compound": -0.4753
        },
        {
            "id": "gvvy50m",
            "score": -2,
            "text": "I wonder how many of the women having children with Autism also had an experimental phase with illicit drugs in college years before pregnancy. I'm three for three on parents I known who have autistic children... anecdotal, but I'm convinced.",
            "title_similarity": "0.624678",
            "sentiment_compound": 0.5499
        },
        {
            "id": "gvvz7iy",
            "score": 2,
            "text": "The only correlation a reasonable person should draw with the massive recent increase in autism diagnoses is with the massive recent increase in our understanding of and ability to diagnose \nautism. I’m 40 and I can think of numerous contemporaries I encountered as a child who today would have been diagnosed as being on the spectrum who were at the time either considered otherwise mentally disabled or were just “the weird kid”. I bet everyone else my age or older can do the same thing.",
            "title_similarity": "0.58777905",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gvw15e3",
            "score": 2,
            "text": "To the people who are confused as to why there’s been such an increase in autism diagnoses: decades ago, children with autism were lumped into the same category as kids with development or intellectual disabilities. There really wasn’t much distinction or differentiation. As well, autism presents very differently and inconsistently in girls. I have a couple friends who were only diagnosed in their 20s. Autistic girls are often just seen as shy or awkward because they don’t stim the same way, learn to mask at a very young age, and are often more verbal. I’m a special education teacher. I’d say that 1/10 ASD students I work with are girls.",
            "title_similarity": "0.6985668",
            "sentiment_compound": 0.8225
        },
        {
            "id": "gvw6l72",
            "score": 2,
            "text": "People would really prefer any detrimental consequence ever over having an autistic child and I think that’s sad.",
            "title_similarity": "0.39726317",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvwh24j",
            "score": -2,
            "text": "Wow. I am pretty anti epidural and am part of a bunch of mom groups that are very crunchy (yea vaginal childbirth with mo medical interventions, etc). This is the first time I have heard anyone though there was a link to autism.",
            "title_similarity": "0.6636387",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gvwiv0k",
            "score": 2,
            "text": "Man, people with Y chromosomes have the funniest misconceptions about childbirth. Why those ideas are taken seriously, I don't know",
            "title_similarity": "0.53531724",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvvvw5v",
            "score": 2,
            "text": "My parents had sex and I was born Autistic.  Sex causes Autism.  Maby it was the way they did it?",
            "title_similarity": "0.5922376",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvpu7x",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.095294945"
        },
        {
            "id": "gvvr41u",
            "score": 3,
            "text": "My SIL had a birth plan. Everyone has a birth plan till they get punched in the uterus. \n\nShe refused the epidural till it was too late, and had a very risky delivery.",
            "title_similarity": "0.58497334",
            "sentiment_compound": -0.5095
        },
        {
            "id": "gvvc9cc",
            "score": 332,
            "text": "[removed]",
            "title_similarity": "0.05465429"
        },
        {
            "id": "gvvmeq1",
            "score": 6,
            "text": "I don't know why but autism seems more like an at conception occurrence not a result of an injury",
            "title_similarity": "0.4824065",
            "sentiment_compound": -0.0027
        },
        {
            "id": "gvv40qb",
            "score": 491,
            "text": "What's the deal with a subset of parents not being willing/able to accept that their genes created a condition in their child?",
            "title_similarity": "0.5343045",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gvvipah",
            "score": -7,
            "text": "This is a more intriguing idea, and also could be linked to birth practices.  \n[https://www.nature.com/articles/d41586-020-00198-y](https://www.nature.com/articles/d41586-020-00198-y)",
            "title_similarity": "0.3330052",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvluzr",
            "score": -7,
            "text": "I would like to see a similar study on psychiatric medications administered to pregnant woman and how that correlates to autism rates.",
            "title_similarity": "0.459895",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvvg9ue",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.09529498"
        },
        {
            "id": "gvvmflb",
            "score": -8,
            "text": "Ok pain medication in infants does cause long term neurological issues. Look at kids who underwent hlhs surgeries.",
            "title_similarity": "0.4677614",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gvvqzbo",
            "score": -8,
            "text": "So, after 2 kids I had the Mirena IUD “installed”. Long story short, I almost died and the doctor told me I’d no longer be able to have another baby. Fast forward 18 months, I’m pregnant with a third kid. That third baby has autism. I wonder ALL the time if there’s a correlation btwn. my near death experience & his autism, as we don’t have a family history.",
            "title_similarity": "0.6957164",
            "sentiment_compound": -0.8558
        },
        {
            "id": "gvvyc6p",
            "score": -8,
            "text": "There are many good reasons not to get an epidural. Was not aware that a link to autism had even been proposed.",
            "title_similarity": "0.695992",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvw1gz3",
            "score": 8,
            "text": "People really just can’t imagine having an autistic child? Rather my son be autistic than die of small pox. (Is it then or than? I’m an idiot)",
            "title_similarity": "0.6127703",
            "sentiment_compound": -0.8205
        },
        {
            "id": "gvwcy5y",
            "score": 7,
            "text": "We have to stop acting like autism is the problem and instead, provide resources to educate about autism. The fear and anxiety that parents suffer as they try to pinpoint what causes autism could be eased by educating the public about what autism is. It’s a neurological divergence, the brain is wired differently. We need to embrace it to move forward and talk about what resources are needed to help the autism community. Too much time and money is spent on finding out what causes autism, the money and time would be better spent creating resources and tools to help those with autism  and their families.",
            "title_similarity": "0.56023467",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvvn0jc",
            "score": -9,
            "text": "Ok cool another thing not linked to autism rates going up yet they keep going up. Keep up the good work!",
            "title_similarity": "0.35523972",
            "sentiment_compound": 0.7712
        },
        {
            "id": "gvv5t60",
            "score": -55,
            "text": "I’m willing to bet that most issues with children and childbirth often stem from ingesting substances that they say not to ingest while you are pregnant or nursing. Things such as nicotine and alcohol and narcotics and drugs and stuff like that.\n\nSecond most being hereditary stuff",
            "title_similarity": "0.54918617",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvvog2r",
            "score": -9,
            "text": "It’s the anti depressants millions of North American women are on. That’s what causes autism",
            "title_similarity": "0.62626636",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gvvpm81",
            "score": -11,
            "text": "Sorry to say, but I was watching Oprah in 2005 and she had a guest on who says vaccines cause autism. I will believe that til the day I die.",
            "title_similarity": "0.55893373",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gvvcbf1",
            "score": -37,
            "text": "Would like to see studies where they pay the birth mother to not have these drugs and do a comparison, would be interesting.",
            "title_similarity": "0.46836618",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gvuzodn",
            "score": 861,
            "text": "Epidural anaesthesia doesn’t get anywhere near the placenta to cross over into a baby’s bloodstream anyway. It’s *in the spinal cord*.",
            "title_similarity": "0.63512045",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvfzis",
            "score": 25,
            "text": "Where do these kinds of ideas originate in the first place?",
            "title_similarity": "0.07109235",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvv0ud6",
            "score": 1272,
            "text": "[removed]",
            "title_similarity": "0.054654278"
        },
        {
            "id": "gvv97gu",
            "score": 405,
            "text": "[removed]",
            "title_similarity": "0.054654278"
        },
        {
            "id": "gvvn4js",
            "score": 155,
            "text": "[removed]",
            "title_similarity": "0.054654278"
        },
        {
            "id": "gvveyre",
            "score": 3666,
            "text": "I had no idea this was a thing.  I used to do epidurals for OB and no one ever voiced a concern about  it and I don't remember anything in our literature.  Is this recent?",
            "title_similarity": "0.6857526",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gvviuua",
            "score": 6,
            "text": "I feel like the time between an epidural and birth is way too short for it to affect a child like that",
            "title_similarity": "0.50830185",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvvo7vg",
            "score": 1,
            "text": "And we wasted a lot of time and money proving dumb conspiracy theories wrong. Thanks a pant load, Facebook scientists.",
            "title_similarity": "0.5443615",
            "sentiment_compound": -0.8779
        },
        {
            "id": "gvvogc7",
            "score": 8,
            "text": "I seem to recall hearing about a link between pregnant women living near freeways, i.e. constant exposure to bad air.",
            "title_similarity": "0.37455675",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvvolbj",
            "score": 1,
            "text": "I appreciate that these studies are done. I do think that maybe they assume the arguments they're refuting are made in good faith when that is not true.",
            "title_similarity": "0.20143104",
            "sentiment_compound": 0.5216
        },
        {
            "id": "gvvp241",
            "score": 1,
            "text": "I didn't know people thought this.... I'm so glad I had an epidural.",
            "title_similarity": "0.43254977",
            "sentiment_compound": 0.5949
        },
        {
            "id": "gvvp3zx",
            "score": 2,
            "text": "But wasn't there another recent study that did confirm a correlation with c-sections and autism? Or was that something else?",
            "title_similarity": "0.49725324",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvq9x2",
            "score": 1,
            "text": "I never even heard of this rumor.  I wonder how many millions of dollars in research money they spent to prove it was untrue...",
            "title_similarity": "0.70603853",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvqaeo",
            "score": 1,
            "text": "I thought the only issue people had with epidurals was because there was the tiniest chance that harm could be done to the woman's body because she couldn't tell the doctor there was pain separate from what was expected.\n\nDo not take the above as anything factual, this is just something I heard. I have no clue if it's even close to true. I am neither a doctor nor a woman.",
            "title_similarity": "0.6560694",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gvvqg5p",
            "score": 1,
            "text": "I read the article.  Even the doctors had serious misgivings on the criteria for this research.\n\nEdit \"trad\" to read.  (Thank you auto f-up.)",
            "title_similarity": "0.5516954",
            "sentiment_compound": 0.296
        },
        {
            "id": "gvvsqot",
            "score": 1,
            "text": "This sort of thing seems to revolve around blaming someone else because the idea you could have done this to your child is too much for some people. As I understand it the only links people find to autism are anti depressants and heredity. Anyone have any updated info on that?",
            "title_similarity": "0.5633766",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gvvsst3",
            "score": 3,
            "text": "Wait, people actually thought anesthesia causes autism?  Where is this coming from?",
            "title_similarity": "0.5393488",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvsymf",
            "score": 2,
            "text": "More research money being wasted to ‘refute’ theories that have no basis in reality. Think of what we can accomplish if everyone’s brains worked.",
            "title_similarity": "0.41645613",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gvvt49r",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.095294945"
        },
        {
            "id": "gvvtm9e",
            "score": 85,
            "text": "Everyone is asking when did this become a thing, and it started here --> https://jamanetwork.com/journals/jamapediatrics/article-abstract/2771634\n\n\"The researchers found in a multiethnic population-based clinical birth cohort that included 147 895 children, autism spectrum disorders were diagnosed in 1.9% of the children delivered vaginally with epidural analgesia vs 1.3% of the children delivered vaginally without the exposure, a 37% relative increase in risk that was significant after adjusting for potential confounders.\"\n\nBut... there was a large number of confounders to control for and bad methodology. The researchers neglected to consider whether the mothers had an ASD diagnosis and family history they also neglected to consider other factors which contribute to fetal distress in labor related variables, emergency cesarean, Apgar scores, length of labor etc., which would have a stronger effect. If they're trying to control confounding variables they ought to have controlled for the ones that are likely to have a strong effect on the outcome, major oversight. Reminds me of a certain Healthcare corp, that wanted to examine how new nursing ratios affected patient outcomes, and initially the patient outcomes seemed worse... only because they forgot to control for deaths of their hospice patients...\n\nIt's great that Canada has put many women at ease with a longitudinal study on the matter.",
            "title_similarity": "0.717629",
            "sentiment_compound": -0.8176
        },
        {
            "id": "gvvtswz",
            "score": 1,
            "text": "But Facebook told me it does. So everything Facebook says is more true than science",
            "title_similarity": "0.40019625",
            "sentiment_compound": 0.6297
        },
        {
            "id": "gvvufsx",
            "score": 1,
            "text": "Something tells me the anti vaxxers don't care",
            "title_similarity": "0.3262539",
            "sentiment_compound": -0.6031
        },
        {
            "id": "gvvumca",
            "score": 1,
            "text": "I've heard the old wives tale of epidural harming the baby, but never heard anything about autism.",
            "title_similarity": "0.76874363",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gvvuqlo",
            "score": 1,
            "text": "What does “genuine link” mean in the headline?",
            "title_similarity": "0.18248942",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvvhub",
            "score": 1,
            "text": "Lotta big words I can’t pronounce",
            "title_similarity": "0.3655065",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvvr83",
            "score": 1,
            "text": "Coming to the conclusion makes no sense in the first place, how did they even try to make the connection?",
            "title_similarity": "0.40983364",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvvwamq",
            "score": 1,
            "text": "Karen would *still* like to speak to their manager.",
            "title_similarity": "0.15229864",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvvwgd7",
            "score": 1,
            "text": "I had one operation in my lifetime ( hernia, left side) no one will introduce a needle in my spinal area. \nI requested  a local anaesthetic. Yes, I was frozen a lot longer that with the epidural “drip” but never suffered the after effects ( pain at the injection site) that all my friends who had one experienced. Either they were all very unlucky, or, I was incredibly lucky to have a surgeon who respected my wishes.",
            "title_similarity": "0.71520144",
            "sentiment_compound": 0.9271
        },
        {
            "id": "gvvwuho",
            "score": 5,
            "text": "The original study from JAMA Pediatrics : Association Between Epidural Analgesia During Labor and Risk of Autism Spectrum Disorders in Offspring [https://jamanetwork.com/journals/jamapediatrics/article-abstract/2771634](https://jamanetwork.com/journals/jamapediatrics/article-abstract/2771634)\n\nThe statement from multiple medical societies refuting above study's claims\n\n[https://www.asahq.org/about-asa/newsroom/news-releases/2020/10/labor-epidurals-and-autism-joint-statement](https://www.asahq.org/about-asa/newsroom/news-releases/2020/10/labor-epidurals-and-autism-joint-statement)\n\nThe most recent study which found no connection, also JAMA Pediatrics -\n\nAssociation of Epidural Labor Analgesia With Offspring Risk of Autism Spectrum Disorders\n\n[https://jamanetwork.com/journals/jamapediatrics/fullarticle/2778776?utm\\_campaign=articlePDF&utm\\_medium=articlePDFlink&utm\\_source=articlePDF&utm\\_content=jamapediatrics.2021.0376](https://jamanetwork.com/journals/jamapediatrics/fullarticle/2778776?utm_campaign=articlePDF&utm_medium=articlePDFlink&utm_source=articlePDF&utm_content=jamapediatrics.2021.0376)\n\nEdit: corrected link",
            "title_similarity": "0.58645344",
            "sentiment_compound": -0.5362
        },
        {
            "id": "gvvwwkp",
            "score": 1,
            "text": "Autism scare is going to persist regardless of amount of research",
            "title_similarity": "0.44661483",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gvvwzym",
            "score": 1,
            "text": "Is \"unequivocally refuting\" how statistical studies work?",
            "title_similarity": "0.34885088",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvx2vt",
            "score": 1,
            "text": "I didn’t realize anyone was questioning this. I thought the concern was with vaccines",
            "title_similarity": "0.5364309",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gvvx4h4",
            "score": 1,
            "text": "That this even needs to be said is incredibly fucked up.",
            "title_similarity": "0.3532433",
            "sentiment_compound": -0.6901
        },
        {
            "id": "gvvxcxm",
            "score": 1,
            "text": "What did the latitudinal studies say?",
            "title_similarity": "0.08908802",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvvz4r7",
            "score": 3,
            "text": "Great, but can we also understand that autism isn't bad? Neurodiversity is good.",
            "title_similarity": "0.32228497",
            "sentiment_compound": 0.88
        },
        {
            "id": "gvvzk60",
            "score": 1,
            "text": "Can't accept that it's their defective genes",
            "title_similarity": "0.48052275",
            "sentiment_compound": -0.6229
        },
        {
            "id": "gvw0bs7",
            "score": 1,
            "text": "I believe this was the flawed California study that’s being debunked:\n\nhttps://jamanetwork.com/journals/jamapediatrics/article-abstract/2771634",
            "title_similarity": "0.43998715",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvw0f45",
            "score": 1,
            "text": "Too bad evidence doesn't mean jack-squat to those who really need to know this.",
            "title_similarity": "0.34859788",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvw174j",
            "score": 1,
            "text": "I mean, it’s great to have proof on paper, but anyone who’s going to try to link this to someone who believes the contrary should know they might as well use that energy banging their head repeatedly against a brick wall for all the good it will do. The “___ causes autism” crowd tends to have their collective feet firmly planted where they stand.",
            "title_similarity": "0.48495406",
            "sentiment_compound": 0.8934
        },
        {
            "id": "gvw1mmy",
            "score": 1,
            "text": "I didn’t realize this was a claim that needed refuting.",
            "title_similarity": "0.34963447",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvw1ms8",
            "score": 2,
            "text": "My mom didn’t have an epidural when she was birthing me, because I was kind of small anyways, and I still ended up on the spectrum.",
            "title_similarity": "0.637264",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvw1q23",
            "score": 1,
            "text": "I have never heard of this before.",
            "title_similarity": "0.3028553",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvw3akz",
            "score": 1,
            "text": "I cannot believe the time they wasted on a study like this. Its up to the mothers if they want painfree labor or not. Plus, why they think just anything will cause autism in babies!!! As if babies have no “system” to fight the environmental toxins at all.",
            "title_similarity": "0.7630655",
            "sentiment_compound": -0.7249
        },
        {
            "id": "gvw3d26",
            "score": 1,
            "text": "What do the studies say about drinking alcohol though?",
            "title_similarity": "0.26430583",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvw3foz",
            "score": 1,
            "text": "Why is it that these vague concerns of \"autism\" always arise from things that make having a child somewhat easier? It is just simply gatekeeping from people who did it \"the hard way\"?",
            "title_similarity": "0.4567939",
            "sentiment_compound": 0.2656
        },
        {
            "id": "gvw7c1s",
            "score": 3,
            "text": "Honestly even if there was a risk, considering my epidural didn't work until AFTER I gave birth and got stitches I would still risk autism to avoid that pain. Autism isn't a death sentence that pain definitely felt like I was dying",
            "title_similarity": "0.64302146",
            "sentiment_compound": -0.2206
        },
        {
            "id": "gvw84je",
            "score": 1,
            "text": "This is largely American driven with older parents unwilling to accept a genetic factor. It has to be someone else’s fault, they are victims.",
            "title_similarity": "0.5655142",
            "sentiment_compound": -0.34
        },
        {
            "id": "gvw8648",
            "score": 1,
            "text": "Good news. Now lets continue the effort in finding the actual cause of why the chance of a child being born autistic is continuing to increase.",
            "title_similarity": "0.38583678",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gvw8kui",
            "score": 1,
            "text": "So what stock was being affected that they’d need to prove it?",
            "title_similarity": "0.18982217",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gvw8yhi",
            "score": 1,
            "text": "It causes brain damage to idiots who will believe anything they read.",
            "title_similarity": "0.43664694",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gvw9279",
            "score": 1,
            "text": "Next it will be if the woman looked at an autistic kid while pregnant, her kid will be autistic.\n\nCan't we all just understand it happens and love the children no matter what?\n\nSheesh.",
            "title_similarity": "0.505583",
            "sentiment_compound": 0.6281
        },
        {
            "id": "gvw9844",
            "score": 1,
            "text": "I read the original article, which was utter crap published in a very serious journal. Shamefull.",
            "title_similarity": "0.49072173",
            "sentiment_compound": -0.2928
        },
        {
            "id": "gvwaawu",
            "score": 1,
            "text": "Why the modern linking of ASD to medical procedures?\n\nHas the number of autism births increased per population over time?\n\nCan we spot the diagnostic growth points and attach them to specific medical developments? (or other external factors?)",
            "title_similarity": "0.5562879",
            "sentiment_compound": 0.7149
        },
        {
            "id": "gvwadd9",
            "score": 2,
            "text": "Why is it always autism?",
            "title_similarity": "0.45678198",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvwcsqy",
            "score": 2,
            "text": "Why is so much “conspiracy” research attached to autism? Are other disorders/diseases like this too?",
            "title_similarity": "0.49950147",
            "sentiment_compound": 0.4329
        },
        {
            "id": "gvwe7ts",
            "score": 1,
            "text": "The amount of money and time wasted on stupid experiments just to try and calm down people's irrational fears...",
            "title_similarity": "0.5058851",
            "sentiment_compound": -0.8591
        },
        {
            "id": "gvwegho",
            "score": 1,
            "text": "Doctors give you an epidural, put you under the influence, then tell you there are complications and demand you have a c-section because the Doctors are on a schedule and don't want to wait for you to have a natural birth.\n\nIt's a sick cycle.\n\nGet a mid wife, save $10,000, and enjoy bringing life into this world.",
            "title_similarity": "0.56950593",
            "sentiment_compound": 0.5964
        },
        {
            "id": "gvwejt0",
            "score": 1,
            "text": "Must be all the vaccines then.",
            "title_similarity": "0.31656396",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvwencx",
            "score": 1,
            "text": "I didn’t even know that was a concern!  I had two epidurals without knowing. But I’m glad it seems to be a non-issue.",
            "title_similarity": "0.5643567",
            "sentiment_compound": 0.6476
        },
        {
            "id": "gvwer5r",
            "score": 2,
            "text": "What if, now, I may be crazy, but....but...what if autism is like any other thing that we consider wrong...a protein fold gone wrong. An error in genetic copying. Like tilting a copy a smidge, then using that to copy the same smidge off, then again and so one. I mean, cancer affected humans 100s of thousands of years ago. It's not new. Animals suffer from it too. We are self replicating machines. We're gonna error sometimes.",
            "title_similarity": "0.628574",
            "sentiment_compound": -0.8422
        },
        {
            "id": "gvwewuu",
            "score": 1,
            "text": "Sadly the kind of morons that believed this in the first place aren't going to be dissuaded by something as simple as evidence... Just look at anti vaxers.",
            "title_similarity": "0.5243987",
            "sentiment_compound": -0.7713
        },
        {
            "id": "gvwfejo",
            "score": 1,
            "text": "That sucks.  Would be nice if there was an easy fix.  Back to screen time.",
            "title_similarity": "0.1379657",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvwfpvk",
            "score": 1,
            "text": "This was a worry?! This has to be based on some antivaxx nonsense, it stinks like their \"logic.\"",
            "title_similarity": "0.3198265",
            "sentiment_compound": -0.6588
        },
        {
            "id": "gvwfw7s",
            "score": 2,
            "text": "I have a child with ADHD. His mum had an epidural. Our other son came out so fast there was no time for drugs. He's on the spectrum. What they have in common is a father and grandfather who be on the spectrum if they had known about it back in the day.",
            "title_similarity": "0.64171326",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvwhqpr",
            "score": 1,
            "text": "I mean, autism is genetic. Anesthesia isn’t targeted gene therapy.",
            "title_similarity": "0.6258672",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvwj20s",
            "score": 1,
            "text": "Well, that's reassuring. Good job science!",
            "title_similarity": "0.067120895",
            "sentiment_compound": 0.7901
        },
        {
            "id": "gvwjzhz",
            "score": 2,
            "text": "Medical research is based on p-values and 95% significance level, meaning they are 95% confident that the observed results are real and not an error caused by randomness. \n\nIt also means that there is a 5% chance that they could be wrong.",
            "title_similarity": "0.5583985",
            "sentiment_compound": 0.666
        },
        {
            "id": "gvwkc4q",
            "score": 2,
            "text": "Well, I am not a fan of faking science, but if we find a link between the spectrum and microplastik, we mey save the world. The fear of Karens that their children could not fit their own estimation of normal could drive them to clean whole oceans and landscapes.",
            "title_similarity": "0.6017914",
            "sentiment_compound": 0.0139
        },
        {
            "id": "gvwkyja",
            "score": 1,
            "text": "Not sure if it’s been mentioned BUTT I have a theory high rates of autism in Canada could come from population or “chemicals”. Ontario has lots of mining sulphur calcium and such, chemicals can alter brain function. Ontario seems to have the highest amount of people with autism or “mental illness”. I. The years of 1990 autism rates increased and so did the mining, drilling and plant industry’s all across Canada. Countries with lower air quality seem to have lower people diagnosed with autism, or is it because of their failing health care system? Of course autism has been classified as a genetic disability, it does not affect your chromosomes, like Down syndrome. I think it’s like a chemical imbalance, unlike any other “disability”, honestly. \nIt hits close to home, close enough to have a strong opinion, pls tell me more science on this theory. thxu",
            "title_similarity": "0.7457242",
            "sentiment_compound": 0.8041
        },
        {
            "id": "gvwl2sf",
            "score": 1,
            "text": "The fact that we are here discussing this as if we need to prove wrong about some stupid nonsense theory that relates autism to some medication/vaccine/you name it really enerves me.",
            "title_similarity": "0.57400084",
            "sentiment_compound": -0.8481
        },
        {
            "id": "gvwlhwo",
            "score": 1,
            "text": "Unequivocal...\n\nProbably not.",
            "title_similarity": "0.106953174",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvwn6eo",
            "score": 1,
            "text": "Good research. It will still never convince those who have to be convinced sadly.",
            "title_similarity": "0.5016913",
            "sentiment_compound": 0.264
        },
        {
            "id": "gvwnlso",
            "score": 2,
            "text": "People just want to find a reason to blame their child having autism\n\nSo they are antivaxx and they still end up with an autistic child\n\nSo they had an epidural and they still end up with an autistic child \n\nSo they drank water during pregnancy and they STILL ended up with an autistic child. \n\nI'm hoping that they will eventually realise where this type of thinking will lead.",
            "title_similarity": "0.57125366",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gvwo5d8",
            "score": 1,
            "text": "what's the actual reason for the mass amounts of people with autism?",
            "title_similarity": "0.52550066",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvwpk2r",
            "score": 1,
            "text": "Correct me if I’m wrong, but can’t they detect the brain differences that indicate autism while the fetus is still in utero thus negating this whole theory in the first place.",
            "title_similarity": "0.6455983",
            "sentiment_compound": -0.2617
        },
        {
            "id": "gvwppnl",
            "score": 1,
            "text": "First time I've opened Reddit since my partner gave birth to our first child .......... almost had a heart attack.",
            "title_similarity": "0.5527985",
            "sentiment_compound": 0.2111
        },
        {
            "id": "gvwq0ny",
            "score": 2,
            "text": "I find this so strange. I have dyslexia. As far as I can see no one is running around saying x drug/ vaccine is going to cause dyslexia. Yet aren’t autism and dyslexia both having different ways of viewing the world in a way?",
            "title_similarity": "0.74290043",
            "sentiment_compound": -0.5524
        },
        {
            "id": "gvwr9nz",
            "score": 1,
            "text": "That's one hell of a sample size, and a long-term study to follow that many people for considering how long an autism diagnosis takes\n\nnice, canada",
            "title_similarity": "0.6219687",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvwrlih",
            "score": 2,
            "text": "Result summary from the paper:\n\n> Results  Of the 123 175 offspring included in this study (62 647 boys [50.9%]; mean [SD] age of mothers, 28.2 [5.8] years), 47 011 (38.2%) were exposed to ELA; 2.1% (985 of 47 011) of exposed vs 1.7% (1272 of 76 164) of unexposed offspring were diagnosed with ASD in the follow-up period (hazard ratio [HR], 1.25; 95% CI, 1.15-1.36). \n\n> After adjusting for maternal sociodemographic, prepregnancy, pregnancy, and perinatal covariates, ELA was not associated with an offspring risk of ASD (inverse probability of treatment–weighted HR, 1.08; 95% CI, 0.97-1.20).\n\nSo a more accurate headline might be:  \"There *is* a correlation between Autism and Epidurals, and if you correct for various confounding factors the correlation gets small enough to just about not be statistically significant, but with just a little more data might well become significant again\".\n\nI think it would be reasonable to say that either Epidurals *do* slightly increase the chances of Autism, *or* (more likely in my mind) there are other as-yet undiscovered confounding variables.\n\nAm I interpreting this wrong?",
            "title_similarity": "0.6144043",
            "sentiment_compound": 0.1222
        },
        {
            "id": "gvws9n5",
            "score": 2,
            "text": "No single study can 'unequivocally refute' anything, let alone an observational one (which is not to say I disagree with the results).",
            "title_similarity": "0.52590495",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gvwsb5o",
            "score": 2,
            "text": "Being pregnant increases the risk of autism in babies. Confirmed by me, a doctor with a degree achieved at the internet academy",
            "title_similarity": "0.56374085",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gvwu6i2",
            "score": 1,
            "text": "Haven't you heard, anything intravenous that is supposed to help the child or, god forbid, help women or give them any control over their own bodies, causes autism. Fact.",
            "title_similarity": "0.72957593",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gvwzqhm",
            "score": 1,
            "text": "I wouldnt think that one use , during a birth would cause autism that would take months to develop.\nLike cant they tell sometimes if the child will be autistic in the womb? I could be thinking of another thing",
            "title_similarity": "0.6309005",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvwzxtw",
            "score": 1,
            "text": "Yeah my son is high functioning but severe autism and I have never had any kind of anesthesia during childbirh.",
            "title_similarity": "0.7655835",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvx101q",
            "score": 1,
            "text": "What?\n\nCorrelation isn't enough for r/science? \n\nThat's a first",
            "title_similarity": "0.4581984",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvx134p",
            "score": 1,
            "text": "It's irrelevant. Peer reviewed studies have shown that people don't change their opinions.",
            "title_similarity": "0.36685014",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvx1ttu",
            "score": 1,
            "text": "I'm sure this sound, scientific data will set the record straight once and for all and this is the last we will ever hear about it.",
            "title_similarity": "0.37189287",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvx248w",
            "score": 1,
            "text": "How would this even cause autism? The drugs that are used during an epidural don’t even enter the baby’s system.",
            "title_similarity": "0.69241285",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvx2pet",
            "score": 1,
            "text": "This is such a crazy thing to believe.\n\nThis is like saying that \"Doctor's finally prove shaking hands with a homosexual doesn't cause gayness\".",
            "title_similarity": "0.5896442",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gvx37aq",
            "score": 1,
            "text": "I feel like a few decades from now it’s just going to be common knowledge all the autism conspiracies were just old men spreading disinformation because the leading cause is funky old sperm",
            "title_similarity": "0.6337925",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvx47nz",
            "score": 3,
            "text": "I heard that not having any children helps decrease autism",
            "title_similarity": "0.4886101",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gvx4v9q",
            "score": 1,
            "text": "Seems to me these anti vaccers and anti-abortionists just seem to aim in inflicting as much pain as possible by taking away any form of relief no matter the form",
            "title_similarity": "0.4126202",
            "sentiment_compound": -0.3765
        },
        {
            "id": "gvx5ey9",
            "score": 1,
            "text": "If you have to use anesthetisia as a possible cause you’re looking nothing but desperate here like c’mon",
            "title_similarity": "0.41495287",
            "sentiment_compound": 0.6901
        },
        {
            "id": "gvx5wsx",
            "score": 1,
            "text": "I used to date an antivaccer that believed almost all modern medicine was harmful and should not be taken.  Last time I checked Polio was pretty much eradicated.",
            "title_similarity": "0.66134155",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvx6zzm",
            "score": 1,
            "text": "Honestly asking, what's the point of doing a study like this if we know 90% of the people who believe in the \"X causes autism\" hoaxes don't listen to science to begin with?",
            "title_similarity": "0.7714591",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gvx8ug1",
            "score": 1,
            "text": "Can we stop with this 'Autism bad' thing in the first place?",
            "title_similarity": "0.4547616",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gvx9uz4",
            "score": 1,
            "text": "Please can someone explain North America's obsession with autism to me. (Also I thought everybody was minor to mildly autistic?)",
            "title_similarity": "0.6375043",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gvxb1fk",
            "score": 1,
            "text": "It is so crazy that vaccinations etc are all linked to autism by people without evidence, but that age of parents, which has proven to be an influence is neglected by those people",
            "title_similarity": "0.7035773",
            "sentiment_compound": -0.7689
        },
        {
            "id": "gvxb54t",
            "score": 1,
            "text": "With the amount of redditers claiming to be autistic this surprises me",
            "title_similarity": "0.4319261",
            "sentiment_compound": 0.2789
        },
        {
            "id": "gvxbvsm",
            "score": 1,
            "text": "Wait a second. Isn't autism spectrum disorder a genetically conditioned disorder? In that case, why would any external influence change anything about that and therefore why would this even be up for debate? Or am I missing something?",
            "title_similarity": "0.54781735",
            "sentiment_compound": -0.4909
        },
        {
            "id": "gvxc6fe",
            "score": 1,
            "text": "My theory would be the ungodly amount of chemicals sprayed on our crops",
            "title_similarity": "0.39988768",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvxcfho",
            "score": 1,
            "text": "Was this even a thing??? we all know autism is caused by stacking a dozen vaccines in one appointment.",
            "title_similarity": "0.6586107",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvxczzl",
            "score": 1,
            "text": "For anyone doing studies on Autism, you may want to reach out to these folks who are gathering one of the largest DNA sets out there to do deep dive research.\n\nhttps://sparkforautism.org/",
            "title_similarity": "0.46104687",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gvxe99e",
            "score": 1,
            "text": "This is only news because ignorant people who believe they know more than doctors complained.",
            "title_similarity": "0.559567",
            "sentiment_compound": -0.6204
        },
        {
            "id": "gvxf126",
            "score": 1,
            "text": "The amount of people in this thread who know -nothing- factual about what being autistic actually means is concerning and sad. Autistic people don’t need or want a “cure”. There are lots of autistic adults you can learn the truth from like Auteach, Potenia Neurodiversity, Erika Heidewald, Jenara Nerenberg, to name a few of many. \n\nABA therapy is one of the most evil and abusive things in existence, on par with queer conversion therapy, and should be a crime. \n\nPlease stop using high functioning and low functioning labels. They are are unspeakably problematic labels that are remnants of decades old propaganda spread by autistic hate groups and unethically performed “studies” — aka literal torture on children including but not limited to eugenic Nazi experiments.\n\nBeing autistic is just a different operating system. Autistic people have different strengths, needs, and sensory abilities than people who are not autistic. Allistic people are not better than autistic people. Autistic people aren’t better than allistic people.\n\nPathologizing naturally occurring biodiversity and trying to force those people to fit into society because they are different than how some people want them to be / different beyond their understanding, is really really really bad and causes massive amounts of trauma to autistic people.\n\nA lot of the “functioning” issues you hear or see about is literally just trauma— not actual elements of being autistic. Trauma from being abused by the medical system, from their parents, or both.\n\nAnd a lot of the fundraising for studies like this can be traced backed to hate groups who use the money to make them richer and richer.\n\nEthically performed gathering of data about what it means to be autistic are severely lacking, but there are lots of amazing autistic activists trying to counteract the damage done from decades of hate group propaganda and from the inherent sexism, racism, and ableism built into the medical industry complex. \n\nThe best thing you can do is listen to autistic people, and learn about them to understand them better and accept them.\n\nYou yourself may even BE autistic and not realize it.",
            "title_similarity": "0.60820615",
            "sentiment_compound": -0.9446
        },
        {
            "id": "gvxhusv",
            "score": 1,
            "text": "I hate how much time and money we waste to disprove conspiracy theories.",
            "title_similarity": "0.56467015",
            "sentiment_compound": -0.872
        },
        {
            "id": "gvxo5sz",
            "score": 1,
            "text": "It’s almost as if autism is just the observation of a spectrum of neurological functions which some people seem to have, and others do not. Kind of like I have freckles and you don’t.",
            "title_similarity": "0.49477464",
            "sentiment_compound": -0.3406
        },
        {
            "id": "gvxovqc",
            "score": 1,
            "text": "Well in the Victorian era people use to use opiods to avoid birth pains... I guess anesthetics are not so bad",
            "title_similarity": "0.4068553",
            "sentiment_compound": 0.1738
        },
        {
            "id": "gvxox1b",
            "score": 1,
            "text": "The whole “vaccines cause autism” thing has been thoroughly debunked, and the “scientist” behind it admitted that it was all fake. It only makes sense that epidurals also do not cause/increase risk of autism. Seems like common sense, but the anti vaxxers/anti anesthesia people out there will still scream that the autism “link” is true.",
            "title_similarity": "0.69973135",
            "sentiment_compound": -0.3597
        },
        {
            "id": "gvxqi3a",
            "score": 1,
            "text": "ironic, most of my autistic fellows were a C-section baby",
            "title_similarity": "0.46532083",
            "sentiment_compound": -0.128
        },
        {
            "id": "gvxr7xv",
            "score": 1,
            "text": "That’s because the autism comes from the vaccines they pump kids full of when they start getting their “shots”",
            "title_similarity": "0.5601335",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvxro39",
            "score": 1,
            "text": "Paid by donors of the anesthesia company",
            "title_similarity": "0.28875637",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvxrtmg",
            "score": 1,
            "text": "People think everything can give autism, except what’s actually doing. Our fucked up consumerism diet of poison.",
            "title_similarity": "0.5724177",
            "sentiment_compound": -0.836
        },
        {
            "id": "gvycafj",
            "score": 1,
            "text": "How could it, child DNA is already developed at that stage",
            "title_similarity": "0.2616747",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvycqel",
            "score": 1,
            "text": "Before your baby is even born other moms are judging you on your decisions. It’s so gross. \n\n“Well my children were born vaginally so...”\n“Well I didn’t need pain medication so...”\n“Well I cut the tip of my sons penis off so...”\n“Well I nursed all my children so...”\n“Well I only feed my kids organic food so...”\n“Well my kids don’t know what tv is so...”\n\nSantimommies are some of the most misogynistic people on the planet.",
            "title_similarity": "0.6495669",
            "sentiment_compound": -0.8552
        },
        {
            "id": "gvz6aoy",
            "score": 1,
            "text": "Never heard of epidural causing autism. My sister still choose to go fully under for her C-section because and I quote “a smart woman chooses to avoid that level of pain if she can... and also those epidural needles are giant and I’m not allowing someone to put that in my spinal column”",
            "title_similarity": "0.69790775",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gw1qszr",
            "score": 1,
            "text": "Please tell me this wasn't why more people weren't getting an epidural",
            "title_similarity": "0.5693104",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwndifc",
            "score": 1,
            "text": "The most rabid conspiracy advocate I know personally is also the most educated and degreed.",
            "title_similarity": "0.31453106",
            "sentiment_compound": -0.5688
        },
        {
            "id": "gzxausk",
            "score": 1,
            "text": "Why can't people just accept that it's a genetic thing like a billion other things.. Are they too ashamed of having an autistic kid or something?",
            "title_similarity": "0.6406565",
            "sentiment_compound": -0.4184
        }
    ]
}