{
    "'Machiavellian' parents, with traits like manipulativeness, callousness and indifference to morality, seem more willing to give healthy kids unnecessary ADHD medication in order to boost their focus and performance, finds a new study (n=1,360).\n": [
        {
            "id": "gvx00zy",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.6704584",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gvxdp7y",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gvxr2qk",
            "score": 1,
            "text": "But the real problem of over-prescription of ADHD medication is NOT on the parents. France has 4% of kids of Ritalin compared to 14% in the US. Diagnosis for ADHD and the use of prescription treatment is so prevalent in the US. Studies demonstrate how conflicts of interest in Big Pharma to influence doctors, and the legal ability to promote drugs to the public and to parents are the main reasons for over prescription.  So the main focus should really be on “Machiavellian” doctors and pharma reps. As always.",
            "title_similarity": "0.75513715",
            "sentiment_compound": 0.631
        },
        {
            "id": "gvxg2zf",
            "score": 2,
            "text": "They say Machiavellian parents, but that sounds an awful lot like psychopaths to me",
            "title_similarity": "0.57735586",
            "sentiment_compound": -0.1901
        },
        {
            "id": "gvxjzqw",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "0.04365503"
        },
        {
            "id": "gvy050q",
            "score": 0,
            "text": "IMHO it's a terrible idea to give any kid a mind-altering drug without serious medical need, as their brain is still developing. Studies are beginning to show how the massive over-diagnosis of ADHD is leading to some serious issues when these kids reach adulthood and are taken off the incredibly powerful drugs.",
            "title_similarity": "0.7610784",
            "sentiment_compound": 0.0039
        },
        {
            "id": "gvx042g",
            "score": 12,
            "text": "[deleted]",
            "title_similarity": "0.04365503"
        },
        {
            "id": "gvynm0w",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.04365503"
        },
        {
            "id": "gvxpgi1",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.04365503"
        },
        {
            "id": "gvx2bht",
            "score": 47,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gvxcr4c",
            "score": -17,
            "text": "What about parents who get 'on the spectrum\" diagnoses for their perfectly normal kids so they can get special accomodations?",
            "title_similarity": "0.73940825",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gvxhykz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gvxt3lf",
            "score": 0,
            "text": "Psychotic parents want to give their kids speed. There, fixed the title.",
            "title_similarity": "0.7409625",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gvxr5gz",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gvxs3ke",
            "score": -1,
            "text": "So like 80% of American parents?",
            "title_similarity": "0.2872802",
            "sentiment_compound": 0.4201
        },
        {
            "id": "gvxrnu4",
            "score": 5,
            "text": "I suffered really bad as a kid. I was smart but had ADD. My parents were super supportive and gave me everything I needed to succeed, but I still failed because I had trouble focusing in class or I would hyper focus on something else when I needed to do school work.\n  \nIt was my teachers in 8th grade who convinced my parents to start me on medications. I had many great teachers throughout the years who got through to me, but some of them felt it would be easier to have my parents medicate me than to change their approach to teaching me.\n  \nThe medication never helped. I sold it. I abused it. I took it as prescribed and lost crazy amounts of weight. I became suicidal and acted on it several times.  In the end, I just started smoking weed and got off all the medications. I had to teach my brain to do what comes so easily to many people. I was told by my teachers I would never graduate highschool, but I did. I work in engineering and I don't need medication to focus at work. \n  \nI know that this is anecdotal and won't be the case for everyone, but I really wish we took a different approach to teaching kids. Some people just don't want to learn history... If everyone was good at leaning everything, teachers would learn valuable trade skills and make 3-4x the salary, but they don't. Some people are good teachers, some are good students, and others are great at fixing machines. You could be good at something else that isn't even taught in school. Don't limit yourself to only learning what our failed education system thinks you should learn.",
            "title_similarity": "0.7694754",
            "sentiment_compound": 0.9827
        },
        {
            "id": "gvxj6l4",
            "score": 27,
            "text": "Honestly I just think the issue is: almost no one understands what adhd actually means and now it's just a blankett term for any child that doesn't like school and also the fact that they don't even realize that they're giving their children amphetamines",
            "title_similarity": "0.70046705",
            "sentiment_compound": 0.3363
        },
        {
            "id": "gvxj27c",
            "score": 6,
            "text": "\"Seem\"? \n\nWhy are vague, informationless terms like this used in so many posts here? Something like \"Study shows...\" or \"Data indicates...\" is more appropriate.\n\nTBH the title of this post is a statement I could have made before the study...",
            "title_similarity": "0.4880893",
            "sentiment_compound": 0.6072
        },
        {
            "id": "gvxj5zc",
            "score": -4,
            "text": "This feels very much like it could only happen in the US",
            "title_similarity": "0.19737771",
            "sentiment_compound": 0.4173
        },
        {
            "id": "gvxhdlx",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.04365503"
        },
        {
            "id": "gvxh39v",
            "score": 75,
            "text": "Those aren't Machiavellian traits. People need to stop labeling them as such. He may have described them in a book, but he also described other traits as well. The confusion with Machiavellianism and 'bad' is one of the biggest observational errors in history and really shows a lack of understanding of the works he produced.",
            "title_similarity": "0.59374046",
            "sentiment_compound": -0.9177
        },
        {
            "id": "gvxt8e6",
            "score": 3,
            "text": "I love these studies that just prove what people know from common sense. \"Bad parents make bad decisions.\" Oh, interesting, do go on.",
            "title_similarity": "0.6863876",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gvxi5mj",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gvxqp1x",
            "score": 0,
            "text": "I would have expected that to be more down the the doctors, not the parents. French children with ADHD receive psychological help instead of medicine. But that is because this is the preferred approach by the doctors, not because the parents demand it to be this way. So I'm surprised US parents are able to overrule the advice of their doctor so easily. Since few parents have medical education or experience.",
            "title_similarity": "0.7633508",
            "sentiment_compound": 0.793
        },
        {
            "id": "gvxrl6i",
            "score": 0,
            "text": "Story time, but I’ll make it quick:\n\nMy parents’ parents were dying when I entered high school. They became even more distant and disconnected than before. Got a doctor to recommend ADHD medicine. \n\nI had had a leg injury and was relatively immobile for the summer I started the medication. Now someone please correct me if this dosing sounds incorrect, but as I remember it I was told to take 75mg per day, in a variety of pills. This is like smoking crystal meth a few times a day, while also not being able to move. I became incredibly good at Counterstrike, deep cleaned the house constantly, and also hallucinated so vividly that up until about 5 years after I thought all of the hallucinations were real. I slept 3 hours a night \n\nReturning to school my grades increased slightly but I was almost too focused. Sweating profusely all day long, I was an absolute mess. I eventually got off them on my own accord and to this day my parents think that I still took the medication through college but I only used it for going to the gym as a sort of methy preworkout (I don’t recommend this, I overexerted myself to the point of hernias, and serious over development of certain muscle groups)",
            "title_similarity": "0.6687325",
            "sentiment_compound": 0.9507
        },
        {
            "id": "gvxrqa3",
            "score": 0,
            "text": "My mother would full on think I was hyper and demand I take Benadryl to try and “calm me down” anytime I got mad",
            "title_similarity": "0.7208718",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gvxrz7z",
            "score": 0,
            "text": "Selfish and manipulative people in a position of power are more willing to subject the people over which they have power to stimulus for the sole purpose of the overall satisfaction as felt by the selfish and manipulative individual.\n\nThis...how is this a new understanding?",
            "title_similarity": "0.62141645",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gvxtca3",
            "score": 0,
            "text": "Was this study based in the neighborhood of Highland Park in Dallas, Texas? I think so",
            "title_similarity": "0.13508004",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvxvxd8",
            "score": 0,
            "text": "aka \"go pills\" in the slang of the Machiavellian guardians of US fighter pilots.  \n\n\ncitations:  \n[https://en.wikipedia.org/wiki/No-go\\_pill](https://en.wikipedia.org/wiki/No-go_pill)  \n[https://abcnews.go.com/2020/story?id=123779&page=1](https://abcnews.go.com/2020/story?id=123779&page=1)",
            "title_similarity": "0.49141857",
            "sentiment_compound": 0.2406
        },
        {
            "id": "gvxw2g3",
            "score": 0,
            "text": "> parents who believe the end justifies the means, are more likely to do things aligned with the mantra 'the end justifies the means'\n\nGosh I hate these articles.",
            "title_similarity": "0.7364545",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gvy7rdg",
            "score": 0,
            "text": "I suspect the truth is they didn't want to deal with kids being kids. Running around, being loud. Wanting attention.",
            "title_similarity": "0.5804084",
            "sentiment_compound": -0.0315
        },
        {
            "id": "gvz2bog",
            "score": 0,
            "text": "Tbf though ADHD medication is a lot less intrusive than most people seem to believe and have very few serious side effects if used in prescribed dozes. Most of them are simple stimulants and if you take them every day you'll build tolerance to the noticeable stimulating effects. They feel like a cup of coffee at most and have no altering effect on your personality, they just help calm the mind and decrease anxiety.\nPeople talk about them like they are anti-pshycosis drugs or something.\n\nNit defending abuse. Just disagree with how they are perceived.",
            "title_similarity": "0.65713465",
            "sentiment_compound": 0.3732
        },
        {
            "id": "gvzkjj2",
            "score": 0,
            "text": "A lot of parents will take their slightly awkward kid to a doctor and say \"Something must be wrong with my kid\" and then the doctor just throws some medication at them.",
            "title_similarity": "0.7263485",
            "sentiment_compound": -0.5279
        },
        {
            "id": "gvxm9u9",
            "score": 5,
            "text": "That's not going to improve focus and performance. Maybe temporarily at the beginning. That is quickly lost.",
            "title_similarity": "0.3654111",
            "sentiment_compound": -0.5727
        },
        {
            "id": "gvy1ik3",
            "score": -4,
            "text": "“Adhd” is one of pharmas best cash cows its not gonna change anytime soon. Nice for them its not as obvious when someone is an addict. The predation is disgusting but the drugs are fun.",
            "title_similarity": "0.6525537",
            "sentiment_compound": 0.775
        },
        {
            "id": "gvxc08v",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gvxl9jj",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.04365503"
        },
        {
            "id": "gvysynr",
            "score": 5,
            "text": "But why would they get the adhd meds in the first place if their kids are not adhd? This myth that adhd meds are given out like candy is bs. The testing I had to go through was super thorough  with tests and more tests, meeting  drs and  psychiatrists, questionnaires  for teachers and coaches and my parents",
            "title_similarity": "0.7930441",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gvxgk6p",
            "score": -1,
            "text": "What’s the deal with using the term „Machiavellians“. That dude wrote down his findings about statesmanship in „Il principe“, not a handbook advising people on being assholes. That term is getting a weird and, imho unjustified, renaissance (pun intended).",
            "title_similarity": "0.5481147",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gvxjg92",
            "score": 1,
            "text": "The health system is a big part of the problem for allowing events like this take place by not going through their due diligence and being fueled by profits",
            "title_similarity": "0.61134064",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gvxn83x",
            "score": -1,
            "text": "Is this just western style tiger parenting? It has a cooler name.",
            "title_similarity": "0.35592893",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvxseel",
            "score": -1,
            "text": "My brother experienced this. He started his drugs in like the second grade. He tried to stay off them, but life wasn't easy after years and years. Idk. My mom is out there, this fits like a glove and its eerie",
            "title_similarity": "0.6639167",
            "sentiment_compound": -0.4514
        },
        {
            "id": "gvxshkb",
            "score": -1,
            "text": "This fits. My ex put my son on ADHD medication, and she is the most Machiavellian person I know.",
            "title_similarity": "0.6646452",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvxtqa1",
            "score": -1,
            "text": "Intelligence comes with indifference and also the kids need the boost more when their parents didnt care.",
            "title_similarity": "0.73654723",
            "sentiment_compound": 0.4537
        },
        {
            "id": "gvxu2jh",
            "score": -1,
            "text": "Damn and here everyone in my school was having to get their own meth. What a rip.",
            "title_similarity": "0.4923195",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvxuwpn",
            "score": -1,
            "text": "Good parents are able to teach children discipline without resorting to drugs. If you let your kid play on an ipad all day, you're making it far more difficult for your children to focus.\n\nWhen an inner-city Black kid finds pornography at age 9 and does poorly in school, no one ever thinks to ask the kid if he watches pornography. And if the kid lies, his prospects are damaged because of his unwillingness to reveal such information. If an inner-city child consumes sugar for breakfast instead of protein, he or she will not be able to focus during class. And if the parents are up past midnight drinking or watching TV, there isn't a regimented home environment for the child to sleep early and get a good night's rest. The child will fall asleep in class, and this will set them back.",
            "title_similarity": "0.6597838",
            "sentiment_compound": -0.0754
        },
        {
            "id": "gvxw6oy",
            "score": 1,
            "text": "In my day, we had to finish our homework first before mom and dad let us get into the meth.",
            "title_similarity": "0.5594945",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvxx763",
            "score": -1,
            "text": "Sounds like a great way to get your child hooked on stimulants for the rest of their life!",
            "title_similarity": "0.61763275",
            "sentiment_compound": 0.784
        },
        {
            "id": "gvy7u2n",
            "score": -1,
            "text": "Ritalin - meth for your kids!",
            "title_similarity": "0.58504164",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvylbea",
            "score": 1,
            "text": "I have ADHD. I was given meds during my childhood. ADHD is so misunderstood, to the point where even a majority of the people that say they understand how ADHD is misunderstood are also misunderstood. I was able to end my relationship with all of my parents and family altogether. My partner did the same with her family. AMA.",
            "title_similarity": "0.70985353",
            "sentiment_compound": -0.7855
        },
        {
            "id": "gvxeftj",
            "score": 112,
            "text": "Ok. But doesn't a doctor decide if a patient needs medication? In which case shouldn't the focus be on medication standards not being high enough to prevent abuse? Instead of on parents who are more likely to follow a doctor's treatment advice. \n\nI could understand complaining if parents ignored treatment advice from doctors, but blaming them for following a treatment plan seems silly, regardless of why it was followed.",
            "title_similarity": "0.79676735",
            "sentiment_compound": -0.9461
        },
        {
            "id": "gvxgpwq",
            "score": -9,
            "text": "Boy this rankles me. I have been telling anyone who will listen that you cannot medicate behavior.",
            "title_similarity": "0.4929332",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvxaumo",
            "score": 2,
            "text": "Giving ADHD medication to otherwise healthy children as a parent? I didn't even know that was a thing.\n\nTIL I guess.",
            "title_similarity": "0.7471829",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gvxo7fz",
            "score": -2,
            "text": "Right. They enforce it on their kids \"in order to boost their performance\". That must be why I've met multiple irresponsible parents who get aderall for their kid while also \"acting like\" they take aderall all the time.. \n\nThere are some cases where ADHD shouldn't be treated with high dose stimulants. My brother was prescribed 70mg vyvanse at 8 years old! I'm a former drug addict, and seriously not even exaggerating at all, 70mg of vyvanse is ridiculous and gets you EXTREMELY zooted. It stunted his growth very badly and he won't talk to my step mom anymore since she was the one enforcing that he take that. He is convinced that pretty much all his problems were caused by taking hardcore stimulants through his childhood. I do feel that he should speak to her. She didn't consult anyone who uses drugs about this and thought what she was doing was right and giving him the medication that he needed. When in actuality, psychiatrists have to sell meds for pharmaceutical sales reps. \n\nI was prescribed adderall too. I react poorly. I have ADHD that is untreated, because I literally cannot handle stimulants. I never liked them either from a doctor, or for fun. They make me feel downright unhealthy. Sure, I do school and work a million times more efficiently. I do think that is probably the case for most people. But I feel extremely dehydrated, my bowels get nuts, I feel like I have to pee even when I just got done peeing... There's a list of reasons why it doesn't work for me. That or any stimulant. Not focalin, not ritalin, not concerta, not vyvanse, not aderall, not methamphetamine, not cocaine, you get the point \n\nI believe it helps many people. And it helps me too. But I have too extreme of side effects. And honestly, taking a high dose stimulant is not healthy for your heart or body, whether you have ADHD/ADD or not. But many people are helped by it, I honestly wish it was for me because I'd get so much done. But I'd rather do it on my own than take that stuff every day \n\nPeople talk about things like straterra.. it sort of interests me because I haven't spoken to a psychiatrist in a very long time about this. But I am curious to see what newer treatments there are available. It's hard for me to trust psychiatrists though. I got diagnosed by my last one after a 15 minute conversation on the phone with autism. I do not think I have autism. And I do not think she would know after 15 minutes over the phone. Especially when she immediately prescribed me 3 medications. Gabapentin, zyprexa and fluvoxamine. As well as renewing my hydroxyzine \n\nEither way my life has improved drastically just from consistent exercise, meditation and forcing myself to read for a few hours a day and forcing myself to start waiting tables to \"practice\" sociability. Just constant.. constant work on myself that I only started about a year ago, but has done wonders. I don't think amphetamines are right for me, despite them making me more productive same as everyone else who touches amphetamines",
            "title_similarity": "0.7830599",
            "sentiment_compound": 0.993
        },
        {
            "id": "gvxoygd",
            "score": 2,
            "text": "Seems logical. Amorality leading to amoral actions.",
            "title_similarity": "0.24209513",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gvxpx0f",
            "score": -2,
            "text": "In the US the biggest pushers of these drugs are school teachers.  If you have a high energy kid you can bet on getting a call from a teacher around the second grade.",
            "title_similarity": "0.64001954",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvxq7br",
            "score": -2,
            "text": "I think anyone can do well if they put their hearts to it. But it will take some time",
            "title_similarity": "0.39646736",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvxuqxu",
            "score": 2,
            "text": "So water is, in fact, wet...",
            "title_similarity": "-0.0032139532",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvxw3x0",
            "score": 2,
            "text": "Gotta love those parents who force a meth addiction on their kids.  Cause honestly, meth is cheaper in the states if you can’t get a prescription for amphetamines which can be about $50 per pill.",
            "title_similarity": "0.71760833",
            "sentiment_compound": 0.802
        },
        {
            "id": "gvy0d57",
            "score": -2,
            "text": "I would let me kids drink and smoke weed before I let them take adderall",
            "title_similarity": "0.471896",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvybzjh",
            "score": 2,
            "text": "This is a well know privileged white people’s game in elementary school, from a friend who is a child psychologist. Testing and professional evaluation is expensive and education plans can be enforced legally, and the results will give their kids accommodations for high stakes testing and therefore give them a leg up over other kids. The cost and commitment is often out of reach for poor kids, families whose culture and experience distrust doctors, or kids from immigrant families.",
            "title_similarity": "0.7820164",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gvyeg03",
            "score": 2,
            "text": "Just a quick second to say it’s kind of rotten to say the alternative to ADHD is “healthy.”",
            "title_similarity": "0.64881754",
            "sentiment_compound": -0.5563
        },
        {
            "id": "gvxnhf3",
            "score": -3,
            "text": "Parents - Drugs are disgusting, addicts are just lost souls with nothing to live for and want to drown their sorrows in a substance.\n\n\nAlso Parents - Here Susie, eat this Adderall so you can do better in school.",
            "title_similarity": "0.72169244",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gvxnm5a",
            "score": -4,
            "text": "Where does that leave teachers who indirectly recommend medication despite school policies stating they aren't allowed too?  Other studies show ADHD is often diagnosed when the child in fact needs physical activity.",
            "title_similarity": "0.73519313",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gvxtjwz",
            "score": 3,
            "text": "I was misdiagnosed with ADHD when I was a kid. Turns out I'm hearing impaired.",
            "title_similarity": "0.5262849",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvyoyry",
            "score": 4,
            "text": "What does that last part (n=1,360) mean?",
            "title_similarity": "0.19832264",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvzb1j0",
            "score": 4,
            "text": "Yikes. My 5 year old is obviously ADHD but I'm so hesitant to get him put on medication. But he can be so hard sometimes, especially for his teachers. It's a normal thing for me to come home from work and find my wife crying in the bathroom. My eldest son, not even the slightest bit ADHD. Just the middle child. But I hate the idea of cramming drugs down his throat because he's acting a way that's not in accordance with what's \"normal\". I mean, he's not an extremely awful child, in fact he's very intelligent, can be extremely compassionate and loving and caring. Its almost like an anxiety around crowds where he'll just act up and do things like just run wild (what 5 year old doesn't) and not listen (again broken record). But I feel lost. I love this child with all my being and I only want to make the right choice for him. But I also want his teachers, my wife and his classmates to have an enjoyable time too. The thing that drives me nuts is, when he wants to be good, he's the best, but when he wants to be bad, he can be pretty naughty.",
            "title_similarity": "0.7143221",
            "sentiment_compound": 0.9877
        },
        {
            "id": "gvxevun",
            "score": -4,
            "text": "Kids should be off limits, PEDs for adults should be on the table though.",
            "title_similarity": "0.47895667",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvxrkdb",
            "score": -4,
            "text": "Parents: Don't take drugs!\n\nAlso parents: Here, take some amphetamines! \n\n(It's questionable if this is even good for kids with actual ADHD).",
            "title_similarity": "0.70636857",
            "sentiment_compound": 0.3147
        },
        {
            "id": "gvx9js8",
            "score": 53,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gvxy1pz",
            "score": -6,
            "text": "ADHD is a gift.  Learn to exploit it.  It gives you special powers.  Stay away from drugs that dampen senses.",
            "title_similarity": "0.6502582",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gvxovxl",
            "score": 8,
            "text": "By the sounds of it these responses are based on questionnaires and potentialities, not experience, correct? The majority of responses here are in relation to the participants/parents actually haven given their kids unneeded drugs to get ahead academically or financially. \n\nDoes the study include the questions asked? (Can't read it atm)",
            "title_similarity": "0.7171568",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvy1qkt",
            "score": 6,
            "text": "Jokes on them. Unless you have adhd all you are doing is getting high.",
            "title_similarity": "0.53159595",
            "sentiment_compound": 0.25
        },
        {
            "id": "gvxel13",
            "score": 36,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gvx5whb",
            "score": 3249,
            "text": "Such parents, especially those with strong academic goals for their children, should know that “Contrary to popular belief across college campuses, attention deficit hyperactivity disorder (ADHD) medications may fail to improve cognition in healthy students and actually can impair functioning” [https://today.uri.edu/news/study-adhd-drugs-do-not-improve-cognition-in-healthy-college-students/](https://today.uri.edu/news/study-adhd-drugs-do-not-improve-cognition-in-healthy-college-students/) (The University of Rhode Island)\n\n“Results … show that the standard 30 mg dose of Adderall did improve attention and focus — a typical result from a stimulant — but that effect failed to translate to better performance on a battery of neurocognitive tasks that measured short-term memory, reading comprehension and fluency…\n\n…If your brain is functioning normally in those regions, the medication is unlikely to have a positive effect on cognition and my actually impair cognition. In other words, you need to have a deficit to benefit from the medicine”",
            "title_similarity": "0.7344707",
            "sentiment_compound": 0.8286
        },
        {
            "id": "gvxlve2",
            "score": 319,
            "text": "I appreciate the importance and implications of this study, but I am I being obtuse in thinking this is the obvious conclusion?\n\n>>parents with abusive tendencies are more likely to utilize medication in an abusive manner",
            "title_similarity": "0.7883419",
            "sentiment_compound": -0.9001
        },
        {
            "id": "gvxt87y",
            "score": 149,
            "text": "This is a subject near to my heart.  My kid suffers from severe ADHD+Hyperactivity.    At first I did NOT want to medicate her.  Instead, I worked with a specialist who worked with \"Spirited\" children, trying to adjust the behaviors that were getting her kicked out of school. This involved not only my daughter adjusting behaviors but MOM too.   \n\nWell, that only worked to a certain degree.  My kid was unable to sit still for more than 10-30 seconds at a time and would stand in the room and spin and spin and spit and then bounce herself off walls, throw her legs up in the air, kicking around.   This would go on for hours. \n\nFinally one day my 6 year old daughter says to me, \"Mom. Help me!  I want to be a good girl, I want to sit still at circle time and do my work, but my brain won't let me.  How do I tell it to let me???\"  \n\nThat was her cry for help.   I gave in and we started her on Ritalin.  I have to say it's been a life saver.  She's still a bright, very energetic but her thoughts aren't jumping from one subject to the next mid-sentence.  She can sit for 10 minutes and work on a math sheet or whatever.  Before the medication she could only work on a sheet for less than one minute before losing focus. \n\nShe's SO MUCH HAPPIER!  She cannot wait until it's time to take her medication every morning.  \n\nThank god for Ritalin right now. \n\n\nI just wish the pharmacy didn't treat me like a drug addict.   In my city (Oakland, Calif.) You can't refill the prescription until you only have 2 days left of the old one.   If you are incredibly busy, you have to fit the refill within those two days and they are VERY strict about it.    \n\nAlso, even though the pharmacy staff recognizes me from the monthly pick up and even knows me my name, they could not give me the medication the ONE TIME I didn't have my driver's license.   I had to drive all the way back across town to get it. \n\nIt's a real PAIN IN THE ASS and makes me feel like a god damned criminal.",
            "title_similarity": "0.8054247",
            "sentiment_compound": 0.9636
        },
        {
            "id": "gvxg6it",
            "score": 441,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gvxc6cs",
            "score": 952,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gvxtwjn",
            "score": 304,
            "text": "As someone who actually has adhd this pisses me off, when I was first going to my psychiatrist to tell them I wanted to get testet for adhd I was scared and ashamed.  I knew that the fact that I was a student would come up.\n\nEven after my diagnosis I felt guilty taking my medication because of all the negative press it had gotten",
            "title_similarity": "0.70714355",
            "sentiment_compound": -0.9354
        },
        {
            "id": "gvxnaj1",
            "score": 37,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gvxiuk5",
            "score": 60,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gvxtz3p",
            "score": 1707,
            "text": "As a teacher this comes as no surprise. It's the same mindset that holds boys back in Kindergarten so they will be older and bigger to play football in high school. It's frustrating.\n\nEta: this is only regarding parents who start their (usually boys) late in Kindergarten,  so they will be bigger and older than their peers to play football and or baseball in high school\n \nNot kids on the cusp, not maturity level, not holding kids back in a grade. Just so they will be bigger than the other high schoolers.",
            "title_similarity": "0.6378928",
            "sentiment_compound": 0.0222
        },
        {
            "id": "gvxdn1w",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gvxjuim",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gvxl8ym",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gvxn33s",
            "score": 1,
            "text": "Wrong flair, should be Psychology",
            "title_similarity": "0.34528416",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvxngag",
            "score": 2,
            "text": "I’d love to know what % of high achievers are on these drugs. \n\nI suspect at Ivy League schools the % of students with scripts is quite high. \n\nWonder how it compares to public schools.",
            "title_similarity": "0.59438264",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gvxq6tt",
            "score": 1,
            "text": "I think stimulants are used to increase alertness and motivation, not raise IQ. I,m not a fan of it, but people drink coffee around exams times too.",
            "title_similarity": "0.6925036",
            "sentiment_compound": 0.2189
        },
        {
            "id": "gvxq7ao",
            "score": 1,
            "text": "If doctors would've told my parents bath salts gets you straight As I would've been tweeking since first grade.",
            "title_similarity": "0.66155446",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gvxr7b9",
            "score": 1,
            "text": "Those 4 random 30’s on the ends are setting my  OCD on fire.",
            "title_similarity": "0.4363046",
            "sentiment_compound": -0.34
        },
        {
            "id": "gvxrdci",
            "score": 1,
            "text": "I have great shorterm memory skill but poor attention, and at school my result with medication was really night and day. In college I’ve never missed A. But I don’t use it anymore cause I didn’t find it very useful or helps me in other than those high stress, hyper focus in short time situation. It’s a unique environment to go in when you think about it.\nAnd I also think the memory doesn’t retain longer with the med. I perceive no difference.\nI wish I could’ve focus more on my friends and experience things instead of getting stupid A+ papers. Cause that’s what’s really last.",
            "title_similarity": "0.6686828",
            "sentiment_compound": 0.7015
        },
        {
            "id": "gvxrth8",
            "score": 3,
            "text": "It sounds like saying\n\nPeople who do any element in set of B are more willing to do x as compared people who do not do any element in set of B.Where x is an element of B.\n\nKind of unnecessary, unless you are low key trying to tell your bosses that x is an element of B",
            "title_similarity": "0.6277077",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gvxta59",
            "score": 7,
            "text": "Who could have guessed parents with an indifference to morality act immorally!",
            "title_similarity": "0.5529679",
            "sentiment_compound": -0.5562
        },
        {
            "id": "gvxu7tv",
            "score": 1,
            "text": "I was under the impression that adhd meds can only be given if there is a valid prescription for it, or does it differ across countries?",
            "title_similarity": "0.584834",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gvxua1l",
            "score": 1,
            "text": "Can perform a study too? I only need like $300k",
            "title_similarity": "0.3058567",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvxw6tx",
            "score": 1,
            "text": "\"unstable parents willing to drug kids to make them also unstable\"",
            "title_similarity": "0.6369164",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gvxwaro",
            "score": 2,
            "text": "Silicon Valley does it all the time.",
            "title_similarity": "0.20574015",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvxwgyv",
            "score": 1,
            "text": "Well this both a) explains alot and b) hit a little closer to home than I was ready for",
            "title_similarity": "0.42946464",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gvxwkrm",
            "score": 3,
            "text": "When normal people take speed guess what, they get increased focus too.",
            "title_similarity": "0.46134022",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvxwort",
            "score": 3,
            "text": "I guess I'm \"lucky\" in that my sister and I have legit ADD symptoms, but were never medicated because my callous, indifferent father took any sort of medical need as a personal slight against himself... we were frequently spanked for vomiting when ill.",
            "title_similarity": "0.6890734",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gvxwuxm",
            "score": 1,
            "text": "I was on the other side where I had attention problems my whole life but they didn’t want to give their kids drugs",
            "title_similarity": "0.5959171",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gvxx7mr",
            "score": 1,
            "text": "I have many traits and the last thing I want to do is drug my kid",
            "title_similarity": "0.5355462",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gvxx82l",
            "score": 1,
            "text": "How do you guage that?",
            "title_similarity": "0.08876692",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvxxhzh",
            "score": 1,
            "text": "Ever notice this is purely an American problem?",
            "title_similarity": "0.3094995",
            "sentiment_compound": -0.4522
        },
        {
            "id": "gvxxo9f",
            "score": 1,
            "text": "Makes sense that such parents would be concerned about their kids insufficiently serving their schemes.",
            "title_similarity": "0.7212227",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvxybli",
            "score": 2,
            "text": "I had a buddy who was forced by a teacher to take ADHD meds in 3rd grade, the teacher convinced his parents and he went on the meds. He ended up having an allergic reaction and it absolutely messed up his eye sight, still has glasses to this day. We found out later the teacher was trying to get any kid who was slightly misbehaving on the ADHD meds.",
            "title_similarity": "0.74392045",
            "sentiment_compound": -0.765
        },
        {
            "id": "gvxz0ah",
            "score": 3,
            "text": "I was prescribed adderall when I was a kid and it totally fucked up my childhood",
            "title_similarity": "0.57839155",
            "sentiment_compound": -0.6901
        },
        {
            "id": "gvxzi47",
            "score": 2,
            "text": "I rank pretty high in machiavellianism, i do struggle with a lot of things with my kid, but i try to do the best i can for her, I'd definitely never give her medicine she didn't need. My dad, however, did do this exact thing to me",
            "title_similarity": "0.67220616",
            "sentiment_compound": 0.8957
        },
        {
            "id": "gvxzp9y",
            "score": 2,
            "text": "I know someone who medicates their perfectly normal and well behaved child and I would certainly not be surprised if anyone applied those labels to her. She comes across as having her act together until you get to know her a bit and realize what a hot, steaming mess she is who uses people with no regard.",
            "title_similarity": "0.6813298",
            "sentiment_compound": 0.5162
        },
        {
            "id": "gvy0pbr",
            "score": 2,
            "text": "I took 90 mg of concerta a day from the age of 7-10 \n\nOof",
            "title_similarity": "0.24433474",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvy0xqi",
            "score": 1,
            "text": " I also just watched this episode of The Sopranos.",
            "title_similarity": "0.31069607",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvy1kwf",
            "score": 1,
            "text": "When your kids and your ego are directly tied together...",
            "title_similarity": "0.36426288",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvy1wbi",
            "score": 1,
            "text": "I don’t know about my kids, but most days I feel like I need something for focus and performance, just to keep up with them.",
            "title_similarity": "0.5336231",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gvy24l9",
            "score": 1,
            "text": "Seems like the articles confused the parents traits with that of the prescribers",
            "title_similarity": "0.6584343",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gvy2e1k",
            "score": 1,
            "text": "Like it or not morality often won't get you ahead in life.",
            "title_similarity": "0.3841858",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvy2m1z",
            "score": 1,
            "text": "I hope this is really rare. It reminds me of Munchausen’s by proxy.",
            "title_similarity": "0.48940712",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvy2st3",
            "score": 1,
            "text": "Machiavellianism--manipulativeness, callousness, and indifference to morality.\n\nSo yea, I think that seems pretty straight forward that they would use methods to manipulate their children, prescribing providers with a callous indifference to the immoral ramifications. Hypothesis wasn't a large leap!",
            "title_similarity": "0.7076572",
            "sentiment_compound": 0.2481
        },
        {
            "id": "gvy2ydy",
            "score": 1,
            "text": "I feel like this is obvious...",
            "title_similarity": "0.0012994278",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvy2zdr",
            "score": 1,
            "text": "parents with these kinds of traits shouldn’t have had children in the 1st place.",
            "title_similarity": "0.57343274",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvy30in",
            "score": 1,
            "text": "Sounds like me when I was 10. I was put on legal meth for 7 years when all my symptoms were from trauma and never dealt with",
            "title_similarity": "0.40391397",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gvy3mx3",
            "score": 1,
            "text": "So what kind of parent gives their toddler benadryl so they'll fall asleep sooner, just so the parent can relax? I mean, obviously dysfunctional, just wondering what trait that would be exactly.",
            "title_similarity": "0.74851376",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvy3tsu",
            "score": 1,
            "text": "So this proves that Machiavellianness is Machiavellian? It reminds me of those math proofs showing that circles are round.",
            "title_similarity": "0.44061637",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvy5l12",
            "score": 1,
            "text": "You mean straight up sociopaths with kids are OK with drugging said kids with performance enhancing drugs? I can't even pretend to be surprised.",
            "title_similarity": "0.65883726",
            "sentiment_compound": 0.7209
        },
        {
            "id": "gvy66cd",
            "score": 1,
            "text": "Lots of parents fake ADHD etc for their kids to get extra benifits I've seen this first hand and can stump the kids growth by putting them in special classes etc.",
            "title_similarity": "0.7823522",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gvy6ato",
            "score": 1,
            "text": "Does it actually boost focus and performance in non-ADHD people? Not really unnecessary if it does",
            "title_similarity": "0.5134623",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gvy6t3p",
            "score": 1,
            "text": "I bet they're more willing to give their kids A LOT of unnecessary medications.",
            "title_similarity": "0.8137334",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvy6veq",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.04365503"
        },
        {
            "id": "gvy792z",
            "score": 1,
            "text": "Ya, and no Doctor has EVER given Adderal to a person or child who didn’t need it? Psshhhh",
            "title_similarity": "0.3060651",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvy7d39",
            "score": 1,
            "text": "Just wait till they get access to CRISPR and boutique babies",
            "title_similarity": "0.48336887",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvy895u",
            "score": 1,
            "text": "Shout out to the parents who are the opposite way, so that when their kids need some medication, their parents won't let them take it out of embarrassment!",
            "title_similarity": "0.7407763",
            "sentiment_compound": -0.4926
        },
        {
            "id": "gvy8k6f",
            "score": 1,
            "text": "Tiger mums go \"more DOTS!\"",
            "title_similarity": "0.2989861",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvy8nlm",
            "score": 1,
            "text": "Doesn’t surprise me. Leaving my opinion aside for a moment, I have read elsewhere on Reddit in someone’s comment (no idea where this is) that at their child’s school, parents get offended if their kids aren’t selected for the gifted and talented program. They write emails to the school demanding their child gets admitted to GT. It’s not about the kid it’s about what the parents want the kid to be.",
            "title_similarity": "0.7348044",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gvy8udc",
            "score": 1,
            "text": "WOW my experience is the exact opposite. I have ADHD and my parents wanted me to try dealing with that without meds.",
            "title_similarity": "0.7001359",
            "sentiment_compound": 0.6739
        },
        {
            "id": "gvy90sw",
            "score": 1,
            "text": "Bigger chance of doing something amoral if you have the indifference to morality trait? \n\nI’m shocked!",
            "title_similarity": "0.50505686",
            "sentiment_compound": -0.5255
        },
        {
            "id": "gvy95iv",
            "score": 1,
            "text": "I take some issue with the wording in the headline here. ADHD kids are perfectly healthy, they just have a different neurotype. ADHD alone doesn't make someone \"sick.\"",
            "title_similarity": "0.6577614",
            "sentiment_compound": 0.8226
        },
        {
            "id": "gvy9jo9",
            "score": 1,
            "text": "They probably also make them go to bed early, too.",
            "title_similarity": "0.44003004",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvy9nvh",
            "score": 1,
            "text": "NNOOOoooOOOooooo... impossible. xD  \nDidn't we know it since 90s?",
            "title_similarity": "0.30950427",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gvy9xi0",
            "score": 1,
            "text": "Real science here, people. You came to r/science for facts and you get posts about a study about some parents being more \"willing\" giving kids ADHD meds.",
            "title_similarity": "0.81907815",
            "sentiment_compound": 0.3976
        },
        {
            "id": "gvyaret",
            "score": 1,
            "text": "yes. blame the parents.",
            "title_similarity": "0.4242444",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gvyaylp",
            "score": 1,
            "text": "One of the girls I graduated with got ADHD medicine so she could pass nursing",
            "title_similarity": "0.6445458",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvyb237",
            "score": 1,
            "text": "My parents were the opposite. I'm pretty sure I have ADHD, but my parents didn't want me to grow up on drugs.\n\nA few years ago I got a prescription for adderall. It was a low dose, the doc wanted to see how it effected me, but it was not what I expected. Moment-by-moment, I couldn't feel it, but.. at the end of the day, I'd suddenly realize that I had absolutely no procrastination issues and got done, what would normally take me like a week to do, in a day.\n\nI wish I could afford insurance. Hell, I'd settle for not being fined for my unforgivable sin of being unable to afford it. (yay New Jersey for keeping literally the dumbest part of the ACA! Make sure those insurance companies absolutely never have to leave the comfort of their seller's market!)",
            "title_similarity": "0.731814",
            "sentiment_compound": -0.6104
        },
        {
            "id": "gvyb2y8",
            "score": 1,
            "text": "Mine made sure I didn't get any treatment for my mental health, in addition to causing most of my trauma.",
            "title_similarity": "0.47845277",
            "sentiment_compound": -0.1935
        },
        {
            "id": "gvybb9x",
            "score": 1,
            "text": "“Machiavellian parent” is in no way a clinical or scientific way to describe a person",
            "title_similarity": "0.28065723",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvybol5",
            "score": 1,
            "text": "Dad: Do you love me, son?” \n\nMe: “Yes.” \n\nDad: “Good, because if you didn’t then I’d make you fear me.”",
            "title_similarity": "0.6429669",
            "sentiment_compound": 0.25
        },
        {
            "id": "gvybz77",
            "score": 1,
            "text": "It's almost like people can't actually raise a kid right or something.  \n\n\nor maybe I'm just speaking for my parents and the fact I never wanted to have kids because they did such a horrible job...",
            "title_similarity": "0.5953419",
            "sentiment_compound": -0.3167
        },
        {
            "id": "gvyc7dj",
            "score": 1,
            "text": "That's all a fancy way of saying that they are assholes who are willing to screw up their kid's brain chemistry, possibly causing permenant harm",
            "title_similarity": "0.6650846",
            "sentiment_compound": -0.8271
        },
        {
            "id": "gvycc54",
            "score": 1,
            "text": "This title appears misleading. The article states \"hypothetically.\"",
            "title_similarity": "0.29008758",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvychmc",
            "score": 1,
            "text": "Adderall is just amphetamine salts. Only in America do parents tell their kids to say \"No\" to drugs so they can hook them on pharmaceutical uppers.",
            "title_similarity": "0.7264578",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvyd33c",
            "score": 1,
            "text": "wish this had happened to me :/ i got the exact opposite",
            "title_similarity": "0.36634737",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gvyddye",
            "score": 1,
            "text": "When did parents start prescribing adhd medication? I thought that was a doctors job?",
            "title_similarity": "0.7033411",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvydupg",
            "score": 1,
            "text": "Woof. It was a trip being raised by parents who simultaneously believed that I was both biologically broken enough to require medication AND that it was all a calculated choice to be that way just to manipulate people.",
            "title_similarity": "0.7451816",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvydzni",
            "score": 3,
            "text": "I didn’t know a parent could just decide to give controlled substances to their kids. Doesn’t a doctor have to decide that? After making a determination that it’s necessary?",
            "title_similarity": "0.6714267",
            "sentiment_compound": 0.4696
        },
        {
            "id": "gvye23j",
            "score": 1,
            "text": "And then people like me with ADHD get treated like drug addicts for needing medicine all because Karen wants to get her kid into Ivy League without paying despite having the money for it",
            "title_similarity": "0.80323815",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gvye2cf",
            "score": 1,
            "text": "TIL that's a thing. Does that actually improve your focus?",
            "title_similarity": "0.2988023",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvyebiu",
            "score": 1,
            "text": "My sister is one of these people.  She is a soulless c-nut.",
            "title_similarity": "0.43448687",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvyek1l",
            "score": 1,
            "text": "Can someone ELI5, what's the difference between having Machiavellian traits and having ASPD (Antisocial personality disorder)?",
            "title_similarity": "0.49462557",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvyepzf",
            "score": 1,
            "text": "Of course we’re going to blame the parents, but not do anything about the doctors who went to medical school and prescribed unnecessary medication to children.",
            "title_similarity": "0.68248785",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gvyewea",
            "score": 1,
            "text": "This is what happened to my friend when he was a kid and now he's addicted to pills. It's fucked up",
            "title_similarity": "0.56680346",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvyfact",
            "score": 1,
            "text": "Ime it was always the wealthy parents that hopped their kids up on speed. Maybe wealth and machevalian traits are correlated as well.",
            "title_similarity": "0.5900543",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gvyfl95",
            "score": 1,
            "text": "I thought executive function medications didn't work if you already had good executive function.",
            "title_similarity": "0.557158",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvyflsg",
            "score": 1,
            "text": "Hey this one's about me!",
            "title_similarity": "0.081066206",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvyflwg",
            "score": 1,
            "text": "Did you hear? New study helps our fearmongering agenda by telling you that you're a bad parent if you give your kid ADHD medication",
            "title_similarity": "0.8114382",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gvygd6g",
            "score": 1,
            "text": "I knew a kid that was pretty normal just a bit of an anarchist. They took that as some signs and started giving him loads of ADHD and ADD medication. It really messed with him and turned him towards a much larger drug problem.",
            "title_similarity": "0.70736635",
            "sentiment_compound": 0.0534
        },
        {
            "id": "gvygkom",
            "score": 1,
            "text": "Everyone who’s taken adderall knows it’s basically meth. Dextroamphetamine that’ll keep you awake for 3 days yeah it’s pretty fuckin close.",
            "title_similarity": "0.5350044",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gvyhyxn",
            "score": 1,
            "text": "What’s the downside to taking them to help you focus if you don’t have adhd??",
            "title_similarity": "0.6125946",
            "sentiment_compound": 0.264
        },
        {
            "id": "gvyl0x2",
            "score": 1,
            "text": "Most parents who give this to their kids are just parents who don't want to deal with their kids.",
            "title_similarity": "0.5691185",
            "sentiment_compound": -0.0572
        },
        {
            "id": "gvyla8e",
            "score": 1,
            "text": "One thing I find truly bizarre about ADHD treatment is how relatively easy it is to get a diagnosis/treatment as a child, yet much more difficult as an adult. The expectation seems to be that everyone with ADHD would have been noticed and diagnosed in school as a child, so any undiagnosed adults should be regarded with suspicion. Or needing to get tested as an adult is just something that never happens, so testing facilities put an age cap. So, we can trust little kids to express their needs accurately and take these stimulant medications, but not full grown adults? Completely backwards.",
            "title_similarity": "0.82825524",
            "sentiment_compound": 0.1787
        },
        {
            "id": "gvynf88",
            "score": 1,
            "text": "People need to realize that ADHD medication such as adderal and Vyvanse aren’t meant to make you cognitively SMARTER. It’s to improve your attention. It prevents you from getting distracted while studying. If you’re hoping that it’ll make you magically smarter it won’t. If you have terrible study habits then adderal will also not help you.",
            "title_similarity": "0.7254845",
            "sentiment_compound": 0.7162
        },
        {
            "id": "gvynwcm",
            "score": 1,
            "text": "In other words, bad parents.",
            "title_similarity": "0.4080418",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvynxmb",
            "score": 1,
            "text": "My parents don't even want me to take my pills",
            "title_similarity": "0.48355627",
            "sentiment_compound": -0.0572
        },
        {
            "id": "gvyoha1",
            "score": 1,
            "text": "Huh, was the opposite of my father. Not the callousness or manipulation, just the giving me unknown meds",
            "title_similarity": "0.51638854",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gvyoplz",
            "score": 1,
            "text": "I'm fairly shure I'm retroactively fucked up from all of the ADHD meds I was on as a kid, you name it I was probably on it.",
            "title_similarity": "0.61080736",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gvyr47g",
            "score": 3,
            "text": "There is nothing that is more frustrating to ke than the idea of giving non-ADHD kids that sort of medication. They just create more problems for us",
            "title_similarity": "0.7602973",
            "sentiment_compound": -0.3991
        },
        {
            "id": "gvyr4ox",
            "score": 1,
            "text": "hmm, the people i know who got adhd drugs got them bc parents or teachers thought it would make the kids more easy to control. it was more about the hyper-activity than the attention issue.",
            "title_similarity": "0.81742525",
            "sentiment_compound": 0.4927
        },
        {
            "id": "gvyrcol",
            "score": 6,
            "text": "Poor Machiavelli, wrote his works after being tortured by a powerful family to teach kinder morals and his name is now synonymous for 'cruelty for the sake of success.'",
            "title_similarity": "0.6533462",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gvyrglt",
            "score": 1,
            "text": "So.. manipulative people are more likely to do a manipulative thing?",
            "title_similarity": "0.47233462",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvyrp46",
            "score": 1,
            "text": "I feel like this just speaks more to how hyper competative schools have become.",
            "title_similarity": "0.5291133",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvys70x",
            "score": 1,
            "text": "No one is doing this. According to the article this is a “hypothetical” situation.",
            "title_similarity": "0.14591518",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvyse04",
            "score": 1,
            "text": "Well I didn’t have Machiavellian parents but I definitely suffered with ADHD medication. Swore that I would never go back.  Though I will say that these days the extended release stuff is WAY better than anything I had in the 90’s. I feel like I could probably get used to it without any serious problems.\n\nTo add to this, I NEEDED it as a kid. I was off the walls and I could spend hours on a single worksheet if the medication wore off or I didn’t take it.",
            "title_similarity": "0.74692446",
            "sentiment_compound": 0.8784
        },
        {
            "id": "gvysnzm",
            "score": 1,
            "text": "What annoys me is how Doctors readily prescribe that medication for anyone who visits them. There is a whole system of failure and the only victim is the patient.",
            "title_similarity": "0.6395565",
            "sentiment_compound": -0.802
        },
        {
            "id": "gvyt7fv",
            "score": 1,
            "text": "Wow , I am so surprised...",
            "title_similarity": "0.11441338",
            "sentiment_compound": 0.7424
        },
        {
            "id": "gvyta1r",
            "score": 1,
            "text": "Feels like my life could've been so much better this way.  \n ¯\\\\\\_(ツ)\\_/¯",
            "title_similarity": "0.5106045",
            "sentiment_compound": 0.6887
        },
        {
            "id": "gvyu00e",
            "score": 1,
            "text": "Really? Who thought? Some of these \"studies\" are a joke",
            "title_similarity": "0.32987684",
            "sentiment_compound": 0.3736
        },
        {
            "id": "gvyu0eh",
            "score": 1,
            "text": "I'm looking forward to their next study, 'Cold Potatoes Aren't Hot'.",
            "title_similarity": "0.512874",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvyuiyj",
            "score": 1,
            "text": "Well hell, I coulda told you that.",
            "title_similarity": "0.17739138",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvyv7lc",
            "score": 1,
            "text": "This is one of the least surprising headlines I've seen in a while",
            "title_similarity": "0.27672368",
            "sentiment_compound": -0.2057
        },
        {
            "id": "gvyvlct",
            "score": 1,
            "text": "“Machiavellians are more likely to act Machiavellian. “\n\nThanks, I guess.",
            "title_similarity": "0.475977",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvywlko",
            "score": 1,
            "text": "I’d like to see some info on narcissist parents denying kids adhd medication as well. My parents refused to admit anything was wrong with me, and that I was very functioning, but that my academic marks just reflected laziness. The 80s were a bad time to be an underachiever.",
            "title_similarity": "0.7928461",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gvywn43",
            "score": 1,
            "text": "Parent: \"How would I know if my child has ADHD, rather than something else?\"\nDoctor: \"Well, they would have difficulty with attention.\"\nParent: \"Ok, so what is ADHD?\"\nDoctor: \"It's having difficulty with attention.\"",
            "title_similarity": "0.7732816",
            "sentiment_compound": -0.4696
        },
        {
            "id": "gvyxls8",
            "score": 1,
            "text": "Damn I wish my parents had been Machiavellian and given my undiagnosed ass some meds instead of floundering for 3 decades.",
            "title_similarity": "0.701038",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gvyxo09",
            "score": 1,
            "text": "I don’t see the percent of those who have insurance listed. Because we were poor af as kids. I’m sure we all have ADD or ADHD but no health care means we didn’t go to the doctor when where actually sick so mental disorders didn’t even blip on the radar.",
            "title_similarity": "0.58650875",
            "sentiment_compound": -0.902
        },
        {
            "id": "gvyxz84",
            "score": 1,
            "text": "Alt headline: New study confirms higher chance of Machiavelli heritage if you're on ADHD meds.",
            "title_similarity": "0.6735451",
            "sentiment_compound": 0.25
        },
        {
            "id": "gvyygi3",
            "score": 1,
            "text": "Living with a 'macihiavellian' parents can be so stressful, it can lead to ADHD easily. So they might know the kids will show symptoms anyway, giving them medication beforehands might be a preemptive measure.\n\nPlease note the above statement was only sarcastic, and don't want to give any lousy parent any excuse at all.",
            "title_similarity": "0.7932342",
            "sentiment_compound": -0.5519
        },
        {
            "id": "gvyyzao",
            "score": 1,
            "text": "some crazy parent make their sane kids take meds",
            "title_similarity": "0.8004283",
            "sentiment_compound": -0.34
        },
        {
            "id": "gvyz7k7",
            "score": 1,
            "text": "“No mom I will not snort this adderall”",
            "title_similarity": "0.41948193",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvyz9pz",
            "score": 1,
            "text": "This is not really a surprise",
            "title_similarity": "0.040461835",
            "sentiment_compound": -0.2547
        },
        {
            "id": "gvyzj4t",
            "score": 1,
            "text": "Worst part is the general physicians doping the children with dosages big enough for adult males.",
            "title_similarity": "0.64568686",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gvyzpu3",
            "score": 1,
            "text": "My ex claimed she was ADHD, I think it was female Aspergers.  She wouldn’t get out of bed until the meds kicked in then she would sit on the couch and play candy crush for an hour.   It’ll make you do more work, not better work",
            "title_similarity": "0.68210566",
            "sentiment_compound": -0.2191
        },
        {
            "id": "gvyzret",
            "score": 1,
            "text": "Jokes on them, I spit my meds after I heard it was basically meth and would rot your brain. Occasionally I would be openly off them for a while and if my grades slipped someone would say something about taking it again any I would just pay more attention in class and still palm the pills.",
            "title_similarity": "0.69839364",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gvz05s5",
            "score": 1,
            "text": "Diagnosed ADHD. I didn’t start taking amphetamines until I was an adult. They changed my life; turned my life around for the better.",
            "title_similarity": "0.72992766",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gvz0jy3",
            "score": 1,
            "text": "I hate these pop psych stories. Should prolly read the story but finding in the title could also be read - \"people who are more honest on a survey, say things on survey that are more honest\"",
            "title_similarity": "0.70125115",
            "sentiment_compound": 0.8566
        },
        {
            "id": "gvz0lzg",
            "score": 1,
            "text": "Why did i think those were airtags",
            "title_similarity": "0.19186267",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvz14ko",
            "score": 1,
            "text": "This can be a double edged sword tho. I’ve had ADHD since I was at least in the 5th grade. My parents didn’t want to give me medication for it because they didn’t want to “drug” their kid. I started taking Vyvanse in college (prescribed) and it made a huge difference for me. I feel like if I had that from the beginning I would’ve gotten a lot more out of school",
            "title_similarity": "0.7294976",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gvz25ra",
            "score": 1,
            "text": "Or keep them quiet and in a corner drawing stuff.",
            "title_similarity": "0.1065637",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvz299s",
            "score": 1,
            "text": "Can just change your title to Chinese parents. Before you get fuzz about it, I am Chinese. I am entitled.",
            "title_similarity": "0.41723755",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gvz2g11",
            "score": 1,
            "text": "\"Bad Parents Do Bad Things\"   \nShocking discovery!",
            "title_similarity": "0.49678016",
            "sentiment_compound": -0.8748
        },
        {
            "id": "gvz58cz",
            "score": 1,
            "text": "TIL assholes tend to be assholes towards kids.\n\n*Who knew.*",
            "title_similarity": "0.5124624",
            "sentiment_compound": -0.8225
        },
        {
            "id": "gvz5ag6",
            "score": 1,
            "text": "This has been going on since the 1980s.",
            "title_similarity": "0.089129925",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvz5v6e",
            "score": 1,
            "text": "Damn slytherins at it again.",
            "title_similarity": "0.27073976",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvz6fnt",
            "score": 1,
            "text": "Study finds that selfish and questionable parents are likely to do selfish and questionable things to their kids!!!",
            "title_similarity": "0.6735285",
            "sentiment_compound": -0.8879
        },
        {
            "id": "gvz6msh",
            "score": 1,
            "text": "Yeah, the wittle doctors and pharma industry did/do noting wrong.",
            "title_similarity": "0.5231195",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gvz71w1",
            "score": 1,
            "text": "My aunt was a medical assistant with an illegal prescription pad and gave her kids all kinds of behavior-altering medications pretty much from the time they were toddlers instead of parenting. One thankfully is building a good life for herself. The other is not at all doing okay and has had substance abuse issues pretty much forever. It’s extremely sad. Both of their parents were disasters and the kids/now adults never got the chances they should have.",
            "title_similarity": "0.732615",
            "sentiment_compound": -0.5244
        },
        {
            "id": "gvz72h6",
            "score": 1,
            "text": "As somebody with actual ADHD I hate articles like this because, for the most part, they only serve to further stigmatize my needed medication and delegitimize the very real debilitating issues I deal with on a daily basis.",
            "title_similarity": "0.64035153",
            "sentiment_compound": -0.296
        },
        {
            "id": "gvz7c37",
            "score": 1,
            "text": "As a mental health counselor I can say. Don't give your kids medication if they don't need. Sometimes even if they do need it, put it as the last option.",
            "title_similarity": "0.5809247",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvz7jxo",
            "score": 1,
            "text": "From the other hand we all drink some coffee to do that.\n\nAre there any long term studies about the risks of small doses of ADHD drugs administrated to non ADHD sufferers?",
            "title_similarity": "0.62544763",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gvz7kje",
            "score": 1,
            "text": "There's an Amanda Bynes rabbit hole on the internet if anyone wants to follow that. She was on this medication throughout The Amanda Show and her producer allegedly abused her for years with her parents consent it seems. Worth looking at because it really should be mainstream news. Too lazy to post links but they're out there.",
            "title_similarity": "0.7022188",
            "sentiment_compound": -0.25
        },
        {
            "id": "gvz8meg",
            "score": 1,
            "text": "I know a shocking number of young parents who are lazy and were not prepared to have children who are preparing to get prescriptions for their 5 year old, perfectly normal kids... doctor shopping and everything.",
            "title_similarity": "0.69354117",
            "sentiment_compound": -0.0941
        },
        {
            "id": "gvz98mp",
            "score": 1,
            "text": "Oh no, some parents want their kids to actually succeed and excel instead of just slopping their way through life? How terrible and awful!",
            "title_similarity": "0.73357296",
            "sentiment_compound": 0.1759
        },
        {
            "id": "gvz9g63",
            "score": 1,
            "text": "Bad parents are bad parents. This cost how much we could have spent on cancer research? Like what is anyone supposed to even do with these findings?",
            "title_similarity": "0.6918936",
            "sentiment_compound": -0.8823
        },
        {
            "id": "gvza3yh",
            "score": 1,
            "text": "Well, this doesn’t apply to all situations. I know someone who refused to medicate their kids and the daughter’s school performance (and subsequent life performance) was not even half of her potential.",
            "title_similarity": "0.520421",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gvza4bi",
            "score": 1,
            "text": "Practically ALL medical prescriptions of amphetamines to pre-pubescent children is wrong.  \n\n\nOn both an medical/ethical foundation, lacking rigorous scientific justification.   \n\n\nThis is regardless of the characteristics or motivations of the parents.",
            "title_similarity": "0.69975984",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gvzaata",
            "score": 1,
            "text": "This is the other side of being too eager to wanna accept ADHD as a legit diagnosis. Our generation has no shame anymore, always wanting to be diagnosed 10x different things. This is a consequence of that.",
            "title_similarity": "0.72647715",
            "sentiment_compound": 0.7687
        },
        {
            "id": "gvzbkuv",
            "score": 1,
            "text": "This is so sad. Kind of reminds me of my sister and the way she treats my niece and nephew",
            "title_similarity": "0.5761512",
            "sentiment_compound": -0.6113
        },
        {
            "id": "gvzcbyo",
            "score": 1,
            "text": "Parents don't give drugs to their children unless a doctor suggests and approves it. \n\nParents cannot prescribe drugs to their children. Point fingers accurately.",
            "title_similarity": "0.65976954",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gvzduzk",
            "score": 1,
            "text": "Wait. So in the US it's common for kids(adults?) to take ADHD drugs without prescription just to boost their focus?!",
            "title_similarity": "0.7872478",
            "sentiment_compound": 0.5191
        },
        {
            "id": "gvzdwkg",
            "score": 1,
            "text": "Bad parents are bad at parenting. Go figure.",
            "title_similarity": "0.55475867",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gvzdzls",
            "score": 1,
            "text": "Be interested if their is a way to test parents for this before they medicate .. I saw alot my friends born in the 90s end up on meds me included..who ended up chasing hard drugs after being stopped meds due to finishing school..as adults didn't have adhd back then apparently.",
            "title_similarity": "0.76845247",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gvzeu9n",
            "score": 1,
            "text": "Not really relevant to the study, but man Machiavelli gets a bad rap.",
            "title_similarity": "0.427901",
            "sentiment_compound": -0.6956
        },
        {
            "id": "gvzf4p7",
            "score": 1,
            "text": "I knew it! Lazy parenting is always better. I mean, you still have to feed them 'n stuff but you don't have to micromanage every god damn thing.",
            "title_similarity": "0.6074053",
            "sentiment_compound": -0.2481
        },
        {
            "id": "gvzf51g",
            "score": 1,
            "text": "As someone who is tremendously in need for an ADHD screening and subsequent treatment, this just seems horribly stupid",
            "title_similarity": "0.5886505",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gvzfgoy",
            "score": 1,
            "text": "Not just drugs. I've seen parents demand other services in the (often mistaken) belief that therapies (I was a speech-language pathologist) for true disabilities will provide enrichment and/or accommodations for standardized testing to boost scores. Parents simultaneously wanted unneeded help and higher performance on testing. And parents of children with real needs often did not want their children \"labeled\" with a disability code so would decline the treatment that would have helped their kid. I don't miss the daily wrangling.",
            "title_similarity": "0.87883013",
            "sentiment_compound": 0.6621
        },
        {
            "id": "gvzgj7m",
            "score": 1,
            "text": "r/insaneparents r/parentsareassholes",
            "title_similarity": "0.45137",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvzhg0d",
            "score": 1,
            "text": "I was on every pill ever tried for misbehaving children. Now it all seems so much more sinister",
            "title_similarity": "0.5745977",
            "sentiment_compound": -0.7996
        },
        {
            "id": "gvzhtoy",
            "score": 1,
            "text": "I’m not sure if I can blame my parents (I think they made a fine choice given the circumstances and research at the time), but I am definitely concerned about having taken stimulant medication since being 5 years old. \nI don’t think it’s possible for there to be no negative residual effects.",
            "title_similarity": "0.68310934",
            "sentiment_compound": 0.7761
        },
        {
            "id": "gvzi8be",
            "score": 1,
            "text": "Off topic but Ford should release a special edition of their new electric car called the Avellian... The Mach-E Avellian. I’ll see myself out.",
            "title_similarity": "0.46106112",
            "sentiment_compound": 0.5499
        },
        {
            "id": "gvzi8gs",
            "score": 1,
            "text": "Ffs I came to Reddit for a pick me up and this headline made me tear up. Why can't people stop being horrible.",
            "title_similarity": "0.56099653",
            "sentiment_compound": -0.7515
        },
        {
            "id": "gvzid2h",
            "score": 1,
            "text": "Wow, am in the middle of a final project in college and I chose this topic because of my experience as a kid. So weird how this comes up on my feed soon after! I’ll have to cite this. Thanks for posting",
            "title_similarity": "0.45812297",
            "sentiment_compound": 0.7372
        },
        {
            "id": "gvzir8t",
            "score": 1,
            "text": "Niccolò Machiavelli: I hate you all.",
            "title_similarity": "0.3474717",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gvzj6t6",
            "score": 1,
            "text": "The only people who push this in Australia are the schools and government. You literally have to fight for years to get your children medicated. Thankfully parents are waking up and its really only lazy parents and narcissistic people who keep pushing it.",
            "title_similarity": "0.6125367",
            "sentiment_compound": -0.3774
        },
        {
            "id": "gvzkgsl",
            "score": 1,
            "text": "WILD! Because my mom was very Machiavellian and she refused to give me the meds I needed. Also- I wonder what would happen if people treated insulin of antipsychotics like they treat ADHD meds.",
            "title_similarity": "0.7050737",
            "sentiment_compound": 0.5093
        },
        {
            "id": "gvzkjrn",
            "score": 1,
            "text": "But is this bad or harmful for the child? The article does not mention.",
            "title_similarity": "0.41774425",
            "sentiment_compound": -0.7709
        },
        {
            "id": "gvzkknd",
            "score": 1,
            "text": "mea while my parents were callous, manipulative and indifferent and DIDN'T try and get me adhd meds despite the fact that I fuckin have the damn thing",
            "title_similarity": "0.53961194",
            "sentiment_compound": -0.5809
        },
        {
            "id": "gvzkup2",
            "score": 1,
            "text": "I could have told them that for free",
            "title_similarity": "0.2632243",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gvzlcxz",
            "score": 1,
            "text": "Parents with symptoms of undiagnosed ADHD more likely to give their kids ADHD medication. Huh, who knew",
            "title_similarity": "0.8320584",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvzlsw9",
            "score": 1,
            "text": "“Sociopath parents more likely to exhibit sociopathic behavior, new study finds”",
            "title_similarity": "0.673972",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvzmg5f",
            "score": 1,
            "text": "wonder when the studies about parents giving hormones to children will come out since the Adhd phase has passed and we've moved onto gender disorders.",
            "title_similarity": "0.7527582",
            "sentiment_compound": 0.34
        },
        {
            "id": "gvzml4f",
            "score": 1,
            "text": "Seems like there’s been a bunch of “assholes are gonna asshole” studies released recently.",
            "title_similarity": "0.42673153",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvzmoay",
            "score": 1,
            "text": "My dad is actually Machiavelli himself",
            "title_similarity": "0.30435216",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvzmsyt",
            "score": 1,
            "text": "To be fair its hard to know what the best course of action is in this situation",
            "title_similarity": "0.2870744",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gvzntib",
            "score": 1,
            "text": "On the other side of the spectrum, my authoritarian parents didn’t believe in mental disorders (there’s only “crazy” or “not crazy”) and I went untreated for ADHD and major depressive order through middle and high school. Had to end up paying for therapy out of pocket at $200/week at 19.  The American healthcare system is so wack.",
            "title_similarity": "0.64859235",
            "sentiment_compound": -0.4391
        },
        {
            "id": "gvzoqz4",
            "score": 1,
            "text": "Bizarrely, nothing seems to give kids ADHD like ADHD medicine. Although that may be the point.",
            "title_similarity": "0.5809353",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvzot9m",
            "score": 1,
            "text": "Get em hooked on illegal drug use early- anything to get that sweet, sweet.... slightly more competitive gpa in 3rd grade sdjkfsjkdfh\n\nNo but for real, drugging your kid for something so stupid is by itself abuse, if you ask me. Amphetamines aren't safe at all for non-adhd people, period. This isn't a \"small\" thing to do or a \"temporary boost\" or whatever they've convinced themselves it is. It's an amphetamine. It's a slower form of meth(amphetamines), and that's just that. People with ADHD have different brain structures and process it differently, and more safely. Non-ADHD children do not. People like this do not deserve custody of their child.",
            "title_similarity": "0.7645447",
            "sentiment_compound": -0.7451
        },
        {
            "id": "gvzp7fi",
            "score": 1,
            "text": "When you actually have ADHD and now struggle to manage your medication because you’re in school and your psychiatrist just thinks you’re trying to either sell or take unnecessary meds. Like please. I keep forgetting where my notebooks are and I’m weeks behind because I can’t bring myself to go to class.",
            "title_similarity": "0.6735128",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gvzpyr9",
            "score": 1,
            "text": "How do they account for the differences in diagnostic ability between parents? Like I wouldn't really expect every parent to be equally capable of diagnosing ADHD.",
            "title_similarity": "0.71277225",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gvzqqkw",
            "score": 1,
            "text": "In other words, narcissistic (Machiavellian) parents have less patience and empathy and are more likely to give their children drugs.",
            "title_similarity": "0.7496208",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvzr8xs",
            "score": 1,
            "text": "If it was insulin would you say it was unnecessary?",
            "title_similarity": "0.45145488",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvzrm90",
            "score": 1,
            "text": "Unrelated question, what is the (n=1,360) for? Seen many times but never thought to ask about it.",
            "title_similarity": "0.37202054",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvzscwj",
            "score": 1,
            "text": "This is my crackhead mom. The punchline is that she was a school psychologist all this time. Oh I also saw her on the local news back home recently. What time to be alive or something",
            "title_similarity": "0.5759812",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gvzsmj8",
            "score": 1,
            "text": "The same kind of assholes who see their kids as tools to further their own interests, rather than actual people they’re responsible for caring for and raising to be a proper adult. \n\nIt’s like they think they’re going to live forever.",
            "title_similarity": "0.6845548",
            "sentiment_compound": 0.6003
        },
        {
            "id": "gvzsvlg",
            "score": 1,
            "text": "Well, I thought I had those bad traits. I tend to judge myself so harshly. I’d never give that stuff to my kids though unless it was an absolute last resort and even then I’d have to think long and hard about it.",
            "title_similarity": "0.58666867",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gvzsxl5",
            "score": 1,
            "text": "It's why I want it for myself as an adult and wish I could have it. It boosts my performance in most aspects of my life.",
            "title_similarity": "0.55399394",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gvzthhn",
            "score": 1,
            "text": "A reminder that one of the more popular ADHD medications is Methamphetamine. So... yeah.",
            "title_similarity": "0.59162885",
            "sentiment_compound": 0.6478
        },
        {
            "id": "gvzuasy",
            "score": 1,
            "text": "This article hits close to home man. My parents did the exact same thing to me when I was completely unwilling to take the medication. I sometimes wonder if I even had ADHD or if it was reinforced by the environment around me.",
            "title_similarity": "0.677238",
            "sentiment_compound": 0.0
        },
        {
            "id": "gvzvivd",
            "score": 1,
            "text": "Holy balls! Thats a SUPER specific study.",
            "title_similarity": "0.25911748",
            "sentiment_compound": 0.7118
        },
        {
            "id": "gvzw35k",
            "score": 1,
            "text": "After watching the ted ed video on machiavelli, this title seems wrong. I get what they were going for though.",
            "title_similarity": "0.5898981",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gvzx4j1",
            "score": 1,
            "text": "What about the parents who put their kids in school a year early, saying how advanced their kid is, when it is just so they don’t have to pay for daycare? Then their kid can’t cope, so then they medicate them, and complain about how other kids are much too big for their grade.",
            "title_similarity": "0.7329617",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gvzxkzd",
            "score": 1,
            "text": "Man, we're really getting into the meat of dystopian sci-fi AI stories now. I'm excited!",
            "title_similarity": "0.48990703",
            "sentiment_compound": 0.4003
        },
        {
            "id": "gvzzdp9",
            "score": 1,
            "text": "I thought the common argument by doctors was that the meds won’t effect you like that if you don’t have the disorder? \n\nI’ve always personally felt this had to be incorrect and this article seems to affirm that",
            "title_similarity": "0.6946455",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gvzzy4m",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.021041559"
        },
        {
            "id": "gw01g4h",
            "score": 1,
            "text": "I feel personally attacked by this",
            "title_similarity": "0.19941418",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gw03k3r",
            "score": 1,
            "text": "So at least that's an upside for the poor kids.",
            "title_similarity": "0.36992598",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gw0418v",
            "score": 1,
            "text": "Holyshit...  \n\nHonestly, I don’t think my parents were machiavellian.  I think they were genuinely perplexed by me being a child and not an outstanding child.  I also think that the fkn doctors who anded out Ritalin and Adderall like candy to fkng children back when I was a kid have a lot of blame here, but I can also say that it had long term consequences - as in, I’m in my 30s and I don’t think I’ll ever be able to not use Adderall.",
            "title_similarity": "0.75743157",
            "sentiment_compound": -0.1803
        },
        {
            "id": "gw07x7z",
            "score": 1,
            "text": "It’s not just getting their kids on drugs that increase performance and focus, it’s also getting a diagnosis that warrants extended time on tests- in school and standardized tests.",
            "title_similarity": "0.68639463",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gw0ekmf",
            "score": 1,
            "text": "I wish humanity could use drugs like fantasy potions or sci-fi stims.",
            "title_similarity": "0.6136154",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gw0gzs4",
            "score": 1,
            "text": "Abusive parents more likely to abuse kids!!",
            "title_similarity": "0.61176026",
            "sentiment_compound": -0.882
        },
        {
            "id": "gw0mlnq",
            "score": 1,
            "text": "\"immoral people are immoral\"",
            "title_similarity": "0.29857177",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gw0rnxt",
            "score": 1,
            "text": "For sure I can see some parents totally thinking that way",
            "title_similarity": "0.4135228",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gw0wbcq",
            "score": 1,
            "text": "This does not mean your parents are like this just because they made you take medication",
            "title_similarity": "0.63882864",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw1fgoe",
            "score": 1,
            "text": "What if doctors only prescribed the medication to those who needed it ?",
            "title_similarity": "0.5615363",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw1vpwt",
            "score": 1,
            "text": "I wouldn't be surprised to see a scientific article in this sub that studies find that hot water is not cold. Should just change the name to r/ social engineering puff pieces.",
            "title_similarity": "0.54388773",
            "sentiment_compound": -0.1695
        },
        {
            "id": "gwgb8a5",
            "score": 1,
            "text": "Yes, more fuel for ADHD medication misconceptions and fear from doctors who go on to underdiagnose people who need help. Glad this is getting so much traction.",
            "title_similarity": "0.8139973",
            "sentiment_compound": 0.6369
        }
    ]
}