{
    "New research has found that the vertical turbine design is far more efficient than traditional turbines in large scale wind farms, and when set in pairs the vertical turbines increase each other’s performance by up to 15%. Vertical axis wind farm turbines can ultimately lower prices of electricity.\n": [
        {
            "id": "gw1j1sr",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.4199993",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gw1wl6a",
            "score": 0,
            "text": "I'm not an engineer or anything, but if Cities Skylines has taught me something, it's that the vertical turbines are definitely more cost effective. Takes less space, provides better power output, only negative is the cost.",
            "title_similarity": "0.6776854",
            "sentiment_compound": 0.7595
        },
        {
            "id": "gw1v02d",
            "score": 0,
            "text": "I’ve played enough video games to know the nifty vertical ones are always superior.",
            "title_similarity": "0.4142313",
            "sentiment_compound": 0.8225
        },
        {
            "id": "gw1rlsk",
            "score": -3,
            "text": "Anyone who has ever had a squirrel cage fan should know how much more air it throws than a traditional fan.",
            "title_similarity": "0.5204749",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gw2afnk",
            "score": -1,
            "text": "Still incredibly space inefficient with much larger detrimental overall effects on the environment than nuclear while being massively more expensive.\n\nI’m all for investing into making the technology for wind and solar better, but we need to stop ignoring the solution to the energy problem that was been in front of us the whole time but unable to be utilized because scared boomer politicians put up too much red tape around it.",
            "title_similarity": "0.6358433",
            "sentiment_compound": -0.802
        },
        {
            "id": "gw1rpfz",
            "score": -11,
            "text": "Lower the price of electricity, aka increase the supply of bitcoin",
            "title_similarity": "0.519922",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gw1vuve",
            "score": 0,
            "text": "Yes, this is how helical turbines work.\n\nEdit: Also see Darrieus wind turbines & VAWT.",
            "title_similarity": "0.4476543",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw22y7v",
            "score": -1,
            "text": "They've known this for decades. \n\nAnd still they build the giant fans.",
            "title_similarity": "0.34768516",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2aeun",
            "score": -2,
            "text": "Ya. Nukes are still better.",
            "title_similarity": "0.4310653",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw1wfko",
            "score": -15,
            "text": "I would like to see the relative effect on migrating bird populations. Horizontal wind mills are responsible for a large part of human causes migratory bird deaths each year somewhere between 140,000 and 500,000. Maybe vertical wind mills could help alleviate some of that number too on top of the space that they require over horizontal mills.",
            "title_similarity": "0.65667075",
            "sentiment_compound": 0.8225
        },
        {
            "id": "gw1kxg4",
            "score": 6,
            "text": "Hasn’t this been known for like 20 years already?",
            "title_similarity": "0.20274454",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw1vdyn",
            "score": 7,
            "text": "IIRC, there was also a study that indicated that VAWT also reduce bird deaths by quite a lot.. something like 75-80% reduction. Simply because the turbines are easier to see.",
            "title_similarity": "0.7774191",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gw1xr5p",
            "score": -7,
            "text": " **Vertical axis wind farm turbines can ultimately lower prices of electricity.** \n\nThis is a very odd way to spell increase profits.",
            "title_similarity": "0.7524272",
            "sentiment_compound": 0.1045
        },
        {
            "id": "gw1o616",
            "score": 38,
            "text": "[removed]",
            "title_similarity": "-0.0761691"
        },
        {
            "id": "gw1yt43",
            "score": -12,
            "text": "Do they kill fewer birds?",
            "title_similarity": "0.2697392",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gw1ji2m",
            "score": -24,
            "text": "This really isn’t much of a surprise when you think about it. Vertical turbines are omnidirectional so the wind can spin the turbine from any direction. Versus a traditional turbine that needs to be facing into the wind",
            "title_similarity": "0.58110285",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw24lio",
            "score": 8,
            "text": "Just use evolutionary simulation to find the best turbine design and placement\n\nLet the simulation runs for a year\n\nThe wind just blows in a physics simulator and the AI is rewarded for every watt gained",
            "title_similarity": "0.63269687",
            "sentiment_compound": 0.875
        },
        {
            "id": "gw1yj60",
            "score": -5,
            "text": "If you played cities: skylines you would know this",
            "title_similarity": "0.22495134",
            "sentiment_compound": 0.34
        },
        {
            "id": "gw1zbxx",
            "score": 0,
            "text": "Makes perfect sense. Surface areal compared with footprint alone seems to be enough.",
            "title_similarity": "0.38646528",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw1zt9g",
            "score": 0,
            "text": "They could even do multiple tiers of turbines on one post with this vertical axis to produce even more energy.",
            "title_similarity": "0.62183976",
            "sentiment_compound": 0.3384
        },
        {
            "id": "gw20p0i",
            "score": 0,
            "text": "That last line there...is why this won't take hold.",
            "title_similarity": "0.080135636",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw20p7c",
            "score": 0,
            "text": "Dyson Electric thanks you.",
            "title_similarity": "0.29658106",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw22l7y",
            "score": 0,
            "text": "So...Halo Reach was right?",
            "title_similarity": "0.17041424",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gw22qhm",
            "score": 0,
            "text": "Question: Why aren't Wind Turbines covered in solar cells?\n\nEven if they are there to keep the internal capactitors topped up (don't know how a turbine works but assuming it's more complicated than \"wind makes fan spin\")",
            "title_similarity": "0.5079863",
            "sentiment_compound": 0.4497
        },
        {
            "id": "gw230vp",
            "score": 0,
            "text": "Somehow I just know \"...lower energy prices\" will someday translate into \"...increased shareholder returns\".",
            "title_similarity": "0.61526287",
            "sentiment_compound": 0.25
        },
        {
            "id": "gw24ael",
            "score": 0,
            "text": "I may sound stupid and I know nothing about turbines or wind but I mean wind does go sideways",
            "title_similarity": "0.33054113",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw24d8d",
            "score": 0,
            "text": "But what happens when Texas freezes",
            "title_similarity": "0.13135625",
            "sentiment_compound": -0.0387
        },
        {
            "id": "gw257ds",
            "score": 0,
            "text": "One thing I've learned over the years is anytime something comes out that'll lower prices it never does for the customer, only for the business. Why pass on the savings to your customers when you can profit off of it? It's not like power companies have competition and things like installing solar panels is only really something upper middle class folk can afford due to the initial investment.",
            "title_similarity": "0.6318687",
            "sentiment_compound": 0.2709
        },
        {
            "id": "gw2596v",
            "score": 0,
            "text": "You think the electric company will actually pass on any of the savings. Hahahahahahahahah",
            "title_similarity": "0.4679398",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw26j7m",
            "score": 0,
            "text": "> can ultimately lower prices of electricity.\n\nThat's bad news cuz no corpo wants this",
            "title_similarity": "0.46172103",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gw26p2j",
            "score": 0,
            "text": "And yet my state insists on going w traditional crap tech standard turbines. Could it be because GE is in our state?",
            "title_similarity": "0.4289437",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gw27m4b",
            "score": 0,
            "text": "City Skylines and Sim City already taught me this years ago...",
            "title_similarity": "0.24523738",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw28dm3",
            "score": 0,
            "text": "How has this not been known already? Your not having to reposition with wind direction changes.  That alone.  It just...spins!",
            "title_similarity": "0.23097365",
            "sentiment_compound": -0.3164
        },
        {
            "id": "gw28fjd",
            "score": 0,
            "text": "This title looks like it is from some strategy game: Consultations! You've just discovered vertical wind turbines. Wind turbines efficiency have increased by 15%.",
            "title_similarity": "0.76497597",
            "sentiment_compound": 0.75
        },
        {
            "id": "gw28ij1",
            "score": 0,
            "text": "This seems like an obvious thing to me. Bigger blades spinning on an axis that isn’t fighting gravity is like a much better idea. Less maintenance due to less stress on the shaft as well",
            "title_similarity": "0.6720374",
            "sentiment_compound": 0.6115
        },
        {
            "id": "gw28jax",
            "score": 0,
            "text": "All I can think of is that those were in halo reach.",
            "title_similarity": "0.11103308",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gw28vcj",
            "score": 0,
            "text": "Yeah, right! Lower electricity prices or increase profits for corporations that sell it at same price as before?",
            "title_similarity": "0.68517107",
            "sentiment_compound": 0.6696
        },
        {
            "id": "gw29jr1",
            "score": 0,
            "text": "Well written comment. Thank you.",
            "title_similarity": "0.1817685",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gw2a0gu",
            "score": 0,
            "text": "I’m sure if GE thinks they can generate a bit more power out of them they will be right on it. Thank god there is no cultural divide on wind turbine axis orientation.",
            "title_similarity": "0.6438141",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gw2ahm1",
            "score": 0,
            "text": "World of Warcraft had all the windmills in the Tauren starting area set up as vertical.  I remember thinking that was an interesting stylistic choice.  Turns out WoW developers were ahead of the curve.",
            "title_similarity": "0.48459423",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gw2alm8",
            "score": 0,
            "text": "Yeah but won't they all just take off? \n\nAnd if packed together they'll take off in a group with a whole bunch of earth attached! \n\nSo either floating mountains of Pandora or the start of a proper Cloud City?",
            "title_similarity": "0.28072977",
            "sentiment_compound": 0.3076
        },
        {
            "id": "gw2atew",
            "score": 0,
            "text": "Nice idea, but I've never seen utility prices go down despite the renewables cost being essentially free compared to the cost of running a conventional power station.\n\nWe've seen nuclear power stations decommissioned but no reduction in price despite no longer paying the substantially higher subsidies they got compared to coal powered stations.",
            "title_similarity": "0.6361886",
            "sentiment_compound": 0.7079
        },
        {
            "id": "gw2b2i1",
            "score": 0,
            "text": "Almost like every scifi and futuristic game or book I've ever seen already predicted this.",
            "title_similarity": "0.30907512",
            "sentiment_compound": 0.2975
        },
        {
            "id": "gw2cr7c",
            "score": 0,
            "text": "All the Cities Skyline peeps! Our time has come!",
            "title_similarity": "0.15826441",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2d0ir",
            "score": 0,
            "text": "But... but... what about the birds!?",
            "title_similarity": "0.08400203",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2d6vs",
            "score": 0,
            "text": "Hmm... sounds like SOMEONE finally played some Zelda.",
            "title_similarity": "0.23807792",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gw2f81o",
            "score": 0,
            "text": "Imagine living in a world where a corporation would lessen the cost of something because they learned how to make it cheaper and more efficient.",
            "title_similarity": "0.6558782",
            "sentiment_compound": 0.4754
        },
        {
            "id": "gw2fwua",
            "score": 0,
            "text": "I don't know why but looking at the design I would 100% say that the vertical one is more efficient for some reason.",
            "title_similarity": "0.60612524",
            "sentiment_compound": 0.6297
        },
        {
            "id": "gw2g46e",
            "score": 0,
            "text": "https://www.srf.ch/sendungen/einstein/migrieren-einstein-webseite/windkraft-aus-der-vertikalen\n\nThis is a swiss article and video from 2013 displaying basically this concept. This technology has been known for years but the public just never really cared for it. Sad to see that probably this paper isn‘t going to get much attention either.",
            "title_similarity": "0.4416922",
            "sentiment_compound": -0.8163
        },
        {
            "id": "gw2g9cw",
            "score": 0,
            "text": "Yesss, some real science",
            "title_similarity": "0.26422116",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2h465",
            "score": 0,
            "text": "And they are safer and easier to service!",
            "title_similarity": "0.39317125",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gw2l4vh",
            "score": 0,
            "text": "This has been known for awhile. Those giant propellers suck.",
            "title_similarity": "0.32228744",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gw2rdt1",
            "score": 0,
            "text": "So what will happen to the obsolete models that can’t be recycled?  \n\nI’ve seen more than a few broken turbines, and I get the sinking feeling that wind companies will fold or change their names, and then some group of idealist government employees will be stuck with cleaning up the mess.\n\nI’m not anti-wind, but the rush to install these farms has been extremely ecologically irresponsible. The already imperiled prairies are being absolutely ruined. There’s not nearly enough thought about the immediate impacts to prairie animals or the end-life of all of this.",
            "title_similarity": "0.55359215",
            "sentiment_compound": -0.9137
        },
        {
            "id": "gw2rpr3",
            "score": 0,
            "text": "Any decrease in bat deaths with this design?",
            "title_similarity": "0.30971846",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2w83d",
            "score": 0,
            "text": "Innacurate title. The data shows that appropriately-spaced and counter-rotating vertical-axis wind turbines can provide an efficiency improvement of up to 15% compared to control VERTICAL axis wind turbines. The study makes no comparison or claim of vertical axis wind turbine efficiency improvement over control HORIZONTAL axis wind turbines.",
            "title_similarity": "0.72040427",
            "sentiment_compound": 0.8316
        },
        {
            "id": "gw314ie",
            "score": 0,
            "text": "They won't lower prices though. The difference will go into share holders pockets.",
            "title_similarity": "0.39778242",
            "sentiment_compound": 0.4745
        },
        {
            "id": "gw3fssi",
            "score": 0,
            "text": "Another day on r/science, another overpromising headline that doesn't reflect reality at all.\n\nThis isn't a breakthrough. verticals are not \"far more efficient\".",
            "title_similarity": "0.37443918",
            "sentiment_compound": -0.3713
        },
        {
            "id": "gw3gbk5",
            "score": 0,
            "text": "You magnificent bastards I’m in! Let’s paint them pretty colors!",
            "title_similarity": "0.27430677",
            "sentiment_compound": 0.5696
        },
        {
            "id": "gw3ukw0",
            "score": 0,
            "text": "For starters-On Average, when compared to most modern first world Coal, Nuclear, Natural Gas facilities (not 1970s 'guides' or third world aggregates):\n\nHow much carbon emissions are required to produce Wind Turbines?  \n\n\nHow much carbon emissions are required to transport Wind Turbines?  \n\n\nHow much carbon emissions are required to install Wind Turbines?  \n\n\nHow much carbon emissions are required to maintain Wind Turbines throughout lifetime?\n\nWhat is the lifetime of a Wind Turbine?\n\nNext:\n\nWhat happens to the materials and turbine upon end of life?  \n\n\nHow much carbon emissions are required to destroy, transport, and where do they end up?\n\nFinally:\n\nWhat is the subsidy  applied by UK, DE, or USA?  \n\n\nIf you remove such subsidy what is the cost on kWh?  \n\n\nWhat is the suggested lifetime carbon emission reduction (not accounting for all of the above)  \n\n\nWhat is the actualized lifetime carbon emission reduction (OR INCREASE) accounting for all of the above\n\nBe careful ingesting rhetoric. Ask the questions not ever asked.  \n\n\nDo your own research. Think empirically.",
            "title_similarity": "0.6692995",
            "sentiment_compound": 0.5563
        },
        {
            "id": "gw3w1hh",
            "score": 0,
            "text": "  u   know are love m  e s  6  o           l \nxx CFthn  q a\n 4, l \n   5th xrr . \n(9zw\nv ?  uv\nl   bn.",
            "title_similarity": "0.30832434",
            "sentiment_compound": 0.9217
        },
        {
            "id": "gw3wt3e",
            "score": 0,
            "text": "You mean raise the price of electricity.",
            "title_similarity": "0.42997912",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw47712",
            "score": 0,
            "text": "OR we build nuclear for less that doesnt need gas back up!",
            "title_similarity": "0.48647135",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4b471",
            "score": 0,
            "text": "Science says, that there are in fact 2 genders/sexes: male and female",
            "title_similarity": "0.32432315",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4fkr0",
            "score": 0,
            "text": "Why not scrap them all and go nuclear?",
            "title_similarity": "0.14548501",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4kc4k",
            "score": 0,
            "text": "Nuclear energy is far superior to any green energy fad.",
            "title_similarity": "0.60186857",
            "sentiment_compound": 0.8225
        },
        {
            "id": "gw1wjdo",
            "score": -1,
            "text": "It's hard to get excited about this when there's also the \"[Skybrator](https://www.theguardian.com/environment/video/2021/mar/16/bladeless-wind-turbine-creates-quite-a-buzz-before-rollout-video)\"",
            "title_similarity": "0.4926881",
            "sentiment_compound": 0.25
        },
        {
            "id": "gw21x06",
            "score": -1,
            "text": "Do the [unrecyclable composite turbine blades wear out](https://www.bloomberg.com/news/features/2020-02-05/wind-turbine-blades-can-t-be-recycled-so-they-re-piling-up-in-landfills) 15% faster as well?",
            "title_similarity": "0.67291594",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw246j7",
            "score": 1,
            "text": "Cities Skylines has known this for years!",
            "title_similarity": "0.19847298",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw27v6b",
            "score": -1,
            "text": "So crypto mining can use it all up again",
            "title_similarity": "0.30517724",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw290ca",
            "score": -1,
            "text": "Or a nuclear power plant which is better than turbines.",
            "title_similarity": "0.5939308",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw29nks",
            "score": -1,
            "text": "How did they not know this? Did they not conduct tests on different designs before they plopped these things all over the country side?",
            "title_similarity": "0.2486658",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2as2v",
            "score": -1,
            "text": "Great design! I hope they're less dangerous to birds too?",
            "title_similarity": "0.424021",
            "sentiment_compound": 0.6689
        },
        {
            "id": "gw2b7ya",
            "score": -1,
            "text": "Okay who is the largest supplier and manufacturer of these things?\n\nFor stock info so I can makes teh monies",
            "title_similarity": "0.5016747",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gw2bg9w",
            "score": 1,
            "text": "I’ve always wondered if these VATs could be surrounded by some apparatus that funnels in the wind to accelerate it, and if so, whether that would actually increase production.",
            "title_similarity": "0.54430664",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw2kmf0",
            "score": 1,
            "text": "Somehow i don’t believe it will reduce prices.  The rich still wants to be rich",
            "title_similarity": "0.41808754",
            "sentiment_compound": 0.802
        },
        {
            "id": "gw32lz0",
            "score": -1,
            "text": "The biggest problem with wind farms will always be storage. Large numbers of Lead acid batteries are not a good idea.\n\nOther problems include what to do when the vanes wear out and bird kills.",
            "title_similarity": "0.49966508",
            "sentiment_compound": -0.8835
        },
        {
            "id": "gw3vy0j",
            "score": -1,
            "text": "Look up the book “Bright Green Lies”",
            "title_similarity": "0.15665367",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw1tme6",
            "score": -7,
            "text": "That looks like it will chew up a flock of seagulls in about two seconds.\n\nhttps://abcbirds.org/program/wind-energy-and-birds/",
            "title_similarity": "0.40947416",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw29tmh",
            "score": -2,
            "text": "Okay.\n\nWhat about fitting those giant hollow towers with some desalinization equipment?\n\nWater an power from the same utility right of way.",
            "title_similarity": "0.42052937",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gw2g69r",
            "score": 2,
            "text": "No one has a plan yet for dealing with turbine waste. The best anyone can come up with. Is to crush the blades up, and use it as filler in plastics. Usually old blades just sit in fields because they're to big to haul off whole.",
            "title_similarity": "0.45207244",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gw32hqf",
            "score": -2,
            "text": "Bring back nuclear energy first please",
            "title_similarity": "0.20822951",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gw32yae",
            "score": 2,
            "text": "Wait for the conservative media to come out with reasons why this is bad.",
            "title_similarity": "0.26658985",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw4ciw2",
            "score": -2,
            "text": "Capacity factor of wind turbines is around 35%. They're great if you only want power when it's windy, but if you want reliable power you need substantial spinning mass on standby, powered by something that runs night and day; oil, coal, nat gas or nuclear",
            "title_similarity": "0.7184751",
            "sentiment_compound": 0.6542
        },
        {
            "id": "gw260a8",
            "score": 3,
            "text": "Maybe someone else can comment on this.  While the 15% gain from closeness and proximity, is fantastic; realistically it does not change the price of electricity.\n\nPower is easy to generate, it’s the storage and infrastructure needed that causes the rates we see.\n\nSo while this is well deserved applause, until each home has its own battery, and alternative sources to generate said resources, prices would still stay the same or as usual, continue to rise. No?",
            "title_similarity": "0.7703375",
            "sentiment_compound": 0.93
        },
        {
            "id": "gw1ty75",
            "score": 63,
            "text": "just saw a YT video where the woman basically said \"show me one that works, not a drawing on napkin or a computer simulation.\" they are making it seem like efficiency is the goal when it's actual power generation that counts.",
            "title_similarity": "0.42020744",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gw1y80g",
            "score": -5,
            "text": "“They” don’t want to be too efficient. Money needs to made. Remember that.",
            "title_similarity": "0.28385907",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gw2987e",
            "score": 4,
            "text": "Typical Horizontal Axis Turbines (HATs) get more productive as they get bigger, but they also have HUGE wake fields that prevent nearby turbines from working effectively. The biggest ones need to be miles apart.\n\nVATs can be placed densely, and you can actually place them so that their wake fields IMPROVE the performance of other nearby VATs so that a group can work more effectively than the sum of its parts. They're awesome.",
            "title_similarity": "0.72732604",
            "sentiment_compound": 0.9775
        },
        {
            "id": "gw1jxby",
            "score": 706,
            "text": "I'm a bit skeptical, my main skepticism is \"why didn't anyone think of this before?\" I don't study this, but I'd like to believe people thought of this but dismissed it as being inefficient at some point.  \n\nIt's this a reputable source?",
            "title_similarity": "0.29998714",
            "sentiment_compound": 0.3527
        },
        {
            "id": "gw1skg9",
            "score": 75,
            "text": "[removed]",
            "title_similarity": "-0.0761691"
        },
        {
            "id": "gw1u457",
            "score": 23,
            "text": "Shout out to all the engineers and scientists who keep improving things",
            "title_similarity": "0.3821782",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gw1xt6r",
            "score": 9,
            "text": "I've heard that one of the main problems with vertical windmills is they're extremely hard on the bearings at the base. Anecdotally only, though someone else might be able to expand on that.",
            "title_similarity": "0.48966002",
            "sentiment_compound": -0.2716
        },
        {
            "id": "gw1uyl8",
            "score": -11,
            "text": "Why are we still studying wind power? Isn't it just terribly inefficient, as in, the materials and energy required to produce turbines is not produced by the turbines?",
            "title_similarity": "0.45331642",
            "sentiment_compound": 0.658
        },
        {
            "id": "gw1xr19",
            "score": 214,
            "text": "What about maintenance costs? If I remember correctly, vertical designs tend to create uneven wear of the base since the air flow is pushing on one point which impacts the bearing loads.",
            "title_similarity": "0.45411947",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw22x96",
            "score": 663,
            "text": "Whoo, my time to shine! Wind turbine researcher checking in.\n\nPotential issues with the article:\n\n1. They only look at 2 or 3 turbines. Farms with more than 3 may not experience such benefits.\n2. They only consider the *increase* in production over the baseline (the turbines operating independently). VAWTs are known to produce significantly less power than \"normal\" turbines, so it's still likely that a wind farm with \"normal\" turbines generates more power than a farm of VAWTs. However, worth considering, evaluating, and researching, which is likely why they got published.\n\nWind tubines are cool machines, regardless!",
            "title_similarity": "0.7649739",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gw1vech",
            "score": 4138,
            "text": "Here is what a vertical-axis wind turbine looks like, in case you had no idea like me\n\nhttps://www.researchgate.net/publication/333316757/figure/fig1/AS:761705160261639@1558616070610/Different-kinds-of-vertical-axis-wind-turbines-VAWT-a-Savonius-b-Darrieus-with.jpg",
            "title_similarity": "0.47741318",
            "sentiment_compound": -0.2047
        },
        {
            "id": "gw1x53r",
            "score": 599,
            "text": "People have been touting VATs for decades but have yet to make one viable enough to outperform, or even match standard HATs. I'm curious what the problem is.",
            "title_similarity": "0.4121477",
            "sentiment_compound": -0.2382
        },
        {
            "id": "gw1tlpc",
            "score": 2988,
            "text": "Link to the actual paper rather than the uni press release - [https://www.sciencedirect.com/science/article/pii/S096014812100344X](https://www.sciencedirect.com/science/article/pii/S096014812100344X)",
            "title_similarity": "0.32288024",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw1v6wh",
            "score": 3,
            "text": "That would be pretty amazing if it turned out true.\n\nVAWTs can also work with higher windspeeds, iirc.\n\nThat would make a field ideal for off-shore work.",
            "title_similarity": "0.62472016",
            "sentiment_compound": 0.9217
        },
        {
            "id": "gw1x7pr",
            "score": 1,
            "text": "I wonder if the blades of vertical farms suffer in the same way as traditional wind turbines.",
            "title_similarity": "0.56863755",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw1zb95",
            "score": 1,
            "text": "If it's good enough for kevin costner to survive it surely must be fine for the rest of us.",
            "title_similarity": "0.30609632",
            "sentiment_compound": 0.765
        },
        {
            "id": "gw1zjjb",
            "score": 1,
            "text": "This is really awesome news!",
            "title_similarity": "0.22206081",
            "sentiment_compound": 0.6893
        },
        {
            "id": "gw1zury",
            "score": 1,
            "text": "Wind turbines need to be able to be put in a neutral position for high wind events. Traditional variable pitch props are easy, it's been done for years on planes. How do these designs neutralize themselves to handle high winds?",
            "title_similarity": "0.62233937",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw205fs",
            "score": 1,
            "text": "Does anyone know how vertical and horizontal wind turbines differ in cost of construction and maintenance? If this press release is believed to be true, are there financial barriers to implementation, or will the increased efficiency make up the difference and then some?",
            "title_similarity": "0.71311283",
            "sentiment_compound": 0.7757
        },
        {
            "id": "gw20tgv",
            "score": 1,
            "text": "IceWind has been doing this for a while. In Iceland we can’t use traditional wind turbines cuz it’s too damn windy.",
            "title_similarity": "0.43072426",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gw21cev",
            "score": 1,
            "text": "Are the airflow patterns affecting the other turbines dependent upon the wind direction? If the wind direction changes, is the benefit lost from one turbine to the others? Or is it designed to allow airflow benefit to affect the other turbines in the path of the wind flow? \n\nHow does this affect the birds in the area of the turbines?",
            "title_similarity": "0.46682137",
            "sentiment_compound": 0.7622
        },
        {
            "id": "gw22ydg",
            "score": 1,
            "text": "Lots of factors come into play here.  Although the blades can be much simpler on a VAWT than a HAWT, the blades have to be held out away from the tower by a beam or two.  To achieve the same amount of swept area as modern HAWT with a VAWT is difficult.",
            "title_similarity": "0.57234216",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gw23k4o",
            "score": 2,
            "text": "I think some of the skeptics in the comments need to learn the challenges of big wind farms.  Blade transport to the site is a big one, this makes that way easier.  Servicing those blades is difficult as well.  Bigger blade, bigger footprint, which has somewhat of a diminishing return on the space required va energy produced.\n\nThese are just a few points off the top of my head.",
            "title_similarity": "0.7494253",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gw23wnh",
            "score": 1,
            "text": "This isn't new. I attended a talk by a Caltech professor back in 2007. Part of the basis for it studying things in nature that move in concert like schools of fish and birds in formation.",
            "title_similarity": "0.3515293",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw24m09",
            "score": 6,
            "text": "IIRC the biggest limiting factor is the bearing replacement.",
            "title_similarity": "0.38684183",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw25jpq",
            "score": 1,
            "text": "Are there any pictures of this computational flow physics?",
            "title_similarity": "0.23188254",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw25xx1",
            "score": 1,
            "text": "Been hearing this for a decade, yet somehow they haven’t been built.",
            "title_similarity": "0.27269757",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2665u",
            "score": 1,
            "text": "recently saw something from IceWind, it was quite interesting!",
            "title_similarity": "0.35610142",
            "sentiment_compound": 0.5081
        },
        {
            "id": "gw26dop",
            "score": 1,
            "text": "It's funny how they said lower prices of electricity. Don't they mean increase the price along with some CEO's yearly bonus",
            "title_similarity": "0.65282476",
            "sentiment_compound": 0.5003
        },
        {
            "id": "gw27g4p",
            "score": 2,
            "text": "I saw a “just have a think episode” last week on YT that covered vertical access turbines. They focused on a product which is designed to harvest energy from traffic on highways. It is designed to be mounted on lamp posts in the central median and the airflow from traffic on each side is sufficient to turn the turbine and generate a decent amount of power.",
            "title_similarity": "0.5854035",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gw27idr",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "-0.0761691"
        },
        {
            "id": "gw29t2k",
            "score": 1,
            "text": "Just curious if there was any mention of the type/material of vertical blades themselves and if they can be reused instead of buried in the ground.",
            "title_similarity": "0.19070828",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gw2a8cp",
            "score": 1,
            "text": "I remember reading about these in popular science, maybe back in the 80’s. Always wondered why they didn’t take off before the traditional looking 3-blade models. Seems like they’d be much more efficient and independent of wind direction",
            "title_similarity": "0.598969",
            "sentiment_compound": 0.8122
        },
        {
            "id": "gw2abtd",
            "score": 3,
            "text": "One place that vertical turbines should be deployed is in cities and towns, they have much better efficiency in shite wind fields. I read a thesis a few years back about someone who was designing tulip shaped turbines for Rotterdam.",
            "title_similarity": "0.6559062",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gw2b1yz",
            "score": 2,
            "text": "When I was a kid in the early 90s, we’d drive through highway 80 and they had a bunch of vertical axis turbines mixed with horizontal. They’re all gone now and the horizontal ones are the only ones there. But they are a lot lot bigger.",
            "title_similarity": "0.5964327",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2bufk",
            "score": 2,
            "text": "This is new? I did a presentation about 15 years ago in high school about wind turbines and the general consensus about horizontal axis vs vertical axis turbines was the same as usual ; vertical more expensive, too much so to justify the investment over horizontal.\n\nInteresting stuff about the placement patterns though, never occurred to me.",
            "title_similarity": "0.71356785",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw2cxyj",
            "score": 1,
            "text": "The real advances need to come in energy storage. Most energy is available in \"wind ramping occurrences,\" which utility companies cannot take advantage of. You are better off having a turbine that collects all of the available energy when the wind is blowing hard and then stores it, than you are having a turbine in a place where the wind is expected to blow constantly, but is turned off when the wind blows too hard. \n\nIt's not the axis that's the problem, it's energy storage and transportation that are the limiting factors. Those have always been the problems with wind power.",
            "title_similarity": "0.6339277",
            "sentiment_compound": -0.4355
        },
        {
            "id": "gw2dgrd",
            "score": 1,
            "text": "Which design is more efficient for the vertical wind farm",
            "title_similarity": "0.621151",
            "sentiment_compound": 0.4754
        },
        {
            "id": "gw2f3kl",
            "score": 1,
            "text": "Wind Aeolipiles are also more efficient than traditional turbines.\n\nhttps://patents.google.com/patent/US8591174B1/en",
            "title_similarity": "0.77408886",
            "sentiment_compound": 0.4754
        },
        {
            "id": "gw2fcu4",
            "score": 1,
            "text": "Just out of curiosity, does this use the Savonius wind turbine design or something else?",
            "title_similarity": "0.40514916",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2fcxs",
            "score": 1,
            "text": "Here in Mexico the government just passed a bill relegating clean energies and favoring oil and coal. According to our president the turbines “make the landscape look ugly”. A shame.",
            "title_similarity": "0.51947606",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gw2fs7e",
            "score": 1,
            "text": "Funny that the one that’s more efficient would look like a weathervane with a cock since you think of those on a farm.",
            "title_similarity": "0.52639735",
            "sentiment_compound": 0.7841
        },
        {
            "id": "gw2ftm7",
            "score": 1,
            "text": "I imagine they’re more efficient space wise in that you can line them up more densely than windmills.",
            "title_similarity": "0.71683514",
            "sentiment_compound": 0.7548
        },
        {
            "id": "gw2gd6n",
            "score": 1,
            "text": "Even if they are less efficient, vertical turbines can be deployed in more dense urban areas a lot more easily, and as another post mentioned, on remote cell towers that need smaller amounts of power. \n\nPairing smaller turbines, with solar, and battery storage, is an attractive combination.",
            "title_similarity": "0.7182292",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gw2h46i",
            "score": 1,
            "text": "I studied these as part of my MS in wind.  What they're saying is essentially if you line them up in a farm they create a sort of funnel which benefits them, whereas in HAWTs wake effects are a detriment.\n\n\nThis isn't particularly novel or groundbreaking, and no one's going to invest 8 figures in a field of eggbeaters.\n\n\nThat being said, I do think they have potential as cheaper sources of generation for second tier wind resources.  Particularly those prone to gusts and direction changes in places like California where all the onshore first tier wind resource sites already have traditional wind farms.",
            "title_similarity": "0.6839485",
            "sentiment_compound": 0.3875
        },
        {
            "id": "gw2h8r7",
            "score": 1,
            "text": "Why would it lower prices? Wouldn't that 15% surplus just become profit after the intial cost of set up have been covered?",
            "title_similarity": "0.6684004",
            "sentiment_compound": 0.264
        },
        {
            "id": "gw2h8ys",
            "score": 1,
            "text": "Could wind turbines be stacked? I always see them with a single head but would assume wind is available at multiple heights. Especially if the idea to stack them semi close, you could attach them all at the top with a scaffold of sorts for maintenance and improved structural integrity.",
            "title_similarity": "0.54799545",
            "sentiment_compound": 0.8674
        },
        {
            "id": "gw2hqnx",
            "score": 1,
            "text": "It's also less environmentally damaging, since vertical turbines don't have blades that leave the silhouette of the overall structure, meaning birds and bats are more likely to avoid them.\n\nThe direction of torque and attachment on both ends of the blades also means that they will likely be less prone to catastrophic failure.",
            "title_similarity": "0.57755405",
            "sentiment_compound": -0.8665
        },
        {
            "id": "gw2hqwy",
            "score": 1,
            "text": "They have good efficiency, yes.  But HAWTs are notorious for much higher upkeep cost.  The horizontal alignment causes a lot more internal wear and tear.\n\nI am sure we can build more on the technology and make them better, but right now VAWTs are king for a reason.",
            "title_similarity": "0.7226466",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gw2hr6s",
            "score": 1,
            "text": "Will birds be smart enough not to get killed by this style of windmill? It's always baffled me why they can't seem to avoid death by the horizontal axis kind",
            "title_similarity": "0.4078139",
            "sentiment_compound": 0.7703
        },
        {
            "id": "gw2hrzo",
            "score": 1,
            "text": "Could we theoretically line the coast with these?\n\nWouldn't sticking those like all around the Gulf of Mexico basically power all those coastal states? Or at least like, a majority of them.",
            "title_similarity": "0.4086582",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gw2ic7e",
            "score": 1,
            "text": "Just watched waterworld last week for the first time.... Way ahead of it's time, now the windmill generator makes 100% sense being vertical.  I didn't know what it was at first",
            "title_similarity": "0.55585",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2iomo",
            "score": 1,
            "text": "These aren't new, but I'm glad more people are talking about and seriously considering VAWTs. I saw them for the first time a few years ago, and they pose almost no threat to birds unlike traditional wind turbines. Slap a few on your roof and you're ballin'.",
            "title_similarity": "0.6035621",
            "sentiment_compound": 0.7689
        },
        {
            "id": "gw2ivk2",
            "score": 1,
            "text": "For the love of god, what about the birds, man?",
            "title_similarity": "0.17928982",
            "sentiment_compound": 0.743
        },
        {
            "id": "gw2iwij",
            "score": 1,
            "text": "Ah yes yes, just as Cities: Skylines has claimed",
            "title_similarity": "0.16508695",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gw2iy1d",
            "score": 1,
            "text": "Would that work both ways? Ie, if that's better at harnessing wind energy, would a conventional fan in the home also work better vertically like this?",
            "title_similarity": "0.57545483",
            "sentiment_compound": 0.9013
        },
        {
            "id": "gw2j70u",
            "score": 1,
            "text": "how is this even news, it has been known for decades.  Jacques Cousteau  pioneered the Turbosail vertical wind turbine used on his ship .",
            "title_similarity": "0.46499938",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2k94y",
            "score": 1,
            "text": "Man, I never thought of doing this because I always thought scientists had already come up with this idea and it wasn’t as good as horizontal ones. Guess I was wrong haha",
            "title_similarity": "0.32180327",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gw2kx27",
            "score": 1,
            "text": "We should make a turbine similar to the Dyson  circular fan",
            "title_similarity": "0.39136806",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gw2l68w",
            "score": 1,
            "text": "Could you make an efficient enclosed vertical  turbine? I'm thinking similar to a Dyson blade. Im sure it would be better for wildlife. Estimates put bird deaths at up to 500,000 per year in the US alone with global numbers thought to be in the millions.",
            "title_similarity": "0.7033731",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gw2lmg8",
            "score": 1,
            "text": "Wow, imagine your in the process of building a wind farm after this study comes out. Gotta hope this is implemented next",
            "title_similarity": "0.44021636",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gw2m040",
            "score": 1,
            "text": "> New research has found that the vertical turbine design is far more efficient than traditional turbines in large scale wind farms\n\nI'm pretty sure that is not what the paper says. It claims that on large wind farms, the turbines can help each other perform better.",
            "title_similarity": "0.89970833",
            "sentiment_compound": 0.9216
        },
        {
            "id": "gw2mer2",
            "score": 1,
            "text": "Love that the lead author is Danish. Makes me proud to see denmark contribute so much to wind energy technology.",
            "title_similarity": "0.5628854",
            "sentiment_compound": 0.8555
        },
        {
            "id": "gw2mm8h",
            "score": 1,
            "text": "Why don't we have turbines that have leave shaped propellers? Like big, long canoes. So that the incoming wind hits the concave side and gets sliced apart by the convex side.",
            "title_similarity": "0.52629465",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gw2mrso",
            "score": 1,
            "text": "Lower prices of electricity \n\n“Hold my beer” - the electric company",
            "title_similarity": "0.48889545",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw2mrxp",
            "score": 1,
            "text": "I work on wind turbines. Please don’t do this. We make loads more money cause our job has us climb/work at heights. If it’s on the ground we get paid like $15-19 an hour potentially.",
            "title_similarity": "0.74585676",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gw2msxx",
            "score": 1,
            "text": "How do you stop these if there is a storm and the winds are too strong? The rotate the normal ones so the wind doesn't break them. Don't see how they would do that with these.",
            "title_similarity": "0.44103217",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw2n0uw",
            "score": 1,
            "text": "Kind of makes sense when you think about it. Rotating on a plane that runs parallel to gravitational forces means there’s losses in the kinetic energy developed by the wind when one side of the blade has to rotate up and away from the surface of the planet. Granted you get to rely on a potential energy being converted into kinetic energy on the other side, but that conversion isn’t going to be 100% efficient and therefore it’s a net loss.\n\nSwapping to a rotational plane that’s perpendicular to gravitational forces means your only loss of energy is due to friction from the bearings and generator.",
            "title_similarity": "0.60897434",
            "sentiment_compound": 0.4118
        },
        {
            "id": "gw2ns6g",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0761691"
        },
        {
            "id": "gw2obki",
            "score": 1,
            "text": "Clearly nobody has at any point played Cities:Skylines. These turbines have been known to be more proficient to gamers for quite a long time!",
            "title_similarity": "0.45989552",
            "sentiment_compound": 0.6588
        },
        {
            "id": "gw2onid",
            "score": 1,
            "text": "Nice, just like Cities Skylines",
            "title_similarity": "0.30096668",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gw2orzl",
            "score": 1,
            "text": "City Skylines taught me this year's ago..",
            "title_similarity": "0.25297636",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2othh",
            "score": 1,
            "text": "We were doing it for hundreds of years with sails, the knowledge is there, why did it take us forever to figure out how to construct effective wind turbines??!!",
            "title_similarity": "0.50052816",
            "sentiment_compound": 0.6179
        },
        {
            "id": "gw2owrr",
            "score": 1,
            "text": "Dunno, I am not questioning the claims, but we have 300' tall windmills here, with a generator that's is the size of a small RV, real f'n big, 1000's of them, and looking at this picture here, these things appear small (or simulated), with a generator 1/20th the size.  Efficiency is converting wind energy into electron momentum, 10% more efficient on .5kwh is not a huge boost, compared to a 10kwh generator.",
            "title_similarity": "0.7637501",
            "sentiment_compound": 0.7057
        },
        {
            "id": "gw2p1mn",
            "score": 1,
            "text": "Good idea for cities on top of big buildings.",
            "title_similarity": "0.36240944",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gw2p1oh",
            "score": 1,
            "text": "If we could harness 10% of the oceans energy we could power the entire planet.",
            "title_similarity": "0.6241083",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw2p1t8",
            "score": 1,
            "text": "Does this concept use more land due to rotating 360 degrees?",
            "title_similarity": "0.40357247",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2p8t5",
            "score": 1,
            "text": "I've always thought this was true because you create higher pressure when moving air through a restricted opening.\n\nGlad they did the research to prove it.\n\nEdit: what about bird strikes is my next question. I'd heard that if you paint one of the blades of the horizontal wind turbines a different color it drops bird strikes dramatically, but I've not seen that implemented in the wind farms around our area",
            "title_similarity": "0.6636305",
            "sentiment_compound": -0.1154
        },
        {
            "id": "gw2pgxi",
            "score": 1,
            "text": "I was in the midst of building a DIY vertical rotor when I moved to windless Tennessee which ended that effort. \n\nP.S. The extra bonus for vertical windmills is that you can now set your migratory birds to \"puree\".",
            "title_similarity": "0.48065174",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gw2ppwp",
            "score": 1,
            "text": "Is it feasible to repurpose existing traditional turbines into vertical ones?",
            "title_similarity": "0.43261957",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2pxix",
            "score": 1,
            "text": "Have they tried having them at a 45 degree angle?",
            "title_similarity": "0.15742417",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2q4yk",
            "score": 1,
            "text": "It seems like maintaining vertical turbines would be much cheaper, easier and safer because the generator is down at the bottom.",
            "title_similarity": "0.669811",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gw2qce6",
            "score": 1,
            "text": "What might be said about upkeep costs? On the off chance that I recollect accurately, vertical plans will in general make lopsided wear of the base since the wind current is pushing on one point which impacts the bearing burdens.",
            "title_similarity": "0.4641927",
            "sentiment_compound": -0.128
        },
        {
            "id": "gw2rg7t",
            "score": 1,
            "text": "Yes, I saw a turbine that fell down and became a horizontal turbine. It was not spinning at all. Totally inefficient.",
            "title_similarity": "0.2660495",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw2rkkv",
            "score": 1,
            "text": "Yes but does the amount of land needed for them outweigh the alternatives",
            "title_similarity": "0.34560892",
            "sentiment_compound": 0.2144
        },
        {
            "id": "gw2rryw",
            "score": 1,
            "text": "I’m curious how well-sealed these turbines’ parts are against the elements, especially out in the ocean.",
            "title_similarity": "0.32749328",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gw2rwhk",
            "score": 1,
            "text": "Wouldn't it make intuitive sense that vertical turbines are more efficient because they can capture wind from a wider variation of directions? I'm also curious about maintainability of each orientation due to friction/gravity and how it impacts the efficiency of generation.",
            "title_similarity": "0.70601535",
            "sentiment_compound": 0.7841
        },
        {
            "id": "gw2s6c7",
            "score": 1,
            "text": "Hey! I use these for water pumping stations in early game cities skylines!",
            "title_similarity": "0.248309",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2s8s2",
            "score": 1,
            "text": "“Lower prices of electricity” haha, as if big corp will lower prices... or government for that matter.",
            "title_similarity": "0.56911635",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gw2shgk",
            "score": 1,
            "text": "Appears to be a physics simulation. Very promising, but I have an important engineering question:\n\nWhat the difference in lifecycle cost per KWH generated between a horizontal and vertical axis turbine? You ain't gonna simulate that with Star-CCM+",
            "title_similarity": "0.5461931",
            "sentiment_compound": 0.4933
        },
        {
            "id": "gw2shlr",
            "score": 1,
            "text": "Will the blades for these be buried in Wyoming as well?",
            "title_similarity": "0.21033451",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw2sopi",
            "score": 2,
            "text": "While traditional horizontal mills have all the blades being pushed by the wind, these vertical mills half the time the blades rotate against the wind. \n\nThat said, theoretical efficiency is not the same as economic efficiency. The vertical mills are often easier to install and service since their generator and gears are placed down low, not at the top of the tower, and as pointed out can be placed in a denser grid.",
            "title_similarity": "0.78522444",
            "sentiment_compound": 0.6259
        },
        {
            "id": "gw2t2mt",
            "score": 1,
            "text": "2 dimensional... What about edge effects like vortices reducing efficiency?\n\nWere these results validated with physical testing? Didn't see any validation in the quick scan I did...",
            "title_similarity": "0.43023628",
            "sentiment_compound": 0.7399
        },
        {
            "id": "gw2tban",
            "score": 1,
            "text": ">ultimately lower prices of electricity\n\nYou mean raise profits...",
            "title_similarity": "0.5682294",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gw2ty17",
            "score": 1,
            "text": "Question for someone with a better grasp on fluid dynamics than me:\n\nThe bit about how they increase output “in pairs” suggests to me that there’s a drafting/slipstreaming-like effect going on here, is that essentially this is alluding to?",
            "title_similarity": "0.6017107",
            "sentiment_compound": 0.743
        },
        {
            "id": "gw2vdsu",
            "score": 1,
            "text": "Sure. Until that CORE Commander comes by and D-Guns the whole line of em.",
            "title_similarity": "0.19467868",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gw2vs06",
            "score": 1,
            "text": "Why haven’t I ever seen one of these in the wild?",
            "title_similarity": "0.07689884",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw2x2m0",
            "score": 2,
            "text": "The large issue facing vertibines is bearing stress.  Wind direction pushes the weight which is held up strictly by the base bearing of the helix.  They have a tendency to fail and lock up",
            "title_similarity": "0.44054064",
            "sentiment_compound": -0.743
        },
        {
            "id": "gw2x9qh",
            "score": 1,
            "text": "Does the vertical turbine design reduce the chance of bird strike at all?\n \n(I'm not using this a detractor for wind power, I am genuinely curious if this design has other benefits)",
            "title_similarity": "0.49787825",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gw2xiv6",
            "score": 1,
            "text": "Hopefully this makes them more readily available. I've wanted one for years, but they're prohibitively expensive",
            "title_similarity": "0.5832304",
            "sentiment_compound": 0.2144
        },
        {
            "id": "gw30c4z",
            "score": 1,
            "text": "Horizontal makes sense - drafting.",
            "title_similarity": "0.20006505",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw30hfy",
            "score": 1,
            "text": "I always thought they were just as an intuitive thing but am not educated enough to articulate why....\n\nI'm happy to see I wasn't wrong.",
            "title_similarity": "0.3593084",
            "sentiment_compound": 0.8549
        },
        {
            "id": "gw30ujj",
            "score": 1,
            "text": "Once upon a time I lived near an eggbeater style windmill; it was nice to wake up to the whi-whi-whi-whi sounds.",
            "title_similarity": "0.35952798",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gw31b5m",
            "score": 1,
            "text": "But the look stupid. So is it worth it?",
            "title_similarity": "0.14044389",
            "sentiment_compound": -0.4319
        },
        {
            "id": "gw31yrp",
            "score": 1,
            "text": "Enjoyed reading the blog!",
            "title_similarity": "0.29157293",
            "sentiment_compound": 0.5562
        },
        {
            "id": "gw329g9",
            "score": 1,
            "text": "“Efficiency” is not really that important when you don’t have to buy the wind. Energy density is far more important in this case.",
            "title_similarity": "0.6478939",
            "sentiment_compound": 0.3389
        },
        {
            "id": "gw32bv2",
            "score": 1,
            "text": "Lower the prices? Or *increase* the profit margins?\n\n... it just dawned on my how cynical I am given my first assumption about everything that improves our lives will just be used to make the rich richer and have no impact on the rest of us.",
            "title_similarity": "0.5436364",
            "sentiment_compound": 0.8541
        },
        {
            "id": "gw32lar",
            "score": 1,
            "text": "Okay but what about it's unit price and maintenance cost compared to traditional turbines? Is it more efficient or does it just produce more?",
            "title_similarity": "0.7660253",
            "sentiment_compound": 0.714
        },
        {
            "id": "gw32y6a",
            "score": 1,
            "text": "I've seen these, in/on Iceland. Cool! So happy to see good ideas spread :)",
            "title_similarity": "0.37311733",
            "sentiment_compound": 0.9222
        },
        {
            "id": "gw334i3",
            "score": 1,
            "text": "Im getting serious halo reach vibes",
            "title_similarity": "0.24315982",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gw3390g",
            "score": 1,
            "text": "Vertical integration ftw?",
            "title_similarity": "0.06061989",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gw33d87",
            "score": 1,
            "text": "Hasn’t this been known for a while though? I thought the reason as to why they weren’t used is because they’re more expensive to purchase and maintain?",
            "title_similarity": "0.51644254",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw33dnn",
            "score": 1,
            "text": "This seems like something we should have already known. Why has nobody tested this before? \n\nAnd why are the windmill-looking ones so prevalent over the spinning-looking ones?",
            "title_similarity": "0.3622375",
            "sentiment_compound": 0.4329
        },
        {
            "id": "gw33mh2",
            "score": 2,
            "text": "Effeciency of wind turbines is already getting really close to Betz limit. I'd say some of the bigger issues is maintainence and making them last as long as possible. Vertical wind farms generally don't seem like they'd be too useful due to maintainence issues just to hunt a bit more effeciency.\n\nSource: Control engineer, wrote my masters on Wind turbine control.",
            "title_similarity": "0.6973899",
            "sentiment_compound": 0.1999
        },
        {
            "id": "gw349na",
            "score": 1,
            "text": "I’d imagine these work better on land but what about offshore installations where wave heights would need to be considered? It seems the “traditional” horizontal method might be the better application there?",
            "title_similarity": "0.50893366",
            "sentiment_compound": 0.7319
        },
        {
            "id": "gw34f5p",
            "score": 1,
            "text": "Me: laughs in Cities: Skylines",
            "title_similarity": "0.25188172",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gw351nd",
            "score": 1,
            "text": "Anyone who plays sims city mobile knows this",
            "title_similarity": "0.15131114",
            "sentiment_compound": 0.25
        },
        {
            "id": "gw35dg3",
            "score": 1,
            "text": "When I read this I thought it was referring to this:\n\n[https://vortexbladeless.com](https://vortexbladeless.com)\n\n...a bladeless turbine design taking advantage of the vortex effect. I wonder what would happen if they put a bunch of those together in a field like this. Ever since I read about bladeless generators, I've been daydreaming about hacking one into a base for the safety flags I use on my bike trailers. They whip around like crazy, and the winds here frequently get up to 20 MPH off the ocean. Ideally I would use them to get a little bit of juice back into my e-bike battery, or charge bike lights or something.",
            "title_similarity": "0.5576027",
            "sentiment_compound": 0.8481
        },
        {
            "id": "gw36a1q",
            "score": 2,
            "text": "The article say this was pure simulation result, not actual construction.  So, I have several questions:\n\n1) Did they consider the practicality of components to make large scale vertical axis turbines?  Specifically, the reliability and cost of bearing in cantilever that is purely loaded asymmetrically.\n\n2) Did they properly simulate wind conditions at actual build heights and with real effects, or did they assume uniform laminar flow across the full working face of the vertical turbines?\n\n3) How well will vertical turbines tolerate over speed conditions due to high winds compared to traditional horizontal turbines?",
            "title_similarity": "0.65126956",
            "sentiment_compound": 0.3899
        },
        {
            "id": "gw36ytq",
            "score": 1,
            "text": "This is my expertise (specifically aerodynamics of VAWTs and the hows/ifs of their commercialisation) and one of my papers is referenced in this paper, so I'll try to address some myths and truths about what has been said in these comments.\n\nFirstly, we need to preface that VAWT simulation is an absolute pain in the ass compared to HAWTs (traditional wind turbines) and this is one of the two things which has held them back over the years, the other being materials although this is a solved problem at this point. They are a far more complex flow problem than HAWTs because they are severely affected by 3D effects and dynamic stall, which aren't relatively insignificant issues in HAWTs. I'd say we're at a point now that we have a decent understanding of the flow problem, with respect to both individual turbines and farms of turbines, but a ridiculous amount of computational resources is still required to simulate the problem, and experimental study for validation is still quite limited.\n\nVAWTs are less efficient than HAWTs - This is a complex issue, there is a decent amount of evidence now to show that a well designed VAWT can be just as, if not more, efficient than HAWTs. In arrays this is even greater because of the flow physics of VAWTs which results in higher wind speeds around them, so you can take advantage of this to boost their headline efficiency in arrays to the point of seemingly breaking the Betz' limit. So there's a decent amount of evidence to suggest that you can get 65-70% efficiency from VAWT farms whilst an individual HAWT will get 50% and a farm will get below that, likely 40-45%.\n\nThe efficiency improvements for individual VAWTs are due to a few different things. Namely there is a better understanding of how VAWTs scale (larger VAWTs perform better and have more desirable optimal designs so they are better suited to utility scale applications rather than smaller scales), and we're ignoring the idea that VAWTs benefit from their simplicity. The big thing is introducing control schemes to adjust the blade rotation, and potentially even rotational speed of the turbine, to account for the wind direction and blade position. These can give massive gains in performance. We also have a better idea of how different airfoils affect VAWT performance curves so can use this to optimise longevity.\n\nIn terms of their commercialisation, I think things have come a little too late. Their main advantages were that you could make them bigger and manipulate their centre of gravity to make floating turbines much, much easier, but HAWT research is now at a point where these advantages probably aren't worth the investment needed to make them reality. There might be some niche situations where the investment could make sense e.g. area limited locations or if the size of the turbines can be further increased. I could also see some prototype farms being built upon old infrastructure from previous HAWT farms to save money from their construction costs as many of these farms will be EOL soon and their turbine spacing will be unsuitable for modern HAWT farms. I don't think those farms will be cost competitive with new HAWT farms, at least initially, but after a few installations and if we're looking at offshore farms it might be.",
            "title_similarity": "0.6576425",
            "sentiment_compound": 0.9954
        },
        {
            "id": "gw375p1",
            "score": 1,
            "text": "*can ultimately lower prices of electricity.*\n\nWell boys and girls, that's the last time we'll ever hear of these things then.",
            "title_similarity": "0.41746083",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gw37bfr",
            "score": 1,
            "text": "Wasn't the problem with vertical wind turbines that you can't make them as large as more conventional wind turbines because the mechanical stresses on the rotating parts are far larger?",
            "title_similarity": "0.73174036",
            "sentiment_compound": -0.1882
        },
        {
            "id": "gw37st3",
            "score": 1,
            "text": "Any idea on downwind affects? Sounds great but every action has an equal and opposite reaction and thus always some consequences, they could he good or bad but they must exist. The earth is big and all but is split into different layers of \"air\". It sounds great to capture all the energy but based on the laws of science collecting this energy will have some sort of impact. Do we know what that impact is? How deep & high can we stack these before the electrical output is offset by the consequences. When your dealing with energy at this scale must Consider climate change. Do we have these answers and if not are you willing to take the risk?",
            "title_similarity": "0.5926633",
            "sentiment_compound": 0.9267
        },
        {
            "id": "gw37sv5",
            "score": 1,
            "text": "This isn't really new, and even MORE efficent is a water wheel style, but they have some design difficulties and much higher energy startup burdens.",
            "title_similarity": "0.61238086",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gw37uqb",
            "score": 1,
            "text": "While cool, don't be fooled: VAWT's (Vertical Axis Wind  Turbines) are still subject to Betz's law [https://en.wikipedia.org/wiki/Betz%27s\\_law](https://en.wikipedia.org/wiki/Betz%27s_law) which places a strict limit on how much wind power you can harvest from wind. That's a hard physical limit. Current \\[horizontal\\] wind turbine designs are very close to this limit (few percents). As often the case going even closer to this limit (be it VAWT or HAWT) is not cost efficient and there really isn't much wiggle room left.  \n\n\nWhat could be a nice feature of VAWT'S is making maintenance a bit easier.",
            "title_similarity": "0.6376173",
            "sentiment_compound": 0.747
        },
        {
            "id": "gw37x7d",
            "score": 1,
            "text": "How affordable is a system like this for residential use?",
            "title_similarity": "0.3927815",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw382yk",
            "score": 1,
            "text": "The economies of scale at play here. As the technology becomes more in demand, better designs come up to improve efficiency and gain a more competitive edge over competitors, and the competitors turn around and bring even more efficient design ls to the table to match it.\n\nI wonder if it can be scaled down a bit to take over during storms when solar panels can’t get enough UV light.\n\nThis is what a market success looks like. \n\nNow for the designers to eventually make a wind turbine that doesn’t vibrate the ground so bad. That would be amazing!",
            "title_similarity": "0.79213846",
            "sentiment_compound": 0.9701
        },
        {
            "id": "gw38e6l",
            "score": 1,
            "text": "Remember fifteen years ago when small versions of these started coming out. Amazed it took this long to get the data on this.",
            "title_similarity": "0.49842238",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gw38m6z",
            "score": 1,
            "text": "This hybrid design looks awesome.\n\nhttps://www.sciencedirect.com/science/article/pii/S187661021730471X/pdf?md5=f75f1d9baf256495429d750d71f66053&pid=1-s2.0-S187661021730471X-main.pdf",
            "title_similarity": "0.47478014",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gw38wey",
            "score": 1,
            "text": "wind does not change \"mass\" to go around an object, therefore it must change velocity",
            "title_similarity": "0.30441988",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw399ub",
            "score": 1,
            "text": "Nuclear power can suck it.",
            "title_similarity": "0.24408591",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gw39tcx",
            "score": 1,
            "text": "What I'm missing is whether this is an actual increase in performance, or whether the wake effects of VATW are less than HAWT. The latter is logical and with the large scale offshore wind farms - where seabed prep and cable lengths are also big contributors to total cost (not to mention that space is becoming limited offshore in the areas where offshore wind is well established) - it might be a great alternative.\n\nWondering what work is being done on large VAWT. I only know them as small onshore versions of a few metres tall.",
            "title_similarity": "0.7422428",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gw3ajtc",
            "score": 1,
            "text": "I used to see vertical wind turbines these in the Altamont pass, between Livermore and Tracy, in Northern California. At the time, everybody called them egg beaters. They were taken down maybe 20 years ago. I heard they were inefficient and had too many maintenance problems. I wonder what's changed since then.",
            "title_similarity": "0.52889144",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gw3akp4",
            "score": 1,
            "text": "The maximum single turbine efficiency set by Betz's Law is 59% for horizontal turbines. Vertical turbines have a much lower maximum efficiency, so I'm wondering if this grid orientation is enough to make them worth picking over horizontals.",
            "title_similarity": "0.748733",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gw3b6ex",
            "score": 1,
            "text": "These things have been in sci-fi RTS's for years, don't these boffins play videogames!?",
            "title_similarity": "0.23326153",
            "sentiment_compound": -0.3244
        },
        {
            "id": "gw3b78e",
            "score": 1,
            "text": "This is fine but we already have an extremely safe and reliable energy source already, nuclear. Statistics show its even safer than wind energy.",
            "title_similarity": "0.5586865",
            "sentiment_compound": 0.9286
        },
        {
            "id": "gw3bgii",
            "score": 1,
            "text": "[https://vortexbladeless.com/](https://vortexbladeless.com/)\n\nThis is the most interesting vertical bladeless turbine company I've come across.",
            "title_similarity": "0.53725505",
            "sentiment_compound": 0.4576
        },
        {
            "id": "gw3cjdb",
            "score": 4,
            "text": "That’s why you only saw this style on Reach.",
            "title_similarity": "0.081836835",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gw3crhr",
            "score": 1,
            "text": "What if you had a vertical turbine shoot the air coming through it into another vertical turbine into another to another etc",
            "title_similarity": "0.32803613",
            "sentiment_compound": -0.34
        },
        {
            "id": "gw3ddj5",
            "score": 1,
            "text": "Plus they just look way cooler and take up less space allowing for more of them",
            "title_similarity": "0.41551358",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3e6yr",
            "score": 1,
            "text": "Cities: Skylines was right all along!",
            "title_similarity": "0.26655245",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3eqcw",
            "score": 1,
            "text": "I feel I'm not surprised by this because of surface area alone, but I don't know that much about aerodynamics.",
            "title_similarity": "0.46167457",
            "sentiment_compound": -0.2103
        },
        {
            "id": "gw3f0rr",
            "score": 1,
            "text": "While I was at University they had one of these set up a mile off campus and everyone who saw it loved it and everyone who lived near it hated it, the one over there was initially extremely loud.",
            "title_similarity": "0.41018015",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gw3f5zv",
            "score": 1,
            "text": "I did a lot of studies on VAWTs when I was in college. Yes they can theoretically overcome Horizontal Axis Turbines effeciency problem but they suffer one giant problem. And that is the fact that the centrifugal force will fatigue and destroy the turbine blades eventually.\n\nThe other big problem with VAWT is that they suffer from a less consistent wind flow at lower altitudes  where as HAWT get less turbulence the higher up they are.",
            "title_similarity": "0.7114003",
            "sentiment_compound": -0.9811
        },
        {
            "id": "gw3fxwg",
            "score": 1,
            "text": "From what I know about them, they also perform better as “domestic” turbines, for small scale, they work better with both fast/slow speed winds, and also for wind direction changes.",
            "title_similarity": "0.76885086",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gw3g6mb",
            "score": 1,
            "text": "Also, if you connect them to Bitcoin miners that can use the energy when the wind is blowing but humans aren't using then you can get a quicker ROI on the investment and deploy more units.",
            "title_similarity": "0.6342294",
            "sentiment_compound": 0.1406
        },
        {
            "id": "gw3gmnl",
            "score": 1,
            "text": "How do those turbines affect animals? (Do they kill more, less or the same flying animals?).",
            "title_similarity": "0.41302758",
            "sentiment_compound": -0.7236
        },
        {
            "id": "gw3hs3u",
            "score": 1,
            "text": "isnt this similar to what ppl used for hundreds of years in the desert",
            "title_similarity": "0.24520625",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3hujf",
            "score": 1,
            "text": "Here in California, vertical windmills have been around for decades. \n\nIf they're so obviously superior to horizontal windmills can someone explain why they haven't taken off?",
            "title_similarity": "0.5706745",
            "sentiment_compound": 0.5829
        },
        {
            "id": "gw3i3ba",
            "score": 1,
            "text": "Would the vertical make more or less noise than the traditional?",
            "title_similarity": "0.35163847",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3ia9m",
            "score": 1,
            "text": "Why is it that for most sci fiction and video games this is how I've seen wind farms designed. yet all the trial ones I've seen built look like windmills",
            "title_similarity": "0.45923072",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw3igts",
            "score": 1,
            "text": "How about the environmental cost of producing the windmills (and the carbon required to do so). Additionally replacing them every 10-20 years, the landfill waste, and the fact that nuclear produces no emissions and waste can safely be stored through deep-borehole disposal?",
            "title_similarity": "0.5819193",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gw3ij99",
            "score": 1,
            "text": "Can’t shake off the sound from Trump about WINDMILL SICKNESS…\n\nWEOOOEWEEEEOOOOWEOOOOO",
            "title_similarity": "0.3238104",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gw3jhzi",
            "score": 1,
            "text": "How are we recycling retired wind farm blades?",
            "title_similarity": "0.3726892",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3l716",
            "score": 1,
            "text": "I used to work designing vertical wind turbines. The efficiency is improved, and there are a bunch of other advantages as well. One of the biggest is that all the machinery is at or near ground level.",
            "title_similarity": "0.7284616",
            "sentiment_compound": 0.8481
        },
        {
            "id": "gw3l9e9",
            "score": 1,
            "text": "So you’re telling me Cities: Skylines was right all along",
            "title_similarity": "0.28955644",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3llhd",
            "score": 1,
            "text": "Darn, I thought I was going to see the eggbeater turbines my uncle help design decades ago",
            "title_similarity": "0.4323578",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw3lmpb",
            "score": 1,
            "text": "Doesn’t look bird friendly",
            "title_similarity": "0.041700132",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gw3mk6l",
            "score": 1,
            "text": "\"can ultimately lower the prices of electricity.\" Or increase the profit margins of the company.",
            "title_similarity": "0.6771212",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gw3mtvg",
            "score": 2,
            "text": "Conservatives: “you can never make renewable energy produce enough electricity”\n\nIt’s amazing how if you try to do different things you get better at them. It’s like practice makes perfect or something?",
            "title_similarity": "0.64886093",
            "sentiment_compound": 0.9019
        },
        {
            "id": "gw3o4kp",
            "score": 1,
            "text": "Yes sir! A good deal of work was done on vertical wind turbines as early as the 1970's and some of it was very promising. I'm glad to see that such potential is finally being realized.",
            "title_similarity": "0.62282336",
            "sentiment_compound": 0.9032
        },
        {
            "id": "gw3okjj",
            "score": 1,
            "text": "Where do I buy the stock",
            "title_similarity": "0.105583355",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3oq62",
            "score": 1,
            "text": "Not to sound stupid but why can’t the turbine have both types on the same (forgive me for not knowing the term) pole",
            "title_similarity": "0.42358974",
            "sentiment_compound": 0.5481
        },
        {
            "id": "gw3p117",
            "score": 1,
            "text": "I’ve long advocated for vertical helix turbines simply because they require no trim adjustment, *ever*.",
            "title_similarity": "0.36608267",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw3qs5e",
            "score": 1,
            "text": "That makes sense. And I would probably not have the fear of them coming unmoored and chasing me across the countryside.",
            "title_similarity": "0.30123064",
            "sentiment_compound": 0.3875
        },
        {
            "id": "gw3rrju",
            "score": 1,
            "text": "They discovered the power of the flying v.  \n\n\nCanadian geese will  not be happy about their secrets leaking.",
            "title_similarity": "0.4047306",
            "sentiment_compound": -0.4585
        },
        {
            "id": "gw3siec",
            "score": 1,
            "text": "More efficient per surface area, not per dollar. There is no shortage of surface area in most countries, this would only be useful for places like Singapore that have a shortage of real estate.",
            "title_similarity": "0.6146388",
            "sentiment_compound": 0.8038
        },
        {
            "id": "gw3sp08",
            "score": 1,
            "text": "Is it because taller windmills get more wind? Sorry if its a stupid question.",
            "title_similarity": "0.5717935",
            "sentiment_compound": -0.6096
        },
        {
            "id": "gw3szlm",
            "score": 1,
            "text": "So the most efficient way to place these turbines is...similar to how birds like geese flock and migrate? But obviously you couldn't do a \"V\" shape because the wind can come from any direction, but similar principle it sounds like.",
            "title_similarity": "0.6071077",
            "sentiment_compound": 0.7334
        },
        {
            "id": "gw3ugk8",
            "score": 1,
            "text": "We should build them in parabolic towers.",
            "title_similarity": "0.20977211",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw3umjn",
            "score": 1,
            "text": "They should retrofit vertical turbines on those \"golf ball on a tee\" looking water towers we have in every town.  Maybe build some smaller ones around it to get that paired boost effect.",
            "title_similarity": "0.44076353",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw3v280",
            "score": 1,
            "text": "FWIW: i've worked for a company selling wind and solar products in alaska for almost 15 years. we have installations all over the state. i do not know of a single VAWT turbine that's ever been installed in the state to actually still be working. my company never sold them because not a single VAWT manufacturer could provide a production curve chart for us. my neighbor installed one several years ago- against my advice- and it blew apart after 4 months (i promised him it would within 6 months). it was a $40,000 unit made in norway. it's an expensive lawn ornament now.",
            "title_similarity": "0.5003282",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw3w4fj",
            "score": 1,
            "text": "Good, i hope we can move beyond HAWTs now all together. No benefits left.",
            "title_similarity": "0.22492678",
            "sentiment_compound": 0.5597
        },
        {
            "id": "gw3xcph",
            "score": 2,
            "text": "Cities: Skylines players are gonna lose it",
            "title_similarity": "0.20297383",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gw3yg7o",
            "score": 2,
            "text": "At first I couldn’t conceptualize it, and the picture was too small to make out. Until I could blow it up, I just couldn’t make my eyes focus and thought maybe I was seeing double. I was ready to call 911.",
            "title_similarity": "0.35851705",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw3z0d0",
            "score": 2,
            "text": "I've seen things since at least 35 years ago on childhood trips to California.... why so long? This does not sound like the most difficult engineering question to answer.",
            "title_similarity": "0.4683938",
            "sentiment_compound": -0.5998
        },
        {
            "id": "gw3zzgn",
            "score": 2,
            "text": "But you’ll still have Karen’s bitching about how their view is ruined.",
            "title_similarity": "0.19257401",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gw40am0",
            "score": 2,
            "text": "So what you're saying is that everything I learned about power plants from Cities: Skylines turned out to be true?",
            "title_similarity": "0.44737333",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gw41cb2",
            "score": 1,
            "text": "Cities Skylines was right..",
            "title_similarity": "0.29011124",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw41mxe",
            "score": 1,
            "text": "The exhaust wind from one turbine would increase the wind force for the one behind it. I love it.",
            "title_similarity": "0.6523142",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gw41vgl",
            "score": 1,
            "text": "Just had a thought. Could we rehire strip mining companies to strip mine reservoirs on the top of mountains and hills and turn those areas into massive hydro gravity power stations/batteries?\n\nCoal is dying so this could be a great stepping stone",
            "title_similarity": "0.49821225",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gw43eur",
            "score": 1,
            "text": "Now start measuring the cost of moving these things in the most efficient way, and determine if that cost is worth the savings, etc. Let's go mathematicians :D",
            "title_similarity": "0.5639647",
            "sentiment_compound": 0.8412
        },
        {
            "id": "gw43v62",
            "score": 1,
            "text": "Loading screen: When placing wind turbines in your colony there is a 15% adjacency bonus for each pair.",
            "title_similarity": "0.77690995",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gw44s46",
            "score": 1,
            "text": "When I first saw this headline I definitely thought this article was going to be about that stupid vibrating stick wind thing and I was gonna be like wayminit...",
            "title_similarity": "0.29256862",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw45131",
            "score": 1,
            "text": "I did my own theory ( Wich may sound very dumb) that horizontal axis turbines are less efficient because you have gravity. let me explain (i will sound like a 5 year old) When a vertical axis turbine turns, all blades have same gravity pull. Theyre all balanced. When a horizontal axis turbine turn, you have gravity pull both blades down, countering the turning and destroying balanced. (This can be very wrong cz i remember from school that gravity is the weakest energy)",
            "title_similarity": "0.63243496",
            "sentiment_compound": -0.8307
        },
        {
            "id": "gw453pg",
            "score": 1,
            "text": "Cool, now when's my bill going down?",
            "title_similarity": "0.15026662",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gw471rd",
            "score": 1,
            "text": "How soon until one of these groups creates a tornado or water spout",
            "title_similarity": "0.25094232",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw47dcy",
            "score": 1,
            "text": "Wait, all those sci-fi turbines they use in movies and games were actually right?",
            "title_similarity": "0.44244277",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw47stj",
            "score": 1,
            "text": "I find it hard to imagine that the investors in traditional wind turbine installations failed to do the necessary due diligence to discover which is the better path.  Remember the old maxim:\n\n\"Money talks and BS walks.\"",
            "title_similarity": "0.55106187",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gw47swn",
            "score": 1,
            "text": "[u/SadManDan1](https://www.reddit.com/user/SadManDan1/) spermy",
            "title_similarity": "0.23073027",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw48uqv",
            "score": 2,
            "text": "Just an idea but what if these were made with some kind of vent or encasement around the blades so that the air has to be shot through it only. Potentially harvesting more energy? Or perhaps some kind of vacuum so that more and more energy is created throughout the progression",
            "title_similarity": "0.46421167",
            "sentiment_compound": 0.858
        },
        {
            "id": "gw496yi",
            "score": 1,
            "text": "Additionally, they are much more pleasing to the eye",
            "title_similarity": "0.44387156",
            "sentiment_compound": 0.5709
        },
        {
            "id": "gw4b3d8",
            "score": 1,
            "text": "Yes great finally my stonks might go up after the Texas freeze bs",
            "title_similarity": "0.39133865",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gw4bq8e",
            "score": 1,
            "text": "I thought the force in the vertical ones caused them to wear out faster",
            "title_similarity": "0.4715701",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4by0c",
            "score": 2,
            "text": "Which vertical turbine design? I have seen dozens since I started engineering years ago",
            "title_similarity": "0.39914352",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4exv7",
            "score": 1,
            "text": "So like what the hell are we waiting on?",
            "title_similarity": "-0.07758272",
            "sentiment_compound": -0.4228
        },
        {
            "id": "gw4f3kj",
            "score": 1,
            "text": "Love this idea of little vawts on my roof giving me electricity",
            "title_similarity": "0.41902578",
            "sentiment_compound": 0.765
        },
        {
            "id": "gw4fc8e",
            "score": 1,
            "text": "Is this /r/engineering?",
            "title_similarity": "0.20726946",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4fm1p",
            "score": 1,
            "text": "Vertical turbines are also loud as hell. The give the helicopter chopping effect.",
            "title_similarity": "0.4691806",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gw4gh0o",
            "score": 2,
            "text": "We had VAWTs up on top of a water tower I used to drive past frequently. Always made me feel good seeing them spinning up there. \n\nApparently the designs they used were made of brittle materials that snapped off in strong wind and blades started snapping off. Once they got it fixed, some Texan did as Texans do, and the next failure was due to gunshot damage, so they scrapped the whole project.\n\nhttps://www.dallasnews.com/news/watchdog/2018/02/01/wind-turbine-blades-falling-off-addisons-water-tower-result-in-1-million-flop-crazy-lawsuit/",
            "title_similarity": "0.48645872",
            "sentiment_compound": 0.128
        },
        {
            "id": "gw4i4dm",
            "score": 1,
            "text": "More efficient but less swept area = less energy, more turbines and higher cost.",
            "title_similarity": "0.66510665",
            "sentiment_compound": 0.5035
        },
        {
            "id": "gw4ilkl",
            "score": 3,
            "text": "Any progress in emission free energy is good, even if it isn't your favorite type.",
            "title_similarity": "0.49897206",
            "sentiment_compound": 0.8234
        },
        {
            "id": "gw4kddq",
            "score": 1,
            "text": "Isn't this the upgrade path in Sim City 2013 ?",
            "title_similarity": "0.2867248",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4kfcz",
            "score": 3,
            "text": "I hope this was inspired by the legend of kora wind training maze",
            "title_similarity": "0.28554183",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gw4mfcy",
            "score": 1,
            "text": "Can lower prices of electricity? Or increase profits of turbine farm owners?",
            "title_similarity": "0.6618564",
            "sentiment_compound": 0.5204
        },
        {
            "id": "gw4mgqq",
            "score": 1,
            "text": "What does \"can lower prices of electricity\" actually mean? The number is a made up amount anyway... is the universe charging us to harness the energy?? No.. The prices are determined by wrinkly-sacked white men.. nothing else.",
            "title_similarity": "0.51343644",
            "sentiment_compound": 0.4836
        },
        {
            "id": "gw4p0f6",
            "score": 1,
            "text": "Written by the lightly fried fish fillet guy.",
            "title_similarity": "0.1867109",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4rr1a",
            "score": 1,
            "text": "Whether this is right or not, this is HAWT news.",
            "title_similarity": "0.17644468",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw4uh1h",
            "score": 2,
            "text": "> A research team from the School of Engineering, Computing and Mathematics (ECM) at Oxford Brookes led by Professor Iakovos Tzanakis conducted an in-depth study using more than 11,500 hours of computer simulation to show that wind farms can perform more efficiently by substituting the traditional propeller type\n\nResearch?  Computer simulation?\n\nWhy not just set up some turbines and compare output?",
            "title_similarity": "0.66179526",
            "sentiment_compound": 0.5473
        },
        {
            "id": "gw4vc4o",
            "score": 1,
            "text": "Bigger is Better. More is Better. Just go for it! Face losses when they hit and move on. In any space saved, install solar panels. Use swishy swashies in the oceans, and whirlie shells in the rivers. Dam all waterways. A large constant flow downstream isn't needed.\nThis is pretty much the simple breakdown of this.\nWhy not compromise. Use Vertical where it works best. Use Horizontal where it's best. Ease up on the dams! Water is needed downstream, especially during drought seasons. Use the units in the oceans when and where best. And solar panels can be used where they fit without turning residential/farm areas to battery substations. \nI'd love be to see it ALL used to it's max! It would at some point reduce cost to me at the end. Until then, experimentation must continue. This will cost. Those of us receiving power from steam generators whether gas, coal, or oil powered will be fronting the funds for the research. Those seeking to boost Green Energy should be working on using it entirely, and investing in it to get it here sooner.\nHere in Texas, we have all forms of electric production. We have some in the ocean of different kinds. We have solar, look at a satellite image of Austin, and the airport area. We have windmills (horizontal) in the center part of the State. We have privately owned horizontal AND vertical here. I'm very interested in vertical for personal power. We also have a couple river/dam driven small units. \nThis power generation stuff has become so available, and affordable that many more individuals can put it to use, and help with the development. My youngest son just had a house built in North Travis County, TX. He is having solar panels installed. We have enough sunlight year around to be useful and affordable. He is also having two General natural gas generators installed. The downfall? The company he buys his electricity from, will NOT buy back his extra from the solar panels. Most of the State is deregulated. We can chose our providers based on cost. That comes with drawbacks, such as this. My next home and property will have 2-3 Vertical generators. I'll likely have solar, and at least one generator for standby. Even at my extreme age, I can build some of this, and install all of it. \nWe need to make sure those of us who go out on our own can always do so. We need to find insure that any extra is bought back. The Sun, Wind, and Rain are natural things put here by our Creator, no matter your belief in the Beginning. This is OURS to use, as long as we don't prevent others. Many States and localities now make it unlawful to collect rainwater for personal use. Trust me, I'd be going to jail. A BUNCH! In Texas, there are areas who control the water Rights under your OWN property, preventing you from drilling a simple water well to provide water for personal household use. To me, that is wrong. Yet, they may be in another country, pull the Rights to your water, and SELL it to others miles and miles away. Restrictions HAVE to be put in place NOW to prevent this with Air and Sunshine! Keep pushing forward on the power production that is best.",
            "title_similarity": "0.6300119",
            "sentiment_compound": 0.9959
        },
        {
            "id": "gw54s17",
            "score": 2,
            "text": "While, this was already know about turbines and fans being more efficient being places vertically, as it's seen use in the air conditioning and heat pump technology used in residential and small business buildings. I disagree this will decrease the cost of electricity. Just because something is more efficient for the producer of said goods, in this case, electricity, it doesn't mean they will produce more for less, that's an idiotic assumption.",
            "title_similarity": "0.6952094",
            "sentiment_compound": 0.0643
        },
        {
            "id": "gw57z2e",
            "score": 2,
            "text": "Cities: Skylines players: \"Tell us something we don't know.\"",
            "title_similarity": "0.13339123",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw5r3fj",
            "score": 2,
            "text": "The first windmills were panemone windmills which had vertical axes and horizontal blades. This is oddly familiar.",
            "title_similarity": "0.40990877",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw60zkk",
            "score": 1,
            "text": "Another thing forgotten when factoring in the “cost” is the subsidies offered for running wind power. Whether directly or indirectly the consumer is still paying for their energy through their taxes or through their energy provider. This happens regardless of the orientation of the turbines.",
            "title_similarity": "0.5211623",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gw6amgb",
            "score": 2,
            "text": "I like the spin they put on this story.",
            "title_similarity": "0.30911875",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw6kmj7",
            "score": 2,
            "text": "Hopefully they are also more cost efficient to make and maintain... the giant ones here in Texas don't have a long life and require a lot of maintanence, which adds to the cost.",
            "title_similarity": "0.72647154",
            "sentiment_compound": 0.6983
        },
        {
            "id": "gwi5n4w",
            "score": 2,
            "text": "I read through every comment below, to this point, and everyone is concerned with cost, efficiency, durability. ... All of that is fine. But please remember that HAWTs kill vast numbers of birds every year; VAWTs are supposed to be much easier on birds. The idea behind wind and other renewables is to save the natural world. Do we have to destroy the world to save it?",
            "title_similarity": "0.575235",
            "sentiment_compound": 0.81
        }
    ]
}