{
    "80% of those diagnosed with oropharyngeal cancer are men, the leading cancer caused by HPV, surpassing cervical cancer. However, just 16% of men aged 18 to 21 years old have received a dose of the HPV vaccine, which is a cancer-prevention vaccine for men as well as women.\n": [
        {
            "id": "gw5wsd8",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.40784317",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gw6br0x",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.14812562"
        },
        {
            "id": "gw6d95o",
            "score": -6,
            "text": "Overall, the lifetime risk of developing oral cavity and oropharyngeal  cancer is: about 1 in 60 (1.7%) for men and 1 in 140 (0.71%) for women.  - American Cancer Society, 2021\n\nACS also notes that the rate of these cancers has not really increased for 20 years while the death rate has been declining for 30 years. \n\nNo science based argument can be made for marketing this vaccine to the general, male population. Cervical cancer, of course, has a completely different risk profile.",
            "title_similarity": "0.8075974",
            "sentiment_compound": -0.9805
        },
        {
            "id": "gw6wqeh",
            "score": 0,
            "text": "This vaccine destroyed my wife's insides - do not take it. She can't have children now.",
            "title_similarity": "0.41601592",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gw7cnjg",
            "score": 2,
            "text": "Society doesn't care about men. No one is marching for penises.",
            "title_similarity": "0.24762046",
            "sentiment_compound": -0.5897
        },
        {
            "id": "gw6ly8d",
            "score": 13,
            "text": "As usual, male medical problems are ignored. I'd never even heard of this, yet in my school HPV vaccines were mandatory for the girls, to stop cervical cancer.",
            "title_similarity": "0.61840695",
            "sentiment_compound": -0.8834
        },
        {
            "id": "gw6qgme",
            "score": 15,
            "text": "I mean, it's mostly just straight sexism (against men), and probably because of feminists.\n\nI'm not saying that to be controversial; it's just reality.",
            "title_similarity": "0.37690872",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gw71aua",
            "score": 12,
            "text": "This is because we have evolved to think of men as far more disposable than women. War, dangerous jobs, health care all the same idea. \n\nThere is an element of masculine protection, that is a little weird and sometimes gross that many of us are compelled by but again, this is an evolutionary mechanism. \n\nYou need far less men than women in a population to make it sustainable. \n\nThe disregard for men's lives is an element to the sexism that very few want to honestly approach.",
            "title_similarity": "0.6071324",
            "sentiment_compound": -0.0864
        },
        {
            "id": "gw6qjbu",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.10487377"
        },
        {
            "id": "gw6cp45",
            "score": -8,
            "text": "Because it's not offered to men here due to the homophobic herd immunity ideology that STD vaccination programs here operate on.",
            "title_similarity": "0.42119336",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw67910",
            "score": 5,
            "text": "Doctors won’t give it to men over 26. I tried getting it when I was 29 and they refused.",
            "title_similarity": "0.4452753",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw6dn5k",
            "score": -4,
            "text": "Corporate america is good at making us medical stupid so they can overcharge and bleed us dry.",
            "title_similarity": "0.47049057",
            "sentiment_compound": -0.128
        },
        {
            "id": "gw6iwev",
            "score": -7,
            "text": "And American prefer cutting babies' penis instead",
            "title_similarity": "0.42300525",
            "sentiment_compound": -0.128
        },
        {
            "id": "gw69oi2",
            "score": 22,
            "text": "This is what happens when you focus too much on getting women the vaccine and ignoring men in the initial release for the vaccine.",
            "title_similarity": "0.4830895",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gw7ex41",
            "score": 4,
            "text": "Personally, I do not recommend HPV vaccines to males.  \nAnd depending on the individual, it is even subject to debate with females.  \nThere are no 'free lunches' in medicine.  \n\n\nFertility issues can occur because of the HPV Vaccine.  \n\n\nAdverse reactions can occur because of the HPV Vaccine.  \n\n\nOne must individually weigh risk v. reward paradigms in all such measures, and then respectfully and conscientiously apply to the individual patient.   \n\n\nThe rhetoric needs to end. It's not scientific.   \n\n\n1. There were 25,176 reports to VAERS of adverse events.\n2. About 92.4% of the adverse events were not serious. Adverse events are considered serious if it is life threatening, or results in death, permanent disability, abnormal conditions at birth, hospitalization or prolonged administration.\n3. The most common events reported (for both male and female patients) were:\n   1. Syncope (or fainting)-common after needle injections, especially in pre-teens and teens;\n   2. Local reactions at the site of immunization (pain and redness);\n   3. Dizziness;\n   4. Nausea;\n   5. Headache.\n4. In the first report, there were 12,424 reports of adverse events 772 (6% of all reports) described serious adverse events including 32 reports of death. The most recent report from June 2006-June 2013 reported 85 deaths after the vaccine. Upon further screening of the reported deaths, there were no common patterns to the deaths that would suggest that they were caused by the vaccine. Some of the deaths were attributable to diabetes, viral illness, illicit drug use, and heart failure.\n5. There were two reports of unusual neurological illness that were variants of Amyotrophic Lateral Sclerosis (ALS) that resulted in the deaths of two young females. This finding is being evaluated by several highly regarded academic centers.\n6. There was increased reporting of syncope and pulmonary emboli compared to other vaccines given to females of the same age. Of the people who had blood clots, 90% had a known risk factor for blood clots, such as taking oral contraceptives. The VAERS reports cannot prove the vaccine caused the adverse event in women with these risk factors.  \n\n7.  National Health and Nutrition Examination Survey, which represented 8 million 25-to-29-year-old women residing in the United States between 2007 and 2014. Approximately 60% of women who did not receive the HPV vaccine had been pregnant at least once, whereas only 35% of women who were exposed to the vaccine had conceived. For married women, 75% who did not receive the shot were found to conceive, while only 50% who received the vaccine had ever been pregnant. Using logistic regression to analyze the data, the probability of having been pregnant was estimated for females who received an HPV vaccine compared with females who did not receive the shot. Results suggest that females who received the HPV shot were less likely to have ever been pregnant than women in the same age group who did not receive the shot. If 100% of females in this study had received the HPV vaccine, data suggest the number of women having ever conceived would have fallen by 2 million. Further study into the influence of HPV vaccine on fertility is thus warranted.",
            "title_similarity": "0.5982164",
            "sentiment_compound": -0.9859
        },
        {
            "id": "gw6bnsu",
            "score": 2,
            "text": "I caught my cervical cancer when it was still \"stage 0\" aka super easy to just remove, because it was mostly cells *about to turn into cancer* vs already existing cancer. I'm not alone in having it caught so early. It's exactly why pap smears are so important but likely also why the statistics for cervical cancer are so low! We routinely check on women for this but rarely do we even consider the possibility that the man might have  severe consequences (from hpv) as well. I think a large part of why is because for men, typically HPV causes no symptoms or symptoms so mild the man might not even notice. Let this be a warning to men out there to check yourself regularly and get vaccinated because you might never know!!",
            "title_similarity": "0.70956177",
            "sentiment_compound": -0.9655
        },
        {
            "id": "gw6wu5i",
            "score": 10,
            "text": "Maybe there is a lot of emphasis on women's health and not enough on men. Men commit suicide more in the US. They die at work at dramatically higher rates (90+%). It's interesting to juxtapose that with the fact that most undergrads and graduate students in the US are women. Most law students too. If the sexes were reversed, this would be considered evidence of sexism.",
            "title_similarity": "0.72231317",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gw7whhj",
            "score": 0,
            "text": "I got the vaccine and it actually gave me HPV which I can apparently give to other so... thanks vaccine. For giving me the disease. What a time to be alive.",
            "title_similarity": "0.54653645",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gw6cgnp",
            "score": 3,
            "text": "I have never understood how this associatiion between the HPV vaccine and women came around. I got the HPV vaccine when I went to college and I just assumed it was normal but I couldn't believe afterward how much peopole made it sound like I was wasting my time",
            "title_similarity": "0.5354763",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gw6nmvl",
            "score": -10,
            "text": "Can’t even get a date, so good luck with the cancer fellas I’ll just be here lonely and dying from a different cancer",
            "title_similarity": "0.48491672",
            "sentiment_compound": -0.6463
        },
        {
            "id": "gw6hehp",
            "score": 8,
            "text": "Because men aren't even allowed to get the vaccine in most of the first world?   \n    \nSource: I asked my doctor and that was what he said.",
            "title_similarity": "0.6467055",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6hcq4",
            "score": 13,
            "text": "So, tot the people who are getting immediately angry about men not getting the hpv vaccine: The vaccine was originally only made and tested for reducing cases of cervical cancer. That is why only people with uteruses used to get it. It has *only recently* been found to also reduce other cancers, like throat and anal cancer, caused by hpv.  \n  \nImagine the government going \"eh, if it works for x it will probbaly also work for y\" and putting it into national vaccination programmes without any scientific basis. That would (and should) cause uproar.  \n  \nIn Europe it's going into vaccination programmes for boys as well, for example in my country starting in 2022. The vaccine works best if you get it before ever coming into contact with hpv, so that's why they give it before people become sexually active and not to older people. They generally don't work backwards when implementing new vaccination programmes.",
            "title_similarity": "0.68267024",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gw74g9i",
            "score": 3,
            "text": "and I remember how they did a big push in highschool for girls to get the HPV vaccine.\n\nit's sad that men's health issues just don't get the attention, funding, or support that they should.",
            "title_similarity": "0.63028383",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gw6jdlq",
            "score": 1,
            "text": "If you want to dive deeper into how PR influences medical sales, marketing, and human behavior - read up on Valtrex. It's a much better drug than acyclovir (it's prodrome) but it's almost synomous with \" I got herpes on my junk\". If you have cold sores, you ask for acyclovir.",
            "title_similarity": "0.5451732",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw6uf0c",
            "score": -1,
            "text": "This vaccine faced so much resistance at first, from conservatives who claimed it would promote promiscuity, that I wonder what would have happened if it had been marketed towards both boys and girls from the beginning. \n\nHistorically, any medication, or even policy that gives women even then smallest bit of control over our bodies and sexual health, faces backlash and stirs up controversy.",
            "title_similarity": "0.57098246",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gw83bnw",
            "score": -1,
            "text": "HPV vaccine is a killer",
            "title_similarity": "0.45366472",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gw763n8",
            "score": 10,
            "text": "[deleted]",
            "title_similarity": "-0.10487377"
        },
        {
            "id": "gw6bdrq",
            "score": 6,
            "text": "I (35F) got the vaccine in college even though I had some abnormal cervical cells requiring treatment because it protects again some strains and not others etc. I don’t think that my now husband ever got it because he’s older so was in his 30s when it came out. Unfortunately he had an affair a couple years ago, so has a potential new exposure and thus so do I. We worked it out etc still together, long long story but what I’m wondering is whether either of us should be getting additional screening. I mean I’m going back to regular Pap smears of course. But can you screen for oropharyngeal cancer or HPV infection? Besides the vaccine what other steps should people consider? Obviously I’ll talk to doctor but wondered if anyone knows anything about this.",
            "title_similarity": "0.6468103",
            "sentiment_compound": -0.8446
        },
        {
            "id": "gw63ew0",
            "score": 28,
            "text": "As of June 2020, oropharyngeal (throat) cancer was not the leading cancer caused by HPV:\n\n“Human papillomavirus (HPV) infections account for over 600,000 new cancer cases every year \\[[1](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7271998/#ppat.1008524.ref001)\\]. HPV is implicated in approximately 70% of oropharyngeal cancers (OPCs), 90% of anal cancers, and virtually all cases of invasive cervical cancer (ICC) in the U.S \\[[2](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7271998/#ppat.1008524.ref002)\\].”\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7271998/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7271998/)\n\nEdit: \n\nHPV is thought to be responsible for:\n\n\\- more than 90% of anal and cervical cancers;\n\n\\- about 70% of vaginal and vulvar cancers;\n\n\\- 60% of penile cancers. \n\nCancers in the back of the throat (oropharynx) traditionally have been caused by tobacco and alcohol, but recent studies[1 2 3](https://www.cdc.gov/cancer/hpv/basic_info/cancers.htm#ref) show that about 60% to 70% of cancers of the oropharynx may be linked to HPV. Many of these may be caused by a combination of tobacco, alcohol, and HPV.\n\nMost of the time, HPV goes away by itself within two years and does not cause health problems. It is thought that the immune system fights off HPV naturally.\n\n[https://www.cdc.gov/cancer/hpv/basic\\_info/cancers.htm#:\\~:text=Almost%20all%20cervical%20cancer%20is,cancer%20is%20caused%20by%20HPV](https://www.cdc.gov/cancer/hpv/basic_info/cancers.htm#:~:text=Almost%20all%20cervical%20cancer%20is,cancer%20is%20caused%20by%20HPV).",
            "title_similarity": "0.82034695",
            "sentiment_compound": -0.3845
        },
        {
            "id": "gw6ni4l",
            "score": 7,
            "text": "Australia has had one of [most successful roll outs of the HPV vaccine](https://duckduckgo.com/?t=ffab&q=australia%27s+successful+hpv+vaccination+campaign&ia=web) in the world starting in 2007, yet cervical cancer rates have remained more or less unchanged since about 2002. \n\nSee [here, figure two](https://www.canceraustralia.gov.au/affected-cancer/cancer-types/cervical-cancer/cervical-cancer-australia-statistics).\n\nAs you can see the incidence has hovered around 7 cases per 100k for almost 2 decades. All the the decrease in incidence took place prior to the introduction of Gardasil in 2007. \n\nThe vaccine might prevent HPV, but it apparently doesn't do what it's creators promised: prevent cervical cancer. At least not in Australia. \n\nAnd before you protest about how the cancer-preventing effects of Gardasil won't be seen for years of decades, you must realize that cervical cancer detection in Austrailia peaks around age 40. \n\nFor fun I cobbled a couple of informative charts together from the [Australian Institute for Health and Welfare](https://www.aihw.gov.au/reports/cancer/cancer-data-in-australia/contents/cancer-rankings-data-visualisation):\n\n[Incidence of Cervical Cancer by year and age group](https://drive.google.com/file/d/1abE5ftnWf053lohjidgDK0sS0HPAZidi/view?usp=sharing)\n\nSo believe what you want, but if Gardasil doesn't prevent cervical cancer in women, I doubt it's going to prevent oropharyngeal cancer in men.",
            "title_similarity": "0.7195457",
            "sentiment_compound": -0.9661
        },
        {
            "id": "gw6qtim",
            "score": -10,
            "text": "Men need to take preventative action so the people they sleep with don’t get cancer",
            "title_similarity": "0.45622888",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gw6bewf",
            "score": 12,
            "text": "Didn't it make sense that 80% of cases are men if a large portion of women are vaccinated? Of course the women will be less likely to get the cancer if they are protected.\n\nThe real question is how large that group of men is, and if the size of that group warrants a vaccination campaign like there is for women (at least in my country).",
            "title_similarity": "0.8193392",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6h3v6",
            "score": -4,
            "text": "For lots of men, it's really hard to tell whose vagina you should not put your mouth on.",
            "title_similarity": "0.4142059",
            "sentiment_compound": -0.1761
        },
        {
            "id": "gw74hi9",
            "score": 0,
            "text": "I get offered the flu vaccine a",
            "title_similarity": "0.44261748",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gw76jck",
            "score": 0,
            "text": "Val Kilmer and Michael Douglas both got throat cancer, and Michael Douglas has been saying it was most likely cause by oral sex.  \n\nI think I should get this vaccine.",
            "title_similarity": "0.6489686",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gw8tzdy",
            "score": 0,
            "text": "Can circumcising reduce this cancer in men? Genuinely interested to know.",
            "title_similarity": "0.5877692",
            "sentiment_compound": -0.5499
        },
        {
            "id": "gw9lywg",
            "score": 0,
            "text": "So most men are going to die from a preventable illness because everyone was led to believe that a vaccine that could otherwise save them was only available to women? \n\nUmm... Nobody is questioning how they came to this decision? Like y'all are just \"huh. Ain't that just the darndest thing\". \n\nWho did the initial study that the HPV vaccine should only be available to women? I want to know what else they thought about because THIS is beyond messed up.",
            "title_similarity": "0.6601728",
            "sentiment_compound": -0.6046
        },
        {
            "id": "gw9t09s",
            "score": 0,
            "text": "Hey OP @u/mvea any information or discussion about uptake/availability for men in the UK?? This is quite huge",
            "title_similarity": "0.45399505",
            "sentiment_compound": 0.4503
        },
        {
            "id": "gw6ffaf",
            "score": 11,
            "text": "Pretty sure this is a side effect of guidelines that support mainly women getting the vaccine and make no mention of men. I could be wrong though.",
            "title_similarity": "0.48870364",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw6k4pb",
            "score": 11,
            "text": "HPV vaccines are a joke. If you are over 30 you cant get it if you are a man you cant get it. \n\nI am a man and I asked about getting the Gardasil 9 when it first came out. I was 18 it seemed like a good idea. I was turned away at least 3 times. They treated me like a sexist who was trying to steal vaccines for women. It was weird.",
            "title_similarity": "0.6520552",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gw6xkj3",
            "score": 14,
            "text": "I thought there was some huge controversy surrounding Gardasil, the primary HPV vaccine.\n\nEdit: Yeah [this thing](https://www.baumhedlundlaw.com/prescription-drugs/gardasil-lawsuit/). Miscarriage rates doubled (12% -> 25%) in women who got the shot and 11% of women who got the shot developed breast and/or reproductive disorders within the first 7 months post-injection (compared to the placebo group, which experienced the complications at a rate of 1.8%).",
            "title_similarity": "0.7714087",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gw6acfd",
            "score": -1,
            "text": "DJ Khaled be like \n\n'I'm a doctor.  Protect yo self.'",
            "title_similarity": "0.2667755",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gw6mlge",
            "score": -1,
            "text": "I plan to get the vaccine soon (32yo male) since i only got 2 intercourse in my life (yet)",
            "title_similarity": "0.6466198",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6q5xo",
            "score": -1,
            "text": "That is what actor Michael Douglas got from performing cunnilingus on his wife, Catherine Zeta-Jones",
            "title_similarity": "0.42530668",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6v289",
            "score": 1,
            "text": "Is there an associated reason? Is there a stigma that the vaccine is \"for girls\" or something ridiculous?",
            "title_similarity": "0.36442998",
            "sentiment_compound": -0.4329
        },
        {
            "id": "gw6vec3",
            "score": 1,
            "text": "My mom read a story about this and had me get this ASAP. Glad she realized it could be a huge problem.",
            "title_similarity": "0.33056438",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gw6zkay",
            "score": 1,
            "text": "This vaccine is given to boys and girls at age 12. California here.",
            "title_similarity": "0.5731696",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6zvhr",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.10487377"
        },
        {
            "id": "gw71qlk",
            "score": -1,
            "text": "Dental dam people. Geesh....",
            "title_similarity": "0.15160574",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw732lw",
            "score": 1,
            "text": "I remember my doctor telling me why I should get it, as soon as she said helps prevent certain cancers, my sleeve was already rolled up",
            "title_similarity": "0.55328727",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gw75qdf",
            "score": 1,
            "text": "You can't compare those two percentages. The comparable percentage would be of those vaccinated, what percentage are male? Though, I'm willing to bet the disparity would be the same.",
            "title_similarity": "0.50588137",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7dy4a",
            "score": 1,
            "text": "The sexism that teaches women are weak and need protection is the same sexism that doesn’t teach that men also need protection. \n\nLocally, schools were offering the HPV Vaccine to girls only in Grade 7. Both of my boys went through grade 7 and I complained both times to the school board and department of health, snd was told it is only for prevention of cervical cancer, so they’re not offering it to boys. I argued “what about the girls who don’t get the vaccine, who’s protecting them?” and their answer was basically this is the measure officials were taking. Neither of my kids have the vaccine, and my dad died in 2016 of complications resulting from much earlier treatment of this form of cancer (radiation therapy in 2000 ended up collapsing the veins/arteries going to his brain, so when his heart valve reduced his blood pressure he would lose his balance, and eventually his brain starved of oxygen).",
            "title_similarity": "0.62260276",
            "sentiment_compound": -0.977
        },
        {
            "id": "gw7x5dv",
            "score": 1,
            "text": "Fear advertising.\n\nGardasil has been marketed for years as an HPV vaccine but in the last decade they started changing their advertising to claim it prevents cancer.\n\nHPV is extremely common. It doesn't mean you'll get cancer if you get it. The company that makes it is just extremely aggressive at trying to sell their product.",
            "title_similarity": "0.7178843",
            "sentiment_compound": -0.953
        },
        {
            "id": "gw7y9e8",
            "score": 1,
            "text": "When it was time for me to get vaccinated, all the girls were ushered out, the boys laughing at us, punching our vaccinations sites. \nThis year, my brother proudly got vaccinated along with the rest of his class.\nI’m glad times are changing",
            "title_similarity": "0.556049",
            "sentiment_compound": 0.8689
        },
        {
            "id": "gw60upq",
            "score": 40,
            "text": "[removed]",
            "title_similarity": "-0.14812562"
        },
        {
            "id": "gw5wutv",
            "score": 83,
            "text": "[deleted]",
            "title_similarity": "-0.10487377"
        },
        {
            "id": "gw6gesv",
            "score": 2,
            "text": "How do men get HPV? Apart from giving oral sex to women, I mean?",
            "title_similarity": "0.5303334",
            "sentiment_compound": 0.4137
        },
        {
            "id": "gw6loci",
            "score": 2,
            "text": "Humans love sex. Humans are meant to have sex. If you as a parent can teach your kids how to have safe, responsible and shameless sex, you are winning as a parent. Giving your kids the tools to make good decisions when you're not around is the sign of a good parent. \n\nEventually your kids will be free adults. If you were too strict with them as teenagers, they are going to be reckless young adults without the knowledge or support to make beneficial life decisions.",
            "title_similarity": "0.43687946",
            "sentiment_compound": 0.9744
        },
        {
            "id": "gw6odyg",
            "score": 2,
            "text": "That’s because when it first came out it wasn’t available to men.",
            "title_similarity": "0.18644851",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6r3ro",
            "score": 2,
            "text": "My insurance won’t cover it. Guess they will just have to pay for my cancer treatments.",
            "title_similarity": "0.480835",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gw6s14n",
            "score": 2,
            "text": "I wonder if they took into account other possible causes of the disparity in oropharyngeal cancer for men as a factor for the difference in the diagnosis rate between men and women.\n\nFor e.g., the prevalence of smoking cigars in the U.S. is nearly a 10 to 1 difference between men and women.",
            "title_similarity": "0.7553746",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gw6tb4m",
            "score": 2,
            "text": "I remember asking my female physician at the time the vaccine came out “can I get it?” And she said “no it’s just for women because HPV doesn’t have the same negative effects for men”\n\nTo which I responded, “well it’s a sexually transmitted disease, so if men are vaccinated it should help protect women too right?”\n\nTo which she responded “still no”. The complete lack of care for men’s health on HPV have been there from the start.",
            "title_similarity": "0.5889918",
            "sentiment_compound": 0.4329
        },
        {
            "id": "gw6v41x",
            "score": -2,
            "text": "I heard there is good research on AHCC\n(Active hexose correlated Compound)\nWhen users took something like 3000mg a day for 6 months, it cured a bunch of people.\n\nIt's made from a shitake mushroom compound",
            "title_similarity": "0.68124145",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gw73h39",
            "score": 2,
            "text": "Mid 30s male, have had oral sex with almost 100 partners.  Any point in getting it now or am I doomed?",
            "title_similarity": "0.6986449",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gw8iit4",
            "score": -2,
            "text": "only racists who hate black people get the HPV vaccine",
            "title_similarity": "0.6375263",
            "sentiment_compound": -0.802
        },
        {
            "id": "gw655aw",
            "score": 18,
            "text": "I remember getting that vaccine when I was a young teen and it was still pretty new and I was glad to get it but I hated that shot. At the time I think it needed one or two booster shots too and I think its been scaled down since then. I’ve never been scared of needles or freaked out at getting shots, which I am sure my mom is grateful for since my sister was an absolute hellion when she needed shots, but even though I didn’t fight it I always remember the HPV shot being one of the most painful shots I got for some reason and then dreading when I had to get my next one. I really braced myself for that one. I dont know why that needle hurt compared to other shots but it just did for me and I still remember that. Still 100% worth it though and I dont know how you could risk your childs life by not having them get it. Some parents just arent cut out for it I guess. Although a lot of it is probably just ignorance, but just the same.",
            "title_similarity": "0.5536872",
            "sentiment_compound": -0.949
        },
        {
            "id": "gw6dhjc",
            "score": 3,
            "text": "any point in getting it at late 30s?\n\nim not having sex anytime soon since last time was around 10 years ago",
            "title_similarity": "0.47050136",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6g6y8",
            "score": 3,
            "text": "Why doesn’t the vaccine work on older people?",
            "title_similarity": "0.50734186",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7kt2v",
            "score": 3,
            "text": "This is because the world hates men these days.\n\nCovid is twice as deadly for men but you barely see it mentioned.",
            "title_similarity": "0.57545567",
            "sentiment_compound": -0.2382
        },
        {
            "id": "gw6ifky",
            "score": 13,
            "text": "Just checked, [NHS giving it to everyone](https://www.nhs.uk/conditions/vaccinations/hpv-human-papillomavirus-vaccine/) since 2018:\n\n>**Who can have the HPV vaccine through the NHS vaccination programme?**  \n>  \n>The  1st dose of the HPV vaccine is routinely offered to girls and boys aged  12 and 13 in school Year 8. The 2nd dose is offered 6 to 24 months  after the 1st dose.",
            "title_similarity": "0.69951403",
            "sentiment_compound": 0.34
        },
        {
            "id": "gw6bwj0",
            "score": 39,
            "text": "With all due respect, my school never even said there was an HPV vaccine for men",
            "title_similarity": "0.4331125",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gw6dusd",
            "score": 4,
            "text": "Were there issues with the HPV vaccine? I seem to remember some noise. Or was it just noise?",
            "title_similarity": "0.37656766",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6eht3",
            "score": 4,
            "text": "My mom made me get it",
            "title_similarity": "0.04013904",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6gsx8",
            "score": -3,
            "text": "Doesnt protect against alot of the strains though.",
            "title_similarity": "0.08891996",
            "sentiment_compound": -0.5242
        },
        {
            "id": "gw6ifeg",
            "score": 4,
            "text": "How many total cases though? Never even heard of that cancer while cervical is extremely common in women",
            "title_similarity": "0.6402167",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gw6isfw",
            "score": 3,
            "text": "As a girl I never received this one to my knowledge. Can you request from somewhere updated vaccines or anything? I live in Canada but have no clue I haven't had any vaccines since I was very young.",
            "title_similarity": "0.3979665",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gw6ie9x",
            "score": 32,
            "text": "I've asked to get my HPV shot and was told no, and I quote the nurse, because I am \"not a man who has sex with men.\"\n\n\n\nOkay, thanks Canadian Healthcare system.  I didn't know that cancer has stopped affecting The Straights...",
            "title_similarity": "0.55960155",
            "sentiment_compound": 0.7518
        },
        {
            "id": "gw6gdx0",
            "score": 4,
            "text": "Fun fact: if you're in the navy getting this shot is a good way to tell if your micro managing LPO is violating HIPAA. It's a three dose vaccine, and shows as incomplete until the third dose only on your medical chart, got a real pain in the ass LPO removed from his position when he told me to go to medical to complete my vaccination two days after the first shot.",
            "title_similarity": "0.6441536",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gw6ggx9",
            "score": 6,
            "text": "In Australia 80% of young women and 76% or young men are now getting the vaccine each year. ([Source](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6194907/)).",
            "title_similarity": "0.70499086",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6y2xn",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "-0.10487378"
        },
        {
            "id": "gw6bh1k",
            "score": -5,
            "text": "Yep, which is why I got this vaccine. \n\nI’m not getting the covid vaccine since it doesn’t worry me. But this seemed like a very real threat.",
            "title_similarity": "0.4064985",
            "sentiment_compound": -0.4797
        },
        {
            "id": "gw6v2l1",
            "score": 7,
            "text": "I’m currently dealing with anal HPV, going for a check tomorrow.\n\nThe vaccine came out when I was about 12, so when kids are now given the vaccine, but they didn’t give it to boys at that time.\n\nDiagnosed with anal HPV at 22, had procedures for it, a small potential recurrence I’m checking on tomorrow. I finished my vaccine series at 23 because the docs said it would offer protection from strains I might not have acquired yet - get your shots!",
            "title_similarity": "0.61424035",
            "sentiment_compound": -0.4753
        },
        {
            "id": "gw60dei",
            "score": -26,
            "text": "[removed]",
            "title_similarity": "-0.14812562"
        },
        {
            "id": "gw6aqj1",
            "score": -8,
            "text": "i dont know if is me but....seems this has been pushing really hard core in the past few years...yet none of my male friends in highschool and work ever recall any of them getting this type of cancer.",
            "title_similarity": "0.62810713",
            "sentiment_compound": -0.4576
        },
        {
            "id": "gw6gex1",
            "score": 9,
            "text": "In grade either seven or eight. I can’t remember but everyone got their HPV vaccines in the chapel at school. Boys and girls.",
            "title_similarity": "0.5504265",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6glqz",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "-0.10487377"
        },
        {
            "id": "gw6cfu7",
            "score": 8,
            "text": "As a 38 yr old male in Canada could i get the vaccine ?",
            "title_similarity": "0.5679096",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw68447",
            "score": 26,
            "text": "Didnt even know that it was possible to get it for men, until my girlfriend got it at 18.\n\nAfter that I asked my doc about it the next time I saw him. After he looked it up he said I was right and its something he would definatly recommend, but our medical insurance wouldnt pay for it anymore because I was to old and at my age it was assumend that we already had sex and so it would be possible that we(here I) already have/had it....\n\n+testing for it is easy as a women, but hard as a men (at least without symptoms) so yeah, I didnt get it.",
            "title_similarity": "0.60406256",
            "sentiment_compound": 0.8498
        },
        {
            "id": "gw69ydy",
            "score": 28,
            "text": "The article implies it's only for people 26 or under. But:\n\nhttps://www.cdc.gov/mmwr/volumes/68/wr/mm6832a3.htm#B1_down\n\n> Ideally, HPV vaccination should be given in early adolescence because vaccination is most effective before exposure to HPV through sexual activity. For adults aged 27 through 45 years who are not adequately vaccinated,* clinicians can consider discussing HPV vaccination with persons who are most likely to benefit. HPV vaccination does not need to be discussed with most adults aged >26 years.",
            "title_similarity": "0.61524785",
            "sentiment_compound": 0.9285
        },
        {
            "id": "gw6fkyy",
            "score": 9,
            "text": "Didn’t Michael Douglas get oropharyngeal cancer from HPV? This question comes from ignorance and only hearing it from him, but he said he got it from excessive oral sex.  Any truth to that?  I had HPV and I can’t help to worry.",
            "title_similarity": "0.6701014",
            "sentiment_compound": -0.2869
        },
        {
            "id": "gw6cqlh",
            "score": 55,
            "text": "[deleted]",
            "title_similarity": "-0.10487378"
        },
        {
            "id": "gw66wvk",
            "score": 31,
            "text": "How does the HPV get in there?",
            "title_similarity": "0.19876142",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw69u34",
            "score": 11,
            "text": "I have come to learn in life that most people have a form of HPV and/or herpes. Stay safe, y'all.",
            "title_similarity": "0.50919604",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw7dgea",
            "score": 12,
            "text": " [https://www.cdc.gov/std/hpv/stdfact-hpv-and-men.htm](https://www.cdc.gov/std/hpv/stdfact-hpv-and-men.htm)\n\n### Can I get tested for HPV?\n\nNo, there is currently no approved test for HPV in men.\n\n...Are you kidding me?",
            "title_similarity": "0.51665217",
            "sentiment_compound": -0.3164
        },
        {
            "id": "gw64ev1",
            "score": 288,
            "text": "[removed]",
            "title_similarity": "-0.14812562"
        },
        {
            "id": "gw6e461",
            "score": 13,
            "text": "My dad was treated for oral cancer this year. He never drinks and has never smoked.\n\nI'm also a dentist who does oral cancer screenings for all patients over 20y/o for their recalls. I refer people for biopsy regularly and these result in a few cancer treatments per year. If your cancer is not caught early (and you live) you will be disfigured by the procedure to the point you'll need facial prosthetics.",
            "title_similarity": "0.69602764",
            "sentiment_compound": -0.9618
        },
        {
            "id": "gw67us0",
            "score": 223,
            "text": "This vaccine was made available for boys in our National Vaccination Plan last year iirc ( a bit late but better now than never)... Girls can have it for free for years now.",
            "title_similarity": "0.5901932",
            "sentiment_compound": 0.8519
        },
        {
            "id": "gw6gvv7",
            "score": 14,
            "text": "When I asked for one for years, doctors would laugh and say I didn’t need one and they don’t make a vaccine for men for HPV. Why was I lied to? Makes me not trust doctors.",
            "title_similarity": "0.581676",
            "sentiment_compound": -0.1783
        },
        {
            "id": "gw6dhgw",
            "score": 151,
            "text": "I had a doctor tell me \"You're  a guy, you don't need it\". So, theres that.",
            "title_similarity": "0.30882",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6dc7m",
            "score": 16,
            "text": "Why don't doctors brief you on this kind of stuff during yearly check ups??",
            "title_similarity": "0.42390203",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw60rhg",
            "score": 21,
            "text": "[removed]",
            "title_similarity": "-0.14812562"
        },
        {
            "id": "gw69dkn",
            "score": 314,
            "text": "I remember when this vaccine became available and the marketing for it was heavily shaded towards young women. I was in my late teens at the time, but I just remember it being a shot for women to help protect against HPV, but later cervical complications. Never knew it was advised for men, too.",
            "title_similarity": "0.6342857",
            "sentiment_compound": 0.7876
        },
        {
            "id": "gw6erki",
            "score": 351,
            "text": "Funny. I asked my doctor and he said it was not approved for 40-year olds. Like, dude, am I barred from eating pu**y because I’m a single dad? Now I want to bring some of these reports in to him and ask again.",
            "title_similarity": "0.6160347",
            "sentiment_compound": 0.5216
        },
        {
            "id": "gw67crq",
            "score": 491,
            "text": "I made sure my sons got theirs as well as my daughters.",
            "title_similarity": "0.21212277",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gw6eabk",
            "score": 438,
            "text": "I'm a 57 year old guy who has had issues with vocal cord papillomas (from HPV) for over 10 years. I've had 4 surgeries and multiple in-office laser procedures to remove the papillomas. One of my doctors said that the HPV vaccine probably would have prevented it, but it was definitely too late for me. When I had a visible throat lump last year, the immediate thought was cancer from the HPV (turned out to be thyroid cancer).\n\nSo yeah, get the vaccine, the bad things that can happen with HPV are not fun. I wish I would have been able to. Regardless of how old you are, what your sexual past/present/future are or you expect it to be, get it.\n\nAnd yes, both of my daughters got the vaccines as teenagers.",
            "title_similarity": "0.7644151",
            "sentiment_compound": -0.9376
        },
        {
            "id": "gw66dms",
            "score": 135,
            "text": "Is it worth getting as an older person?",
            "title_similarity": "0.11024155",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gw6i6k7",
            "score": 89,
            "text": "Had a bunch of friends and family get so confused and even pushy about the fact I had my sons get the HPV vaccine. \" Why would a boy need that?\" \n\nUm, guys get mouth , throat and penile cancer from HPV. They just aren't tested for it like women are. I explained that to my boys and they were completely onboard with getting the shots.",
            "title_similarity": "0.67764866",
            "sentiment_compound": -0.5982
        },
        {
            "id": "gw6bj9t",
            "score": 1474,
            "text": "Guys I just looked into this- the vaccine recommended has been increased to 45 and (check with your insurer first) but it’s generally covered by many insurances.. it’s a series of 3 quick shots over six months! No reason not to get it.",
            "title_similarity": "0.6810102",
            "sentiment_compound": -0.2828
        },
        {
            "id": "gw6ehaz",
            "score": 354,
            "text": "As a neuroradiologist, we see head and neck cancers in relatively young men and women not infrequently. Given that smoking and drinking are down it is fast becoming the main cause of squamous cell carcinoma of the head and neck.\n\nGet the vaccine. Just get it. Maybe you’ve only\nBeen with 1-2 people or plan to, or maybe you’ve been with 50. Get it either way. Just get it. You do not want to risk it.",
            "title_similarity": "0.7682394",
            "sentiment_compound": 0.1511
        },
        {
            "id": "gw611y8",
            "score": 3017,
            "text": "God. I remember when the vaccine first came out. Parents didn’t want their eligible students to get it because “it would make them have sex.”",
            "title_similarity": "0.48762435",
            "sentiment_compound": 0.34
        },
        {
            "id": "gw6fnzn",
            "score": 68,
            "text": "The HPV vaccine is optional for men in the military. Not sure about women but when the doctors tech said that the first shot will prevent something like 90% of genital warts, I decided it was probably worth it",
            "title_similarity": "0.72952926",
            "sentiment_compound": 0.645
        },
        {
            "id": "gw6ayst",
            "score": 72,
            "text": "For anyone wondering, it is offered as part of routine child vaccinations for boys and girls starting at 11. Let’s continue to spread awareness that boys need it too!",
            "title_similarity": "0.50151384",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6uf3r",
            "score": 90,
            "text": "My dad was diagnosed with Stage 4 squamous cell carcinoma at age 52. Started in his tonsil and had spread to lymph nodes. Did surgery then chemo & radiation. He was then cleared of disease. Did all his appointments and scans. Continued to work hard and play hard. \n\nHis cancer was HPV positive. He was in remission & made official cancer survivor status. He got his lower dental implants done about 5.5 years post cancer diagnosis.  6 months later I brought him to ER with jaw pain & swelling and they diagnosed him with osteoradionecrosis of the mandible and made a game plan for treatment. 18 days later I found him dead. He was 58 years old. Looking back, I see more clearly but at the time I had not realized how ill he was and it was awful and traumatizing finding him deceased. He bucked up a tree into rounds that day and laid a patio out of pavers. He seemed his normal self. I just never ever expected it.\n\nHe was my best friend.\n\nThe only positive I can glean is that my daughters AND my sons may not suffer the same fate. \n\nVaccinate your kids.",
            "title_similarity": "0.7433305",
            "sentiment_compound": 0.811
        },
        {
            "id": "gw6e872",
            "score": 223,
            "text": "My doctor's never mentioned the HPV vaccine until the second I mentioned I was gay. Glad I got it at least I guess.",
            "title_similarity": "0.58110565",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gw5zjzu",
            "score": 10588,
            "text": "Straight up I had no idea there was a vaccine for men. Nobody tells you this stuff after a certain age.",
            "title_similarity": "0.50447184",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw5xwsw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.14812562"
        },
        {
            "id": "gw6aryu",
            "score": 3,
            "text": "Thats because the hpv strains for respiratory papillomatosis is 6 and 11 tho right?",
            "title_similarity": "0.5334433",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw6bn7t",
            "score": 1,
            "text": "part of the issue is the efforts to vaccinate with this vaccine, and just about all the public resources and discourse was focused on girls/women.",
            "title_similarity": "0.51476026",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gw6bwn3",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.10487377"
        },
        {
            "id": "gw6cj7g",
            "score": 11,
            "text": "I remember when the vaccine was fairly new in my country and only girls got it for free. My parents paid 2000€ to vaccinate me and my 2 brothers from their own pocket.",
            "title_similarity": "0.6094151",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gw6cvg2",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.10487378"
        },
        {
            "id": "gw6d268",
            "score": 1,
            "text": "Wasn't the vaccine for women only until recently?",
            "title_similarity": "0.39033562",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6digs",
            "score": 1,
            "text": "I‘m 23, from Germany, the vaccine was long out when I should have been vaccinated but nobody told us it is also for men. My sister is vaccinated. Since I’m over 18 my health insurance does not cover it anymore and getting vaccinated will cost ~ 600 Euros which is hard to afford as a college student. My girlfriend just got vaccinated, her insurance pays vaccinations over 18. I’m pissed",
            "title_similarity": "0.6393422",
            "sentiment_compound": -0.8126
        },
        {
            "id": "gw6drx0",
            "score": 3,
            "text": "My daughter has had the vaccine and so will my son when he is old enough.",
            "title_similarity": "0.53664094",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6dw2t",
            "score": 27,
            "text": "Unrelated question: I got my first two doses of this vaccine and missed my appointment for the third. \nHow do I go about finishing the vaccine? \nDo I need to start over?\nCan I just get the last dose? \n\nI got the first two over a year ago.",
            "title_similarity": "0.5745826",
            "sentiment_compound": -0.4098
        },
        {
            "id": "gw6eb6f",
            "score": 1,
            "text": "Has anyone looked at protection from an HPV vaccine received years after exposure?",
            "title_similarity": "0.55924845",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6ec60",
            "score": 1,
            "text": "What if you’re an asymptomatic carrier? I didn’t think there was a test for HPV in males aside from having warts. Also, do things like plantar warts or warts on a finger have any interaction with the vaccine?",
            "title_similarity": "0.5375128",
            "sentiment_compound": 0.4329
        },
        {
            "id": "gw6elhp",
            "score": 1,
            "text": "As a 51-year old man with an average number of sex partners over my lifetime, is it too late for me to benefit from an HPV vaccine?",
            "title_similarity": "0.7562957",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gw6elqp",
            "score": 13,
            "text": "Head & Neck cancer survivor here, caused by HPV. I’m too old to have received it in my youth, as it wasn’t developed yet. Sure wish I could have gotten this, it sure changed my life, but I’ve made damn sure my own kids have.",
            "title_similarity": "0.61603135",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gw6emz2",
            "score": 6,
            "text": "Ugh I remember when my country rolled these out. It was given to all 8th grade girls (so 13-14 year olds) for free but everyone else had to pay. I was in my 20s at the time and had to shell out the equivalent of almost $500 USD. Luckily I was able to afford it but it still sucked.",
            "title_similarity": "0.5872498",
            "sentiment_compound": -0.0761
        },
        {
            "id": "gw6eolz",
            "score": 1,
            "text": "I only got 1 of 3 shots back in Feb 2020\nI just forgot to go back for the other two and haven’t since... figured it’s too late now",
            "title_similarity": "0.4245417",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6fegh",
            "score": 6,
            "text": "I had no idea this vaccine existed until this year, and at this point, my doctor refused to give it to me because of my age (mid thirties). From what I've read, I can't see the harm in getting it later in life.",
            "title_similarity": "0.53624856",
            "sentiment_compound": -0.1406
        },
        {
            "id": "gw6fiq2",
            "score": 8,
            "text": "After my female roommate contracted hpv in the very early days of tindr, I supprised my primary by asking for the shot. Told me I was the first male in his practice to even ask about it.",
            "title_similarity": "0.6193923",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6fnni",
            "score": 21,
            "text": "Except healthcare mentions nothing to men. At that age bracket I can tell you from personal experience that I paid out of my ass for health insurance just to have my checkups consist of the doctor looking at my age and acting like its a waste of time talking to me.",
            "title_similarity": "0.5347402",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gw6fz4h",
            "score": 3,
            "text": "Hell yeah I got mine a couple years ago",
            "title_similarity": "0.1191346",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gw6g53q",
            "score": 9,
            "text": "While I knew there was a vaccine for men, and have received that vaccine, I had no idea about this statistic. This needs to be more well known, as I always thought HPV was far more dangerous for women than men. \n\nBros, go get your HPV vaccine. Take care of yourselves.",
            "title_similarity": "0.60041094",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6gsln",
            "score": 1,
            "text": "Where I live it was given by the gynecologist. My pediatric doc never mentioned it as an option. It's only the last couple years I've seen the vaccine commercials that include men and boys.",
            "title_similarity": "0.61626",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6gvkt",
            "score": 4,
            "text": "I received this vaccine 5 years ago at the VA. They asked if I wanted it because it would prevent spreading HPV to my partners. They didn't tell me it'd prevent me from getting cancer, too.",
            "title_similarity": "0.58445287",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gw6gw7p",
            "score": 1,
            "text": "If the HPV virus infection sites can become cancerous, and mouth/throat cancers are also indicated as being caused by this, does that mean most of these cases are transmitted through oral-genital contact?",
            "title_similarity": "0.5934916",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6h63r",
            "score": 1,
            "text": "I believe I got my vaccine when I was 25, which I think was the oldest you could be to get Gardasil as a guy (at the time). Do we have any data on how long immunity lasts for the vaccines?\n\nI had a coworker at a previous company come down with Mumps despite receiving the MMR vaccine as a child, so these things definitely don't last for life. I also didn't know Mumps was still a thing.",
            "title_similarity": "0.6969001",
            "sentiment_compound": 0.4522
        },
        {
            "id": "gw6habl",
            "score": 1,
            "text": "If someone caught hpv years ago when they were young, it's there anything that could do now years later to reduce their cancer chance?\n\nWhat types of cancer does it cause in men?",
            "title_similarity": "0.72341007",
            "sentiment_compound": -0.8466
        },
        {
            "id": "gw6hh52",
            "score": 1,
            "text": "I was told by all my doctors growing up it wasn't necessary.",
            "title_similarity": "0.2792788",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gw6i5tl",
            "score": 1,
            "text": "There’s a HPV vaccine for men? Since when?",
            "title_similarity": "0.59298384",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6i90p",
            "score": 3,
            "text": "I went to Catholic High School in Ontario around the year 2000 and never heard of HPV until years later.",
            "title_similarity": "0.47721323",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6i9q7",
            "score": 6,
            "text": "I'm in Scotland and it's free here for men. The only issue I had is that I needed to travel to the mainland for it three times because it couldn't be done locally, even though it could if I had a vagina. Well worth getting it done and they did the hepatitis one at the same time for me.",
            "title_similarity": "0.5319519",
            "sentiment_compound": 0.743
        },
        {
            "id": "gw6iuf4",
            "score": 3,
            "text": "I tried once..was told i was too old for insurance ir any governmemt aid to help and if i REALLY wanted it would be 1k plus per dose.\n\nThat's WAY too pricey for me sadly",
            "title_similarity": "0.5198029",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gw6jpl3",
            "score": 2,
            "text": "Just wanna say that I got the vaccine when I was in high school. I was horrified to find out a few months ago I contracted it anyways. I’ve read statistics that say it’s 90% effective or it doesn’t cover all the different strains. But it should cover the worst ones like the strain that causes cancer in women. It’s definitely worth to get but I was so confused and upset when I found out it didn’t really help me...",
            "title_similarity": "0.7372703",
            "sentiment_compound": -0.8883
        },
        {
            "id": "gw6jwwq",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.10487377"
        },
        {
            "id": "gw6k8j1",
            "score": 3,
            "text": "I remember getting the first does free back in college but never went back for the second cause I was lazy. Does it matter if I never got the second dose?",
            "title_similarity": "0.3341924",
            "sentiment_compound": -0.2382
        },
        {
            "id": "gw6kndk",
            "score": 1,
            "text": "Like 95% sure I had one of these but I need another and totally forgot... big shout out whoever posted this the reminder is much appreciated",
            "title_similarity": "0.43838805",
            "sentiment_compound": 0.7814
        },
        {
            "id": "gw6ktai",
            "score": 1,
            "text": "Just FYI, there are 2 types of oropharyngeal cancer - HPV-positive and negative. The positive one is caused by HPV and comprises about 70% of oropharyngeal cancers  The negative one is caused by alcohol/ smoking etc and comprises the remaining cases.\n\nMost of the studies done related to HPV vaccines being efficacious against oropharyngeal cancer came about in the 2010s (most I see are from 2011-2016). That's still fairly recent. Hopefully more awareness will be raised about this and HPV vaccines will be available readily to all.",
            "title_similarity": "0.8119861",
            "sentiment_compound": -0.8544
        },
        {
            "id": "gw6kvu8",
            "score": 1,
            "text": "I had to pay out of pocket (very, very expensive) as my insurance wouldn’t cover it for men.",
            "title_similarity": "0.3558107",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gw6lck3",
            "score": 1,
            "text": "So youre telling me a vaccine could prevent me from getting this std and cancer..... Looks like I get my wish of dying fulfilled...",
            "title_similarity": "0.5021384",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw6lhc2",
            "score": 1,
            "text": "I tried to get it and they wouldn't let me because I was too old and probably infected already. Sheeesh....you don't know anything about my sex life.....",
            "title_similarity": "0.39814746",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gw6li0w",
            "score": 1,
            "text": "Women get this vaccine for free in Germany while I would need to pay for it :(",
            "title_similarity": "0.38909757",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6lq72",
            "score": 1,
            "text": "I hate it when conditional statistics are reported flipped around from the general concern. \n\nLike what percent of cancer is oropharyngeal cancer anyway? What color is its ribbon?",
            "title_similarity": "0.50217664",
            "sentiment_compound": -0.9074
        },
        {
            "id": "gw6m587",
            "score": 1,
            "text": "So, the thing is I know 84% of men aged 18 to 21 in the U.S. don’t have a religious objection to the vaccine, so the only other explanation I can think of for these statistics is they don’t know there is a vaccine. And if that is the case, my question is why don’t they know?",
            "title_similarity": "0.7248955",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6mech",
            "score": 3,
            "text": "When this came out, it was only marketed for cervical cancer and for men, it was to prevent them passing hpv to women.  This is the first I've heard about hpv having a significant impact in men.",
            "title_similarity": "0.7081323",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gw6mejf",
            "score": 1,
            "text": "This is a bit misleading. Men get oropharyngeal cancer more than women because they use chronic irritants like cigarettes, chewing tobacco, and high proof alcohol more than women. HPV is a rising cause and as cigarette smoking declined it represents a larger portion of the cancer cases.",
            "title_similarity": "0.7897515",
            "sentiment_compound": -0.9201
        },
        {
            "id": "gw6mn50",
            "score": 1,
            "text": "Can you get the vaccine after 21?",
            "title_similarity": "0.43900415",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6msbn",
            "score": 1,
            "text": "I'm young and I'm going to live forever so not an issue for me",
            "title_similarity": "0.113593295",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6mv9h",
            "score": 1,
            "text": "I didn't even know I could get a cancer vaccine. Do I just ask my doctor about this?",
            "title_similarity": "0.558573",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gw6n22q",
            "score": 1,
            "text": "Had no idea there was a vaccine?  Can you get it in your thirties?",
            "title_similarity": "0.5116973",
            "sentiment_compound": -0.3736
        },
        {
            "id": "gw6n249",
            "score": 3,
            "text": "In my school they did a blanket vaccination drive for girls only. Well over a decade later I am only just realising this? Why is this so badly overlooked?",
            "title_similarity": "0.54526937",
            "sentiment_compound": -0.5617
        },
        {
            "id": "gw6nch2",
            "score": 1,
            "text": "I remember the big push to get girls checked and get a jab, but I thought it was for cervical cancer and whatever disease it was that could cause women to become sterile. I had no idea men where at risk & it was available for them too. Why no big push for this too, or was there?",
            "title_similarity": "0.58193684",
            "sentiment_compound": -0.9366
        },
        {
            "id": "gw6njt1",
            "score": 1,
            "text": "It’s so dumb that they only marketed this vaccine to young women. Since who are those women going to get HPV from? If they were worried about cervical cancer they still should’ve been vaccinating everyone.",
            "title_similarity": "0.5802581",
            "sentiment_compound": -0.8805
        },
        {
            "id": "gw6nxes",
            "score": 1,
            "text": "Hmm wonder what the world would be saying if there was a vaccine for cancer for both men and women but it was only given to men and just 16% of women had been vaccinated?\n\n&#x200B;\n\nI recon it would be all over social media with men being called scum.",
            "title_similarity": "0.83228016",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gw6nxkv",
            "score": 1,
            "text": "I inquired in to this when I was in my late 20’s and was told I’m too old to get the vaccine. Is that still true? 32 now.",
            "title_similarity": "0.60950303",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gw6o1g3",
            "score": 1,
            "text": "The US gov't (and by private insurance) refuses to provide me a free/subsidized HPV vaccine. I was like 8 months \"too old\" when they updated their recommendation of vaccinating all people of both sexes under the age of 26 or 27 or whatever. Now they've updated it to like \"it's suggested\" for all those <40 or <45, but my insurance won't cover it. I can't find the best Gardisil vaccine for less than like \\~$250-400 per dose or something.\n\nAnyone have any luck getting it from Planned Parenthood or something? I've read that even just 1/3 or 2/3 out of the normal 3 doses likely provides decent protection.",
            "title_similarity": "0.6915265",
            "sentiment_compound": 0.5832
        },
        {
            "id": "gw6o51g",
            "score": 1,
            "text": "When this first became available I called the health department about getting it my daughter and sons in small town ignorant Iowa. They gave my daughter the vaccine but tried to tell me that boys didn’t get it, just girls. I argued with them and had to pull out the literature that said it is recommended for females and males. They finally gave in and my sons got the vaccine too.",
            "title_similarity": "0.57756877",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gw6o8sz",
            "score": 1,
            "text": "I’ve asked every couple of years as I have aged through my thirties, my insurance still won’t cover it for men and I can’t justify shelling out the full course out of pocket.",
            "title_similarity": "0.4998784",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6ofje",
            "score": 16,
            "text": "This cancer is not fun. I was diagnosed in my mid fifties. I enrolled in a study and received less radiation and no chemo. They sliced me from my left ear to mid-throat. Removed 37 lymph nodes, my left tonsil, and 1/2 inch (1cm) off the back of my tongue. Then came daily radiation for 5 days a week for \\~10 weeks. That wasn't bad at first but by the latter weeks, I was miserable.  I couldn't eat, the pain was the worst sore throat ever, I threw up randomly for no reason whatsoever. I lost 80lbs rapidly. I had to inject protein drinks through a feeding tube directly in my stomach. Just to have it come back up 1/2 hour later. I had no energy. By the last two weeks I finally had to take time of work because I was exhausted and sick all the time. When the radiation treatments were completed, I looked like a hospice patient. It took a month for my appetite to come back and lose the feeding tube. Long term effects aren't many except the radiation destroyed my saliva glands and my thyroid.   \n\n\nGet the shot! Get it as soon as you can.",
            "title_similarity": "0.64441264",
            "sentiment_compound": -0.9856
        },
        {
            "id": "gw6oi94",
            "score": 1,
            "text": "My doctor recommended the shot to me in highschool and I got it. All I remember was that was one of the most painful shots I've ever had. That needle must've been thick",
            "title_similarity": "0.60549426",
            "sentiment_compound": -0.3384
        },
        {
            "id": "gw6osrl",
            "score": 1,
            "text": "I’m vaccinated for HPV, but I was told that infection would only be an inconvenience for me.",
            "title_similarity": "0.39285994",
            "sentiment_compound": -0.5023
        },
        {
            "id": "gw6ox8h",
            "score": 1,
            "text": "Not trolling, genuine question—do men get this from going down on women? I remember that being a thing with the Michael Douglass throat cancer stuff back in the day but wasn’t sure if there was any truth to it.",
            "title_similarity": "0.5523365",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gw6oyso",
            "score": 2,
            "text": "I have a funny story about this. When I was growing up around 16 I remember my 2 year younger than me sister got the Gardasil vaccine and I remember thinking it would make sense for boys to get it too. 11 years later while in pharmacy school at the age of 27 we learned the clinical guidelines opened up to men 26 years and younger (this was about 4 years ago), and I remember being disappointed that I missed the cutoff but then asking my teacher why shouldn’t it be expanded to just all people under the age of 40? I had studied cancer in graduate school (prior to Pharm school) and knew about these oropharyngeal cancers. Well lo and behold as of 2 weeks ago I was able to write myself a prescription for Gardasil and had another pharmacist immunize me. :)",
            "title_similarity": "0.72916186",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gw6p02l",
            "score": 1,
            "text": "I seem to specifically recall my doctor telling me there was absolutely no reason for me to ever get to the HPV vaccine..  male here",
            "title_similarity": "0.4634264",
            "sentiment_compound": -0.3597
        },
        {
            "id": "gw6p375",
            "score": 1,
            "text": "Glad I got the HPV vaccine when I was younger.",
            "title_similarity": "0.50016844",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gw6pg11",
            "score": 1,
            "text": "I thought this vaccine was required? I got this when I was younger and just assumed everyone got it.",
            "title_similarity": "0.42656267",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6pp2l",
            "score": 1,
            "text": "I was told I was too old for it once as was my wife for the HPV vaccine, I think we were both in our late 20's at the time.",
            "title_similarity": "0.6486494",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6pqb3",
            "score": 1,
            "text": "I believe the reason for this is the stigma associated with STI’s by religious parents. I got the vaccine when I was 18 and my mom asked why I did it, and if I feel ashamed. I said it’s just prevention, but she alluded to it being “a dirty person disease.” I felt weird trying to justify it, but thank god I got it because my current partner got diagnosed with HPV a few days after we started dating.",
            "title_similarity": "0.5999954",
            "sentiment_compound": -0.2617
        },
        {
            "id": "gw6proo",
            "score": 1,
            "text": "Sry for my ignorance. Is this something you can get by going down on a women if she has hpv? I know hpv can be asymptomatic.",
            "title_similarity": "0.40773028",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gw6q2fs",
            "score": 1,
            "text": "I heard it's too late after you're 26 or something?",
            "title_similarity": "0.3111546",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6q58w",
            "score": 1,
            "text": "This isn't true in Canada (Quebec at least), all the kids are vaccinated in school in 4th grade. Boys too.",
            "title_similarity": "0.55547017",
            "sentiment_compound": -0.3252
        },
        {
            "id": "gw6qac6",
            "score": 1,
            "text": "I was never offered a vaccine for HPV when I was in the age range that's eligible for it. Later in life I had a gf with HPV and that Vax would have come in very handy...",
            "title_similarity": "0.5169784",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6qj2o",
            "score": 1,
            "text": "Should I ask my GP about HPV vaccine as an adult man?",
            "title_similarity": "0.5639347",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6qr2e",
            "score": 1,
            "text": "I had to get all of my vaccine all over again for college after my documentation was destroyed in Rita/Katrina (I forget which hurricane). Even the states records were destroyed. Insurance covered all of them but wouldn’t cover HPV even though I wanted it. It would’ve cost me almost $500. This makes me want to try to get it again with different insurance. But maybe that’s the damn issue. Not many people are going to fork over $500 for a non mandatory vaccine.",
            "title_similarity": "0.6047355",
            "sentiment_compound": -0.743
        },
        {
            "id": "gw6qref",
            "score": 1,
            "text": "im 30 with a sexual history, am i even able to get this vaccine, i known nothing bout it",
            "title_similarity": "0.5292181",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6qyqk",
            "score": 1,
            "text": "I cleared hpv 5-6 years ago, only having 2 or 3 tiny warts over the course of a year and a half. The minute that vaccine was offered to me I jumped at it. Why more people don’t want genital warts and cancer is beyond me.",
            "title_similarity": "0.73402554",
            "sentiment_compound": -0.5325
        },
        {
            "id": "gw6r71j",
            "score": 6,
            "text": "Most insurances are yet to cover the vaccine for men. According to my healthcare provider, that could change soon.",
            "title_similarity": "0.6294937",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6rc88",
            "score": 1,
            "text": "Oh my GOD all the misinformation is so frustrating I have no idea what to believe. Couple years ago I found out I had HPV, wanted to know if I should tell my sexual partners. 3 different gynecologists told me I don't have to tell my male partners because there's no way to test for HPV in men (can't pap a penis!) and it's unlikely to develop into cancer. \n\nGUESS NOT??",
            "title_similarity": "0.59907293",
            "sentiment_compound": -0.9024
        },
        {
            "id": "gw6rkhk",
            "score": 1,
            "text": "Is this the same HPV that causes warts?",
            "title_similarity": "0.47388875",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6rr0f",
            "score": 1,
            "text": "It was required to get it before signing up for classes at my college...",
            "title_similarity": "0.18492976",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6rufe",
            "score": 1,
            "text": "It's a $600+ round of immunization in Canada. Of course few people have had it.",
            "title_similarity": "0.58603656",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6rysi",
            "score": 1,
            "text": "I got mine last year at age 40. First shot I got thru my doctor and subsequent ones via local pharmacy.",
            "title_similarity": "0.56318927",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6ryym",
            "score": 1,
            "text": "I’m getting it next month, was gonna get it this month but had plans and didn’t want to have side effects right now",
            "title_similarity": "0.321617",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gw6s4l4",
            "score": 1,
            "text": "I didn't know this vaccine existed for men. I was never made aware of this. I remember in year 7 all the girls went for HPV vaccines but not a single one of the boys did",
            "title_similarity": "0.58500195",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6s89t",
            "score": 1,
            "text": "Pro tip: join the military and they will give you every vaccine",
            "title_similarity": "0.5068407",
            "sentiment_compound": 0.296
        },
        {
            "id": "gw6sodx",
            "score": 1,
            "text": "I remember getting one back in the day! Girls aren't kidding, it hurts like hell.",
            "title_similarity": "0.25122842",
            "sentiment_compound": -0.281
        },
        {
            "id": "gw6sx6h",
            "score": 1,
            "text": "I worked at a place that specifically gave shots when the HPV vaccine came out.  Then, VIS form (vaccine information form for patients) stated it was only recommended for certain age groups for women/girls.  \n\nThat said, a mom called in for her gay or bi son, who was 17 and she asked if he could get it.  We had to check if there were any counter indications for boys to receive it, and as far as we found (at that time) there were none, so we did.  I was always impressed with that mom, not only did she accept him, she was actively looking out for him.\n\nI haven't looked at that VIS form since I quit that job, but my daughter is getting to be about that age.  I'll be curious to see what the recommendations are for the US by then.",
            "title_similarity": "0.6379385",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gw6sy5m",
            "score": 1,
            "text": "I got it as a teen and still really have no idea why",
            "title_similarity": "0.10043487",
            "sentiment_compound": -0.3566
        },
        {
            "id": "gw6t0rn",
            "score": 1,
            "text": "The commercials always just say for girls. Not even women iirc.",
            "title_similarity": "0.32220763",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6t6vz",
            "score": 1,
            "text": "My dad was diagnosed with cancer 3 years ago caused by HPV and has been fighting it ever since. If you haven't gotten the vaccine, please talk to your doctor, you may still be able to get it even if you are no longer a teen.",
            "title_similarity": "0.7473104",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gw6t7kb",
            "score": 1,
            "text": "I dont believe the guys saying they didnt know the vaccine existed/ they werent informed they probably just didnt listen or think they needed it.",
            "title_similarity": "0.37456512",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6t83a",
            "score": 1,
            "text": "I am pretty sure it is more about making a fortune for Merck. They convince the fda to approve it for as many as possible to make a bigger profit",
            "title_similarity": "0.573172",
            "sentiment_compound": 0.8555
        },
        {
            "id": "gw6tcfd",
            "score": 1,
            "text": "I begged my doctor for the HPV vaccine a decade ago and was told I didn't qualify because I was sexually active, too old, and there wasn't enough testing on men.",
            "title_similarity": "0.63669896",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw6tee9",
            "score": 1,
            "text": "In Scotland we started offering it to high school boys in the last couple of years and I got vaccinated as an adult because sexual health clinics started offering them.",
            "title_similarity": "0.6220984",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6tftk",
            "score": 3,
            "text": "sad part is. men will have no idea there is a vaccine and no one will care about men passed the age of 25. when i was learning more about std phrase. i tried to find if men should take it in my 30s. lot of article about how teenager girls and boys should take it. and women of all age should take it. but men?? no mention of it at all",
            "title_similarity": "0.646216",
            "sentiment_compound": -0.6497
        },
        {
            "id": "gw6tieg",
            "score": 1,
            "text": "One of the first shots I got when I was fresh out of basic training and AIT and immediately sent to South Korea for 1 year tour! It was 3 rounds of shots of a short period of time, I haven’t thought about it since then but I was 19 at the time!",
            "title_similarity": "0.49345398",
            "sentiment_compound": 0.3036
        },
        {
            "id": "gw6tou0",
            "score": 2,
            "text": "As a vaccine if you already have it, it grants no benefit? Or does it stop spreading to other parts of the body as it sometimes does?",
            "title_similarity": "0.42816696",
            "sentiment_compound": -0.4836
        },
        {
            "id": "gw6tqxm",
            "score": 1,
            "text": "Had no idea that there was an HPV vaccine until just recently. Being I'm almost 30 I might be too old to even get it now 😔",
            "title_similarity": "0.558617",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gw6tuji",
            "score": 1,
            "text": "So are men getting cancer from the mouth from going down on girls? Serious question",
            "title_similarity": "0.6325238",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gw6tvqv",
            "score": 1,
            "text": "So how soon after the covid vaccine can I book the hpv vaccine?",
            "title_similarity": "0.47869462",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6tz1d",
            "score": 1,
            "text": "Ive only really heard about the HPV vaccine being given to people starting at maybe 14-16 years old. I assume this is to coincide with the expected onset of sexual activity. But is there a medical reason why the vaccine couldn’t be given much earlier than that?  Does it not last for a long enough time to make that worthwhile, or are there other concerns for younger recipients?  Maybe just hasn’t been tested in younger populations? \n\nSeems like we could dramatically reduce the number of several types of cancer with high mortality by giving it to more people. And associating it with the age of onset of sexual activity, and the associated variability of cultural norms of that age and behavior, makes me think that choosing a different age to give the vaccine would make a lot of sense.",
            "title_similarity": "0.72817236",
            "sentiment_compound": 0.5171
        },
        {
            "id": "gw6u5zo",
            "score": 1,
            "text": "Gardasil is an evil shot which caused many issues for young women including death.  It was promoted to young boys and men after women stopped getting it.",
            "title_similarity": "0.51861507",
            "sentiment_compound": -0.8126
        },
        {
            "id": "gw6ubnt",
            "score": 1,
            "text": "I've had mine since the earliest I could have it. I did not know only 16% in that age range have had a dose. Crazy.",
            "title_similarity": "0.45196545",
            "sentiment_compound": -0.34
        },
        {
            "id": "gw6unaj",
            "score": 1,
            "text": "Does the vaccine work post genome insertion? So, if someone gets one of the nine strains and the virus goes dormant due to it incorporating its genetic material into the host’s genome, then they get the shot. Will the immune response work if the virus re-emerges and prevent the formation of warts? I would not expect it to clear cells containing the dormant virus but would it prevent you from spreading it to a partner, for instance.",
            "title_similarity": "0.53870344",
            "sentiment_compound": 0.3313
        },
        {
            "id": "gw6uoek",
            "score": 2,
            "text": "How is this the first I’ve heard about this? For years I’ve heard about how woman need to get this vaccine to protect them from cancer but not once have I heard about it protecting men from cancer. Hell I didn’t even know they had a vaccine for men.",
            "title_similarity": "0.68187296",
            "sentiment_compound": -0.9468
        },
        {
            "id": "gw6uy7s",
            "score": 1,
            "text": "They never tell you that part about guys getting cancer for going down",
            "title_similarity": "0.5127486",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gw6v03f",
            "score": 1,
            "text": "I don’t know if I have it. How do I find out? Is it dangerous if I accidentally get it twice?",
            "title_similarity": "0.1161429",
            "sentiment_compound": -0.7059
        },
        {
            "id": "gw6v569",
            "score": 1,
            "text": "Not surprisingly since every time I’ve seen the vaccine brought up it’s marketed to women only. Cervical cancer is all that’s talked about in regards to HPV. Hell when I asked to get the vaccine to prevent possibly catching and spreading HPV I was told by a doctor it’s only for women and really just young women. Why would I get it, I don’t have a cervices? I explained I want to not have the risk of catching and spreading it. He told me how it was pointless but still have it to me. I have never heard about it causing cancer in men. Hell when I looked up HPV everything was about how it caused cervical cancer.",
            "title_similarity": "0.6344823",
            "sentiment_compound": -0.9797
        },
        {
            "id": "gw6vaqf",
            "score": 1,
            "text": "So I should be screened for this?",
            "title_similarity": "-0.13242751",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6vayq",
            "score": 1,
            "text": "You can blame most parents for this one \n\n\"My kids aren't having sex until they are married, why should get get a vaccine that can prevent STD's\"",
            "title_similarity": "0.6283959",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gw6vrrl",
            "score": 1,
            "text": "That vaccine hurt like a motherfucker",
            "title_similarity": "0.3661031",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gw6vtoo",
            "score": 1,
            "text": "We have a family friend that is a doctor and I believe 2 years ago now he got cancer from HPV. This resulted in him having to get parts of his voice box out and now he can no longer talk and has to use a device. It's actually imperative to get the vaccine, at least if you want to keep the ability to speak.",
            "title_similarity": "0.6895391",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gw6vtq2",
            "score": 1,
            "text": "maybe their lil gardasil commercials shouldn't have had only teenaged white girls in them",
            "title_similarity": "0.3714037",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6vyy7",
            "score": 1,
            "text": "I asked about it ten years ago, my insurance wouldn't cover it and my doctor chuckled at the idea of me getting it.",
            "title_similarity": "0.56952304",
            "sentiment_compound": 0.296
        },
        {
            "id": "gw6w6lv",
            "score": 3,
            "text": "Legit didn’t know men could get this vaccine. Think I might sign up. I’m kind of on a vaccine kick lately.",
            "title_similarity": "0.57316136",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6wa0i",
            "score": 2,
            "text": "This may be a stupid question but could it be that because most woman have had this vaccine that is why 80% of those now diagnosed are men? I think everyone should be vaccinated but just trying to think about those figures",
            "title_similarity": "0.78996986",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw6wflu",
            "score": 1,
            "text": "When I was a teenager, my mom made me get this (I'm a guy) at the same time that my sisters got it. I didn't know any other guys getting it... I guess she was way ahead of the curve.",
            "title_similarity": "0.47891358",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6wgnb",
            "score": 1,
            "text": "I am 29 and got the first dose a month ago. Also got the Pneumonia vaccine which I never had as a kid. It's weird why these things aren't more prominently told to people.",
            "title_similarity": "0.6412084",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gw6wgqv",
            "score": 1,
            "text": "Can people between 30 and 35 still get the vaccine?",
            "title_similarity": "0.5727019",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6wmmn",
            "score": 1,
            "text": "I received the HPV vaccine in February... Of 2020 right as COVID was hitting hard so I was never able to get the second dose of it unfortunately. I'll probably have to take both again when things die down.",
            "title_similarity": "0.56731504",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gw6wns0",
            "score": 1,
            "text": "If you have ever had any common wart then you have HPV.",
            "title_similarity": "0.5316548",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6wvi4",
            "score": 1,
            "text": "At school they gave it to all the girls but to none of the men. I've never had it.",
            "title_similarity": "0.36147922",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6x09r",
            "score": 1,
            "text": "The vaccine is free for everyone apart from heterosexual men in the UK, for whom it costs £300...",
            "title_similarity": "0.63578737",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gw6x0gx",
            "score": 1,
            "text": " HPV Throat Cancer survivor here (M56). If you are biologically male and you get a swollen lymph gland on your neck, demand a biopsy. My GP (an older guy) thought it was just an infection...took 4+ months to think otherwise. When I finally got into treatment, my radiation doc said that misdiagnosis is common.",
            "title_similarity": "0.7155429",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gw6x9vm",
            "score": 1,
            "text": "When the HPV vaccine came out I was like 14-16 y/o (female). It was series of 3 shots at $400 a pop and insurance didn't cover it since it was \"elective.\" Needless to say, my parent's passed on them. We just didn't have that kind of money. Luckily, I wasn't promiscuous when I was a teenager, I know too many ladies my age who have had HPV diagnoses.",
            "title_similarity": "0.6993046",
            "sentiment_compound": 0.7203
        },
        {
            "id": "gw6xb6t",
            "score": 1,
            "text": "I asked the nurse if I needed this and they said no, what gives?",
            "title_similarity": "0.14688864",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6xc9b",
            "score": 1,
            "text": "The other interpretation of this is ~20% of women are sleeping with women assuming oral sex is the primary mode of transmission.\n\nSimilarly, that 20% of women could be getting it from infected male partners, but I would expect a more balanced distribution between the genders if that were the case...",
            "title_similarity": "0.6999609",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gw6xe0r",
            "score": 1,
            "text": "Can anyone answer why I’m not eligible at 38 and whether for not it would even benefit me? I’m in a committed relationship and not going anywhere but it is never offered to me and I wonder if it would be good to get.",
            "title_similarity": "0.3036387",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gw6xkqb",
            "score": 1,
            "text": "If you stick to same partner is your risk as high generally",
            "title_similarity": "0.2373547",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gw6xmzf",
            "score": 1,
            "text": "Bro I thought everyone got it",
            "title_similarity": "0.04857909",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6y1xp",
            "score": 1,
            "text": "i want to say i just got HPV vaccine as a 37 year old. they left the age restriction on the vaccine so you can get it now.",
            "title_similarity": "0.6113281",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gw6y7zy",
            "score": 1,
            "text": "I'm a med student. We suggest HPV vaccine for both boys and girls at a certain age and without fail, many parents will say, oh my kids don't have sex so they don't need this. Yes that may be true now, but they will one day and we want to protect them for whatever they want to do as an adult.",
            "title_similarity": "0.571226",
            "sentiment_compound": 0.867
        },
        {
            "id": "gw6yd9q",
            "score": 1,
            "text": "Interesting. It looks like they’re going to start vaccineting boys here starting from 2022. Nothing about adults… I’m gonna mail our local “CDC”, curious why not.",
            "title_similarity": "0.5330831",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gw6yjff",
            "score": 1,
            "text": "It costs $200 per shot for that vaccine here in Ontario and you need 3 shots. That's expensive.",
            "title_similarity": "0.63256216",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6yoxz",
            "score": 1,
            "text": "I didn’t know it was so prevelent",
            "title_similarity": "-0.005773809",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6yt3n",
            "score": 1,
            "text": "Can you get it at 37? Or tested if you have HPV but don't know?",
            "title_similarity": "0.42444414",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6yxkn",
            "score": 1,
            "text": "Is the vaccine helpful if you possibly have it already?",
            "title_similarity": "0.33662668",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gw6yzm6",
            "score": 1,
            "text": "There's a vaccine for HPV?",
            "title_similarity": "0.43609256",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6z0bn",
            "score": 1,
            "text": "Are they saying men get it more just because the rate of vaccination is higher amongst women?",
            "title_similarity": "0.57135403",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6z1wu",
            "score": 1,
            "text": "Can you catch it without cunilungus?",
            "title_similarity": "0.14280117",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6z3fz",
            "score": 1,
            "text": "I got all of my kids vaxxed. Two boys and a girl. There is no good reason not to take full advantage of modern vaccines. Vaccines are one of the greatest accomplishments of mankind, as far as I’m concerned.",
            "title_similarity": "0.6167902",
            "sentiment_compound": 0.5851
        },
        {
            "id": "gw6z3kf",
            "score": 1,
            "text": "When i was a kid they wouldnt let boys get it. \n\nNow lots of my generation has HPV.\n\nThanks Republicans.",
            "title_similarity": "0.61378425",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw6z58g",
            "score": 1,
            "text": "It seems almost criminal that the vaccine isn't required",
            "title_similarity": "0.25011376",
            "sentiment_compound": -0.4779
        },
        {
            "id": "gw6z6sq",
            "score": 1,
            "text": "**HOW** the VIRUS \"gets\" **there**...? that's the MILLION DOLLAR question...(Michael Douglas knows...)",
            "title_similarity": "0.4617095",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6zcge",
            "score": 1,
            "text": "A loved one of mine, 48 male, has just been diagnosed with this cancer, hpv caused. 6 weeks of chemo and radiation. Doctor said its been growing for a long time slowly and only has it shown up because his lymph nodes started to swell. If it wasn't for the nodes swelling, how else could someone know they had this without going through intensive scans and tests. Son is going to get this vaccine today.",
            "title_similarity": "0.7789577",
            "sentiment_compound": -0.1655
        },
        {
            "id": "gw6zcr3",
            "score": 1,
            "text": "Man really could’ve done with that vaccine 2 years ago ...",
            "title_similarity": "0.57600605",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6zpwn",
            "score": 1,
            "text": "I actually got offered it a month ago but turned it down because I was afraid I'd miss out on a covid-19 vaccine since you can't have another vaccine within two weeks of the covid-19 one.",
            "title_similarity": "0.57695425",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gw6zrr3",
            "score": 1,
            "text": "If you are older than 21 years you need to make an appointment with your doctor and ask them about the efficacy of the vaccine for an older adult.",
            "title_similarity": "0.56378",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw6ztz6",
            "score": 3,
            "text": "done a masters in oncology and was never taught of the relationship between that HPV and orthopharyngeal cancer, that's ridiculous considering they stressed the importance of HPV on cervical cancer.",
            "title_similarity": "0.5873419",
            "sentiment_compound": -0.9042
        },
        {
            "id": "gw6zu3i",
            "score": 1,
            "text": "Head and neck cancer is no joke.  My oncologist said it was \"treatable and curable\", but the treatment was brutal.",
            "title_similarity": "0.57388073",
            "sentiment_compound": -0.8688
        },
        {
            "id": "gw6zumg",
            "score": 1,
            "text": "Some of us already have HPV and cannot get the vaccine. I wish there was a cure. Nobody should have to die of cancer.",
            "title_similarity": "0.58666193",
            "sentiment_compound": -0.765
        },
        {
            "id": "gw701em",
            "score": 2,
            "text": "I didn’t know it could cause cancer in men too. My husband and I are a few years too old to have been offered it. The ok have changed how they do cervical smear tests and now just look for the presence of HPV. Mine came back negative. Does that mean he won’t have it either? (Please make the assumptions: we have sex, we only have sex with each other)",
            "title_similarity": "0.70541054",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gw705u3",
            "score": 1,
            "text": "There was alot of mixed messaging on the HPV vaccine. I don't know what to believe",
            "title_similarity": "0.4608551",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw70ati",
            "score": 4,
            "text": "Got my third shot yesterday, reading this makes me very happy about my decision",
            "title_similarity": "0.3952255",
            "sentiment_compound": 0.6115
        },
        {
            "id": "gw70xxp",
            "score": 3,
            "text": "I tried to get the vaccine a decade ago and they said they wouldn't cover it because I'm a guy. Seems kinda stupid if it's killing men too.",
            "title_similarity": "0.64144707",
            "sentiment_compound": -0.818
        },
        {
            "id": "gw70yka",
            "score": 1,
            "text": "Huh, had no idea this wasn't a more widely known thing. I had the gardisil shots when I was a teenager. Went right down to the walk-in health clinic and had them done.",
            "title_similarity": "0.4967901",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw70zhs",
            "score": 1,
            "text": "It's basically too late once you got hpv though too right? I thought men couldn't get tested for it anyways",
            "title_similarity": "0.4606549",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw71fmj",
            "score": 1,
            "text": "I asked for the shot because of this cancer risk back in 2009. American health insurance sucks.Insurance only just started covering this on my plan.",
            "title_similarity": "0.6065537",
            "sentiment_compound": -0.81
        },
        {
            "id": "gw71v98",
            "score": 1,
            "text": "There is an HPV vaccine???",
            "title_similarity": "0.41407928",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw71wik",
            "score": 5,
            "text": "So are they getting it from oral sex?",
            "title_similarity": "0.20832351",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw728qu",
            "score": 1,
            "text": "My wife and I got the HPV at the age of 44, it may not provide us full protection but its worth it.",
            "title_similarity": "0.53538555",
            "sentiment_compound": 0.3291
        },
        {
            "id": "gw72sy2",
            "score": 6,
            "text": "Thanks, you got me to check with my insurance again. It was almost $2k when I tried to get it two years ago. Now it’s free!",
            "title_similarity": "0.49950674",
            "sentiment_compound": 0.7574
        },
        {
            "id": "gw72tof",
            "score": 1,
            "text": "Too bad straight men in the UK aren't eligible\n\nhttps://www.nhs.uk/conditions/vaccinations/who-should-have-hpv-cervical-cancer-cervarix-gardasil-vaccine/",
            "title_similarity": "0.56108797",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gw739o7",
            "score": 1,
            "text": "I'll be getting it even when the doctor said it wasn't really needed because chances of having symptoms are low. And it's expensive, but if he had said it covers multiple strains I would have said yes then and there.\n\nSure I'll be paying 150€ out of pocket since it's not covered here unless you are under 18. But just knowing that it's another std I don't have to worry about pays that back by itself in energy.",
            "title_similarity": "0.5600421",
            "sentiment_compound": 0.857
        },
        {
            "id": "gw73gfn",
            "score": 1,
            "text": "I only got one shot but it was about $250 out-of-pocket for me so I never got the second one. I read even one shot has some protection but obviously not as great. Is it too late for the second one if it’s been a couple years since the first? Do I have to do two more shots?",
            "title_similarity": "0.5618535",
            "sentiment_compound": -0.7004
        },
        {
            "id": "gw73mtx",
            "score": 1,
            "text": "HPV vaccine is required at my college, male or female",
            "title_similarity": "0.5162224",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw73t3j",
            "score": 1,
            "text": "So do I get tested for it first? Or just get the vaccine?",
            "title_similarity": "0.3433906",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7428a",
            "score": 1,
            "text": "I mean, there is probably a relationship here not quite captured by \"however.\" Something about lower vaccinations corresponding to higher incidence.",
            "title_similarity": "0.3311373",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw7469k",
            "score": 1,
            "text": "I didn’t even know men could get it. Damn.",
            "title_similarity": "0.17103216",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gw748fo",
            "score": 1,
            "text": "Yeah. HPV vaccine is included in the common vaccination program in Sweden for boys, [it started autumn last year](https://www.translatetheweb.com/?ref=TVert&from=&to=en&a=http%3A%2F%2Fwww.folkhalsomyndigheten.se%2Fsmittskydd-beredskap%2Fvaccinationer%2Fvaccinationsprogram%2Futredningar-om-nationella-vaccinationsprogram%2Fvaccination-av-pojkar-mot-hpv%2F)",
            "title_similarity": "0.59571135",
            "sentiment_compound": 0.296
        },
        {
            "id": "gw74ob7",
            "score": 1,
            "text": "Do you need to get the vaccine by a certain age, or can you get it any time after a certain age?",
            "title_similarity": "0.4334685",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gw751w7",
            "score": 1,
            "text": "My mom tried getting my pediatrician to give it to me when my sister got the vaccine. I’ve tried on multiple occasions to get it. Even tried going through my local health department. All of which said my age is not eligible so it’s not covered by insurance so I’d be looking at like $800 a shot for 2 or 3 shots (out of pocket). Early 20s I couldn’t afford that. Now I’m 30 and can afford it but haven’t considered it in sometime. Thanks for the reminder I need to try again.",
            "title_similarity": "0.6137105",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gw75aw6",
            "score": 1,
            "text": "One note about this is that my parents were going to get me this vaccine when I was a teenager but it turned out that it would be prohibitively expensive at the time.",
            "title_similarity": "0.5603685",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw75dqc",
            "score": 1,
            "text": "Growing up we didn't have an HPV Vaccine and now it's not recommended for my age range",
            "title_similarity": "0.37155122",
            "sentiment_compound": 0.0279
        },
        {
            "id": "gw75tj5",
            "score": 1,
            "text": "My elderly mom was diagnosed with nasopharyngeal cancer 2 years ago. She got it from having hpv. After having her cheekbone, base of her eye and half of her mouth removed, followed by radiation and chemotherapy, she is cancer free. Get vaccinated.",
            "title_similarity": "0.6666533",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gw760m0",
            "score": 3,
            "text": "If you are Male and over 21, you can still get the HPV vaccine! I'm 30 and got it since I never did as a teenager, thinking like many here that it was only for girls. Go get it!! It'll take 3 doses but it's so worth it, especially if you are sexually active.",
            "title_similarity": "0.6704829",
            "sentiment_compound": 0.856
        },
        {
            "id": "gw76553",
            "score": 1,
            "text": "even if men were 0 affected by HPV it would make sense vaccinating them so they won't transmit to women",
            "title_similarity": "0.4626723",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gw76675",
            "score": 1,
            "text": "Could never afford it.",
            "title_similarity": "0.020343518",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw76fb5",
            "score": 1,
            "text": "I just got over this cancer, last treatment in december.  Sadly this vaccine came about probably 15 years too late for me, as with HPV cancer, it can sit for 20-30 years until it decides to get all cancer-y.  But it sure as hell is the real deal.",
            "title_similarity": "0.73014736",
            "sentiment_compound": -0.9037
        },
        {
            "id": "gw76wwd",
            "score": 1,
            "text": "I'm truly surprised at the low number of vaccinations. Both my kids received theirs several years ago through Kaiser and we didn't even regard it as an option not to.",
            "title_similarity": "0.5275785",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gw76y38",
            "score": 1,
            "text": "I told a coworker how the rates of cancers linked to HPV dramatic dropped do to that vaccine being mandatory in Australia. All she could say was that cancer is \"just a symptom\". I said it is a result of HPV. She knew better than me though.",
            "title_similarity": "0.6387882",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw76ycg",
            "score": 1,
            "text": "I’m 99 kid and when we got out first shots in grade 6 all the girls got the HPV shot and we didn’t! Frick eh",
            "title_similarity": "0.57042366",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw776wr",
            "score": 1,
            "text": "I read that women over 26 can’t get the vaccine, is that still the case? My friend got it at 25 and her entire torso broke out in hard raised nodules for over 3 years. She didn’t wear a bathing suit the whole time.",
            "title_similarity": "0.6305766",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw77bqh",
            "score": 1,
            "text": "They won’t give anyone over 26 the vaccine.  It’s ridiculous.",
            "title_similarity": "0.38361064",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gw77bx9",
            "score": 1,
            "text": "As far as I know in the UK you get it at school for free. However I just missed out on that by a couple years so didn't get it. At the end of last year I learned about this and naturally I wanted to get it. Turns out you only get it for free if you're under 25. My 25th birthday was a week later and I had just arrived at my mum's for Christmas...\n\nI'm pretty sure it's like £500 or something for me to get it now which, idk I guess £500 is worth it but it's still not cheap...",
            "title_similarity": "0.55164653",
            "sentiment_compound": 0.7543
        },
        {
            "id": "gw77lye",
            "score": 1,
            "text": "So if you are in a magnanimous relationship then this isn't necessary, right?",
            "title_similarity": "0.028343135",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw782ze",
            "score": 1,
            "text": "I don’t know if it was HPV of the Hep vaccine but I got like 4 \n\nMy doctor when she saw my chart was like....whoops",
            "title_similarity": "0.5830291",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gw784wu",
            "score": 1,
            "text": "They also don’t tell us men about it, I’ve only ever seen commercials for women and was even told by my doctor as a gay man I don’t need it because it’s only dangerous for women!",
            "title_similarity": "0.5428945",
            "sentiment_compound": -0.5255
        },
        {
            "id": "gw789mz",
            "score": 1,
            "text": "My mom isn’t anti-vax…. But she has told me repeatedly not to get the HPV vaccine. She was hesitant but got a covid vaccine so her mom would get one.\n\nI love my mom but maybe she’s wrong :(",
            "title_similarity": "0.494937",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gw78bj9",
            "score": 1,
            "text": "Believe me: YOU DO NOT WANT ORAL CANCER. (sorry for shouting)",
            "title_similarity": "0.24987543",
            "sentiment_compound": 0.4577
        },
        {
            "id": "gw78osq",
            "score": 1,
            "text": "It's like diplomatic immunity but for HPV.",
            "title_similarity": "0.30381918",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gw78ovq",
            "score": 1,
            "text": "I went to my GP 2-3 years ago asking for it (late 20s) and they kept saying that I most likely already got the vaccine and that they would call back if my insurance cleared it (they didn’t). I also tried through my college but since I had health insurance they said to try with them. I hate the way our healthcare system is setup and that it’s such a hassle to get preventative care, even though it would save them in the long run. I just ended up paying for it when I went to visit family in Mexico.",
            "title_similarity": "0.54695475",
            "sentiment_compound": 0.5789
        },
        {
            "id": "gw78rp7",
            "score": 1,
            "text": "That’s because (for me at least) it wasn’t free! I was at the doc less than a year ago, he brought up some vaccinations I was due for and offered the hpv for like $200 whist the others were free",
            "title_similarity": "0.64521086",
            "sentiment_compound": 0.8553
        },
        {
            "id": "gw790uh",
            "score": 1,
            "text": "How do men contact HPV?",
            "title_similarity": "0.34321034",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw79fpc",
            "score": 1,
            "text": "I learned this in my late teens and, by my own accord got the HPV vaccine through my doctor. Paid for it myself and everything. They don’t offer it to boys the same way they do for girls in school, at least they didn’t.",
            "title_similarity": "0.6572647",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw79hqg",
            "score": 1,
            "text": "Go to your health department and get the vaccine then. I got mine two years ago with the flu and it was free with my basic ass insurance through my dads job as a manager at Pizza Hut. I think I have all my HPV vaccines and boosters just from getting them going when I went in for the flu shot. Widely available and super easy. Get them",
            "title_similarity": "0.6363002",
            "sentiment_compound": 0.34
        },
        {
            "id": "gw79q2b",
            "score": 1,
            "text": "I recently got my HPV vaccine at the suggestion of my physician.\nI'm a guy and he sold me on getting it.",
            "title_similarity": "0.5905484",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7a8n6",
            "score": 1,
            "text": "I always equate HPV, oral cancer and Michael Douglas. No clue if his cancer was HPV related but my mom made me think that because he was a bit of a ladies man. No idea if there’s truth to any of that",
            "title_similarity": "0.6718872",
            "sentiment_compound": -0.705
        },
        {
            "id": "gw7ab32",
            "score": 1,
            "text": "That vaccine didn't exist when I was a teen. Now I've been married 10 years and don't plan to cheat on my wife so I don't see the need.",
            "title_similarity": "0.54546344",
            "sentiment_compound": 0.357
        },
        {
            "id": "gw7abeg",
            "score": 1,
            "text": "I got the shot to keep my pp from falling off with cancer.",
            "title_similarity": "0.46726525",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gw7abf6",
            "score": 1,
            "text": "If you can get the vaccine, go get it. Head and neck cancers are no joke. I had and internship on a head neck cancer ward. It was so horrible i actually couldn't handle it. If it is discovered early than it has good survival rates. However half of the cases get discovered in late stages with no change of a cure. I have seen a case where a man's face got eaten up by the fast growing cancer (it grew each day), a man that would die a fast and horrible death by choking, facial disfigurement, trachea tubes etc.",
            "title_similarity": "0.7807342",
            "sentiment_compound": -0.9819
        },
        {
            "id": "gw7af5m",
            "score": 1,
            "text": "So I once put on the company COOs birthday card... happy birthday don't forget to vaccinate your child for HPV.  It was considered \"offensive\" and redacted from the card.  I worry for that child now.",
            "title_similarity": "0.5518311",
            "sentiment_compound": -0.1366
        },
        {
            "id": "gw7aggb",
            "score": 1,
            "text": "A cancer vaccine?  Feel like that should be more well known...",
            "title_similarity": "0.51103574",
            "sentiment_compound": -0.1298
        },
        {
            "id": "gw7ak90",
            "score": 1,
            "text": "It's not offered in Netherlands for free. There is 0 incentive or information pointing you to get it.\n\nFailure in policy imo.",
            "title_similarity": "0.16183634",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw7b3qo",
            "score": 1,
            "text": "JFC. \nI found out I have HPV last year...",
            "title_similarity": "0.5064234",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7b793",
            "score": 1,
            "text": "In Australia, they introduced free HPV vaccination for boys in year 10 *the year after I would have been eligible.* But I knew that it was probably important and went to my GP to get it done privately. I had to get three shots and pay for each of them with no subsidy from medicare or any health insurance coverage (which is a big deal here in Aus) and they ended up at $145 a shot. \n\nReading this now, I’m glad that my younger self got myself vaccinated.",
            "title_similarity": "0.68085504",
            "sentiment_compound": 0.6059
        },
        {
            "id": "gw7bdlt",
            "score": 1,
            "text": "It wasn’t a thing when I was a teen. Otherwise I definitely would have gotten it.",
            "title_similarity": "0.25773948",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gw7beg1",
            "score": 1,
            "text": "I........ I had no idea....",
            "title_similarity": "-0.11845216",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw7bh3e",
            "score": 1,
            "text": "The important stat missing here is what % of men get this type of cancer. Is is 50%? 0.0000001%",
            "title_similarity": "0.75544417",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gw7bno3",
            "score": 1,
            "text": "When I was a medical student on rotation on pediatrics, we saw countless parents refuse the HPV vaccine for their sons. Many refuse it for their daughters because it isnt a mandatory vaccine for school, and is so associated with sex that parents shy away from it. But holy crap do I wish people were actually educated properly about HPV and why the vaccine is super important for both girls and boys. You can explain to the parents all you want why it is so important, but by the time they're at the correct age appointment for the dose, the parents have already made up their mind and have decided that their son or daughter doesnt need a vaccine against an \"STD\". It is so sad how sexual education has failed us.",
            "title_similarity": "0.6142105",
            "sentiment_compound": -0.3712
        },
        {
            "id": "gw7bnwr",
            "score": 1,
            "text": "So if you're not sure if you've gotten it already, is it safe to get again?",
            "title_similarity": "0.023340046",
            "sentiment_compound": 0.2354
        },
        {
            "id": "gw7byhe",
            "score": 1,
            "text": "Originally it was only confirmed to work for females.  2 years later it was approved for males. \nAfter my sister died of cervical cancer I asked her oncologist, a specialist focused on cervical/ovarian cancer, if she gave it to her daughters. It had only recently been approved and my girls were quickly approaching eligibility. Her answer was a resounding \"Yes! The day it came available.\" Mine were given the vaccine as soon as they were eligible.",
            "title_similarity": "0.694556",
            "sentiment_compound": -0.5848
        },
        {
            "id": "gw7c048",
            "score": 1,
            "text": "In Many countries it’s still only funded for females",
            "title_similarity": "0.2994159",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7cas9",
            "score": 1,
            "text": "This is the importance of getting your partner tested before any sexual acts",
            "title_similarity": "0.12887889",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw7cfpg",
            "score": 1,
            "text": "I got it when I was told it was it was only for women but I paid for it so even if it didn't cover me I figured it would prevent me from carrying those cancer causing ones for my partners . Guess it Paid off for me too in the end.",
            "title_similarity": "0.43287086",
            "sentiment_compound": -0.7876
        },
        {
            "id": "gw7cj0m",
            "score": 1,
            "text": "It says as long as you get the vaccine before you’re 26. It wasnt even available when I was 26, so does HPV not an issue after, or are we just screwed?",
            "title_similarity": "0.5692208",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gw7cjro",
            "score": 1,
            "text": "Assuming you can’t get the vaccine after you’ve been diagnosed with hpv?",
            "title_similarity": "0.5220854",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7ctng",
            "score": 1,
            "text": "Is there an age limit to get the vaccine ?",
            "title_similarity": "0.43713737",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7culn",
            "score": 1,
            "text": "I had hpv related cancer. Doctor told my husband he was too old for the vaccine...",
            "title_similarity": "0.7218859",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gw7cwfv",
            "score": 1,
            "text": "I've been treated for pre cancer of the cervix this month, caused by HPV. I'm having the vaccine, to help clear the infection.I've been wondering actually if my husband should get vaccinated as well.",
            "title_similarity": "0.70039475",
            "sentiment_compound": 0.25
        },
        {
            "id": "gw7cwgn",
            "score": 1,
            "text": "I got it at 37, my partner (male) at 39. Still worth it after both rectal and cervical precancer. After 16 years of monogamy. Was infected in college pre DNA testing and was told “if it goes away it won’t come back”. Get the vaccine. It’s intense, but waaaay less intense than rectal surgery at age 38.",
            "title_similarity": "0.715093",
            "sentiment_compound": -0.1254
        },
        {
            "id": "gw7d0hb",
            "score": 1,
            "text": "I actually had my first shot of the vaccine a month ago, I'm from Poland and the vaccine is not refunded there, but I moved to Germany and my insurer (Techniker Krankenkasse) reimburses the cost of the vaccine if you're <27 yo.",
            "title_similarity": "0.6000016",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7d6k2",
            "score": 1,
            "text": "How common is oropharyngeal cancer compared to cervical cancer?\n\nI think the issue is medical system determined it wasn’t prevalent or severe enough to justify the cost(not just of the vaccine, but PR campaigns...etc)\n\nI think continuing to push the “protect your wife,GF, woman you care about” is probably more compelling. But there won’t be major progress until it is mandated. I think colleges requiring it like they require the meningitis vaccine would be a huge step forward.",
            "title_similarity": "0.610601",
            "sentiment_compound": 0.9174
        },
        {
            "id": "gw7dqux",
            "score": 1,
            "text": "I received the Guardasil vaccine a decade ago when I was at university. Did all three doses. Still ended up getting HPV. Doctor said that there were now hundreds of newly discovered strains that the vaccine wasn't effective against.",
            "title_similarity": "0.7300084",
            "sentiment_compound": -0.5795
        },
        {
            "id": "gw7dwdl",
            "score": 1,
            "text": "So I have a wart or two on my body which I'm under the assumption is because HPV. Can you still get a vaccine if you have it? I'm a transwoman but I'm sure the statistic would still apply to me as well.",
            "title_similarity": "0.5397237",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gw7dxug",
            "score": 1,
            "text": "What is the percentage of men who get HPV in the first place?",
            "title_similarity": "0.62521183",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7e5vc",
            "score": 1,
            "text": "I had to pay for mine(m42), my insurance refused to even give me a shot. I had to go to planned parenthood and pay,",
            "title_similarity": "0.30430442",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gw7e6no",
            "score": 1,
            "text": "I'm 7 years free of my HPV mediated squamous cell carcinoma tumor on what was left of my right tonsil.  I noticed a lump in my throat and had it checked almost immediately after it was clear it wasn't just a sore throat.  We caught it at stage I.  7 weeks of intense chemo and radiation, but then the tumor was gone.\n\nIt's no joke when you get that phone call and the doc says \"this isn't a conversation I have over the phone\".  \n\nboth my kids have been vaccinated, a boy and a girl, so they're likely never to have to experience what I went through.",
            "title_similarity": "0.70837307",
            "sentiment_compound": -0.4361
        },
        {
            "id": "gw7e8lk",
            "score": 1,
            "text": "I would totally get it, but my doctor says I would have to pay around $1200 out of pocket for it.",
            "title_similarity": "0.5325173",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gw7eavi",
            "score": 1,
            "text": "I remember reading something like this in High School, and asking my teacher why only girls were getting an HPV vaccine. She was like (very rudely): \"You need a cervix to get it, are you a girl?!\" \n\nAll the class laughed at me for asking, and I honestly never thought about it again until seeing this post.  Neat to know I wasn't wrong.",
            "title_similarity": "0.5795461",
            "sentiment_compound": 0.9072
        },
        {
            "id": "gw7ei10",
            "score": 1,
            "text": "The vaccine hurts like hell.",
            "title_similarity": "0.34412175",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gw7exib",
            "score": 4,
            "text": "In my country it is free and available for girls. Boys can't take it for free.\n\nIt sucks when cancer treatment gets gendered",
            "title_similarity": "0.5386791",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gw7f06h",
            "score": 1,
            "text": "My brother died from cancer related to HPV. He probably could’ve beaten it, but he waited way too long to have it checked out because he was afraid they’d tell him he was going to die. Ironic self-fulfilling prophecy. Don’t be stupid like my brother. Get the vaccine! And if you feel something, in his case he felt a lump at the back of his jaw, get it checked out!",
            "title_similarity": "0.6540779",
            "sentiment_compound": -0.9426
        },
        {
            "id": "gw7f1yr",
            "score": 1,
            "text": "I started working in radiation oncology in 2009 and I saw this playing out. The second the HPV vaccine was approved for men I got it (I was 25, IIRC).\n\nAnecdotally, a few years later I had one of the worst cases of \"strep\" throat EVER. Still wondering if it was my body fighting off an infection...",
            "title_similarity": "0.76696813",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gw7fmlg",
            "score": 1,
            "text": "If everyone who is sexually scribe pretty much has HPV, what is the actual life time risk for oral cancers resulting from HPV?\nWhat are the stats?",
            "title_similarity": "0.7547706",
            "sentiment_compound": 0.3527
        },
        {
            "id": "gw7fq1s",
            "score": 1,
            "text": "I’m glad I never listened to my doctor. He told me that men did not need the vaccine. So, I had to pay in full for the vaccine in Canada but it was free for women.",
            "title_similarity": "0.5152018",
            "sentiment_compound": 0.7391
        },
        {
            "id": "gw7fti1",
            "score": 1,
            "text": "I got all three shots. It was not covered by the insurance. It was hella expensive.",
            "title_similarity": "0.488937",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7fuj4",
            "score": 1,
            "text": "Luckily I was informed and got the vaccine. This has been known for years but there is no much movement behind this because, well, men are considered a bit disposable in the eyes of society. (Also because it causes less deaths than cervical cancer in general I think, no sure though)",
            "title_similarity": "0.6818601",
            "sentiment_compound": -0.8197
        },
        {
            "id": "gw7fw4b",
            "score": 1,
            "text": "Made my son get the vaccine about 3 or 4 years ago. Apparently he was getting close to aging out (16, I think? It's probably changed since). He hates shots, but I pushed it after talking with his amazing pediatrician. I am so happy and relieved! And, btw, he did agree to the shot, he was just hoping to wait another 6 months.\n\nBut yes, originally it was just for females when it came out, then they added males. Doctor had a small poster on the wall about it, so I read it while we waited for him to enter the room.",
            "title_similarity": "0.6844481",
            "sentiment_compound": 0.9807
        },
        {
            "id": "gw7g30s",
            "score": 1,
            "text": "I had my 7th anniversary this week. I was diagnosed with cancer caused by HPv16. It was no fun. I had the equip for 7000 chest X-rays in my neck over 8 weeks. I survived and thrived thanks to great team in OKC. The shot wasn’t available for me. I have had every vaccine possible and would have taken this. No joke. Throat cancer is a terrible way to die. My cousin just had 12 hours of robotic surgery, a feeding tube and is now in chemo and radiation.",
            "title_similarity": "0.7677894",
            "sentiment_compound": -0.8776
        },
        {
            "id": "gw7g45l",
            "score": 1,
            "text": "I am going to ask my doctor, but is it worth getting for men 27+ ? The article makes it sound like it is not.",
            "title_similarity": "0.536582",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gw7gv7s",
            "score": 1,
            "text": "Why is this? Supposedly, more women are vaccinated, but men arent. So it should be the other way around?",
            "title_similarity": "0.47679994",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7h1xw",
            "score": 1,
            "text": "posting, so i can give the link to my doctor later. The save functionality on this site is dogshit.",
            "title_similarity": "0.25479957",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gw7h5hs",
            "score": 1,
            "text": "Luckily for me my mom worked at the health department for a long time so I always get shots whenever they are needed, the HPV one hurt fairly badly iirc",
            "title_similarity": "0.558064",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gw7hecu",
            "score": 1,
            "text": "So my boys missed the vaccine window for age. They are now 25 and 22. Can they still be vaccinated and benefit?  If married, would it still be advised as long as the relationship is monotonous or is it then not necessary or advised?",
            "title_similarity": "0.5625592",
            "sentiment_compound": 0.2255
        },
        {
            "id": "gw7idk7",
            "score": 1,
            "text": "Wow this is really good to know.  I recently got the vaccine because I was having a problem with recalcitrant warts which are hpv.  It’s not been studied properly so it’s not an official treatment for that as of yet, but it’s awesome to know this could also help prevent cancer caused by hpv in men!",
            "title_similarity": "0.65326697",
            "sentiment_compound": 0.7342
        },
        {
            "id": "gw7idlr",
            "score": 1,
            "text": "Most insurances (at last I checked) don't cover the vaccine for men because \"HPV is only something women get at a remotely high rate\"",
            "title_similarity": "0.6868209",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7ig1z",
            "score": 1,
            "text": "I'm sure when we were just giving the vaccine to women and men were like \"Hey, what about us?\" and we were told HPV didn't hurt men like it did women they weren't lying to us, right?\n\nIf I've been lied to already there is a 0% chance I'll pay attention this time.",
            "title_similarity": "0.5723158",
            "sentiment_compound": 0.8403
        },
        {
            "id": "gw7iiyu",
            "score": 1,
            "text": "I was told by our family doctor that is was a shot for our daughter to have as it was to prevent cervical cancer.  It was never told to us that our son (whom is the same doctors patient)  might need/want one.   It was also implied o us that HPV doesn't affect males.. we could get it but it has no symptoms or side effects.\n\nMen are treated differently for sure.    I have another example.. 25% of all males that live long enough will develop prostate cancer or 1 in 8 for all males...   Prostate cancer can and does kill people but usually it isn't until the individuals are much older in age in fact over 35000 men died last year in the US from it.  Only 6 in 10 cases are even diagnosed.    I don't see anyone really talking about it.. pushing prostate exams and or wearing blue for a month to show support and raise awareness about it.",
            "title_similarity": "0.7072816",
            "sentiment_compound": -0.979
        },
        {
            "id": "gw7ikp8",
            "score": 1,
            "text": "I think I asked for this from a doctor and they said it wasen’t necessary unless I was a homosexual....",
            "title_similarity": "0.42134422",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7ikx6",
            "score": 1,
            "text": "Is 30s too old? I was told to old at 30.",
            "title_similarity": "0.30154955",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7isir",
            "score": 1,
            "text": "The HPV vaccine is given to kids in jr high in Canada, but only the girls got it IIRC, and I never really questioned it until now",
            "title_similarity": "0.55495113",
            "sentiment_compound": 0.1948
        },
        {
            "id": "gw7iyg1",
            "score": 1,
            "text": "That's because men issues don't sell. They don't move the needle so they aren't talked about.",
            "title_similarity": "0.26334155",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7izn3",
            "score": 1,
            "text": "Does this have anything to do with oral sex? A friend doc once told me this a big issue no one is taking seriously. He mentioned something about men who engage in oral sex with a female partner being more at risk. Aren’t women the primary group that has HPV I know men can be carriers but isn’t it more likely for women to have the virus?",
            "title_similarity": "0.64606225",
            "sentiment_compound": 0.1333
        },
        {
            "id": "gw7jcsf",
            "score": 1,
            "text": "Jokes on me, the vaccine didn't come out until a year after I slept with an older woman who was HPV positive. I'm now listed on the high risk category rectal and colon cancer after an unrelated procedure discovered polyps at 26.",
            "title_similarity": "0.7094676",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gw7jfyp",
            "score": 1,
            "text": "Men of Reddit: please go get this. I got HPV from my much more experienced former partner and ended up losing my uterus over it.",
            "title_similarity": "0.6151602",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gw7jkwh",
            "score": 1,
            "text": "The VA encouraged me to get it a couple years ago and I did. No regrets. Mid 20’s",
            "title_similarity": "0.4138439",
            "sentiment_compound": 0.5588
        },
        {
            "id": "gw7jqqb",
            "score": 1,
            "text": "In MA, it’s 3 shots and they each cost upwards of $200 if you’re over 26.",
            "title_similarity": "0.57189417",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7k2bl",
            "score": 1,
            "text": "Offered for free to fifth graders of both genders in Sweden.",
            "title_similarity": "0.3259074",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gw7k5p7",
            "score": 1,
            "text": "Had the hpv shot since I was in high school it’s lit",
            "title_similarity": "0.45412493",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7k5ro",
            "score": 1,
            "text": "I was offered Gardasil through the military so I got my HPV shot for free. In my province civilian females under 13 get the vaccine under government health coverage. Civilian men have to pay out of pocket",
            "title_similarity": "0.60546666",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw7k8t3",
            "score": 1,
            "text": "What about for someone who got their first dose but never went back for the 2nd and 3rd? Can I still get them",
            "title_similarity": "0.32596147",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7kghs",
            "score": 1,
            "text": "Aren’t there like 70 different types of HPV? Which types create this specific cancer? What types of HPV does the vaccine protect in females?",
            "title_similarity": "0.71140444",
            "sentiment_compound": 0.327
        },
        {
            "id": "gw7kqut",
            "score": 1,
            "text": "I asked for this from my doc and they said it was pointless to get now at my age (male, late 30s) and didn't wanna give it to me. \n\nI disagree but how can I convince them?",
            "title_similarity": "0.3950892",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gw7krwe",
            "score": 1,
            "text": "Even if the esophageal cancer wasn’t an issue it just makes plain sense from a public health perspective to vaccinate men cause it can protect women. I got the vaccine at 16 as a male and thought this was normal for everyone .",
            "title_similarity": "0.6620868",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gw7l0aj",
            "score": 1,
            "text": "Insurance also doesn’t cover it if you are above 18 I think. This vaccine should be as common as the measles vaccine considering how likely any human is to getting some kind of HPV in their life",
            "title_similarity": "0.65053916",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7m61p",
            "score": 1,
            "text": "The reason for this is an epidemiology strategy aimed at saving costs. Since HPV is sexually transmissible, vaccinating people of one gender will get the job done. Obviously this doesn't consider gay men though.",
            "title_similarity": "0.4843683",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7m82o",
            "score": 1,
            "text": "I’m 32 and just now discovered men can get this. The messaging on getting it over 26 is pretty muddled though. Is one to read between the lines and ascertain that if they’ve been sexually active it’s not worth getting? I have no aversion to getting it and plan to ask my doctor at my next visit, but just trying to get a sense of the potential benefit at my age.",
            "title_similarity": "0.5866687",
            "sentiment_compound": 0.8085
        },
        {
            "id": "gw7mdcr",
            "score": 1,
            "text": "glad i finished getting mine!",
            "title_similarity": "0.01618512",
            "sentiment_compound": 0.5093
        },
        {
            "id": "gw7mic0",
            "score": 1,
            "text": "Can I get this in Canada?",
            "title_similarity": "0.076608405",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7n81t",
            "score": 1,
            "text": "Is this from eating coochie?",
            "title_similarity": "0.17855114",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7n938",
            "score": 1,
            "text": "If you look it up, the HPV was specifically made to prevent cervical cancer, and there are reports that it may prevent oropharyngeal but this is still in research. However, in the UK, both men and women can have the HPV jab.",
            "title_similarity": "0.6353943",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gw7n97t",
            "score": 1,
            "text": "So I was given the full rounds of the HPV vaccine as young man (16ish yo) but the kicker is that I’m gay. Never even kissed a girl. Was it pointless or can you give someone HPV without having sex with them?",
            "title_similarity": "0.7080179",
            "sentiment_compound": -0.4168
        },
        {
            "id": "gw7ne1s",
            "score": 2,
            "text": "I don't exactly have all the research to back this up but this is my theory....\nMost lung cancers aren't caused by smoking (that is a fact btw look it up), small cell type is most commonly associated but most lung cancer pts don't have a strong smoking history. Lung cancer receives poorer press because of its association with smoking so there's a whole karma vibe around lung cancer. Orophayngeal cancers are also linked to smoking but not always caused by it. Maybe there's the same bias.",
            "title_similarity": "0.6537868",
            "sentiment_compound": -0.9836
        },
        {
            "id": "gw7nl09",
            "score": 1,
            "text": "I’ve had genital warts - should I be concerned?",
            "title_similarity": "0.3037377",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7nmeo",
            "score": 1,
            "text": "I remember in middle school there was an assembly to give the girls the vaccine. When I asked why we weren't getting it too and was told HPV doesn't effect men at all so we didn't need it.",
            "title_similarity": "0.44513813",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7nsat",
            "score": 1,
            "text": "And yet I've literally had people tell me that the vaccine was *exclusively* for teenage girls. Not men, not even women over 20. My SO was told they couldn't get the vaccine because they were 24. Why are people so incredibly misinformed about this?",
            "title_similarity": "0.60948664",
            "sentiment_compound": -0.489
        },
        {
            "id": "gw7o2ea",
            "score": 1,
            "text": "So you have herpes?! Gross",
            "title_similarity": "0.23069268",
            "sentiment_compound": -0.5255
        },
        {
            "id": "gw7o41x",
            "score": 1,
            "text": "Well I'm mad, no one told me I could get as a 27 year old woman living in the UK, I remember when the vaccine was rolled out in school but it started for the year below us and that was the last we heard about it.\n\nI've just looked online to see if I can get it, turns out I absoutely can but it will cost me £329 - £469 for the full course, what has made me mad was this could have been free treatment up to the age of 25 and had I have known then I would of got it done.\n\nI don't have that kind of money to throw on a vaccine, pissed.",
            "title_similarity": "0.5821468",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gw7o6q4",
            "score": 1,
            "text": "This vaccine has severe side effects. I believe it was banned in Japan & some other countries..",
            "title_similarity": "0.45388967",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gw7o74x",
            "score": 1,
            "text": "This is incredibly misleading (I'm not going to argue against giving boys the HPV vaccine) the vast majority of cervical cancers prob >9/10 are caused by HPV and most commonly strains we vaccinate against. With oesophageal cancer this link isn't as clear and the role of modifiable life style related risk factors are more important and proven.",
            "title_similarity": "0.7295084",
            "sentiment_compound": -0.8237
        },
        {
            "id": "gw7obmg",
            "score": 1,
            "text": "Genuine question here. \n\nI’ve seen a lot of comments about doctors refusing to allow their male patients to get the vaccine. Why would a doctor refuse to give the vaccine if a patient can afford it and requested it?",
            "title_similarity": "0.610386",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gw7oqdx",
            "score": 1,
            "text": "I have literally asked about this several times to several of my general practitioners, they have claimed they make no vaccine for men, or its not at all necessary for men to get it.\n\nI really hope the medical community at large updates their knowledge here.",
            "title_similarity": "0.58930457",
            "sentiment_compound": 0.2484
        },
        {
            "id": "gw7ox2k",
            "score": 1,
            "text": "Not a doctor...but this isn’t a cancer vaccine.  It’s a vaccine for a sexually transmitted disease (HPV) that can cause cancer.  Not the same thing.",
            "title_similarity": "0.53117406",
            "sentiment_compound": -0.8689
        },
        {
            "id": "gw7p3id",
            "score": 1,
            "text": "The real question is if you got the original vaccine that covers four strands, can you get the new one that covers nine???",
            "title_similarity": "0.54046226",
            "sentiment_compound": 0.4291
        },
        {
            "id": "gw7plwl",
            "score": 1,
            "text": "We had a huge campaign in Argentina for both genders and we were both vaccinated for free",
            "title_similarity": "0.40139866",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gw7poy3",
            "score": 1,
            "text": "My son's received theirs as part of the high school vaccination schedule. It was done at school, in Grade 7 (Australia)",
            "title_similarity": "0.46218023",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7pusm",
            "score": 1,
            "text": "Is there any point in getting the vaccine if you already have it? Girlfriend found out she had it a few years ago, not blaming her, just that there’s not a test for men so I wouldn’t know if I did. But if I’ve already got it, am I just screwed then?",
            "title_similarity": "0.5502806",
            "sentiment_compound": -0.5921
        },
        {
            "id": "gw7pvdc",
            "score": 1,
            "text": "How does one acquire the vaccine? I’m male, in Canada, and asked my (normally very progressive and understanding) family doctor to give me a prescription for it – he said no.\n\nNot only do I want to reduce the likelihood of developing associated cancers, I also want to do my part to mitigate spread of the virus. I don’t want to be a vector, vaccinate me!",
            "title_similarity": "0.5653323",
            "sentiment_compound": 0.2942
        },
        {
            "id": "gw7q3ck",
            "score": 1,
            "text": "This straight up was pushed on women and not men. Pretty much heard \"girls need to get this extra vaccine\" so I always thought it was specific. Had no idea.",
            "title_similarity": "0.44599748",
            "sentiment_compound": -0.4456
        },
        {
            "id": "gw7qdqc",
            "score": 1,
            "text": "Amy developments on a treatment of you got it before the vaccine? My ex had it in my early twenties. The doctors pretty much acted like it was no big deal for dudes and I never had any major symptoms or anything.",
            "title_similarity": "0.5716177",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gw7recp",
            "score": 1,
            "text": "Tried to get it but by the time they approved it for men, I was too old. Kind of frustrating to be honest.",
            "title_similarity": "0.45660925",
            "sentiment_compound": 0.5941
        },
        {
            "id": "gw7rh23",
            "score": 1,
            "text": "And if you’re in your 30s can you still get it?",
            "title_similarity": "0.19687435",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7rhuc",
            "score": 1,
            "text": "Thanks for this important information. Gonna check with my doctor.",
            "title_similarity": "0.26531473",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gw7rk3w",
            "score": 1,
            "text": "I just found out I had hpv after having my daughter in December. Not sure if going through something major like giving birth \"activated\" the virus. I was vaccinated as a teen. \n\nNeither myself or my husband have ever had unprotected sex with anyone else. I know condoms aren't 100% at preventing this but I just feel like I did everything right and still ended up getting it. \n\nMy husband isn't vaccinated but I really want him to be. We just can't afford it (it is £500 for the 3 doses). I am on maternity leave atm and have like zero income. I dont return to work until November. \n\nI am so worried about this and have felt sick about it since I found out in February.",
            "title_similarity": "0.6621595",
            "sentiment_compound": -0.1576
        },
        {
            "id": "gw7ruax",
            "score": 1,
            "text": "Have girls but if we have a boy, I am so getting him vaccinated for HPV too.",
            "title_similarity": "0.5453876",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7rv9g",
            "score": 1,
            "text": "I’m always shocked when I see things like this. Then I find that graph of leading causes of death, vs sicknesses that we raise the most research money for. It’s very unbalanced.",
            "title_similarity": "0.5424653",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gw7rzjx",
            "score": 1,
            "text": "This isn’t clear enough. It’s misleading wording to imply HPV has increased oropharyngeal cancer rates. When in reality all it’s saying is: HPV can cause cervical cancer and oropharyngeal cancer. Cervical cancer rates are less than oropharyngeal cancer rates. \n\nWhat percentage of oropharyngeal cancer in men is caused by HPV?\n\nEdit: further to that, what percentage of oropharyngeal cancer in women is caused by HPV?",
            "title_similarity": "0.7378251",
            "sentiment_compound": -0.986
        },
        {
            "id": "gw7smdv",
            "score": 1,
            "text": "Tbh I didn’t even know the HPV vaccine was even available to men until last year when I went into a clinic to get my vaccination record for an over seas job.",
            "title_similarity": "0.67083764",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7spkk",
            "score": 1,
            "text": "I did a deep dive on research about this vaccine when I was 26 because I heard it was only approved for women up to age 24!\n\nI thought: why age 24? That's a weird number\n\nWell there didn't end up being a lot of info out there, but I came across an interview with a doctor(?) a scientist(?) that said 24 was the recommended last recommended age women should get the vaccine, because their studies had shown after age 24, most women would already have the main cancer causing strains of HPV since statistically by that age they already had 4 or more sexual partners, so the vaccine wasn't worth it anymore. So 2 problem with this:\n\n1. It was unknown at the time if the vaccines would reduce the chances you would develop cancer if you already had cancer causing strains of HPV. Since there wasn't science yet, it couldn't be \"officially\" recommended by health authorities and therefore not likely covered under insurance if you were over the cut off age\n\n2. This assumes that by age 24, most women have had 4 or more sexual partners that they have had unprotected oral, vaginal, or anal sex with. What?! What about people who haven't had sex yet? What about having only 3 unprotected sexual partner, or 2 or more totally protected sexual encounters (condom or dental dam protection, no oral, etc)?! How fucked are the assumptions!!!!\n\nAnd yeah this is info was catered to heterosexual highschool and colleges aged women. Nothing about lesbians or men.",
            "title_similarity": "0.7489929",
            "sentiment_compound": -0.9909
        },
        {
            "id": "gw7syl8",
            "score": 1,
            "text": "Anyone know why HPV vaccine of minimal value for people age 27-45?  Is the presumption that if you are in that age range you've likely been exposed already?",
            "title_similarity": "0.560712",
            "sentiment_compound": 0.3527
        },
        {
            "id": "gw7t062",
            "score": 1,
            "text": "I actually got my HPV vaccine because I found out it existed in LA. A girl I was seeing told me her friend and that persons boyfriend had it and she got cervical cancer from them giving to each other back and forth. Definitely get your vaccines :)",
            "title_similarity": "0.61102855",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gw7t40h",
            "score": 1,
            "text": "IN CASE YOU ARE READING THIS...throat cancer can come from cigarettes and other forms of tobacco too...NOT just HPV",
            "title_similarity": "0.5006724",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gw7t8kz",
            "score": 1,
            "text": "I've always found it completely bizarre that they didn't recommend the vaccine for boys. Even if it were only to stop them from being carriers",
            "title_similarity": "0.39991122",
            "sentiment_compound": -0.7098
        },
        {
            "id": "gw7tkwe",
            "score": 1,
            "text": "So called \"Menninsts\" should be out on the street demanding awareness and normalization of the the HPV vaccine for men.\n\n&#x200B;\n\nBut they're really just women-haters so they don't.",
            "title_similarity": "0.4700864",
            "sentiment_compound": -0.1154
        },
        {
            "id": "gw7tmin",
            "score": 1,
            "text": "How likey is this cancer, if you’re a man with HPV? And what symptoms should one look out for?",
            "title_similarity": "0.609694",
            "sentiment_compound": -0.7657
        },
        {
            "id": "gw7u5tv",
            "score": 1,
            "text": "HPV also causes a large slice of anal, and penile cancers. These, with the oral cancer risk mean men are at a substantial (20%+ IIRC) risk of cancer caused by the same thing causing cervical cancer. (Of course, women are at a similar risk for all these things, which is also helped by their HPV vaccination)",
            "title_similarity": "0.7420286",
            "sentiment_compound": -0.9565
        },
        {
            "id": "gw7u82s",
            "score": 1,
            "text": "We weren't allowed to get it.  It was only given to women.  So I don't understand the surprise",
            "title_similarity": "0.18616596",
            "sentiment_compound": -0.2057
        },
        {
            "id": "gw7u94r",
            "score": 1,
            "text": "When I was a teen (31) my doctor told me there was no reason for heterosexual males to get the HPV vaccine....so I never did. Anyone around my age hear something similar?",
            "title_similarity": "0.5524021",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw7ufu8",
            "score": 1,
            "text": "After a certain age, it's not covered by insurance. I tried to get this vaccine at 35 and they told me that the cost/benefits did not make much sense. Each shot was 500$ and it was a series of 3.",
            "title_similarity": "0.61392343",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw7uj2x",
            "score": 1,
            "text": "They should probably market it to both men and women then.\n\nI remember all those commercials targeted to women for this vaccine.",
            "title_similarity": "0.54042",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7uj3p",
            "score": 1,
            "text": "That's probably got something to do with the fact that men don't get talked to about how sEx Is BaD all the time and fearmongered into ignorance.",
            "title_similarity": "0.4387855",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gw7v7ml",
            "score": 1,
            "text": "I asked for this vaccine years ago and was told it wasn’t for men and that I could not have it.",
            "title_similarity": "0.4767174",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7vng2",
            "score": 1,
            "text": "I didn’t get my first booster from it until I turned 21. No one ever told me it existed",
            "title_similarity": "0.3280474",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw7vokc",
            "score": 1,
            "text": "Wasn’t there idea with this that protecting women would give protection to men as well as its sexually transmitted? In England men who have sex with men are offered it.",
            "title_similarity": "0.453744",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw7vwlu",
            "score": 1,
            "text": "Can someone remind me how men get this cancer? I (a female) received it when I was younger but wondering if it is something my fiance should get too, before he is too old? Is it sexually transmitted only?",
            "title_similarity": "0.66817963",
            "sentiment_compound": -0.5669
        },
        {
            "id": "gw7vyza",
            "score": 1,
            "text": "I got the vaccine when I was 35. Talk to a doctor, and DON'T TAKE \"NO\" FOR AN ANSWER!",
            "title_similarity": "0.5443084",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7w0nf",
            "score": 1,
            "text": "I've been flat-out refused this vaccine despite asking for it from all of my medical providers.\n\n\"too old, too male, nobody cares, it's a female thing, etc\"",
            "title_similarity": "0.44757652",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw7wp6a",
            "score": 1,
            "text": "My gyn recommended me the HPV vaccine, which I took, all 3 doses for some (converted) US$ 250. My country is now giving them for free to girls up to 13yo, which sucks for me. But there seems to be a reason for that: the younger you are when you get the shots, the higher your chance to actually get protected... That's at least what the gyn and the people at the vaccination center told me. So, vaccinate your children asap!",
            "title_similarity": "0.6825514",
            "sentiment_compound": 0.8459
        },
        {
            "id": "gw7wykl",
            "score": 1,
            "text": "This is so far from a research informed take, but I thought the Gardasil commercials back in the day were advertised to both male and female teens? This is based solely on the fact that I think I remember seeing boys in the commercials",
            "title_similarity": "0.5377479",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7x23e",
            "score": 1,
            "text": "idk why there’s so much controversy around the HPV vaccine?? I had to get mine in secret because my dad acts like it’s the antichrist.",
            "title_similarity": "0.5704944",
            "sentiment_compound": 0.3527
        },
        {
            "id": "gw7x3vr",
            "score": 1,
            "text": "Genuinely mad I didn't know this before. I'm 40 now and have throat problems.",
            "title_similarity": "0.4531203",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gw7xft0",
            "score": 3,
            "text": "they have started vaccinating men and women with the vaccine as of a couple years ago!!! at least at my school",
            "title_similarity": "0.6372802",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw7xogo",
            "score": 1,
            "text": "Can someone one help me out? I am unsure if I have ever received that vaccine or not. How would I be able to find out that information? Is there a test to see if my body has the vaccine in it already? I am not in contact with my family so I am unable to get my childhood vaccination records. I’m 31yo.",
            "title_similarity": "0.48185873",
            "sentiment_compound": 0.3049
        },
        {
            "id": "gw7yic3",
            "score": 1,
            "text": "If women get the vaccine and men don't, wouldn't that naturally result in distorted percentages? The real important info is the numbers. Is 80% 80,000 people or 80?",
            "title_similarity": "0.66674984",
            "sentiment_compound": -0.3094
        },
        {
            "id": "gw7ywmz",
            "score": 1,
            "text": "dumb question - past 26 years vaccine is useless?",
            "title_similarity": "0.40758288",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gw7yy1y",
            "score": 1,
            "text": "This seems like very important information, and it makes me wonder why we aren’t being vaccinated for this like other regularly mandated vaccines.",
            "title_similarity": "0.40967655",
            "sentiment_compound": 0.7556
        },
        {
            "id": "gw7z39o",
            "score": 1,
            "text": "Stop giving oral sex to women. That’s what her boyfriend is for.",
            "title_similarity": "0.3329891",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gw7z5s8",
            "score": 1,
            "text": "Where I live, girls get it for free and boys have to pay 500$",
            "title_similarity": "0.43128705",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw7zsul",
            "score": 1,
            "text": "Something I can get behind!",
            "title_similarity": "-0.18973261",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw80lkh",
            "score": 1,
            "text": "Thanks for this. Can you share with everyone how a male would contract HPV please.",
            "title_similarity": "0.46711856",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gw80s6w",
            "score": 1,
            "text": "Well, we literally weren't allowed to get this vaccine when I was younger. It was only offered to girls.\n\nIt would appear they've changed that now, but I'd suggest that they need to launch an advertising campaign to raise awareness for men like they did for women when it first hit the market.",
            "title_similarity": "0.5791625",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gw81eho",
            "score": 1,
            "text": "I’m about vaccinated  out for the year. That second dose of Pfizer was hard on ya boy.",
            "title_similarity": "0.6295786",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gw81zy4",
            "score": 1,
            "text": "They did massive roll out of the vaccine for teen girls in New Zealand when I was a teen 15 years ago or so...we were told that only women could get hpv....",
            "title_similarity": "0.63238406",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw827kz",
            "score": 1,
            "text": "No idea there was a vaccine.",
            "title_similarity": "0.18815365",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw829ok",
            "score": 1,
            "text": "The Gardasil vaccine [has been discontinued.](https://www.druglawcenter.org/hpv-vaccine/) is there another hpv vaccine?",
            "title_similarity": "0.44043002",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw82epi",
            "score": 1,
            "text": "As a guy, my doctors put me on (female) birth control to try and get me to gain weight since I dropped to a dangerously low weight.\n\nSide effects were possible appetite increase and weight gain. So they use it for that as well in men. Maybe women, beyond BC needs?\n\nDidn’t work for me, but it was an interesting thing to learn.",
            "title_similarity": "0.59265685",
            "sentiment_compound": 0.765
        },
        {
            "id": "gw830a5",
            "score": 1,
            "text": "My son received his at 9 years old!!!!",
            "title_similarity": "0.32579222",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw837dy",
            "score": 1,
            "text": "My dad survived this type of cancer. But treatment left him so miserable that if it ever came back, he vowed to not get treatment again. It was awful for the whole family. Please please please, get the vaccination!",
            "title_similarity": "0.56615555",
            "sentiment_compound": -0.5671
        },
        {
            "id": "gw83bzm",
            "score": 1,
            "text": "To anybody reading this, if you're in college, go to the student health center to get vaccinated. It's more than likely free or at very least low cost through insurance.",
            "title_similarity": "0.42115662",
            "sentiment_compound": 0.2927
        },
        {
            "id": "gw83hg5",
            "score": 1,
            "text": "Why then in the medical literature did we frame this issue around needing to vaccinate both genders to protect women from cervical cancer? A massive barrier to the adoption of this vaccine at first was that conservative/religious people argued it just allowed young girls to sin and have sex without consequences. If we had included “stop men getting mouth cancer” from the get go I guarantee you would not have heard a peep of argument out of anybody",
            "title_similarity": "0.5993615",
            "sentiment_compound": -0.872
        },
        {
            "id": "gw83nh3",
            "score": 1,
            "text": "Can someone elaborate this for men who are older? If one might have contradicted it? Does an hpv vaccine or would it, have any effect on this? Sorry if stupid question.",
            "title_similarity": "0.5534271",
            "sentiment_compound": -0.766
        },
        {
            "id": "gw83u1n",
            "score": 1,
            "text": "I guess this is the time to thank my gynaecology professor. She told us, that there was a vaccine for men. I originally just got the shot to protect future sexual partners, but I don’t mind the additional benefit of cancer prevent for myself.",
            "title_similarity": "0.5961201",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gw84h3h",
            "score": 1,
            "text": "Idk what goofy doctors y’all been going to. But every time I go to get a physical for work they tell me about the HPV vaccine and how men should get it just as much as women. Because you can transmit it and the cancer causing effects of it.",
            "title_similarity": "0.6596273",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gw84nxl",
            "score": 1,
            "text": "Can I get the vaccine even though I am old?",
            "title_similarity": "0.45478725",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw84ro6",
            "score": 1,
            "text": "But men can use their privilege to block cancer.",
            "title_similarity": "0.4671902",
            "sentiment_compound": -0.8271
        },
        {
            "id": "gw84s4q",
            "score": 1,
            "text": "Right around when gardisil came out, I was 13 and my pediatrician recommended I get it. So I did; glad she was looking out for me",
            "title_similarity": "0.4485439",
            "sentiment_compound": 0.6204
        },
        {
            "id": "gw84yu9",
            "score": 1,
            "text": "When I was in grade 7 I think, all the girls got it. We didn’t though.",
            "title_similarity": "0.33740705",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8506o",
            "score": 1,
            "text": "I got the first dose years ago and had the most excruciating pain for the next few days that I thought I was going to die. Still need to get shot 2 and 3 but I seriously don't want to feel that again.",
            "title_similarity": "0.57044303",
            "sentiment_compound": -0.8368
        },
        {
            "id": "gw85lbm",
            "score": 1,
            "text": "Yep, when it first came out it all the marketing and PR was targeted towards girls because of cervical cancer. Now, I'm not trying to minimize the amazing achievement of curbing cervical cancer but we should be pushing all eligible teens to get the Gardasil shot to minimize the risk for everyone.",
            "title_similarity": "0.5586313",
            "sentiment_compound": -0.6187
        },
        {
            "id": "gw85q3y",
            "score": 1,
            "text": "Having the vaccine tommorow, school mandatory.",
            "title_similarity": "0.351609",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gw85ul7",
            "score": 3,
            "text": "When I was in grade 6 they offered the HPV vaccine to all the girls and said it was a good idea. And I said well can the boys get it too? And they said we didn’t need it. So I asked why we couldn’t get it so that there’d be less HPV out in the world, and if a girl had missed it, she would be less likely to get it. The teacher just stared at me and told me to ask the nurses. I did and they also just stared at me. Then when I got older I realized I’m bi and started sleeping with men. Turns out HPV can cause cancer in men both oropharyngeal and rectally. I was at a sexual health clinic and they ended up giving me the vaccine for for free as well as a few others. But only because I declared that I had male partners on the form. To my mind there is no reason everyone shouldn’t get this. And it pisses me off to this day the stares I got when I asked about it as a kid.",
            "title_similarity": "0.6271475",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gw864qi",
            "score": 1,
            "text": "maybe because it frkn costs over 1k for the 3 doses",
            "title_similarity": "0.4980537",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw865cx",
            "score": 1,
            "text": "I didn't get the vaccine when it just came out because there were some scary stories here about the side effects.\n\n25F now but still never had any sexual contact, I could still get it I think?",
            "title_similarity": "0.4896335",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gw86foc",
            "score": 1,
            "text": "Aren’t something like 80% of smokers male? And isn’t smoking a _huge_ risk factor for oropharyngeal cancer? I have a hard time believing that this “80%” figure is all down to unequal access to Gardasil.",
            "title_similarity": "0.76237065",
            "sentiment_compound": -0.7059
        },
        {
            "id": "gw86wdj",
            "score": 1,
            "text": "My male privilege never got me an hpv vaccine.",
            "title_similarity": "0.4337275",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw874oe",
            "score": 1,
            "text": "I am getting vaccinated for HPV next week at age 37. Any other vaccinations I should pick up? Haven't been vaccinated after the usual childhood ones.",
            "title_similarity": "0.64945424",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw87ieb",
            "score": 1,
            "text": "Interesting. I was told that men who got the vaccine wouldn't actually get it it, but instead prevent being a carrier for women. I got 3 total HPV shots when I was like 15, and boy that first shot was more painful than anything else I've experienced in life.",
            "title_similarity": "0.7204405",
            "sentiment_compound": -0.0102
        },
        {
            "id": "gw886sc",
            "score": 1,
            "text": "What if you have HPV already, can you still get the vaccine and it will help prevent cancer?   I think I am unfortunately recognizing the signs that I could have throat and ovarian cancer and I’m only 30.",
            "title_similarity": "0.7069888",
            "sentiment_compound": -0.8555
        },
        {
            "id": "gw88ww7",
            "score": 1,
            "text": "I would totally get this, never knew the vaccine was available for men too.",
            "title_similarity": "0.5507374",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw88xev",
            "score": 1,
            "text": "So me a 30 year old man can get a hpv vaccine???",
            "title_similarity": "0.6825013",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw891rt",
            "score": 1,
            "text": "Is there something i should be doing about this? My girlfriend recently found out she has HPV and now has to get everything checked periodically, at her last checkup i had her ask if i should be getting anything checked, they told her no, i don’t have to do anything.",
            "title_similarity": "0.4563625",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8a94s",
            "score": 1,
            "text": "I’ve received all my injections for HPV - there were major issues with this because they were producing supply for half the population. When they realised it could benefit men too they had to double production which took time and there was a shortage for quite some time.\n\nDefinitely worth getting if you can and you’re of age.",
            "title_similarity": "0.7113923",
            "sentiment_compound": 0.7063
        },
        {
            "id": "gw8ahue",
            "score": 1,
            "text": "My doctor wouldn’t give it to me.  She claimed I was told old to need it, though I’d had seven partners in the last year.",
            "title_similarity": "0.4800142",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8am1m",
            "score": 1,
            "text": "I got it for my son because men can pass it between women. Who knew I was helping him too? The propaganda around this vaccine was only surpassed by the Corona vaccine.",
            "title_similarity": "0.6475222",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gw8b2h9",
            "score": 1,
            "text": "They won't even provide it in Canada.  Only to women.  Men don't matter.",
            "title_similarity": "0.29052365",
            "sentiment_compound": -0.0191
        },
        {
            "id": "gw8bae8",
            "score": 1,
            "text": "Our school organised for everyone in my year to get one, boys and girls. Fully subsidised. It was good of them.",
            "title_similarity": "0.4344324",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw8bjg3",
            "score": 1,
            "text": "I didn't even know we could or needed to get the vaccine.",
            "title_similarity": "0.34381476",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8bpof",
            "score": 1,
            "text": "That's because by design it was only given to women for some stupid reason.  I tried to get it as a mid 30s adult after I got divorced and was told no because I was male and I was way over the age range (16 or something).  I understand that to start they use a specific population to test it, but by all means expand it.  It's been around for about a decade or so.",
            "title_similarity": "0.6507195",
            "sentiment_compound": 0.0387
        },
        {
            "id": "gw8bvc2",
            "score": 2,
            "text": "I got the vaccine in high school. They told me it was to prevent me from getting HPV and spreading it (and possibly giving cancer) to girls. First I’ve ever heard of this",
            "title_similarity": "0.5758495",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gw8d9tf",
            "score": 2,
            "text": "I’m a man who has gotten his three doses of the HPV vaccine in the last few months, and it was just to protect my sexual partners. I had no idea it also protected me. This is great news",
            "title_similarity": "0.72918993",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gw8ddap",
            "score": 1,
            "text": "When is it too late to get this vaccine?",
            "title_similarity": "0.33575305",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8djjv",
            "score": 1,
            "text": "Yeah this is a male problem. it's not going to get fixed. Move on. It's over.",
            "title_similarity": "0.12724571",
            "sentiment_compound": -0.128
        },
        {
            "id": "gw8e66y",
            "score": 1,
            "text": "That's fucked up because I've never heard of it in any other context except as a vaccine exclusively for females. I've never once seen or heard even a hint that it is useful for men too. This is literally the first time.",
            "title_similarity": "0.5053812",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gw8eb2b",
            "score": 1,
            "text": "I have never heard of a doctor recommending men to get the hpv vaccine",
            "title_similarity": "0.49804983",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8efur",
            "score": 1,
            "text": "I think I got a single dose when I was 13(as a boy), never got the 2nd one. \nI wonder if I can/should get it now, not 26 yet so I still have time…",
            "title_similarity": "0.47708797",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8elhw",
            "score": 1,
            "text": "my mom hasn't been rational 100% of my life, but I am infinitely grateful that she has never become an anti-vaxxer or caught in mlm",
            "title_similarity": "0.42360637",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gw8eyfm",
            "score": 1,
            "text": "Whoa man what are you saying. You’d let your kids get a vaccine that could save their lives even if it meant being able to have sex without the risk of dying?",
            "title_similarity": "0.4695052",
            "sentiment_compound": 0.6142
        },
        {
            "id": "gw8fbd8",
            "score": 2,
            "text": "Can someone explain why the vaccine was not recommended after a certain age, close to young adulthood? This really pissed me off",
            "title_similarity": "0.4587974",
            "sentiment_compound": -0.6105
        },
        {
            "id": "gw8fobc",
            "score": 1,
            "text": "Is this statistic skewed now because of the number of woman who receive the vaccine? Like, of course the rate of diagnosis for men is going to go up if the rate of diagnosis for women is simultaneously falling...",
            "title_similarity": "0.6390141",
            "sentiment_compound": 0.296
        },
        {
            "id": "gw8fqp1",
            "score": 1,
            "text": "Stuff like this makes me grateful I have parents who trust science and got me all the recommended vaccines",
            "title_similarity": "0.45959836",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gw8fqp7",
            "score": 1,
            "text": "When I was 18 I was told it's too late for the vaccine to work on me, that always confused me as I didn't think a vaccine was age restricted backwards.",
            "title_similarity": "0.49214047",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gw8fzuc",
            "score": 1,
            "text": "There's. A herpes vaccine?? And I didn't know?? Who is funding sexual education in this nation?",
            "title_similarity": "0.5558912",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8gb0x",
            "score": 1,
            "text": "When will we have a screening test for men?!!!!!",
            "title_similarity": "0.33265013",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8gfzf",
            "score": 1,
            "text": "I've spent a few years now strongly encouraging all then men/boys in my life to get the vaccine - if not for themselves, then for the sake of any female partners they may have. My mom died of cervical cancer most likely due to HPV, and knowing that it may be preventable for others is huge. Fingers crossed that this new info will push more men to get vaccinated!",
            "title_similarity": "0.7365288",
            "sentiment_compound": -0.3595
        },
        {
            "id": "gw8gkq4",
            "score": 1,
            "text": "Is this a dz gays get from doing gay things that involve oropharyngeal stuff?",
            "title_similarity": "0.44598284",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8gour",
            "score": 1,
            "text": "When I asked my doctor for it, I was ignored. When I changed doctors to one that was more gay friendly, it was given to me upon request.",
            "title_similarity": "0.45041275",
            "sentiment_compound": 0.2911
        },
        {
            "id": "gw8huxn",
            "score": 3,
            "text": "I work in the lab that invented the first vaccine and this is a conversation we have all the time. Unfortunately it is very hard to convince governments and regulatory bodies to change the recommendations on who should get the vaccine. Some countries like Japan straight up don't recommend it to large portions of the population.",
            "title_similarity": "0.5713531",
            "sentiment_compound": 0.1181
        },
        {
            "id": "gw8hzzc",
            "score": 1,
            "text": "I only ever got the first two shots and never got the third. Do i have any protection at all?",
            "title_similarity": "0.31622344",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8i42m",
            "score": 1,
            "text": "I will ask my son’s pediatrician, thank you!",
            "title_similarity": "0.30502987",
            "sentiment_compound": 0.4199
        },
        {
            "id": "gw8i673",
            "score": 1,
            "text": "Wow, I'm glad I got my HPV shots done a few years back then. Yeesh",
            "title_similarity": "0.44354418",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gw8i9o4",
            "score": 1,
            "text": "Hmm, I'm kind of frightened i might have this. I'm 37 and was just slightly too old when the vaccines first started coming out, each time they raised the age limit I was again a few years too old. Almost 2 years I developed this bad cough that lasted about 4 months. Occasionally it felt like my airway closed up now and then when coughing. Eventually the cough went away but then I was left with a strange feeling of having a lump in the throat all the time, it's still like that even now.  \n\nAfter multiple walk-in clinic visits I was finally referred to an ENT, he stuck a small camera up my nose to around where you can see the back of your throat when you open your mouth but didn't go any further and said everything looked fine. During the visit though he also noticed I have a severely deviated septum and apparently a feeling of a lump in the throat can be a symptom of it. He said he refer me to other surgeons for the septum but about 2 weeks later is when most of the world shut down from covid and I haven't received any call. No other symptoms other than the feeling of having a tiny little air bubble in my throat either. Tried for 2 more appointments within the past half year but because of covid they were only phone call appointments.",
            "title_similarity": "0.66100514",
            "sentiment_compound": -0.7042
        },
        {
            "id": "gw8iaky",
            "score": 1,
            "text": "Gotta love that medical sexism. Men, go get the shot- be firm with your doctor if you gotta. I did it, and it wasn't nearly as bad as the tetanus vaccine, much less the covid vaccine.",
            "title_similarity": "0.5856489",
            "sentiment_compound": 0.7935
        },
        {
            "id": "gw8iflb",
            "score": 1,
            "text": "I didn’t know the HPV vax was also for men",
            "title_similarity": "0.49803612",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8iv10",
            "score": 1,
            "text": "In the U.K. it’s only given to women",
            "title_similarity": "0.22145888",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8j7th",
            "score": 1,
            "text": "Can a guy get this vaccine at any age?",
            "title_similarity": "0.4964592",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8j96i",
            "score": 1,
            "text": "I remember I got mine when I was like 18 or something even before I started getting sexually active",
            "title_similarity": "0.34479612",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gw8k8rp",
            "score": 1,
            "text": "If you already have HPV will the vaccine do anything?",
            "title_similarity": "0.4776436",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8kf4n",
            "score": 1,
            "text": "There are two cancerous strains of HPV (16,31) that the vaccine does not cover so when in doubt, get tested, regardless of vaccination status.",
            "title_similarity": "0.5870285",
            "sentiment_compound": -0.6077
        },
        {
            "id": "gw8kxta",
            "score": 1,
            "text": "I am in that age group (18) and was lucky enough to be told about the HPV vaccine by my doctor for the first time just the other day. As soon as I finish getting my Covid vaccine (I have 1 out of 2 shots currently), it's gonna be top priority.",
            "title_similarity": "0.6375727",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gw8kyz3",
            "score": 1,
            "text": "I delayed my third Gardasil dose to get my two Moderna stabs! I decided a couple months ago to get it before I turn 26 and doctors gatekeep it. I'm scheduled for it in May.",
            "title_similarity": "0.5433427",
            "sentiment_compound": -0.6239
        },
        {
            "id": "gw8l445",
            "score": 1,
            "text": "My mother refused to vaccinate her other children with Gardasil because she didn't want to encourage sexual activity. Utter stupidity from a southern baptist conservative. Thankfully I think she's calmed down a little since..",
            "title_similarity": "0.37804323",
            "sentiment_compound": -0.4436
        },
        {
            "id": "gw8l5i1",
            "score": 1,
            "text": "I know I got my son vaccinated as early as possible .... not even sure he was aware at the time what the vaccine was for. Glad I did it.  Not sure many parents know this is for boys and girls.",
            "title_similarity": "0.6183869",
            "sentiment_compound": 0.0196
        },
        {
            "id": "gw8liuk",
            "score": 1,
            "text": "My doctor brought it up impromptu last year said it could reduce the risk of cancer. Am male. Good doc.",
            "title_similarity": "0.6930026",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gw8mkh7",
            "score": 1,
            "text": "and i’m sure the marketing for these vaccines were for men too..oh wait",
            "title_similarity": "0.55117506",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gw8nj2b",
            "score": 1,
            "text": "So I got two of my 3 shots but then covid happened. My doctor was reluctant to give me the shot in the first place... Any doctors here know if I can just restart or just finish it up??",
            "title_similarity": "0.48408073",
            "sentiment_compound": -0.4329
        },
        {
            "id": "gw8nm4y",
            "score": 1,
            "text": "Even if you are 26 get the Vax!",
            "title_similarity": "0.3941051",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8nnrt",
            "score": 1,
            "text": "because no one is pushing it as standard protocol.",
            "title_similarity": "0.016325936",
            "sentiment_compound": -0.296
        },
        {
            "id": "gw8nrz0",
            "score": 1,
            "text": "16% of men have gotten the newly approved for men vaccine that was initially only for women? go figure",
            "title_similarity": "0.82889795",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gw8oa3g",
            "score": 1,
            "text": "My pediatrician recommended Gardasil when I turned 13, didn't realize that that few men around my age  actually got it.",
            "title_similarity": "0.61521465",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw8owoa",
            "score": 1,
            "text": "I refused the vaccine at age 14 or 15 because the lady said something about \"you should get it if you're going to have sex with men\" and at the time I didn't want my mom knowing I was gay, so I said hell no.\n\nVery cool!",
            "title_similarity": "0.5291598",
            "sentiment_compound": -0.7171
        },
        {
            "id": "gw8p9v9",
            "score": 1,
            "text": "I should ask my doctor about this.",
            "title_similarity": "0.13959098",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8pav9",
            "score": 1,
            "text": "i got recommended the hpv vaccine only because i stated i was bisexual to my doctor. now that i think about it i dont even remember if i got it. i think i showed up at the place but there were only women there, so i asked the person vaccinating if i could have the vaccine but got told that it was only for women",
            "title_similarity": "0.53341484",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gw8pplx",
            "score": 1,
            "text": "My dad just got done beating this cancer this year! The vaccine wasn’t around when he was younger",
            "title_similarity": "0.68474865",
            "sentiment_compound": -0.8605
        },
        {
            "id": "gw8q9uy",
            "score": 1,
            "text": "I didn't even know that man *could* get the vaccine.",
            "title_similarity": "0.42800823",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8qls5",
            "score": 1,
            "text": "I remember when they came to my school and gave it to all the girls but not a single boy got it. I never even knew men could receive the vaccine until this year.",
            "title_similarity": "0.5670583",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8r1t3",
            "score": 1,
            "text": "I mean, there was never a drive to get men vaccinated against it... the entire public health initiative when it was released was directed at women.",
            "title_similarity": "0.42798185",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8rqtd",
            "score": 1,
            "text": "Men should also get it because it reduces transmission to their sexual partners... which is all doctors try to vaccinate men (boys) as well.. unless they aren’t following well-established guidelines.",
            "title_similarity": "0.55472577",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gw8sack",
            "score": 1,
            "text": "I got this in high school",
            "title_similarity": "0.14561015",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8sd3l",
            "score": 1,
            "text": "And you get crucified by physicians if you ask for this vaccine. Especially because I am over 40. The doctor I was seeing flat out said no. Changed doctors.",
            "title_similarity": "0.62208116",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8snkq",
            "score": 1,
            "text": "I never understood why they weren't promoting this vaccine for all sexes from the beginning.",
            "title_similarity": "0.47956312",
            "sentiment_compound": -0.2755
        },
        {
            "id": "gw8srdv",
            "score": 1,
            "text": "My Dr straight up said, no need to have the vaccine, just wear protection and you're fine.",
            "title_similarity": "0.28696558",
            "sentiment_compound": 0.128
        },
        {
            "id": "gw8tdql",
            "score": 1,
            "text": "I know this isn't typically the place for questions, but does someone know if it is bad for you to receive one dose of the HPV vaccine and not the other?\n\nShortly after the pandemic started, I took my little nephew to get his shots for school and they let him get the HPV shot also and requested we return in six months for the next dose. Not long after that his mom took him away (she has legal custody but before that he was living with my parents) and she's...kind of anti-vax. So he didn't get the second shot.",
            "title_similarity": "0.62005186",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gw8thog",
            "score": 1,
            "text": "I was under the impression it is relatively new? I know I hear about it maybe 15 years ago? It was too late for the posted range.\n\nI'm sure the trend will go down, hopefully, as more and more get the vaccine.",
            "title_similarity": "0.5478466",
            "sentiment_compound": 0.7399
        },
        {
            "id": "gw8tlpr",
            "score": 1,
            "text": "Thank you so much for this. I'm sure as hell gonna spread the word",
            "title_similarity": "0.1480599",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gw8tta6",
            "score": 1,
            "text": "Got this shot for my 13 year old son a few weeks ago. So glad he will be protected.",
            "title_similarity": "0.550471",
            "sentiment_compound": 0.7761
        },
        {
            "id": "gw8txoo",
            "score": 1,
            "text": "Like should I get it now at the age of 29?",
            "title_similarity": "0.09520749",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw8tzi1",
            "score": 1,
            "text": "My Paediatrician refused to continue serving teen boys who wouldn’t get the HPV vaccine at the same age when it was offered to teen girls at local schools. She made local headlines for it, but her logic made entire sense. It is frankly stupid how it isn’t as encouraged for males",
            "title_similarity": "0.5512416",
            "sentiment_compound": -0.4497
        },
        {
            "id": "gw8u7ly",
            "score": 1,
            "text": "Well, as someone who got HPV in their late 20s (35now) I am pretty pissed.",
            "title_similarity": "0.53275913",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gw8uiqh",
            "score": 1,
            "text": "Is this only for young people? I am 38 and single. I’m reading conflicting things online.",
            "title_similarity": "0.39258212",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gw8vbr2",
            "score": 1,
            "text": "while this may be true it's a bit misleading us to the reasons. my daughter is now 24 and when she was a teenager gardasil was new and not allowed to be given to boys.  so the primary reason is it wasn't initially approved for use for the age group this is talking about.",
            "title_similarity": "0.39554554",
            "sentiment_compound": -0.3031
        },
        {
            "id": "gw8vgti",
            "score": 1,
            "text": "I was a 21 year old male when this was released. I asked my doctor about it and I was basically told it wasn’t for me. The countries that have adopted this as standard practice have seen incidences of certain cancers drop and were in the early stages. As the vaccinated get older I hypothesize we’ll see more protection.",
            "title_similarity": "0.7313993",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8w7vu",
            "score": 1,
            "text": "Reading some of these comments and Im surprised at how few men have gotten this shot. My mom made me get all kinds of preventative vaccines when I was young and this one was one of them. That was about 10 years.\nThanks mum!",
            "title_similarity": "0.6962942",
            "sentiment_compound": 0.6239
        },
        {
            "id": "gw8wdjk",
            "score": 1,
            "text": "Every time i see a tung about hpv, i'm thinking i shoyld get the vaccine and everytime i go to the doctor i forget about it.",
            "title_similarity": "0.5052351",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gw8wk8p",
            "score": 1,
            "text": "In my country I believe it was a mandatory vaccine in like year 8, I remember getting a whole bunch about then.",
            "title_similarity": "0.5763136",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gw8wncf",
            "score": 1,
            "text": "I got offered it in the Canadian military in like 2015 and i took it just in case. Most because they said i could potentially get it and be a carrier.",
            "title_similarity": "0.38603044",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw8x0ug",
            "score": 1,
            "text": "I finished my EMT certifications at 20(M), as part of licensing I had to verify that I wars update on all my vaccinations and booster shots. The HPV Vaccine was  recommended to me at that time by my doctor, but it would have cost me over $400 out of pocket to get it. Even with my with my insurance. EMT’s in my area (starting out) only my make $10-$13 an hour with private companies. So even though I was aware of the issue, and was happy to be vaccinated against another transmittable disease, I just could not afford to do so. This was my first personal example of the issues with the American Healthcare System. From my understanding, female students were charged a fraction of price for the same vaccine. You would think that it would be beneficial to vaccinate an entire species against a disease. Not just the gender that people believe are directly affected, but the carriers of the virus as well.",
            "title_similarity": "0.71138847",
            "sentiment_compound": 0.8201
        },
        {
            "id": "gw8x4z2",
            "score": 1,
            "text": "It has been given to boys in Australia for years. All 3 of my younger brothers have had it, the last one got it as part of his regular teenage vaccinations.",
            "title_similarity": "0.5953078",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8xldx",
            "score": 1,
            "text": "Stage IV Orapharyngeal (throat) cancer surviver. After 35 radiation treatments, 6 weeks of chemo, a feeding tube, a chest port, and like 5 surgical procedures I asked one of the docs: \"What's the most painful cancer to treat?\" Her answer: \"Throat cancer.\" It was super rough. Boys need the vaccine.",
            "title_similarity": "0.72926843",
            "sentiment_compound": -0.8615
        },
        {
            "id": "gw8yfgd",
            "score": 1,
            "text": "This article does not say how many people develop oropharyngeal cancer caused by HPV, the one fact I hoped it would provide.  But from a little research it looks like it’s about 1 in 20,000.",
            "title_similarity": "0.7429683",
            "sentiment_compound": 0.3291
        },
        {
            "id": "gw8z0p0",
            "score": 1,
            "text": "Hold up.  The vaccine is for men too?!?  All the marketing I’ve seen for it is women specific.",
            "title_similarity": "0.6209888",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8z0qc",
            "score": 1,
            "text": "In a lot of countries in Europe, boys were (still are) discriminated against. Only girls get the vaccine.",
            "title_similarity": "0.60887355",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8z6r9",
            "score": 1,
            "text": "Yup, had my son as well as my daughter vaccinated against HPV for just this reason. Surprised that people have not heard this.",
            "title_similarity": "0.5620608",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gw8zieg",
            "score": 1,
            "text": "I wish I had known there was an HPV vaccine and I would have gotten it. It's too late for me, I caught, I used to sleep around a lot back when I looked good.",
            "title_similarity": "0.55789423",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gw8zqas",
            "score": 1,
            "text": "35 year man here. I've never heard of any of this before.",
            "title_similarity": "0.4023201",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw8zs2h",
            "score": 1,
            "text": "I'm a girl. Mom never vaccinated me for HPV because, as she said, she 'didnt expect me to have sex'... Also I'm assuming it was money issue. Tho she did vaccinate my sister... I guess they have history of ceevical issues as far as I know - I'm adopted.",
            "title_similarity": "0.4420055",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw901se",
            "score": 1,
            "text": "Nobody ever told me the HPV vaccine had any health benefits for me. My nurse gave me a dirty look when I asked her how I could get cervical cancer. Great.",
            "title_similarity": "0.5978899",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gw90ady",
            "score": 1,
            "text": "Nobody told me about this, even after I had an HPV wart removed from my uvula. Weird.",
            "title_similarity": "0.43768",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gw90wk3",
            "score": 1,
            "text": "I’m female but fyi, planned parenthood has hpv vaccines for all!!",
            "title_similarity": "0.5303037",
            "sentiment_compound": 0.4184
        },
        {
            "id": "gw90zsu",
            "score": 1,
            "text": "I was 16 (male) when the vaccine came out and every doctor always said it was for women only. I wonder if my current doctor will have the same take on the whole thing considering I would prefer to get vaccinated to avoid strains. But I’m sure they’ll probably say I already have had a strain most likely and it won’t matter.",
            "title_similarity": "0.61682934",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gw9190r",
            "score": 1,
            "text": "Just presented at a research symposium on this very topic! To be fair, the effectiveness of the HPV vaccine at preventing OPC is still being investigated, though it is believed to be effective.",
            "title_similarity": "0.49092847",
            "sentiment_compound": 0.68
        },
        {
            "id": "gw91i63",
            "score": 1,
            "text": "Also a big class action lawsuit against it",
            "title_similarity": "0.27816886",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gw91iel",
            "score": 1,
            "text": "The HPV vaccine is for everyone and like every other vaccine, it should be mandatory. The idea that “only women get cancer from it so men don’t need it” is as absurd as thinking receiving the rona vax is only to protect one’s self and not for the good of society.",
            "title_similarity": "0.5998025",
            "sentiment_compound": -0.3412
        },
        {
            "id": "gw91j5v",
            "score": 1,
            "text": "It is good to get the vaccine but it does not protect against all HPV viruses which cause CA. Use protection, people.",
            "title_similarity": "0.45239785",
            "sentiment_compound": -0.2086
        },
        {
            "id": "gw91jdw",
            "score": 1,
            "text": "Wow, that’s powerful.",
            "title_similarity": "-0.060194876",
            "sentiment_compound": 0.765
        },
        {
            "id": "gw92xiy",
            "score": 1,
            "text": "Probably too late, but i got these shots a long time ago. It's a simple 3 shot program done over 6 months. I got a sore arm but nothing near as bad as the pfizer coronavirus vaccine.\n\nGo get the shots if you get the opportunity.",
            "title_similarity": "0.69829166",
            "sentiment_compound": 0.6399
        },
        {
            "id": "gw937r9",
            "score": 1,
            "text": "I know someone who has this exact cancer.\n\nAccording to a few studies he has read, making the HPV vaccine available to all is a public health win that will save billions for any country that implements it.",
            "title_similarity": "0.7014283",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gw93lae",
            "score": 1,
            "text": "EVERYONE needs this vaccine!\n\nI was told I was \"too old\" in my mid 20s to get it when it first came out. \n\nAt 30 they found cancerous cells on my cervix caused by a HPV. I had to have cryotherapy to literally freeze off a layer of my cervix to stop it. It was not a pleasant experience. I went through all that and it's very possible that a vaccination could have prevented it. I'm lucky they caught it.\n\nSide note: GET YOUR YEARLY PAPS!",
            "title_similarity": "0.7378852",
            "sentiment_compound": -0.3369
        },
        {
            "id": "gw93o8o",
            "score": 1,
            "text": "I want the vaccine but I'm 57 and no one will give it to me. I know the odds are that I already have it, but what harm can the vaccine do to me? Why can't I get it? No will give me a clear answer.",
            "title_similarity": "0.4781608",
            "sentiment_compound": -0.7998
        },
        {
            "id": "gw93q2s",
            "score": 1,
            "text": "When I was a teenager I got it and my brother didn’t because “boys can’t get cervical cancer”",
            "title_similarity": "0.59953856",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw93zmn",
            "score": 1,
            "text": "Huh, came here to disagree after a few run ins I've had with people trying to bully certain groups into pursuing unnecessary medical procedures out of misguided albeit good intentions. But this is actually quite compelling evidence. Wasn't aware of the new study, thank you. Always embarrassing to catch myself walking into something scientific with a bias and find myself wrong.",
            "title_similarity": "0.44788593",
            "sentiment_compound": -0.5439
        },
        {
            "id": "gw956v3",
            "score": 1,
            "text": "Because nobody cares about men",
            "title_similarity": "0.10019794",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gw95hgu",
            "score": 1,
            "text": "As an older guy who lived in the care free and pre-AIDS era, I can tell you that I have so many friends with throat cancer.  Get that vaccine asap.",
            "title_similarity": "0.6763366",
            "sentiment_compound": 0.6682
        },
        {
            "id": "gw95xnx",
            "score": 1,
            "text": "My son is 21, went to his pediatrician until graduating from high school. She recommended the 2 HPV vaccine shots when he was in middle school, I think he was 12. Done and done.",
            "title_similarity": "0.6398468",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gw98b9j",
            "score": 1,
            "text": "The vaccine was only made mandatory in 2006 so the post is a little bit misleading. I’m sure numbers have gone up since it was officially endorsed by that AMA.",
            "title_similarity": "0.62384844",
            "sentiment_compound": 0.2911
        },
        {
            "id": "gw98fnr",
            "score": 1,
            "text": "I am a head and neck cancer surgeon who treats HPV-related oropharyngeal cancer. HPV vaccination is my favorite soapbox. Please please please get yourself and your loved ones vaccinated! I’m looking forward to my early retirement as smoking rates plummet and HPV vaccination skyrockets.",
            "title_similarity": "0.62574136",
            "sentiment_compound": 0.5093
        },
        {
            "id": "gw98huv",
            "score": 1,
            "text": "Had a very nasty battle with head and neck cancer caused by HPV. Willing to answer any questions about it you could have.",
            "title_similarity": "0.63271457",
            "sentiment_compound": -0.9036
        },
        {
            "id": "gw98tls",
            "score": 1,
            "text": "I really need to get my medical records in order. Not sure if I was vaccinated for this.",
            "title_similarity": "0.2769319",
            "sentiment_compound": -0.2411
        },
        {
            "id": "gw993w3",
            "score": 1,
            "text": "Do we really need it? I think 8 in 100000 get it. 1 in 15300 is the likely hood of getting struck by lightning in 80 year lifetime?",
            "title_similarity": "0.52814066",
            "sentiment_compound": -0.3313
        },
        {
            "id": "gw9a8wh",
            "score": 1,
            "text": "I wanted this vaccine, was told it was only for women.",
            "title_similarity": "0.35548306",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw9aai1",
            "score": 1,
            "text": "it’s because facebook and stuff is telling people it will kill you",
            "title_similarity": "0.34238815",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gw9addk",
            "score": 1,
            "text": "Can you get the vaccine if you are 46?",
            "title_similarity": "0.39902493",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw9ap3b",
            "score": 1,
            "text": "Literally every woman (10) I’ve been with has had HPV. I guess it could’ve been me who gave it to them. But apparently 80% of people have had it for a long time at least one?\nWaiting for my throat cancer diagnosis any day now.",
            "title_similarity": "0.7757839",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gw9bjxm",
            "score": 1,
            "text": "If you’re on your 30s, is it too late to get the vaccine?",
            "title_similarity": "0.47753674",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw9bo7c",
            "score": 1,
            "text": "If you got the vaccine as a teen do you need to get it again?",
            "title_similarity": "0.4029292",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw9brkn",
            "score": 1,
            "text": "We saw a man pass away in his late forties from this very thing. Nice person with two young kids. Terrible illness that is now avoidable. Please vaccinate!",
            "title_similarity": "0.6112219",
            "sentiment_compound": -0.1812
        },
        {
            "id": "gw9bt17",
            "score": 1,
            "text": "In Canada not only is the vaccine free for girls, but it's required to attend school.\n\nBoys/men have to pay for it if they want it. Not many do.",
            "title_similarity": "0.50644904",
            "sentiment_compound": 0.25
        },
        {
            "id": "gw9bwjh",
            "score": 1,
            "text": "Got the vaccine for my son when he was 12.",
            "title_similarity": "0.58030486",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw9c4ne",
            "score": 1,
            "text": "My son had his vaccination when he was 12.",
            "title_similarity": "0.52061427",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw9cc3m",
            "score": 1,
            "text": "Is there a screening for this type of cancer? I've never been vaccinated and I'm concerned",
            "title_similarity": "0.48150057",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gw9cqxo",
            "score": 1,
            "text": "Cancer nurse here, cervical cancer is the worst. You don’t know you have it until it’s too late. It’s a slow painful death. Please.  Get the vaccine. Please.",
            "title_similarity": "0.6182569",
            "sentiment_compound": -0.9524
        },
        {
            "id": "gw9dcrf",
            "score": 1,
            "text": "I'll just say, in school it was marketed towards and only available to the girls",
            "title_similarity": "0.16350088",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw9di9p",
            "score": 1,
            "text": "I asked about the HPV vaccine a few years ago (mid twenties), they told me I was too old for it.  \n\nGo get it ASAP. Even if you think you'll never be sexually active.",
            "title_similarity": "0.63972896",
            "sentiment_compound": -0.3089
        },
        {
            "id": "gw9dp1b",
            "score": 1,
            "text": "Got my third shot a week ago at the pharmacy, and it was all covered by insurance so if you wanna check to see if your insurance covers it you can just call/walk into your local pharmacy.\n\nI’m in the USA*",
            "title_similarity": "0.572349",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw9ebcv",
            "score": 1,
            "text": "My son got the gardisil shots",
            "title_similarity": "0.3109362",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw9ep9q",
            "score": 1,
            "text": "Male privilege amirite?",
            "title_similarity": "0.2042245",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gw9gi6o",
            "score": 1,
            "text": "I received an HPV vaccine as a teenager. They told me it was so I wouldn't ever give it to a female partner and cause cancer/reproductive issues.\n\nThe doctor said anything about it preventing oropharyngeal cancer in men.",
            "title_similarity": "0.64894074",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gw9hmi9",
            "score": 1,
            "text": "And that is why I got my vaccine",
            "title_similarity": "0.24116725",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw9hoer",
            "score": 1,
            "text": "Realistically only ~5% of men need to get an HPV vaccine.",
            "title_similarity": "0.69273007",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw9iby8",
            "score": 1,
            "text": "Not only did I not know about the male vaccine I didn't know you could be \"too old\" to get a vaccine.",
            "title_similarity": "0.5749911",
            "sentiment_compound": 0.0
        },
        {
            "id": "gw9ih3q",
            "score": 1,
            "text": "After 21 years in a monogamous marriage I got divorced. I asked my doctor about the HPV vaccine and he said I should get it if I was going to sleep around. Maybe a little nicer than that. So I got the shots. So glad I did. Thankfully my insurance covered it without any hassle.",
            "title_similarity": "0.633276",
            "sentiment_compound": 0.8509
        },
        {
            "id": "gw9ionq",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.10487377"
        },
        {
            "id": "gw9o6my",
            "score": 2,
            "text": "Yep, and prostate cancer is just as common as breast cancer,\\* but is funded to a fraction of the same amount.\\*\\* \n\nIt's okay, though, men also make up 75% of the homeless population and receive effectively nothing in terms of support for domestic violence in spite of (very) conservative estimates stating men make up 20%+ of victims. \n\nOh, and women get custody of the kids 90% of the time.\n\nWelcome to the 21st century, where we've replaced disadvantaging women with disadvantaging men and call it 'equality'. And those of us who mention this are immediately vilified and called misogynists not because we want women to suffer (we don't), but because we want our needs to be taken seriously, too. \n\n\\* *1 in 8 men will be diagnosed with prostate cancer in his life, the same frequency at which women get breast cancer*   \n\\* *in 2018, the National Cancer Institute funded prostate cancer research to the tune of $239 million and breast cancer to the tune of $575 million; in 2017, Prostate Cancer Canada raised $15 million in funding, while just the CIBC Run for the Cure alone raised more ($17 million) for breast cancer*",
            "title_similarity": "0.82590556",
            "sentiment_compound": -0.9963
        },
        {
            "id": "gw9ocza",
            "score": 1,
            "text": "Socialised medicine works. Every high school aged child (male or female) now gets the HPV vaccine for free in Australia.",
            "title_similarity": "0.58128756",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gw9taj7",
            "score": 1,
            "text": "I got the vaccine when I was 23 or so. Hope there is more awareness about this.",
            "title_similarity": "0.42689586",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gw9v8jp",
            "score": 1,
            "text": "How is there a vaccine for cancer? If a vaccine is possible for this cancer, what about the others?",
            "title_similarity": "0.54985297",
            "sentiment_compound": -0.9003
        },
        {
            "id": "gw9ynml",
            "score": 1,
            "text": "This is crazy to me as in Canada you aren’t allowed to attend school unless you receive the vaccine in grade 7.",
            "title_similarity": "0.4544351",
            "sentiment_compound": -0.34
        },
        {
            "id": "gw9zz8r",
            "score": 1,
            "text": "HPV is GENITAL WORTS for those interested",
            "title_similarity": "0.27060813",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwa34pr",
            "score": 1,
            "text": "First doctor visit in 10 years last year I asked about getting it. \"Well you're over 26 so you have to get ask your insurance if you can get it.\" I'm sorry I didn't know there was an age that you could not get the cancer after wow, guess I'm safe forever.",
            "title_similarity": "0.6698005",
            "sentiment_compound": 0.9004
        },
        {
            "id": "gwa6oev",
            "score": 1,
            "text": "I once asked to get the hpv vaccine and was told I wasn’t allowed to receive it because they only give it to women. At Kaiser.",
            "title_similarity": "0.5033746",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwabk98",
            "score": 1,
            "text": "Just like prostate cancer kills more men than breast cancer kills women, but gets a small fraction of the donations and research money. Men and boys are not prioritized in our healthcare systems like women are.",
            "title_similarity": "0.77500045",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gwafib1",
            "score": 1,
            "text": "I shadowed a family doc once (pre-med in undergrad). Several parents had come in with their young sons for check ups, and even specifically asked about the vaccine. The doctor told them to forget about it, since HPV prevention was just for women, and men are just carriers.\n\nI didn't know at the time that HPV also posed a risk to men, but the logic made me so mad regardless.",
            "title_similarity": "0.63600415",
            "sentiment_compound": -0.826
        },
        {
            "id": "gwah2on",
            "score": 1,
            "text": "I asked my doctor for this because I have a pretty risky personal life, virus transmission wise, but he asked my age and number of partners and then said 'yeah, you probably already have it, we won't give you the vaccine'\n\nhello cancer 20 years from now.",
            "title_similarity": "0.6611593",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwan0ak",
            "score": 1,
            "text": "About the HPV vaccine [cdc info sheet](https://www.cdc.gov/hpv/parents/vaccine.html)\n\nInfo regarding men and the vaccine [uofm health](https://labblog.uofmhealth.org/rounds/few-young-adult-men-have-gotten-hpv-vaccine)\n\nIt is Recommended you receive it either ages 11-25, or after 45.  it is less effective by half outside of that age range.  Also, most adults have been exposed to the virus by adulthood.  BUT it’s recommended you talk with your doctor.\n\nThe hpv vaccine is responsible for reducing cervical cancer by half in the age population that has had access to it, and more recent research is showing the connection to throat cancer in men.",
            "title_similarity": "0.76969385",
            "sentiment_compound": -0.8358
        },
        {
            "id": "gwaqi69",
            "score": 1,
            "text": "yeah take a look at he  Gardasil  hpv vaccine . Risk outweighs the outcome?",
            "title_similarity": "0.5178742",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gwazst7",
            "score": 1,
            "text": "Fun fact: there is no approved HPV test for men",
            "title_similarity": "0.43269584",
            "sentiment_compound": 0.2425
        },
        {
            "id": "gwba64e",
            "score": 1,
            "text": "Thank God in the UK they now started vaccinating all young boys for HPV!!!",
            "title_similarity": "0.5910274",
            "sentiment_compound": 0.6679
        },
        {
            "id": "hfyybf1",
            "score": 1,
            "text": "Inovio will do wonders with its effective therapeutic vaccine against HPV when it gets approval.",
            "title_similarity": "0.48248452",
            "sentiment_compound": 0.7351
        }
    ]
}