{
    "Immigrants act more as job creators than job takers: Researchers found that immigrants not only expand labor supply as workers but also expand labor demand as founders of firms, and do so at much higher rates than their native-born counterparts.\n": [
        {
            "id": "gwaapsk",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.4049285",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gwako3y",
            "score": 10,
            "text": "Several studies have shown this is the case. Economic theory shows this to be the case. People will still be against immigration though and repeat the lie that it worsens the economy.",
            "title_similarity": "0.4725647",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwal2mg",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwapbw0",
            "score": -2,
            "text": "I know people who use other people's name to open a business, all this to shutdown after a year to avoid paying taxes as the owner can't be found anymore (they \"sell their identity\" before moving back the origin country) and are not amounts that would trigger any international body to investigate. Are those people messing up with the statistics?",
            "title_similarity": "0.34345967",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwak5ul",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwaltmj",
            "score": 12,
            "text": "Alexis Ohanian, co-founder of Reddit, was born to a German mother, Anke (*née* Prigge), and an Armenian father, Chris Ohanian. His grandparents came to the US as refugees after the Armenian Genoside ([https://en.wikipedia.org/wiki/Alexis\\_Ohanian](https://en.wikipedia.org/wiki/Alexis_Ohanian)). \n\n31% of venture capital backed founders are immigrants, compared to 25% of entrepreneurs generally. 60% of the most highly valued U.S. tech companies were founded by first or second generation Americans, accounting for 1.9 million employees ([https://nvca.org/wp-content/uploads/2021/03/NVCA\\_Visa\\_Reforms\\_book\\_FINAL.pdf](https://nvca.org/wp-content/uploads/2021/03/NVCA_Visa_Reforms_book_FINAL.pdf)). \n\nImmigrants founded or lead about half of most-funded US unicorns ([https://news.crunchbase.com/news/immigrants-founded-or-lead-about-half-of-most-funded-us-unicorns/](https://news.crunchbase.com/news/immigrants-founded-or-lead-about-half-of-most-funded-us-unicorns/)).\n\nIf not immigrants and the developed startup ecosystem in the United States, would the world be so technologically developed as it is today?",
            "title_similarity": "0.55350935",
            "sentiment_compound": 0.7485
        },
        {
            "id": "gwalzok",
            "score": 20,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwak8ot",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwawgxn",
            "score": 25,
            "text": "Mcdonalds.. during a pandemic, still had a net profit of 4.73 billion dollars in 2020. \n\nLove how they manage to use misdirection at get  everyone pissed at immigrants who take low wage jobs, and not at the corporations who keep wages low.  \n\n\nEverytime someone mentions a 15 dollar minimum wage there is invariably someone who will argue about some \"Burger Flipper making as much as an EMT or a Teacher!\"    In disgust....at the Burger Flipper, but not the industries paying said EMT's or Teachers. \n\nIt's quite amazing how the corporations managed to condition an entire society to think this way. True study in psychology.",
            "title_similarity": "0.56620073",
            "sentiment_compound": 0.8684
        },
        {
            "id": "gwak0i7",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.112054214"
        },
        {
            "id": "gwakpc8",
            "score": -39,
            "text": "There's literally government incentives that make it much easier to start a business when you've no history of credit and the like. Immigrants come first here.",
            "title_similarity": "0.6987507",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gwak3wv",
            "score": 25,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwaltk5",
            "score": 29,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwambk4",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwat03v",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwanbwt",
            "score": 39,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwao9mv",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwbm988",
            "score": 0,
            "text": "America has an aging population. If we are going to have anyone paying taxes to support social security and Medicare in the future, we need more immigration, not less.\n\nImmigrants aren’t taking your jobs. In fact, there is a good chance your job exists because of immigration.",
            "title_similarity": "0.6706724",
            "sentiment_compound": 0.8402
        },
        {
            "id": "gwab2li",
            "score": -59,
            "text": "[deleted]",
            "title_similarity": "-0.112054214"
        },
        {
            "id": "gwair8v",
            "score": 4,
            "text": "Coming over here, founding our firms",
            "title_similarity": "0.47124225",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwan12n",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwb150l",
            "score": 1,
            "text": "I have a funny feeling this answer would not satisfy those who are yelling immigrants are taking their jobs",
            "title_similarity": "0.48704726",
            "sentiment_compound": 0.2311
        },
        {
            "id": "gwanchs",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwan5sj",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwamq6q",
            "score": 22,
            "text": "Seeing quite a few comments in here that suggest there are a lot of issues with immigration aside from job creation, e.g. lowering minimum wage. Having recently looked into the role evidence plays in immigration policy I can say this: it’s virtually impossible to say either way whether immigration has a significant effect on anything people claim it does. The effects of immigration are so complex that anyone with an ‘evidence-based’ view is naive or only looking at part of the picture. It largely boils down to ideology. I see immigration as a good thing, but others don’t.\n\nEdit: I should state my research was from a UK/European perspective, but I doubt the principles differ significantly",
            "title_similarity": "0.5536685",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gwalv3j",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwapitc",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwat880",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwayn81",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwaphmv",
            "score": 4,
            "text": "This makes sense.  Immigrants that actually get to the US represent people with a HIGH drive to succeed.  It's not easy to get to the US, so it follows that those that do get here have a higher than average drive to succeed.",
            "title_similarity": "0.8383756",
            "sentiment_compound": 0.6116
        },
        {
            "id": "gwau0ph",
            "score": 27,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwacvk7",
            "score": -38,
            "text": "A lot of countries give business grants and easy business loans to immigrants that aren't available to native-born people. So yes I could see the reason for it being higher.",
            "title_similarity": "0.78269595",
            "sentiment_compound": 0.8069
        },
        {
            "id": "gwaogtk",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwaojbb",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwb09pw",
            "score": 15,
            "text": "I don’t think anyone is debating that immigrants contribute to the economy in many ways. Immigrants are very much so welcome in the US. What is non contributory is illegal immigration. The title of this article is using mental gymnastics yet again to try and push radical left wing immigration narrative.",
            "title_similarity": "0.5962243",
            "sentiment_compound": 0.1521
        },
        {
            "id": "gwak98n",
            "score": 248,
            "text": "You have to differentiate between refugees and immigrants, between competitive labour market skills and welfare collection",
            "title_similarity": "0.41490865",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gwah81b",
            "score": -43,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwamlzt",
            "score": -20,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwasfof",
            "score": 46,
            "text": "A little differentiation would be nice. Immigrants are not a homogeneous group. There is the group of immigrants that have good education and qualification but are not happy with the situation in their home country and there is the group of immigrants with low or no education that just tries to escape in a \"wealthy\" country to take advantage of the social system. That's why you can't generally say \"immigrants are job creators\".",
            "title_similarity": "0.6174984",
            "sentiment_compound": 0.0523
        },
        {
            "id": "gwbh7hx",
            "score": -3,
            "text": "Let's face it. America will have NO future without immigrants. Citizens will just sit back, get unionized, enjoy the false sense of short-lived security while other countries overtake us and drive us into the gutter.\n\nThis also applies to other countries too. Without immigrants, China as one of the fastest growing economies faces severe population aging issue and this will have major devastating effect in the next 20 years.\n\nYeah so as much I don't believe it is the best idea to take in massive amount of refugee children during a pandemic but in general, these children represent (partly) the future and hope of the country.",
            "title_similarity": "0.62843233",
            "sentiment_compound": 0.6845
        },
        {
            "id": "gwbqnwl",
            "score": -2,
            "text": "Immigration and population growth are both objectively good for a country. Any nativist or isolationist nonsense is just fear and/or racism in action. No basis in logic or actual reality.",
            "title_similarity": "0.48559055",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gwaubg8",
            "score": 21,
            "text": "[deleted]",
            "title_similarity": "-0.112054214"
        },
        {
            "id": "gwakwlo",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "-0.112054214"
        },
        {
            "id": "gwapu9b",
            "score": 37,
            "text": "Legal or illegal? I didn't see it mentioned.",
            "title_similarity": "0.054010563",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwaw9e1",
            "score": 4,
            "text": "What about the us citizen unemployment numbers\n\nIs op going to address the unemployment numbers in this country",
            "title_similarity": "0.5233647",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gwb35nl",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwaokd3",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwaw62d",
            "score": 0,
            "text": "Anybody who has personal experience with immigrant communities has seen this, so it's nice to see citable data supporting what is extremely visible. Immigrants are driven and often need to create their own opportunities since the ones available to them are very limited when they arrive. Immigrants are already a self selected group who made the effort to emigrate in the first place.",
            "title_similarity": "0.59519017",
            "sentiment_compound": 0.8169
        },
        {
            "id": "gwal4za",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwaszvx",
            "score": -2,
            "text": "World's Definition of an  entrepreneur : a person who organizes and operates a business or businesses, taking on greater than normal financial risks in order to do so. \n\nThis is why immigrants flock to countries where they have the freedom to do this.\n\nUS corrupted definition, or what an American means when they say they are an  entrepreneur:  \"I am working to get rich.....\"",
            "title_similarity": "0.80413544",
            "sentiment_compound": 0.8481
        },
        {
            "id": "gwbdua1",
            "score": 3,
            "text": "I'm all for legal immigration obviously more people build the economy as long as it's not a free for all like it is right now.\n\nAlso not trying to be a jerk here but research also tends to tell people that a higher min wage, say $15 an hour would create jobs and help the economy also. Anybody who came up with that nonsense, or believes it couldn't possibly have ever held a real job in their lifetime. \n\nThere are literally companies all over America that go job site to job site evaluating the day to day of the average american worker just to report back to the company that hired them for their services to let them know how you can do this with the bare minimum amount of manpower and how much lower other companies are paying people to do the same exact thing.\n\nThe unfortunate truth is that all these massive corporations have came across really nice almost on cue when the pandemic hit but just like the people you vote for, or the people that I vote for, not one of them on this planet cares about you or me more than they care about the fuckin dollars.",
            "title_similarity": "0.7536874",
            "sentiment_compound": 0.9364
        },
        {
            "id": "gwbe94m",
            "score": 3,
            "text": "Yea the argument was never about legal immigrants. We've known for years that South East Asian immigrants have the highest household incomes in this country by far.",
            "title_similarity": "0.53779924",
            "sentiment_compound": -0.4348
        },
        {
            "id": "gwalhqs",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwb994e",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwak3ff",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwalism",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwar4ki",
            "score": -3,
            "text": "I saw a similar study some time ago and showed it to some of \"those kind\" of people I know on Facebook. It was pretty cut and dry that the vast majority of immigrants add a benefit to the US economy.  \n\n\nWhat I learned:  \n\\- People that hate immigrants don't have a fear of what effect they'll have on the country. They have a sense of \"they're going to steal from me personally,\" and that drives their anti-immigration views.  \n\\- These views are purely based on racism and preconceptions that people want to get into the US to scam the system and collect free benefits. In reality, immigrants are not eligible to receive any economic assistance.",
            "title_similarity": "0.56606793",
            "sentiment_compound": -0.4653
        },
        {
            "id": "gwb04ai",
            "score": 2,
            "text": "He would be interesting to segregate this research between documented and undocumented immigrants, to see how they might differ.",
            "title_similarity": "0.4063126",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwan4bf",
            "score": 5,
            "text": "Not in developing countries.",
            "title_similarity": "0.053832017",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwakduv",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwai6k0",
            "score": 95,
            "text": "Not to mention entry requirements in to the states is no an easy feat",
            "title_similarity": "0.36593905",
            "sentiment_compound": -0.5583
        },
        {
            "id": "gwb476b",
            "score": 5,
            "text": "“Immigrants” is a broad term",
            "title_similarity": "0.40118805",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwaxbz8",
            "score": 1,
            "text": "We’ve literally been reporting this since the 80s.",
            "title_similarity": "0.32045966",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwaxxg9",
            "score": 1,
            "text": "I’m an English white guy who lives in Texas, with a green card, I work for a mexican guy who is a citizen of the USA. There are people who always try to talk to me...they won’t acknowledge MY BOSS, ITS HIS COMPANY. This country is a bit fucked up.",
            "title_similarity": "0.39608976",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gwb4v5i",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.112054214"
        },
        {
            "id": "gwbeu0f",
            "score": 1,
            "text": "Companies will take more immigrants then, the reason people accuse them of taking jobs is because the companies pay immigrants less, then CHOOSE to hire ONLY immigrants, meaning they reduce costs while having little to no impact on profits. Has anyone who studies this BS used common sense before studying it??",
            "title_similarity": "0.65531266",
            "sentiment_compound": -0.1485
        },
        {
            "id": "gwbyqmh",
            "score": -1,
            "text": "FACT: Immigrants work for less. Companies know this. Have you ever seen an immigrant group striking for more money? No. They keep their mouths shut, heads down and labor away.",
            "title_similarity": "0.49198595",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwaol83",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwamihl",
            "score": 47,
            "text": "I wonder what impact sending money out of the local economy back to their native country has on this or if it is a minor aspect?",
            "title_similarity": "0.4408509",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwax0sb",
            "score": 4,
            "text": "I’m not sure why this is so hard to understand: immigration means growth of the population and in turn growth of the economy.  It’s simple supply and demand.  They increase supply of labor, lowering the cost of that labor class, enabling money to be reallocated to a different segment of the economy.  The effects cascade out.",
            "title_similarity": "0.83602643",
            "sentiment_compound": 0.2896
        },
        {
            "id": "gwapy2z",
            "score": 160,
            "text": "I would be interested to see how this breaks down between those who come to the country legally and those who do so illegally. My guess is that the conclusions would be different.",
            "title_similarity": "0.3382503",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gwanjch",
            "score": 53,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwako1e",
            "score": 212,
            "text": "But do they depress wages for unskilled labor?",
            "title_similarity": "0.4972617",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gwb6pqt",
            "score": 83,
            "text": "This is based on information only from 2005-2010.  Not only is it old, but it's a cherry picked time period that was unlike any time period we have ever seen.  There was this thing called the Great Recession that occurred.  Convenient that this study only focuses on that time.",
            "title_similarity": "0.44130987",
            "sentiment_compound": 0.4497
        },
        {
            "id": "gwc1trs",
            "score": 5,
            "text": "The information technology industry would disagree. I am competing with a bunch of H1B Indians and Chinese. What a load of bull, Disney got half of its workforce laid off and replaced with H1B - google it!",
            "title_similarity": "0.54097563",
            "sentiment_compound": -0.4389
        },
        {
            "id": "gwamuu5",
            "score": 1,
            "text": "How does emigration affect the economies of these countries?  If every rich native leaves, how does the home country fare?",
            "title_similarity": "0.59803164",
            "sentiment_compound": 0.6072
        },
        {
            "id": "gwaprgb",
            "score": 1,
            "text": "I mean every time we've accepted and integrated immigrants in america's past we've expanded our economy. Why would that change now?",
            "title_similarity": "0.8013061",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwaymjx",
            "score": -2,
            "text": "Stop creatin mah jobs!",
            "title_similarity": "0.14359865",
            "sentiment_compound": -0.3382
        },
        {
            "id": "gwb3qy5",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwb4w7a",
            "score": -3,
            "text": "OOF!  Right in the white supremacy.",
            "title_similarity": "0.17089882",
            "sentiment_compound": 0.126
        },
        {
            "id": "gwb5f0n",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwb6de3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwbdjbo",
            "score": 0,
            "text": "We know. Go tell the racists.",
            "title_similarity": "0.25233904",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwasld2",
            "score": 95,
            "text": "This is a little disingenuous, legal immigration countries can be more discerning who becomes citizens. This study would have been more helpful if it concentrated on ‘illegal immigration’ or whatever term you want to call it. I don’t care.\n\nWhat I find interesting is that the term “brain drain” does not have a negative connotation",
            "title_similarity": "0.4520386",
            "sentiment_compound": 0.9102
        },
        {
            "id": "gwal8bw",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwc4kwu",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwb2ksi",
            "score": 12,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwacw3f",
            "score": -40,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwb2q22",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwbt4rc",
            "score": 17,
            "text": "Yeah legal immigrants are very beneficial to American society",
            "title_similarity": "0.55397487",
            "sentiment_compound": 0.7089
        },
        {
            "id": "gwasihs",
            "score": 11,
            "text": "[https://www.kauffman.org/](https://www.kauffman.org/)\n\n[https://www.srf.org/our-mission-history/](https://www.srf.org/our-mission-history/)\n\n&#x200B;\n\nThe players involved.",
            "title_similarity": "0.26473182",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwax6me",
            "score": -2,
            "text": "I don't believe that immigrants are a problem and no one is arguing against them. It's unlicensed or unregulated immigration that's at the heart of the matter. Not that their goals are any different from legal immigrants but they obviously aren't included in this study and I would like to see how, or if, they change the numbers in any significant way.",
            "title_similarity": "0.41177747",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gwax9t8",
            "score": -4,
            "text": "The study is over 10 years old, takes place before both the economic crash and the refugee crisis in Europe. I don't think it holds any relevance anymore.",
            "title_similarity": "0.39286846",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gwayyxq",
            "score": -2,
            "text": "This is clearly talking about LEGAL immigrants. USA takes roughly 1 million annually. There is something special about someone willing to make a new life and chase the American dream. I would say the high text and medical degrees help these stats",
            "title_similarity": "0.6695818",
            "sentiment_compound": 0.8842
        },
        {
            "id": "gwbq21q",
            "score": 3,
            "text": "My mom is an immigrant. She has 20 employees on her payroll. She came to the US 20 years ago with nothing and really built the community around her business.",
            "title_similarity": "0.4152453",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwc19re",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwav4qd",
            "score": 8,
            "text": "[deleted]",
            "title_similarity": "-0.112054214"
        },
        {
            "id": "gwbkts9",
            "score": 8,
            "text": "And this is why being pro LEGAL immigration is a good thing.",
            "title_similarity": "0.44768015",
            "sentiment_compound": 0.6289
        },
        {
            "id": "gwapa31",
            "score": -2,
            "text": "As an immigrant... let’s gooooo!!!",
            "title_similarity": "0.3790311",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwavcld",
            "score": 0,
            "text": "Californians know this.",
            "title_similarity": "0.23833087",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwavld1",
            "score": 0,
            "text": "For what I didn't see searching a bit (I don't have access to the study), here are the possible limits of this study :\n\n-The study is based only on data of 2007 AND 2012. Why 2 years only? How are they relevant? \n\n-The study does include illegal immigration? Probably no. \n\n-Did they acknowledge the Uber effect (appeared in 2009). And the massive increase of one man business? \n\n-Did they include Jeff besos in their study or did they excluded him? (1,298,000 employees in 2020 in USA)",
            "title_similarity": "0.5438104",
            "sentiment_compound": -0.6868
        },
        {
            "id": "gwavzhk",
            "score": 0,
            "text": "You mean people look for freedom and opportunity are a good thing?",
            "title_similarity": "0.3971942",
            "sentiment_compound": 0.872
        },
        {
            "id": "gwaz4by",
            "score": 0,
            "text": "The Truth is hard sometimes.",
            "title_similarity": "0.16205603",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gwb0k6k",
            "score": 0,
            "text": "Heres some science for you... the US has historically cut off immigration when the immigrant population reaches a a threshold of 20%. The historical amount of time that immigrantation has been 60 years and the last time it was shut down and opened up was 1920 and large scale immigration reopened in 1980 we are at the 20% threshold as of now. Immigration will stop to allow new immigrants to assimulate to the US population. We should consider opining the door again in 60 years.",
            "title_similarity": "0.42053396",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwb34e1",
            "score": 0,
            "text": "Hardly news. This has been widely known for a long time. Immigration has become a domestic political issue, in that it's used to motivate a base but if you look behind the curtain all the actual business interests behind the same party which uses immigration fear mongering in this way is actually highly in favor of more immigration.. It's just one of many contradictions manifesting amidst the civil strife.",
            "title_similarity": "0.5818347",
            "sentiment_compound": 0.3329
        },
        {
            "id": "gwb3akh",
            "score": 0,
            "text": "Who has a problem with legal immigrants?",
            "title_similarity": "0.33218047",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwb3d6d",
            "score": 0,
            "text": "Immigrants are a heterogeneous group in terms of their economic power and occupational skill level and family/social capital and along with the fact these figures show the status quo makes these studies unsuitable for supporting political arguments.\n\nA Lebanese doctor or a Taiwanese chip designer is going to have a different effect on job creation, wages, etc than a Honduran who works in a Mississippi chicken slaughterhouse for minimum wage and doesn’t speak English.\n\nOpinions on immigration policy is never just “more or less”, that’s a straw man.",
            "title_similarity": "0.49365377",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwb3nvl",
            "score": 0,
            "text": "Tell thats to those  Dirty French pigs!",
            "title_similarity": "0.15439874",
            "sentiment_compound": -0.4926
        },
        {
            "id": "gwb4979",
            "score": 0,
            "text": "Well yea because all of these so called immigrant founders of firms are simply just the top 1% of all of these poor countries and they want to be in the best country in the world of course.",
            "title_similarity": "0.6363924",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gwb4dx2",
            "score": 0,
            "text": "LEGALIZE THEM ALL - trumps twitter",
            "title_similarity": "0.2294147",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb6ebx",
            "score": 0,
            "text": "Interesting. My Dad is an immigrant and started his own buisness over 25 years ago. I should mention though that he came legally.",
            "title_similarity": "0.43356723",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gwb6gi1",
            "score": 0,
            "text": "So they terk err jerbs and err berznerz errpperrterniters!\n\nSeriously, though, EVERY wave of immigrants improves the country, overall.",
            "title_similarity": "0.73136795",
            "sentiment_compound": 0.3382
        },
        {
            "id": "gwb8f7d",
            "score": 0,
            "text": "So I guess my Mexican friend is right when we drive by his people who are sitting on the side of the road chowing down on some lunch tamales and  he says things like “that’s the foundation of America right there.”",
            "title_similarity": "0.28697547",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gwb8pbe",
            "score": 0,
            "text": "Most of my managers have been immigrants ngl",
            "title_similarity": "0.4809963",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbd2un",
            "score": 0,
            "text": "The result of america's constant dumbing down and disenfranchisement of it's own people. This is why ignorant bigots have immigrants. They can't stand seeing someone not both here doing something that they themselves can't.",
            "title_similarity": "0.50405514",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gwblxom",
            "score": 0,
            "text": "When the Canadian government has a bottomless pocket for immigrants to start business’ even without a proper business plan using the local populations tax dollars really does make it super easy for immigrants to start businesses. Especially when you Don’t have to save even a down payment to get your business started!",
            "title_similarity": "0.55481184",
            "sentiment_compound": 0.8832
        },
        {
            "id": "gwbo83c",
            "score": 0,
            "text": "Wait, are you saying that people who aren’t afraid to take the risk of moving to a new country with almost nothing are the type of people aren’t afraid to take the risk of opening a business? Get outta here",
            "title_similarity": "0.50006664",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gwbvfnn",
            "score": 0,
            "text": "That sounds great. What’s the science behind them coming here illegally and you changing the wording to “immigrants”?",
            "title_similarity": "0.4843201",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwbxnrp",
            "score": 0,
            "text": "Isn’t this an indictment on our country? The idea that people born here are less likely to become a job creator? We should import job creation, I am totally on board. How about fostering it from within as well?",
            "title_similarity": "0.57723856",
            "sentiment_compound": 0.5775
        },
        {
            "id": "gwc1u2y",
            "score": 0,
            "text": "Now Americans can shout \"immigrants, they take our businesses\"",
            "title_similarity": "0.54871106",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwc3cvd",
            "score": 0,
            "text": "If conservatives are against it.  You know all the arguments for why it’s bad are prob lies",
            "title_similarity": "0.24150813",
            "sentiment_compound": -0.8402
        },
        {
            "id": "gwcculo",
            "score": 0,
            "text": "If the study compared today's Americans to Native tribes then yes...",
            "title_similarity": "0.32507908",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwcd9yl",
            "score": 0,
            "text": "Must be why Biden is so keen on deporting their children",
            "title_similarity": "0.3700738",
            "sentiment_compound": 0.5009
        },
        {
            "id": "gwcdq7k",
            "score": 0,
            "text": "Now native Americans must be upset, but that title sounds racist. European invaders are more productive?!",
            "title_similarity": "0.45379242",
            "sentiment_compound": -0.8221
        },
        {
            "id": "gwce352",
            "score": 0,
            "text": "Next tome your pissed off that only make 20hr as a none union plumber lmk how you feel about immigration.",
            "title_similarity": "0.38687578",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gwcfuv2",
            "score": 0,
            "text": "Agreed. But they suppress wages of people here.",
            "title_similarity": "0.2234152",
            "sentiment_compound": 0.1406
        },
        {
            "id": "gwcipwm",
            "score": 0,
            "text": "I can only speak from experience but this makes a ton of sense to me. I underwrite business loans and at least half (if not more) of our applications are from immigrant citizens or permanent residents.",
            "title_similarity": "0.62230754",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwciua4",
            "score": 0,
            "text": "They dgaf about facts. Only feels.",
            "title_similarity": "0.08628186",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcj0bp",
            "score": 0,
            "text": "Important to Add : Study only applys to USA",
            "title_similarity": "0.20993453",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwcj3fc",
            "score": 0,
            "text": "America was founded by immigration. Well apart from the people that already lived there.",
            "title_similarity": "0.4134961",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwcj9h3",
            "score": 0,
            "text": "Yeah because they have hustle and local Americans are lazy",
            "title_similarity": "0.37945858",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gwckf27",
            "score": 0,
            "text": "We know, they know, everyone knows.\n\nThe whole point of being mean to immigrants is just performative bigotry to placate the ignorant.",
            "title_similarity": "0.39615354",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwckqwx",
            "score": 0,
            "text": "Thats great! I am a staunch conservative and I think that legal immigration should be much easier. In my eyes, the risk-taking immigrants represent the very essence of what it means to be American. Americans are pioneers. Less us versus them talk and more let's take risks together talk.",
            "title_similarity": "0.55684656",
            "sentiment_compound": 0.7452
        },
        {
            "id": "gwcl5ka",
            "score": 0,
            "text": "But they tukurjuuuubs",
            "title_similarity": "0.17206085",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcmt55",
            "score": 0,
            "text": "Also in the U.K. we are already feeling the impacts of brexit.  The hospitality industry is struggling for staff accross the board since people have moved back to Europe.  Immigrants are net contributors to an economy and are always welcome.",
            "title_similarity": "0.613178",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gwcnhvo",
            "score": 0,
            "text": "Well, this doesn’t reinforce my racist world view one bit.",
            "title_similarity": "0.14559129",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gwcno3x",
            "score": 0,
            "text": "No surprised by this at all.",
            "title_similarity": "0.09373285",
            "sentiment_compound": -0.1695
        },
        {
            "id": "gwcnply",
            "score": 0,
            "text": "I feel this is the kind of information you should *not* use in an argument with a hardcore ethnocentric nationalist as it'll make them even more afraid.\n\nI mean, immigrants are not only there to take away their jobs but they're *also* coming to have greater success by becoming business owners with employees of their own.\n\nAnd that employee might just possibly be them.\n\nI don't know man, I don't think their egos can handle that.",
            "title_similarity": "0.61989856",
            "sentiment_compound": 0.8201
        },
        {
            "id": "gwco97z",
            "score": 0,
            "text": "Immigrants with professional skills and/or higher education normally can't easily re-validate their diplomas to apply for jobs in their profession, hence they decide to create and grow businesses, and those businesses create employment opportunities for the locals.... (source: I did that)",
            "title_similarity": "0.6370053",
            "sentiment_compound": 0.5809
        },
        {
            "id": "gwcod61",
            "score": 0,
            "text": "Plus criminal levels is lower than natives. \n\nMy parents employ 6 people, have their own business and now own property. Not knowing English, they are what we call the American Dream.",
            "title_similarity": "0.43023178",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwcwmmy",
            "score": 0,
            "text": "Should check out Canada's requirements sometime.",
            "title_similarity": "0.13374385",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwdabva",
            "score": 0,
            "text": "This doesn’t correlate to mexican border jumpers.",
            "title_similarity": "0.13428813",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwan2p4",
            "score": 70,
            "text": "It's very important to note that this only pertains to the US, and that other places could see vastly different results.",
            "title_similarity": "0.31676406",
            "sentiment_compound": 0.2716
        },
        {
            "id": "gwano4d",
            "score": 575,
            "text": "This is interesting stuff, but I'm a little tired of the focus on job creation through starting companies. Jobs are created by demand. Every immigrant who comes here and wants to eat is already a job creator in the food industry, every one who wants to improve their English is already a potential job creator in teaching, etc etc.",
            "title_similarity": "0.61646116",
            "sentiment_compound": 0.6897
        },
        {
            "id": "gwapgc9",
            "score": -4,
            "text": "And, when it comes to undocumented immigrants, they pay more in taxes than they get back out of the system. Basically, all us documented people are being subsidized by the undocumented.",
            "title_similarity": "0.76928127",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwb8xu7",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwasmic",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.112054214"
        },
        {
            "id": "gwatfpe",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwav650",
            "score": 1,
            "text": "I won't say things are like they used to be, but generally the west abounds with opportunity compared to where many immigrants come from. And even if they come here with safety in mind.... opportunities are taken and produced citizens are made. \n\nImmigrants often hold true to 'American Ideals' far better than native born Americans.... at least in my experience.",
            "title_similarity": "0.7494339",
            "sentiment_compound": 0.9694
        },
        {
            "id": "gwavm2f",
            "score": 1,
            "text": "It's common knowledge that immigration is good for the economy. Even Japan is increasing immigration in the face of 30 years of economic stagnation.",
            "title_similarity": "0.6630613",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwawros",
            "score": 1,
            "text": "\"Nothing to lose\" or \"I can return to a safe(r) place\" are probably two heavy factors in this...",
            "title_similarity": "0.33519512",
            "sentiment_compound": 0.3089
        },
        {
            "id": "gwawvfv",
            "score": -1,
            "text": "This article doesn’t break down the size or success of these new businesses. In my area I see hundreds of terrible businesses with owners not even making minimum wage. Those are not a net positive.",
            "title_similarity": "0.5415514",
            "sentiment_compound": -0.3235
        },
        {
            "id": "gwaxis0",
            "score": -1,
            "text": "Yes yes yes, that’s obviously and near observable. The problem is with too many unskilled workers & a plethora of different kinds of “non-useful” people (interpret that how you’d like) coming into the country ILLEGALLY and having negative economic impacts & straining border resources....",
            "title_similarity": "0.5043435",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gwaxmys",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "-0.112054214"
        },
        {
            "id": "gway78u",
            "score": 1,
            "text": "From Good Economics for hard times (Excellent read by the way) “Migrants complement, rather than compete with, native labour as they are willing to perform tasks that natives are unwilling to carry out.\"\n\nThere also is a piece in the book that talks about how in areas where there is an influx of immigrants the native populations wage actually increased. I don’t remember the exact figure but I believe it was around 10-20% . They specified the with increase in immigrants local native people are often promoted to managers or other higher earning positions. Very cool info",
            "title_similarity": "0.8259714",
            "sentiment_compound": 0.9286
        },
        {
            "id": "gwaye9o",
            "score": 1,
            "text": "This has been a well known phenomenon for a long time. The Millionaire Next Door addressed this 30 years ago. The issue is with their children - they become Americanized and decide to spend a whole ton on luxury items. The parents allow it because they want their kids to have the “American Dream.” Unfortunately, immigrants aren’t usually able to sustain generational wealth due to their younger generations watching too much Kardashians.",
            "title_similarity": "0.6016649",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwaz878",
            "score": -1,
            "text": "Luckily the gop is impervious to your “facts” and “data”.",
            "title_similarity": "0.14837074",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gwazhol",
            "score": 1,
            "text": "Nobody knows how important it is to create jobs and hire people than literal immigrants themselves. Immigration is key to make sure countries with low birth rates like Canada, USA, UK, Australia survive!",
            "title_similarity": "0.61527276",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gwb1lu6",
            "score": 1,
            "text": "I recall this sentiment from a college course I took about 15 years ago. That immigrants are generally harder workers and contribute more to society when compared to native born peers. However, their children often have trouble navigating their identity as part native and part of a diaspora. That often time this split can create conflict. Thankfully there hasn’t been any anti-immigrant sentiment anywhere that could compound that issue.",
            "title_similarity": "0.6718041",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gwb3nze",
            "score": 1,
            "text": "The idea that labor supply would follow the laws of supply and demand in a straightforward, simplistic way was always ridiculous. \"Labor supply\" isn't a normal commodity, it's people! Adding more people to an area will increase demand for most or all goods and services in that area.",
            "title_similarity": "0.780532",
            "sentiment_compound": -0.3595
        },
        {
            "id": "gwb3shp",
            "score": 1,
            "text": "They’ve already risked everything. They’ve got nothing to lose. No fear. That’s what it takes to create jobs. No fear of loss.",
            "title_similarity": "0.44382155",
            "sentiment_compound": 0.6613
        },
        {
            "id": "gwb5ifv",
            "score": -1,
            "text": "We already knew that about legal immigrants.  The same is not true of those that come through illegally.  It's all about doing it the right way.  The US loves immigrants that come in the right way and contribute to society in the ways described in the study at issue.  Those who go through the process obviously stick to things and are more likely to stick to a business plan.",
            "title_similarity": "0.6258099",
            "sentiment_compound": 0.4344
        },
        {
            "id": "gwbbapd",
            "score": 1,
            "text": "Is anybody saying there should be no immigrants?!? This statement is not surprising and is hardly even a worthy discussion point. \n\nThat said, every country on the planet has rules that dictate when, how, and who is allowed to immigrate. America needs to massively overhaul its immigration plans, and develop resources to successfully address a steady inflow of immigrants through our southern border. \n\nHowever, America also has the same right as every other country to put limits on immigration, and to not take in every person who wants to be here. Just like every other country does.",
            "title_similarity": "0.40259418",
            "sentiment_compound": 0.7162
        },
        {
            "id": "gwbbf3w",
            "score": 1,
            "text": "I'm an immigrant (in Vietnam, at least) but I suspect this headline is a bit misleading. People that are concerned about immigration \"taking jobs\" tend to focus on illegal immigration or improper entrants, not on legitimate/regulated immigrants.\n\nUnregulated immigrants are much less likely to be \"job creators\" and are more likely to be unskilled and create labor competition in unskilled sectors; driving down wages.",
            "title_similarity": "0.6189214",
            "sentiment_compound": -0.8625
        },
        {
            "id": "gwbbpdq",
            "score": 1,
            "text": "Ah :) I love the confirmation bias that makes me feel good. \n\n&#x200B;\n\nI immigrated to the Netherlands, started an engineering firm with a friend and we have employed 3 Dutchies and one Italian that I love like my family. \n\n&#x200B;\n\nI'm very lucky.",
            "title_similarity": "0.532261",
            "sentiment_compound": 0.9709
        },
        {
            "id": "gwbbph9",
            "score": 1,
            "text": "Problem with immigrants is more to do with welfare than the people coming. If you are coming here to improve your life that's great but a good number are coming to live off welfare in a first world country which is a problem. Either unlimited immigration with no welfare or no immigration with welfare.",
            "title_similarity": "0.6649132",
            "sentiment_compound": 0.4464
        },
        {
            "id": "gwbbpwq",
            "score": 1,
            "text": "I don't think anybody has ever thought that this wasn't true. Tons of legal immigrants own businesses and employ people, we see it every day.",
            "title_similarity": "0.6308875",
            "sentiment_compound": -0.21
        },
        {
            "id": "gwbgxzt",
            "score": 1,
            "text": "Legal immigrants, right?",
            "title_similarity": "0.35483342",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwbhoo8",
            "score": 1,
            "text": "Many of them are okay with accepting a lower wage scale, this will have the effect of lower all wages in that local area, which is NOT for anyone BUT Management.",
            "title_similarity": "0.38608453",
            "sentiment_compound": 0.0129
        },
        {
            "id": "gwbj6k1",
            "score": 1,
            "text": "Start taxing remittances and this might actually mean something.\n\nBut as it is, the numbers say that immigrant workers send hundreds of billions of dollars, out of this country, and back to their own countries of origin.\n\nSo they don't actually help us. They don't spend their paychecks or earnings on our communities. They don't reinvest in the neighborhoods they personally live in. They send their money to prop up failing countries, and even those socialist utopias that the far left love to use as examples so much.\n\nWhy do immigrant communities always have the hardest workers but are so poor? Capitalism must be evil amiriiiight? No. Remittances.\n\nhttps://www.pewresearch.org/global/interactives/remittance-flows-by-country/\n\nCurious why if Denmark has such amazing social policies and free this free thank do Denmark immigrants have to send $175,000,000 per year back home?\n\nEnjoy the context.",
            "title_similarity": "0.55852515",
            "sentiment_compound": 0.931
        },
        {
            "id": "gwbjvs9",
            "score": 1,
            "text": ">used administrative records from the Internal Revenue Service of every firm founded in the U.S.\n\nSo they're only looking at tax paying business owners, which has nothing to do with the titled claim of \"Immigrants act more as job creators than job takers.\"\n\nThere is no data present in this about undocumented immigrants, which is typically what the hot-button issue is in the immigration debate.\n\nIt should be expected that legal immigrants start more businesses, as they both have specific visas for this (so the only reason they are here is to start a business, otherwise they would be denied entry), and they have numerous tax incentives that native-born Americans do not possess, so the barrier to entry is much lower.",
            "title_similarity": "0.57273173",
            "sentiment_compound": -0.6461
        },
        {
            "id": "gwbkjwh",
            "score": -1,
            "text": "not sure people like rats that much",
            "title_similarity": "0.2421182",
            "sentiment_compound": -0.4717
        },
        {
            "id": "gwbm3vc",
            "score": 1,
            "text": "Do they count undocumented immigrants?  I don’t think people question the motivation and benefits of documented legal immigrants.",
            "title_similarity": "0.52410233",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gwbohh6",
            "score": -1,
            "text": "The effects of immigration on domestic labor, housing, and the environment are well established facts you can try to twist things around to justify stealing labor and brain power from developing economies but at the end of the day you’re still a thief.",
            "title_similarity": "0.6303508",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gwboi5x",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwbojsg",
            "score": 1,
            "text": "yeah, you should probably not steal other countries' talent to boost your own economy and development.  \nunderdeveloped countries are usually the losers here",
            "title_similarity": "0.555669",
            "sentiment_compound": 0.7121
        },
        {
            "id": "gwbxcpi",
            "score": -1,
            "text": "They get a ton of benefits that locals do not.",
            "title_similarity": "0.5675664",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gwbyn6i",
            "score": 1,
            "text": "They also mainly employ fellow immigrants fuelling the demand for more immigration.",
            "title_similarity": "0.7409837",
            "sentiment_compound": -0.128
        },
        {
            "id": "gwc2eqb",
            "score": 1,
            "text": "Legal immigrants*\n\nI know because I’m one of them. Immigration, the visa process and uscis is baffling to most Americans",
            "title_similarity": "0.5177619",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwc3sje",
            "score": 1,
            "text": "The positive effects of nobody wanting to hire you: you get self-sufficient and do it your damn self.",
            "title_similarity": "0.3562054",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gwc5r4k",
            "score": -1,
            "text": "Probably the idk, not paying taxes that makes them able to expand faster",
            "title_similarity": "0.68821675",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gwc7hrl",
            "score": -1,
            "text": "It has to be true.  It was written by the Chamber of Commerce.",
            "title_similarity": "0.3897025",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwc7w3w",
            "score": -1,
            "text": "Job creators for ice and border patrol u mean?",
            "title_similarity": "0.36513755",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwce3nm",
            "score": -1,
            "text": " Hey there democrat propaganda! How are ya?",
            "title_similarity": "0.2403475",
            "sentiment_compound": -0.3164
        },
        {
            "id": "gwcg9qq",
            "score": 1,
            "text": "From what I’m reading it’s taking into account legal immigrants and their offspring.\n\nWell that makes sense for a number of reasons.\n\n1) Our requirements to be a legal immigrant are fairly high in comparison to other western countries.\n\n2) Legal immigrants are legally protected and thus can ensure proper resources for their children.\n\n3) In general anyone who comes from another country and immigrates is somewhat entrepreneurial minded. That’s a big risk. So that gumption rubs on their kids too.\n\n4) Because immigrants often have a much higher tolerance for low wages and sharing costs they can start businesses with low margins and out compete on labor costs for that reason such as dry cleaning and tailoring. Most of the industry is run by immigrant families for that reason. Same for takeout restaurants and even budget hotels.\n\nThe problem is that you can’t apply all those conditions with families that did not legally immigrate. Notice a lot of pro illegal immigration chatter using this study as a basis for its merit. Which is misleading at best.\n\nEDIT: if you’re going to thumb down, do so with a comment and merit your disagreement...otherwise you simply do not like like my sentiment even though there’s merit. Which helps validate my point.",
            "title_similarity": "0.75835717",
            "sentiment_compound": 0.9285
        },
        {
            "id": "gwbjqz8",
            "score": 32,
            "text": "Is there not an element of a self-fulfilling prophecy and cyclical marginalization here in terms of lack of investment in the native population?\n\nStage 1: Immigrants are beneficial to the treasury because they provide taxes without need for paying for their education and upbringing, resulting in an overall higher revenue.\n\nStage 2: Our economy and taxation no longer relies on an educated native population. We can cut taxes and expenditure to benefit corporations. (Rinse repeat on a number of issues where expanding the pool of an educated labour force is no longer reliant on uplift of the native population, but on relaxing immigration controls).\n\nStage 3: \"Immigrants are better at loads of things and show more motivation and found more businesses and so on, so we need them.\".\n\nThe question worth asking is why that is the case, and whether the systemic reliance on immigration results in disadvantages to the native population by making our economy no longer actually reliant on the wellbeing and prospects of the native population.\n\nIf immigrants produce more jobs than natives and found more businesses, what is the systemic explanation for that and what systems are failing native people in order to produce that outcome? As a follow up question, do those systemic failures only exist because our economy can rely on immigration to protect the interests of the wealthy? (Such as, \"We don't actually need to fix the education system to get the employees i need to work at my business, because immigrants can do it. Tax cuts for me, woo hoo.\" and \"Who cares if poverty produces long-term negative consequences for intelligence and health? My business hires immigrants, so I don't need to live in a country where food deprivation doesn't rot your brain. Slash taxes and regulations for me!\").\n\nSimply pointing to how immigrants perform better than the native population is not actually addressing the core concerns of critics of an economy reliant on immigration. If anything it lends credence to their overall point, it would seem that other countries are producing immigrants who have better economic prospects, while countries reliant on immigration are producing individuals with lower economic prospects, so the ideal for a countries citizens would seem to be to become a country that does not rely on immigration, but rather, produces \"immigrants.\" (Or,  more realistically, produces upwardly mobile people).\n\nSo long as a country can rely on immigrants, there is no actual incentive for business leaders to care about the wellbeing of a native population. This is something we know from the history of colonialism and resource-dictatorships too. (Countries that imported western experts did not need an educated populace to manage the machinery, and kept them as uneducated serfs who dug resources out of the ground).\n\nAs an example for the US, the need for people with tech degrees to feed the growing needs of the tech industry has two solutions:\n\n1. Ensure that more native people get tech degrees\n\n2. Relax immigration laws\n\nThe first requires more educational investment and reduction of poverty and social problems that lead to poor outcomes for citizens. This means higher taxes and often regulations on corporate behavior.\n\nThe second requires simply letting more people into the country.\n\nWhich of these is in the tech industries interest to lobby for in order to obtain the educated workers necessary for their company to profit?\n\nIt may be the case that strict immigration laws are basically an essential requirement for any form of internal social mobility in a capitalist society, because the economic incentives otherwise are fairly straightforward. (And to be clear, it's not an either-or thing. It's a spectrum. The more reliance on immigration, the less need for corporations to care about the wellbeing of a native population. Corporations can't quite get all their skilled workers from immigration, so they need to triangulate \"What is the most we can neglect the native population and rely on immigrants while still meeting our labor needs?\".).\n\nThe era of mass migration and the era of exploding wealth inequality coincide, this may not in fact be a coincidence.",
            "title_similarity": "0.7006105",
            "sentiment_compound": 0.9891
        },
        {
            "id": "gwbc6g5",
            "score": 9,
            "text": "Driving down compensation for labor.",
            "title_similarity": "0.26746738",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwatoc9",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwav306",
            "score": 2,
            "text": "Wonder if the tax abatements for immigrant/minority owned businesses have anything to do with that?",
            "title_similarity": "0.4454135",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwayax1",
            "score": -2,
            "text": "Also immigrant labor drags down minimum wage. It’s no coincidence it hasn’t increased in many many years.",
            "title_similarity": "0.5283015",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gwb7r35",
            "score": -2,
            "text": "Isnt that like trickle down economics? Dont worry they create jobs and dont take them ;) \n\nSounds like corpo funded science.",
            "title_similarity": "0.5133203",
            "sentiment_compound": 0.0813
        },
        {
            "id": "gwbkycv",
            "score": 2,
            "text": "Immigrants are some of the hardest working people I know.",
            "title_similarity": "0.51020324",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbqedy",
            "score": 2,
            "text": "Of course, immigrants have almost always come to this country specifically to work.",
            "title_similarity": "0.5689453",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwc11wj",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwc4yw3",
            "score": 2,
            "text": "Every single \"ethnic\" restaurant in your city is probably thanks to immigrants...and life is better because their food kicks so much ass.",
            "title_similarity": "0.66029835",
            "sentiment_compound": 0.2551
        },
        {
            "id": "gwcxl5v",
            "score": 2,
            "text": "After decades of food service related jobs, I can tell you with 100% certainty that immigrants are the hardest working people I know. They WILL take your job away, because they will work their butts off and be as reliable as the sunrise. \n\nThat is not a bad thing. If they can legally immigrate to this country and put you out of a job, maybe you need to reconsider your career options.\n\nWith that being said, I do think the border should be secure, and immigration should happen legally, for obvious reasons.\n\nBut treating someone different just because they weren't born in here is just fucked up and wrong. They probably went through more hardship just to get here, than you will ever experience in your entire life. If they can do that, and still show up and make you look lazy, that is not something that makes them look bad. \n\nAnd that only leaves one other person, so...",
            "title_similarity": "0.5660235",
            "sentiment_compound": -0.9644
        },
        {
            "id": "gwd9wyo",
            "score": 2,
            "text": "People born into a life of comfort have a tendency to take it for granted. Immigrants from other countries on the other hand are often motivated entrepreneurs willing to do anything to improve their lives, thus resulting in their hard work ethic and 'hustling' ability.",
            "title_similarity": "0.7035598",
            "sentiment_compound": 0.926
        },
        {
            "id": "gwamk6v",
            "score": 1002,
            "text": "According to research done by Doctors (PhD) Thomas J. Stanley and William D. Danko, the most \"over represented\" ground in the American Millionnaire class (Net worth $1M+) are immigrants or their first generation of kids.\n\nReasons cited were:\n\n* They come from less well off nations and as such know the value of saving and investing versus frivolous purchases\n* Having had to put in the work to move countries, they have a better work ethic than many Americans\n* They have the \"American Dream\" of building something for themselves, carving out their own business.\n* They understand the value of proper education and don't take schooling for granted",
            "title_similarity": "0.7370659",
            "sentiment_compound": 0.9083
        },
        {
            "id": "gwb78ne",
            "score": 65,
            "text": "Okay so this only accounts for legal immigrants in the US. If you know anything about the immigration system the United States is more likely to grant work visas, green cards, and many other long-term visas based on financial status in one's home country. So in other words the government is more apt to let in successful or wealthy immigrants to the US.\n\nThis also doesn't account for all of the illegal immigration that happens that has the negative effects on the economy that are being purported in the article.\n\nAlso the study defines immigrant entrepreneurship as having multiple founders of companies from like 100 years ago or more when legal immigration was completely different. I'm not sure using that loose definition of founder would accurately reflect their impact on those companies. I'd really love to see a more detailed account of these issues that were sidestepped by this study.",
            "title_similarity": "0.7446616",
            "sentiment_compound": 0.8878
        },
        {
            "id": "gwaq7uy",
            "score": 2,
            "text": "Yeah, because the west gave up on funding education for their own citizens",
            "title_similarity": "0.2172875",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwasspw",
            "score": -2,
            "text": "Did you really need research to tell you this? Mexican immigrants are the labor force!",
            "title_similarity": "0.50601095",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwaz4sn",
            "score": 4,
            "text": "This makes sense because not all immigrants are the poor people with all their belongings in a suitcase, like my father’s family.   Some / many already have money, and the reason they are allowed into the country is because they literally have a business plan prepared to show their plan to start a business and already have the capital to do so. I’ve also seen other examples of immigrants opening and living in the back of a store until they made enough money to get a place to live. Or the immigrants who pool their resources to open a store, and as they make more money, another person splits off to open a store, and this continues until everyone has their own business.",
            "title_similarity": "0.67288893",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gwb19o3",
            "score": 3,
            "text": "Is this true of visa holders, or just those who immigrate to gain citizenship?",
            "title_similarity": "0.38471282",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gwb70uy",
            "score": 3,
            "text": "Something else to consider in regards to the impact of immigrants on the economy: Children are a drain on society, they don't start paying back the money that society invests in them until they become adults and start working and paying taxes.  \n\n(Adult) immigrants on the other hand start working right away, their home countries paid to raise them as children, yet their new home country gets all the rewards.  \nIt's actually a super sweet deal to get people who are ready to enter the labor market right away, after another country has paid for their food and education and infrastructure for 18 years.",
            "title_similarity": "0.6330086",
            "sentiment_compound": 0.9403
        },
        {
            "id": "gwbjc5e",
            "score": 3,
            "text": "Ok great. So the US can take in a strict limit of 100,000 immigrants per year and this holds true.",
            "title_similarity": "0.6151917",
            "sentiment_compound": 0.8442
        },
        {
            "id": "gwbq8sa",
            "score": 2,
            "text": "Whole America has been built this way.",
            "title_similarity": "0.39232904",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbwlki",
            "score": 2,
            "text": "Word. For a college class I wrote a *persuasive essay* on essentially why immigration is excellent for the US. Did a fair amount of research and found basically exactly what this article says.",
            "title_similarity": "0.49917105",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gwbxvcl",
            "score": 3,
            "text": "They tend to have a much higher appreciation for the opportunities available here, and they take full advantage of them. While most Americans take it for granted and don't see the potential, or just don't want to put in the work. Most of us are pretty soft, let's be honest.",
            "title_similarity": "0.63835603",
            "sentiment_compound": 0.9346
        },
        {
            "id": "gwc2re9",
            "score": 3,
            "text": "Isn't that the basic history of the American economy?",
            "title_similarity": "0.34289384",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwamoa9",
            "score": -5,
            "text": "As bane once said “peace has defeated you”.",
            "title_similarity": "0.20043889",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwaxkj1",
            "score": -3,
            "text": "**Legal** immigrants sure do add to our economy in all those ways.\n\nIllegal ones on the other hand cannot have a legal place of residence or bank account or pay taxes or anything at all.",
            "title_similarity": "0.58231956",
            "sentiment_compound": 0.1606
        },
        {
            "id": "gwbwcbq",
            "score": -6,
            "text": "I wonder who paid for that study xD",
            "title_similarity": "0.25899947",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gwbohu7",
            "score": 71,
            "text": "I feel like the article is missing a major point. \n\n\nWhat where the immigrant occupations and social economic status before arriving in the US?\n\nSome of the same factors that allow you to immigrate to the United states (wealth, education and political connection) also seem like factors that would help them facilitate opening businesses in the US.\n\nThe US is a known talent leach from other countries and i feel like these factors play a role.",
            "title_similarity": "0.67348254",
            "sentiment_compound": 0.959
        },
        {
            "id": "gwb5m4t",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwadqil",
            "score": 4509,
            "text": "I don't doubt that immigrants are more likely to establish new businesses compared to locals: There must be a correlation between risk-taking behaviour & establishing businesses & moving to a new country. \n\nAlso, a lot of times, immigrants are forced to do so as they don't have contacts in their newly adopted country to get into an established business: It can be easier for me to open up a kebab shop rather than getting back into the marketing business I had been running back in the home country.",
            "title_similarity": "0.6703491",
            "sentiment_compound": 0.2287
        },
        {
            "id": "gwarjgn",
            "score": 1,
            "text": "I dont know how you can draw the conclusion in OPs title when the researchers didnt actually try to find the net gain or loss. Im not sure i disagree with the conclusion and im not anti immigration, but i am against drawing conclusions that you would like to be true even though the data doesnt support it.",
            "title_similarity": "0.33085835",
            "sentiment_compound": 0.7355
        },
        {
            "id": "gwas357",
            "score": 1,
            "text": "They pack all their belongs and assets to start life in another country.\n\nImmigrants can be loaded.",
            "title_similarity": "0.44010776",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gwautxh",
            "score": 1,
            "text": "That's in th US. How does it work in other countries? The US has very low barriers for business and labour force entry. How does it work in countries with strong unions, like Germany?",
            "title_similarity": "0.5191916",
            "sentiment_compound": 0.5813
        },
        {
            "id": "gwavbjv",
            "score": 1,
            "text": "It almost sounds like \"A proud nation of immigrats\"",
            "title_similarity": "0.4336993",
            "sentiment_compound": 0.651
        },
        {
            "id": "gwavswg",
            "score": 1,
            "text": "I found another interesting study that sort of affirms this one. It was found that immigrants DO tend to use more government resources, but they generate WAY more tax revenue than native born people because they are more likely to start businesses. Basically they are a very solid investment.",
            "title_similarity": "0.90557843",
            "sentiment_compound": 0.4921
        },
        {
            "id": "gwaxk6n",
            "score": 1,
            "text": "Doesn't this just show that we have cultural and or policy issues in the United States?\n\nAre we doomed to always relying on immigration to boost our economy? Is there nothing we could possibly do to foster a pro business culture, perhaps make it easier for Americans to start a business? \n\nIt is not healthy for a country to have to rely and drain another country of labor to maintain itself, and it's not healthy for poor undeveloped countries to have all of their quality laborers stolen. Sure they can send money back to the homeland, but that is another issue in of itself. We need to be self sufficient and maintain healthy birthrates as well as cultivate a healthy work culture.",
            "title_similarity": "0.6866479",
            "sentiment_compound": 0.8862
        },
        {
            "id": "gway045",
            "score": 1,
            "text": "When a nee community enters there’s a reaction within the community to bring a little home with them. Shops and restaurants open up. Where I live in New York there is a huge Indian and Korean population and with it came great food, and awesome shops.",
            "title_similarity": "0.5806042",
            "sentiment_compound": 0.8885
        },
        {
            "id": "gwazdo0",
            "score": 1,
            "text": "That makes sense. They can’t get hired to existing companies due to reasons, so they start their own company instead. They work harder than their competition because they’re driven by a need for their extended families to survive while they’re there doing their thing.",
            "title_similarity": "0.5745775",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwazn4p",
            "score": 1,
            "text": "Immigrants work like their life depended on it and it does.",
            "title_similarity": "0.6111109",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwaznao",
            "score": 1,
            "text": "That's the real reason why the oligarchs delude the masses into hating them",
            "title_similarity": "0.31743467",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gwb0352",
            "score": 1,
            "text": "There is an NPR podcast about a city in PA. After the manufacturing bust the city decided to invite refugee seekers, and how it helped improving the economy compared to the surrounding towns that didn't.",
            "title_similarity": "0.6280949",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gwb0kby",
            "score": 1,
            "text": "Not gonna lie, this seems like it falls into the same mindset of give businesses more tax breaks so they can create more jobs i.e. trickle down economics.",
            "title_similarity": "0.6659041",
            "sentiment_compound": 0.5945
        },
        {
            "id": "gwb11ak",
            "score": 1,
            "text": "It’s almost like it takes a certain bit more of “get up and go” as an immigrant than it does to just be a normal schlep.",
            "title_similarity": "0.59843045",
            "sentiment_compound": 0.5118
        },
        {
            "id": "gwb19q9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwb1pdz",
            "score": 1,
            "text": "Don’t tell this to radical right wing media.",
            "title_similarity": "0.1857758",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb1rjs",
            "score": 1,
            "text": "This has been known since 1981 (see the lump of labor fallacy); I guess it's great to see it reproduced, again.",
            "title_similarity": "0.4567657",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwb1ud9",
            "score": 1,
            "text": "Anyone who's been to a laundromat, locally-owned grocery store, or non-chain restaurant could probably confirm this, let alone the people who buy into Andrew Carnegie's rags-to-riches legend. It's good to see actual science behind it though.",
            "title_similarity": "0.46523637",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gwb218n",
            "score": 1,
            "text": "DOI for those interested: 10.3386/w27778\n\nThe article relies on are particular interpretations of work and job creation in its interpretation, yet the model they use naturally has controls for at least some of them. For example, they explain that a unit of work will decide to either work for a wage or start a firm depending on the amount of money to be gained from either a wage or starting a firm and choosing the greater of the two. Two flaws that immediately come to mind are the imperfect knowledge of these numbers to \"labor units\" in the workforce, and that one person starting a firm makes the market more competitive. In a sense, starting a firm may also, in some circumstances, be taking a job in the form of firm ownership. \n\nThe title seems to  want us to draw the conclusion that more jobs are created than those taken by immigrants but is really just saying that immigrants not only take wage-earning jobs but start firms.\n\nWhile I think nationism and xenophobia are abhorrent in this country, I also don't appreciate the head-in-the-sand whitewashing of immigration either. Immigration is most categorically useful to a burgeoning economy with a lot of unrealized expansion. In a stable economy that is largely comprised of competitive markets, immigration is more about lower cost labor producing a competitive edge than it is about adding much-needed labor to the labor pool.\n\nThat said, I don't think that it's very reasonable to blame immigration for our woes. I think the primary issue is wealth inequality. How is it that despite all the technological advances of the modern age so many people still struggle to scrape by? It's not immigration. It's because workers are only being allowed to keep the bare minimum required to keep them alive and able to work out of all the value of their work.\n\nTie the income of the highest-paid workers in a company to that of the lowest, and then we'll see what the economy looks like. That is, constrict the highest total compensation in a company to a particular multiple of the lowest. We'll see how the economy looks when people can only make 10 times that of the lowest compensated worker, and the hoarding of capital is combated with wealth taxes.",
            "title_similarity": "0.6223918",
            "sentiment_compound": 0.2134
        },
        {
            "id": "gwb26bv",
            "score": 3,
            "text": "I mean, isn't that not true for people who are uneducated and unskilled because they get crowded out.",
            "title_similarity": "0.46154976",
            "sentiment_compound": 0.2466
        },
        {
            "id": "gwb2aqp",
            "score": 1,
            "text": "People who live in  Argentina  where 99% of fruit shop  and market  are run by Chinese or Bolivians  *pretend to be shocked*",
            "title_similarity": "0.5582103",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwb2g6d",
            "score": 1,
            "text": "There are quite a few studies out there I read in college, regarding the impact immigrant populations have on the communities they inhabit.   From what I remember, generally, first generation immigrants have a lower rate of crime and are more economically productive (generally) than Americans of a similar socio-economic status.   \n\nIt's usually the proceeding generations often born in country (or raised in the US as very young children) where issues arise.",
            "title_similarity": "0.7264186",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gwb2uwt",
            "score": 1,
            "text": "I don't doubt the immigrants do very well as a job creator.  The process of going through an immigration process suggests or indicates that an individual has certain characteristics that will make them a producer in society.  Also, very few people are concerning themselves with immigration other than the extremes of the political spectrum.  The concern the majority of people in the US, who the article seems to be about, is related to federal law, immigration and those who do not follow it.  The vast majority of people in the US (not the extreme left or right) see a benefit to immigration that follows a legal process.  This article seems to be a support for having a legal process of immigration because those who go through the process are a benefit to society.  Maybe that isn't the message that people are thinking of when they read this on Reddit, but it is a logical conclusion.",
            "title_similarity": "0.7005231",
            "sentiment_compound": 0.7993
        },
        {
            "id": "gwb36yq",
            "score": 1,
            "text": "Anyone would move to a better location if it’s possible. Not just humans but all other animals also.",
            "title_similarity": "0.40055007",
            "sentiment_compound": 0.2382
        },
        {
            "id": "gwb3dzd",
            "score": 1,
            "text": "Is it plausibly due to  immigrants having more capital that natives?",
            "title_similarity": "0.79445845",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb3qwj",
            "score": 1,
            "text": "People need to see the economic benefits of immigration. I’m pretty sure that there is no point in creating jobs if people domestically can’t fill them (underemployment)",
            "title_similarity": "0.5578669",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gwb3vy7",
            "score": 1,
            "text": "And we thank them for this, because elotes man saves my day every walk to work.",
            "title_similarity": "0.53358436",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwb4g38",
            "score": 1,
            "text": "Imagine if we spent half of what we spend on immigration on locals wanting to start a business. I think we can have both. We should be questioning why we are depending on immigrants to start businesses, and why locals are reluctant to start businesses. I'm in Canada, started my own contracting company and have since shut it down. The start up costs like insurance, licensing, workers comp, accountants, etc have completely turned me off. I'm doing the same as I was before, but at a higher expense. I also cant borrow any money to invest in the company. Even though it's the same thing I've been doing for 15 years. \n\nAlso, why aren't we reproducing to keep up the population? Make it easier to have families and rely less on immigration.",
            "title_similarity": "0.583619",
            "sentiment_compound": 0.5789
        },
        {
            "id": "gwb4hd7",
            "score": 1,
            "text": "It’s the robots that take our jobs",
            "title_similarity": "0.38328373",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb4lmy",
            "score": 1,
            "text": "Very interesting, does this make difference between documented and undocumented immigrants? It's never necessarily for me been about the immigrants are stealing our jobs, it's more that our actual citizens are struggling and why should we allow them to struggle while also allowing people to come and make for themselves better lives while the natives cant? It's like a slap in the face to the citizens who are struggling and treading water to survive. We have 20 million americans in poverty. We need to take care of our own.",
            "title_similarity": "0.5367786",
            "sentiment_compound": -0.6982
        },
        {
            "id": "gwb4ng0",
            "score": 1,
            "text": "I'm curious as to how familial employment factors into this; if (hypothetically, and I very much *don't* mean this negatively) a large percentage of jobs created are employing family members or close friends within their cultural communities, it may not be that the number of jobs available to native societal members is net-positive.\n\nI'm unable to read the article rn, so my apologies if this had been answered there, but I can definitely see how there might be substantial issues with misinterpretation or in obtaining relatively clean data depending on community employment reporting, imprecise worksite/firm categorization, etc.",
            "title_similarity": "0.5751333",
            "sentiment_compound": 0.9127
        },
        {
            "id": "gwb52ge",
            "score": 1,
            "text": "Adults moving over will probably have fewer initial social resources but less debt. American everything requires college now and the debt that requires doesn’t foster growth",
            "title_similarity": "0.48126596",
            "sentiment_compound": -0.394
        },
        {
            "id": "gwb54f6",
            "score": 1,
            "text": "Sure lemme start my own business with my astounding capital.",
            "title_similarity": "0.5336243",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwb5b7o",
            "score": 1,
            "text": "Probably less risk averse. Makes sense.",
            "title_similarity": "0.19730473",
            "sentiment_compound": -0.204
        },
        {
            "id": "gwb5hse",
            "score": 1,
            "text": "I don’t care how hard they’re culture tells them to work, in fact, it’s stuff like that that makes me not want they’re culture here.",
            "title_similarity": "0.3330262",
            "sentiment_compound": 0.6222
        },
        {
            "id": "gwb5lav",
            "score": 1,
            "text": "I knew someone from Central America who didn't have a work permit and so he couldn't get an SS number and couldn't get a job. So what he did was he founded a business and marketed himself as an independent contractor. Then his business grew and now he has employees of his own.",
            "title_similarity": "0.4106175",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gwb5u92",
            "score": 1,
            "text": "This couldn’t ring more true. I work in business sales and so many of my larger sales were to immigrants. So many of them successful. \n\nI’ve come to this conclusion:\n\nThe path to citizenship or obtaining a work social is much greater than getting an FEIN. Naturally this has lead to self employment and forced entrepreneurship.",
            "title_similarity": "0.87876856",
            "sentiment_compound": 0.7501
        },
        {
            "id": "gwb5xpv",
            "score": 1,
            "text": "*1st and 2nd generation immigrants",
            "title_similarity": "0.40601742",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb643h",
            "score": 1,
            "text": "If you want a US green card, the easiest way is via an investor visa. You can basically buy your green card this way. \n\nI looked into moving to the US from the UK. Easiest way was to put $500k into a company building a hotel or similar construction project and leave it there for 5 years. I therefore would tick the box “creating 10 jobs” jobs from the construction, future jobs created by the project and additional service jobs related to the project. \n\nAnother way is to open a US branch of an existing company you have and employ people. When every foreign business person with a green card who has a business in the US is included it’s not hard to come up with the figures. \n\nTraditionally the merchant class is more likely to move to foreign lands seeking to expand business operations. \n\nIf you look at the demographic breakdown of all legal immigration to the US, they are richer and better educated than the average US citizen. \n\nIt’s not easy to legally immigrate to the US. The whole give us your poor huddled masses died a long time ago. It’s now give us your rich and educated elite.",
            "title_similarity": "0.5012615",
            "sentiment_compound": 0.8832
        },
        {
            "id": "gwb656u",
            "score": 1,
            "text": "Most undocumented citizens in the US are visa overstayers.",
            "title_similarity": "0.5130714",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb6yb3",
            "score": 1,
            "text": "Obviously, its much easier to get loans as a new immigrant. Source wife’s family are immigrants and had no issues getting big loans with no credit.",
            "title_similarity": "0.575121",
            "sentiment_compound": -0.1491
        },
        {
            "id": "gwb7pvy",
            "score": 1,
            "text": "I don't think you'd find anyone who'd argue with that notion even if the research hadn't been done.  It seems fairly obvious, doesn't it?",
            "title_similarity": "0.3386493",
            "sentiment_compound": -0.34
        },
        {
            "id": "gwb8eli",
            "score": 1,
            "text": "It is consumers, not employers, who create job demand.",
            "title_similarity": "0.39032787",
            "sentiment_compound": -0.3213
        },
        {
            "id": "gwb9ilg",
            "score": 1,
            "text": "The book the Millionaire Next Door talks about the rate of immigrants starting their own businesses.",
            "title_similarity": "0.651288",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwb9piw",
            "score": 1,
            "text": "Each human requires a certain amount of care. \n\nThat care is jobs. \n\nSo basically if every single person dosent have a Ferrari, a mega mansion, the hottest video games, the best tvs, and whatever other oddity you might want, there's jobs to be done. \n\nSo of course more people equals more work. \n\nIt's probably the equivalent of adding liquidity to the markets. More buyers and sellers stabalize the market more.",
            "title_similarity": "0.7448126",
            "sentiment_compound": 0.9186
        },
        {
            "id": "gwbaadd",
            "score": 1,
            "text": "Well if America didn’t play “can’t catch me” with the job market and Millennial debt, maybe we’d have had enough money to start our own dream businesses.\n\nGlad you guys found some other people to do it since you couldn’t fix our lives in time.",
            "title_similarity": "0.6470881",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gwbaspp",
            "score": 1,
            "text": "(Not political) r/science",
            "title_similarity": "0.008095865",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbazde",
            "score": 1,
            "text": "To be fair if you let someone move from the other side of the planet, learn your culture and native language better than you, and out skill you in your field you should probably figure out why you’re so slow. It’s all on you.",
            "title_similarity": "0.42853576",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gwbb26k",
            "score": 1,
            "text": "Yeah, but this doesn’t play into the victim narrative of native-borns.",
            "title_similarity": "0.12516713",
            "sentiment_compound": 0.2617
        },
        {
            "id": "gwbbeca",
            "score": 1,
            "text": "Makes sense. To move to another country - perhaps one with a different culture or even different language - takes courage, resourcefulness, drive, and grit.   \n\nPrecisely the characteristics one needs when starting a business.",
            "title_similarity": "0.4898885",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gwbbkbj",
            "score": 1,
            "text": "Oops, accidentally texted this article to my ENTIRE family without making popcorn first.",
            "title_similarity": "0.2684305",
            "sentiment_compound": -0.34
        },
        {
            "id": "gwbbo61",
            "score": 1,
            "text": "Intrinsic motivation is a thing",
            "title_similarity": "0.21622346",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwbbvg8",
            "score": 3,
            "text": "And the US seems to be just now discovering what most of the rest of the world already knew.",
            "title_similarity": "0.32489988",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbbxp3",
            "score": 3,
            "text": "Instructions unclear, moving to North Korea to start a revolution",
            "title_similarity": "0.30404028",
            "sentiment_compound": -0.25
        },
        {
            "id": "gwbc4ga",
            "score": 1,
            "text": "I don’t mind immigrants. But of course they come here to start a business. Look how easy it is to take advantage of all the tax loopholes and lobbying and slave wages. America is the best country to be a tyrant business owner. We love rich psychopaths.",
            "title_similarity": "0.6186457",
            "sentiment_compound": 0.9761
        },
        {
            "id": "gwbcwjh",
            "score": 1,
            "text": "Yeah, immigrants are a lot more likely to have savings too compared to non-immigrants with similar wage, because they are used to living less lavishly. And they are more likely to invest those savings and start a business, because they don't see it as such a big risk to just go back to being broke.",
            "title_similarity": "0.7829132",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwbd6pq",
            "score": 1,
            "text": "“They gave us jerrrrrbs!”",
            "title_similarity": "0.23580505",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbde0i",
            "score": 1,
            "text": "The hardest working segment of the population are immigrants who came here bc there is reward in work.   They do the jobs most Americans think they are too good to do.",
            "title_similarity": "0.72450876",
            "sentiment_compound": 0.765
        },
        {
            "id": "gwbdedn",
            "score": 1,
            "text": "Now let's have a breakdown by country of origin",
            "title_similarity": "0.06367974",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbdk0l",
            "score": 3,
            "text": "Also, coming over as a family unit means that the family will build a business together so they are all working, uses skills they may already have, establishes a foothold in the new country, provides something to pass down, and it reduces operating costs. While potentially also providing a living space. \n\nBeing native born as a child (atleast in western culture) you generally go out on your own much more. Or join an already established family business.",
            "title_similarity": "0.6287605",
            "sentiment_compound": 0.3566
        },
        {
            "id": "gwbelvo",
            "score": 3,
            "text": "A couple of immigrants got together in our community and opened up an extremely successful taco chain (similar to Chipotle but authentic), and guess what they expanded, now it’s a little local chain. Owned and ran by immigrants. It’s nice and I always support.",
            "title_similarity": "0.5831523",
            "sentiment_compound": 0.8688
        },
        {
            "id": "gwbewld",
            "score": 1,
            "text": "Reddit: the game is rigged, you need a college education and trust fund to start a business. The American dream is unattainable for most millennials\n\nImpoverished uneducated immigrant: hold my beer",
            "title_similarity": "0.49541402",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwbfajw",
            "score": 1,
            "text": "For anyone who wants a very accessible view of the impact of immigration on economics I suggest the graphic novel Open Borders: The Science and Ethics of Immigration by Bryan Caplan and Zach Weinersmith.",
            "title_similarity": "0.45957854",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwbfl02",
            "score": 3,
            "text": "Quick, someone tell the UK before 2016!",
            "title_similarity": "0.27388132",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbg435",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwbghhy",
            "score": 3,
            "text": "Depends on their education I think too. Somebody with no skills besides physical labor likely isn't creating jobs for the most part.",
            "title_similarity": "0.29903314",
            "sentiment_compound": -0.4745
        },
        {
            "id": "gwbgxh1",
            "score": 3,
            "text": "Meanwhile, the country at large will continue to ignore reality and use \"job creator\" as a euphemism for \"rich bastard retroactively trying to justify their existence without making anything of their own.\"",
            "title_similarity": "0.4127229",
            "sentiment_compound": -0.34
        },
        {
            "id": "gwbh8nq",
            "score": 2,
            "text": "This is an interesting article, but it does not tell the whole picture of how immigrants impact the US economy. And of the immigrants who found Fortune 500 companies, it would be useful to know what percentage enter the United States with advanced degrees (whether those degrees are fully recognized or not), and how that percentage compares to advanced degree attainment among the native population. Regardless of your position on this subject, this is clearly not an \"apples-to-apples\" comparison.",
            "title_similarity": "0.5755849",
            "sentiment_compound": 0.9513
        },
        {
            "id": "gwbhf29",
            "score": 2,
            "text": "Is that rare for a nation of immigrants?",
            "title_similarity": "0.4288964",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbhwwz",
            "score": 1,
            "text": "Dang for a science sub didn’t realize there were this many conservatives.",
            "title_similarity": "0.46042502",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbhzhn",
            "score": 1,
            "text": "But but but I was told they weren’t sending their best!",
            "title_similarity": "0.088936314",
            "sentiment_compound": 0.7959
        },
        {
            "id": "gwbibjx",
            "score": 1,
            "text": "Why does this happen? What makes immigrants more likely to start businesees?",
            "title_similarity": "0.5663157",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbkf0v",
            "score": 2,
            "text": "Immigration is good for job creation.",
            "title_similarity": "0.6163972",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gwbklm7",
            "score": 1,
            "text": "Isn't expanded labor supply only good for the business owners?",
            "title_similarity": "0.7289995",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwbkv90",
            "score": 1,
            "text": "I suspect it in part do to being part of an economy which is biased against them.  It is not an accident that jews are overly represented in law, finance, and medicine after being persecuted and prevented from owning land for centuries.",
            "title_similarity": "0.52361846",
            "sentiment_compound": -0.449
        },
        {
            "id": "gwbkzwx",
            "score": 2,
            "text": "Policy makers in the U.S. should take note. If we're a desirable, welcoming destination, we all benefit.",
            "title_similarity": "0.43021408",
            "sentiment_compound": 0.802
        },
        {
            "id": "gwblk3z",
            "score": 1,
            "text": "Immigrants, we get the job done",
            "title_similarity": "0.50128174",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbndmr",
            "score": 1,
            "text": "If this is true then I've been lied to for a long time. Like my entire life long time.",
            "title_similarity": "0.27238554",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwbo45t",
            "score": 1,
            "text": "To what extent do US immigration rules force this to be the case? As i understand it the US is very picky when it comes to allowing people in. So, it kind of begs the question, would different rules result in different outcomes? I mean, the US is accused of brain draining other countries, so shouldn’t we expect the best and brightest of other countries to do what the best and brightest of America does?",
            "title_similarity": "0.5136409",
            "sentiment_compound": 0.9497
        },
        {
            "id": "gwbozyj",
            "score": 1,
            "text": "\"people with no ties tend to make more flexible & potentially riskier decisions\"",
            "title_similarity": "0.45655152",
            "sentiment_compound": -0.3415
        },
        {
            "id": "gwbpr5t",
            "score": 1,
            "text": "I do feel like this is one in a list of studies that have had the same or similar findings.",
            "title_similarity": "0.31852746",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwbpyng",
            "score": 2,
            "text": "Many immigrants add tremendous value, some don’t. \n\nDoes the United States have a right to be selective about who is allowed to immigrate?",
            "title_similarity": "0.60050803",
            "sentiment_compound": 0.6697
        },
        {
            "id": "gwbq4b5",
            "score": 1,
            "text": "... because the lower the cost of labor the higher the demand will be.",
            "title_similarity": "0.64450264",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwbrn2f",
            "score": 1,
            "text": "Immigrants created 100% of jobs in the US",
            "title_similarity": "0.7045557",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwbrs2t",
            "score": 1,
            "text": "Arnold Schwarzenegger was a better governor than most. Even though he was a Republican in California, he did the best he could for his state and he always. \n\nHonestly, he appreciates this land and wants it to be great. He didn’t want to just milk the whole country for personal gain. \n\nI’m not saying he didn’t have Republican values, but as an immigrant who had seen hell in other countries, he definitely seemed to have his heart in the right place.",
            "title_similarity": "0.61813235",
            "sentiment_compound": 0.9371
        },
        {
            "id": "gwbrsvh",
            "score": 1,
            "text": "Not just the UK, then?",
            "title_similarity": "0.16803996",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbsdpu",
            "score": 1,
            "text": "Not to stop letting the government choose who can make jobs with ridiculous business licensing requirements.",
            "title_similarity": "0.50410855",
            "sentiment_compound": -0.1561
        },
        {
            "id": "gwbt7y4",
            "score": 1,
            "text": "Ask any South American countries immigrants how much monthly compared to United State?  Also, Asia, Africa and middle eastern countries immigrants.  Immigrants willing to take any jobs no Americans will.  Immigrants are farmers, dishwashers, cooks, baby sitter, house keepers, landscaping, does everything dirty jobs America has offer.  All with minimum wage.  They’re I consider “Essential” to our countries.",
            "title_similarity": "0.5400436",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gwbua68",
            "score": 1,
            "text": "They took giving our jobs!",
            "title_similarity": "0.36989567",
            "sentiment_compound": 0.4003
        },
        {
            "id": "gwbub59",
            "score": 1,
            "text": "\"Que se sienta el power mexicano.\"",
            "title_similarity": "0.2891218",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbucyd",
            "score": 1,
            "text": "Curious know the industry that is expanding labor demand? Is this finance, business, tech jobs? Or what is this ?",
            "title_similarity": "0.73578715",
            "sentiment_compound": 0.327
        },
        {
            "id": "gwbuegj",
            "score": 1,
            "text": "It's just too bad the people who need to hear this the most won't listen to a word of it.",
            "title_similarity": "0.28428593",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwbuqb1",
            "score": 1,
            "text": "Yes this is correct. Immigrants generally do work in less wages compared to the natives. This has two benefits for the owners and natives. First the owner’s surplus increases, and more money means they have to find new avenues to invest that money. Then natives come into the cycle, where they work in white collar jobs and help owners in establishing new businesses. And this phenomenon isn’t confined to just one country but the whole world. Such as the cheap labor of global south/ third world is transported to rich countries where generally the conditions of living are much much better.",
            "title_similarity": "0.8290591",
            "sentiment_compound": 0.9224
        },
        {
            "id": "gwbuw1p",
            "score": 1,
            "text": "Or, to cite Miranda, Diggs, et al, \"Immigrants: we get the job done.\"",
            "title_similarity": "0.5514802",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwbw7ny",
            "score": 1,
            "text": "I would like to see this broken out over nationality and level of education. Not all immigration is the same. Many countries experience a “brain drain” where highly skilled and educated people move to the US",
            "title_similarity": "0.6512727",
            "sentiment_compound": -0.2789
        },
        {
            "id": "gwbx4yn",
            "score": 1,
            "text": "Is \"job taker\" a negative term now? I work for a company. Am I a job taker?",
            "title_similarity": "0.49105766",
            "sentiment_compound": -0.6199
        },
        {
            "id": "gwbyb0h",
            "score": 2,
            "text": "Probably because immigrants actually see the great USA as THE LAND OF OPPORTUNITY that it really is. \n\nThey don't get consumed with victim mentality that native-born Americans fall into because most of them have come from ACTUAL govt/societal oppression. \n\nLegal immigrants are 4x more likely to become millionaires than native-born Americans. \n\nGet over yourselves and get to work!",
            "title_similarity": "0.7409128",
            "sentiment_compound": 0.8087
        },
        {
            "id": "gwbz5o3",
            "score": 1,
            "text": "I don't suppose the study looks into the relative access to capital between immigrants who have been screened by a system designed to allow the skilled and the (relatively) wealthy into the country and the native population?",
            "title_similarity": "0.6095911",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gwc0k6i",
            "score": 1,
            "text": "They created er jerbs!",
            "title_similarity": "0.2241993",
            "sentiment_compound": 0.3164
        },
        {
            "id": "gwc0mw0",
            "score": 1,
            "text": "It’s so hard to come here, that you select for the very driven.",
            "title_similarity": "0.3462575",
            "sentiment_compound": -0.1761
        },
        {
            "id": "gwc11sf",
            "score": 1,
            "text": "Considering if immigrants didn't have a positive effect then America as a concept would not have worked.",
            "title_similarity": "0.44351456",
            "sentiment_compound": -0.4449
        },
        {
            "id": "gwc2nw3",
            "score": 2,
            "text": "People who immigrate are generally go-getters, people who take action. Unfortunately, when they leave the ones left behind are generally worse off.",
            "title_similarity": "0.44555238",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gwc30a0",
            "score": 2,
            "text": "Not surprised, my boss is an immigrant. She built her business from the ground up, and kept us all employed during the pandemic. I have no clue how she manages it all while raising two kids. She’s incredible.",
            "title_similarity": "0.57816136",
            "sentiment_compound": -0.434
        },
        {
            "id": "gwc3ip5",
            "score": 1,
            "text": "So it says that \"Past research with labor supply-oriented analyses often paints immigrants as competing with local workers and depressing wages, while natural experiments often show more positive results of immigrants, according to the research.\"\n\nI don't think I have ever seen any studies regarding this or even heard people talk about it before. Most of what I have heard and read about immigration and it's impact on local workers has been around illegal immigration and not regular immigration. Have I just been out of the loop on these discussions and articles?\n\nThe article also says that \"Between 2005 and 2010, 0.83% of immigrants in the workforce started a business, compared to 0.46% of native-born individuals; immigrants exhibit an 80% higher entrance rate into entrepreneurship, according to the research.\"\n\nThe sight blocked itself off so I can't click on the main article anymore to see if they had numbers posted. Could this difference come down to say 100 immigrants in the work force and 20 of them started a business compared to 1,000 native born in the workforce and 100 started a business? This shows percentage wise the native-born have less start ups then immigrants, when the actual number created is higher.\n\nIf anyone has a link to the main research that would be great as well, thanks!",
            "title_similarity": "0.6490859",
            "sentiment_compound": 0.9223
        },
        {
            "id": "gwc4q6i",
            "score": 1,
            "text": "Job Creators: \"they terk our jerbs!\"",
            "title_similarity": "0.42481083",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwc5pm4",
            "score": 1,
            "text": "and what branch of science would this be then?",
            "title_similarity": "0.08882674",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwc88rq",
            "score": 1,
            "text": "Sheer observation tells one this is true.  And I am thinking folks from across our \"Southern Border.\"  This is purely anecdotal, but in my community, there are numerous shuttered 7-Elevens, Pizza Huts  Long John Silvers, and other fast food/convenience stores that have reopened as Latino Markets, Mexican Restaurants, Taquerias and Small Bars.  And this doesn't  include service oriented business-cleaners, tailors, cobblers, small repair shops, etc.  And then there are the landscape, handymen, roofers, general construction, delivery services, small businesses started by immigrants.     \n\nOf course I am assuming these folks are immigrants but pretty confident they are.  The reality is every community in this nation has need for plumbers, electricians, framers, auto repair, small appliance repair; the list goes on.  And many immigrants either come with this these skill or a strong desire to learn them.  \n\nIt is a flat out contradiction of these folks are coming solely to get US benefits or to take jobs from native-born Americans.  These folks come in to fill jobs that go wanting and, for the most part, immigrants come to this country looking for work and to get ahead.  They tend to be the best modern-day example of participating in the so-called American Dream-work hard, play by the rules (OK, some are here \"illegally\" but they would follow a legal route if it 1) wasn't so convoluted and 2) did not have so many delays.)",
            "title_similarity": "0.32158035",
            "sentiment_compound": 0.9841
        },
        {
            "id": "gwc8bec",
            "score": 1,
            "text": "This is likely true but I know a lot of people with certain ethnic backgrounds who get employed by immigrant business owners because of their race and they are paid very poorly.\n\nThis is something that I’d be interested in seeing a study on, because I’m all for proper immigration/assimilation but I know of situations that seem very ethnocentric and provide very poor working conditions.",
            "title_similarity": "0.56861323",
            "sentiment_compound": 0.3634
        },
        {
            "id": "gwc8t6p",
            "score": 1,
            "text": "More demand lower wages, conglomerates way of getting cheap labour, a ‘champion of workers’ should be against it",
            "title_similarity": "0.5122689",
            "sentiment_compound": -0.5059
        },
        {
            "id": "gwc991s",
            "score": 1,
            "text": "Yes, these are the people we want, and these are the legal immigrants. They are skilled laborers, some with money, and they are coming with the purpose for a better life for their family and kids. \n\nThese people are doctors, Entrepreneurs, Investors, and many Middle-Class citizens.",
            "title_similarity": "0.70927185",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gwc9ymu",
            "score": 1,
            "text": "Immigrants yes, this has never been disputed.  They paid a price to come to the Land of Opportunity specifically because of that opportunity.\n\n\nInvalids, criminal fugitives, and permanent wards of the state are the subject of current controversy, not legal immigrants.",
            "title_similarity": "0.5152198",
            "sentiment_compound": 0.6774
        },
        {
            "id": "gwc9zik",
            "score": 1,
            "text": "I work in construction retail and boy does this ring true. More immigrant workers starting as laborers continue on to start their own business than just about any other group.",
            "title_similarity": "0.7130262",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwca1sn",
            "score": 1,
            "text": "So if we would force everyone to immigrate somewhere the economy would explode?",
            "title_similarity": "0.42608133",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwca2h4",
            "score": 1,
            "text": "If only Republicans cared more about facts than nursing the cold hard hatred in their hearts, this might matter.",
            "title_similarity": "0.4421438",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gwcaac1",
            "score": 1,
            "text": "We been known this, mfs too racist to acknowledge it till now ig",
            "title_similarity": "0.27783018",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gwcat7w",
            "score": 1,
            "text": "This not new science. It is the most common sense. When there are more people in an economy, the economy is bigger (all other things equal). More people means more people need clothing, cars, grubhub, etc. This means more people need to do more jobs.\n\nThis is a ridiculous oversimplification but it's basically how it works.",
            "title_similarity": "0.8204355",
            "sentiment_compound": -0.1655
        },
        {
            "id": "gwcb790",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwcbges",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gwccg9l",
            "score": 1,
            "text": "You make is sound like it's a good thing that they come in and create new jobs and don't take away jobs from others.  You don't mention that these jobs they do find are low-paying, bottom-of-the-barrel jobs.   Some do gain skills to get out of that but a lot never move up financially.  Even when they do move up, their pay seems to stay the same so do you think it's a good thing?  Maybe it's a better thing than staying in Mexico?  Or is this just like some of the Middle Eastern and European countries hiring people from various nations to perform their menial labor jobs right?   Some say this is just another form of slavery.  Also, if we keep just letting everyone in, there will be issues of not having enough jobs for all that do show up.  Or is it ok they just come in and hang out on government assistance?",
            "title_similarity": "0.63245666",
            "sentiment_compound": 0.8645
        },
        {
            "id": "gwcclie",
            "score": 1,
            "text": "Immigrants are what keeps America young. American citizens aren't having that many children.  China is about to be nothing but old people soon. And that will be a huge burden on their country.  The US just keeps importing young people. As long as we educate them and provide opportunity there's no reason they can't be productive citizens.",
            "title_similarity": "0.60726637",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcdkcn",
            "score": 1,
            "text": "This is true. Ive witnessed it over and over again.",
            "title_similarity": "0.23820995",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gwce3j1",
            "score": 1,
            "text": "That is a great study and should be pushed",
            "title_similarity": "0.38319147",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwce6c0",
            "score": 1,
            "text": " That's because immigrants have a huge advantage over US citizens who are most likely strapped with ridiculous student loans and a terrible education system, among other trends. Plus, they are more likely to take risks because they believe in the American Dream. A US citizen knows better.",
            "title_similarity": "0.7037679",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwceaps",
            "score": 1,
            "text": "Yeah I mean this is pretty common knowledge from people that have a basic understanding of economics. Sadly, people still believe the opposite",
            "title_similarity": "0.45287275",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gwcf27h",
            "score": 1,
            "text": "how can that be?! america is a racist country, i dont believe this.",
            "title_similarity": "0.28887102",
            "sentiment_compound": -0.6476
        },
        {
            "id": "gwcfhoa",
            "score": 1,
            "text": "I also think, traveling broadens the mind.. And you see how certain countries do it better than others and if it's not being done the most efficient way...there is a gap in the market for improvement and most of the time anything improved is like 100% better. \nI'm English and I grew up in Spain and moved to Norway and the wage in Norway is super high compared to Spain  and it put me in the right frame of mind to make the most of my time there and I enjoyed my free time as much as the next...I managed to save up 49.000€ which is about 60.000$ in 6 years. I went to Norway with 300€ and I was a waitress when I got to Norway..and by the end of it I had managed 2 restaurants...I do speak fluent English and Spanish and I put the effort into learning Norwegian so having those skills has always been helpful. \n And when a night out costs you a week wage in you're home country you prioritize and it's also sometimes about making sacrifices. \nI have had ONE dream all my life and it was to own a property mortgage free by the time I was 40 and retire by 45 (now I don't wish to retire I love my work I love giving people a great experience and in the hospitality business I found that) \nAnd I have done that by age 28 and I have two kids under 3. When you put good vibes out there and you are true to you're convictions it's amazing what one can do.\nThen covid happened and it's forced me in a way and now I'm opening up my first business but I am fortunate enough to have a great family behind me and a partner who supports any decision I make...",
            "title_similarity": "0.7392308",
            "sentiment_compound": 0.992
        },
        {
            "id": "gwcfih9",
            "score": 1,
            "text": "Baloney!  Like to know where you get your stats from.  You failed to mention that.",
            "title_similarity": "0.12684408",
            "sentiment_compound": -0.2714
        },
        {
            "id": "gwcfz5m",
            "score": 1,
            "text": "This not news to anyone running a business. Labor shortages hurt everyone.",
            "title_similarity": "0.30750132",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gwcg2uj",
            "score": 1,
            "text": "There’s bound to be some correlation as far as tax breaks for foreign born entrepreneurs.  We have a family friend who’s opened two businesses and claims the tax breaks made it possible because he’s Canadian.",
            "title_similarity": "0.4939911",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gwcgl7n",
            "score": 1,
            "text": "I once watch a bbc documentary on immigrants living in britain. The research showed that immigrants had created money and jobs in the societies that they lived in. Much opposite to the common narrative by native people who claim that immigrants come and \"steal\" thier jobs.\n\nPersonally I found that 1st and 2nd generation immigrants to be very hungry for opportunities and hard working. Some were working two jobs and sometimes even owned establishments where they worked. Loads had gone onto buying thier 2nd or 3rd home. While the same native borns were still on the doll and on the cans.",
            "title_similarity": "0.6737171",
            "sentiment_compound": 0.0679
        },
        {
            "id": "gwchjf5",
            "score": 1,
            "text": "How many of those are non Union low paying jobs?",
            "title_similarity": "0.33595377",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwchnqd",
            "score": 1,
            "text": "They also only hire immigrants to work there which doesn't help unemployment at all",
            "title_similarity": "0.39873645",
            "sentiment_compound": 0.0382
        },
        {
            "id": "gwci6rf",
            "score": 1,
            "text": "Of course they do, everyone knew this",
            "title_similarity": "0.18560751",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwci8hc",
            "score": 1,
            "text": "How sustainable are those jobs though?\n\n&#x200B;\n\nNot disagreeing, just want to know if this is spun.",
            "title_similarity": "0.4718779",
            "sentiment_compound": 0.2057
        },
        {
            "id": "gwcicaj",
            "score": 2,
            "text": "Legal, vetted immigrants do. However, Illegal \"Undocumented\" immigrants are paid under the table. Massive amounts of cheap workers push down the cost of labor, and by extension, leads to lower wages for legal citizens.",
            "title_similarity": "0.65512276",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gwcij3d",
            "score": 1,
            "text": "They have a work ethic and don’t feel entitled.",
            "title_similarity": "0.26080468",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwcil2s",
            "score": 1,
            "text": "mental gymnastics is my favorite sport.",
            "title_similarity": "0.38546252",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gwcioer",
            "score": 1,
            "text": "The problem I have with illegal immigration is the validation of who is coming into the country it could be used for nefarious plans, the normal people wanting to come here for a better life, have no problems. I am thinking of gangs or even say terrorists using it to get in the country relatively undetected. There are other countries that use the Mexican border to immigrate illegally.",
            "title_similarity": "0.44060838",
            "sentiment_compound": -0.7385
        },
        {
            "id": "gwcktwb",
            "score": 1,
            "text": "Bull s***t I work in Elkhart county, rv manufacturing capital of the world!!! You are wrong!!",
            "title_similarity": "0.4000938",
            "sentiment_compound": -0.6449
        },
        {
            "id": "gwckvgn",
            "score": 1,
            "text": "Did they take into consideration that immigrants have an easier time gaining access to capital than native born Americans of color?",
            "title_similarity": "0.7474248",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gwcl2pk",
            "score": 1,
            "text": "Wow, so immigrants create more jobs and commit less crime than people born in the US. It’s almost as if immigrants aren’t the evil scary boogeymen that racists think they are.",
            "title_similarity": "0.78423476",
            "sentiment_compound": -0.7694
        },
        {
            "id": "gwcldnq",
            "score": 2,
            "text": "The actual study is behind a pay wall and this doesn't answer if  the total number of jobs created is greater, equal to, or less than the total number of immigrants. \n\n&#x200B;\n\nIt would be interesting if we could convince say 50K immigrants to all move to Detroit,   since that should totally fix the economy there.   :)",
            "title_similarity": "0.60051596",
            "sentiment_compound": 0.8998
        },
        {
            "id": "gwclu7e",
            "score": 1,
            "text": "interesting enough when I was in my hr management class talking about labor force professor also said immigrant on a productivity basis has higher value compared to the natural-born citizen.",
            "title_similarity": "0.77953804",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwcmnkr",
            "score": 2,
            "text": "That's great and all but unfortunately a lot of immigrant business owners bring in there superiority attitudes towards work and they commit a lot of wage theft.",
            "title_similarity": "0.6739631",
            "sentiment_compound": 0.6542
        },
        {
            "id": "gwcmzps",
            "score": 2,
            "text": "Yeah, this country must be really racist and xenophobic if immigrants are so successful here huh?",
            "title_similarity": "0.41769135",
            "sentiment_compound": 0.4163
        },
        {
            "id": "gwcnbqg",
            "score": 1,
            "text": "What has this got to do with science?",
            "title_similarity": "0.15947135",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcp1d2",
            "score": 1,
            "text": "You can really see the % of children that browse sub.",
            "title_similarity": "0.3970933",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcp9gx",
            "score": 1,
            "text": "I wonder how many of them had citizenship when they started the business?  A high percentage is my guess.",
            "title_similarity": "0.6607475",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcpbw6",
            "score": 1,
            "text": "This study doesn't mention whether the wages/salary they take vs What the existing populace gets, or has in labour laws which immigrants likely won't be aware of.\n    \nE.G.  Tim Horton's in Canada pays abysmal wages and forces brutal hours on people.   Therefore local people know better than to apply for the jobs they always have available.    New immigrants, however, won't know that and can get trapped.   \n   \nE.G.2. McDonald's Canada was caught abusing Temporary Foreign Workers.   They were under paying them and also forcing more than a dozen people to live communally in a tiny apartment.   This study would have counted those as immigrant jobs.   The problem is that those were immigrant jobs *because locals would never have accepted such illegal behaviour.*",
            "title_similarity": "0.5083381",
            "sentiment_compound": -0.9404
        },
        {
            "id": "gwcpez6",
            "score": 1,
            "text": "But that’s not what bubba from the gas station said.",
            "title_similarity": "0.05111456",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcpkr4",
            "score": 1,
            "text": "So “dah tuk r johbs!” Is  actually “there gimmin me a johb?”",
            "title_similarity": "0.23435016",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcppx3",
            "score": 1,
            "text": "Wages are affected by supply of labor...   period...    Propaganda and science are two different things...   This is a science page not a pseudoscience page!!!!",
            "title_similarity": "0.51041067",
            "sentiment_compound": -0.4367
        },
        {
            "id": "gwcpyzs",
            "score": 1,
            "text": "Without reading the article or knowing anything about the authors, my mom will say “oh that’s just written by libruls”",
            "title_similarity": "0.17621514",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcpzts",
            "score": 1,
            "text": "Is this evidence that our society, lack of racism, and capitalism is better than most if not all of the rest of the world if a million immigrants a year come here and strive?",
            "title_similarity": "0.83456624",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwcrfc5",
            "score": 1,
            "text": "Tell this to all the resumes that I send out that get rejected cause a Latino who will accept far less pay for the same job sends a resume as well",
            "title_similarity": "0.41659504",
            "sentiment_compound": 0.0754
        },
        {
            "id": "gwcrmz3",
            "score": 1,
            "text": "The American school system focuses on how you can be a worker for someone else, not on how to be a business leader.",
            "title_similarity": "0.37847874",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcrrfa",
            "score": 1,
            "text": "Maybe... Just maybe... We should revise the education system from creating drones to creating leaders...",
            "title_similarity": "0.36241555",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gwcs2aa",
            "score": 1,
            "text": "We should be hoping for more immigrants, not less. Immigrants are net positive for virtually everybody.\n\n[https://www.bushcenter.org/catalyst/north-american-century/benefits-of-immigration-outweigh-costs.html](https://www.bushcenter.org/catalyst/north-american-century/benefits-of-immigration-outweigh-costs.html)\n\n[https://www.pbs.org/newshour/economy/making-sense/4-myths-about-how-immigrants-affect-the-u-s-economy](https://www.pbs.org/newshour/economy/making-sense/4-myths-about-how-immigrants-affect-the-u-s-economy)\n\n[https://www.cbpp.org/research/poverty-and-inequality/immigrants-contribute-greatly-to-us-economy-despite-administrations](https://www.cbpp.org/research/poverty-and-inequality/immigrants-contribute-greatly-to-us-economy-despite-administrations)\n\n[https://www.brookings.edu/wp-content/uploads/2016/07/braingain\\_chapter.pdf](https://www.brookings.edu/wp-content/uploads/2016/07/braingain_chapter.pdf)\n\n[https://www.cato.org/blog/14-most-common-arguments-against-immigration-why-theyre-wrong](https://www.cato.org/blog/14-most-common-arguments-against-immigration-why-theyre-wrong)\n\n[https://www.epi.org/publication/immigration-facts/](https://www.epi.org/publication/immigration-facts/)\n\n[https://www.splcenter.org/news/2007/05/08/immigration-getting-facts-straight](https://www.splcenter.org/news/2007/05/08/immigration-getting-facts-straight)",
            "title_similarity": "0.7229022",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gwcscfr",
            "score": 1,
            "text": "Oh no! Science has undermined a conservative talking point.  \n\nWill conservatives (a) try to challenge the credibility of the article based on data validation issues; (b) try to challenge the credibility of the article based on inability to reach the same conclusion using the same data; or (c) rest on their laurels and assume anyone they feel is a constituent has such a robust confirmation bias that they can just state *the science is biased* and ignore studies, data, and conclusions, that don’t neatly align with their world view as if they are breathing air.",
            "title_similarity": "0.35010782",
            "sentiment_compound": -0.6114
        },
        {
            "id": "gwcsmbt",
            "score": 1,
            "text": "This is where the cross section of minimum wage comes into play. be guaranteed $15 an hour or $2100 a month (21 full working days) for some one that has the average of a 3rd grade education just isn't functional.",
            "title_similarity": "0.46954578",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwcu4j0",
            "score": 2,
            "text": "I'd be interested to see the difference of legal immigrants vs illegal.",
            "title_similarity": "0.39597973",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwcup2w",
            "score": 1,
            "text": "If you have nothing to lose you take risks",
            "title_similarity": "0.15495445",
            "sentiment_compound": 0.0408
        },
        {
            "id": "gwcutic",
            "score": 1,
            "text": "But “thurrr terk errr jerrrrbs”, I thought.",
            "title_similarity": "0.20983271",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcuv3s",
            "score": 1,
            "text": "And this belongs to r/science?",
            "title_similarity": "0.15218621",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcv182",
            "score": 1,
            "text": "They're makin' our jaarbs!!",
            "title_similarity": "0.26112133",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwcw46f",
            "score": 1,
            "text": "It’s all about the money, no matter what degree or specialty you come this country with the idea is to get you to start over and go through their system so you can pay into it, simple",
            "title_similarity": "0.48079026",
            "sentiment_compound": -0.1871
        },
        {
            "id": "gwcwbk2",
            "score": 1,
            "text": "Doesn’t matter what the facts are. People will still drone on endlessly about how the immigrants are taking their jobs.",
            "title_similarity": "0.42255974",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gwcwdwd",
            "score": 1,
            "text": "Finally an honest post",
            "title_similarity": "0.1520716",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gwcx0s1",
            "score": 1,
            "text": "I'm an immigrant myself and honestly I don't know what to believe. The other day I saw a video of some people reading about a research that showed that immigration is bad in the overall. Then I remember that commercial that talks about all of the good deeds of a great leader and they they show that the great leader was Hitler and the point was to show how one can tell a lie by only saying the truth.",
            "title_similarity": "0.49684832",
            "sentiment_compound": 0.9169
        },
        {
            "id": "gwcx4z2",
            "score": 1,
            "text": "So how does that help wages? Because otherwise this is another \"GDP is the only thing that matters, infinite growth FTW!\" that doesn't necessarily translate into wage growth and social equity and efficient use of resources.",
            "title_similarity": "0.6410284",
            "sentiment_compound": 0.9303
        },
        {
            "id": "gwcx59i",
            "score": 1,
            "text": "Not surprised at all. Most 'Mericans who rant aganist immigrants are illiterate, forgetting that their ancestors came here on a rickety, wooden ship.",
            "title_similarity": "0.29833263",
            "sentiment_compound": -0.5155
        },
        {
            "id": "gwcy7g9",
            "score": 1,
            "text": "Seems like this has always been true. Not the scary \"they're taking our jobs\" narrative",
            "title_similarity": "0.39571077",
            "sentiment_compound": 0.7862
        },
        {
            "id": "gwcyf36",
            "score": 1,
            "text": "We are first generation immigrants. My dad has at least 30 employees. My uncle also owns his own business and probably has a good amount of employees. My grandfather did too though it was a small store/deli so no employees. Aunt has a real estate business (no idea if she has employees but she's rich). Other uncle runs a store (and was a physical therapist)\n\nAll other grandparents were janitors and cashier's. Their kids have decent white collar jobs. Their grandkids (the ones that immigrated) have graduate degrees. The other kids are in school or have college degrees.",
            "title_similarity": "0.5085041",
            "sentiment_compound": 0.7111
        },
        {
            "id": "gwcyfvd",
            "score": 1,
            "text": "You wanna ponder something disturbing? Check out the work ethic of an immigrant fresh off the boat to America, or fresh over the border whatever you fancy, and compare their morals and work ethic with their own grandchildren. Two generations later and they turn into the same lazy shits that were complaining about the immigrants when their grandparents came.",
            "title_similarity": "0.45739335",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gwcyzgs",
            "score": 1,
            "text": "Another fun fact is immigrants are more likely to move around for work. \n\nIt doesn't do our labor force much good if the location of demand for labor is to far from the labor itself.",
            "title_similarity": "0.7108362",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gwczfzu",
            "score": 1,
            "text": "They took our joooobb creating.",
            "title_similarity": "0.2605676",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwd07kx",
            "score": 1,
            "text": "Great, now let's talk about *illegal* immigration.",
            "title_similarity": "0.21116287",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwd1i1u",
            "score": 1,
            "text": "Some people see job as a limited resource, which is wrong. More people means more needs, means more jobs. Also, most of the time immigrants take jobs locals don't want.",
            "title_similarity": "0.6695898",
            "sentiment_compound": -0.6395
        },
        {
            "id": "gwd1ptc",
            "score": 1,
            "text": "That's because they have so much experience developing new ways to get over walls.",
            "title_similarity": "0.5368623",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwd1vx7",
            "score": 1,
            "text": "They toook our jaaaaabbssss!!!",
            "title_similarity": "0.26794714",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwd207x",
            "score": 1,
            "text": "Because I have tried running the business, didn't like it. but I make a good second to highly motivated people like you.",
            "title_similarity": "0.51246536",
            "sentiment_compound": 0.9077
        },
        {
            "id": "gwd21fa",
            "score": 1,
            "text": "Dey tuk uhr entrepreneurials",
            "title_similarity": "0.4056402",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwd3a3s",
            "score": 1,
            "text": "But dey took our jobs!",
            "title_similarity": "0.36299536",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwd3bff",
            "score": 1,
            "text": "Can someone explain how expanding the labor supply doesn’t lower the value of the laborers that currently live here? Expanding the labor supply and starting competing businesses are not net positives for American workers.",
            "title_similarity": "0.6648001",
            "sentiment_compound": -0.3769
        },
        {
            "id": "gwd3yhj",
            "score": 1,
            "text": "I guess economics is apart of stem but not really science... why is this here and not taken down?",
            "title_similarity": "0.3512419",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwd3yvs",
            "score": 1,
            "text": "Yeah because at least in Aus, an immigrant is much less likely to get a real job they're qualified for. I decided to put an English name on my resume and got more calls for interviews in 3 weeks than I had for 6 months. \n\nShout out to that one contract though who gave me job and regularly trotted me out to show how diverse they were...",
            "title_similarity": "0.53856397",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwd4b15",
            "score": 2,
            "text": "Imagine carrying an entire country and being blamed for all it's problems by uneducated racists.",
            "title_similarity": "0.38392437",
            "sentiment_compound": -0.8519
        },
        {
            "id": "gwd53eo",
            "score": 2,
            "text": "México says: You're welcome.",
            "title_similarity": "0.24747762",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gwd5t9e",
            "score": 1,
            "text": "I've always supported the idea of giving citizenship to those who can pay for it or giving them priority, even selling citizenship would be profitable. They would only be a benefit to nations if they can pay millions for citizenship and go on to create businesses and invest in the country.\n\nNow I would like to know how many of these jobs actually pay more than minimum wage or even a living wage.",
            "title_similarity": "0.7379308",
            "sentiment_compound": 0.9246
        },
        {
            "id": "gwd61g2",
            "score": 1,
            "text": "God are Republicans right about ANYthing?!",
            "title_similarity": "0.35829684",
            "sentiment_compound": 0.3382
        },
        {
            "id": "gwd61gp",
            "score": 1,
            "text": "It’s no mistake that waves of immigrants have been funded for entrepreneurship. It’s geopolitical in the end so I don’t buy the way this leaves out government policy that encourages and supports select groups at certain times during our country’s history",
            "title_similarity": "0.711109",
            "sentiment_compound": 0.8194
        },
        {
            "id": "gwd6o4s",
            "score": 1,
            "text": "What? Now they are not only taking our job opportunities away but also taking our job creation opportunities away?!! s/....",
            "title_similarity": "0.43968448",
            "sentiment_compound": 0.8314
        },
        {
            "id": "gwd78ft",
            "score": 1,
            "text": "Overturn Plyler vs Doe !",
            "title_similarity": "0.19419387",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwd7a1j",
            "score": 2,
            "text": "Nothing but the true. Not all its butterflies and rainbows but in Colombia, Venezuelan inmigration has been booming and there's many of them creatin companies and jobs in areas that were before  in ruins.",
            "title_similarity": "0.5812674",
            "sentiment_compound": -0.7716
        },
        {
            "id": "gwd7n7j",
            "score": 2,
            "text": "The argument that immigrants steal jobs is laughable. Most jobs require consumers for the job to exist... As more consumers enter the economy (I.E children becoming adults, immigrants) more jobs are required to maintain the level of consumerism. It isn't even just consumerism, but EVERYTHING we do. From food production to clothing manufacturing... From small businesses to large... More people means larger markets means more jobs. People who argue the opposite forget that markets grow and contract, they are by no means stagnant.",
            "title_similarity": "0.8006268",
            "sentiment_compound": -0.875
        },
        {
            "id": "gwd7zib",
            "score": 1,
            "text": "In my country is as the suty found. They created more jobs in the police amd social assistance than ever",
            "title_similarity": "0.666047",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwdayp3",
            "score": 1,
            "text": "That's funny because I s*** you not I've been saying this for years.\n\nAll the kids I went to school with whose fathers were contractors and became contractors themselves shortly thereafter were all very very pro \"free movement of labor and capital\" because they were using cheap labor from Mexico to undercut their competition.\n\n25 years later they're howling because all those guys that they used to drive their competition out of business have started their own contracting business and they're using Central American labor to drive them out of business.",
            "title_similarity": "0.58639437",
            "sentiment_compound": 0.7745
        },
        {
            "id": "gwdbf4f",
            "score": 1,
            "text": "Native-born are always lazier than immigrants.",
            "title_similarity": "0.584633",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gwdbtg7",
            "score": 1,
            "text": "What about the illegal ones?",
            "title_similarity": "0.07889399",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwdcb0t",
            "score": 1,
            "text": "That makes sense because the people who can move to different countries for a better life are often more ambitious and more intelligent.. because the government (in the us at least) doesn't tend to let poor uneducated people in . There are tons of exceptions of course but I he average immigrant is gonna be smarter than the average american.",
            "title_similarity": "0.79855335",
            "sentiment_compound": 0.8043
        },
        {
            "id": "gwdcc66",
            "score": 1,
            "text": "I'm one of those data points.",
            "title_similarity": "0.11968294",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwdcm7b",
            "score": 1,
            "text": "The question is which immigrants?",
            "title_similarity": "0.24721019",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwdda3x",
            "score": 1,
            "text": "Racism is still a thing sadly. Even though now it’s hidden with all the movements and people easily able to share unfairness. The USA misses on so many things by being one of the few nations promoting racism as if by history everyone didn’t come form the same place.",
            "title_similarity": "0.37143576",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gwde2o8",
            "score": 1,
            "text": "And what's the extent to which these new jobs also go to immigrants? If you create jobs but only for your sub-group, you're not benefitting society as a whole.",
            "title_similarity": "0.623231",
            "sentiment_compound": -0.3734
        },
        {
            "id": "gwdeq7g",
            "score": 1,
            "text": "I support refugees and dreamers and anyone who loves and contributes to this country.  \n\nThat said, my life experience conflicts with these sorts of articles.  Economies operate on supply and demand having more people willing to do a job drives down wages/salaries/value of work.  I work as a software engineer and it was a better job 15 years ago.  It was easier to find work, it was paid better, and engineers were treated better.  Today companies do anything and everything to ship those jobs overseas via foreign contractors and engineers are treated as commodities.\n\nUnless immigrants are creating a market, being entrepreneurs is decreasing opportunity for american citizens not increasing it.\n\nI support lifting people out of poverty and helping those who need help, but immigration policies as they exists today do a lot for businesses at the cost of workers and dont do enough for those who are truely desperate.",
            "title_similarity": "0.7340603",
            "sentiment_compound": 0.8225
        },
        {
            "id": "gwdflcz",
            "score": 1,
            "text": "You mean immigrants who have arrived with id and have went thru the legal process of immigration of course. Like when there was a Ellis island, and people registered and where tested for disease and stuff.",
            "title_similarity": "0.3291214",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gwdgkyr",
            "score": 1,
            "text": "Instead of bypassing the immigration law with EO’s, congress should make it easier. Let people register get some kind of id and stuff and then immigrants can live here without looking behind them all the time. That’s the correct way. If we are such a horrible country why don’t they run for the Canadian border. When my father’s brother (they were naturalized citizens) took his family back to Austria to live they had to drop there US citizenship.",
            "title_similarity": "0.47272852",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gwdh0fc",
            "score": 1,
            "text": "This is absolutely true. You seem to intentionally be leaving out “legal” immigrants! I am surrounded by extremely successful immigrants and have family that are very successful and completely self made. They all went through the process of becoming legal citizens. Some went the route of gaining their legal status through the military fighting for the country they want to be a part of.",
            "title_similarity": "0.59211576",
            "sentiment_compound": 0.9345
        },
        {
            "id": "gwdh471",
            "score": 1,
            "text": "Immigrants are Americans and Americans are immigrants.",
            "title_similarity": "0.45854354",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwdkm4z",
            "score": 1,
            "text": "That’s because we basically run from a nightmare of a life towards a dream and we’re willing to risk everything to get there.",
            "title_similarity": "0.31286788",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gwdkrxi",
            "score": 1,
            "text": "I don't think that many people really have a concern about immigration, moreso illegal immigration.\n\nYes there are some who have issue with traditional immigration, but IMO that is a very small minority even on the Republican side.",
            "title_similarity": "0.48211968",
            "sentiment_compound": -0.1154
        },
        {
            "id": "gwdn06l",
            "score": 1,
            "text": "Hint, it was never about da jerbs.",
            "title_similarity": "0.031135196",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwdnaaw",
            "score": 1,
            "text": "Colonizers propaganda be like this though\n\nThis reads like something they would have said to natives 200 years ago.\n\n\"Nah man, this is good for you - you weren't using that land *efficiently* enough anyways.\"",
            "title_similarity": "0.40277618",
            "sentiment_compound": 0.802
        },
        {
            "id": "gwdpjzk",
            "score": 1,
            "text": "Ok  but we are concerned with illegal immigration.  Not legal immigrants.",
            "title_similarity": "0.20798308",
            "sentiment_compound": -0.7055
        },
        {
            "id": "gwdsg0i",
            "score": 1,
            "text": "OK about work ethic;my dad tried to get higher wages,but we were POOR.OREGONIANS ARE POOR,NO INDUSTRY. WHAT do educated and smart Oregonions do?MOVE TO A BETTER STATE.OREGON always ENCOURAGES POVERTY.MIDDLE CLASS Oregonians have all left, c ause  middle class needs good paying jobs.--Which liberal left and socialists  do not like. THEY HATE BUSINESS AND INDUSTRY..SO, these extreme liberal lefties  here DISCOURAGED  SMALL AND LARGER BUSINESS.  Believe me,the leaders AND RADICALS HERE HATE INDUSTRY, so this govt.discourages  middleclass to live here. Our population now is very rich and very poor.Nothing in the middle. MOUNTAINS .that's it.",
            "title_similarity": "0.5504782",
            "sentiment_compound": 0.9225
        },
        {
            "id": "gwdzwrt",
            "score": 1,
            "text": "yup, that sounds about right.",
            "title_similarity": "0.11980666",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwe7jc7",
            "score": 1,
            "text": "That comment is true for legal immigrants, not true for those illegally crossing the border.",
            "title_similarity": "0.40506837",
            "sentiment_compound": 0.2425
        },
        {
            "id": "gwe9v1f",
            "score": 1,
            "text": "I created at least 10 jobs since immigrating in 2011, many of them still held.",
            "title_similarity": "0.5274616",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwedyy5",
            "score": 1,
            "text": "How does this reconcile with the idea of  racial privilege if the primary job creators across all sectors aren't native born? This seems to sharply contrast the idea of inborn privilege as causal to outcome. Is this a matter of generational wealth on average favoring foreign born individuals? Or is it access to foreign resources and labor markets acting as force multipliers in seeding entrepreneurs? \n\nIn either case, how is it that existing social hierarchies can be prejudicial and exclusionary while the labor market is primarily driven by racially and culturally diverse business owners at all sizes? Is the current assessment of stratified racial privilege driving disparity of outcome among racial groups incorrect? Would appreciate some expert analysis on this.",
            "title_similarity": "0.65663147",
            "sentiment_compound": 0.9129
        },
        {
            "id": "gwee1cd",
            "score": 1,
            "text": "It's called the lump of labour fallacy.",
            "title_similarity": "0.2505216",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwek855",
            "score": 1,
            "text": "Ah. So the natives are the problem. Gotcha.",
            "title_similarity": "0.21518293",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gweommu",
            "score": 1,
            "text": "Your statement is rather broad. Where does your raw data originate and who paid for the study?\n\nThanks",
            "title_similarity": "0.47259682",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwew00t",
            "score": 1,
            "text": "Immigrants make America great",
            "title_similarity": "0.67601264",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwex5di",
            "score": 1,
            "text": "They obviously didn't take into account the illegal kind in this.",
            "title_similarity": "0.1361582",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gwf4nok",
            "score": 1,
            "text": "Yes, because in western society we get the wealthiest ones.  The people able to work, and provide.   This benefits us greatly yet it hurts developing nations as only the poor, and destitute are left behind.",
            "title_similarity": "0.7078167",
            "sentiment_compound": 0.3477
        },
        {
            "id": "gwfbvz9",
            "score": 1,
            "text": "Could not getting hired by companies because of your ethnic name/accent/background be a factor for this as well? The thinking might be \"I'm not getting hired in local companies so I might as well try to start my own business\"",
            "title_similarity": "0.35067612",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gwff5yg",
            "score": 1,
            "text": "I guarantee they lumped illegal and legal immigrants together.",
            "title_similarity": "0.35530853",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gx2vigc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.12546399"
        },
        {
            "id": "gxeqmih",
            "score": 1,
            "text": "If you ask me, this was probably pretty obvious to everyone but xenophobic people. It doesn’t take long to think about the number of immigrant (first and second generation) business owners we all know.",
            "title_similarity": "0.5657796",
            "sentiment_compound": 0.3716
        }
    ]
}