{
    "Houses in flood zones in the US are currently overvalued by a total of $43.8 billion based on information in publicly available flood hazard maps, raising concerns about the stability of real estate markets as climate risks become more severe.\n": [
        {
            "id": "gwj0p89",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.40255618",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gwj9mh9",
            "score": -5,
            "text": "Gonna be a wild ride living in Florida, watching what happens to all the rich assholes with their beach homes and homes near bayous the next ten or twenty years.",
            "title_similarity": "0.5310421",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gwj0t09",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.045819156"
        },
        {
            "id": "gwj5x4l",
            "score": -18,
            "text": "EVERYTHING IS OVERVALUED IN THE US.. this is truly why there is turmoil here.. CLASSISM is the real oppressor, those with wealth have power, and that power is used to keep those without wealth pitted against each other to keep the wealth where it is",
            "title_similarity": "0.5904086",
            "sentiment_compound": 0.6336
        },
        {
            "id": "gwjbait",
            "score": -7,
            "text": "If you make this about money, maybe republicans will start to care. It’s happening a little in Florida.",
            "title_similarity": "0.37904114",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gwj0quz",
            "score": 10,
            "text": "[deleted]",
            "title_similarity": "0.0027114046"
        },
        {
            "id": "gwj4n8u",
            "score": 17,
            "text": "[deleted]",
            "title_similarity": "0.0027114046"
        },
        {
            "id": "gwke4zx",
            "score": 0,
            "text": "oh no, all the boomers who've consistently voted against environmental regulations and who have also driven up home prices by campaigning against new construction in order to inflate their own home values are all going to get completely screwed, I feel so bad for them!",
            "title_similarity": "0.6478353",
            "sentiment_compound": -0.7633
        },
        {
            "id": "gwk3hfm",
            "score": 1,
            "text": "The sea level rises approximately 3.3 millimeters/year according to NASA. That is 1 ft every 92 years. Almost 100% of flood incidents have nothing to do with \"global warming\" and everything to do with stupid people building houses in flood zones and on manmade land along coastlines. People have known this for decades and still insist on building in these areas. In fact, the insurance industry refuses to sell flood insurance to the overwhelming majority of people living in these areas so the federal government has to subsidize flood insurance using tax payer money.\n\nIf you built or bought your house in a flood zone, don't whine when it floods. It is no different than people who built or bought a house on the side of a volcano and whine when the volcano erupts. In the end, nature is always going to win.",
            "title_similarity": "0.6765716",
            "sentiment_compound": -0.1506
        },
        {
            "id": "gwj874s",
            "score": 12,
            "text": "That my friends is why I moved to the Mojave. The lender said I would need flood insurance, the title company said, no, it's the MOJAVE DESERT!",
            "title_similarity": "0.50171626",
            "sentiment_compound": 0.5255
        },
        {
            "id": "gwjddd8",
            "score": -1,
            "text": "Clicked on the PNAS link you gave, was too long and hard for me to read.",
            "title_similarity": "0.43789923",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwj86nw",
            "score": 7,
            "text": "I don't see any evidence how this is related to a possible instability.\nThey found people don't care about that risk or just pay too much in their opinion. Wow people paying too much for a home. Crazy times...\nWheres the market instability?",
            "title_similarity": "0.55805445",
            "sentiment_compound": -0.4075
        },
        {
            "id": "gwjaogb",
            "score": -9,
            "text": "This is a setup for a govt land grab, mark my words.    Clowns in washington only care about enriching themselves.",
            "title_similarity": "0.45179707",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gwjaayo",
            "score": 8,
            "text": "Houses are sold in open auctions. Their value is what someone will pay for it. It is kind of impossible to be \"overvalued\" if lots of people are willing to pay for it. I think the card players by Cézanne is way overvalued but that's irrelevant to its value. When the authors conclude that risk isnt priced in I think they are trying to put an empirical value on an emotional decision. People have all different kinds of internal calculations for risk that arent rational to other people.",
            "title_similarity": "0.5696775",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gwj7bsj",
            "score": -19,
            "text": "I feel like the whole united states had become a hazardous zone, waiting to crash.  I guess the thing about danger zones is we don’t know when the disaster will strike... but it will.",
            "title_similarity": "0.58781946",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gwje21n",
            "score": 4,
            "text": "Flood zones are quite often overly cautious, without adequate research or reasoning. The house I just purchased is in an AE flood zone in florida. Flood insurance is very expensive. The house was built in 1940... no house on this street or any street within 20 square blocks has ever flooded in recorded history. Ever.",
            "title_similarity": "0.6567701",
            "sentiment_compound": -0.663
        },
        {
            "id": "gwjjh41",
            "score": 1,
            "text": "We paid $2200 in flood insurance this year and it will go up again next year. It sucks.",
            "title_similarity": "0.70504916",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gwj9xhp",
            "score": 30,
            "text": "Something to keep in mind is that almost everyone is at risk for flooding. It’s simply a matter of getting a whole lot of rain in one place at a time. The other thing is, when FEMA refers to a 100 year flood, that doesn’t mean it’s the worst flood in 100 years. What they’re actually saying is there is an equal or greater than a 1% chance that the same level of flooding will occur in the same year. \n\nThe FEMA maps showing flood zones are freely available online. It’s not just the idiots who build on barrier islands. We’re talking about people who live near a river, even a dry river bed will quickly flood with relatively little rain.",
            "title_similarity": "0.70254934",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gwj8980",
            "score": 171,
            "text": "As a Dutch guy: What is the problem? Half our country and basically every of our major cities (few exceptions) are build below sea level. \n\nBuild dikes!",
            "title_similarity": "0.5694103",
            "sentiment_compound": -0.4574
        },
        {
            "id": "gwj2nov",
            "score": 140,
            "text": "If the housing in flood zones is overvalued, one could also conclude that housing outside of flood zones is undervalued.",
            "title_similarity": "0.538448",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjbyn8",
            "score": 0,
            "text": "Instability in real estate markets? Perish the thought",
            "title_similarity": "0.53788686",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwje6aw",
            "score": 5,
            "text": "I’d take this study with a grain of salt. We are technically in a flood zone because they are developing the land, still grading it and the government won’t assess the land until the development is done. We show up as a flood hazard. The first construction phase right next to us got classified as non flood zone immediately when done so the same thing will happen to us. I think climate change is probably part of it, but I really think the real estate / development boom is driving it more. More homes in areas they are developing that haven’t been assessed",
            "title_similarity": "0.6763537",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwk1hq6",
            "score": 0,
            "text": "Wow no way! Are you saying capitalists are trying to screw people over for a quick buck!?",
            "title_similarity": "0.4673406",
            "sentiment_compound": 0.4184
        },
        {
            "id": "gwlnnup",
            "score": 0,
            "text": "That's insane. People should be moving north to Wisconsin, not buying shore houses. Every year they loose houses to hurricanes and then cry like babies about government bail outs from tax dollars. Need to grow a brain. The southern states aren't going to be habitable for much longer. It's also risky to live south because of tornados, droughts and wild fires. It's hotter in the north nowadays. Everything is changing and it could just flip really fast into disaster.",
            "title_similarity": "0.7266334",
            "sentiment_compound": -0.8948
        },
        {
            "id": "gwm3lp4",
            "score": 0,
            "text": "everything's a floodzone in the grand scheme of things",
            "title_similarity": "0.29856086",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gwmeo89",
            "score": 0,
            "text": "Is it weird that I couldn't care less about the stability of the real estate market?\n\nSounds like a problem for the rich who own multiple houses.",
            "title_similarity": "0.6386391",
            "sentiment_compound": 0.0186
        },
        {
            "id": "gwj9hwv",
            "score": -20,
            "text": "Im 36 years old from St. Petersburg Fl. I remember in the early 90s when I was in school, my teachers would preach climate change hysteria to us. They told us repeatedly that St. Petersburg WILL be underwater by 2010 (in about 20 years) due to the melting ice caps from evil man made climate change.\n\nLo and behold, the same beaches I visited as a child 30+ years ago remain unchanged. The multi-million dollar mansions remain, in fact, their value today is higher than they have ever been.\n\nThe irony of our teachers and celebrities preaching to us about climate change and cities like NYC, St. Pete, LA being under water \"in 20 years\" is that they routinely buy houses in these areas. \n\nThey believe nothing they say. Teachers are literally telling 5 year old children that the ocean is giong to wash away their homes and everything they own and love.... while at the same time, those same teachers dump their lifes savings and monthly paychecks into those same homes that they are preaching about.... And, same goes for celebrities. They all own beach front property.\n\nIs man made climate change real? Yea, probably. I dont think anyone knows for sure. But probably. Would I be overly concerned before I purchased a home in St. Petersburg, Florida? No.",
            "title_similarity": "0.71148753",
            "sentiment_compound": 0.1306
        },
        {
            "id": "gwj88u8",
            "score": 28,
            "text": "I like how stability here points out financial stability but clearly there is a psychological stability issue.  People are being willfully delusional towards the effects of climate change in order to maintain the status quo.  When the flood comes, though, they will turn and run.  But not until the moment the flood actually hits.",
            "title_similarity": "0.5690752",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gwje0ox",
            "score": 118,
            "text": "The United States commercial real estate market is estimated to be $16 trillion and the residential market $33.6 trillion.\n\nThis estimate represents a 0.1% over valuation. It is bizarre to say this represents a risk to stability.",
            "title_similarity": "0.7800316",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gwjbvoz",
            "score": 1,
            "text": "This is good for bitcoin.",
            "title_similarity": "0.21138525",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwjbx6c",
            "score": -1,
            "text": "I would never buy a house in the flood plain.",
            "title_similarity": "0.3040765",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjc8o6",
            "score": -1,
            "text": "Don’t worry, Aquaman can buy all the houses for his sea companions!",
            "title_similarity": "0.3605807",
            "sentiment_compound": -0.4926
        },
        {
            "id": "gwjf5ak",
            "score": 1,
            "text": "Flood maps are also outdated. Soooooo....we are fucked.",
            "title_similarity": "0.40128893",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gwjluga",
            "score": 1,
            "text": "The last three presidents prior to Biden have pushed trillion plus dollar tax cuts for corporations. \n\n43 billion is a drop in the bucket. Corporations and their CEOs can bail US out this time.",
            "title_similarity": "0.78007454",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gwk5s2k",
            "score": 1,
            "text": "I'd almost wager that the incredible rise in home prices **is** because of the likelihood of climate change impact. If realtors can get max value of an asset prior to the climate effects that would occur within a 30 year time span (be it that max valuation is within a 5-10, or in an optimistic scenario 15 years), then it would explain why the cost is so heavily front-loaded in worth. These climate impact models rely on the same statistic principles insurance companies use for assessing their rates as well. So it would make sense for them to try to liquidate the asset via a higher asking price and leave the homeowner in the bind when said asset is underwater once Mother Nature runs her course.",
            "title_similarity": "0.7672513",
            "sentiment_compound": 0.9186
        },
        {
            "id": "gwkdm02",
            "score": -1,
            "text": "Housing market aside, the stock market as a whole is about to crash while GME short squeezes.\n\nEverything is about to get messy, and the best hedge is to buy GME.",
            "title_similarity": "0.6960486",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwkxaoi",
            "score": -1,
            "text": "No. God’s not making more land. Land is a finite commodity and people that want it, will pay up for it. Hence, (gasp) values are market driven. Who cares about flood zones?",
            "title_similarity": "0.41028696",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gwl5c0d",
            "score": -1,
            "text": "I first heard about this way back in march, ended up raising rent again for better flood protection. Don't know how people afford to rent these days, in a year my renters pay me the original price of the entire property.",
            "title_similarity": "0.64185166",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gwlsrz4",
            "score": 1,
            "text": "Does anyone know when Miami will sink? It's not something that's covered daily.\n\nI can't wait to see florida 50ft under.",
            "title_similarity": "0.45580277",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjbyf8",
            "score": 2,
            "text": "Also those flood hazard maps are from the 30's and were compiled via a complex process of eyeballing and pure guessing.",
            "title_similarity": "0.52300525",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjcp6v",
            "score": -2,
            "text": "Propose a new law:\n\nSorry folks, if you house is in these flood zones, they only get bailed out one time.\n\nIt will take time, but eventually we will stop the bailouts.\n\nMaking it one more time will make it a little fairer to those who purchased with the expectation of the bailouts being in place.\n\nPrivate insurance can possibly fill the gaps.",
            "title_similarity": "0.51663995",
            "sentiment_compound": -0.4497
        },
        {
            "id": "gwjgirx",
            "score": 2,
            "text": "I was just taken out of the flood Insurance requirements.  Apparently someone must have complained to FEMA.  I live in an old neighborhood on porous limestone.  Rain naturally just goes away.\n\nHowever some of my neighbors are not so lucky.  It is a scam and again should be already included in property insurance.  Wind should also be part of the normal policy.  Florida is now trying to raise the rates because we only have one writer now, Citizens which is a state run company.  A total scam.",
            "title_similarity": "0.6307711",
            "sentiment_compound": -0.9236
        },
        {
            "id": "gwko81j",
            "score": -2,
            "text": "I’m sorry but al gore told my grandparents the house they rented out would be underwater in 20 years in the 90s. In 2009 they sold it and retired the water moved up 3 inches. At that rate it would take 300 years to go all the way to the house. I doubt many of these predictions",
            "title_similarity": "0.6535753",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gwjbr5g",
            "score": 20,
            "text": "Fun part,  the most expensive realestate is always in a flood zone.   Waterfront property is something that a lot of people think they need, and it's always the first to flood and get damaged.",
            "title_similarity": "0.6052357",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gwj9aca",
            "score": 3,
            "text": "these people now know, the information has been released they should sell up and move while they can... but I think we all know they will not.",
            "title_similarity": "0.27455133",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjgbs3",
            "score": 4,
            "text": "The real estate market is as irrational as the stock market.",
            "title_similarity": "0.64635485",
            "sentiment_compound": -0.34
        },
        {
            "id": "gwk0682",
            "score": -3,
            "text": "All these lands which should have been under water 20 years ago. Whatchu doing climate catch up son.",
            "title_similarity": "0.40212977",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwk42cr",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.0027114046"
        },
        {
            "id": "gwjf4np",
            "score": 3,
            "text": "Truth be told, that's actually a very low number. 50 billion is a very easily covered cost. Berkshire Hathaway could cover twice that amount with cash, and its only one company.\nIts argues strongly that mitigation and prevention are better than hysteria.",
            "title_similarity": "0.52311426",
            "sentiment_compound": 0.3976
        },
        {
            "id": "gwkmke9",
            "score": 6,
            "text": "We sold our house in Florida last year. It was two blocks from the water. A month after we sold it, FEMA re zoned it as a flood zone and flood insurance was mandatory. My friends in the neighborhood tell me all the new people moving in are Republicans. Apparently, they tend not to believe in climate change. The GOP dominated Florida legislature does very little about flooding. Rick Scot won’t even talk about it. So dumb.",
            "title_similarity": "0.58681166",
            "sentiment_compound": -0.4101
        },
        {
            "id": "gwjhfpx",
            "score": 18,
            "text": "Is anyone else thinking that $43 Billion isn’t that much money anymore?  Bezos is worth $200B.  \n\nThis also seems like a very low number.  With no supporting data whatsoever I would think this number would be so much higher with even portions of NYC, Miami, and Boston flooding.",
            "title_similarity": "0.68162346",
            "sentiment_compound": 0.1417
        },
        {
            "id": "gwj6ifv",
            "score": -7,
            "text": "I have a serious question: how would people who are not stupid enough to live on the coast be adversely affected? Or would we benefit somehow?",
            "title_similarity": "0.36905408",
            "sentiment_compound": 0.5324
        },
        {
            "id": "gwj9h2k",
            "score": 7,
            "text": "Thank you for sharing something that is not from Academic Times.",
            "title_similarity": "0.010895727",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gwjkqnl",
            "score": 26,
            "text": "So this is misleading, I lived in a flood zone in the city of Moorpark California, a city in a small agricultural valley that is a direct path to the ocean due to living within one mile of a cement river channel. I was required to buy flood insurance from FEMA (the only provider) with a $2000 a year premium, for a flood that was essentially not possible. The entire city was on a mild slope and in the unlikely event the river that was dry and empty 360 days out of the year overflowed it would just drain to the ocean.\n\nWhen I challenged this I wound up in a rats nest of corruption. Apparently when super storm Sandy destroyed the east coast it nearly bankrupted FEMA, so immediately following that FEMA went and declared a lot of areas as flood zones where historically there has never been a flood. My city council tried to fight it but FEMA wanted a massive amount of money to come out and survey the area to see if they marked it incorrectly, but my poor agricultural based city could not afford it. Now before you say I’m biased a city named Camarillo who is essentially down the hill from Moorpark had the same thing happen to them, FEMA came through and painted a massive line on the map declaring it a flood zone. But due to the fact that Camarillo is a wealthy city, they had it almost completely removed from their city as they could afford FEMAs fee to clear it. \n\nTL:DR: FEMA has been declaring areas that will never flood as requiring flood insurance to subsidize the real flood impacted zones.",
            "title_similarity": "0.6274171",
            "sentiment_compound": -0.269
        },
        {
            "id": "gwjr9lq",
            "score": 111,
            "text": "Houses are overvalued, banks are giving bigger loans to accommodate people buying them, then they sell the loan to Fannie Mae when they run out of loan money for the year. Now it is a government problem. The market keeps inflating and as you can see in some regions of the country already, houses that should be valued at 300k are now being purchased in the 500-900k dollar range. Looking at you Minnesota and Arizona.",
            "title_similarity": "0.79964083",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gwj2167",
            "score": 541,
            "text": "Hi. Builder here. We build in flood zones. I'm not sure on accuracy, but probably true. \n\nA way to make that more accurate is to say:\n\nWith FEMA's latest reviews of land in the 100-year flood zones, we show $[value] of homes is in danger of flooding now. \n\nBecause many many homes were built decades before FEMA's latest update.",
            "title_similarity": "0.7659166",
            "sentiment_compound": 0.1825
        },
        {
            "id": "gwjh0cr",
            "score": 17,
            "text": "Some of this is because of old outdated flood maps. My parents live 80ft above a river on a bluff, they, along with their neighbors are all in a \"floodzone\" , this bluff sits higher than all of the property 25miles to the east, their house will only flood when the animals come two by two again.",
            "title_similarity": "0.63731116",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwj9b7u",
            "score": 81,
            "text": "Stability? If those homes are overvalued and plummet, doesn’t that inversely affect all other homes I.e. non-flood zone housing goes up?",
            "title_similarity": "0.7064545",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwj1xcz",
            "score": 2258,
            "text": "man I wish they would outlaw building on a flood zone, in my area there are multi million dollar houses that were destroyed a while ago by a flood, they rebuilt but are refusing for the city to do flood mitigation because it will \"ruin their view\"",
            "title_similarity": "0.6442342",
            "sentiment_compound": -0.875
        },
        {
            "id": "gwjbe16",
            "score": 250,
            "text": "As engineers we talk about this all of the time.\n\n1). Live near the beach not on it. Flood insurance is often expensive, nuisance flooding (in low lying coastal areas) can often flood your house if not built correctly, and when floods are bad, they are very bad.\n\n2). Avoid wetland areas/living down gradient of a hill. You will have water in your house/basement.",
            "title_similarity": "0.6416856",
            "sentiment_compound": -0.9355
        },
        {
            "id": "gwjgw8j",
            "score": 593,
            "text": "Link from the article to check your property:\n\nhttps://floodfactor.com/",
            "title_similarity": "0.3104651",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwj5qxs",
            "score": 1070,
            "text": "The terrifying thing to me is the billions of dollars in real estate investments in places like Charleston SC, and Miami Beach where king tides are already flooding streets. Historic buildings (some if which are homes) will be a big problem.",
            "title_similarity": "0.7956404",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gwja666",
            "score": 4151,
            "text": "I grew up next to a river. When I was kid it flooded every other year. The fields below my house would turn into giant ponds. White swans would stop by. It was very pretty.\n\nWe lived on a hill. Watching a river crest and houses destroyed is scary af. I rode a bus to school. During a high river, I could see the river was even with the levees we were driving past. The water was at least ten feet higher than the fields on the other side. Sometimes the levees held, sometimes they didn't.\n\nI cannot understand how anyone can live in a floodplain. Flowing water is scary af you guys.",
            "title_similarity": "0.59173846",
            "sentiment_compound": -0.8078
        },
        {
            "id": "gwjoabl",
            "score": 191,
            "text": "Houston is in for nothing but trouble.",
            "title_similarity": "0.22345649",
            "sentiment_compound": 0.438
        },
        {
            "id": "gwj9u1h",
            "score": 413,
            "text": "Can someone please provide the cover graphic here for me?",
            "title_similarity": "0.12286789",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwjbnsl",
            "score": 1,
            "text": "And how undervalued are homes just outside of flood zones?",
            "title_similarity": "0.50350523",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjbusr",
            "score": 3,
            "text": "jUsT mOvE these people say. Yeah? And then someone else moves in because someone has to buy the property or else you just have to abandon it. People cant just move away and have nobody replace them without the property losing all value.",
            "title_similarity": "0.4704547",
            "sentiment_compound": 0.4374
        },
        {
            "id": "gwjcpix",
            "score": 1,
            "text": "I also wish they'd penalize people who build houses in fire zones. I've seen some housing developments that are in middle of areas where they'd all just burn if a fire gets started.",
            "title_similarity": "0.5237222",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwjcsbh",
            "score": 1,
            "text": "Yeah but houses on the edges of flood zones are undervalued. They are potential waterfront property.",
            "title_similarity": "0.50781447",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gwjd2od",
            "score": 1,
            "text": "Years ago when I was working with my dad, we would drive from location to location for work. We showed up at this customers house, his land look pretty normal, but as we started walking around, we found that he lived next to a river, that had a pretty steep fall, he started telling us that his land was being washed away, and the city wasn't doing anything for him. I can't say I don't blame them, it would've taken serious money to fix it. I just don't understand why he bought it, knowing it was so close to that area.",
            "title_similarity": "0.5891608",
            "sentiment_compound": 0.8178
        },
        {
            "id": "gwjd3eg",
            "score": 1,
            "text": "And Mar a Lago is one of them. How sad. Having said that, the name does seem to mean sea-to-lake, so maybe not that surprising.",
            "title_similarity": "0.33161578",
            "sentiment_compound": -0.6012
        },
        {
            "id": "gwjd49u",
            "score": 3,
            "text": "Why?? They can always sell there property to Aquaman!",
            "title_similarity": "0.27017194",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjdc4a",
            "score": 1,
            "text": "the put a 'not a flood zone' temporary exclusion on this giant flood zone around me.. sold all the houses to their first buyers.. then bam sorry boys your now in a flood zone",
            "title_similarity": "0.5537666",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gwjdjw2",
            "score": 1,
            "text": "Seems the \"stability of real estate markets\" would be just fine, in the areas outside the flood zones.",
            "title_similarity": "0.32228076",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwjdkaw",
            "score": 1,
            "text": "They are valued according to the inevitable government bailout.",
            "title_similarity": "0.35818866",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwjdkk0",
            "score": 2,
            "text": "Just $43.8 billion? Isn't that like 1% of a typical bailout?",
            "title_similarity": "0.60745364",
            "sentiment_compound": -0.4348
        },
        {
            "id": "gwjdtj0",
            "score": 1,
            "text": "Sounds like concerns aren't the only things being raised.",
            "title_similarity": "0.05068948",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwjdxrw",
            "score": 1,
            "text": "I believe this is what happened to the Houston metropolitan area during Harvey. From what I understand, homes are being built in wetland areas. If you don't know that, you risk getting your home destroyed. I didn't even know that till after Harvey hit.",
            "title_similarity": "0.5679494",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gwjejdi",
            "score": 1,
            "text": "We almost bought a house in a flood plain. They told us the risk was very low, but the flood insurance was too much for us as newlyweds. Three years later, that \"100-year flood\" happened and damaged that house. Glad we dodged that bullet.",
            "title_similarity": "0.67813003",
            "sentiment_compound": -0.2724
        },
        {
            "id": "gwjejlk",
            "score": 1,
            "text": "Keep eating them chicken tendies I’m sure they’ll keep you afloat when the climate change comes knocking.",
            "title_similarity": "0.36988917",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwjeou3",
            "score": 2,
            "text": "Fewer houses equals more demand and better prices for sellers, right? Plus consumers will love the novelty of literally new beachfront housing. Just imagine the joy of knowing thst your brand new, move-in ready, beachfront condo was inland Kentucky just a decade before. It's exciting and I sincerely don't understand all the FUD. \n\nHate shipping costs? Think of the savings when there's considerably less land above water! Plus we will be able to lay off hundreds of thousands of useless eaters, finally have a good excuse to shut down those porous borders, and just generally usher in naked unfettered anarcho-capatalism/neo-feudalism more quickly.\n\nCall me a rapaciously evil profligate but spit in my mouth and pull my hair too.",
            "title_similarity": "0.60565984",
            "sentiment_compound": 0.6674
        },
        {
            "id": "gwjfaml",
            "score": 1,
            "text": "There’s gonna be a rush on real estate at the 300-500 foot elevation",
            "title_similarity": "0.6420474",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjfaui",
            "score": 1,
            "text": "This is amazing! Ty OP",
            "title_similarity": "0.14127384",
            "sentiment_compound": 0.7712
        },
        {
            "id": "gwjfj4j",
            "score": 1,
            "text": "In UK it's mandatory to do a flood search as part of prepurchase checks (although usually just a cursory check of Environmental Agency flood map that is absolutely not at plot scale) - do they not have similar in US?",
            "title_similarity": "0.5054735",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gwjfj5l",
            "score": 1,
            "text": "New developments near cities are commonly on marshes and areas that flood.  There’s a reason nobody has built there in the last 200 years!",
            "title_similarity": "0.55303484",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjfmtt",
            "score": 1,
            "text": "So what about Louisiana everybody must have flood insurance",
            "title_similarity": "0.4383677",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjfxi8",
            "score": 1,
            "text": "Flip side - are nearby neighbourhoods then undervalued - as displaced people will need a place to move to and live?",
            "title_similarity": "0.47584873",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjg1t8",
            "score": 1,
            "text": "It would be nice to see a picture of the map of flood zone places!",
            "title_similarity": "0.25892204",
            "sentiment_compound": 0.4753
        },
        {
            "id": "gwjg7bo",
            "score": 1,
            "text": "Learn to swim, I'll see you down in Arizona bay",
            "title_similarity": "0.24070951",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjg90o",
            "score": 1,
            "text": "Who's ready for that bubble to pop?  Down to do some shorting",
            "title_similarity": "0.13468975",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwjgka4",
            "score": 19,
            "text": "SO many new communities in the Dallas area are built on swamp.",
            "title_similarity": "0.42604518",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjgnns",
            "score": 1,
            "text": "Stability? More like opportunity. Real estate is robust and will never not be. But value moves like shifting sands, location, location.",
            "title_similarity": "0.36083224",
            "sentiment_compound": 0.6521
        },
        {
            "id": "gwjgs82",
            "score": 1,
            "text": "Ah, so now it's an issue. Now that it's inevitable. Ok.",
            "title_similarity": "0.05009465",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjh13b",
            "score": 1,
            "text": "Seems like very few people understand that, to get your house back from insurance in a flood zone, you have to build the house at the old address. You don't get to keep the money to do whatever you want with, in most cases. Who's going to buy your flood-prone house, once it's rebuilt? So, messed up incentives keep people rebuilding in the same floodplains.",
            "title_similarity": "0.6290736",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwjh80s",
            "score": 4,
            "text": "I live in Park Ridge, IL, north east of O'Hare airport. We had one of 'those floods', 10 inches (25cm) in some time period less than a day. The west end of our block was impassible, and I had a free fish tank in our window well. Basement did not flood because of various reasons. A small river developed in the lot behind our house and was flowing down a neighbor's driveway.\n\nLater I bought this Android App \"US Topo Maps\",  you can view various maps. Turns out there used to be a creek running in the same place. The developer filled in a creek to make our block! The creek reformed during the flood!\n\nNote on US Topo Maps. IT DOES NOT NAVIGATE. It is NOT a replacement for Google Maps or or others! It can record where you have been, and re-trace your steps. It will let you cache maps at home while you are on Wifi and store them with no time frrame (except Google maps). You can overlay weather (and with different opacity, my suggestion to the developer) You can split screen with Google Maps on the left and Topo on the right and view the weather (cool if you are driving thru tornadoes). Other apps/programs can do the same thing.",
            "title_similarity": "0.56764793",
            "sentiment_compound": -0.2905
        },
        {
            "id": "gwjh9hl",
            "score": 1,
            "text": "Yep- like the houses diagonal from me that flood 1-2 times per year and are valued at around $600k USD each. I’m in Tennessee and the homes were purchased by families from another state that were unaware their homes where located in a flood plain.\n\nOr single acre of land just behind them that currently for sale for $200k and spends most of its time underwater. Soon enough someone from Cali will purchase this land.",
            "title_similarity": "0.67640144",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gwjhhcs",
            "score": 1,
            "text": "The most damning part is, we know this, collectively. And knew this-- or should have-- when these towns were built.\n\nWe spend the entire latter half of the 1800s and much of the 1900s draining wetlands and building in river bottoms for \\[various reasons\\], believing that simply by punching a drain here and building a levee there water would forget about things like flow and gravity and historical floods.\n\nAnd new we haz a sad. A very small handful of towns with the space to move have done so, most towns and cities have not. And then there's Florida, which is a whole other thing.",
            "title_similarity": "0.5732691",
            "sentiment_compound": -0.6361
        },
        {
            "id": "gwjhkgf",
            "score": 1,
            "text": "Investment idea, buy property on elevated land near coastal flood zone.  Climate change = Beachfront property!!! profit.",
            "title_similarity": "0.47095323",
            "sentiment_compound": 0.5826
        },
        {
            "id": "gwjhkxp",
            "score": 1,
            "text": "Concerns about the stability of a fraud. Where’s the surprise?",
            "title_similarity": "0.31098914",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwjhui3",
            "score": 1,
            "text": "Oh no, climate change is going to impact the real estate market! That’ll finally make those people take note when their houses are flooded. Only when it directly effects them, as is tradition.",
            "title_similarity": "0.66593826",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwji5nb",
            "score": 1,
            "text": "I found the most awesome deal on a gorgeous local house, went through all the pics like “this is the one!”\n\nThen the back yard shot showed a bridge I recognized and I remembered how bad the bridge flooded and… the bridge is higher than the first floor of the house.\n\nSearched on YouTube for that bridge’s road name and “flood” and the first search result was a video taken from previous owners of the house. Basement/garage was 100% flooded and water was gushing out of the front door and the neighbors were yelling about how they’re 100% stuck with no exit until the flood goes back down so it better not go any higher.",
            "title_similarity": "0.6318622",
            "sentiment_compound": 0.8254
        },
        {
            "id": "gwji8lt",
            "score": 1,
            "text": "i think about this allllll the time!!! sometimes you dont even need a map, you dont need a phd in geology to see that some places absolutely shouldnt have houses built in them",
            "title_similarity": "0.394751",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjidh1",
            "score": 1,
            "text": "Sooo... we short the housing market again? Global Financial Crisis 2 Electric Boogaloo",
            "title_similarity": "0.6768228",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gwjilyc",
            "score": 5,
            "text": "First thing I did before we closed on my house, which is adjacent to a river, was check those flood maps.\n\nThe bad news?  My neighbors are *fucked* as they’re not only inside a 100 year flood zone, they’re inside a 50 and 25 year flood zone.\n\nThe good news?  My house sits 15’ up elevation from them (pretty sure I’m built on a flattened hill) and we’re in a 1000 year flood zone at worst.",
            "title_similarity": "0.71122146",
            "sentiment_compound": -0.7149
        },
        {
            "id": "gwjio5n",
            "score": 1,
            "text": "When I was in the market for a house 3-4 years ago, some of the best houses in my price range were in flood zones up here in the ridge and valley region of Appalachia. All these houses had been on the market for years with 0 interest.  But after scoping Zillow, not a single one of those houses are still on the market, and I absolutely assume the ones in better school districts than others went for well more than what they were going for 4 years ago. Because up here in the commonwealth, most home buyers are buying for the school district.",
            "title_similarity": "0.65918124",
            "sentiment_compound": 0.8779
        },
        {
            "id": "gwjiud0",
            "score": 1,
            "text": "It's going to be really bad when some dams start to fail like the levy's in New Orleans's our infrastructure isn't built to withstand the storms we will be brewing up with hotter temps and higher water levels.",
            "title_similarity": "0.6524868",
            "sentiment_compound": -0.6997
        },
        {
            "id": "gwjix63",
            "score": 1,
            "text": "Where is this map? I wanna make sure my parents properties aren’t in a flood zone. Can’t have my inheritance getting flooded.",
            "title_similarity": "0.47234982",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwjj16i",
            "score": 1,
            "text": "It's because of the NFIP.\n\nhttps://en.m.wikipedia.org/wiki/National_Flood_Insurance_Program\n\nIf your home floods, the government will basically pay the rebuilding costs. If the insurance was required privately by companies, there's no way the premiums would be low enough to afford. The result is the houses would lose value.\n\nI find it bizarre that the research article doesn't directly point that out, considering it's one of the biggest factors in valuation.",
            "title_similarity": "0.74724686",
            "sentiment_compound": -0.743
        },
        {
            "id": "gwjj9rw",
            "score": 1,
            "text": "How can I see these charts?",
            "title_similarity": "0.003280582",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjjczy",
            "score": 1,
            "text": "Well I had a giggle when I read the website name out loud.",
            "title_similarity": "0.24975175",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gwjjg1n",
            "score": 1,
            "text": "Reforest flood plains now. Save our communities. Save our rivers.",
            "title_similarity": "0.3066507",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gwjjjzs",
            "score": 1,
            "text": "It's alright. Just sell it to fuckin Aquaman",
            "title_similarity": "0.10261979",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwjjq32",
            "score": 1,
            "text": "I remember when I learned from Al Gore that Florida would be under water by 2020.",
            "title_similarity": "0.37476236",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjjxec",
            "score": 1,
            "text": "I just read the total US housing market is estimated to be worth $39T. So $43B is just 0.11%",
            "title_similarity": "0.63140583",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gwjk049",
            "score": 1,
            "text": "I'm a zep fan but stop ruining all these discussions with song lyrics",
            "title_similarity": "0.26989222",
            "sentiment_compound": -0.5647
        },
        {
            "id": "gwjk0r9",
            "score": 1,
            "text": "People build there on purpose to scam FEMA and other insurance money",
            "title_similarity": "0.47617888",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gwjk3kg",
            "score": 1,
            "text": "Every year the river in our city floods and it impacts our super poor populations and our super rich populations. \n\n\nGuess who get the assistance that should be sent to more needy families while they stay in their second and third homes????",
            "title_similarity": "0.75836265",
            "sentiment_compound": 0.8209
        },
        {
            "id": "gwjkkpx",
            "score": 1,
            "text": "I tried multiple variations of flood risk startups for consumers. They all failed now I’m at big Tech. The only people who cared were insurance and reinsurance companies who already had the data they needed on this",
            "title_similarity": "0.57519615",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gwjkkvt",
            "score": 1,
            "text": "I always tell people that when they buy a house, buy on high ground. I have almost no sympathy for anyone who doesn’t.",
            "title_similarity": "0.4212946",
            "sentiment_compound": -0.2789
        },
        {
            "id": "gwjknlp",
            "score": 1,
            "text": "The thing is, base flood elevations (BFE) are available through FEMA maps but are rarely considered when building a green field project. I’m a risk consultant and the amount of times I’ve reviewed plans and found they were planning on building below the expected flood depth is baffling. Just build above and you don’t need flood insurance.",
            "title_similarity": "0.4809232",
            "sentiment_compound": -0.6504
        },
        {
            "id": "gwjkqh4",
            "score": 3,
            "text": "I just have to say, the fema firmette map locator is AMAZING at nailing any address that is submitted. Such a good web page. I wish the web soil survey could catch up!",
            "title_similarity": "0.4047746",
            "sentiment_compound": 0.8866
        },
        {
            "id": "gwjkql3",
            "score": 1,
            "text": "So sell predatory mortgage loans, sounds about right.",
            "title_similarity": "0.44719028",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjkunh",
            "score": 1,
            "text": "Yes, we’re all very worried about how climate change is affecting the _real estate business_ for fucks sake",
            "title_similarity": "0.6955904",
            "sentiment_compound": -0.4391
        },
        {
            "id": "gwjkvsx",
            "score": 1,
            "text": "Build houses on stilts?",
            "title_similarity": "0.21044448",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjkzet",
            "score": 1,
            "text": "Pretty sure the flippers and people like them don't care long as they continue to make their money",
            "title_similarity": "0.2335882",
            "sentiment_compound": 0.6566
        },
        {
            "id": "gwjl2dw",
            "score": 1,
            "text": "Oh destroying the environment might affect real estate markets. Now, thirty years later, it gets to matter",
            "title_similarity": "0.672083",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gwjl4q3",
            "score": 1,
            "text": "The entire state of Hawaii is flood zone. Minimum $400k for a run-down house, 500 sq ft on Oahu.",
            "title_similarity": "0.658147",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjl4tr",
            "score": 1,
            "text": "Flood maps are a joke. My house is in a floodplain. I’m in the desert. If my house flooded then there will be an ark floating by with a bunch of animals on it because the world is ending.",
            "title_similarity": "0.5494127",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwjleoi",
            "score": 1,
            "text": "THE SOLUTION,,,, pass some vague law an kick the can down the road",
            "title_similarity": "0.31437632",
            "sentiment_compound": 0.3885
        },
        {
            "id": "gwjln6u",
            "score": 1,
            "text": "Y don't u just @ me -New Orleans",
            "title_similarity": "0.22022188",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjlnn7",
            "score": 1,
            "text": "It sounds like the market is pretty stable since people already have the info and still buy the house...",
            "title_similarity": "0.29896146",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gwjly56",
            "score": 1,
            "text": "Well it sure will be entertaining watching zillionaires get their summer homes flooded.",
            "title_similarity": "0.3269381",
            "sentiment_compound": 0.743
        },
        {
            "id": "gwjm36x",
            "score": 1,
            "text": "So many people are going to be caught out when their $500k home becomes uninsurable.",
            "title_similarity": "0.7037912",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjm4tm",
            "score": 1,
            "text": "I've done a lot of flood analysis at work using satellite imagery. The thing to realize here is that the fema flood maps are a best guess made using some pretty naive simulations, based off of very low resolution sensors. When you compare the fema map in houston to the actual floods in houston, they are basically uncorrelated.\n\nFlooding is a huge problem, yes. But basing your mitigation plans or disaster response on the fema maps is a huge, huge mistake.",
            "title_similarity": "0.59577256",
            "sentiment_compound": -0.1893
        },
        {
            "id": "gwjm9nw",
            "score": 1,
            "text": "If you buy a house today and don’t consider it’s areas flooding potential, you’re being foolish.",
            "title_similarity": "0.52521497",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwjmi01",
            "score": 1,
            "text": "We live in a flood plain, but in CA where there is ongoing drought. Climate change 2 us 0",
            "title_similarity": "0.5831807",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjmiof",
            "score": 1,
            "text": "Delete everything in this title after \"overvalued\" and you are talking about the US housing market... Somehow wwe are simultaneously in a poor economy but everyone and their mom is buying a house",
            "title_similarity": "0.6863085",
            "sentiment_compound": -0.2617
        },
        {
            "id": "gwjmobg",
            "score": 1,
            "text": "Stop subsidizing peoples choices to live in flood plains and you wouldn't have this issue. Houses in flood plains would be valued much less.",
            "title_similarity": "0.31960222",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gwjmrrl",
            "score": 1,
            "text": "My parents house is in a \"flood zone\" even though it has never had flood damage in the 28 years they have lived there. Hurricane Sandy, Irene, etc didn't flood our basement. If those hurricanes didn't affect our house I'm not sure what would.",
            "title_similarity": "0.5180164",
            "sentiment_compound": 0.1695
        },
        {
            "id": "gwjmvkv",
            "score": 1,
            "text": "\"overvalued\" is a relative term.      \n     \nI'd argue all homes are collectively overvalued by ~$50 trillion.",
            "title_similarity": "0.6109305",
            "sentiment_compound": -0.34
        },
        {
            "id": "gwjn1td",
            "score": 1,
            "text": "In California we get floods ( https://en.wikipedia.org/wiki/Great_Flood_of_1862 ).  But as everyone is now aware,  we get fires.\n\nUnlike floods, the government doesn't cover fire.   And the insurance companies are doing their best to leave.   Gobs of people in my area have had their insurance plans be not-renewed by companies.   Most have eventually been able to be reinsured, some after proving a significant amount of fire mitigating vegetation management.  The state has played a roll in forcing companies to continue to operate.\n\nI would love for someone to come up with good models (based on type of construction and amount of vegetation management, etc ) for _actual_ risks to buildings so that insurance companies would want continue to operate.   Right now the companies don't know the risk, so basically so don't want to be involved.",
            "title_similarity": "0.58129156",
            "sentiment_compound": 0.9646
        },
        {
            "id": "gwjn3qk",
            "score": 3,
            "text": "Welcome to beautiful Charleston, SC!",
            "title_similarity": "0.11336983",
            "sentiment_compound": 0.8016
        },
        {
            "id": "gwjn6rg",
            "score": 1,
            "text": "Why do we focuse on problems 100 years down the line when black people are being killed systematicly.",
            "title_similarity": "0.5797502",
            "sentiment_compound": -0.802
        },
        {
            "id": "gwjnfqj",
            "score": 1,
            "text": "I’m enjoying my life in Florida while I still can.",
            "title_similarity": "0.13593036",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gwjnfuy",
            "score": 1,
            "text": "What are some publicly traded companies that have flood mitigation or recovery products/services?",
            "title_similarity": "0.4462005",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjnos3",
            "score": 1,
            "text": "How big is the housing market? I guess this is roughly 10%, which is significant",
            "title_similarity": "0.6387979",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwjnrjb",
            "score": 1,
            "text": "Flood zone maps are terribly out of date and inaccurate. My house in Vermont was listed as being in a flood plain, in a map from 1960. This was 2005. If my house flooded the entire town downstream would have had to flood first and be under 45 feet of water.",
            "title_similarity": "0.6763842",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwjnv4y",
            "score": 2,
            "text": "Currently training in Charleston, SC. The vast majority of houses in this city are in flood zones. This concept is the reason I have no interest in staying in Charleston after completing training. Love this city and truly enjoying my time here but I fear that one day it won’t be livable.",
            "title_similarity": "0.58409786",
            "sentiment_compound": -0.0747
        },
        {
            "id": "gwjo18a",
            "score": 1,
            "text": "\"Sell their houses and leave\" intensifies",
            "title_similarity": "0.34969783",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gwjo1au",
            "score": 1,
            "text": "I did find this strange...",
            "title_similarity": "0.01693423",
            "sentiment_compound": -0.25
        },
        {
            "id": "gwjon9t",
            "score": 1,
            "text": "Insurance companies might have sponsered the study. This is a probably a good reason to deny claims or reduce settlement amounts in the near future when floods are common occurrence.",
            "title_similarity": "0.48065054",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwjonq8",
            "score": 1,
            "text": "So...are we not having a water crisis?",
            "title_similarity": "0.1361264",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gwjp2h4",
            "score": 1,
            "text": "can’t find these maps in the link. where to find out the information?",
            "title_similarity": "0.21381351",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjp5t1",
            "score": 1,
            "text": "So in ecology there’s the concept of an ecological trap, where organisms in a state of flux (natural disaster or other intense selection force) will settle in habitats that are actually incapable of meeting their needs. This is usually because of some particularly attractive resource that masks the risks to the organism. \n\nAny and all beach property from North Carolina to Texas is a textbook ecological trap. Real estate investors know there’s a grim reaper coming for the whole area and they’re just trying to be the second-to-last owner of every property you see so that YOU are the one stuck with a cardboard house on what used to be dry land.",
            "title_similarity": "0.61823577",
            "sentiment_compound": -0.9023
        },
        {
            "id": "gwjpamo",
            "score": 1,
            "text": "My home insurance tried multiple time to force me to buy flood insurance. Everytime I've had to provide proof that I do not live in a floodplain. Biggest reason I know this is I live near a floodplain that floods every 100 years and in 1983 was that year. It was like we were an island for 2 weeks. We were completely untouched and the property sits in a way that any rain water flows down towards the wash. I had to finally have the county write a letter to the insurance company stating that I did not need to purchase additional policies.",
            "title_similarity": "0.5796108",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwjpi00",
            "score": 1,
            "text": "THIS is why you will never see Republicans admit that rising sea levels are a thing.",
            "title_similarity": "0.4072694",
            "sentiment_compound": -0.1511
        },
        {
            "id": "gwjpmp3",
            "score": 1,
            "text": "My area in california ($$$) is a flood zone but has very heavy mitigation including a lot of barriers and canals. This study may be skewed by not knowing which are truly at risk.",
            "title_similarity": "0.6577451",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwjpmwo",
            "score": 1,
            "text": "I just looked at property that was basically half flood zone, the sellers still wanted over 10k an acre even when better properties with no flood zone were selling at 10k an acre. The property had been on the market for 180 days, and they still weren’t budging on price. Same story with many properties around here. \n\nI think a lot of these people are “selling” only because they were told the market is hot, but in many areas that still isn’t enough to get the prices they are asking for. Houses and properties are sitting for sale for months or even years, because people seem to think it’s worth way more than it is.",
            "title_similarity": "0.6471477",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwjpp8a",
            "score": 1,
            "text": "My sister and law's family live outside of Houston.  Apparently, pretty much the whole suburb they live in was built in a flood zone.",
            "title_similarity": "0.46643254",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gwjppti",
            "score": 1,
            "text": "Of course the market isn’t going to properly price in flood risk when the federal government offers many people flood insurance at way too low of a price. \n\nAlso, there’s a bigger problem at play here which is that ALL areas have overpriced housing thanks to government regulations. Everyone just sort of accepts the fact that houses are appreciating assets, but why is that? Houses get used over time, they deteriorate, they become outdated. So why should this be something that goes up in value? It shouldn’t, it should go down in value just like a car. That’s why it’s so hard to afford a house, the government intentionally keeps housing prices high, they’ve even said it themselves.",
            "title_similarity": "0.75974023",
            "sentiment_compound": 0.8754
        },
        {
            "id": "gwjpqla",
            "score": 1,
            "text": "Don't forget that one tsunami that's gonna hit Washington that's literally been confirmed to exist due to that one japanese tsunami, but the thing is we literally ***don't know when said Washington tsunami will hit.*** I forget its name, but I have heard about it several times and each time it gives me the creeps...",
            "title_similarity": "0.5690464",
            "sentiment_compound": -0.254
        },
        {
            "id": "gwjpri5",
            "score": 1,
            "text": "risks aren't a concern until they happen e.g. coronavirus pandemic",
            "title_similarity": "0.3234338",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwjpshk",
            "score": 1,
            "text": "How can you view the map and this article without having to pay/sign up?",
            "title_similarity": "0.20583616",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjpw8n",
            "score": 1,
            "text": "Can someone link to the pdf? Blocked here for some reason.",
            "title_similarity": "0.25192058",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwjpxqf",
            "score": 1,
            "text": "You have to purchase access to this article.  Is there an image that is not a link?",
            "title_similarity": "0.16495958",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjq1wj",
            "score": 1,
            "text": "Damn it, PNAS. You fucked us again.",
            "title_similarity": "0.29512304",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gwjq41h",
            "score": 1,
            "text": "Fear mongering crap!\n\nLet's say the worst happens - and all $43.8 billion of this real estate is worthless.  Would this destabilize the real estate market in the US?\n\nNot a chance!  The US housing market is $1 to 2 trillion a year.  $43.8 is minuscule in comparison.  Also, how many trillion dollar stimulus packages have we seen since 2008?  So, the government could easily cover $43.8b.",
            "title_similarity": "0.81028926",
            "sentiment_compound": -0.9311
        },
        {
            "id": "gwjq6c4",
            "score": 1,
            "text": "In my city, half our suburban sprawl is on old wetlands... and more is being planned, even though with the drainage and canals, we still have risk of flooding.  \n\nGranted we have changed the entire path for the central river that our town was built around over the last 150 years.",
            "title_similarity": "0.6452925",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gwjqdfq",
            "score": 1,
            "text": "Hey I promise that there are bigger reasons for the current real estate bubble to burst. It's probably the biggest axe hanging over our economie's head right now.  [https://www.cnbc.com/2021/04/13/when-is-the-housing-market-going-to-crash-consumers-ask.html](https://www.cnbc.com/2021/04/13/when-is-the-housing-market-going-to-crash-consumers-ask.html)",
            "title_similarity": "0.7465526",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gwjqg72",
            "score": 1,
            "text": "So build the homes a little higher up ? It’s not that difficult to raise them up 5 ft or more",
            "title_similarity": "0.3538049",
            "sentiment_compound": 0.2755
        },
        {
            "id": "gwjqmum",
            "score": 1,
            "text": "Our 1,000 sq ft 1 bath house in a high risk flood zone is worth about $300k, it's crazy. Our flood insurance alone cost more than most people's home insurance.",
            "title_similarity": "0.7714626",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwjr0xh",
            "score": 1,
            "text": "I believe it native Floridan gulf coast. We live in a home built in or around the 1970s in a \"mild\" flood zone. According to Zillow (renters) this house is worth $150,000k+ last bought during the recession $52k. Its It's completely not worth what it's valued at and the same goes for most of the homes in the state.",
            "title_similarity": "0.7005474",
            "sentiment_compound": 0.0144
        },
        {
            "id": "gwjr496",
            "score": 1,
            "text": "They're called hundred year floodplains for a reason... this is been happening for millennia.",
            "title_similarity": "0.45170793",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjr694",
            "score": 1,
            "text": "I mean...they're not over valued because they're in flood hazard zones, their value comes from being oceanfront or waterfront property. The flood and hurricane insurance on these homes is tremendously expensive. They also tend to be owned by very wealthy people. I don't understand what they're concerned about here or what they're proposing to fix it? \n\nHonestly as climate changes the value will go down, and some people will probably buy them, knowing they are taking a risk. That's just how real estate works.",
            "title_similarity": "0.68160033",
            "sentiment_compound": 0.7259
        },
        {
            "id": "gwjr8k9",
            "score": 1,
            "text": "This means my modest 4 bedroom in suburban Colorado is going to be worth NYC money someday, but what will it matter if there’s nowhere to move.",
            "title_similarity": "0.573463",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gwjr9kv",
            "score": 1,
            "text": "Flip your realestate in Miami before it's too late. Nothing is going to prevent flooding there.",
            "title_similarity": "0.348669",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gwjre8l",
            "score": 1,
            "text": "Growing up my dad was in the Navy so we’re always near water and I was born in a place that had floods/typhoons, like my earliest memory is being picked up by my mom because the bottom floor of our home was flooded up to your knees during a typhoon. So when it came time to buy my first home I made sure to check the FEMA website to ensure I lived in a zone that didn’t flood. It’s seriously not worth the money to put into a house in the long run.",
            "title_similarity": "0.647661",
            "sentiment_compound": 0.6941
        },
        {
            "id": "gwjrj1j",
            "score": 1,
            "text": "Aquaman is poised to make a killing",
            "title_similarity": "0.27247104",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gwjrm9r",
            "score": 1,
            "text": "Whenever I drive along the coast I’m shocked by how many more homes are being built and how large they are..this is after disasters wiped so many out in the same space.  Just don’t get it.",
            "title_similarity": "0.69212914",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gwjrxqa",
            "score": 1,
            "text": "My sisters house unfortunately flooded right after they got an offer. Their insurance fixed everything up and it looks great, but now she’s asking like 100k more (previous deal fell through obviously). Not worth what she’s wanting imho.",
            "title_similarity": "0.6475259",
            "sentiment_compound": 0.4768
        },
        {
            "id": "gwjs3qc",
            "score": 1,
            "text": "I don’t know the ins and outs of everything that happened since I was a kid at the time; but, my parents got into a battle with our county government after the Army Corps of Engineers came through the area and did a survey of a creek that ran through our property that involved the flood plain and the effects the creek had on the bridges, roads, nearby structures, and the land itself. My father got to talking to the surveyor when they were came through our area and their discussion turned to the value of land along the creek. My dad told the surveyor that he thought the property taxes he was paying were too high. The surveyor told my dad that the value of his land should assessed for taxes at a lower rate since the things it could be used for were limited since it was in a flood plain. One thing led to another and eventually the county was obligated to reassess property values of every land owner that this creek ran through in the whole county, recategorizing some peoples land, dropping the value property for many along the creek, and forcing the county to tax these land owners at a lower rate, which the hadn’t been doing. My dad was happy because his taxes were cut in half but any dealings he had with county after that were a struggle. The reassessment cost the county millions of dollars after it was all said and done. It’s worth the time to look into how the county assesses your property for tax purposes if you pay property taxes. Property in areas along water tend to be over valued because people enjoy being by the water. I don’t know how some of these houses and buildings even get the okay to be built in the first place unless somebody is getting a kickback somewhere.",
            "title_similarity": "0.6648082",
            "sentiment_compound": 0.9349
        },
        {
            "id": "gwjs9xm",
            "score": 1,
            "text": "Honestly, I want another housing market collapse because I need to buy a house.",
            "title_similarity": "0.557559",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gwjsgl2",
            "score": 1,
            "text": "By itself that's such a useless number. If the houses in flood zones are worth 50 trillion, then they're only overvalued by 0.1%. I.e. who cares. \n\nI tried to see the full text but don't have access.",
            "title_similarity": "0.6426808",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gwjsmsd",
            "score": 1,
            "text": "This is bad but if this is accurate this would actually be really surprisingly positive to me.\n\nThe first google result I found on the size of the US housing stock “The full stock of U.S. housing is now worth $36.2 trillion.”\n\nThat seems a bit high to me, but not far off the Mark. \n\nThat means it’s on the order of a few thousandths of the overall value. Which strikes me as very low- just prima facia- like I would have thought it would be at least 2 or 3 percent of overall value.",
            "title_similarity": "0.70534486",
            "sentiment_compound": 0.9147
        },
        {
            "id": "gwjsqrz",
            "score": 1,
            "text": "Banking regulators in our state are really cracking down, so that any loan must consider the newest flood plain map, and have it documented in the loan papers.",
            "title_similarity": "0.7026017",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjssak",
            "score": 1,
            "text": "My was buying up properties, and there was this thing they ran into, where a house was in a flood zone and you were required to purchase flood insurance, but in the case of an actual flood, it wouldn't be covered. Something just like it only covered pipe breaks in the house.  Just an aside",
            "title_similarity": "0.6505447",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gwjt0e7",
            "score": 1,
            "text": "That's your concern? The stability of the housing market? Not the fact that hundreds of thousands of families are going to lose their homes?",
            "title_similarity": "0.7368903",
            "sentiment_compound": -0.5007
        },
        {
            "id": "gwjt1te",
            "score": 1,
            "text": "Please tell me someone else laughed at that website name.",
            "title_similarity": "0.27477166",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gwjt3jx",
            "score": 1,
            "text": "Would anyone happen to have the number of houses affected? If it’s 30,000,000 houses then it’s statistically quite insignificant especially if a majority have flood insurance",
            "title_similarity": "0.6358398",
            "sentiment_compound": -0.4576
        },
        {
            "id": "gwjt5gf",
            "score": 1,
            "text": "It's pretty easy to find your flood map. Those who didn't know, [here's a link](https://msc.fema.gov/portal/home).",
            "title_similarity": "0.2720606",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gwjum40",
            "score": 4,
            "text": "My mothers yard was so flooded for several years that ducks started swimming in it...she ended up with fish!",
            "title_similarity": "0.43439007",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjusef",
            "score": 1,
            "text": "Is this accounting for the Trillion Dollar ARkStorm?",
            "title_similarity": "0.6209035",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjuxx5",
            "score": 1,
            "text": "Fwiw, my house is incorrectly  categorized as in severe risk despite not being in a  flood zone. Part of the property is, but the house is not. (I'm a land surveyor and working with flood zone maps is part of my job.) I noticed others shown in my area that, while I haven't researched, seem very unlikely to be in flood zones, as well as some where there's no house at all, but an undeveloped lot.",
            "title_similarity": "0.51202345",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gwjv3ya",
            "score": 1,
            "text": "What?  An industry involving banking and big govt results in overvalued markets?  No way.",
            "title_similarity": "0.6366694",
            "sentiment_compound": -0.3736
        },
        {
            "id": "gwjv7jn",
            "score": 1,
            "text": "Me, a millenial: \"oh boy, another recession!\"",
            "title_similarity": "0.49451694",
            "sentiment_compound": -0.4753
        },
        {
            "id": "gwjvexc",
            "score": 1,
            "text": "I've been saying this for YEARS! building in flood planes is just asking for a disaster eventually. Also Florida is a swamp and should not be a thing.",
            "title_similarity": "0.49919772",
            "sentiment_compound": -0.6588
        },
        {
            "id": "gwjvj4s",
            "score": 1,
            "text": "I grew up on river that flooded every Spring, we would sandbag and wait for the river would go down, then someone decided to build a diversion for the river to go around the city, flooding solved. Then wealthy people started building before or after the diversion and their homes flooded. They complained and the government bailed them out, you can’t support this kind of stupid. One other thing can someone tell me why the Obama’s purchased a 12m $ home on Martha’s Vineyard 20’ above sea level? Seems like he knows something we don’t?",
            "title_similarity": "0.6835209",
            "sentiment_compound": 0.4151
        },
        {
            "id": "gwjvk0r",
            "score": 1,
            "text": "What do they mean by \"overvalued\"? Are they comparing to similar houses in the area not in flood zones? Are they forgetting that people pay a premium to live near water?",
            "title_similarity": "0.47071174",
            "sentiment_compound": -0.2359
        },
        {
            "id": "gwjvo4v",
            "score": 1,
            "text": "How do you read the article instead of the summary? I keep trying to click PDF but it just opens up another instance of the same page?",
            "title_similarity": "0.3501534",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjw2la",
            "score": 1,
            "text": "This is why I am for the privatization of flood insurance.  The government shouldn't be the sole provider of it.  I honestly don't think they should insure anything like that.  People won't be able to secure a loan to build if they can't secure the flood insurance that would cover the property.",
            "title_similarity": "0.5503391",
            "sentiment_compound": 0.7063
        },
        {
            "id": "gwjw37i",
            "score": 1,
            "text": "My house and thousands of other here, flooded during Hurricane Harvey. My home’s value has almost doubled since then. I’m in a 500 year flood plain, but nobody believes the flood maps anymore. They’re old and not reflective of the current situation. Still, I get mailers and calls from home investors every week, almost every day, wanting to buy my house. \nI’m actually willing to sell and take my equity. But I’m in bankruptcy and have to wait another year until I can purchase another house. I know it’s possible to purchase while in bankruptcy, but the terms are garbage. I’ll wait. Until then, I make sure I buy flood insurance.",
            "title_similarity": "0.7332793",
            "sentiment_compound": 0.5647
        },
        {
            "id": "gwjwfci",
            "score": 1,
            "text": "I live near a very very overpopulated beach town and it floods most of the houses every year during hurricane season (Florida). Still, the housing prices go up every year and it’s almost impossible to buy there now if you aren’t a multimillionaire. I always think to myself how I’d never buy there even if I was rich just because you never know when your house will be destroyed year after year. I wouldn’t want that risk but I guess some people can afford that type of risk!",
            "title_similarity": "0.7173928",
            "sentiment_compound": -0.2598
        },
        {
            "id": "gwjwi4x",
            "score": 1,
            "text": "As a millenial I just may be able to afford a house after all...just have to put it on stilts after I buy it from a shady real estate huckster selling it \"as is\" after a hurricane.",
            "title_similarity": "0.5795942",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gwjwiu1",
            "score": 1,
            "text": "As the great Ben shaparrot has said, Just sell your homes if you live in a flood zone. Idk to who, but there you go",
            "title_similarity": "0.48380226",
            "sentiment_compound": 0.3291
        },
        {
            "id": "gwjwk6q",
            "score": 1,
            "text": "Yeah Miami building boom, all those building are insured to 20 to 40 years I believe, the structures themselves are only good for that at the most",
            "title_similarity": "0.57197297",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gwjwris",
            "score": 1,
            "text": "The government won't allow those people to lose money, and the market will continue to be absolutely fucked.",
            "title_similarity": "0.475901",
            "sentiment_compound": -0.8426
        },
        {
            "id": "gwjwwna",
            "score": 1,
            "text": "According to the scientists, we're all supposed to be underwater by now.",
            "title_similarity": "0.28890413",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjwza6",
            "score": 1,
            "text": "I live on a nice mountain side. Gentrification is a c’mon for my ass soon.",
            "title_similarity": "0.3576915",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gwjxasp",
            "score": 1,
            "text": "Can’t wait for my house in central Florida to become beach front.",
            "title_similarity": "0.23683079",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjxbvj",
            "score": 1,
            "text": "*cough* Houston suburbs *cough*",
            "title_similarity": "0.3183183",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjxo9x",
            "score": 1,
            "text": "Everyone in Malibu riding it till the wheels are overtaken by the pacific.",
            "title_similarity": "0.40576258",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjxp64",
            "score": 1,
            "text": "Is 43 billion a significant amount over the entire us market?",
            "title_similarity": "0.64190066",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwjxubn",
            "score": 1,
            "text": "Just do what everyone's hero Ben \"Wood Plank\" Shapiro does and just sell your soon-to-be flooded property!  The mermaid housing market is very hot right now.",
            "title_similarity": "0.5091274",
            "sentiment_compound": 0.5983
        },
        {
            "id": "gwjy1ps",
            "score": 1,
            "text": "Curious what r/RealEstate would have to say about this. The stories on there terrify me for what’s to come in the next few years after everything people are putting into buying homes.",
            "title_similarity": "0.66531193",
            "sentiment_compound": -0.25
        },
        {
            "id": "gwjyj52",
            "score": 1,
            "text": "Probably just means demand in other areas will increase",
            "title_similarity": "0.24430951",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwjyp43",
            "score": 1,
            "text": "Bye bye eastern Florida",
            "title_similarity": "0.099435955",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwjyr0p",
            "score": 1,
            "text": "I wonder if there is a good way to short the real-estate market? Maybe after they can make a movie about it or something...",
            "title_similarity": "0.38245353",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwjyzcx",
            "score": 1,
            "text": "I would like to see a similar study done for Western States' fire danger. I have a feeling that many homes in the urban-wildlands interface are overvalued as of now. It's not yet a huge trend, but people are currently moving out of these areas due to increased fire and smoke risk.",
            "title_similarity": "0.66040313",
            "sentiment_compound": -0.6685
        },
        {
            "id": "gwjz2ks",
            "score": 1,
            "text": "My job during college was with NFIS using FEMA flood maps.  We were the company that did flood determination for banks & mortgage companies.  City engineers use elevation, while we used the flood maps, so there could be some discrepancy.  Also we’ve seen recent weather break 500 year flood levels.  (.5 % chance of flood). Flood insurance is very inexpensive as well.  You want to get pissed? Look @ indian reservations, they are in floodways - basically “how fast is your house moving down the street?”",
            "title_similarity": "0.7041404",
            "sentiment_compound": 0.3661
        },
        {
            "id": "gwjzc90",
            "score": 1,
            "text": "I wonder what percentage of the value just New York and Florida represent together.",
            "title_similarity": "0.40649128",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwjzmil",
            "score": 1,
            "text": "Just wait until the year 2100 when New Orleans is projected to be underwater. NASA did a study and that city is sinking by an average of 2 inches a year. On top of it sinking the wetlands that act as a buffer zone for flooding are slowly dissapearing.https://www.businessinsider.com/american-cities-disappear-sea-level-rise-2100-2019-3",
            "title_similarity": "0.6668979",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwjzn3j",
            "score": 1,
            "text": "Real estate markets are already completely unstable. Every 10 years we have a massive crash. Right now we are in a huge huge housing bubble.",
            "title_similarity": "0.7816106",
            "sentiment_compound": -0.2247
        },
        {
            "id": "gwjzukd",
            "score": 1,
            "text": "There's a lot of houses in flood zones in California. There's also a whole lot of no rain.\n\nHard to have a flood, when you never have the source of floods...",
            "title_similarity": "0.5412638",
            "sentiment_compound": -0.2273
        },
        {
            "id": "gwjzw40",
            "score": 1,
            "text": "And of course those red state residents will want govt assistance to move. All while denying climate change.",
            "title_similarity": "0.39414322",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwk0dwf",
            "score": 1,
            "text": "Well, ok, but my flood insurance went up 10% this year and I don’t think the odds of flooding changed 10%.",
            "title_similarity": "0.5855601",
            "sentiment_compound": 0.1406
        },
        {
            "id": "gwk0kuq",
            "score": 1,
            "text": "I just bought a new home and really wanted one on the water, but I couldn't quote afford it. Everyone kept telling me that they're overpriced, but if that's the case, then why are people buying them at those prices? The answer is because they really want to live on the water, and you can't build more houses on the water in cities because there's no more land. This is the rough combination of the majority of people not understanding how much people who want to live in the water want it, and big business telling poor people they're spending their money wrong.",
            "title_similarity": "0.61235327",
            "sentiment_compound": -0.8523
        },
        {
            "id": "gwk18df",
            "score": 1,
            "text": "If only there was something we could do about climate change, but alas, the Ferengis only seek profit.",
            "title_similarity": "0.45160288",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwk1rwc",
            "score": 1,
            "text": "Western Nevraska and Southwestern Iowa had really bad flooding back in 2019. I don't remember exactly what it was but something to do with a certain species of fish that is protected caused the National Guard to hold off on releasing water and next thing you know all of the farmers are blaming the government for flooding their land to \"save some damn fish\". It sucks because alot of farmland is completely ruined due to all of the leftover sand, but you have to know the risk of farming/living on a flood plain.",
            "title_similarity": "0.60187024",
            "sentiment_compound": -0.8731
        },
        {
            "id": "gwk1s34",
            "score": 1,
            "text": "Found this link buried in the comments. Check the current and projected flood risk of an address/city:\n\n[https://floodfactor.com/](https://floodfactor.com/)",
            "title_similarity": "0.49760613",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwk1t3p",
            "score": 1,
            "text": "I am not an expert in this area, so I don't know how this should be addressed, but I do have some cursory knowledge on the topic. There are a lot of folks in here making very self-certain comments about not being able to build on flood zones, or what kinds of regulations should be imposed on flood zone structures, without much apparent knowledge of how flood zones actually work. A few pointers:\n\n-There are different levels of flood zones: 100 year, 500 year, Costal w/1%+ chance of flooding, and undetermined risk zones\n\n-Flood zones do not account for property lines- If you own a .3 acre sloping lot and 10 sq ft at the bottom of the hill 75 feet away from the improved area (structure) is in the 100 year flood zone, your mortgage servicer will likely still require flood insurance despite the fact that the actual improved portion is entirely out of the flood zone.\n\n- Flood zones are not confined to coastal areas or areas near large bodies of water. Hilly areas even at high elevations can be in flood zones due to a high water table and the 'funnel' nature of the topography. \n\n- Flood proofing existing structures is VERY expensive, and often impractical or unneeded (see above example regarding the relation of the structure to the flood zone) carrying flood insurance is highly practical. Doing away with flood insurance as some have suggested would render these home almost unsellable because mortgage lenders would not back loans on these properties. \n\nThis is not a cut-and-dry (pun intended) issue. Unless you are an expert in this area, please refrain from rendering an opinion on how this issue should be addressed.",
            "title_similarity": "0.56652606",
            "sentiment_compound": 0.8957
        },
        {
            "id": "gwk1y0y",
            "score": 1,
            "text": "My fiancé lives in West New York, NJ. From the overlook in Blvd East you can see a bunch of expensive houses and rich communities. He tells me its ridiculous expensive to live there. I asked him. \"So they pay millions to have the Hidson River in their house if a storm hits?\". I wasnt in the states during Sandy but coming from Puerto Rico I know what hurricanes can do and with how climate change is making them stronger. Living in front the Hudson River is the worst investment anyone can make. Goes to show the mentality these people live with.",
            "title_similarity": "0.76052153",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gwk20t9",
            "score": 1,
            "text": "Flood zones that have had Federally backed flood insurance pay out should be purchased by the insurance and the money used to relocate the family. The lot be restored to nature and established as part of a wildlife or nature preserve. If someone's is foolish enough to build their, the builder must be 100% liable for restoring any future flood damage, and housing loans should be forbidden from being used for flood land. So the rich seagil who's beach house gets washed dout every year? They can just rebuild out of their own pocket each year.",
            "title_similarity": "0.6346624",
            "sentiment_compound": 0.0202
        },
        {
            "id": "gwk24o1",
            "score": 1,
            "text": "Now show me wild fire zones. Since these historic fires started in NorCal in 2015, home prices have still kept going up. 2017 was the first year the fires started burning property in bigger population centers like Santa Rosa, Paradise and others. \n\nDespite that, since 2017 home prices have gone up at least 15% in Sonoma County, despite so much of it being in fire danger. The Fountain Grove neighborhood in Santa Rosa that is up on a hill has homes that go anywhere from a $1M starting price to $5M or more. 90% of it burned down in the 2017 Tubbs Fire. Fast forward 3 1/2 years, almost completely rebuilt and selling like hot cakes. \n\nIt should be criminal to build in flood and fire zones alike. Forget about loss of property, what about loss of life?",
            "title_similarity": "0.7488769",
            "sentiment_compound": -0.8934
        },
        {
            "id": "gwk39db",
            "score": 1,
            "text": "And realtors still sell lots in flood zones- later found that you can’t build on in the Carolinas. Zero repercussions for these mofos.",
            "title_similarity": "0.4732958",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwk39xb",
            "score": 1,
            "text": "Looking forward to The Big Short 2",
            "title_similarity": "0.059626713",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwk3y3r",
            "score": 1,
            "text": "Real estate over-valuation is primarily a result of white flight. If an area is free from diversity, it doesn’t matter how flood prone it is. People want to live there. Give the people absolute freedom of association, then we can fix this issue.",
            "title_similarity": "0.44623545",
            "sentiment_compound": 0.836
        },
        {
            "id": "gwk4nxu",
            "score": 1,
            "text": "I mean the stability of real estate markets in at flooding zones are at risk but it means that houses that housing that is unaffected is likely undervalued. So it balances out from an economic perspective?",
            "title_similarity": "0.72346246",
            "sentiment_compound": -0.1406
        },
        {
            "id": "gwk4y16",
            "score": 1,
            "text": "Or the climate models are wrong",
            "title_similarity": "0.32259208",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwk51hl",
            "score": 1,
            "text": "Building anything close to the water line is the stupidest thing we could have done.",
            "title_similarity": "0.3522698",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gwk559p",
            "score": 1,
            "text": "The biggest pump and dump rigged game of all in this country is real estate",
            "title_similarity": "0.64794594",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gwk56kb",
            "score": 1,
            "text": "At least in my area - *everything* is overvalued, flood zone or not. Does this study account for the natural ebb and flow of the housing market?",
            "title_similarity": "0.62726516",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwk597n",
            "score": 1,
            "text": "I work in insurance. People think I'm trying to upsell them when I talk about flood insurance. I'm not. Flood claims have significantly increased over the past decade, most notably in areas that were not previously marked as flood zones.",
            "title_similarity": "0.71828544",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwk5qq4",
            "score": 1,
            "text": "Of all the things that climate change should make you worried about I'm not sure the housing market is high on that list.",
            "title_similarity": "0.6701729",
            "sentiment_compound": -0.4874
        },
        {
            "id": "gwk5r43",
            "score": 1,
            "text": "Flood zones won’t be built on. They’ll be used as negotiating chips for receiving zoning changes. Building will occur more densely on non flood zones.",
            "title_similarity": "0.44356868",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwk5yej",
            "score": 1,
            "text": "This is the downside of things like FEMA and relief for areas stricken by PREDICTABLE disasters.  Who cares if your house is in danger of a flood or forest fire if the US taxpayer is bailing you out when things go wrong.  In a free market the insurance rates would be so high that nobody would want to live in these homes and builders would never build them in the first place. So in the end, disasters destroy more homes and cost everyone more money because of aide.  It is unfortunate but once you socialize the risk and privatize the gain, you guarantee riskier behavior.",
            "title_similarity": "0.71290076",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gwk6emc",
            "score": 1,
            "text": "Vacation Homelessness is real.",
            "title_similarity": "0.3726671",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwk6o6l",
            "score": 1,
            "text": "Not overvalued: they’ll eventually be waterfront homes.",
            "title_similarity": "0.11668913",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwk77s3",
            "score": 1,
            "text": "With the cost of lumber these days home values should be quadrupled.",
            "title_similarity": "0.6076977",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwk7fbn",
            "score": 1,
            "text": "Is there any way to short real estate markets?",
            "title_similarity": "0.2914336",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwk7lbr",
            "score": 1,
            "text": "I’m in the market for a home. Seeing those flood zone disclosures was really an eye-opener for me. In all honesty, some of the areas in a flood zone didn’t make much sense to me but I’m sure there’s more than meets the eye when the assessment is made. Just really surprising to see so many homes in flood zones.",
            "title_similarity": "0.5773146",
            "sentiment_compound": 0.7986
        },
        {
            "id": "gwk7lmc",
            "score": 1,
            "text": "Please keep in mind that flood determination maps are made as if the land was flat. If you are in a flood zone, you may be able to be removed by getting an elevation certificate.",
            "title_similarity": "0.23998204",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gwk8wj8",
            "score": 1,
            "text": "*Theoretically*, is it possible to short real estate?",
            "title_similarity": "0.23615476",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwk952n",
            "score": 1,
            "text": "Just wait. \nPeople keep buying over priced houses and soon prices will all increase by another 1/3. Soon after that a mass sell off will start and people will be fighting to sell first to profit most. This will start a very sharp decline in housing prices. So many houses will be on the market then foreclosures will start happening. This will be a tremendous housing market crash.",
            "title_similarity": "0.7423347",
            "sentiment_compound": -0.5667
        },
        {
            "id": "gwk9ocg",
            "score": 1,
            "text": "Flood plain variability and sea level projections are wildly differing depending on which model and series of assumptions is applied.\n\nThat being said most regulations still refer to the 100 year event rather then the 500 and most do not require freeboard of 2 feet for critical infastructure such as homes.  It's criminal.  Build if you must but build to minimize the subsidized cost or loose the subsidy.  It's more then ironic that the rich seem to be forgoing these projections under the assumption that rules will not change as the effects take place.  Even absent sea level rise and climate change the ever increasing projections into flood plains spelled an end to the flood insurance program, let the rich be bag holders... There should be a means testing applied to insurance subsidization.",
            "title_similarity": "0.6549369",
            "sentiment_compound": 0.5749
        },
        {
            "id": "gwkapg1",
            "score": 1,
            "text": "Seems like a big insurance scam to me, no?",
            "title_similarity": "0.5057789",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwkapr9",
            "score": 1,
            "text": "Good knowledge. How can we turn this into profit? Another Big Short perhaps?",
            "title_similarity": "0.34596878",
            "sentiment_compound": 0.7319
        },
        {
            "id": "gwkawvn",
            "score": 1,
            "text": "So...short the US housing market....got it",
            "title_similarity": "0.3030072",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwkbqzc",
            "score": 1,
            "text": "My entire home town is built AROUND all the flooding areas and otherwise its been irrigated to keep from getting too bad. \n\nIn the last few years, out of state developers have been building hundreds of homes on what are effectively marsh lands and constantly flood.\n\nWe haven't had a big flood in a few years but its only a matter of time.",
            "title_similarity": "0.65345967",
            "sentiment_compound": -0.0387
        },
        {
            "id": "gwkc670",
            "score": 1,
            "text": "How can I make money from this market inefficiency, assuming it's true? \n\nIs there a REIT I can short or can I do something else?",
            "title_similarity": "0.4422408",
            "sentiment_compound": 0.4871
        },
        {
            "id": "gwkcjpe",
            "score": 2,
            "text": "I believe that. And rebuilding New Orleans… Was a big mistake in my opinion. Call me a dumb Canadian but why would you want to live 8 feet below sea level? Right after mother nature tried to take it back? Crazy.",
            "title_similarity": "0.58429766",
            "sentiment_compound": -0.7059
        },
        {
            "id": "gwkcpwq",
            "score": 1,
            "text": "Reminder:  No Flood Insurance policies have managed to become profitable.\n\nIf mass flooding occurs, you're likely to end up under funded for your policy.",
            "title_similarity": "0.5693393",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gwkcv7p",
            "score": 1,
            "text": "$44B is a lot of money but not really that much in the context of the $36.2T US real estate market. That's 0.12%",
            "title_similarity": "0.64705545",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwkcwip",
            "score": 1,
            "text": "Had a relative that owned a house near a river.  She passed away and it sold for $450k in around 2006.  My friends grandfather had an identical house on a much much larger lot directly across the street.  Two years before he passed the river flooded.  When my friends family sold the property in 2012ish they only got 225k for it.  There is also now a mandate in the area that everyone needs to have flood insurance which helped drive the price down as well.",
            "title_similarity": "0.6710845",
            "sentiment_compound": 0.8074
        },
        {
            "id": "gwkdbx9",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.0027114241"
        },
        {
            "id": "gwkdfw5",
            "score": 1,
            "text": "So you’re telling me I’ll be able to take a boat to work soon?",
            "title_similarity": "0.22631559",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwkdy4o",
            "score": 1,
            "text": "Cause the US real estate marked is usually soooo stable",
            "title_similarity": "0.28303283",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwke3pq",
            "score": 1,
            "text": "If there ever is a flood, can’t they just sell them?",
            "title_similarity": "0.3768861",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwke4gu",
            "score": 1,
            "text": "While the title of the article says the houses are over priced.  I would say that the market values everything correctly, but that the government priced flood insurance is under-priced.  The cheap flood insurance mitigates the risk causing the values to be higher.",
            "title_similarity": "0.6614911",
            "sentiment_compound": 0.4118
        },
        {
            "id": "gwke5w7",
            "score": 1,
            "text": "Our farm had hundreds of acres that flooded every year.  Some years we had fields covered with blocks of ice the size of cars from the river.  Sometimes even actual cars.   What we didn't have were buildings in the flood plain.  We put them 200' above the river on a hill.  But within a few miles there were dozens of homes and farms in the danger zone.  The town even built the sewage treatment plant in the flood plain.",
            "title_similarity": "0.6538894",
            "sentiment_compound": -0.7227
        },
        {
            "id": "gwkeyrw",
            "score": 1,
            "text": "This is why you are forced to work your entire life.",
            "title_similarity": "0.2925166",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gwkf182",
            "score": 1,
            "text": "Bro, anyone buying today is an idiot. \n\n\nThe market is definitely about to crash. People forget 12 years ago. That's why it works.",
            "title_similarity": "0.5996982",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gwkfg8q",
            "score": 1,
            "text": "Flood zones? Just build some decent dikes and waterways.  What's the big deal?",
            "title_similarity": "0.3786512",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwkfpqq",
            "score": 1,
            "text": "Is there a 3D elevation map of the US? I Googled but couldn't find one. I just want a high granularity version of an elevation globe, which I had in elementary school.",
            "title_similarity": "0.47503108",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gwkfrby",
            "score": 1,
            "text": "Cheap federal flood insurance means no one is moving.  That is the source of the issue.",
            "title_similarity": "0.32471278",
            "sentiment_compound": -0.296
        },
        {
            "id": "gwkftw3",
            "score": 1,
            "text": "This isn't even limited to coastal properties. I grew up in a small town next to a river; they've had two \"thousand year floods\" in the past five years. Two big houses in my neighborhood have have their families evacuated and been demolished because they are now in a flood zone. It's happening everywhere.",
            "title_similarity": "0.5952635",
            "sentiment_compound": 0.1695
        },
        {
            "id": "gwkfv8e",
            "score": 1,
            "text": "Apparently California’s Central Valley is due for another ArKstorm like one when Governor Leland Stanford had to get to his inauguration by a boat because it was so flooded.\n\nA massive storm like that could inundate billions of dollars of property and infrastructure and cost many many lives.  Far more than an earthquake and something like this can indeed be countered.",
            "title_similarity": "0.74188673",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gwkfyvl",
            "score": 1,
            "text": "Shocker. Something tells me it's not just flood zone homes that are overvalued...",
            "title_similarity": "0.5233935",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gwkg8ah",
            "score": 1,
            "text": "How many Americans will have to be made homeless via floods, before we change our attitude towards climate change?",
            "title_similarity": "0.71371496",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwkgpau",
            "score": 1,
            "text": "This isn’t a coincidence",
            "title_similarity": "-0.09138955",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwkguxp",
            "score": 1,
            "text": "Well it sounds like some inland real estate is simply undervalued currently!",
            "title_similarity": "0.54904485",
            "sentiment_compound": 0.5983
        },
        {
            "id": "gwkh9hh",
            "score": 1,
            "text": "I feel as long as flood insurance is federally subsidized this will continue",
            "title_similarity": "0.3557918",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwkhwrf",
            "score": 1,
            "text": "So your telling me, in 30 years, I may have water front property!",
            "title_similarity": "0.31568348",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwki1kw",
            "score": 1,
            "text": "Need to be investing in more mangroves instead of real estate.",
            "title_similarity": "0.42314595",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwkj1zp",
            "score": 1,
            "text": "I wonder what percentage of that over-value resides in Texas?",
            "title_similarity": "0.4234149",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwkj8ws",
            "score": 1,
            "text": "Oh this is my field. I work on the models that help define the flood zones me along with thousands of other people i guess haha. All broken up into watersheds and what not and then compiled by the DNR.",
            "title_similarity": "0.49573314",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gwkjvfv",
            "score": 1,
            "text": "When did it change that the rich no longer lived inward and the poor lived by the water?",
            "title_similarity": "0.3957938",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gwkjwr1",
            "score": 1,
            "text": "I live 100 ft from the ocean in a house that has been here since 1971. We built a dock in 1988 that was about one foot above high tide. \n\nIt’s still about one ft above high tide. \n\nI believe in climate change but these catastrophic numbers I see published are just wrong. It’s bad because it has environmentalist like myself question all the other things these doomsayers put out.",
            "title_similarity": "0.6723343",
            "sentiment_compound": -0.9382
        },
        {
            "id": "gwkk95m",
            "score": 1,
            "text": "Flooding isn't just climate change, it's also paving over too much ground. Ellicott City used to flood because the river rose. The last few floods came from the opposite direction. A lot of land uphill from Ellicott city was developed. Now heavy rains funnel all the water down the main street toward the river.",
            "title_similarity": "0.6265935",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gwkkryf",
            "score": 1,
            "text": "Good schools, good location, big backyard for my dog to run in AND a 1/10 likelihood for flooding? I think we pulled a rabbit out of our hats buying this place. (And I know the assessment is not perfect, but northwest Columbus, Ohio is not exactly likely to flood.)",
            "title_similarity": "0.5482903",
            "sentiment_compound": 0.2266
        },
        {
            "id": "gwklg6p",
            "score": 1,
            "text": "Most states can make this information much more difficult to find than it should be",
            "title_similarity": "0.45033824",
            "sentiment_compound": -0.4201
        },
        {
            "id": "gwkm004",
            "score": 1,
            "text": "Flood insurance is so expensive for little coverage too.",
            "title_similarity": "0.57731175",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwkm1th",
            "score": 1,
            "text": "Our old house was up a small hill from a 50 year flood area which ended at a gravel road to a field that was a 10 and then annual flood area. \n\nThe last three lots sat empty because they backed up to the small ‘swamp’ where all the neighborhood rainwater would drain and any rain more than 1.5” would flood into the lots. \n\nWell, a developer built there and whenever we’d see people looking at the houses, we’d tell them about the flood area and how their backyard and basement would fill with water many times a year. \n\nPeople finally bought, I had told them about it, but they weren’t concerned. Whatever. That spring summer, it was time for a 50 year flood. \n\nAll three houses ended up with ~3ft of water in their basements and all the owners were pissed. I think flood planes and boardering flood planes aren’t reviewed like they should be. These were $260k houses too.",
            "title_similarity": "0.61055017",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gwkm7mb",
            "score": 1,
            "text": "Yep, south Texas homes are being list $20k+ than appraisal and no one wants concessions. It's friggin ridiculous.",
            "title_similarity": "0.6426299",
            "sentiment_compound": -0.4201
        },
        {
            "id": "gwkm8mt",
            "score": 1,
            "text": "There's a property in my county that's listed for $500,000 whose front yard has a great view of our municipal dump we call Mount Trashmore, and the backyard gets excellent views of i-95. It's also in a floodzone. When people buy houses they don't think about any other aspect other than \"is the property kind of big\" and \"how many bedrooms and bathrooms does it have?\". Literally that's the only thing people think about.",
            "title_similarity": "0.65143657",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gwkmimf",
            "score": 1,
            "text": "Yah we live in flood zones. I’m sure many people will argue that we shouldn’t build there. How much blood and treasure has been spent in human history to hang onto territory.",
            "title_similarity": "0.59708333",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gwkmjyw",
            "score": 1,
            "text": "As it turns out, Aquaman indeed doesn't want to buy your houses either",
            "title_similarity": "0.30374524",
            "sentiment_compound": -0.0572
        },
        {
            "id": "gwkmwar",
            "score": 1,
            "text": "Should be 864.2 billion\n\n-total real estate value of miami",
            "title_similarity": "0.5460252",
            "sentiment_compound": 0.3947
        },
        {
            "id": "gwkn8ei",
            "score": 1,
            "text": "I think some folks are building new homes in flood plains just to rip off insurance companies. Or near beaches for that matter.",
            "title_similarity": "0.5806806",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gwknlri",
            "score": 1,
            "text": "Just bought a condo in Fort Myers, Florida.  It's in a flood zone, but I made sure to buy a second floor unit.",
            "title_similarity": "0.43286484",
            "sentiment_compound": 0.4497
        },
        {
            "id": "gwko3gk",
            "score": 1,
            "text": "Definitely read this wrong and was wondering why so many expensive horses were being left in flood zones",
            "title_similarity": "0.5781262",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwkosvq",
            "score": 1,
            "text": "In my area of CA flood maps got redrawn about 10 years ago basically placing half the city of 140k people on a flood map.  The reasoning was that our damn was 50 years old and it was decided any damns or levies older than 50 years would be treated as non existent.  Before the existence of the damn, our area had historically flooded once in 300 plus years.\n\nTherefore I think the maps are overly cautious, if its the same everywhere there are probably millions being forced to pay for flood insurance they dont actually need or at least the risk is over estimated resulting in costs unfairly high.  That must play a role in balancing this problem.",
            "title_similarity": "0.74254537",
            "sentiment_compound": -0.9352
        },
        {
            "id": "gwkpdp1",
            "score": 1,
            "text": "Good. Everyone's complaining about how high housing prices are. The solution might just be a little sunshine in a shady industry. Publicize the flood risks. Point out how common building code violations are in new construction and in remodels. Make sharing utility bills a standard part of home sales. Etc.",
            "title_similarity": "0.74964106",
            "sentiment_compound": 0.5584
        },
        {
            "id": "gwkpr7w",
            "score": 1,
            "text": "$43.8 billion is probably about .000001% of the overall real estate market in the US. This is a nonsense article",
            "title_similarity": "0.770822",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwkpvw5",
            "score": 1,
            "text": "Well, they want to maximize their flood insurance rates.",
            "title_similarity": "0.32685322",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwkqe8g",
            "score": 1,
            "text": "Contrary to popular's belief, cyclically speaking hurricanes and floods have not changed in a statistically significant manner so far.",
            "title_similarity": "0.41578838",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gwkqr2j",
            "score": 1,
            "text": "See that little portion of south louisiana that is white.  I use to live there and my sister still does. Trust me when I say they are all in flood plain!! It is normal that just your flood insurance is more than your house note, plus the regular home owners insurance.",
            "title_similarity": "0.48639417",
            "sentiment_compound": 0.5972
        },
        {
            "id": "gwkqrzn",
            "score": 1,
            "text": "If climate change is that big of a threat the money would not be risking their investments in those zones.",
            "title_similarity": "0.45020363",
            "sentiment_compound": -0.3481
        },
        {
            "id": "gwkr0oy",
            "score": 1,
            "text": "The Williamette River next to Portland, OR etched a warning in the nearby banks. \"Floods reach THIS high.\" Anyone looking could see the indent where water had carved the soil away. Locals told me they'd sandbagged along Macadam Road to protect stores and homes at the base of a residential hillside. \n\nYet a lovely, modern mid-rise building gleaming with green glass and aluminum, was built right next to the shore;  wide walkways and landscaping, as if nothing was wrong. Confounding.",
            "title_similarity": "0.5308813",
            "sentiment_compound": 0.7687
        },
        {
            "id": "gwkrh0e",
            "score": 1,
            "text": "My husband and I bought our first house here in FL and finding a house NOT in a flood zone is amazingly hard. We're 20mi inland from the Gulf and on a hill but even them there are rivers and retention ponds everywhere. We like to drive through scenic neighborhoods on our way to the beach through multimillion dollar neighborhoods and most of these houses are not elevated on stilts. So many will definitely be gone in the next 50 years.",
            "title_similarity": "0.6268603",
            "sentiment_compound": 0.7814
        },
        {
            "id": "gwks8gf",
            "score": 1,
            "text": "Houses... Overvalued...? Say it aint so!",
            "title_similarity": "0.40499306",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwksi72",
            "score": 1,
            "text": "Federal Flood insurance is such a pain. Started out as good thing to help people who’s homes were destroyed by floods.\n\nBut here’s the problem, the intention was that if your home was destroyed by a flood, you’d get a bunch of insurance money, and use that money TO MOVE OUT OF THE FLOOD ZONE.\n\nBut instead people have just realized that nothing is forcing them to move out, so they just rebuild exactly where they are. Then twenty years later another major flood hits. And the problem repeats itself.",
            "title_similarity": "0.65376914",
            "sentiment_compound": -0.9161
        },
        {
            "id": "gwkst3c",
            "score": 1,
            "text": "Lots of houses in flood zones have irreplaceable views that hold value up",
            "title_similarity": "0.45288956",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwkt210",
            "score": 1,
            "text": "If climate change was believed by wealthy Democrats, then they wouldn't buy expensive coastal real estate.  They would move inland.",
            "title_similarity": "0.5399476",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwkt3k0",
            "score": 1,
            "text": "Even I live in a very minor flood risk location (mid-brooklyn nyc), the surrounding areas are in more danger. So real estate values are in danger.",
            "title_similarity": "0.65358317",
            "sentiment_compound": -0.7574
        },
        {
            "id": "gwkt7if",
            "score": 1,
            "text": "My immoral question is how do I bet against the housing market but only in these locations?",
            "title_similarity": "0.5132236",
            "sentiment_compound": -0.25
        },
        {
            "id": "gwku557",
            "score": 1,
            "text": "This is why I don't get the real estate frenzy in south florida right now. At some point, all of these houses will become worthless.",
            "title_similarity": "0.49714547",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gwkuldj",
            "score": 1,
            "text": "Can you give me a discount on yours? Would really appreciate it",
            "title_similarity": "0.043426927",
            "sentiment_compound": 0.4576
        },
        {
            "id": "gwkw1gv",
            "score": 1,
            "text": "Hopefully whoever has made these calculations isnt under some insurance company.",
            "title_similarity": "0.28707463",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwkw513",
            "score": 1,
            "text": "It's important to understand that we don't engineer full drainages in America.  We'll condemn flooded houses of poor people in the floodplain while allowing shopping mall developers to elevate their impermeable parking lots immediately next to the floodplain.  The 100 year floodplain isn't some magic line where there is no impact by adjacent development on flooding or no chance of flooding that development site.  We've devolved a risk that often applies to whole communities into a game based on a computer model.  This house can't be fixed, can't be developed, must have special USELESS insurance.  This house 1\" taller can have a basement.",
            "title_similarity": "0.59904397",
            "sentiment_compound": -0.8681
        },
        {
            "id": "gwkwpgy",
            "score": 1,
            "text": "And, on a far higher proof, real estate development going on like crazy, as if nothing else matters at all.  I live inland from Mustang and North Padre Island Texas, and they are going nuts building. Soon, they'll convince their fellow Corporatists to build their own 'wall', to keep out that pesky salt water. OR--HEY MAYBE, they'll get a desalination plant built to suck all that water up!  HEY!",
            "title_similarity": "0.6067902",
            "sentiment_compound": -0.7147
        },
        {
            "id": "gwkwyvj",
            "score": 1,
            "text": "There are housing markets with stability?",
            "title_similarity": "0.2017245",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwkx0dm",
            "score": 1,
            "text": "FEMA just released updated maps in 2020 which drastically changed the flood plain locations.  I'm in the Houston area and there are MANY people who didn't come close to flooding during Hurricane Harvey (~500-year storm depending on which Engineer you're asking) and are now in the 100-year floodplain.  Flood insurance is crazy expensive in these areas.",
            "title_similarity": "0.7462617",
            "sentiment_compound": -0.34
        },
        {
            "id": "gwkx8vd",
            "score": 1,
            "text": "So now they worry about climate change bc it will effect their bottom line and will now affect them- maddening",
            "title_similarity": "0.5682385",
            "sentiment_compound": -0.7479
        },
        {
            "id": "gwkxl50",
            "score": 1,
            "text": "Just sell the house to Aqua Man. Easy",
            "title_similarity": "0.23449995",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwky91k",
            "score": 1,
            "text": "Living in the Bay Area , literally 60 feet away from the bay scares the hell out of me, sure was pretty though.... suppose I’m happy about the huge sea wall being built across the street.",
            "title_similarity": "0.52954596",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gwl05e0",
            "score": 1,
            "text": "If the housing in flood zones is undervalued.",
            "title_similarity": "0.4769826",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwl0noa",
            "score": 1,
            "text": "Overvalued on what basis? Compared to similar houses?\n\nHouses in flood plains IE COASTAL are in desirable locations. The floodplain comes with the territory and those homes are slowly being lifted. New construction is all lifted and built to code to resist high winds.\n\nThese highly desirable locations have always been hazard prone and the cost low availability and higher cost of maintenance and construction generally only serves to help keep the price high and desirable because it keeps out trailer trash neighbors.\n\nI really doubt the market will be adversely affected by something that is already a threat and always has been.",
            "title_similarity": "0.60221416",
            "sentiment_compound": -0.2869
        },
        {
            "id": "gwl0w7i",
            "score": 1,
            "text": "Was this funded by the insurance industry?\nJust curious...",
            "title_similarity": "0.39849526",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gwl1q8o",
            "score": 1,
            "text": "Sounds like capitalism doing what it does.",
            "title_similarity": "0.22665173",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwl22dp",
            "score": 1,
            "text": "Listen.\n\nAs long as banks have mortgages, just ignore this problem. When it becomes a problem, put the people drowning and unable to pay a mortgage into a box, sell that box, and boom. \n\n*PARKOUR*",
            "title_similarity": "0.5652853",
            "sentiment_compound": -0.8283
        },
        {
            "id": "gwl2bmi",
            "score": 1,
            "text": "Any time a house residential property is flooded die to natural disaster. The feds should buy the property and then tear out the house and put green space in its place.",
            "title_similarity": "0.5751515",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gwl3e4u",
            "score": 1,
            "text": "Even the Obama's new home in Martha's Vineyard right?",
            "title_similarity": "0.38698986",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwl3hzc",
            "score": 1,
            "text": "43.8 billion is NOTHING spread out over all those flood zones",
            "title_similarity": "0.4168995",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwl3yn8",
            "score": 1,
            "text": "Their houses would crash, mine would increase in value because I live on a hill",
            "title_similarity": "0.6347505",
            "sentiment_compound": 0.25
        },
        {
            "id": "gwl4j1t",
            "score": 1,
            "text": "Gee, it's like a completely speculative market for a human necessity is a bad idea.",
            "title_similarity": "0.37500736",
            "sentiment_compound": -0.079
        },
        {
            "id": "gwl55m5",
            "score": 1,
            "text": "Used to live in Heppner, OR. Town is basically begging for a flood. It's set right below a earth and water damn, which has been around since the original flood of 1905 I believe?\n\nEvery house there are run down and in the flood plain, but somehow houses are going to 80k to 100k? Just seems unreasonable for such a high risk.",
            "title_similarity": "0.73131984",
            "sentiment_compound": -0.4956
        },
        {
            "id": "gwl5boj",
            "score": 1,
            "text": "Who knew government subsidizing of flood insurance would increase people living in flood zones??",
            "title_similarity": "0.66728234",
            "sentiment_compound": 0.3939
        },
        {
            "id": "gwl5dtm",
            "score": 1,
            "text": "Not saying that the Dutch way of watermanagement would work for the US, but as a country that has almost a 1000 years of experience in this field, it might be a good idea to hire us, and find a way that would work for the US.",
            "title_similarity": "0.54788864",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gwl5k72",
            "score": 1,
            "text": "That's it? Is this article a joke?\n\n$43.8B is literally nothing. A rounding error. \n\nThe total value of all homes in the US is $33.6 trillion. \n\nWhat entity created this assessment that says pretty much all coastal and river real estate is only overvalued to the tune of 0.13% of the whole market?\n\nAlso, what kind of scientist draws the conclusion of market instability from an over assessment of 0.13%?",
            "title_similarity": "0.7529377",
            "sentiment_compound": 0.9064
        },
        {
            "id": "gwl678w",
            "score": 1,
            "text": "overvalued to who? If someone is willing to pay a certain price for a house, then it's worth whatever the highest bidder is willing to pay.",
            "title_similarity": "0.40969896",
            "sentiment_compound": 0.296
        },
        {
            "id": "gwl6hls",
            "score": 1,
            "text": "Apple went up 2% the other day increasing 44 billion dollars in market cap. Interesting way to compare if 44 billion is a lot or a little",
            "title_similarity": "0.6561091",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gwl8bne",
            "score": 1,
            "text": "I’m in a flood zone.  All it means is I have to pay a lot extra to insure against a global catastrophe where water from a lake somehow flows upward 700 feet into the air or it rains for several years straight.  In either case I doubt Travellers will have the funds necessary to make me whole.",
            "title_similarity": "0.7588749",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gwl8ors",
            "score": 1,
            "text": "was driving down the coast of LA to Vegas and seen a ton of million dollar mansions on the edge of Clift I can't imagine being around soon.",
            "title_similarity": "0.6155764",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwl8rif",
            "score": 1,
            "text": "2019 Iowa flood victim here. \n\nMy house was valued at 45k\n\nI couldn't qualify for insurance because it wasn't worth enough but because I was in a flood plain the line for qualifying was WAY higher than it should have been.\n\nThere is nothing standing where it once was because I don't have the money to put anything there. \n\nI won't sell because land is the most valuable asset I have.",
            "title_similarity": "0.6731795",
            "sentiment_compound": 0.8528
        },
        {
            "id": "gwl9tk0",
            "score": 1,
            "text": "And no one ever holds the developers accountable for building homes in un safe\n areas . Unfortunately more people then you’d think aren’t educated enough to not buy these homes and assume if it wasn’t safe their government wouldn’t allow them to build there. Hence the saying buyer beware",
            "title_similarity": "0.5475961",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gwla8fj",
            "score": 1,
            "text": "The Netherlands would like to have a word with you",
            "title_similarity": "-0.013785964",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwladzc",
            "score": 1,
            "text": "Bunch of friends bough houses in the Sarasota suburbs and I asked about if their houses where in a flood zone and they no but a few streets down was. I’m thinking an extra foot of sea level isn’t going to help.",
            "title_similarity": "0.5437292",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gwlbwfr",
            "score": 1,
            "text": "Meanwhile we have to pay to access publicly funded research!",
            "title_similarity": "0.42203516",
            "sentiment_compound": -0.1759
        },
        {
            "id": "gwlc8u6",
            "score": 1,
            "text": "Where is Dr. Michael Burry?",
            "title_similarity": "0.15331641",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwlcber",
            "score": 1,
            "text": "Value is placed by a willing and able buyer.\n\nSimple supply and demand.   Technically *everything* is overvalued",
            "title_similarity": "0.22063322",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gwlcq0z",
            "score": 1,
            "text": "That seems a very small number.  I would estimate that just the Australian housing market (25 million v 380 million) would be larger than that.",
            "title_similarity": "0.5056226",
            "sentiment_compound": 0.1477
        },
        {
            "id": "gwld6zv",
            "score": 1,
            "text": "Similar vibe to CA building McSuburbs in tinder boxes. Ultimately the real estate cartels are being paid to set money on fire just like the war profiteers.",
            "title_similarity": "0.57979935",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gwle0gz",
            "score": 1,
            "text": "capitalists don't care, they only think in the short term and appeal more to the magical force of the market than science or rationality",
            "title_similarity": "0.33269882",
            "sentiment_compound": -0.3875
        },
        {
            "id": "gwlehqg",
            "score": 1,
            "text": "Most expensive game of hot potato I've ever played.",
            "title_similarity": "0.47641432",
            "sentiment_compound": 0.34
        },
        {
            "id": "gwleqr7",
            "score": 1,
            "text": "Surely it’s just mansions on beach fronts and lake fronts?",
            "title_similarity": "0.23232198",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwlesq1",
            "score": 1,
            "text": "so what states/areas should a first time home buyer look at?",
            "title_similarity": "0.3619241",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwlfz86",
            "score": 1,
            "text": "What's the state of floriduh worth? That chunk of land is already doomed. Along with a lot more.",
            "title_similarity": "0.44572788",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gwlg1ua",
            "score": 1,
            "text": "This valuation risk is pretty known and is yet another huge subsidy to wealthy by the federal government",
            "title_similarity": "0.59701276",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gwlgfgy",
            "score": 1,
            "text": "Houses are an investment. Therefor their price is more affected by peoples desire and expectation for profit instead of expected benefits. In other words as long as there is confidence by a large group of investors of future profitable sales than the prices dont fall. And those who are already invested in the market have every interest in not seeing a slump in confidence. So they dont sell below the steadily raising market rate. As long as they dont the prices dont go down and they make a profit.",
            "title_similarity": "0.5501639",
            "sentiment_compound": 0.967
        },
        {
            "id": "gwlghwa",
            "score": 1,
            "text": "That’s for the insurance companies to worry about.",
            "title_similarity": "0.35090864",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gwlh1fl",
            "score": 1,
            "text": "Houston TX probably accounts for 90% of this",
            "title_similarity": "0.49522406",
            "sentiment_compound": 0.4995
        },
        {
            "id": "gwlhea9",
            "score": 1,
            "text": "This is why I’m actually looking forward to private equity entering the single family home market. Hedge funds, corporations and foreign investors are driving up home prices and pushing out families. So when the worst of the climate impacts hit these at risk neighborhoods, families won’t be wiped out and left with the bulk of the costs.",
            "title_similarity": "0.6903578",
            "sentiment_compound": -0.7553
        },
        {
            "id": "gwli225",
            "score": 1,
            "text": "Time to short the housing market",
            "title_similarity": "0.24069744",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwliggi",
            "score": 3,
            "text": "The US government needs to stop supporting bad behavior like building in flood plains. \n\nIt’s that simple.",
            "title_similarity": "0.37431988",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gwlih08",
            "score": 1,
            "text": "It’s just like oil. If it wasn’t for the government propping it up no one would do it. But why not build there when the government practically pays you to do so?",
            "title_similarity": "0.54545736",
            "sentiment_compound": 0.0387
        },
        {
            "id": "gwlit52",
            "score": 1,
            "text": "My property has maybe 20 years left before its permanently underwater.  when we moved in 20 years ago, the property was dry 360 days a year.  Now its been over 20 months with standing water everywhere.  Lucky for me, I'll be dead before I have to move.",
            "title_similarity": "0.48418912",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gwlivrh",
            "score": 1,
            "text": "Time to find where the new beach front properties will be after sea levels rise.",
            "title_similarity": "0.38126782",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwliw6c",
            "score": 2,
            "text": "Real estate prices have inflated astronomically in New Orleans where a number of my friends live and it's wild. It floods there fairly often still and homes in the Bywater are going for $500-700k.",
            "title_similarity": "0.7828038",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gwlksbs",
            "score": 1,
            "text": "My house isn't valued at anywhere near $43 billion. What the hell am I doing wrong?",
            "title_similarity": "0.5703021",
            "sentiment_compound": -0.8781
        },
        {
            "id": "gwll2hv",
            "score": 1,
            "text": "Just in time for the stock market collapse, will no industry be safe??\n\nThank god I have stock in beanie babies and rocks",
            "title_similarity": "0.6022134",
            "sentiment_compound": 0.3527
        },
        {
            "id": "gwllw3t",
            "score": 2,
            "text": "Omg houses are overvalued! I had no idea.",
            "title_similarity": "0.47746253",
            "sentiment_compound": -0.3595
        },
        {
            "id": "gwllxul",
            "score": 3,
            "text": "Sounds like non-threatened areas are UNDERvalued",
            "title_similarity": "0.17761932",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gwllyhk",
            "score": 2,
            "text": "It’s all overvalued. Everything, everywhere.",
            "title_similarity": "0.1699322",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwlm1qc",
            "score": 1,
            "text": "Our government prints money when needed. Not worried about 53 billion",
            "title_similarity": "0.44343638",
            "sentiment_compound": 0.2235
        },
        {
            "id": "gwlmfrr",
            "score": 3,
            "text": "Thing is, even without global warming, flood zones are overdeveloped. Not just in the US of course, pressure on land use has meant that more and more people live in places that are just damn fool places to build, because the better options are taken, or expensive. And landowners keep \"improving drainage\" or \"developing wetlands\" and \"directing rivers\" which is essentially code for \"causing water to run off faster and flood worse\"",
            "title_similarity": "0.67611384",
            "sentiment_compound": -0.6852
        },
        {
            "id": "gwlmoop",
            "score": 2,
            "text": "I live in southern Louisiana and after the most recent damage of hurricane Laura I wonder how many more years like that my family’s house can take and if all the remodeling they are doing now is not for waste.",
            "title_similarity": "0.66397774",
            "sentiment_compound": 0.1611
        },
        {
            "id": "gwlmtqd",
            "score": 1,
            "text": "I quite often say in debates about energy generation and the cost of renewables, when people want to talk about subsidies, that fossil fuels have received the biggest subsidy of all time- it's just, it hasn't been paid for yet so it doesn't show up in any accounts. This is just a small part of that.   \n\n\nWorried about \"the stability of real estate markets\"? Worry about what happens when the same thing happens in Bangladesh.  And everywhere else at the same time. We're not talking about billions of dollars here, we're talking about desperate mass migration, hopelessly overtaxed infrastructure, disease, crop failures... wars, most likely.",
            "title_similarity": "0.70782065",
            "sentiment_compound": -0.93
        },
        {
            "id": "gwln6gg",
            "score": 2,
            "text": "As taxpayers we subsidize an increasing number of otherwise uninsurable houses in flood planes and fire zones.",
            "title_similarity": "0.7564552",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gwln9f6",
            "score": 1,
            "text": "They’ll continue to rebuild after each flood because insurance and FEMA (taxpayers) pay for it",
            "title_similarity": "0.5331754",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gwlnpm9",
            "score": 2,
            "text": "Take a cue from the big short. The market doesn’t adequately factor long term disaster in pricing.",
            "title_similarity": "0.51680464",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gwlo3f3",
            "score": 1,
            "text": "Where can I see this data? Am I in a flood zone?",
            "title_similarity": "0.28088883",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwlp5c8",
            "score": 1,
            "text": "The sheer number of people buying homes concerns me as well.\n\nNo way can buying continue like this and no way is everyone buying right now in a position to continue properly maintaining a home with housing prices the way they are.",
            "title_similarity": "0.6300603",
            "sentiment_compound": 0.128
        },
        {
            "id": "gwlq33p",
            "score": 1,
            "text": "Isn't 44 billion kind of just not very much in the grand scheme of things? Like, I expected this number to be in the trillions.",
            "title_similarity": "0.45921436",
            "sentiment_compound": 0.7073
        },
        {
            "id": "gwlqfh7",
            "score": 1,
            "text": "This overvaluing is at the core of what I suppose is misuse, over insuring, and bad lending. Seems like a model for extracting value. Business or product?",
            "title_similarity": "0.48081478",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gwlqwic",
            "score": 1,
            "text": "The left side of the country is/will experience severe drought and the right side is becoming increasingly flooded. \n\nThere is no escape.",
            "title_similarity": "0.5570171",
            "sentiment_compound": -0.4798
        },
        {
            "id": "gwlr1wd",
            "score": 5,
            "text": "I still can't believe people are building houses in Florida. The entire thing is a giant sandbar. It's days are numbered.",
            "title_similarity": "0.54467326",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwlss16",
            "score": 1,
            "text": "How would one make money on this situation? If we know something is overvalued by 43 billion, it seems we should be able to make money somehow. \n\n(Also, recycle , eat less meat, use public transportation, buy less crap, invest in socially responsible companies, and vote for people/parties who have sound climate initiatives)",
            "title_similarity": "0.6009579",
            "sentiment_compound": -0.0018
        },
        {
            "id": "gwlszbm",
            "score": 4,
            "text": "Can you short real estate the same way you would a stock?",
            "title_similarity": "0.3654582",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwluc5t",
            "score": 1,
            "text": "Doesn't matter. Thanks to Bidens spending spree of the US dollar , the housing market will soon crash . Along with the rest of the economy.",
            "title_similarity": "0.6599598",
            "sentiment_compound": -0.6346
        },
        {
            "id": "gwlulrm",
            "score": 1,
            "text": "I'm in WA state, we have lots of rivers and sloughs. We're going through a building boom right now. Guess what they're doing? Converting farm land to suburbs. Where's that farm land? Built on flood plains. Guess where all the people from out of town are buying houses now?? These are big, new houses and the market has them going for $450k+.",
            "title_similarity": "0.7342204",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwlut0n",
            "score": 1,
            "text": "I kinda wonder about the West. We have been in \"drought conditions\" for over 10 years. If climate change gets worse, will we run out of water?",
            "title_similarity": "0.6742991",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gwlvakk",
            "score": 1,
            "text": "This will eventually evolve into the government forcing a mass exodus out of these zones. It's all laid out in the UN Agenda 21.",
            "title_similarity": "0.5151881",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwlvk0f",
            "score": 1,
            "text": "Me who just bought a house in AE flood zone 🙃",
            "title_similarity": "0.41729188",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwlwex4",
            "score": 1,
            "text": "2008 said *wait, I've seen this before*",
            "title_similarity": "0.31664032",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwlx4rk",
            "score": 1,
            "text": "Powell is having financial firms look into the effects of climate change though. Unfortunately I think it’ll be a bit too late, kinda like the pandemic no one saw coming. Bubble go pop pop",
            "title_similarity": "0.6333995",
            "sentiment_compound": -0.3384
        },
        {
            "id": "gwlyne4",
            "score": 1,
            "text": "That number is way too low.",
            "title_similarity": "0.036223043",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gwlynwc",
            "score": 1,
            "text": "Head for the hills? Not bad advice, but I have a difficult time believing a number that low.  Certainly Miami should be worth at least a $Trillion.\n\nGiven our propensity to build cities at sea level we had better get to work real soon. On the faster is better front I've noticed that the EV growth rate is accelerating and that means battery production is accelerating and that means storage costs are falling faster.\n\nThat in turn means the transition is accelerating.  We might pull this off yet.",
            "title_similarity": "0.6770249",
            "sentiment_compound": 0.9027
        },
        {
            "id": "gwlz0mf",
            "score": 1,
            "text": "No one is going to read this, but the value of homes owned by people in the U.S. is currently about [$20.7 trillion](https://apps.bea.gov/iTable/iTable.cfm?reqid=10&step=3&isuri=1&table_list=28). Housing in flood zones are such a small amount of the housing stock that it's a rounding error. It has absolutely ZERO impact on \"the stability of real estate markets\" as a whole.",
            "title_similarity": "0.6437378",
            "sentiment_compound": -0.2617
        },
        {
            "id": "gwm12p2",
            "score": 1,
            "text": "Ive always been saying the insane housing prices in Southern California will mean nothing in the future when nobody can handle the heat. Beach house? Consider it nonexistent given enough years",
            "title_similarity": "0.5221468",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gwm2hg8",
            "score": 1,
            "text": "Every house is in a flood zone.",
            "title_similarity": "0.40905845",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwm3xse",
            "score": 1,
            "text": "Some of the flood zones are a bit misleading; if you build on 5 feet of fill you dramatically reduce your risk without changing your rating. Some fill is very common especially in Florida which is a high risk area.",
            "title_similarity": "0.57789505",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gwm3y5x",
            "score": 1,
            "text": "Where’s the surpriseeee",
            "title_similarity": "0.10680726",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwm40ty",
            "score": 1,
            "text": "Can someone explain how they're determining how something is overvalued?",
            "title_similarity": "0.25307757",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwm5zq8",
            "score": 1,
            "text": "I would like to add to this that my parents houses foundation is -11 feet below sea level due to California,s levees and per building regulations 15ish years ago we have no electrical on the first floor(below sea level) and should the levees break (almost did when it rained after the drought) the bottom floor is solid reenforced concrete and the house will endure (earthquake also not a problem with the floating foundation)\nThe real problem is waiting for the island to flood then rebuilding the levee, then pumping the water out and moving back in. \nFlorida building sea walls is dumb and just the same as the situation here: only postponing the inevitable. It’s gonna flood... \nbest solution = PREVENT MANMADE CLIMATE CHANGE, PROTECT AND CARE FOR THE PLANET YOU LIVE ON, DONT BE STUPID",
            "title_similarity": "0.5754911",
            "sentiment_compound": 0.939
        },
        {
            "id": "gwm8e1d",
            "score": 1,
            "text": "and there's a possibility this doesn't even include US territories like Puerto Rico where people drowned to death and/or lost everything during hurricane María.",
            "title_similarity": "0.50455713",
            "sentiment_compound": -0.8225
        },
        {
            "id": "gwm8jac",
            "score": 1,
            "text": "The fact that people build houses in disaster prone areas with seemingly no consideration for that potential disaster is amazing to me.  Like, why are houses in flood zones not built on stilts?  We know how to build houses like that.  We build them on the beach all the time.  Why do we build wooden stick houses in tornado alley?  We know how to build a house that can withstand a tornado.  We're just so short sighted and stupid that we'd rather pretend natural disasters aren't real.",
            "title_similarity": "0.5451101",
            "sentiment_compound": -0.8343
        },
        {
            "id": "gwm93ha",
            "score": 1,
            "text": "Read \"houses\" as \"horses\" in the title, was very confused",
            "title_similarity": "0.41993663",
            "sentiment_compound": -0.3804
        },
        {
            "id": "gwma3t6",
            "score": 1,
            "text": "$43.8B is a drop in the bucket when talking about the value of property. Just saying",
            "title_similarity": "0.67081904",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gwmbjsl",
            "score": 1,
            "text": "After harvey i saw so many gutted flooded houses still being priced at 150k.",
            "title_similarity": "0.6287414",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwmfny4",
            "score": 1,
            "text": "My neighborhood is located in a FEMA flood zone (we flood at least once a year, sometimes twice), but homes still go up for sale and prices keep climbing.",
            "title_similarity": "0.7222551",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwmgz3y",
            "score": 1,
            "text": "Wait till you guys hear about the unrealistic real estate prices in Canada specially after covid. Probably be cheaper to buy a house in US flood zone, get it destroyed and buy another one for the price of average single toronto home.",
            "title_similarity": "0.6794077",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gwmjo3y",
            "score": 1,
            "text": "That's because the moment these million dollar summer houses get washed down, their premium insurance is activated, and the owners get a tax write-off and a greatly increased fund.",
            "title_similarity": "0.7121067",
            "sentiment_compound": 0.3384
        },
        {
            "id": "gwmq2yt",
            "score": 1,
            "text": "Bring in the Dutch and build some dikes",
            "title_similarity": "0.20125553",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwmt4aq",
            "score": 1,
            "text": "The whole Florida will be completely under sea water after all the polar ice melted.",
            "title_similarity": "0.32584623",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwmtjpe",
            "score": 1,
            "text": "That's residential. Let's not forget commercial and industrial property.",
            "title_similarity": "0.31908458",
            "sentiment_compound": 0.1695
        },
        {
            "id": "gwmzfsh",
            "score": 1,
            "text": "In the long run this is good news.",
            "title_similarity": "0.15594219",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gwn6lxo",
            "score": 1,
            "text": "Can't wait for The Big Short 2",
            "title_similarity": "0.12894331",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwngh5h",
            "score": 1,
            "text": "One of the greatest money laundering/insurance scams in the history of the world.",
            "title_similarity": "0.62426496",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gwp2kzt",
            "score": 1,
            "text": "#1+those in Subsidence-ignored areas as Socorro.",
            "title_similarity": "0.1851247",
            "sentiment_compound": 0.0
        },
        {
            "id": "gwr1naz",
            "score": 1,
            "text": "Does anyone know if they separated the different flood zones? Or if they used the 100 year set up? If not this is Definitely more nuanced",
            "title_similarity": "0.48116964",
            "sentiment_compound": -0.3855
        }
    ]
}