{
    "Teen girls and young women in Colorado graduated high school at higher rates after the state expanded access to affordable contraception — some of the strongest quantitative evidence of better reproductive choices shaping the life trajectories of women.\n": [
        {
            "id": "gx2ilzk",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.5042595",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gx412e8",
            "score": 4,
            "text": "> **better reproductive choices shaping the life trajectories of women** \n\nOf course, this is precisely why the right wing doesn't want girls to have access to contraceptives.",
            "title_similarity": "0.62513727",
            "sentiment_compound": 0.3975
        },
        {
            "id": "gx3wzxw",
            "score": 9,
            "text": "Damn it’s almost as if conservatives want women to fail and continue the cycle of poverty.",
            "title_similarity": "0.45092985",
            "sentiment_compound": -0.8481
        },
        {
            "id": "gx45k8e",
            "score": 1,
            "text": "There's no such thing as \"pro life\" just anti-women in a more media friendly phrase",
            "title_similarity": "0.4141111",
            "sentiment_compound": 0.3134
        },
        {
            "id": "gx42wh2",
            "score": 2,
            "text": "That’s one of the reasons republicans oppose expanding access to birth control. Got to keep them barefoot and pregnant in the kitchen.",
            "title_similarity": "0.44069242",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx47v22",
            "score": 0,
            "text": "And now you see why Republicans and the religious right want to ban contraception.",
            "title_similarity": "0.38490075",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gx466bx",
            "score": 4,
            "text": "Republicans- we’ll tell you what you can do with your body.\n\nAlso republicans- “no one can tell me what I do with my body!!”\n\nBecause it doesn’t matter unless it effects them personally.",
            "title_similarity": "0.36829644",
            "sentiment_compound": 0.1739
        },
        {
            "id": "gx4foti",
            "score": -3,
            "text": "This is a big part of why GOP tends to be against it...\n\nThey *want* to reduce women's access to those paths, because it reduces competition for the mediocre dues of their base.",
            "title_similarity": "0.49817497",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gx3qsfw",
            "score": 8,
            "text": "Wow the rates went up 2%. That's statistically significant.",
            "title_similarity": "0.51507413",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gx4gv8k",
            "score": 1,
            "text": "It never fails. Another conservative myth is busted. When I was working in the summer youth program back in the 70s in New York, they gave out condoms to teens like candy. They knew that this would make it more acceptable for them to use it if they had it. \n\nThe city staff knew what these kids would be doing all summer long. This way, there would be less dropouts come fall school session.",
            "title_similarity": "0.683241",
            "sentiment_compound": 0.7525
        },
        {
            "id": "gx43gtr",
            "score": -2,
            "text": "I love hearing this news but I feel like, in my bones, I already knew this. And I’m disheartened because I also feel like the people out there who are making choices to legislate women’s bodies know this too... and that might be one of the reasons they’re doing it \n:(",
            "title_similarity": "0.5767776",
            "sentiment_compound": -0.0129
        },
        {
            "id": "gx2o8vj",
            "score": 16,
            "text": "Boom! Love it. Go Science. Now, let’s progress forward and leave the crusade period behind. Blind faith is a cop out.",
            "title_similarity": "0.37232",
            "sentiment_compound": 0.8016
        },
        {
            "id": "gx43gxb",
            "score": -51,
            "text": "women already graduate more than men but let's only focus on women because we are a man hating society after all.",
            "title_similarity": "0.53521633",
            "sentiment_compound": -0.6652
        },
        {
            "id": "gx4bna4",
            "score": -3,
            "text": "Kids ruin your life got it",
            "title_similarity": "0.2271499",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gx4b6yx",
            "score": 6,
            "text": "The only method of lifting communities out of poverty that has worked 100% of the time that it has been implemented was giving women control over their reproductive cycle.",
            "title_similarity": "0.6686616",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gx4fbx9",
            "score": -3,
            "text": "Boom! Love it. Go Science. Now, let’s progress forward and leave the crusade period behind. Blind faith is a cop out.",
            "title_similarity": "0.37232",
            "sentiment_compound": 0.8016
        },
        {
            "id": "gx3uuyw",
            "score": 52,
            "text": "Republicans: oops, gotta pass a Bill restricting contraception now! Gotta get this teen girls to pump out some kids!\n\nBut then leave them to fend for themselves",
            "title_similarity": "0.62290895",
            "sentiment_compound": -0.3987
        },
        {
            "id": "gx3f6jr",
            "score": 8,
            "text": "Oh. Science works for school?",
            "title_similarity": "0.41866842",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx4641h",
            "score": 4,
            "text": "Reminds me of a documentary I watched years ago called Freakonomics, where they talked about how a noticeable difference in quality of life and the reduction of crime in the getho was women having access to abortion. https://www.imdb.com/title/tt1152822/",
            "title_similarity": "0.6318628",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gx48bo9",
            "score": -13,
            "text": "Sorry but having a child is one of the worst things a woman can do if she wants a future. The risk is not worth it.",
            "title_similarity": "0.3493039",
            "sentiment_compound": -0.8872
        },
        {
            "id": "gx2t1kd",
            "score": -48,
            "text": "The conclusion makes sense, but is it a matter of causation or correlation?\n\nCould the increase in graduation rates stem from other factors, such as improvements in the curricula, access to technology, or other forms of outreach?\n\nHow have boys' graduation rates fared in the period?\n\nHow do the rates compare in neighboring states without the same contraception access programs?",
            "title_similarity": "0.59660566",
            "sentiment_compound": 0.8645
        },
        {
            "id": "gx454g8",
            "score": 10,
            "text": "Neither side of the debate is surprised by this.",
            "title_similarity": "0.08644872",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gx4b15r",
            "score": -17,
            "text": "liberal talking point /= ScIeNcE\n\nthat being said, i have no issue with what CO is doing even if i think this 'study' is bs. there are many variables that go into this than just affordable contraception.",
            "title_similarity": "0.50547725",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gx4jnmm",
            "score": -1,
            "text": "Just women though, getting someone pregnant as a male teen is no negative impacts",
            "title_similarity": "0.55107546",
            "sentiment_compound": 0.4585
        },
        {
            "id": "gx47ojy",
            "score": -2,
            "text": "You sure it's not all the money they're getting from pot taxes they're putting in the school system?",
            "title_similarity": "0.4416951",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gx490y2",
            "score": 0,
            "text": "Colorado has the type of Democrats running the state that i want! Accessible birth control, legalize psilocybin ahead on the weed train! These dudes are killing it",
            "title_similarity": "0.51625115",
            "sentiment_compound": -0.6892
        },
        {
            "id": "gx4iqxz",
            "score": 1,
            "text": "But in Colorado you can still become a congresswoman even if you drop out of high-school and blame it on pregnancy.   All you need is a gun and some plastic surgery.",
            "title_similarity": "0.6852629",
            "sentiment_compound": -0.8338
        },
        {
            "id": "gx4s14g",
            "score": 2,
            "text": "This is the exact reason Republicans are terrified of that happening.",
            "title_similarity": "0.34959567",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gx5d79h",
            "score": 0,
            "text": "don't female already graduate both levels of education at higher rates then males?",
            "title_similarity": "0.7021009",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx40xzy",
            "score": 2,
            "text": "Well color me shocked...",
            "title_similarity": "0.0028696172",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gx44lzq",
            "score": -9,
            "text": "Now if only they could figure out those mass shootings",
            "title_similarity": "0.37483335",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx4db5d",
            "score": 2,
            "text": "Great to see studies done on this. Empowering women leads to so many positive effects within a country that there’s simply no excuse against it. Some people just try their darnedest to keep them vulnerable so they can take advantage.",
            "title_similarity": "0.68865395",
            "sentiment_compound": 0.8341
        },
        {
            "id": "gx4hikp",
            "score": 2,
            "text": "No one who is truly pro life would be opposed to free contraception.",
            "title_similarity": "0.40222394",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gx4vax2",
            "score": 2,
            "text": "Planned Parenthood saves lives.",
            "title_similarity": "0.4394043",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx57zri",
            "score": 3,
            "text": "Exactly the reason why conservatives are against women having access to affordable contraception.",
            "title_similarity": "0.5042079",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx41lff",
            "score": 5,
            "text": "Proud Coloradoan.  Led the country with this, led the country MJ legalization, electoral college pact reform, state EV tax rebate on top of federal rebate, passed red flag gun law, passed police reform last year. Hoping we can do universal healthcare next.",
            "title_similarity": "0.7143446",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gx4amlh",
            "score": 4,
            "text": "It’s funny how we know the best way to solve a lot of our problems, but a small section of the population opposes doing this for silly reasons.",
            "title_similarity": "0.42144886",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gx4hxp1",
            "score": 3,
            "text": "'Women actually graduate at higher rates due to being given access to proper medical care'. Gee, you don't say?",
            "title_similarity": "0.7658167",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gx4dsx2",
            "score": 3,
            "text": "I think partially that's why they don't offer it. Some politicians do not see a woman's place as being educated and in the workforce. They want them poorly educated and at home - even though they have also made it nearly impossible for a single earner household.",
            "title_similarity": "0.4726752",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gx4d4gp",
            "score": 25,
            "text": "It boggles my mind that so many people in r/science don't even read the article. And cheer them on because they confirm their biases. That's pretty much the opposite of science. The authors acknowledge that they didn't even check whether respondents used those measures and didn't check whether other factors contributed to higher percentage of graduations. So it's basically correlation that authors didn't bother to check rendering this study as valuable as Cosmopolitan survey.",
            "title_similarity": "0.47501516",
            "sentiment_compound": 0.8918
        },
        {
            "id": "gx59uwu",
            "score": -1,
            "text": "Ah yes, throw your reproductive system away to be a wage slave for 60 years. Gotta love capitalism",
            "title_similarity": "0.48326594",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gx3a4p9",
            "score": 17,
            "text": "I was a small part of this initiative happening in Colorado in 2008-9 and am so proud. And grateful the public health experts I was working with had the foresight to focus on data collection. This initiative has provided many studies’ worth of data on this simple, logical, and incredibly important topic.",
            "title_similarity": "0.593961",
            "sentiment_compound": 0.882
        },
        {
            "id": "gx3x3nq",
            "score": 113,
            "text": "I get it and truly believe that contraception and real sex ed are good and necessary. But FFS, why do we always have to go over this, correlation doesn’t imply causation. This is first and foremost an observational study. Secondly it’s not even comparative. \n\n>Girls who simply were in Colorado and under 16 after the initiative began in 2009 had graduation rates 1.66 percentage points higher overall…\n\n>The vast majority of young women in Colorado didn't go to a clinic during this time, right? So this effect is a conservative estimate…\n\n>Stevenson and her co-authors pointed out that they did not measure exactly how the program affected girls and young women; they looked at data from the U.S. Census Bureau, and they did not consider factors such as how close teens were to a Title X clinic, whether they went to a clinic or whether they used contraception. \"The Colorado Family Planning Initiative was designed to improve access for all Colorado residents, and so we consider everybody who lived in Colorado to be 'treated,'\"",
            "title_similarity": "0.75221664",
            "sentiment_compound": -0.3505
        },
        {
            "id": "gx4fymt",
            "score": 5,
            "text": "The worst part is that even with this information, conservatives will still do everything possible to ban access to contraceptives. These people are literally a virus to society and the world would be a better place without them.",
            "title_similarity": "0.3931681",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gx4xfp8",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.119477965"
        },
        {
            "id": "gx2yb3q",
            "score": -45,
            "text": "[removed]",
            "title_similarity": "-0.119477965"
        },
        {
            "id": "gx2pkks",
            "score": -73,
            "text": "Why not create a society where people can reproduce at the most healthy age AND have a productive career if they wish?\nAren’t children still a or even the central part of most peoples‘ „life  trajectory“?",
            "title_similarity": "0.58116734",
            "sentiment_compound": 0.6415
        },
        {
            "id": "gx4moa8",
            "score": -6,
            "text": "That is common sense. \"Needing\" evidence for such clear things seems like gaslighting",
            "title_similarity": "0.34404677",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gx48ltf",
            "score": 2,
            "text": "But think of all those lost republican votes.....",
            "title_similarity": "0.3194371",
            "sentiment_compound": -0.4497
        },
        {
            "id": "gx2om9n",
            "score": 45,
            "text": "[removed]",
            "title_similarity": "-0.119477965"
        },
        {
            "id": "gx47qc4",
            "score": 68,
            "text": "Now come out with a contraceptive for men beyond wrapping a primative piece of rubber around their units! \n\nFeel like it’s really crappy that the bulk of contraceptive use is mainly laid on the women. There was supposed to be an injection for men, or a pill men could take, or the targeting of a protein that’s only found in sperm tails that would render them useless etc. \n\nThe amount of “scientific” announcements of potential upcoming male contraceptives that ultimately result in nothing is just sad.",
            "title_similarity": "0.47281742",
            "sentiment_compound": -0.4462
        },
        {
            "id": "gx434lc",
            "score": 40,
            "text": "[removed]",
            "title_similarity": "-0.119477965"
        },
        {
            "id": "gx43m0c",
            "score": -3,
            "text": "Also a lot of the birth control was paid for with weed dollars/tax",
            "title_similarity": "0.42328304",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx4murz",
            "score": -2,
            "text": "It isn't better it's different. Alot of people have had and will have productive members of society younger than 21 please think before you label all us of a drain on the tax payer as I and my Mom 17 (30 years ago of course) pay a lot more tax than we taken over the years. Great that contreception is readily available to those who wish to use it but please be respectful.",
            "title_similarity": "0.69541955",
            "sentiment_compound": 0.8778
        },
        {
            "id": "gx4tcf0",
            "score": 3,
            "text": "Isn't it amazing how much you can accomplish by empowering women and girls to make their own choices?",
            "title_similarity": "0.6000658",
            "sentiment_compound": -0.0701
        },
        {
            "id": "gx50qxz",
            "score": 2,
            "text": "I mean religion shits on women, period. It just does. (Most of them anyway, certainly Christianity)",
            "title_similarity": "0.47565955",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gx2meki",
            "score": 307,
            "text": "It irks me that a study needs to be done to prove basic logic. If women can avoid pregnancy, then you can bet more of them will graduate. The thing that caused them to drop out suddenly has a cure. Are there really people who claim it makes no difference and the same number of females willingly choose to have babies instead of a life?",
            "title_similarity": "0.6560657",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gx44q8z",
            "score": 25,
            "text": "We should also be investigating what is holding men and boys back in education in addition to women, because men are underrepresented in all levels of education and are failing academically.",
            "title_similarity": "0.48237452",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gx4oner",
            "score": -13,
            "text": "Why should other people pay for something that is exclusively used by some group? We don't pay for free helmets for bikers so why should we pay for \"affordable contraceptive\"?",
            "title_similarity": "0.36944586",
            "sentiment_compound": -0.5523
        },
        {
            "id": "gx4iom9",
            "score": -3,
            "text": "“Obama Elected : Female High School Grades Improve”\n\nThere,  fixed your headline.",
            "title_similarity": "0.79962134",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx56a7m",
            "score": -4,
            "text": "Tough choice. You want to have more educated women or keep reproducing as a nation. Birth rates are falling for all demographics in us",
            "title_similarity": "0.6224396",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gx5fdkb",
            "score": 0,
            "text": "Where was all this ramped sex when I was in high school?",
            "title_similarity": "0.5890307",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jme3n",
            "score": 0,
            "text": "Can they do it without killing kids",
            "title_similarity": "0.25849938",
            "sentiment_compound": 0.5448
        },
        {
            "id": "gx47mkl",
            "score": -19,
            "text": "Yes but it has lead to a swathe of 35 yr old women alone and regretting not having children.",
            "title_similarity": "0.48311213",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gx3y4f4",
            "score": 56,
            "text": "Well. I am shocked. This is a shock. How incredibly shocking. I could not be more shocked.",
            "title_similarity": "0.17562371",
            "sentiment_compound": -0.5595
        },
        {
            "id": "gx4uuy1",
            "score": 5,
            "text": "It’s almost like if we take care of peoples health they will, in turn, be more productive in our society. Crazy concept.",
            "title_similarity": "0.53550065",
            "sentiment_compound": 0.4601
        },
        {
            "id": "gx4cskh",
            "score": -18,
            "text": "The sexual revolution was a mistake",
            "title_similarity": "0.30917466",
            "sentiment_compound": -0.34
        },
        {
            "id": "gx2ni2r",
            "score": -95,
            "text": "Uh yes.  Like the decision to not screw",
            "title_similarity": "0.09417385",
            "sentiment_compound": 0.6701
        },
        {
            "id": "gx4v6e1",
            "score": 1,
            "text": "Better reproductive options****",
            "title_similarity": "0.47714734",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gx56dy5",
            "score": 1,
            "text": "And among conservatives that is the problem.",
            "title_similarity": "0.15667404",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gx5bllv",
            "score": 1,
            "text": "Just one more reason I love Colorado.",
            "title_similarity": "0.39438537",
            "sentiment_compound": 0.6666
        },
        {
            "id": "gx5ck45",
            "score": 1,
            "text": "Someone show me a study that says teaching abstinence and/or anti abortion laws reduces teen pregnancy/ abortions. Just one, because I’ve never seen it.",
            "title_similarity": "0.51439476",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gx5emvo",
            "score": 1,
            "text": "Yeah the republicans know this. But their ENTIRE existence is predicated on keeping people stupid",
            "title_similarity": "0.31003034",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gx4q8bo",
            "score": -7,
            "text": "Sounds good until you take a look at the correlated high rate of mental health issues and single parent households that contraceptives and a frivolous lifestyle entail. But that isn't as attractive to bring up.",
            "title_similarity": "0.48754746",
            "sentiment_compound": -0.2867
        },
        {
            "id": "gx2mom9",
            "score": 669,
            "text": "I think that we're advancing as a society, and then I see an article like this and realize we aren't as far along as I think.",
            "title_similarity": "0.45785236",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gx4hgmr",
            "score": -16,
            "text": "What a bunch of liberal crap",
            "title_similarity": "0.16758631",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gx4bxhx",
            "score": -9,
            "text": "Sure, make contraceptives easy to access and abortions illegal. I'd be fine with that.",
            "title_similarity": "0.45384485",
            "sentiment_compound": 0.34
        },
        {
            "id": "gx4k80e",
            "score": 2,
            "text": "Yeah but that's not what the government wants. They want more babies, more taxes, more poor people who can't afford to fight back.",
            "title_similarity": "0.47295058",
            "sentiment_compound": -0.2867
        },
        {
            "id": "gx4u36f",
            "score": 2,
            "text": "Why aren't pregnancy rates cited in this article?  \n\nSeems like an essential statistic",
            "title_similarity": "0.53370583",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gx539u3",
            "score": -2,
            "text": "I’m with you in spirit, but *holy crap* is this bad science. Remember correlation =\\= causation folks. Girls born within a 2 year span graduated at a 2% higher rate *because* they had condoms? No mention of anything else that could have correlated to that incredibly small rise?\n\nWhen good scientists practice bad science it makes all science look bad. This kind of BS is what opened the door for the quackery that Trump forced on all of us for 4 years. Please stop this immediately.",
            "title_similarity": "0.6976259",
            "sentiment_compound": -0.97
        },
        {
            "id": "gx55vre",
            "score": 2,
            "text": "I was on an iud through college. At 25 I found a Dr who respected my autonomy and was able to get myself surgically sterilized. This is how I chose to live my life to the fullest and with no regrets.",
            "title_similarity": "0.5607814",
            "sentiment_compound": 0.6381
        },
        {
            "id": "gx56vwq",
            "score": 2,
            "text": "This study is kind of singing to the choir. Pretty sure everyone was already aware that teen pregnancies brought most educations to an end. The anti-abortion crowd (they are not pro-life and I refuse to call them that) DOESN'T CARE. The politicians they vote for DON'T CARE. If anything, they want more drop-outs. Much easier to manipulate the poor, uneducated, and religious.",
            "title_similarity": "0.5465298",
            "sentiment_compound": -0.417
        },
        {
            "id": "gx59v2z",
            "score": 2,
            "text": "I work at a Planned Parenthood in Colorado and for everyone in the age range this applies to who comes in with no insurance we refer them to this program. In the Denver area at least it’s called BC4U",
            "title_similarity": "0.45563737",
            "sentiment_compound": -0.296
        },
        {
            "id": "gx6gfcz",
            "score": -2,
            "text": "Funny cause over all success and happiness for all generation after generation comes from waiting for a quality man to marry and not slutting it up ,,,next",
            "title_similarity": "0.54873407",
            "sentiment_compound": 0.8807
        },
        {
            "id": "gx4dpe8",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "-0.119477965"
        },
        {
            "id": "gx3kt6r",
            "score": -34,
            "text": "Expanded access to affordable contraceptives?  Dude, things like condoms are already cheap and sold in a ton of places, are they selling them in libraries and hardware stores now or something?",
            "title_similarity": "0.4367864",
            "sentiment_compound": 0.4329
        },
        {
            "id": "gx4vzox",
            "score": 2,
            "text": "I worked in the Colorado State Senate around this time. Shortly after the private funding ended and the results were shared with the obvious request to continue funding the program publicly, the tea party republicans (precursor to the GQP) brought in “doctors” who told everyone that IUDs cause abortions by preventing fertilized eggs from embedding in the uterine lining. [They scrapped the whole thing.](https://www.theguardian.com/us-news/2015/may/06/colorado-contraception-family-planning-republicans)",
            "title_similarity": "0.5945544",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gx52rkl",
            "score": -3,
            "text": "Or just have some self-control 🙄",
            "title_similarity": "0.07975199",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx55m75",
            "score": 3,
            "text": "How about stop making the idea of having children a necessary step in a successful life. There are enough people in the world.",
            "title_similarity": "0.46656296",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gx5p7dg",
            "score": -4,
            "text": "It's good that more personal responsibilities can be offset by government policy.",
            "title_similarity": "0.44449174",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gx4dl4q",
            "score": 13,
            "text": "\\>1.66 percentages points higher overall\n\nThat seems...fairly inconsequential.",
            "title_similarity": "0.21883127",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx519k0",
            "score": 3,
            "text": "That's the thing; the people who campaign against birth control don't want women to have those kind of choices. They want them barefoot and pregnant.",
            "title_similarity": "0.4434931",
            "sentiment_compound": 0.0201
        },
        {
            "id": "gx4anwh",
            "score": -17,
            "text": "Several fun facts\n1. If you don't want kids don't have sex\n2. Consequenceless sex is not a right, it's a privilege\n3. Of course they will graduate at higher rates because less will drop out to take care of their kids. This is kind of a \"um yeah it doesn't take a scientist to figure this out\" post.",
            "title_similarity": "0.66425675",
            "sentiment_compound": 0.8464
        },
        {
            "id": "gx43d11",
            "score": -12,
            "text": "[deleted]",
            "title_similarity": "-0.08741166"
        },
        {
            "id": "gx4a6aj",
            "score": -10,
            "text": "What about the life trajectory of their soul?",
            "title_similarity": "0.13029012",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx4wzj4",
            "score": 11,
            "text": "In Germany from the age of 14 girls can get a prescription for the pill or contraceptives by a doctor. Without a parents notice or agreement.",
            "title_similarity": "0.55927175",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gx3hnpf",
            "score": -60,
            "text": "So these Coloradan women are perfectly fine graduating and killing unborn fetuses? \n\nThat is sad, and to the people who support that, you’re sad too.",
            "title_similarity": "0.5398748",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gx3s81l",
            "score": 643,
            "text": "Pregnancy can be a mistake but it shouldn't be a punishment",
            "title_similarity": "0.28567314",
            "sentiment_compound": 0.4102
        },
        {
            "id": "gx2jmjv",
            "score": 2876,
            "text": "Condoms should be free or nearly free at every high school and college.\n\nBirth control should be easy to get as this Covid vaccine.\n\nThis \"punishment\" mentality with sex doesn't help society especially women.",
            "title_similarity": "0.5919102",
            "sentiment_compound": 0.5411
        },
        {
            "id": "gx3mltx",
            "score": -50,
            "text": "But what about their rights to kill their mass of cells?    Isn't that right being oppressed with this affordable contraception?!",
            "title_similarity": "0.43128642",
            "sentiment_compound": -0.9239
        },
        {
            "id": "gx4a5r3",
            "score": 94,
            "text": "Just curious. 3800 more females graduated.\n\nWhat was the number of unplanned teen pregnancy that came down?\n\nPurely curious on the stats. I definitely agree unplanned pregnancy leads to major upending of the teens life and we definitely need to make contraceptives freely available.\n\n Just wondering academically if the stats have been affected by general increase in emphasis on education.",
            "title_similarity": "0.7835685",
            "sentiment_compound": 0.9402
        },
        {
            "id": "gx488u4",
            "score": 2,
            "text": "If this past year of increased productivity with work from home data has not convinced anyone, its time to realize that we don't live in a Data driven world. We live in an authoritarian country that is more concerned with controlling people and less about anything else.",
            "title_similarity": "0.5207658",
            "sentiment_compound": -0.0408
        },
        {
            "id": "gx49yjx",
            "score": 2,
            "text": "How hard is it for others to get birth control in your state? Minnesota is horrible! I tried to find someone to write a letter to but we are in a red county so my efforts would be futile. It really should be easier to access.",
            "title_similarity": "0.524912",
            "sentiment_compound": -0.3604
        },
        {
            "id": "gx4bkb6",
            "score": 1,
            "text": "I thought it would be lower. What “news” is this?",
            "title_similarity": "0.1414385",
            "sentiment_compound": -0.296
        },
        {
            "id": "gx4cq5x",
            "score": 2,
            "text": "I fail to see how this is a surprise",
            "title_similarity": "-0.022893168",
            "sentiment_compound": -0.34
        },
        {
            "id": "gx4dudl",
            "score": 1,
            "text": "The Pill should be free and available OTC at CVS or Walgreens.",
            "title_similarity": "0.38709998",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gx4elz8",
            "score": 3,
            "text": "Is this causation or correlation?",
            "title_similarity": "0.002737619",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx4julc",
            "score": 1,
            "text": "Serious question, is \"affordable contraception\" just not well known? Generic birth control with zero insurance is like 5 bucks a month. I think education on how to get affordable contraception is the bigger problem.",
            "title_similarity": "0.53653824",
            "sentiment_compound": -0.3213
        },
        {
            "id": "gx4kto4",
            "score": 1,
            "text": "The article says that when studied against the changing rates of other states the difference to difference analysis said that only a 1.66% percentage point increase was due to the program. That doesn’t sound like the in-your-face slam dunk I would have hoped for.",
            "title_similarity": "0.5212629",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gx4ntzu",
            "score": 1,
            "text": "But have you considered the dragon of chaos??",
            "title_similarity": "0.16957808",
            "sentiment_compound": -0.7514
        },
        {
            "id": "gx4ydnu",
            "score": 1,
            "text": "Teen birth rates dropped, while STD rates… not so much. Condoms are the only way to stop the spread (yea not having sex… but that ain’t gonna happen). Should be free condoms everywhere.\n\n“Among the more worrisome statistics is the significant increase in STIs over the span of one year among Colorado teens.\n\nData shows STIs among adolescents ages 15-19 increased 30.4 percent for gonorrhea, 23.3 percent for HIV and 7.2 percent for chlamydia between 2016 and 2017.”\n[article ](https://www.thedenverchannel.com/lifestyle/health/report-birth-rates-among-colorado-teens-decreasing-as-spread-of-stis-goes-up)",
            "title_similarity": "0.6588054",
            "sentiment_compound": 0.7691
        },
        {
            "id": "gx5446m",
            "score": 1,
            "text": "I wish the South African government would wake up and realise how important contraceptives are for school girls. We have such a high drop out rate due to teen pregnancy and I feel like the government is just ignoring it.",
            "title_similarity": "0.68817765",
            "sentiment_compound": 0.296
        },
        {
            "id": "gx54c34",
            "score": 2,
            "text": "And the future men/women they will bring into the world. Everyone wins.",
            "title_similarity": "0.5723632",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gx55blz",
            "score": 1,
            "text": "I read the first five words of that post and said \"Academic Times\" and will you look at that.",
            "title_similarity": "0.37428078",
            "sentiment_compound": 0.0
        },
        {
            "id": "gx5hvf9",
            "score": 1,
            "text": "I'm not familiar with difference in difference measurements. Can someone smarter than me explain how they assigned causality to this? Intuitively you'd think it would have an effect, but just trying to understand the methods used to assign causality to correlation.",
            "title_similarity": "0.38525444",
            "sentiment_compound": 0.25
        },
        {
            "id": "gx5li4c",
            "score": 1,
            "text": "I was surprised to learn that they offer IUDs as free birth control for teens in Colorado from my friend that grew up there and participated in the program. She came from a very religious and abusive family and moved out at 16-17 with her boyfriend at the time. She told me that an UID was the reason she was able to graduate high school and leave her crappy town.",
            "title_similarity": "0.6775224",
            "sentiment_compound": -0.2177
        },
        {
            "id": "gx5m2ox",
            "score": 2,
            "text": "That's cool.  Each little number that got the stats a little better are individual lives and families that are always better because of some programs that make sense being increased.",
            "title_similarity": "0.6169566",
            "sentiment_compound": 0.8366
        },
        {
            "id": "gx5nsgk",
            "score": 1,
            "text": "Yay my state did sum cool",
            "title_similarity": "0.2591855",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gx64xn1",
            "score": 1,
            "text": "Free contraception is nothing but win, we get:\n\nBetter educated people\nHigher earnings\nWhen they have kids they do better because the parents are ready\nLess spending on welfare",
            "title_similarity": "0.6796558",
            "sentiment_compound": 0.8398
        },
        {
            "id": "gx6sd85",
            "score": 2,
            "text": "who woulda guessed it........maybe feminjst scholars who’ve been saying it for years",
            "title_similarity": "0.3697843",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxf3s6q",
            "score": 1,
            "text": "So maybe you should have Planned Parenthood teach schools, eh? Or put them all in convents where they don't have access to sperm. Or even better, have Planned parenthood teach at convents!",
            "title_similarity": "0.5545199",
            "sentiment_compound": 0.4926
        },
        {
            "id": "gxo56x9",
            "score": 1,
            "text": "Am i the only one who gets a paywall one sentence in? Does it say what the time period was, what the change in the boys was, and if they controlled for other variables?",
            "title_similarity": "0.34720182",
            "sentiment_compound": 0.168
        }
    ]
}