{
    "67% of participants who received three MDMA-assisted therapy sessions no longer qualified for a PTSD diagnosis, results published in Nature Medicine\n": [
        {
            "id": "gxm7op9",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.367685",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gxmtye5",
            "score": 1,
            "text": "30% lied to continue getting mdma",
            "title_similarity": "0.6341329",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gxmnvnm",
            "score": -12,
            "text": "Why are so many top articles on this sub about psychedelics? Oh right I’m on Reddit",
            "title_similarity": "0.43203574",
            "sentiment_compound": 0.2682
        },
        {
            "id": "gxmu4pe",
            "score": 0,
            "text": "67% is a suspicious number. n = 3?",
            "title_similarity": "0.5021746",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxmy524",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.21257734"
        },
        {
            "id": "gxmvbri",
            "score": -3,
            "text": "Is it fair to say now that if you're against MDMA legalization, you hate veterans and abuse victims?",
            "title_similarity": "0.46526954",
            "sentiment_compound": -0.836
        },
        {
            "id": "gxmr36x",
            "score": 11,
            "text": "91 participants is still a very very small sample size.",
            "title_similarity": "0.40204173",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxmdzhf",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.15739402"
        },
        {
            "id": "gxmszyo",
            "score": 0,
            "text": "That's awesome! PTSD is actually MUCH more curable than people think it is. Generally, people who suffer from this condition need a certain level of love and support that our society is not willing to provide. There are other societies where people generally recover from PTSD much faster than in western society. Our entire approach has been abysmal, and this is a major step in the right direction. You truly love to see it.",
            "title_similarity": "0.42081743",
            "sentiment_compound": 0.9516
        },
        {
            "id": "gxmplcf",
            "score": 0,
            "text": "So how do patients actually receive this therapy?",
            "title_similarity": "0.3451299",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxmtebm",
            "score": 1,
            "text": "I had a really “challenging” trip on ayahuasca. Saw the devil. The whole nine yards. And it was the best thing I have ever done for my mental health. Feel like I shed so much. Totally worth the terrifying experience and would absolutely repeat.",
            "title_similarity": "0.35033914",
            "sentiment_compound": -0.0534
        },
        {
            "id": "gxmskkn",
            "score": 2,
            "text": "Can you imagine if the cure to autism is boatload of acid.",
            "title_similarity": "0.4404704",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxmxa1h",
            "score": -10,
            "text": "Hmmmmm, I think I'll keep my PTSD.",
            "title_similarity": "0.13012269",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxmplo3",
            "score": 13,
            "text": "I asked my psychiatrist for a treatment with mdma/shrooms and her answer was that she never heard of it. Okay",
            "title_similarity": "0.6252135",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gxmlztb",
            "score": 15,
            "text": "Ah ok. So...another 30 years before it gets decriminalized in the US. Sound good?",
            "title_similarity": "0.5140749",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxmxr25",
            "score": 7,
            "text": "How does this compare to the negative effects of MDMA?",
            "title_similarity": "0.35903615",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gxmt2bc",
            "score": 1,
            "text": "When will this sub get renamed to [pharmakeia](https://www.blueletterbible.org/lang/lexicon/lexicon.cfm?Strongs=G5331)?",
            "title_similarity": "0.35896993",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxmq9ep",
            "score": 8,
            "text": "Honestly not surprised MDMA makes you feel incredible",
            "title_similarity": "0.03980594",
            "sentiment_compound": 0.3257
        },
        {
            "id": "gxna0re",
            "score": 5,
            "text": "Anecdotes incoming: \nI smoked roughly a pack a day from 17-21. I had a very productive shroom trip out in the desert on my 21st birthday. As I went to take a drag while I was tripping and brain immediately rejected it. Taking that drag was a visceral and disgusting feeling. It was my last cigarette and I haven't had a single craving in 10 years. The smell makes me gag a little to this day.\n\nIt was a truly bizarre feeling. I now trip once a year in the same place and I focus my thoughts on a theme that I need to work on. The great financial trip of 2018 was life changing, I'm debt free with savings now. The physical fitness trip of 2019 delivered equally astonishing results for my diet and exercise.",
            "title_similarity": "0.60336196",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gxmtj4c",
            "score": 11,
            "text": "Doesn’t work if your trauma was created by MDMA!",
            "title_similarity": "0.47093403",
            "sentiment_compound": -0.2714
        },
        {
            "id": "gxmn63n",
            "score": 54,
            "text": "Something counterintuitive about PTSD reversal is that patients are *exposed* to triggers, not protected from them in a so-called safe space. The whole point to expose oneself to bad memories without being so traumatically upset. It takes time and compassion and, of course, an empathogen like MDMA hastens the process.",
            "title_similarity": "0.44812706",
            "sentiment_compound": -0.7993
        },
        {
            "id": "gxmn515",
            "score": 4,
            "text": "Wow.  Good study read.",
            "title_similarity": "-0.031029142",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gxmy2u6",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.21257734"
        },
        {
            "id": "gxn66uy",
            "score": -3,
            "text": "cause now they molly addicts, I'm sorry if this seems out of pocket but people who suffered from trauma and addictive substances don't mix",
            "title_similarity": "0.58975387",
            "sentiment_compound": -0.8462
        },
        {
            "id": "gxmvu48",
            "score": 0,
            "text": "What happens when they are purposely put into a situation to re-traumatize them? Does the PTSD peak higher/lower or does the MDMA just give them a chemical lobotomy?",
            "title_similarity": "0.43098217",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxmxj6h",
            "score": 0,
            "text": "/Plays ATB x Topic x A7S - Your Love (9pm) (Till I Come) (Daniele DJ RE Mashup 2021)",
            "title_similarity": "0.22057477",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gxmzffd",
            "score": 0,
            "text": "2CB everyone. That's where it is at.",
            "title_similarity": "-0.016314333",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxmokb9",
            "score": -8,
            "text": "Well that was the main purpose of making them, for the beloved soldiers designed to help them in battlefield , and perhaps afterward ...of course it should work... Oh they make you so happy i want one now",
            "title_similarity": "0.07648445",
            "sentiment_compound": 0.8958
        },
        {
            "id": "gxmy7nw",
            "score": 10,
            "text": "My friends introduced me to MDMA a little over 10 years ago, after becoming acquainted with MAPS and their research. I was barely functional at the time, and no SSRI's or therapy were helping. We didn't use it in a party capacity, but specifically to discuss my trauma. It changed my life entirely. While I still have minor symptoms when I'm overwhelmed, I went from chronic suicidal ideation and dissociation to being nearly \"normal.\" I couldn't keep a job more than a few months back then, I was engaging in extremely dangerous behavior, and I couldn't function within social groups. 10 years later, I've been at the same job (and now am an owner in the company), I have stable relationships, and I am able to handle my depression and anxiety without medication. It was truly a miracle for me.",
            "title_similarity": "0.72682863",
            "sentiment_compound": -0.6694
        },
        {
            "id": "gxmmxz1",
            "score": 6,
            "text": "Oh WOW. This is really promising! Wonder what it would take for this to be a standard for treating PTSD.",
            "title_similarity": "0.2146406",
            "sentiment_compound": 0.8324
        },
        {
            "id": "gxn9roo",
            "score": 5,
            "text": "Go to r/mdmatherapy. Read the stories there. It is a magical drug that needs medicinal legalization RIGHT NOW.",
            "title_similarity": "0.36838788",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxmxvui",
            "score": 13,
            "text": "This is how it compares to a placebo+therapy control btw https://www.nature.com/articles/s41591-021-01336-3/figures/2\n\nStill great, but certainly less clickbaity, an over simplification is that the therapy did more good than the MDMA",
            "title_similarity": "0.4087547",
            "sentiment_compound": 0.8732
        },
        {
            "id": "gxmm0lb",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.15739402"
        },
        {
            "id": "gxmsalm",
            "score": 1,
            "text": "Every day i dream of one of these places getting back to me....",
            "title_similarity": "0.15789197",
            "sentiment_compound": 0.25
        },
        {
            "id": "gxmuc2a",
            "score": 1,
            "text": "As someone who suffers from c-ptsd i would love any info on how to sign up for these studies.",
            "title_similarity": "0.26237145",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gxmvdno",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.21257734"
        },
        {
            "id": "gxmx3gw",
            "score": -1,
            "text": "I feel like I’ve been hearing about this “going to the next phase” or whatever ever since my Senior year in high school. When are they *actually* going to go to the next phase? What’s the holdup? Why do we keep hearing about them going to the next phase but they never actually do?\n\nMDMA therapy news is like battery technology news at this point. :/",
            "title_similarity": "0.5532647",
            "sentiment_compound": 0.3485
        },
        {
            "id": "gxn2tg7",
            "score": 1,
            "text": "What's MDMA. I need some",
            "title_similarity": "0.19797885",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxn50hd",
            "score": 1,
            "text": "I am going to play the role of pessimist here.\n\nThese therapies will be overpriced and regulated by pharmaceutical companies and ultimately will lead to wide street usage which will ramp up the drug war towards it (MDMA overdoses in the street type scare tactics) so that the government can profit on the way in (RX industry) and on the way out (privatized prisons).\n\nSource: Someone povert who could desperately use this therapy",
            "title_similarity": "0.36438066",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gxnawc6",
            "score": 1,
            "text": "As someone with CPTSD I hope this is as promising as it sounds. Symptoms of trauma can be so traumatic in themselves. Anything that makes the healing process more effective and less drawn out is fantastic.",
            "title_similarity": "0.21808463",
            "sentiment_compound": 0.6189
        },
        {
            "id": "gxm9sr5",
            "score": 66,
            "text": "Can't wait for the long term studies.",
            "title_similarity": "0.13868473",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxmxgd5",
            "score": 23,
            "text": "Legalize drugs and watch our overdose rate drop like it did in EU",
            "title_similarity": "0.49763185",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gxn2sd3",
            "score": 15,
            "text": "This is amazing. Just think if the war on drugs never happened, how far this research would be by now.",
            "title_similarity": "0.3747887",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gxmty94",
            "score": 2,
            "text": "I haven't read the study yet but I would be ecstatic to not have to take my current meds— they make me a hungry drone all day",
            "title_similarity": "0.45641983",
            "sentiment_compound": 0.6652
        },
        {
            "id": "gxmumhq",
            "score": -2,
            "text": "Sooo I’m immune to PTSD now? Nice!",
            "title_similarity": "0.2597489",
            "sentiment_compound": 0.6476
        },
        {
            "id": "gxmuqww",
            "score": 2,
            "text": "Anyone know what they do about comedowns? Mdma is great but I've always found the comedown brutal without at least a joint. Or are the doses low enough that the comedowns don't really hit?",
            "title_similarity": "0.5299758",
            "sentiment_compound": -0.9024
        },
        {
            "id": "gxmwlfb",
            "score": 2,
            "text": "The potential is amazing!",
            "title_similarity": "-0.13897076",
            "sentiment_compound": 0.6239
        },
        {
            "id": "gxn2rps",
            "score": 2,
            "text": "Please give me the drugs",
            "title_similarity": "0.14739466",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gxn2ub1",
            "score": 2,
            "text": "\"nature medicine\" touting a designer drug.\n\nPerfect.",
            "title_similarity": "0.17813163",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gxmpdpj",
            "score": 11,
            "text": "How much is a therapeutic dose of MDMA?",
            "title_similarity": "0.43023005",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxmh4jy",
            "score": 249,
            "text": "[removed]",
            "title_similarity": "0.15739402"
        },
        {
            "id": "gxmrt5q",
            "score": 3,
            "text": "They no longer qualify for the diagnosis, or they don't have PTSD anymore?",
            "title_similarity": "0.61037636",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxmtxq7",
            "score": 3,
            "text": "Makes you wonder what you are carrying around with you that could get cured but doesn't qualify you for an official diagnosis but you still just manage to live with it. I want to be cured too.",
            "title_similarity": "0.4419837",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gxmwiwu",
            "score": 3,
            "text": "I've had life-changing experiences with both Psylocibin and LSD. Both have helped me reevaluate my life at various intervals and hone in on the things that matter the most to me. I only take them once every several years and each time feels like a landmark. \n\nAll the research I've seen seems to confirm my experiences and the anecdotal evidence is super strong (as much as anecdotal evidence can be). I recently invested in MindMed (MNMD). They are doing a lot of interesting work in this field and I really hope that they can help push this kind of research to the forefront of the public psyche. \n\nI know that probably sounds like a plug for the stock, but I think getting companies that are doing the research and lobbying governments to reduce the barriers to entry is essential to getting this kind of medicine to the people that need it.",
            "title_similarity": "0.47013044",
            "sentiment_compound": 0.864
        },
        {
            "id": "gxn3c9z",
            "score": 3,
            "text": "How do I get into a trial like this??",
            "title_similarity": "0.24065402",
            "sentiment_compound": 0.4329
        },
        {
            "id": "gxmv4qz",
            "score": 3,
            "text": "No longer qualify for PTSD diagnosis and therefore no more MDMA :(",
            "title_similarity": "0.57922566",
            "sentiment_compound": -0.7635
        },
        {
            "id": "gxn05dy",
            "score": 5,
            "text": "I wonder if they account for the afterglow that can last up to 2-3 weeks. My afterglow lasted about a month before I gradually became depressed again, but maybe it works for some, in all fairness im happy for them!",
            "title_similarity": "0.62278485",
            "sentiment_compound": 0.636
        },
        {
            "id": "gxmrku8",
            "score": 91,
            "text": "Was listening to a podcast the other day. Someone was explaining a debate where one person said \"don't you feel bad for using cocaine? It supports gangs\" he replied \"no, the prohibition of cocaine supports gangs\" .\n\nThe war on drugs is a crime against humanity. So many lives have been destroyed or lost due to mental disorders/addiction. So many brilliant minds are chained by these things, someone probably has the cure for cancer but can't get it out because they're too occupied battling it out \n\nI believe this can catapult us into an entirely new epoch in time. Can't wait :)",
            "title_similarity": "0.52322114",
            "sentiment_compound": -0.7879
        },
        {
            "id": "gxmwg1s",
            "score": 5,
            "text": "I can't wait to try this someday. I've been consistently diagnosed with complex PTSD over the past 15 years, and I would love a world in which I could ever, ever feel safe. I've had no success with any form of therapy tried to date.",
            "title_similarity": "0.6565019",
            "sentiment_compound": 0.6251
        },
        {
            "id": "gxmxiau",
            "score": 7,
            "text": "The potential of MDMA, THC and such is enormous. Hope to see more research on these.",
            "title_similarity": "0.120007925",
            "sentiment_compound": 0.4927
        },
        {
            "id": "gxmy2ko",
            "score": 6,
            "text": "How does this work out? I tried MDMA once, and it left me crying, and depressed beyond anything I've ever felt after.",
            "title_similarity": "0.64942443",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gxn6y6j",
            "score": -6,
            "text": "Very bad. We don't know what MDMA (or any substances) does to the brain. Awesome that it brought relief to the patients but their can possibly be some side effects from this.",
            "title_similarity": "0.5105101",
            "sentiment_compound": 0.2967
        },
        {
            "id": "gxnhsqm",
            "score": -6,
            "text": "Isn't this just replacing one illness with another?",
            "title_similarity": "0.31525317",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gxmtj7f",
            "score": 13,
            "text": "MAPS is such an awesome organization. Keep doing what you’re doing!",
            "title_similarity": "-0.030836437",
            "sentiment_compound": 0.6588
        },
        {
            "id": "gxmohj8",
            "score": 50,
            "text": "[removed]",
            "title_similarity": "0.15739402"
        },
        {
            "id": "gxm8izr",
            "score": 317,
            "text": "That is insane! Just three sessions and they are on their way to living normal lives! Amazing.",
            "title_similarity": "0.43883204",
            "sentiment_compound": 0.3987
        },
        {
            "id": "gxmv9ho",
            "score": 21,
            "text": "I wrote an aims page on this topic. The enantiomer R-MDMA shows little to no negative side-effects such as hyperthemia. Whereas S-MDMA has many negative side-effects. With the numerous positive benefits associated with guided MDMA therapy, it’s insane that R-MDMA isn’t completely decriminalized. \n\nMaybe I don’t know enough about enantiomers though. Not my research, just aims for a class I took.",
            "title_similarity": "0.47470385",
            "sentiment_compound": 0.3085
        },
        {
            "id": "gxmr4mb",
            "score": 66,
            "text": "MDMA has so much potential to help people. It’s frustrating how it’s been treated exclusively as a street drug but it’s great to see progress being made.",
            "title_similarity": "0.21384802",
            "sentiment_compound": 0.882
        },
        {
            "id": "gxmlh0u",
            "score": 260,
            "text": "[removed]",
            "title_similarity": "0.15739402"
        },
        {
            "id": "gxmoc3d",
            "score": 821,
            "text": "As someone who’s struggled with ptsd and depression for over 20 years, THIS IS VERY EXCITING. I’m currently receiving monthly infusions at a ketamine clinic with some success but this is great news",
            "title_similarity": "0.60137856",
            "sentiment_compound": 0.8372
        },
        {
            "id": "gxmgt8t",
            "score": 306,
            "text": "Damm wish I saw this earlier I just recently finished a paper on therapeutic psychedelics",
            "title_similarity": "0.50807",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxnady3",
            "score": 271,
            "text": "Me and my wife, hypothetically, had her do a psilocybin treatment at home in a last ditch effort to treat her severe mental health issues. We had taken all other available options like medicine and therapy. They worked to a small degree but couldn't save her from ptsd induced episodes of fear/rage. \n\nWe, hypothetically, went into it with a focus on a clinical setting, even going as far as using the same playlist the universities use in their trials. That single, hypothetical, dose has (so far) completely rid her of her PTSD induced episodes. Going from 2 to 4 per week to 0, 5 months along.\n\nWe aren't users of any substances except the occasional beer. Seeing what psychoactive compounds can do for the improvement of mental health first hand was borderline miraculous. I hope we continue to push the stigmas away and look further into what they can do to help those who suffer.\n\nEdit: it's called the John's hospskins psilocybin research playlist. However, I would recommend calm meditation music instead. We switched over. The other playlist had some haunting chanting that induced a fear reaction.",
            "title_similarity": "0.63008964",
            "sentiment_compound": 0.8205
        },
        {
            "id": "gxmkqnr",
            "score": 1663,
            "text": "This is huge.  PTSD can be really treatment resistant, and a 67% improvement (30% over therapy alone) is a very significant result for Psychiatry. It is a fairly small study, but hopefully it can pave the way for de-scheduling MDMA and getting it approved for usage.",
            "title_similarity": "0.563095",
            "sentiment_compound": 0.8734
        },
        {
            "id": "gxmcgp2",
            "score": 5699,
            "text": "Beautiful work and incredibly promising results. This could help so many suffering people.",
            "title_similarity": "0.105685085",
            "sentiment_compound": 0.7363
        },
        {
            "id": "gxmsp0h",
            "score": 168,
            "text": "This is awesome! The only thing on don't understand is how you provide a placebo for MDMA?",
            "title_similarity": "0.33708218",
            "sentiment_compound": 0.6588
        },
        {
            "id": "gxmwmu9",
            "score": 9,
            "text": "If only I could ever get access to even afford therapy in the first place.",
            "title_similarity": "0.39141378",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxmxrjw",
            "score": 2,
            "text": "I'm so hopeful for this treatment. I'm really hoping to be eligible for it, so I could go back to living my life.",
            "title_similarity": "0.1192002",
            "sentiment_compound": 0.7708
        },
        {
            "id": "gxmy6un",
            "score": 5,
            "text": "Any fellow veterans had any luck getting any help like this from the VA?",
            "title_similarity": "0.42815912",
            "sentiment_compound": 0.802
        },
        {
            "id": "gxmy9qe",
            "score": 2,
            "text": ">After psychiatric medication washout, participants (n = 90) were randomized 1:1 to receive manualized therapy with MDMA or with placebo, combined with three preparatory and nine integrative therapy sessions.\n\nI think they're gonna figure out if they got placebo or MDMA at some point",
            "title_similarity": "0.61508226",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxmyc7h",
            "score": 2,
            "text": "I really hope the paradigm shifts of the overall public perception of these drug therapies. I think there is a myriad of potentials",
            "title_similarity": "0.20335343",
            "sentiment_compound": 0.4927
        },
        {
            "id": "gxmyjcj",
            "score": 1,
            "text": "What do you suppose the placebo effect was?  I’m being a little silly, but honestly… wouldn’t you know if you were given MDMA?",
            "title_similarity": "0.40201035",
            "sentiment_compound": -0.1171
        },
        {
            "id": "gxmzey6",
            "score": 1,
            "text": "Important to note sample size is only 90, so 60 of the 90 responded positively. Not to diminish the results at all, as this is still a pretty significant size. So I hope this leads to larger studies and tweaks in the treatment to get a higher response.",
            "title_similarity": "0.31312072",
            "sentiment_compound": 0.9077
        },
        {
            "id": "gxmzg27",
            "score": 1,
            "text": "Hypothetically, if someone wanted to treat themselves with MDMA. How would they do so, besides buying it?",
            "title_similarity": "0.3339479",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxmzhqn",
            "score": 3,
            "text": "The use of pure MDMA is always yielding promising results along with a few other psychedelics but I'd like to note that doesn't mean the stuff you get on the street will have the desired effect. In 2006, I made the mistake of taking an ecstasy pill that threw my mind and body out of whack, causing me to feel no motivation or interest, in turn landing me in a hospital where there was no desire to explain my reasons for being there. The docs eventually diagnosed and treated actions, or lack thereof. The things they prescribed caused erratic behavior, racing thoughts, missing thoughts and I eventually found myself in a series of homes for recovering from something the doctors couldn't actually treat.\n\nCut to now and I'm still recovering from the legal ramifications of misdiagnosis leading approved overdoses on psychotropic medications. I'm now off everything but a migraine and seizure pill they're afraid to remove because there's no record of why it was prescribed and there's fear I may have a seizure. The most unfortunate thing is how little sway my own words and recollections hold after such a long and poorly storied institutional record.\n\nI don't have a conclusion to state but I wanted to throw out my experience since I'm still recovering my mind and body through the process of old hobbies and interests.",
            "title_similarity": "0.6006857",
            "sentiment_compound": -0.8647
        },
        {
            "id": "gxmzhru",
            "score": 1,
            "text": "What are some companies working to these psychoactive substance for medicinal use that are worth researching for stock investments?",
            "title_similarity": "0.33950007",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gxn08fr",
            "score": 1,
            "text": "Hi everyone! I am really interested in starting something like this but I’m not sure where to turn. I feel like getting this type of treatment would be the final hurdle to get my life in order and be successful. Any help is very much appreciated.",
            "title_similarity": "0.18663147",
            "sentiment_compound": 0.961
        },
        {
            "id": "gxn0j40",
            "score": 2,
            "text": "But remember that lots of people think it's still a \"hard\" drug",
            "title_similarity": "0.394315",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gxn0mv1",
            "score": 2,
            "text": "How do I participate in one of these?",
            "title_similarity": "0.030347507",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxn0nyo",
            "score": 1,
            "text": "MDMA taught me, bipolar introvert beta, how to socialise. Thanks MDMA",
            "title_similarity": "0.30966988",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxn0p3r",
            "score": 1,
            "text": "I recently got a PTSD diagnosis after years of persistent depression and you have no idea how much this fills me with hope. I'm currently starting EMDR therapy and still have high hopes it'll help. But if it doesn't, at least now I have a new lead. If the effects come without any of the irritating side effects of prescription antidepressants, this will be a game changer for people like me. What took so long?",
            "title_similarity": "0.5312838",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxn1hhk",
            "score": 1,
            "text": "It's why I tell people , I don't do drugs - It's preventative maintenance.",
            "title_similarity": "0.31790933",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxn1je6",
            "score": 1,
            "text": "I’ve done LSD, ketamine, and mdma illicitly but that just means I’m some stupid druggo to most",
            "title_similarity": "0.49486753",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gxn2my3",
            "score": 1,
            "text": "I'm very interested in study results for MDMA and ketamine together for PTSD",
            "title_similarity": "0.3030352",
            "sentiment_compound": 0.4576
        },
        {
            "id": "gxn2n2w",
            "score": 2,
            "text": "Finally legitimate research being done",
            "title_similarity": "0.060236488",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxn2ry7",
            "score": 2,
            "text": "I am extremely anti drug. But if this can help people it could be a wonderful thing. Even the f it helps half of the people it will still be amazing.",
            "title_similarity": "0.38773254",
            "sentiment_compound": 0.9545
        },
        {
            "id": "gxn31cn",
            "score": 1,
            "text": "Sign me up!  I’m basically left with ECT after I developed an allergy to a component of my ketamine infusions.  And it’s damn near impossible for me to find or make an appt to get approved to be interviewed to get ECT.",
            "title_similarity": "0.687734",
            "sentiment_compound": 0.1007
        },
        {
            "id": "gxn3a5h",
            "score": 1,
            "text": "I don't understand how anyone could be against this. It's a controlled environment with evidence it works. It's not getting it from some random guy on the street and taking it at home.",
            "title_similarity": "0.28757584",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxn3ipt",
            "score": 2,
            "text": "Does anybody know how one signs up for these kind of treatments? My father has been dealing with severe PTSD for so so long :/",
            "title_similarity": "0.6157925",
            "sentiment_compound": -0.6749
        },
        {
            "id": "gxn3irt",
            "score": 1,
            "text": "The implications that they helped someone is great, but the reality is probably that a good chunk of that percentage are people the system gave up on or forgot and the easiest way to do so was to say they no longer required therapy.",
            "title_similarity": "0.4154536",
            "sentiment_compound": 0.8074
        },
        {
            "id": "gxn3pl1",
            "score": 1,
            "text": "just put on some edm pop some molly and dance away ptsd",
            "title_similarity": "0.27481458",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxn3vez",
            "score": 1,
            "text": "The company completing this research is called numinus wellness, great stock",
            "title_similarity": "0.20961769",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gxn40sr",
            "score": 1,
            "text": "Wow, I’ve been medicating my PTSD this whole time!",
            "title_similarity": "0.40137327",
            "sentiment_compound": 0.6239
        },
        {
            "id": "gxn48au",
            "score": 1,
            "text": "I used to take magic mushrooms every 6 to 9 months and it curbed my depression almost instantaneously. Now that I have a professional license to maintain I'm truly f***** and now I'm on a medication that kills my sex drive. I've got to love the laws in this country.",
            "title_similarity": "0.5336211",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gxn48lh",
            "score": 1,
            "text": "LSD first saved my life, and then unlocked the emotion part of my brain. My life is so much more fulfilling since.",
            "title_similarity": "0.30204225",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxn4kla",
            "score": 1,
            "text": "Anyone know what the doses used were and frequency of use? I see it was over 18 weeks so I’m guessing every 6 weeks, is is sooner than the 3-4 month guideline from Shulgin.",
            "title_similarity": "0.5430334",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxn4nnx",
            "score": 1,
            "text": "My stepdad had a couple ketamine treatments for PTSD and they worked really well too",
            "title_similarity": "0.40943784",
            "sentiment_compound": 0.3384
        },
        {
            "id": "gxn4xkm",
            "score": 1,
            "text": "I want the screamed from the rooftops!!!!!",
            "title_similarity": "0.02182083",
            "sentiment_compound": -0.4885
        },
        {
            "id": "gxn53ig",
            "score": 1,
            "text": "Sounds promising but how long before it is availability to the masses by prescription. The bureaucracy red tape and the pharmaceutical lobby will hold this up for decades.  It’s shame  people who need help and who would respond well to mushrooms will not be granted access",
            "title_similarity": "0.6316693",
            "sentiment_compound": 0.2359
        },
        {
            "id": "gxn56bf",
            "score": 1,
            "text": "Thank you, MAPS! I look forward to the conference on Wednesday :)",
            "title_similarity": "0.20293449",
            "sentiment_compound": 0.6996
        },
        {
            "id": "gxn5dm4",
            "score": 1,
            "text": "I've done it in a non-clinical but all.in all professional setting, as has my gf. It truly is a marvellous medicine. An antibiotics of the psyche. It's not a magical pill though, but a gateway to insight and to profoundly feel and let go of trapped emotions from the past.",
            "title_similarity": "0.40670377",
            "sentiment_compound": -0.1901
        },
        {
            "id": "gxn5hou",
            "score": 1,
            "text": "Definetely needs a followup, but it really gives a lot of hope at the moment",
            "title_similarity": "0.03972427",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gxn5kzo",
            "score": 1,
            "text": "I wonder how well this works for people whose trauma happened at such an early age that it affected their brain development. I’ve never known who I could have been without my trauma because it happened so early.",
            "title_similarity": "0.38275397",
            "sentiment_compound": 0.0083
        },
        {
            "id": "gxn5shd",
            "score": 1,
            "text": "I know this is the future. I live in AZ and have no access to psychedelic's, but I used WIM HOF and meditation to achieve altered states. These states helped me cope with my PTSD and depression. The PTSD is still challenging, but it does not dominate my existence anymore.",
            "title_similarity": "0.5377879",
            "sentiment_compound": -0.6364
        },
        {
            "id": "gxn5z2f",
            "score": 1,
            "text": "I had PTSD for a traumatizing event. I did MDMA once at a festival and the medicine explained why the traumatizing event happened to me and how to move forward. There’s no way I could have been healed without it. This is amazing news!",
            "title_similarity": "0.54052913",
            "sentiment_compound": -0.2714
        },
        {
            "id": "gxn63w9",
            "score": 1,
            "text": "I have severe complex ptsd & a dissociative disorder. Along with panic disorder, major depression blahblabblah. I used to take \"molly\" in college. It was like a turning point in my life after those 2 years of experimenting with it. So many therapists, professors ask me why I haven't killed myself. I truly believe it has helped me in the long run.",
            "title_similarity": "0.6093573",
            "sentiment_compound": -0.7433
        },
        {
            "id": "gxn69e6",
            "score": 1,
            "text": "MDMA is the past and the future. Extremely safe and helpful if used responsibly. Love it",
            "title_similarity": "0.03315009",
            "sentiment_compound": 0.8874
        },
        {
            "id": "gxn6g8u",
            "score": 1,
            "text": "Amazing that 3 covid vaccines have been developed and approved by the FDA before MDMA and Psilocybin.",
            "title_similarity": "0.6037905",
            "sentiment_compound": 0.765
        },
        {
            "id": "gxn6jgl",
            "score": 1,
            "text": "I guess… but they probably had a new diagnosis; delusional psychosis.",
            "title_similarity": "0.36195326",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxn6w9g",
            "score": 1,
            "text": "I hate to say it, but drugs being illegal was the last thing protecting them from being main stream. I'm genuinely curious to see how the mighty ruin-most-things hammer of popularity will fare against substances that help create divergent thinking",
            "title_similarity": "0.37958938",
            "sentiment_compound": 0.7227
        },
        {
            "id": "gxn76vg",
            "score": 1,
            "text": "Wow.   Sounds therapeutic.  Any comparison to psilocybin therapies?",
            "title_similarity": "0.17960675",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gxn77gd",
            "score": 1,
            "text": "What’s the difference between Ketamine, MDMA and lsd therapy",
            "title_similarity": "0.48062384",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxn7bpf",
            "score": 1,
            "text": "I'm pretty sure this is what MDMA was originally intended for. The research that's happening now is a continuation of research that started 35 years ago but was rudely interrupted.",
            "title_similarity": "0.51777554",
            "sentiment_compound": -0.6542
        },
        {
            "id": "gxn7q1d",
            "score": 1,
            "text": "The future of drugs and medicine is looking crazy.",
            "title_similarity": "0.37170774",
            "sentiment_compound": -0.34
        },
        {
            "id": "gxn7rdq",
            "score": 1,
            "text": "The military just saw dollar signs.",
            "title_similarity": "0.37425077",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxn7xrn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.15739402"
        },
        {
            "id": "gxn7yaa",
            "score": 1,
            "text": "I have a question. I have only used MDMA recreationally and my experience is that sometimes you get the \"dip\", which is a feeling of depression due to depleting your serotonin because of the MDMA itself. Is that not a factor? Could patients not get the dip from taking the MDMA?",
            "title_similarity": "0.67357874",
            "sentiment_compound": -0.5514
        },
        {
            "id": "gxn85tx",
            "score": 1,
            "text": "I’ll tell you what, from personal experience. I did MDMA 5 times. It was addicting, it had horrible withdrawals and it only increased my PTSD. It makes you flash back to things.\n\nEveryone is different, this is my personal experience. I’ll never touch it again.",
            "title_similarity": "0.6640351",
            "sentiment_compound": -0.34
        },
        {
            "id": "gxn8ci1",
            "score": 1,
            "text": "60% of the time it works, every time",
            "title_similarity": "0.3606122",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxn8d7p",
            "score": 1,
            "text": "I started using a strain of marijuana to help me process trauma. It has helped me tremendously.",
            "title_similarity": "0.23822853",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gxn8gau",
            "score": 2,
            "text": "To help support this science, you can designate OP (MAPS) as your charity of choice on smile.amazon (if you use amazon)",
            "title_similarity": "0.19739348",
            "sentiment_compound": 0.836
        },
        {
            "id": "gxn8im3",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.21257734"
        },
        {
            "id": "gxn92j9",
            "score": 1,
            "text": "I want to try this so badly but it costs 2000$ for two sessions in Canada at field trip. And I don't know if my ODSP would cover this as it's unconventional therapy and pretty new.",
            "title_similarity": "0.5549145",
            "sentiment_compound": 0.4505
        },
        {
            "id": "gxn9inb",
            "score": 1,
            "text": "I find so much promise in this area of medicine, I'm not sure why Mind Med (the first public company to work on psychedelics) didn't get a better response from their IPO launch.",
            "title_similarity": "0.46963972",
            "sentiment_compound": -0.1998
        },
        {
            "id": "gxn9l39",
            "score": 1,
            "text": "I have so much faith in this stuff because I've been a user for years and it has literally changed my life. Im now a firm and long term investor of MindMed, I truly believe this stuff is the future",
            "title_similarity": "0.29329687",
            "sentiment_compound": 0.7165
        },
        {
            "id": "gxn9m6j",
            "score": 1,
            "text": "I want to participate in this study!!! How do I go about signing up?",
            "title_similarity": "0.12646857",
            "sentiment_compound": 0.2905
        },
        {
            "id": "gxna365",
            "score": 1,
            "text": "Is there evidence that a few extremely positive experiences can have a positive impact on the brain the same way negative ones do- thus negating the PTSD?  \n\nOr does the MDMA help them deeply explore the emotions surrounding the trauma?",
            "title_similarity": "0.28345358",
            "sentiment_compound": 0.6191
        },
        {
            "id": "gxnb10l",
            "score": 1,
            "text": "I had a friend who served in Iraq, he watched his friends die and it really messed him up.\n\nAfter a few years he started doing MDMA therapy and it really opened him up to talk about his problems.\n\nThe benefit of MDMA isn't that it helps you get **OVER** your PTSD, but that it helps you **TALK** about your PTSD and overcome any walls you created to block out those memories.\n\nMDMA works best when the person also has a therapist who they can open up to and discuss their problems with freely.",
            "title_similarity": "0.54280657",
            "sentiment_compound": 0.7623
        },
        {
            "id": "gxnb5tg",
            "score": 1,
            "text": "Diagnosed PTSD patient, here. I find this both exciting and terrifying. I’d be incredibly nervous to access this therapy personally, but it’s great to know that there are effective treatments available.",
            "title_similarity": "0.31164077",
            "sentiment_compound": 0.8706
        },
        {
            "id": "gxnb75r",
            "score": 1,
            "text": "So is there an incentive to oppose MDMA treatment on the basis that it could reduce your SCD rating...?",
            "title_similarity": "0.3883784",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxnbcie",
            "score": 2,
            "text": "This is why I went to over 300 Grateful Dead concerts.",
            "title_similarity": "0.48150668",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gxnbujh",
            "score": 1,
            "text": "So exciting to see so many people (somewhat) publicly speaking out in support of this research and against the ridiculous War on Drugs. Very exciting time to be alive for psychedelic medicine",
            "title_similarity": "0.2570442",
            "sentiment_compound": 0.7083
        },
        {
            "id": "gxnbved",
            "score": 1,
            "text": "It's also important to point out that MAPS partnered with Numius Wellness to carry out this study. NUMI is definitely leading the way in psychedelic therapies and with their MAPS partnership will probably be the first to legally practice these therapies!",
            "title_similarity": "0.28498885",
            "sentiment_compound": 0.7959
        },
        {
            "id": "gxnbvpb",
            "score": 1,
            "text": "Having family diagnosed with PTSD with virtually no real basis behind it, makes me skeptical about whether many of these participants actually suffered from it to begin with. All anyone needs these days is a sob story and symptoms that could be applied to anyone at some point in their life. But if it is a valid correlation that’s some positive hope for those that really have suffered from it.",
            "title_similarity": "0.5930829",
            "sentiment_compound": 0.0471
        },
        {
            "id": "gxnc0ss",
            "score": 1,
            "text": "What dosage were they taking?",
            "title_similarity": "0.22747841",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnc3ql",
            "score": 1,
            "text": "ELI5 on why this works?",
            "title_similarity": "0.043908015",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnccv6",
            "score": 1,
            "text": "too bad insurance companies will probably never cover this kind of treatment",
            "title_similarity": "0.49170166",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gxnchn9",
            "score": 1,
            "text": "I can’t seem to find molly molly molly",
            "title_similarity": "0.33269104",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxncihy",
            "score": 1,
            "text": "I used to have pretty bad ptsd and depression when I was younger. I stumbled onto mdma recreationally and can absolutely say it made a tremendous impact on my life for the better. The first time I had it was 2009 and I haven't had any bouts of depression, etc. caused from my ptsd ever since. None. I've also used psychedelics in what would be considered therapeutic ways. We absolutely need to be researching these and removing all the bad stigma from them. There is so much that can be gained from these and they are no doubt better for the brain than years of pharma SSRI, etc. medications. I really hope that one day these are marketed for mental health and seen as healing tools and not just 'drugs people take to get fucked up'.  Some people are just stupid and will find a way to abuse any kind of product to get high, and sadly the people who actually need it the most get punished.",
            "title_similarity": "0.5804297",
            "sentiment_compound": -0.9715
        },
        {
            "id": "gxncuhz",
            "score": 1,
            "text": "Was this study intent-to-treat or per protocol?",
            "title_similarity": "0.106308974",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnd1p9",
            "score": 1,
            "text": "I’ve done MDMA about three times in my life while I was in college. I have a long term hx of anxiety/depression/mood disorder. \n\nThe amount of self-understanding, gratitude, and self-acceptance I felt each time I did MDMA is almost indescribable.",
            "title_similarity": "0.6541029",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gxnd3nn",
            "score": 1,
            "text": "Yeah, Everytime I roll I feel great for about 2 months like all my problems are small in the grand scheme of things.. I also think it’s great to roll with a bf/gf/ wife or husband or whatever, atleast 2 times a year to just.. idk it’s like hitting a reset button on love and life I guess ?",
            "title_similarity": "0.4738623",
            "sentiment_compound": 0.9612
        },
        {
            "id": "gxnd5si",
            "score": 1,
            "text": "Can someone ELI5 how tripping balls helps with PTSD? Glad to hear the results are promising but don't understand it",
            "title_similarity": "0.34398243",
            "sentiment_compound": 0.5647
        },
        {
            "id": "gxnd7fv",
            "score": 1,
            "text": "Psychedelics are the future of medicine.",
            "title_similarity": "0.24729191",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnd99m",
            "score": 1,
            "text": "But how did they feel on Wednesday?",
            "title_similarity": "0.31695563",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxndcee",
            "score": 1,
            "text": "As somebody who has had his fair share of mdma im not surprised by this just shocked it hasn't been figured out sooner.",
            "title_similarity": "0.36571693",
            "sentiment_compound": 0.1366
        },
        {
            "id": "gxne1ge",
            "score": 2,
            "text": "Too late for me. I hope future generations embrace psychedelics and defeat depression. I'd love to be one of the last victims.",
            "title_similarity": "0.35140198",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gxne22u",
            "score": 1,
            "text": "Above & Beyond has been doing this for years",
            "title_similarity": "0.17051421",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxne8vi",
            "score": 1,
            "text": "This low-key reminds me of Maniac on Netflix",
            "title_similarity": "0.2176098",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gxne97j",
            "score": 1,
            "text": "It goes against the reddit zeitgeist, but while awesome and promising it's alarming they don't describe the sessions. Were these unique treatments developed for the current study? Was this CPT? EMDR? Prolonged exposure? ACT?\n\nI was once working to develop a study looking at the effects of ketamine on mental health. The organization I was partnering with wanted us to publish the outcome data they had. Turns out that they never just gave ketamine. It was always ketamine + proprietary additives. If you don't know what else is being given with the thing that's being studied, the effects are cool and promising, but not telling.",
            "title_similarity": "0.54657036",
            "sentiment_compound": 0.951
        },
        {
            "id": "gxnelc7",
            "score": 1,
            "text": "Thank you for sharing this!",
            "title_similarity": "-0.101506345",
            "sentiment_compound": 0.68
        },
        {
            "id": "gxnf6it",
            "score": 1,
            "text": "90 people in the study with 67% result means we can only conclude this is a subject worthy of more in-depth study.",
            "title_similarity": "0.46564287",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxnf9ig",
            "score": 1,
            "text": "I dont know.2 months after they were no longer diagnosed with ptsd? As someone who has had a lot of therapy and EMDR I don't think their is a Ptsd cure. \n\nIt is evs and flows. The wind can blow the wrong way and I am back in a warzone. There may be less instances but there are still flashbacks. I don't think you can ever dull those memories significantly. I am just a vet though.",
            "title_similarity": "0.7018156",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gxnfgo4",
            "score": 1,
            "text": "In time: the scaremongering study that claimed MDMA “dries” the brain? Retracted.\n\nhttps://www.wired.com/2003/09/ecstasy-study-botched-retracted/",
            "title_similarity": "0.54313433",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnfioh",
            "score": 1,
            "text": "We need to get this medicine to the people.",
            "title_similarity": "0.26922315",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnfl3y",
            "score": 1,
            "text": "r/shroomstocks to make money off of this",
            "title_similarity": "0.061905835",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnfqtv",
            "score": 1,
            "text": "Who knew that scientific research could save us all money?",
            "title_similarity": "0.356037",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gxnftlc",
            "score": 1,
            "text": "I had PTSD following a series of traumatic events in high school. A mixture of therapies and medications were prescribed, the most prominent of which was CBT and anti-anxiety medication. Three years later and with my condition (which had ballooned into anorexia by that point) worsening, I started dating a guy who convinced me to trip acid with him and his roommates. I had never done any drugs before, but that night we did both acid and Molly. I think of my life in before this event, and after this event because that was the day my whole life completely changed, and I credit MDMA with saving my life.",
            "title_similarity": "0.67820895",
            "sentiment_compound": 0.4012
        },
        {
            "id": "gxnfvbc",
            "score": 1,
            "text": "Rick Doblin has been doing some truly amazing work to get it this far.",
            "title_similarity": "0.14537564",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gxng2mu",
            "score": 1,
            "text": "No longer qualified for the diagnosis and recovery are different things",
            "title_similarity": "0.4450143",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxng70r",
            "score": 1,
            "text": "I’ve heard some pod casts about mushrooms in a clinical setting. How do I go about doing this?",
            "title_similarity": "0.44074494",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxng7jy",
            "score": 1,
            "text": "Mdma is wwwooooonnndddeeeerrrrful.  It lightened my mood for months after.  And it wasn't pure (most likely)",
            "title_similarity": "0.29606622",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxngvs9",
            "score": 1,
            "text": "There is also a treatment which consists of poking you in the eye until you say you're cured.",
            "title_similarity": "0.3944947",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxngymg",
            "score": 1,
            "text": "I wish my gf had 't said she'd probably dump me if i used these..someday i probably will as i suspect it would help alot..but yeah for now gotta wait i guess",
            "title_similarity": "0.3290884",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxngyyq",
            "score": 1,
            "text": "Brave New World predicted.",
            "title_similarity": "-0.0054361597",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gxnh5w0",
            "score": 1,
            "text": "Wasn't there a study that aims to answer this, I have been fighting for assisted death in Australia for a long time when you’re the only one who doesn’t even grown to hate the testing yet",
            "title_similarity": "0.51052773",
            "sentiment_compound": -0.8779
        },
        {
            "id": "gxnho32",
            "score": 1,
            "text": "Y'all they don't want us to be better. There's no money in happy healthy people.",
            "title_similarity": "0.4154576",
            "sentiment_compound": 0.7832
        },
        {
            "id": "gxnhz89",
            "score": 1,
            "text": "Time to buy more MNMD",
            "title_similarity": "0.09917784",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxni1in",
            "score": 1,
            "text": "Is 131 total participants considered a good study?",
            "title_similarity": "0.35969824",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxni25x",
            "score": 1,
            "text": "Read the article big words in there",
            "title_similarity": "0.09803816",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnigr7",
            "score": 1,
            "text": "Um yeah. Ketamine infusions for depression, ptsd, pain etc... are life savers. I can speak from experience.",
            "title_similarity": "0.40316862",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gxnivcz",
            "score": 1,
            "text": "I wonder how long before this treatment is mandated by the VA for veterans receiving disability benefits for PTSD. Not out of care for the vets, but as a means of cutting cost paid to disabled veterans. \n\nThe VA is always looking for ways to cut VA benefits from recipients. You get your benefits and then spend the rest of your life fighting to keep them.",
            "title_similarity": "0.56208915",
            "sentiment_compound": 0.0351
        },
        {
            "id": "gxnjksf",
            "score": 1,
            "text": "My psychiatrist also does ketamine infusions for PTSD treatment out of his office and he was talking about how MDMA and ketamine are becoming the next big thing in mental health treatment. This is so cool. \n\nHe described ketamine treatment as being incredibly empowering for the patient. They were able to see their trauma as a much smaller part of them and process it quickly while under. It was even better for soldiers and people with PTSD they previously couldn’t talk about because they could talk through it while they were under. He had one patient who was chronically suicidal for years try it after he got approval to administer and she was able to stop seeing him completely within a few weeks. \n\nI’m FASCINATED to see more research be done on this.",
            "title_similarity": "0.5344815",
            "sentiment_compound": 0.5146
        },
        {
            "id": "gxnjuhr",
            "score": 1,
            "text": "My life has improved drastically since I’ve discovered psychedelics. I really hope these studies actually make this kind of help more accessible for people.",
            "title_similarity": "0.29646817",
            "sentiment_compound": 0.8271
        },
        {
            "id": "gxnk4c3",
            "score": 1,
            "text": "How does one get this kind of treatment in Germany?  Anyone know?",
            "title_similarity": "0.33759907",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnk77s",
            "score": 1,
            "text": "It'll be approved by the fda in a couple decades at a cost no one will be able o afford (except LeBron and Musk.)",
            "title_similarity": "0.61259985",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gxnktpq",
            "score": 1,
            "text": "Guess those tribal shamans were on to something",
            "title_similarity": "0.16230601",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnlgmr",
            "score": 1,
            "text": "Surprised an lsd, weed, mdma trifecta cocktail doesn't cure cancer",
            "title_similarity": "0.59602875",
            "sentiment_compound": 0.6615
        },
        {
            "id": "gxnllvu",
            "score": 1,
            "text": "> However, an estimated 40–60% of patients do not respond to these compounds\n\nWhat a world.  Prescribing something that doesn't work at all at least half the time as the front line treatment.  Is there any other field that this doesn't seem completely ridiculous in?\n\nI hope we get some real research done finally on daily use MDMA, it can change a lot of lives.",
            "title_similarity": "0.68981194",
            "sentiment_compound": 0.6401
        },
        {
            "id": "gxnlmc2",
            "score": 1,
            "text": "They have this play here in Atlanta that is starting to do Ketamine microdosing and therapy. I've been thinking about it. 'Spensive though.",
            "title_similarity": "0.40484875",
            "sentiment_compound": 0.4118
        },
        {
            "id": "gxnltgi",
            "score": 1,
            "text": "I love seeing articles like this as I just finished another round of ketamine treatment. Psychadelics seem to be a promising new frontier for psychopharmacology.",
            "title_similarity": "0.3245987",
            "sentiment_compound": 0.8555
        },
        {
            "id": "gxnmc0j",
            "score": 3,
            "text": "the one great thing i took away from any of my drug use was that the sudden happy shift in my attitude from the drug use indicated that a mood is capable of shifting suddenly and i can therefore do it sober too if i put effort into teaching myself how to make myself happy.\n\nlike suddenly i realized that my bad attitude wasn’t an immovable object after all.",
            "title_similarity": "0.2738174",
            "sentiment_compound": 0.9201
        },
        {
            "id": "gxnmc93",
            "score": 1,
            "text": "Mini on-the-train ramble: What I find most interesting is the ability of psychedelics to approach the “problem” (whether it’s ptsd, anxiety, or more generally seeking solutions to life’s stressors) from the “inside” as opposed to regular drugs that affect more casual brain chemistry; psychedelics might actually teach people to deal with a specific problem “on their own terms,” so to speak, since the substance itself acts to dissolve the ego, allowing the patient to “get out of their own way,” as it were. Blockages and repressions can be viewed internally with both a sense of awe and unrest, effecting one’s desire to change, but most importantly, they might experience with intense clarity the way through their problem.",
            "title_similarity": "0.38009894",
            "sentiment_compound": 0.6445
        },
        {
            "id": "gxnmk42",
            "score": 2,
            "text": "Where can I sign up for these trials? I want out of my daily misery.",
            "title_similarity": "0.3709846",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gxnnfw5",
            "score": 1,
            "text": "I did this alongside living in an emdr facility.  I have very little issues around a ptsd diagnosis that was supposed to make me unable to function unassisted. Dmt and ayahuasca were also used.  This involved taking trips out of the usa. Im very thankful for the donation of treatment. And would recommend everyone in a similar situation do the same.",
            "title_similarity": "0.4249877",
            "sentiment_compound": 0.7574
        },
        {
            "id": "gxno7ux",
            "score": 3,
            "text": "i did shrooms two years ago and had a terrible come down. but during the trip i cried on the grass and realized that i don’t have to justify my time on earth with anything. i can just be. after the trip, i wasn’t anxious or depressed for about two months. even now it’s less severe.",
            "title_similarity": "0.6600609",
            "sentiment_compound": -0.9367
        },
        {
            "id": "gxnouye",
            "score": 1,
            "text": "I've heard it said before that psychedelics will eventually replace things like SSRIs for depression. Can anyone in the know explain to me why this might be, and how they work?",
            "title_similarity": "0.5128752",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxnpqqr",
            "score": 1,
            "text": "Can’t use something that actually cure the problem, then people ain’t spending money on the drugs anymore. \n\nIt’s just simple economics, they ain’t out to cure you. They’re out to make the money.",
            "title_similarity": "0.4020068",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gxnpu31",
            "score": 1,
            "text": "\"But then what are the patients going to buy from us every month?!\" - Pharmaceutical Inudustry",
            "title_similarity": "0.58376455",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnqe9t",
            "score": 2,
            "text": "Not going to lie. After the first night I took X back in 98, my rage of wanting to beat and maim my step father vanished and I started to feel bad for him. Never had those feelings towards him since.",
            "title_similarity": "0.6020377",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gxnqgnn",
            "score": 1,
            "text": "I haven't read the study, but just the number 67% implies a small ass sample",
            "title_similarity": "0.61264133",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gxnqoza",
            "score": 1,
            "text": "Anybody know how they did the placebo here? I would think it would be very obvious whether you took MDMA or not",
            "title_similarity": "0.3277068",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnqx51",
            "score": 1,
            "text": "mdma has some degree of neurotoxicity\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3181923/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3181923/)\n\nDosages listed are at around 80-180mg, so like .1 which isn't a whole lot but\n\n[https://pubmed.ncbi.nlm.nih.gov/19878142/](https://pubmed.ncbi.nlm.nih.gov/19878142/)\n\nThat's a thing too.\n\nbut I guess if you have crippling PTSD whats a chromosome or two",
            "title_similarity": "0.5124055",
            "sentiment_compound": 0.2779
        },
        {
            "id": "gxnrlbl",
            "score": 1,
            "text": "Hey does someone know any psychedelic treatment for anxiety?",
            "title_similarity": "0.38181704",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gxnrrlk",
            "score": 1,
            "text": "100% of participants told researchers they loved them, then were embarrassed at what they said the next day",
            "title_similarity": "0.53300804",
            "sentiment_compound": 0.34
        },
        {
            "id": "gxnrugu",
            "score": 1,
            "text": "Wow that is super astounding considering this type of treatment hasn’t been seriously explored for more than a handful of years(I believe?). Drug scheduling needs to be revisited.",
            "title_similarity": "0.6787565",
            "sentiment_compound": 0.8689
        },
        {
            "id": "gxns7uz",
            "score": 1,
            "text": "MDMA can change the world. Said that since the first day I ingested",
            "title_similarity": "0.39156538",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnsbf2",
            "score": 1,
            "text": "I want to see similar studies done on the effect of mescaline and/or mescaline-containing cacti on PTSD. I predict that it would have a similar outcome. I would like to see more natural alternatives to MDMA.",
            "title_similarity": "0.2411812",
            "sentiment_compound": 0.6801
        },
        {
            "id": "gxnub59",
            "score": 1,
            "text": "The first three raves I went to were life-changing too.\n\nThen they got old, then it got reaaaaal dark",
            "title_similarity": "0.6015773",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnufrw",
            "score": 1,
            "text": "Does it say how this compares to patients who received the placebo?",
            "title_similarity": "0.49554503",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnuryi",
            "score": 1,
            "text": "91 participants, such a frustrating number. I feel like its right in the grey area as to being enough people to be useful information and also not enough people. The fact that it’s not the first positive result in this field makes me feel optimistic.",
            "title_similarity": "0.41838416",
            "sentiment_compound": 0.3348
        },
        {
            "id": "gxnushr",
            "score": 1,
            "text": "Are you the account for MAPS in Santa Cruz? I went to UCSC! A couple of my friends are really interested in your work and have interest in going into that field of research, what you're doing has the potential to be life changing for a lot of people",
            "title_similarity": "0.23229653",
            "sentiment_compound": 0.855
        },
        {
            "id": "gxnw15m",
            "score": 1,
            "text": "Man, I love seeing effect sizes in an abstract!  Great study, great finding...could be a game changer",
            "title_similarity": "0.050489265",
            "sentiment_compound": 0.9286
        },
        {
            "id": "gxnwmu9",
            "score": 1,
            "text": "So a sliver of hope OR…we will have to suffer through another 60 years of the most epic policy failures until some novel analogue by big pharma is produced because they bought enough legislators, only to be $5,000 a session, after insurance… word. We could have learned this decades ago. We SHOULD have.",
            "title_similarity": "0.60137665",
            "sentiment_compound": -0.3744
        },
        {
            "id": "gxnwstn",
            "score": 1,
            "text": "How would someone that lives near ROCHESTER,NY  get some mdma. Because cash is nice and so is a free mind. Dm me if anyone has answers",
            "title_similarity": "0.25234258",
            "sentiment_compound": 0.7479
        },
        {
            "id": "gxnx4nj",
            "score": 1,
            "text": "Can someone weigh in on whether microdosing or lower than standard recreational doses of MDMA can be beneficial/therapeutic? I’ve tried rolling a couple time but the doses were presumably very high so I got the comedown for the next couple days. Wondering if there might be some benefit to a mild dose more often, while also possibly dodge side effects like the brain lesions from long term use and the serotonin withdrawal..",
            "title_similarity": "0.58116555",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gxnyfeq",
            "score": 1,
            "text": "Im starting to think that blue guy from Tool was on to something.",
            "title_similarity": "0.18890974",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxnyuqp",
            "score": 1,
            "text": "How does one get MDMA-assisted therapy sessions? I would love to explore this.",
            "title_similarity": "0.27861884",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gxnzeys",
            "score": 1,
            "text": "We've been hearing for decades about multiple recreational drugs showing promising mental health applications and how better treatment is just around the corner. I was a teenager first reading about these sorts of things and I'm now in my 30s with no sign of these ever leaving trials. MDMA, LSD, Mushrooms, Ketamine have all shown positive results in repeated tests with mental health. It feels like these will never actually reach mainstream medicine and treatment. \n\n\nI've literally damaged my body and organs with traditional antidepressants and mental health medicines. I'm starting to question what side effects they could fear with these drugs when I've got so much damage done I have to take other meds to compensate for the damage of traditional choices being taken as prescribed.",
            "title_similarity": "0.68322134",
            "sentiment_compound": -0.5191
        },
        {
            "id": "gxo0bvp",
            "score": 1,
            "text": "Still time to invest in mind meds",
            "title_similarity": "0.20849061",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxo0gyf",
            "score": 1,
            "text": "Not a lot of pasta but pasta likely isn’t a hospital hire a dietician, not a feature.",
            "title_similarity": "0.5165587",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxo0mg0",
            "score": 1,
            "text": "That sounds about right.",
            "title_similarity": "-0.17606993",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxo1z91",
            "score": 1,
            "text": " The best way to keep updated/get involved as a participant in clinical trials is to go to the website [clinicaltrials.gov](http://clinicaltrials.gov/) and use 'psilocybin' or 'MDMA' (or whatever) in the 'other terms' field.  This will give you a list of these types of trials going on around the world.  Clicking on each study will give you more information about that particular study, including inclusion/exclusion criteria and contact information.",
            "title_similarity": "0.34631938",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gxo2raa",
            "score": 1,
            "text": "Follow up results are at 2 months after the last therapy session. That's a quite good timeframe to reasonably assess if the effect is sustained. Great work.",
            "title_similarity": "0.44292775",
            "sentiment_compound": 0.807
        },
        {
            "id": "gxo3409",
            "score": 1,
            "text": "Can't wait to be prescribed micro-doses of psilocybin!",
            "title_similarity": "0.2930879",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxo38i7",
            "score": 1,
            "text": "Glad to see us humans arriving in the modern era. Time for research un-influenced by ideology",
            "title_similarity": "0.18839742",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gxo3mew",
            "score": 1,
            "text": "MDMA vs PTSD - round 1",
            "title_similarity": "0.37441537",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxo3rk7",
            "score": 1,
            "text": "If I didn’t have E to get me through my baggage  wouldn’t be the man I am today. I was a club kid from the mid/late 90s-2002ish. It changed my life. How I see everything. It accelerated my empathy and understanding in a way I still carry. When I was done with it I was done. I did  my t to need it anymore. But as 40+ man now, I’m thinking a micro dose would do me wonders.",
            "title_similarity": "0.46238476",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxo4myy",
            "score": 1,
            "text": "It’ll be 20 years before this becomes a mainstream treatment , with the science deniers in the middle of the US, including the worst. Texas, Indiana, and Kentucky. It really sucks that in the US a handful of stupid people can sway whole blocks of the disenfranchised, only to put a stop to advances like this.",
            "title_similarity": "0.6626125",
            "sentiment_compound": -0.9184
        },
        {
            "id": "gxo5631",
            "score": 1,
            "text": "Legalize & regulate it like everything else",
            "title_similarity": "0.07814151",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxo57rm",
            "score": 1,
            "text": "They still have PTSD right? This didn't cure them, it just made them no longer have symptoms? Or at least for a while (of which we're unsure how long would last)?",
            "title_similarity": "0.6132237",
            "sentiment_compound": -0.5775
        },
        {
            "id": "gxo6i4m",
            "score": 1,
            "text": "Give it to me!    Again",
            "title_similarity": "-0.021101672",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxo6nto",
            "score": 1,
            "text": "Man I wish I could get in on this",
            "title_similarity": "0.10834892",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxo6uxu",
            "score": 1,
            "text": "Big Pharma won’t like this. They only want drugs that you have to take everyday forever until you die. Three doses and done is not going to be good for their bottom line. Just like they wouldn’t want anyone to cure cancer.",
            "title_similarity": "0.60990804",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gxo71fs",
            "score": 1,
            "text": "For anyone who's interested, the stock is $NUMI",
            "title_similarity": "0.19103171",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxo7fjv",
            "score": 1,
            "text": "The most harmful part of mdma is getting it off the street mixed with whatever. Legalize it.",
            "title_similarity": "0.2992585",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxo8uq8",
            "score": 1,
            "text": "Give it a month for their brains to come to terms with the fact that their entire body is devoid of any serotonin or dopamine.",
            "title_similarity": "0.6521859",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxo9iko",
            "score": 1,
            "text": "This is about as anecdotal as it gets, but I worked through an immense amount of childhood trauma during my raver years, when I would frequently take unadulterated (reagent tested) MDMA amongst good company. I recognize that I still have some issues to work through and a clinical setting likely would have offered a greater benefit. That said, during that period I transformed from an insecure, mildly on the spectrum kid with crippling anxiety, to a kid who had plans most every night of the week and made fast friends with people everywhere he went.\n\nTo be quite honest I don't think I had ever felt such a real sense of happiness prior to trying MDMA. Unlike many other drugs, the euphoria it brings about is very \"organic,\" which is to say that much of the high is the same euphoric wave you experience naturally when learning of a great personal accomplishment. It's just that same feeling, sustained, for 4-6 hours. But it gave me something to strive for, my very first time I remember thinking \"wow! I want my life to be so good that I can feel this sort of happiness without drugs,\" and that has been my life's goal ever since.\n\nAnd FWIW, I haven't felt compelled to use MDMA in a decade.",
            "title_similarity": "0.5695354",
            "sentiment_compound": 0.9954
        },
        {
            "id": "gxo9vtb",
            "score": 1,
            "text": "Thank you for bringing this to my attention. I have a screening phone call with them tomorrow to review my eligibility 'test results'.",
            "title_similarity": "0.3041137",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gxoa4y1",
            "score": 1,
            "text": "The problem is it can unwind after a couple of years. I’ve lived with ptsd due to domestic abuse for about 8 years, it’s just a bumpy road, bit of Mandy is very therapeutic yeah but to say no longer qualified for a ptsd diagnosis seems like a fat stretch over a long time and lot of other outside variables included.      \n        \nNot dismissing it, just find this slightly disingenuous.",
            "title_similarity": "0.65563005",
            "sentiment_compound": -0.3096
        },
        {
            "id": "gxoag67",
            "score": 1,
            "text": ">In the first experimental session, an initial dose of 80 mg was followed by a supplemental half-dose of 40 mg 1.5–2.5 h after the first dose. In the second and third experimental sessions, an initial dose of 120 mg was followed by a supplemental half-dose of 60 mg.\n\nAs someone unfamiliar with MDMA, how does this compare to recreational doses?",
            "title_similarity": "0.6270218",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxoakne",
            "score": 1,
            "text": "That’s cause it’s impossible to be sad on MDMA.",
            "title_similarity": "0.2076835",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gxoamj0",
            "score": 1,
            "text": "Is this with or without therapist supervision?",
            "title_similarity": "0.34416544",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxoaxqh",
            "score": 1,
            "text": "I might’ve totally missed it but just out of curiosity, did they mentioned what exactly the dose of “low dose MDMA” was?",
            "title_similarity": "0.49883172",
            "sentiment_compound": -0.1893
        },
        {
            "id": "gxobe6r",
            "score": 1,
            "text": "While these results are good to see, the CAPS-5 is not the best measure for PTSD, it is extremely brief and relies too heavily on affective symptoms. There isn't much attention given to maladaptive core beliefs, interpersonal symptoms as a result of trauma, or cognitive processes. This is good for the most readily visible PTSD symptoms, such as reactivity, arousal, nightmares, flashbacks, and other dissociation, but will not adequately treat those with complex PTSD.\n\nThis type of study needs more extensive longitudinal follow-up, I am willing to bet many of these concerns will represent, unfortunately.\n\nI believe that approaches such as cognitive reprocessing and perhaps virtual-reality assisted therapy are more promising as far as newer approaches go.",
            "title_similarity": "0.4342789",
            "sentiment_compound": -0.2918
        },
        {
            "id": "gxobka7",
            "score": 1,
            "text": "I wish I could try this type of therapy out. I've done MDMA in the past but not since being diagnosed with PTSD.",
            "title_similarity": "0.6630056",
            "sentiment_compound": 0.2144
        },
        {
            "id": "gxocg4m",
            "score": 1,
            "text": "Suddenly everyone has ptsd for some reason",
            "title_similarity": "0.417709",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxod9yy",
            "score": 1,
            "text": "I’ve never done MDMA, I’ve never wanted to do MDMA. \n\nI SO want to find a Dr to do MDMA with now. \nThis is a brand new sentence in My life, at least.",
            "title_similarity": "0.52577543",
            "sentiment_compound": 0.4511
        },
        {
            "id": "gxoda0d",
            "score": 1,
            "text": "If you haven't watched Neurons to Nirvana, check it out. Went to a panel with some of the people who produced it and were in it a few years ago and it was truly eye-opening. The part about LSD to treat alcoholism was particularly interesting.",
            "title_similarity": "0.5139201",
            "sentiment_compound": 0.8221
        },
        {
            "id": "gxoeay1",
            "score": 1,
            "text": "Step 1: get ptsd \nStep 2: get MDMA \nStep 3:????? \nStep 4: profit",
            "title_similarity": "0.4600536",
            "sentiment_compound": 0.594
        },
        {
            "id": "gxoec7x",
            "score": 1,
            "text": "How long after the treatment was the assessment held that determined they no longer qualified. We’re they entirely sober by the time they no longer qualified. Was there substantial follow up that determined that they remained unqualified? I’d so what % of patients remained unqualified at which time intervals",
            "title_similarity": "0.73081756",
            "sentiment_compound": 0.296
        },
        {
            "id": "gxoeidt",
            "score": 1,
            "text": "Queation: Were they more inclined to rely on mdma afterwards?",
            "title_similarity": "0.3393051",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxoen1d",
            "score": 1,
            "text": "Military needs to take a page out whoever’s book this is coming from. Ibogaine has shown skeptical but promising results with guys, as well.",
            "title_similarity": "0.3984724",
            "sentiment_compound": 0.6757
        },
        {
            "id": "gxofbmy",
            "score": 1,
            "text": "Could someone explain how the test group with a standard deviation of 11.6  is significant against the treatment group with a standard deviation of 11.6? The p value here is great, but obviously I didn't pay too much toward the end of class",
            "title_similarity": "0.49899793",
            "sentiment_compound": 0.6242
        },
        {
            "id": "gxoghge",
            "score": 1,
            "text": "How would one sign up for this kind of therapy? I know a person who really could use this.",
            "title_similarity": "0.107114285",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxogk3f",
            "score": 1,
            "text": "I'm gonna buy some M from my guy now",
            "title_similarity": "0.14015546",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxogtbe",
            "score": 1,
            "text": "What I find so amazing is that this isn’t something that people have to be on forever. Any time you can get off of medications is a great thing.",
            "title_similarity": "0.25605255",
            "sentiment_compound": 0.874
        },
        {
            "id": "gxogxlg",
            "score": 1,
            "text": "How can there be a placebo in these cases? Most patients would figure out pretty quickly whether they were given mdma right?",
            "title_similarity": "0.52146196",
            "sentiment_compound": 0.5514
        },
        {
            "id": "gxohqfk",
            "score": 1,
            "text": "Who funded this study?",
            "title_similarity": "0.17951566",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxojg5z",
            "score": 1,
            "text": "Sometimes you just need to hit 'reset'.",
            "title_similarity": "0.21889871",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxojjdf",
            "score": 1,
            "text": "Not here to condone MDMA usage recreationally, first and foremost.\n\nI was someone with a ton of self image issues, was introverted and shy.  I was homeless in my late teens, dealt with abuse in the home.  I would generally panic in large crowds and shut down completely.\n\nI started going to raves and partying with a few girls that I grew close with (met through a high school friend).  They introduced me to recreational MDMA use - and I remember the first time I used at a rave: all my anxiety about being in the crowd disappeared.  I continued to use it recreationally for a couple years (I wouldn't use it more than once every few months), and it's odd to say this: it definitely had a positive effect on me in the long term.  I can't say I couldn't have had the same outcome through just therapy alone, but I have far less anxiety talking about the trauma I've faced, far less anxiety in approaching social situations now than before.  \n\nIt's been literally years since I've done MDMA again (the last time being my wife and I using it together on a date night prior to marrying, and we have since had 2 children), and while I haven't had an interest in using it again - I could definitely see the possibilities of it's usefulness in treatment of PTSD.  I'm excited for those who could benefit from its use in a controlled application, but definitely don't take my anecdotal experience as a recommendation to use it either recreationally or without the guidance of a professional.\n\nEdit: I should also add that I did in fact see a professional after that last time I used, but I do in fact believe that MDMA use personally lead me to open up enough to see a doctor in the first place.",
            "title_similarity": "0.58042437",
            "sentiment_compound": 0.7723
        },
        {
            "id": "gxokx0r",
            "score": 1,
            "text": "I hope they make good progress. PTSD is awful to live with.",
            "title_similarity": "0.31616136",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gxol6in",
            "score": 1,
            "text": "Oh, look! Each and every drug can probably be used healthily if it’s used for its intended purpose.\n\nWho knew, besides Shamans and the Netherlands?",
            "title_similarity": "0.26801664",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxom3up",
            "score": 1,
            "text": "this is interesting news but how accessible will this kind of therapy be to those most in need? ketamine therapy has shown tremendous promise for treatment resistant depression but in my area a clinic provides this for $900 a session with multiple sessions required and insurance does not cover it. designer drugs have evolved into designer drug therapies.",
            "title_similarity": "0.60511255",
            "sentiment_compound": -0.2048
        },
        {
            "id": "gxomjvk",
            "score": 3,
            "text": "Curious question on the background of this treatment. Did this protocol arise from a prediction based on the known neurochemistry? Or is this investigated as a result of several incidental findings from either the field or as side effects in other studies?\n\nIs this an example of \"hey, the computer says this might work\" versus \"hey, I just hear about a case and we should try it\"?",
            "title_similarity": "0.34846327",
            "sentiment_compound": 0.4291
        },
        {
            "id": "gxonlf4",
            "score": 4,
            "text": "The way this is written makes it sound like the insurance companies would just clap their hands and stop any assistance they were providing.",
            "title_similarity": "0.35072592",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gxor2aq",
            "score": 1,
            "text": "Can they drive and operate heavy machinery while on MDMA?  Is their decision making impaired?",
            "title_similarity": "0.4163621",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxoss0s",
            "score": 1,
            "text": "What is crazy is how much it goes down even in the placebo, meaning if we could just have affordable or sponsored mental health care our society as a whole would be much better off for it.",
            "title_similarity": "0.4602515",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gxotbh3",
            "score": 1,
            "text": "I need this for reasons involving ptsd of sorts and anxiety. Im the working dead , too rich to be poor , too poor to be rich , the forgotten middle.",
            "title_similarity": "0.39256683",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gxotfqb",
            "score": 3,
            "text": "It would be nice if everyone who could benefit from just the sit down therapy  with a caring Professional Therapist could recieve it. So many people suffer and do not have access to help. MDMA  sounds like a tool that is sadly out of reach for many that will probally withdraw because there is no where  to turn in our society.",
            "title_similarity": "0.5814679",
            "sentiment_compound": 0.6743
        },
        {
            "id": "gxougu6",
            "score": 1,
            "text": "Note: it was SEVERE PTSD",
            "title_similarity": "0.27285293",
            "sentiment_compound": -0.516
        },
        {
            "id": "gxov6qj",
            "score": 1,
            "text": "Imagine if they would have listened to Leary and Ram Dass all those years ago instead of kicking them out of the university.",
            "title_similarity": "0.5349777",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxowkt1",
            "score": 1,
            "text": "Isn't 90 a rather small sample size? More research needed!",
            "title_similarity": "0.34593448",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxowxaj",
            "score": 1,
            "text": "I need this my life is miserable with ptsd..",
            "title_similarity": "0.41079408",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gxox1fk",
            "score": 1,
            "text": "Speaking from a non scientific standpoint, trying MDMA/ecstasy was one of the greatest experiences in my life.  And that was just the street garbage.  I can’t imagine how uplifting medical grade would be in a calm, supportive environment, especially if you’re trying to overcome some serious trauma",
            "title_similarity": "0.48972535",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gxox2sb",
            "score": 2,
            "text": "I wonder if this would help CPTSD.",
            "title_similarity": "0.20806704",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gxox3bk",
            "score": 1,
            "text": "I can’t wait until this treatment is open to the public.",
            "title_similarity": "0.08689202",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxoxvo3",
            "score": 1,
            "text": "My life has changed radically since I started using entheogens, went from 125 kg to 95 within a month and 1/2.\n\nMy relationships have healed significantly, specially with myself and I am more clear than ever before, feels like everything is just how it's supposed to be and I am who I came here to be.\n\nIt's been 5 years since my self discovery process started; have been sharing with my family and friends since then, from LSD to Ayahuasca I've taken my parents through deep emotional healing thanks to entheogens.\n\nWill always support and stand for plant medicine, it is here to help us create a better world.\n\nEdit: I know MDMA is not technically an entheogen or plant medicine; I'm referring to psychedelic/ empathogenic chemical compounds; MDMA has been one of the main medicines I use for emotional psychotherapy with myself and family.",
            "title_similarity": "0.5635641",
            "sentiment_compound": 0.9744
        },
        {
            "id": "gxoyi5v",
            "score": 1,
            "text": "Mmmm that seems tricky a bit tricky.",
            "title_similarity": "0.039179664",
            "sentiment_compound": -0.296
        },
        {
            "id": "gxozas8",
            "score": 1,
            "text": "I've done three sessions and to say it's life changing is an understatement. I cannot wait for this to be an accessible therapy!",
            "title_similarity": "0.54984814",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxozjgv",
            "score": 1,
            "text": "hey so u took drugs?\nyeah\nand ur no longer scared of war?\nyeah\ncongrats ur cured! take 100mg of MDpA twice daily for the next 30 years! (aside: looks like ill be retiring early...)",
            "title_similarity": "0.60617286",
            "sentiment_compound": 0.5789
        },
        {
            "id": "gxp1ja8",
            "score": 1,
            "text": "Is mind med a cash cow ?",
            "title_similarity": "0.3132101",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxp279z",
            "score": 1,
            "text": "I suffer from pretty severe clinical depression, and whenever I've taken MDMA it's made me lastingly optimistic for months afterward. Accomplishing goals, eating better and exercise never helped as much. The only downside is the blues for about 48 hours, but it was immensely worth it for those few months of positive thinking.",
            "title_similarity": "0.5642418",
            "sentiment_compound": 0.7227
        },
        {
            "id": "gxp2z7w",
            "score": 1,
            "text": "How big are the doses?",
            "title_similarity": "0.15061182",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxp3n7b",
            "score": 1,
            "text": "With an N of less than 4000. What’s your p-hat?",
            "title_similarity": "0.42377836",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxp4irv",
            "score": 1,
            "text": "Oh please God let it work on me",
            "title_similarity": "-0.05432115",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gxp5xbq",
            "score": 1,
            "text": "Hey guys, there’s a paper on Psilocybin and MDD (Treatment Resistant Major Depressive Disorder) by Alan K. Davis (and others I can’t remember). Numbers are the same if not higher. Will check paper and report back.\n\nEDIT: TLDR\n\n-[Link](https://jamanetwork.com/journals/jamapsychiatry/fullarticle/2772630)\n\n-58% in complete remission\n\n-at least 71% reduce their severity two fold\n (severe->moderate->mild)\n\n-doses around an eighth of dried mushrooms        (20mg-30mg)\n\n-sustained effects after 4 weeks\n\n-Works almost immediately post session\n\n-anxiety scores were also taken, and they went down   after the treatment. \n\n—This is congruent with other findings in a study on   End-of-life anxiety and psilocybin. \n\n—It also validates neurology studies. Psilocybin slows metabolism in the amygdala, the area generally responsible for arousal, which is the core of anxiety. Turn that off and you become less neurotic.\n\nI wonder if they’ll alter psilocybin therapy to 3 sessions, similar to this study. Maybe it’s just universally better to have more sessions.\n\nYa hear that kids!?!? DO DRUGS WITH YOUR THERAPIST!",
            "title_similarity": "0.66749287",
            "sentiment_compound": -0.6922
        },
        {
            "id": "gxp6hd8",
            "score": 1,
            "text": "Right now someone up high is wondering how they can cut off disability cases by giving them a couple hits of drugs.",
            "title_similarity": "0.4245993",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gxp72ip",
            "score": 1,
            "text": "I just want to throw this out there. This won't he permanent without needing future sessions. The outlook change wears off over time. No scientist here but I have experience.",
            "title_similarity": "0.49180675",
            "sentiment_compound": -0.1154
        },
        {
            "id": "gxp7kef",
            "score": 1,
            "text": "This makes me very happy\n\nBoth the drug and the post",
            "title_similarity": "0.020433437",
            "sentiment_compound": 0.6115
        },
        {
            "id": "gxp8arc",
            "score": 1,
            "text": "legalized psychedelics",
            "title_similarity": "0.28178638",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxpa0lf",
            "score": 1,
            "text": "Tripping balls = health",
            "title_similarity": "0.23670265",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxpg8ae",
            "score": 1,
            "text": "I had the chance to interview dozens of participants from the phase 2 trials and wrote an article specifically on the benefits participants experienced beyond just symptom reduction in these trials. My team found there was a range of quality of life benefits for all participants, even those who appeared to not have much symptom change. Improved self-awareness and confidence, reduction of problem substance use, increased openness to other therapies, improved relationships, reduced need for medications, and so on. Even the participant who had the lowest change in their symptom scores said that every part of their life was better after the study, but in the data they failed the treatment.\n\nAnd just a note as to how this treatment seems to work...MDMA in and if itself is not making any long term changes to the brain or functioning. It is not a magic bullet. What it is doing is creating the optimal zone for someone to have an intensive trauma-focused therapy session. Through changes to the serotonin system (5ht1a/5ht1b), dopamine, alpha 2 adrenoceptors, oxytocin, and importantly reduction of amygdala functioning and increase in prefrontal cortex functioning, the medicine is reducing the fight it flight response to traumatic memories. This allows the person to access the traumatic memory in a way that they likely have been blocked from since the trauma. It is the process of this intensive trauma-focused therapy that is making the king term change. The MDMA just allows this to happen in a way that is more tolerable and effective.",
            "title_similarity": "0.5113745",
            "sentiment_compound": -0.2274
        },
        {
            "id": "gxpgpiz",
            "score": 1,
            "text": "For anyone struggling with chronic stress, anxiety and PTSD: \n\nI can recommend checking out a course called Dynamic Neural Retraining System (DNRS). Over the past few months I've successfully used the knowledge and techniques in this course to get rid of chronic fatigue after many years of struggle. Chronic fatigue is actually a chronic stress disorder (with physical complications because of the chronic subconscious stress) and the program works very well with stress, anxiety, depression and conditions like PTSD. Search it up on YouTube or find their site on Google. Good luck!",
            "title_similarity": "0.50661266",
            "sentiment_compound": -0.8612
        },
        {
            "id": "gxphk5v",
            "score": 1,
            "text": "Beautiful. Times are changing",
            "title_similarity": "-0.0747766",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gxpim0n",
            "score": 1,
            "text": "How does your jaw feel? \n\n\nPretty sore.\n\n\nCongratulations! You're free of PTSD!",
            "title_similarity": "0.2858634",
            "sentiment_compound": 0.8585
        },
        {
            "id": "gxpizol",
            "score": 1,
            "text": "Just imagine how many youtubers are going to be taking MDMA now.\n\"MY COMMENT SECTION GAVE ME PTSD\"",
            "title_similarity": "0.5787312",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxpj1vc",
            "score": 1,
            "text": "MDMA is amazing, its crazy how stupid good it feels.",
            "title_similarity": "0.20115288",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gxpk0ra",
            "score": 1,
            "text": "Which doesn’t mean popping mollies every other day is going to cure your ptsd. I already see this knowledge being recycled throughout all the fact-meme pages :“Science found MDMA cures Ptsd”",
            "title_similarity": "0.5982449",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxpkh1h",
            "score": 1,
            "text": "When I read the headline I got this image of PTSD-stricken soldiers off their asses on MDMA in a club with rave music blaring and lots of blinking lights and lasers and fog machines. Good thing that's not actually what's happening.",
            "title_similarity": "0.48752296",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gxplb8b",
            "score": 1,
            "text": "Humans: discover magic chemicals that can make people euphoric on demand.\n\nPricks: sorry that's too good we gotta make this illegal.\n\nHumans: oh it can actually help people with trauma or chemical imbalances.\n\n*shocked faces all round*",
            "title_similarity": "0.33663398",
            "sentiment_compound": -0.3071
        },
        {
            "id": "gxpo8by",
            "score": 1,
            "text": "Where do i sign up for free mdma therapy?",
            "title_similarity": "0.41063172",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gxpoui0",
            "score": 1,
            "text": "This reinforces my thought that all drugs should be a health issue and not a law issue.  And when do I get the cheaters Olympics, where there are no banned drugs and really see the human limits.  We might learn something like this article.",
            "title_similarity": "0.3715605",
            "sentiment_compound": 0.2686
        },
        {
            "id": "gxpqtph",
            "score": 1,
            "text": "Ha! I’ve done tons of MDMA and *still* have PTSD. *Take that, science!*",
            "title_similarity": "0.5857352",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxpttl1",
            "score": 1,
            "text": "For a drug like MDMA that has extremely potent psychological effects how do they control for this with a placebo?  Someone may not know the difference between an aspirin and a sugar pill but certainly most people can tell the difference between MDMA and a sugar pill.  Even accounting for the placebo effect I would think it's efficacy would be incredibly diminished under these circumstances. I don't know how you can have a truly randomized double-blind trial when both the tester and the testee would certainly have a very strong indicators whether they were using the placebo or not.",
            "title_similarity": "0.537047",
            "sentiment_compound": 0.9493
        },
        {
            "id": "gxpvc1y",
            "score": 1,
            "text": "I tried reading it but I'm not that smart... does it mention much about the after effects of the participants taking it, my experience (and reason for no longer taking MDMA at all) is that it makes you really depressed the next day and can last a few days.",
            "title_similarity": "0.6840366",
            "sentiment_compound": -0.8904
        },
        {
            "id": "gxq44a6",
            "score": 1,
            "text": "Honestly every time I have done mdma me am all my friend got way closer and I also came out of it with a better out look on life, through being 17 -19 I probably did it around 30 times only issue being the hangovers of you don’t space your rolling out",
            "title_similarity": "0.4013312",
            "sentiment_compound": 0.8442
        },
        {
            "id": "gxq5tcl",
            "score": 2,
            "text": "Aaaannnd MindMed is trading at an all-time low this morning.",
            "title_similarity": "0.5429667",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gxq95lx",
            "score": 1,
            "text": "Who  woulda thunk that the government and pharmaceutical companies would outlaw things (mdma.Cannabis , shrooms, etc ) that could help deal and maybe even cure depression etc ..Greedy bastards",
            "title_similarity": "0.5115107",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gxqa6ef",
            "score": 2,
            "text": "My 17-year old has treatment resistant depression, and is suspected to have depressive personality disorder, as well as being on the highest dose of antidepressants approved for her age. Nothing has helped. We've been at this for years, have tried numerous therapists, an outpatient treatment group, to no avail.  She's miserable and the pandemic has only exacerbated her symptoms.\n\nI really want to ask her doctors about these types of therapies but also worry that they might want to report me to social services for suggesting that my kids try psychedelics. \n\nI really hope more research can be done with this to help people who have tried other options with no success.",
            "title_similarity": "0.7224134",
            "sentiment_compound": -0.6074
        },
        {
            "id": "gxqdawq",
            "score": 1,
            "text": "It’s amazing these things are coming out. How can we as a community push for a policy change around psychedelics? Looking for real advice on what difference I can make.",
            "title_similarity": "0.26979765",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gxqrsq4",
            "score": 1,
            "text": "Does anybody have any experience with Bipolar 2 and using?",
            "title_similarity": "0.42813295",
            "sentiment_compound": 0.0
        },
        {
            "id": "gxt2r13",
            "score": 1,
            "text": "hello, nice to meet you",
            "title_similarity": "-0.14703034",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gxttl2w",
            "score": 1,
            "text": "Good luck 1. getting cleared for this treatment and 2. affording it.",
            "title_similarity": "0.04319877",
            "sentiment_compound": 0.743
        },
        {
            "id": "gxw9y38",
            "score": 1,
            "text": "This is why I've invested a fair amount of my portfolio into psychadelic related companies. Very excited how all of this plays out over the next 10-15 years.",
            "title_similarity": "0.32183787",
            "sentiment_compound": 0.7386
        },
        {
            "id": "gxwonqf",
            "score": 1,
            "text": "I cant wait for the VA to laugh me out of the building for askingabiut this. They are not trying to help as much as they like to claim.",
            "title_similarity": "0.36696073",
            "sentiment_compound": 0.5916
        },
        {
            "id": "gxx1i5q",
            "score": 1,
            "text": "Love you, MAPS! This is a great organization if you're looking for somewhere to donate to science. I donate to them with my online orders using amazon smile. Excited to see where future studies go!",
            "title_similarity": "0.19572012",
            "sentiment_compound": 0.938
        },
        {
            "id": "h7inxa3",
            "score": 1,
            "text": "I don't know guys, how many times have we heard of breakthroughs in psychology and then after the researcher died and we had access to their notes it was revealed to be mostly fabricated?",
            "title_similarity": "0.7066013",
            "sentiment_compound": -0.5574
        }
    ]
}