{
    "For decades, ExxonMobil has deployed Big Tobacco-like propaganda to downplay the gravity of the climate crisis, shift blame onto consumers and protect its own interests, according to a Harvard University study published Thursday.\n": [
        {
            "id": "gy0fvex",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.6639176",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gy1ch7y",
            "score": -6,
            "text": "Is there any particular reason this anti-Exxon meme gets reposted week after week for years?",
            "title_similarity": "0.7086718",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1c0wv",
            "score": 5,
            "text": "You’re kidding. A company acted to protect its own interested??? No way. Put this on /r/science. Great work Harvard 😂",
            "title_similarity": "0.58197117",
            "sentiment_compound": 0.9009
        },
        {
            "id": "gy14bn5",
            "score": 3,
            "text": "And despite the clear damage and threat that ExxonMobil still poses on the entire planet, there will be no punishment.",
            "title_similarity": "0.4711137",
            "sentiment_compound": -0.0844
        },
        {
            "id": "gy1g2cu",
            "score": -4,
            "text": "Makes you wonder if zero empathy is a requirement to graduate business school. Low intellect as well, given they must have known the ultimate consequences.",
            "title_similarity": "0.6220252",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gy0yni0",
            "score": 37,
            "text": "We are going to be reading about the guilt we have been made to feel about eating meat in 20 years in the same light we do today with the plastic industry making us feeling personally responsible for saving the planet due to our recycling going back 30 years. \n\nUnpopular opinion: Meat consumption isn't problematic in the US. Agricultural emissions are only 9% of our footprint with meat making up a fraction of this. Even if it was half, which is a massive overestimation, arguing that 4% or so of our emissions footprint for something we NEED to subsist is the problem we should be made to feel personally guilty and responsbile about is absrud. \n\nThey have super polluting cargo ships and massive factories dumping CO2 into the atmosphere, and about 100 companies are responsible for the overwhelming amount of greenhouse gasses, but this is somehow on me eating my burger? \n\nI really want to see the narrative change on this. \n\n(Just to be clear, meat consumption CAN be problematic depending on the area. For example, in Brazil they are chopping down rainforests to graze cattle. In other regions their process pollutes rivers. And in others, they utilize too much water.\n\nThe thing is, though, while all of those environmental problems are valid, they don't really factor into \"our\" meat consumption, do they? I am not eating Brazilian beef.)",
            "title_similarity": "0.7421055",
            "sentiment_compound": -0.8409
        },
        {
            "id": "gy1jmtg",
            "score": -13,
            "text": "I though this sub was about science not political opinion",
            "title_similarity": "0.3022446",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy189la",
            "score": -2,
            "text": "Actually talked about them in an assignment I submitted to uni today. Problem is that they keep up a show of funding research and not outwardly denying the need for change, but covertly fund denialist groups that will lobby against the implementation of policies to actually achieve any meaningful engagement with decarbonisation goals. That of course makes it ambiguous where they actually stand, and so it takes specific research into the company itself that most people will never see to even reveal the issue.",
            "title_similarity": "0.73897195",
            "sentiment_compound": 0.7762
        },
        {
            "id": "gy1army",
            "score": 1,
            "text": "I would like to know how many times ExxonMobil or one of its executives were featured in HBR where Harvard profited",
            "title_similarity": "0.680217",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gy1sy1s",
            "score": 0,
            "text": "Hahahahahahahaha this is great for r/science\nGuess what other industry deploys the SAME propaganda???\n\nHint: also the same industry that contributes the largest amount of lobby dollars to the U.S. government, most advertising dollars to main stream tv networks and owns the largest criminal settlements in history.\n\nWe say our current crisis is climate so this study is spot on in relevance... Next crisis will involve that other industry. You know, the one that is responsible for shutting down the planet.",
            "title_similarity": "0.76069707",
            "sentiment_compound": -0.8243
        },
        {
            "id": "gy0v9jv",
            "score": 40,
            "text": "Mhm, notice how every 'green' solution to the public involves buying something new.\n\nOld car 'nope that's dirty, you need a new green one'\n\nOld House 'you have bad insulation, you need a new green one'\n\nElectrics 'you need newer & more efficient'\n\nNear enough every green policy introduced in Europe seems like a badly disguised subsidy for various industries and for the first time in history we are actually seeing laws introduced to enforce consumer compliance.",
            "title_similarity": "0.73788524",
            "sentiment_compound": 0.1528
        },
        {
            "id": "gy1esmp",
            "score": 14,
            "text": "Why is Exxon at fault? Do governments bear no responsibility to actually regulate in the best interest of its people? Saying that a corporation should have just put itself out of business is kinda the opposite of what capitalism promotes.",
            "title_similarity": "0.615253",
            "sentiment_compound": 0.7236
        },
        {
            "id": "gy11ere",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.0053591467"
        },
        {
            "id": "gy1e45d",
            "score": -4,
            "text": "If the political class actually believed in climate change, then they wouldn't be buying coastal real estate.  If we only have 12 years, why are we allowing mortgages and commercial loans with 30 year terms without pricing in climate change.",
            "title_similarity": "0.7226596",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1o8m4",
            "score": 0,
            "text": "Study was written by someone who financial benefits from its findings (major conflict of interest)",
            "title_similarity": "0.46791765",
            "sentiment_compound": 0.5058
        },
        {
            "id": "gy12aax",
            "score": 2,
            "text": "Biggest problem is that i assume all corporations are doing it, in a way its obvious, even our political candidates employ same people and use same tactics.",
            "title_similarity": "0.5280092",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gy14xwk",
            "score": 6,
            "text": "It doesn't need to shift the blame to consumers.  Without consumers Exxon wouldn't exist and all the oil would be in the ground.",
            "title_similarity": "0.5234084",
            "sentiment_compound": -0.34
        },
        {
            "id": "gy225vz",
            "score": 2,
            "text": "Looks like r/science is deploying the same propaganda tools instead of actual science.",
            "title_similarity": "0.4564489",
            "sentiment_compound": 0.128
        },
        {
            "id": "gy0n1nm",
            "score": -32,
            "text": "Wait a second- what do you mean by “shift” blame onto consumers? It is, in fact, the consumers’ fault.\n\nWhen you buy gasoline or motor oil where do you think that comes from? You’re going to purchase a car, fill up your tank, then blame Exxon for it? \n\nEven if Exxon didn’t exist you have many other companies selling the same product that the consumers are demanding.\n\nExxon didn’t have to do anything nefarious to have a popular product- oil is extremely energy dense and can be easily pumped out of the ground, making it cheap. \n\nEdit: In this thread: emotional children who don’t understand economics. They’re small minded and want a simple, easy target- and Exxon provides this for them.",
            "title_similarity": "0.7127024",
            "sentiment_compound": 0.5473
        },
        {
            "id": "gy1xhhc",
            "score": 6,
            "text": "I miss when this was a science sub instead of a political science sub",
            "title_similarity": "0.46562475",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gy1ieca",
            "score": 0,
            "text": "Time for solar! But then people will get upset with the amount of plastics and metals used over time?",
            "title_similarity": "0.5711198",
            "sentiment_compound": -0.5707
        },
        {
            "id": "gy2946d",
            "score": 0,
            "text": "It took a Harvard study to figure out that people are self serving?",
            "title_similarity": "0.5751109",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1zn28",
            "score": -2,
            "text": "The vast majority of greenhouse gasses produced today are from China. They do not care at all about life and the individual.",
            "title_similarity": "0.50843674",
            "sentiment_compound": -0.3875
        },
        {
            "id": "gy1yolz",
            "score": 4,
            "text": "wow!  Hardvard is very smart... how could they figure it out and how many millions to reach that conclusion ?  stunning revelation",
            "title_similarity": "0.3797577",
            "sentiment_compound": 0.8685
        },
        {
            "id": "gy1vr4c",
            "score": 1,
            "text": "I stopped buying their gasoline after their Exxon Valdez oil spill in Alaska.  None of my sons buy it either.  \nAnd we’ll make sure my grandkids never do when they are old enough to drive too.",
            "title_similarity": "0.6460377",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gy1vzx5",
            "score": -1,
            "text": "How many millions of dollars did this “study” cost to give the result that everyone already knows?",
            "title_similarity": "0.5125202",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2egdk",
            "score": 1,
            "text": "Hmmm sounds a lot like the Republican Party.",
            "title_similarity": "0.37768745",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gy14k73",
            "score": 6,
            "text": "For decades, Exxon Mobil has done its job.",
            "title_similarity": "0.45266283",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1g11q",
            "score": 5,
            "text": "These parasites think they can somehow escape climate cataclysm with computer generated money... It's like they're defiantly standing on the highest turd as it all gets flushed.",
            "title_similarity": "0.6693541",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gy1vesy",
            "score": 2,
            "text": "William Nordhaus, a Nobel prize winner in economics and many other prominent scientist are pretty confident that the cost of attempting to prevent climate change far far outweighs just adapting to the changes.\n\nNot to mention if all of North America and Europe become carbon neutral tomorrow it's not enough, you will never get China or India or other developing nations to throw away their only way out of prosperity.",
            "title_similarity": "0.6986028",
            "sentiment_compound": 0.9423
        },
        {
            "id": "gy17z74",
            "score": -9,
            "text": "And yet, if someone were to make this statement about 30 years ago they would most likely have been labled a \"conspiracy theorist\"....  very interesting.",
            "title_similarity": "0.58602613",
            "sentiment_compound": -0.1045
        },
        {
            "id": "gy18y1x",
            "score": -3,
            "text": "Reminds me of the pharmaceutical industry. But we love them now.",
            "title_similarity": "0.4743403",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gy1buio",
            "score": 149,
            "text": "So are we going to start holding companies accountable or keep pretending my not being a vegan or using straws is the problem",
            "title_similarity": "0.58400214",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy1bbus",
            "score": 0,
            "text": "The guy who put Exxon and Mobile together was paid $600M on top of his retirement exit.\nIt’s all about the money.",
            "title_similarity": "0.5900979",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gy1d5es",
            "score": 0,
            "text": "This was only made possible thanks to our corrupted governments.",
            "title_similarity": "0.49610227",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gy1g4xx",
            "score": 0,
            "text": "Well thankfully whatever they've been trying isn't working. The government unfortunately I don't think is going to do much. Biden wants to do something but there's not much he can do.",
            "title_similarity": "0.38832715",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gy1hsl3",
            "score": 0,
            "text": "We've known this for more than a decade... this study really wasn't required, but... okay!",
            "title_similarity": "0.51755846",
            "sentiment_compound": -0.3162
        },
        {
            "id": "gy1hwys",
            "score": 0,
            "text": "Bad title. “Big tobacco-like” at first glance seems like a gas company is funding a tobacco companies propaganda",
            "title_similarity": "0.6602764",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gy2k09v",
            "score": 0,
            "text": "They are somewhat not wrong. People chose to drive gas guzzlers. People chose to eat industrial food wrapped and packed in plastic.\n\nCompany do what people demands or be complacent about.",
            "title_similarity": "0.46858418",
            "sentiment_compound": 0.2443
        },
        {
            "id": "gy2kebp",
            "score": 0,
            "text": "Harvard had also published climate psychos overexagerate climate crises",
            "title_similarity": "0.6570867",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2r6s6",
            "score": 0,
            "text": "The Harvard smooth institute published it not Harvard. It was to associate oil with the smooth taste of Marlboro cigarettes.",
            "title_similarity": "0.55877864",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1g17m",
            "score": 30,
            "text": "I love these type of headlines. “Expensive 10 year study comes out what we all thought was happening is actually happening.” and by then the policy has changed and people have been fucked over and brain washed and the company probably got a bailout bonus from lobbying. The money cart keeps rolling along while the trampled lie with their faces in the mud.",
            "title_similarity": "0.74345917",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gy0jmhl",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "-0.0053591467"
        },
        {
            "id": "gy1ndal",
            "score": 6,
            "text": "how did a CNN article of all things end up in r/science ? Inquiring minds want to know.",
            "title_similarity": "0.5304829",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gy18l78",
            "score": -13,
            "text": "Like I believe anything Harvard says.",
            "title_similarity": "0.20568049",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy13ydw",
            "score": 12,
            "text": "This has been my thought every time I saw a climate change denial post.",
            "title_similarity": "0.6458869",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy18u2v",
            "score": -1,
            "text": "Put blame on the Everyman with a death wish and blame him for smoking cigs. Who cares if we all die of cancer in 60 years if we can die from climate change in 30?",
            "title_similarity": "0.68704903",
            "sentiment_compound": -0.9451
        },
        {
            "id": "gy1amv6",
            "score": 1,
            "text": "I bet their $25 fee for doing this will teach them a valuable lesson.",
            "title_similarity": "0.4264838",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gy1aov4",
            "score": 1,
            "text": "any company found doing this should be put into receivership.",
            "title_similarity": "0.38936883",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1crqu",
            "score": -1,
            "text": "This belongs in r/leopardsatemyface",
            "title_similarity": "0.16462544",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1d4z5",
            "score": 1,
            "text": "How many Harvard graduates were employed by ExxonMobil to downplay the gravity of the climate crisis?",
            "title_similarity": "0.80308664",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gy1fvpe",
            "score": -1,
            "text": "and now they’re heavily invested in clean energy and carbon capture. see: fuel cell energy",
            "title_similarity": "0.48380303",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gy1ih8m",
            "score": -1,
            "text": "They hired the firm responsible for all the turn your lights out and conserve water commercials in the 90s that made it seem like you were the problem causing global warming.  Glad Harvard finally tells everyone what to think though",
            "title_similarity": "0.7299209",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gy1meva",
            "score": 1,
            "text": "Which generation will stop these corruption and lies?  So far we can't trust Boomers, Gen X,... will Gen Y, Millenials or Gen Z stop this?",
            "title_similarity": "0.5486127",
            "sentiment_compound": -0.8505
        },
        {
            "id": "gy1n4dz",
            "score": -1,
            "text": "Harvard the group they knowingly pushed  high sugar diets on American people ?\n\nhttps://www.npr.org/sections/thetwo-way/2016/09/13/493739074/50-years-ago-sugar-industry-quietly-paid-scientists-to-point-blame-at-fat",
            "title_similarity": "0.78140676",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1qro2",
            "score": 1,
            "text": "I highly recommend “The New Climate War” by Michael E. Mann which goes in great detail about this subject. it’s really interesting and really upsetting.",
            "title_similarity": "0.5349879",
            "sentiment_compound": 0.7574
        },
        {
            "id": "gy1v6lc",
            "score": 1,
            "text": "I mean do we not need fuel? Sure they should be regulated on their end for extraction, but honestly what would stop this industry outside of actual population shrinkage.",
            "title_similarity": "0.6612476",
            "sentiment_compound": 0.1825
        },
        {
            "id": "gy1vdlm",
            "score": 1,
            "text": "I’ll take stuff Michael Mann warned us about a decade ago for $1,000.",
            "title_similarity": "0.5794589",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gy1vm9d",
            "score": 1,
            "text": "...did it really require a Harvard syudy for us to know this?",
            "title_similarity": "0.39864928",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1wfq7",
            "score": 1,
            "text": "No way… that’s what all big companies do: protect their own interests",
            "title_similarity": "0.4826926",
            "sentiment_compound": 0.34
        },
        {
            "id": "gy1y71h",
            "score": 1,
            "text": "Big Oil also had studies in the 1970th. They came the conclusion, that global warming would cause the rise of sea levels and therefore it would be more expensive to build oil rigs in the oceans.",
            "title_similarity": "0.674869",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gy2acu7",
            "score": -1,
            "text": "Them Harvard boys get it right all the time, yep?  No mistakes coming out of brainiac central. Eh?  Fool.",
            "title_similarity": "0.42769805",
            "sentiment_compound": 0.195
        },
        {
            "id": "gy42flw",
            "score": -1,
            "text": "thank you for this /r/science post about\n\nsign, politics",
            "title_similarity": "0.48219362",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy1e0x6",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.02462982"
        },
        {
            "id": "gy1a011",
            "score": -2,
            "text": "I always thought it was kind of strange they would keep telling us that one person's actions could change the world when their actions never changed.",
            "title_similarity": "0.53945214",
            "sentiment_compound": -0.2716
        },
        {
            "id": "gy1byya",
            "score": 2,
            "text": "Not ironically, some of the 'scientists' they first used were the very ones who help Big Tobacco.",
            "title_similarity": "0.577799",
            "sentiment_compound": 0.4522
        },
        {
            "id": "gy1cnij",
            "score": 2,
            "text": "This isnt even news. Big oil has lead misinformation campaigns since the idea of climate change was a thing. That's like the 60s/70s.\n\nDoesnt help they fund politicians to specifically misinform people because hey, money",
            "title_similarity": "0.78790015",
            "sentiment_compound": -0.2635
        },
        {
            "id": "gy1g7lm",
            "score": 2,
            "text": "The story of getting lead out of gasoline is literally the template of what is happening now with fossil fuels in general. Hell, they are still using the same law firms in some cases.",
            "title_similarity": "0.63253736",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gy1iesu",
            "score": -2,
            "text": "Please, let’s not just gang up solely on Exxon Mobil. Every single fossil fuel Corp has done the exact same thing.  Every single fossil fuel company needs to be held accountable for this deception.",
            "title_similarity": "0.6114894",
            "sentiment_compound": -0.2675
        },
        {
            "id": "gy1lz3r",
            "score": 2,
            "text": "Our governments will do nothing about it because they’re so old they will be dead by the time the biggger effects of climate change occur, and they are also being paid big sums to speak against it.",
            "title_similarity": "0.6856457",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gy1mevb",
            "score": -2,
            "text": "The idea that consumers shouldn't be blamed for this is horseshit.   If you use more fossil fuels than you need and are not in favor of carbon taxes that would reduce YOUR standard of living, you are at fault.  Stop trying to shift blame onto some corporate bad guy.  \n\n\"You mean old oil company!  If you didn't sell jet fuel I wouldn't be going on vacation!  It's your fault!  If you didn't sell gasoline at the price you do I couldn't afford my SUV and would take public transportation/car pool more!\".\n\nWe haven't had a gas tax hike in like 30 years in the US.   For heating oils, we actually subsidize poorer consumers.  Anyone who is actually concerned about climate change should actually be in strong support of higher gas and carbon taxes, even though they would lead to a decline in our standard of living in the short and medium terms.",
            "title_similarity": "0.75511134",
            "sentiment_compound": -0.8112
        },
        {
            "id": "gy1mhxs",
            "score": -2,
            "text": "I get it, but as consumers aren’t we partially responsible? Don’t buy, no company.",
            "title_similarity": "0.47083306",
            "sentiment_compound": 0.0387
        },
        {
            "id": "gy2givg",
            "score": -4,
            "text": "Wow, if I trusted CNN or anything coming out of Harvard right now, I'd be pretty pissed off.",
            "title_similarity": "0.6280943",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gy0g0gd",
            "score": 175,
            "text": "For decades, ExxonMobil has deployed Big Tobacco-like propaganda to downplay the gravity of the climate crisis, shift blame onto consumers and protect its own interests, according to a Harvard University study published Thursday.\n\nThe peer-reviewed study found that Exxon (XOM) publicly equates demand for energy to an indefinite need for fossil fuels, casting the company as merely a passive supplier working to meet that demand.\n\n\"This is a potentially dangerous technique,\" Geoffrey Supran, a Harvard research associate and one of the study's authors, told CNN Business. \"It narrows our environmental imagination. It makes us see ourselves as consumers first and citizens later -- in a way that protects the status quo, fossil fuels society.\"\nThe study used machine learning and algorithms to uncover trends in more than 200 public and internal Exxon documents between 1972 and 2019.\n\"These patterns mimic the tobacco industry's documented strategy of shifting responsibility away from corporations — which knowingly sold a deadly product while denying its harms — and onto consumers,\" the study concludes. \"ExxonMobil has used language to subtly yet systematically frame public discourse.\"\n\nhttps://www.cell.com/one-earth/fulltext/S2590-3322(21)00233-5?_returnURL=https%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS2590332221002335%3Fshowall%3Dtrue",
            "title_similarity": "0.94388294",
            "sentiment_compound": -0.8555
        },
        {
            "id": "gy0ykx9",
            "score": -15,
            "text": "you can blame Exxon all you want but people want horsepower. if the government raised the CAFE standards to 40mpg or higher it would be pretty easy for the automakers to meet them but people will complain about the lack of power and acceleration and the sudden cost of pickup trucks",
            "title_similarity": "0.71833366",
            "sentiment_compound": 0.431
        },
        {
            "id": "gy1kgij",
            "score": 4,
            "text": "Only an idiot believes that big corporations aren't the real problem, and only an asshole believes that they should take no personal responsibility.\n\nYou can (and should) take personal responsibility AND fight for the real solution.  It's not one or the other.",
            "title_similarity": "0.5611868",
            "sentiment_compound": -0.5487
        },
        {
            "id": "gy1i0rs",
            "score": 5,
            "text": "The funny thing is that you don't really see much climate denying propaganda. It's never in movies, music, mainstream written media or anywhere that would really reach the masses.\n\n\nClimate Change Denial is so rampant in the USA simply because a large segment of the population lack critical thinking skills or are just plain stupid. There is no other reason as to why a grown literate human can deny all evidence and instead believe a Facebook post from their old highschool friend who hasn't achieved a single thing in his life.",
            "title_similarity": "0.6783284",
            "sentiment_compound": -0.818
        },
        {
            "id": "gy1mgll",
            "score": -4,
            "text": "CNN articles in r/science. I didn’t think it would come to this...",
            "title_similarity": "0.4792078",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1z9xb",
            "score": 7,
            "text": "And nothing will happen. See y'all next click.",
            "title_similarity": "0.16309556",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy197jy",
            "score": 77,
            "text": "Everyone knows this.\n\nUnfortunately, they own way too many politicians all over the world for anyone to do anything about it.",
            "title_similarity": "0.4507242",
            "sentiment_compound": -0.4118
        },
        {
            "id": "gy1wjha",
            "score": 7,
            "text": " I don't even know why they bother with propaganda. As long as the legislators who are responsible for regulating this kind of environmentally destructive behavior continue to buy their seat at the table using money from the companies they're supposed to regulate this is just gonna keep on happening.",
            "title_similarity": "0.7549649",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gy29ofb",
            "score": 7,
            "text": "Raping the planet. One lie at a time.",
            "title_similarity": "0.3557912",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gy1fyuq",
            "score": 8,
            "text": "I mean, don’t most oil giants and large-scale gas emitters do everything in their power to shift the blame to the customer?",
            "title_similarity": "0.668897",
            "sentiment_compound": -0.34
        },
        {
            "id": "gy167q4",
            "score": 135,
            "text": "Naomi Oreske's book *Merchants of Doubt* is a must read. Add Jane Mayer's *Dark Money: The Hidden History of Billionaires who funded the rise of the Radical Right* and you would walk away with your worldview changed.",
            "title_similarity": "0.75073457",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gy0vurt",
            "score": 113,
            "text": "Maybe time for a sequel: Thank You For Driving.",
            "title_similarity": "0.3491741",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy0j90e",
            "score": 643,
            "text": "There is a great podcast called Drilled that goes in depth on Exxon. It is depressing knowing that they could've been a huge force of good for the world, but decided oil would be more profitable.",
            "title_similarity": "0.693979",
            "sentiment_compound": 0.8243
        },
        {
            "id": "gy1m500",
            "score": 136,
            "text": "The standout in this article is what isn't published. Which is the amount of money, across the world, these companies pump into lobbying and essentially buying members of government. The depths of cronyism across the globe - that companies like ExxonMobil are directly responsible for - is another huge factor around why they will never face any kind of meaningful sanction.",
            "title_similarity": "0.73959213",
            "sentiment_compound": 0.7787
        },
        {
            "id": "gy0wrwr",
            "score": 3888,
            "text": "Here lies the problem. People can fight tooth and nail, lie, lie some more, cheat and be totally wrong over and over and there are no consequences. They are free to go to the next subject, sow doubt in the masses, claim something will occur on x date and be wrong yet be able to make up an excuse and some eat it up and wait for the next x date.",
            "title_similarity": "0.56797034",
            "sentiment_compound": -0.9516
        },
        {
            "id": "gy105n6",
            "score": 729,
            "text": "According to mashable, BP popularized the term 'carbon footprint' to do the same: \n\nhttps://mashable.com/feature/carbon-footprint-pr-campaign-sham/",
            "title_similarity": "0.5885353",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gy101mo",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "-0.0053591467"
        },
        {
            "id": "gy1cw9v",
            "score": 2,
            "text": "I feel like every couple of months for the past decade there's a new article or study detailing this story. Is this still news?",
            "title_similarity": "0.5415321",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy1d9iv",
            "score": 5,
            "text": "Okay now same question I asked about tobacco: how far along would we be if all that money was spent researching how to fix the problem?",
            "title_similarity": "0.6871842",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gy1e0c5",
            "score": 1,
            "text": "I thought since I stopped using straws that everything is fine now.",
            "title_similarity": "0.2774112",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gy1e4v1",
            "score": 1,
            "text": "So a Rockefeller school was talking bad about a Rockefeller product... Hmmm",
            "title_similarity": "0.55758095",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gy1eaw9",
            "score": 1,
            "text": "So what? We all know this. It’s been proven multiple times over by journalists and researchers. No one is going to do anything about it.",
            "title_similarity": "0.45593417",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy1ehfu",
            "score": 1,
            "text": "Wow. I thought they were half gods who love kittens and children.",
            "title_similarity": "0.30107528",
            "sentiment_compound": 0.8402
        },
        {
            "id": "gy1eig3",
            "score": 1,
            "text": "Is anyone supprized by this?",
            "title_similarity": "0.032455035",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1equo",
            "score": 1,
            "text": "Doesn't matter how else you going to get your toilet paper to wipe your ass",
            "title_similarity": "0.30817765",
            "sentiment_compound": -0.5535
        },
        {
            "id": "gy1fes1",
            "score": 1,
            "text": "They also pretend there are “shortages” so that republicans are more likely to vote in upcoming elections.",
            "title_similarity": "0.57859993",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gy1fj45",
            "score": 1,
            "text": "It isn't just Exon, many corporations do this. Remember the commercials about littering single use plastics being the consumers fault? Granted no one should litter regardless of the material, but those commercials were funded by the companies that make the product.",
            "title_similarity": "0.7001858",
            "sentiment_compound": -0.2382
        },
        {
            "id": "gy1fz74",
            "score": 1,
            "text": "Didn't realize we needed a Harvard study to figure out we're being fucked over by Exxon",
            "title_similarity": "0.6890534",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gy1g11k",
            "score": 1,
            "text": "Is that a floating refinery in the splash photo?",
            "title_similarity": "0.2951815",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1gqgz",
            "score": 1,
            "text": "They should be fined accordingly. How much would that be? Maybe a trillion dollars for a fraction of the consequences of climate change denial? Some lifes in prison?",
            "title_similarity": "0.64997584",
            "sentiment_compound": -0.5913
        },
        {
            "id": "gy1h6et",
            "score": 1,
            "text": "Sounds like the only way this is fixed is by shutting down oil pipelines",
            "title_similarity": "0.4395109",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy1i1ib",
            "score": 1,
            "text": "Someday, a similar report will be published about Big Pharma.",
            "title_similarity": "0.4841445",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1i2bd",
            "score": 3,
            "text": "In a perhaps related tack;\n\n*80 per cent of BP shareholders reject climate proposals to reduce emissions*\n\nhttps://www.cityam.com/bp-shareholders-reject-climate-proposals-to-reduce-emissions/",
            "title_similarity": "0.6751858",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gy1i9x9",
            "score": 2,
            "text": "Yet we all still knowingly buy oil and use electricity.  Disingenuous to imply consumers are blameless.",
            "title_similarity": "0.5482621",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gy1imp7",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.02462982"
        },
        {
            "id": "gy1ioqw",
            "score": 1,
            "text": "Also confirmed. Water, wet.",
            "title_similarity": "-0.036578506",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1iwf3",
            "score": 1,
            "text": "It's time to hold these Bastards Accountable !",
            "title_similarity": "0.27560645",
            "sentiment_compound": -0.6476
        },
        {
            "id": "gy1jpv6",
            "score": 1,
            "text": "They should be sued into oblivion and dismantled completely. It’s time unethical corporations and the people making these decisions were held to account.",
            "title_similarity": "0.5478222",
            "sentiment_compound": -0.552
        },
        {
            "id": "gy1js28",
            "score": 1,
            "text": "Yep, cows farting is one of the greatest threats to global warming. Always fully bought that one as independent research.",
            "title_similarity": "0.64587665",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gy1jyv6",
            "score": 1,
            "text": "It would be so hypocritical of a nation to punish a company for whatever reason when the regulations they set are the ones that allowed such behavior to exist. Countries were built on the back of these companies - don’t blame just the companies, blame the governments too.",
            "title_similarity": "0.66840184",
            "sentiment_compound": -0.9015
        },
        {
            "id": "gy1k9b7",
            "score": 1,
            "text": "Why I am SHOCKED at their disingenuous behavior/s.",
            "title_similarity": "0.1814509",
            "sentiment_compound": -0.4648
        },
        {
            "id": "gy1kd6h",
            "score": 1,
            "text": "Its a shame to see the lack of accountability in any of these large systems. What will these reports / studies do when these were probably the decisions made by the C-suites of a previous generation?",
            "title_similarity": "0.55409735",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gy1knfl",
            "score": 1,
            "text": "When does Harvard do a study on how much impact their own Harvard grads have had on the ad industry or C-suite decision making in general that has accelerated the climate change crisis?",
            "title_similarity": "0.75505674",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gy1ksfg",
            "score": 1,
            "text": "And the government who profits with them, helped them the whole time.",
            "title_similarity": "0.36094275",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gy1kwqd",
            "score": 1,
            "text": "Those responsible should be charged with crimes against humanity.",
            "title_similarity": "0.27213484",
            "sentiment_compound": 0.128
        },
        {
            "id": "gy1kypq",
            "score": 1,
            "text": "We needed a Harvard study to tell us this?",
            "title_similarity": "0.50385743",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1kzez",
            "score": 1,
            "text": "Thank God for Harvard for finally figuring this out for all of us.",
            "title_similarity": "0.3585362",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gy1l7u4",
            "score": 1,
            "text": "In the face of people filling storage containers and plastic bags with gasoline, I have no clue what to do with this information.",
            "title_similarity": "0.35318178",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy1lg09",
            "score": 1,
            "text": "We're not going to help ease climate change. Not with our current capitalist system.",
            "title_similarity": "0.4467291",
            "sentiment_compound": 0.0624
        },
        {
            "id": "gy1ligb",
            "score": 1,
            "text": "Now let’s do big sugar",
            "title_similarity": "0.27980584",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1ljzm",
            "score": 1,
            "text": "Governments and companies do this with  people of poverty...nothing new here...",
            "title_similarity": "0.52059513",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1lv61",
            "score": 1,
            "text": "I'm both shocked and surprised",
            "title_similarity": "0.036007427",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gy1mh2f",
            "score": 1,
            "text": "Isnt this ANY big interest group? Pharma...insurance... just to name a few",
            "title_similarity": "0.46483362",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gy1mk8a",
            "score": 1,
            "text": "I mean, isn't this what all big corporations do?",
            "title_similarity": "0.4345958",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1mvnz",
            "score": 1,
            "text": "These are the same guys that tried to convince us that there was nothing wrong with putting lead into a car engines.",
            "title_similarity": "0.5001759",
            "sentiment_compound": 0.5505
        },
        {
            "id": "gy1mxrw",
            "score": 1,
            "text": "I intentionally avoid ExxonMobil for a variety of reasons, primary among them being the Exxon-Valdez oil spill in their response to it.",
            "title_similarity": "0.60107327",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy1myao",
            "score": 1,
            "text": "You mean like Prager U?",
            "title_similarity": "0.1302044",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy1n90z",
            "score": 1,
            "text": "This is why it is absolutely crucial to teach children that the rich people are bad. Because time and time again they prove that they view us as their enemy, yet society never gives them what they deserve for what they’ve done to us.",
            "title_similarity": "0.6087227",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gy1nmpx",
            "score": 2,
            "text": "Everyone should read “Merchants of Doubt” if they want to know more about this topic. It’s not just the same tactics. In many cases it’s literally the same people.\n\nIts usually a handful of contrarian scientists with no training in the actual relevant field who are the ones spreading the most misinformation.",
            "title_similarity": "0.6074462",
            "sentiment_compound": -0.5413
        },
        {
            "id": "gy1nu1p",
            "score": 1,
            "text": "If they think blame should go to the consumers, then they should be more than happy to see people choosing to move to electric cars, right?",
            "title_similarity": "0.60160726",
            "sentiment_compound": 0.3774
        },
        {
            "id": "gy1odq4",
            "score": 1,
            "text": "When you're making so much money that it money itself doesn't matter so much as legacy, then what do people think is going to happen?! When money doesn't matter, then it stops being a tool and starts being a weapon.",
            "title_similarity": "0.5249306",
            "sentiment_compound": -0.5007
        },
        {
            "id": "gy1ohmd",
            "score": 1,
            "text": "This is news? Haven't we already known this for about 25 years?",
            "title_similarity": "0.35815358",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1ohx9",
            "score": 1,
            "text": "We need to start charging our politicians who take money from lobby groups like this in exchange for knowingly lieing to the American people with treason.",
            "title_similarity": "0.64748967",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gy1osr2",
            "score": 1,
            "text": "We needed to a study for this?",
            "title_similarity": "0.24300429",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1ovxs",
            "score": 1,
            "text": "This comes as no surprise.",
            "title_similarity": "-0.06875559",
            "sentiment_compound": -0.2057
        },
        {
            "id": "gy1pcvy",
            "score": 3,
            "text": "And they will pay Big Tobacco-like damages for what they have done!!\n\n^^Barely ^^anything",
            "title_similarity": "0.51744974",
            "sentiment_compound": -0.5972
        },
        {
            "id": "gy1pwij",
            "score": 1,
            "text": "The fun thing is that big tobacco was just using the big sugar playbook. Its almost like the problem is inherent to to system.",
            "title_similarity": "0.63233405",
            "sentiment_compound": 0.4715
        },
        {
            "id": "gy1pzso",
            "score": 1,
            "text": "Everyone but a Tesla and make them pay!!",
            "title_similarity": "0.39970297",
            "sentiment_compound": -0.2924
        },
        {
            "id": "gy1qh9h",
            "score": 1,
            "text": "The Republican party was 100% behind big tobacco lies and somehow their base never saw through this and realized they had no credibility.  Even after getting caught handing out the lobbying checks on C-SPAN.",
            "title_similarity": "0.6765055",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gy1qoi1",
            "score": 1,
            "text": "And where have you been?",
            "title_similarity": "-0.03356947",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1qvwp",
            "score": 1,
            "text": "I mean, it’s what you would expect though. A big corporation or a big entity like it, like a government, will protect it’s own interests. It is up to us to protect our interests, aka a healthy enviroment by making sure these entities are held accountable for their parts in the climate crisis, and their part in playing it down.",
            "title_similarity": "0.64377296",
            "sentiment_compound": 0.9169
        },
        {
            "id": "gy1r5pf",
            "score": 1,
            "text": "What can YOU do to protect the environment?",
            "title_similarity": "0.14579406",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gy1rf0r",
            "score": 1,
            "text": "Fine them billions and spend it all on developing new tech to remove carbon from the atmosphere at an industrial level.",
            "title_similarity": "0.67387915",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gy1scdk",
            "score": 1,
            "text": "\"We are committed to fighting climate change... as long as we don't have to do anything for it\"",
            "title_similarity": "0.49032807",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gy1sg59",
            "score": 1,
            "text": "Like burying global warming research from 40 years ago 🤔",
            "title_similarity": "0.6099123",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gy1st97",
            "score": 1,
            "text": "Harvard really be pushing out those low-hanging fruit studies amirite?",
            "title_similarity": "0.5836468",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1t3k6",
            "score": 1,
            "text": "Time for everyone to be surprised and for boomers to keep denying facts.",
            "title_similarity": "0.38315326",
            "sentiment_compound": -0.128
        },
        {
            "id": "gy1tgbn",
            "score": 1,
            "text": "Exxon: The sign of the double cross.",
            "title_similarity": "0.37356624",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1u0i3",
            "score": 1,
            "text": "It isn't just big-tobacco like propaganda. Some of the same people worked on both campaigns.",
            "title_similarity": "0.48528093",
            "sentiment_compound": -0.4784
        },
        {
            "id": "gy1uorn",
            "score": 1,
            "text": "This news is like 40 years old...",
            "title_similarity": "0.30790684",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy1uunt",
            "score": 1,
            "text": "Why haven’t national governments conquered this yet?",
            "title_similarity": "0.36872268",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy1vcnm",
            "score": 1,
            "text": "I always wondered why the \"environmentalists\" spent all their time on social media, including Reddit pushing everyone to cut emissions at a personal level instead of coordinating together to protest in larger numbers against the actual \"big business\" pollutants that contribute the most significant amount of pollution that would also have the greatest immediate impact if curbed.\n\nI have solar panels at home, recycle, compost, and I drive less, I still love my meat, but I'm not going to have some long haired hippy tell me about what else I can do to cut emissions ... until I see them on the street protesting the big end of town for once.",
            "title_similarity": "0.7293004",
            "sentiment_compound": -0.4186
        },
        {
            "id": "gy1vfqr",
            "score": 1,
            "text": "True. Still too many people deflecting blame “100 companies are responsible for 80% of emissions” yeahhh if you completely ignore the end user. It’s the same reason third world countries have the biggest plastic pollution",
            "title_similarity": "0.64271986",
            "sentiment_compound": -0.024
        },
        {
            "id": "gy1vqss",
            "score": 1,
            "text": "Aren’t all corporations guilty of this though? When the hell do they care about anything other than profit? That is their endgame. Displays of moral aptitude are just PR stunts.",
            "title_similarity": "0.61188126",
            "sentiment_compound": -0.3939
        },
        {
            "id": "gy1xh4q",
            "score": 1,
            "text": "Totally the consumers fault the Exxon Valdez spilled 11 million gallons of oil into the sea. Damn consumers.",
            "title_similarity": "0.5575442",
            "sentiment_compound": -0.6872
        },
        {
            "id": "gy1xxmq",
            "score": 8,
            "text": "I wish I remembered what the group was called but it was something like ICE. It was formed from former cigarette lobbyist because they were so successful in convincing people to mistrust actual science on cancer and cigarettes.  They were created by ExxonMobil and others. That's why anti climate change efforts were so similar to anti cigarette efforts.  They were the same people using the same strategies.",
            "title_similarity": "0.76887816",
            "sentiment_compound": 0.714
        },
        {
            "id": "gy1y73t",
            "score": 5,
            "text": "Watch the documentary \"Crude\".",
            "title_similarity": "0.30204913",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gy1ytet",
            "score": 1,
            "text": "Worse they've fully admitted this and people still believe the lies",
            "title_similarity": "0.4118082",
            "sentiment_compound": -0.6378
        },
        {
            "id": "gy1z3sk",
            "score": 1,
            "text": "Sad that the movie “thank you for smoking” is not too far from the truth",
            "title_similarity": "0.5042926",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gy1z8jt",
            "score": 1,
            "text": "I find, the fact that this comes as a surprise  to \\*anyone\\*, to be disturbing.",
            "title_similarity": "0.22728601",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy1z9mo",
            "score": 1,
            "text": "You could stop buying gas and plastic, that would fix them!",
            "title_similarity": "0.4660916",
            "sentiment_compound": -0.3595
        },
        {
            "id": "gy1zezy",
            "score": 1,
            "text": "The United States Military is the largest consumer of oil in the World, who would supply them?",
            "title_similarity": "0.583743",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gy2098m",
            "score": 1,
            "text": "What industry doesn't deploy Big Tobacco-like propaganda these days?",
            "title_similarity": "0.5394994",
            "sentiment_compound": -0.25
        },
        {
            "id": "gy20cyi",
            "score": 1,
            "text": "Fantastic.  You knew about it too and here you  are still buying the product.  \n\nPut up or shut up people, the Karen level of complaining isn’t getting it done.",
            "title_similarity": "0.5882914",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gy20z7b",
            "score": 1,
            "text": "We need to destroy the fossil fuel industry immediately. Seize all their assets without compensation and dismantle their operations.",
            "title_similarity": "0.45824215",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gy213bu",
            "score": 1,
            "text": "But who besides right wing supporters believed it?  Who besides them would believe a company founded on fossil fuels would be honest about climate?",
            "title_similarity": "0.6217663",
            "sentiment_compound": 0.8645
        },
        {
            "id": "gy21c7a",
            "score": 3,
            "text": "Remember when sugar companies did the same thing? They blamed fat for making people obese.",
            "title_similarity": "0.6252558",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gy22dt2",
            "score": 1,
            "text": "They were working on a new business, carbon capture technology in which they charge you a fee to offset some of **your** contribution to overall emissions. This enables you to show your gold star to everyone.",
            "title_similarity": "0.68766403",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2303s",
            "score": 1,
            "text": "I wish we would base fines for environmental crimes on a percentage of the value of the damned companies or something. Sick of seeing these greedy world-ruining people profiting from willfully undoing every ounce of effort put into protecting current and future generations. Seeing them always get a slap on the wrist is salt in the wound.",
            "title_similarity": "0.69955206",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gy23r6a",
            "score": 1,
            "text": "Same goes for recycling and any other form of pollution, companies are to blame but make consumers feel the guilt and responsibility. We should all do our part, but we are nothing compared to corporations. It is way past due to charge a carbon tax imo.",
            "title_similarity": "0.7549577",
            "sentiment_compound": -0.5187
        },
        {
            "id": "gy23vm3",
            "score": 1,
            "text": "And 35% of the US ate it up like candy.",
            "title_similarity": "0.4377861",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy24cur",
            "score": 1,
            "text": "To the surprise of no one that reads",
            "title_similarity": "0.0706069",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gy25e2b",
            "score": 1,
            "text": "Merchants of Doubt is about this exact thing!!! Great documentary I would highly recommend it.",
            "title_similarity": "0.31365758",
            "sentiment_compound": 0.7406
        },
        {
            "id": "gy25if3",
            "score": 1,
            "text": "I'm sorry, but calling a *big* *oil* company unethical?? Now that's where I draw the line.",
            "title_similarity": "0.5504124",
            "sentiment_compound": -0.7149
        },
        {
            "id": "gy26fz0",
            "score": 1,
            "text": "If you’re part of the machinery that powers this, I urge you not to continue to do it.",
            "title_similarity": "0.35293257",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy26xlo",
            "score": 1,
            "text": "Yeah consumers are the least of the worries. Go after these big companies and the worst countries like India and China.",
            "title_similarity": "0.61144507",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gy27hij",
            "score": 1,
            "text": "The check is due for climate change...they led consumers astray, PURPOSEFULLY!\nBecause of that FACT, they must lead the charge, AT LEAST financially, to tackle the disastrous future that awaits humanity. \n\nIF EXXONMOBIL AND THE REST OF THESE COMPANIES WONT GO UP TO BAT TO SAVE THE PLANET FROM SOMETHING THEY CAUSED; THEN THEY SHOULDN’T BE ALLOWED TO PROFIT FROM EXPLOITING IT!",
            "title_similarity": "0.7024474",
            "sentiment_compound": 0.2304
        },
        {
            "id": "gy286zr",
            "score": 1,
            "text": "Retailers are also part of the problem.  Kroger has replaced 2/3 of their loose produce aisle with cold cases of packaged vegetables, using single use plastic.  Bagged lettuce, etc. \n\nSingle use plastic like this is almost never recycled and ends up in landfills and the ocean. Thanks Kroger.",
            "title_similarity": "0.6109811",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gy29jbu",
            "score": 1,
            "text": "And there going to get away with absolutely no consequences to the suprise of noone.",
            "title_similarity": "0.22260831",
            "sentiment_compound": -0.3597
        },
        {
            "id": "gy2a96i",
            "score": 1,
            "text": "It sucks we have to do studies to show what is obvious to anyone who cares and won't get any attention from anyone who doesn't.",
            "title_similarity": "0.41973448",
            "sentiment_compound": 0.128
        },
        {
            "id": "gy2acd6",
            "score": 1,
            "text": "As well as the plastics industry.\n\nhttps://www.pbs.org/wgbh/frontline/film/plastic-wars/",
            "title_similarity": "0.43962026",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gy2aokb",
            "score": 1,
            "text": "The environment would be fine if only a few more of you recycled!  *shakes fist*",
            "title_similarity": "0.49154583",
            "sentiment_compound": 0.2714
        },
        {
            "id": "gy2apr5",
            "score": 1,
            "text": "Shocking absolutely no one.",
            "title_similarity": "0.019431435",
            "sentiment_compound": -0.6361
        },
        {
            "id": "gy2cfm3",
            "score": 1,
            "text": "So it’s official now it was published by Harvard? We’ve known this for years….",
            "title_similarity": "0.45962232",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2d6xj",
            "score": 1,
            "text": "and guess what university’s endowment was heavily invested is said equities???",
            "title_similarity": "0.47506475",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2d8pt",
            "score": 3,
            "text": "https://www.bbc.co.uk/programmes/m000l7q1\n\nPretty good BBC podcast called “How they caused us to doubt everything” covers some tactics of the industry as a whole. Definitely worth a listen if you are interested",
            "title_similarity": "0.63545007",
            "sentiment_compound": 0.872
        },
        {
            "id": "gy2e3o9",
            "score": 1,
            "text": "Big Sugar, Big junk food, Big meat, and big pharma have all been doing the same thing in their respective areas..\n\nThey're all raking in billions at the cost of human lives, animal lives and the planet",
            "title_similarity": "0.5916028",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gy2ecdx",
            "score": 1,
            "text": "Isn’t it weird that we blame/shame big oil as though it’s their fault that we’re addicted to their product like we do big tobacco? The “nicotine “ of big oil is our addiction to cars, plastic, travel, the good life in general. Big oil exists because we all demanded it!",
            "title_similarity": "0.7065985",
            "sentiment_compound": 0.1007
        },
        {
            "id": "gy2ekuf",
            "score": 1,
            "text": "They had plenty of help from the GOP, never ones to let morality get in the way of profit.",
            "title_similarity": "0.39996356",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gy2ew1i",
            "score": 1,
            "text": "Shocker...same as most recycling programs (at least in Canada). The corporations and business put the weight of recycling on the consumer... instead of you know producing something that is better for the environment. Half the stuff we throw in the recycle bin isn’t even recyclable.",
            "title_similarity": "0.7171682",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gy2eyre",
            "score": 1,
            "text": "> The peer-reviewed study found that Exxon (XOM) publicly equates demand for energy to an indefinite need for fossil fuels, casting the company as merely a passive supplier working to meet that demand.\n\nThis is the main point of the article/study. It means that ExxonMobil says \"we supply the energy the world demands\".\n\nExxonMobil does not create demand for energy, it just fulfills it using Oil & Gas sources. Consumers are the ones buying it. Who's to blame here?",
            "title_similarity": "0.73652184",
            "sentiment_compound": 0.5033
        },
        {
            "id": "gy2fmsc",
            "score": 1,
            "text": "....according to a Harvard University study... and countless other studies released even before the two companies merged??!",
            "title_similarity": "0.5921063",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2fo3b",
            "score": 1,
            "text": "Damn, that ship looks true evil giant machine!",
            "title_similarity": "0.31762642",
            "sentiment_compound": -0.68
        },
        {
            "id": "gy2fp8t",
            "score": 1,
            "text": "What a lot of people might take away from this is that fossil fuels have been trying to suppress the availability of renewables. This isn’t even the issue. Until we address our demand and consumption, nothing will change as far as abating pollution and remediating the social effects of climate change.",
            "title_similarity": "0.702261",
            "sentiment_compound": -0.128
        },
        {
            "id": "gy2fqsx",
            "score": 1,
            "text": "Heres the official statement from every major polluter:\n\n“Here’s how YOU can do YOUR part!”",
            "title_similarity": "0.45526037",
            "sentiment_compound": -0.5244
        },
        {
            "id": "gy2g2xw",
            "score": 1,
            "text": "There are no depths companies will not sink to for profit.",
            "title_similarity": "0.3363772",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gy2g46d",
            "score": 1,
            "text": "Thursday of this year? I could’ve sworn this has been known for at least a couple of decades?",
            "title_similarity": "0.4993768",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2glo6",
            "score": 1,
            "text": "I want to see everyone who works for this shameful company tried and jailed for life for crimes against humanity. Yep, even those selling EM products at petrol stations. From the very top to the very bottom. All suppliers are culpable.",
            "title_similarity": "0.5156977",
            "sentiment_compound": -0.5199
        },
        {
            "id": "gy2hctb",
            "score": 1,
            "text": "It's a large corporation... what did you expect?",
            "title_similarity": "0.33703017",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2hylz",
            "score": 1,
            "text": "Crimes against humanity",
            "title_similarity": "0.17316782",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2ie8c",
            "score": 1,
            "text": "They’ve been burying patents on influential energy tech for over a century.  Not surprising at all.",
            "title_similarity": "0.65080595",
            "sentiment_compound": 0.4915
        },
        {
            "id": "gy2ifcu",
            "score": 1,
            "text": "This happens with just about all companies and all industries.\nYes it's wrong but it happens,a company can commit 100 reports all with slightly different modifiers etc. And can use the most positive one do defend their point.",
            "title_similarity": "0.5474249",
            "sentiment_compound": 0.8376
        },
        {
            "id": "gy2jcvy",
            "score": 1,
            "text": "Humans have this obsession about kicking things down the road, for somebody else to deal with. Be that just down the road or down the decade. Or further down the Century. The fat cats want the fat because they know they are existential beings that will never face any judgement.",
            "title_similarity": "0.56526333",
            "sentiment_compound": -0.3506
        },
        {
            "id": "gy2jiwx",
            "score": 1,
            "text": "where exactly is their headquarters?",
            "title_similarity": "0.060865037",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2jo2b",
            "score": 1,
            "text": "So do plastic companies",
            "title_similarity": "0.17920573",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2k309",
            "score": 1,
            "text": "40% of global emissions are caused by 12 corporations, most of which are petroleum companies",
            "title_similarity": "0.5595697",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2koyp",
            "score": 1,
            "text": "But don't punish them or anything...",
            "title_similarity": "0.10929467",
            "sentiment_compound": 0.5667
        },
        {
            "id": "gy2nemd",
            "score": 1,
            "text": "Like every big company",
            "title_similarity": "0.21730322",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy2ngmy",
            "score": 1,
            "text": "No surprises there then. We always thought that this was the case. I guess this study has proved this to actually be the case.\n\nTime to move on now and develop renewable energy sources.\n\nExxon should use its financial muscle to help develop and expand renewable sources of energy to replace the use of oil for that purpose.",
            "title_similarity": "0.6452829",
            "sentiment_compound": 0.7604
        },
        {
            "id": "gy2of65",
            "score": 1,
            "text": "I mean thats bad but what's worse is starting wars to jack up oil prices.  That is not talked about enough.",
            "title_similarity": "0.56414723",
            "sentiment_compound": -0.9062
        },
        {
            "id": "gy2p33g",
            "score": 1,
            "text": "I explain that to everyone that companies spend money to put the blame for climate change on single people while they are capable of making single decisions that can change the world Way more than millions of people together. \n\nAnd they avoid paying taxes. And we make big eyes when watching futuristic movies where elite lives separated from working class... It's not thar futuristic and impossible as we think, we will see when the resources will be heavily limited",
            "title_similarity": "0.7881286",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gy2pg9z",
            "score": 1,
            "text": "Freeze all stock sales and make it **pay damages** all the way into bankruptcy ?\n\nNo? A tone deaf apology and golden parachutes then.",
            "title_similarity": "0.5613287",
            "sentiment_compound": -0.504
        },
        {
            "id": "gy2pops",
            "score": 1,
            "text": "They should be fined a % of their revenues for each year they lied. Maybe would they go bankrupt? Good riddance.",
            "title_similarity": "0.66165805",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gy2prs1",
            "score": 1,
            "text": "When you see vegans piping on about how much meat eating costs in carbon, now you know where there getting their directions from. Now you know where the idea that _consumers_ are to blame comes from",
            "title_similarity": "0.62225413",
            "sentiment_compound": -0.34
        },
        {
            "id": "gy2ptso",
            "score": 1,
            "text": "Wait until Harvard University finds out that the United States is an oligarchy.",
            "title_similarity": "0.558104",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gy2q2au",
            "score": 1,
            "text": "There's a really good YouTube channel called Climate Town who has a video on this.",
            "title_similarity": "0.37729013",
            "sentiment_compound": 0.4927
        },
        {
            "id": "gy2qily",
            "score": 1,
            "text": "Yet fishing is still much much worse for ocean life, than anything Exxon could achieve.",
            "title_similarity": "0.4470917",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gy2qod5",
            "score": 1,
            "text": "Its fine\n\nThey can count their dollars when everything is dead",
            "title_similarity": "0.386097",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gy2rmas",
            "score": 1,
            "text": "But please don't consider this a motivation to start burning your trash",
            "title_similarity": "0.31495208",
            "sentiment_compound": 0.7227
        },
        {
            "id": "gy2rnz9",
            "score": 1,
            "text": "Is... this not common knowledge by this point?\n\nAll the industries do this, including but not limited to plastics production.",
            "title_similarity": "0.4530388",
            "sentiment_compound": 0.2498
        },
        {
            "id": "gy2ronh",
            "score": 1,
            "text": "The oil companies exploited the poor like the rich have always screwed the poor.",
            "title_similarity": "0.5883866",
            "sentiment_compound": -0.743
        },
        {
            "id": "gy2sgvk",
            "score": 1,
            "text": "I don’t trust Harvard after they called my mom a birthing person. Seems biased.",
            "title_similarity": "0.5947561",
            "sentiment_compound": 0.296
        },
        {
            "id": "gy2sugg",
            "score": 1,
            "text": "EXTREMELY unsurprising, unfortunately. \nBut it's great that someone has documented it in a study now. It's a step in the right direction to hold them accountable. If not legally then to make the public know who to boycott.  This is truly cartoon levels of evilry when they so clearly are working on the \"dark side\" against the entire planet to suit their own interests.\nOf course, about 50% of Americans think they are doing God's work fighting the good fight against the libs. I wonder of that has anything to do with why they can keep doing this so openly.",
            "title_similarity": "0.66609746",
            "sentiment_compound": 0.8848
        },
        {
            "id": "gy2t3gk",
            "score": 1,
            "text": "Every single person responsible for this should be behind bars for the rest of their lives.",
            "title_similarity": "0.3415746",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gy2t87a",
            "score": 1,
            "text": "Isn't this like known since the 70's? I swear reading an article years ago that fossil fuels knew it was horrible in the 70's but buried and hid it for decades.",
            "title_similarity": "0.7685399",
            "sentiment_compound": -0.5431
        },
        {
            "id": "gy2te78",
            "score": 1,
            "text": "I’m shocked, shocked I say. Well not that shocked",
            "title_similarity": "0.08449731",
            "sentiment_compound": -0.1376
        },
        {
            "id": "gy2tnsg",
            "score": 1,
            "text": "We just need to hold Multi-national corporations accountable. No one really understands the amount of wealth corporations like Exxon and Marlboro have. And Marlboro isn’t even the parent company. HA. :(",
            "title_similarity": "0.64923227",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gy2tpa9",
            "score": 1,
            "text": "What next? A study on the toilet habits of bears?\n\nHarvard should be looking into things that we don't all already know",
            "title_similarity": "0.5351821",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2tsj6",
            "score": 1,
            "text": "##It's the same thing animal agriculture is doing too!\n\n##Every thing they say are from, of or by the industry!",
            "title_similarity": "0.3212279",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2upht",
            "score": 1,
            "text": "Same happening right now with crypto (It's the miners fault!\")",
            "title_similarity": "0.45177868",
            "sentiment_compound": -0.4574
        },
        {
            "id": "gy2w9zu",
            "score": 1,
            "text": "So quit incentivising company staff and shareholders to behave in this way.",
            "title_similarity": "0.49013478",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy2wdgf",
            "score": 1,
            "text": "No need of a research paper, people know it.",
            "title_similarity": "0.22626226",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy2x79g",
            "score": 1,
            "text": "Damn how does that compare to countries like china and india who produce the largest amounts of pollution by a significant amount",
            "title_similarity": "0.49475026",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gy2xhe8",
            "score": 1,
            "text": "I remember what it was like, to be a kid... I used, to think all that mattered was food, cartoons and playing with my friends. The worst thing was a beating, Street dogs that tried to bite you and that's about it.\n\nAs an adult, I can think about is how, every adult I know is trying to murder me. Governments, people who think differently and anyone whose making money. Life is a God damn joke.",
            "title_similarity": "0.5312718",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gy2xrlu",
            "score": 1,
            "text": "What!? A big corporation being evil?! WHAT!? IT CANT BE TRUE! ESPECIALLY NOT AN AMERICAN COMPANY! AAAAAAAAAAAAH",
            "title_similarity": "0.4161631",
            "sentiment_compound": -0.8745
        },
        {
            "id": "gy2xslw",
            "score": 1,
            "text": "What do you even do about this? These people have spent decades destroying the planet, despite the fact that they knew what would happen if they did. \n\nThere must be some justice. There must be some accountability. These people should not be allowed to simply enjoy their blood money.",
            "title_similarity": "0.6510694",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gy2xtid",
            "score": 1,
            "text": "ALL MY HOMIES HATE EXXONMOBIL!  \n\n\n(like for real, when do we start charging these oil execs with murder?)",
            "title_similarity": "0.58264184",
            "sentiment_compound": -0.837
        },
        {
            "id": "gy2yxqz",
            "score": 1,
            "text": "What new information is in this study?",
            "title_similarity": "0.21885823",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy30vak",
            "score": 1,
            "text": "From 2012-16, Geoffrey Supran co-led the fossil fuel divestment campaign at MIT,",
            "title_similarity": "0.6489094",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy32uc5",
            "score": 1,
            "text": "Yep, and still trying to blame beef.  Tsk, tsk.",
            "title_similarity": "0.40105087",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gy33c1n",
            "score": 1,
            "text": "big corporations shifting responsibilities to protect their own interests? who could've forseen such a twist?",
            "title_similarity": "0.61039126",
            "sentiment_compound": 0.6072
        },
        {
            "id": "gy3453c",
            "score": 1,
            "text": "We need to destroy the fossil fuel industry immediately. Tax them out of existence and seize all their assets without compensation. They are the enemy of the people",
            "title_similarity": "0.5320456",
            "sentiment_compound": -0.743
        },
        {
            "id": "gy34pvq",
            "score": 1,
            "text": "I vaguly remember the controversy over leaded gas. I suspect the Tabacco industry copied the oil industry .",
            "title_similarity": "0.69142807",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy38w8f",
            "score": 1,
            "text": "Well at least there’s a Harvard study to go with what common sense and basic observation already did for some of us.",
            "title_similarity": "0.48253673",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gy39fmk",
            "score": 1,
            "text": "We can't handle the truth, apparently",
            "title_similarity": "0.0943842",
            "sentiment_compound": -0.2411
        },
        {
            "id": "gy39sh5",
            "score": 1,
            "text": "Corporations have been doing the same in regards to recycling too. Pushing the onus on consumers instead of taking responsibility.",
            "title_similarity": "0.7175242",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy3ca05",
            "score": 1,
            "text": "Hasn’t this been common knowledge for a long time now?",
            "title_similarity": "0.24922493",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy3cyan",
            "score": 1,
            "text": "Well, I mean we do keep buying their products, like a lot of it.  We are creating the climate crisis, not them. When it suddenly goes we get situations like what's happening in the south east right now or in Texas not too long ago during that cold storm.  That's how these companies make money.  Why they need subsidies is beyond me though, they clearly don't need them.",
            "title_similarity": "0.7893572",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gy3fb0m",
            "score": 1,
            "text": "Imagine being so evil you don’t divulge an existential threat to humanity rather you pivot to misinformation crippling any attempt to avert it.  I mean there’s being greedy but this is next level.",
            "title_similarity": "0.51160645",
            "sentiment_compound": -0.7997
        },
        {
            "id": "gy3g3er",
            "score": 1,
            "text": "But this isn’t anything new a lot of people knew about these tactics (obviously some people don’t) but all that’ll happen is it will be debated by a factual journalist and a bad faith journalist in the pay of Exxon on some debate show and nothing will change",
            "title_similarity": "0.64312965",
            "sentiment_compound": -0.3919
        },
        {
            "id": "gy3hjlq",
            "score": 1,
            "text": "What? One of the biggest oil companies on earth has been involved in a disinformation campaign? \n\nwHo EvEr WoUlD hAvE gUeSsEd",
            "title_similarity": "0.64942336",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy3j2qe",
            "score": 1,
            "text": "I hate CNN but props to them for covering this issue, I’m sure a lot of the media is pressured to not cover topics like this.",
            "title_similarity": "0.5682864",
            "sentiment_compound": -0.5291
        },
        {
            "id": "gy3jc8u",
            "score": 1,
            "text": "Just look at how insane people can be about recycling. That's big oil propaganda hard at work! Recycling is a joke.",
            "title_similarity": "0.59138185",
            "sentiment_compound": -0.4926
        },
        {
            "id": "gy3jrfp",
            "score": 1,
            "text": "This sounds like the republican party.",
            "title_similarity": "0.320077",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gy3lir3",
            "score": 1,
            "text": "We've known this.  The climate report came out in the 70's.  They've been suppressing the truth for almost fifty years now.",
            "title_similarity": "0.66863775",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gy3mdps",
            "score": 1,
            "text": "We need Nuremberg style trials for the people responsible for this.",
            "title_similarity": "0.3842808",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gy3mx0z",
            "score": 1,
            "text": "Science created climate change and it will be science's job to fix it. Not my problem and I refuse to pay a penny into this corporate welfare.",
            "title_similarity": "0.6501787",
            "sentiment_compound": 0.1675
        },
        {
            "id": "gy3ntnf",
            "score": 1,
            "text": "Econ101 when we were studying the taxing models of burden was extremely confusing for me bc I never understood why the default was 'every tax on the company would be put onto the consumer through raised prices so the tax burden *should* be placed on the consumer.\n\n\nCome to find out he was a massive oil and gas guy that helped pave the way for private natural gas companies and storage of gas in old wells. \n\n...",
            "title_similarity": "0.7840999",
            "sentiment_compound": -0.5799
        },
        {
            "id": "gy3q70x",
            "score": 1,
            "text": "shifting blame onto consumers, which is why climate greta gets such backlash. she's yelling at us about what the people who give her the podium are doing.",
            "title_similarity": "0.6249485",
            "sentiment_compound": -0.34
        },
        {
            "id": "gy3xgwi",
            "score": 1,
            "text": "Tobacco use doesn't hurt anyone else but the users, though.  This is much, much worse.",
            "title_similarity": "0.45689362",
            "sentiment_compound": -0.5043
        },
        {
            "id": "gy3xiag",
            "score": 1,
            "text": "Big oil was hiring scientist back in the 60's and 70's to research global warming then, so they could come up with propaganda against it. We need laws against actions that are not in the best interest of humanity.",
            "title_similarity": "0.7862834",
            "sentiment_compound": -0.1945
        },
        {
            "id": "gy41dog",
            "score": 1,
            "text": "I worked as a cashier for ExxonMobil for a little under a year. The manager would go to the gas sign (the one that shows the price) and change it daily, sometimes shooting the price up by a dollar or more each day. I questioned this until I was told to get a stack of paper work from the office. Inside I saw papers detailing how the manager should price things, to double the profit for half the cost. Bathrooms Uncleaned for weeks because of ‘policy’ drinks, food and sometimes medical items rotting on the shelf and unable to be changed until it’s sold… I tried to ask my boss why this was happening, but was fired only 10 minutes after asking. \n\nEdit: I type bad.",
            "title_similarity": "0.7527051",
            "sentiment_compound": -0.872
        },
        {
            "id": "gy41nxz",
            "score": 1,
            "text": "I am shocked! I am shocked that an industry that makes money by destroying the planet voluntarily does not have a moral compass…",
            "title_similarity": "0.54647076",
            "sentiment_compound": -0.8172
        },
        {
            "id": "gy41wn1",
            "score": 1,
            "text": "*pretends to be surprised*",
            "title_similarity": "0.1619741",
            "sentiment_compound": 0.128
        },
        {
            "id": "gy4be64",
            "score": 1,
            "text": "What happens when a city bans cars from its streets?\n\nhttps://www.bbc.com/future/article/20191011-what-happens-when-a-city-bans-car-from-its-streets",
            "title_similarity": "0.5327694",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy4ddvs",
            "score": 1,
            "text": "This is the least surprising thing that anyone has ever heard. Worst thing is those oil baron troglodytes are rich enough for the climate crisis to only minimally affect them.",
            "title_similarity": "0.5373863",
            "sentiment_compound": -0.7517
        },
        {
            "id": "gy4dfq9",
            "score": 1,
            "text": "I want to see arrests and property seized. The amount of death these people’s decisions have indirectly caused is unconscionable. War criminals have done less.",
            "title_similarity": "0.5781754",
            "sentiment_compound": -0.9337
        },
        {
            "id": "gy4ms87",
            "score": 1,
            "text": "This sounds like a plot for Austin Powers 4 because it reminds me of when #2 made more money as a Starbucks investor but Dr. Evil wouldn't have it! \n\n\\#2: \"While you were frozen, we stopped putting money into false consumer advertising and invested it in a few small solar and hydrogen fuel cell companies. Our conglomerate now controls 86% of the energy sector, saves the environment, and helped make us the first TRILLION dollar company.\"\n\nDr. Evil: \"I DON'T know where you got YOUR evil doctorate from but I am planning on continuing the misinformation campaign while poisoning my kids water and watching my family summer home get taken over by the ocean. I am going to pollute the air, watch the cancer rates continue to rise, and pay lobbyists to keep our control on government while we make MILLIONS!   BWAAA HAAA HAA HAAAAAA\"\n\nScott: \"A Trillion is more than a Million numb nuts!\"",
            "title_similarity": "0.82959354",
            "sentiment_compound": -0.9937
        },
        {
            "id": "gy4s72s",
            "score": 1,
            "text": "So can we stop blaming consumers now? Also these same tactics are used throughout all industries. People in power will know something isn’t right or true but pursue it anyway regardless of the impact on the planet or lives.",
            "title_similarity": "0.6555764",
            "sentiment_compound": -0.2339
        },
        {
            "id": "gy5i2q2",
            "score": 1,
            "text": "I’m sorry, is anyone actually surprised? Seriously...",
            "title_similarity": "0.08867198",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gy629d5",
            "score": 1,
            "text": "because lining the pockets of souless CEO > anything",
            "title_similarity": "0.39425057",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy6mg0c",
            "score": 1,
            "text": "If you’re going to a criminal... be a global corporation or a government.... there are no consequences if your crimes are big enough.\n\nThink big, and lie big...oxycontin, mortgage debt swaps, climate denial, and weapons of mass destruction,  plastic food liners, pandemic denial. \n\nThis is what our society has taught me in the last 50 years, not exactly what I wanted to learn. \n\n “Ok Pinky time to take over the world”",
            "title_similarity": "0.79703724",
            "sentiment_compound": -0.9287
        },
        {
            "id": "gydionb",
            "score": 1,
            "text": "I don't wanna be too pessimistic, but this is gonna be a huge pain to deal with later on.",
            "title_similarity": "0.37509662",
            "sentiment_compound": -0.5023
        }
    ]
}