{
    "Studying science isn’t what makes students less religious: College majors that focus on inquiry rather than applying knowledge are more likely to secularize students, according to a new study that breaks with the traditional claim that exposure to science leads people away from religion.\n": [
        {
            "id": "gy7bitv",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.68423045",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gy7bp47",
            "score": 26,
            "text": "I'm always amazed how people, especially educated ones, still believe in 2021 in gods. We went to the moon but we are still in the stone age at the same time",
            "title_similarity": "0.39835304",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gy7z9vu",
            "score": -6,
            "text": "It is a false dichotomy that one must embrace either science or religion.  They complement each other.  For a serious look at this, I like the Biologos folks:\n\n[https://biologos.org/](https://biologos.org/)",
            "title_similarity": "0.64914346",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gy7cv17",
            "score": -11,
            "text": "I hope they find what leads people to be non religious. And then use it.",
            "title_similarity": "0.57890415",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gy83q5s",
            "score": 1,
            "text": "I've found that people who believe science and religion are mutually exclusive tend to understand neither.",
            "title_similarity": "0.67563367",
            "sentiment_compound": 0.128
        },
        {
            "id": "gy81r5n",
            "score": -4,
            "text": "This whole article and the idea that science ever was the issue is bogus BS.  Asking questions is literally forbidden as unquestioning obedience is required for *any* religions to not fall apart.  So questioning anything is considered rude and a lack of faith- no religious believer learns about science and thinks God is too stupid to come up with science.  No, they start to *question* who came up with anything, and that's why religious control hinges heavily on critical thinking skills.  Can't control people with your ideas if they can form their own.",
            "title_similarity": "0.70191234",
            "sentiment_compound": -0.8993
        },
        {
            "id": "gy7yrqs",
            "score": -1,
            "text": "That makes total sense. Science isn’t the opposite of religion. Reason is.",
            "title_similarity": "0.49736953",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy7s28w",
            "score": 1,
            "text": "Christians being Christians cured my Christianity but good.",
            "title_similarity": "0.52885467",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gy7xnal",
            "score": 2,
            "text": "Learning about the Holocaust made completely abandon religion. No god would let something so evil happen.",
            "title_similarity": "0.5629504",
            "sentiment_compound": -0.8849
        },
        {
            "id": "gy7w1gl",
            "score": 42,
            "text": "Science has actually led me to the opposite.   \n\nI've become very religious due to science.\n\nI understand the sociology behind many religions, and as long as I understand that it's supposed to be an allegory for humanity, and not something to be taken literally, it's kind of poetic. \n\nMany ancient cultures had this sort of allegory to make sure that people would try to critically think rather than just accept what's being told to them at face value.   As long as you understand the science of religion, it makes sense. \n\n  But if you go \"blah blah blah 6000 years\" you don't really understand the science of religion. Either if you believe in the 6000 year stuff, or you believe every other believer believes in the 6000 years stuff, then don't believe in the science of religion.",
            "title_similarity": "0.7553499",
            "sentiment_compound": 0.09
        },
        {
            "id": "gy7fz1l",
            "score": -3,
            "text": "Doesn't this study make the mistake of assuming the premise that people *become* secular, but are *born* religious? \n\nIsn't the reverse more likely?",
            "title_similarity": "0.7274994",
            "sentiment_compound": -0.264
        },
        {
            "id": "gy7x2zi",
            "score": -15,
            "text": "I think more you learn crazy thing like quantum mechanic, there will be higher probability that it seems to have some kind of intelligence creatures who designed all these crazy things",
            "title_similarity": "0.632485",
            "sentiment_compound": 0.0627
        },
        {
            "id": "gy801gk",
            "score": -2,
            "text": "“The first gulp from the glass of natural sciences will turn you into an atheist, but at the bottom of the glass God is waiting for you.”\n\n- Werner Heisenberg",
            "title_similarity": "0.6606696",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gy86t22",
            "score": 7,
            "text": "People seem to have forgotten that the greats like Galileo were funded by the church.  The church was a leader in science research for a very long time.",
            "title_similarity": "0.62768686",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gy80jjj",
            "score": 2,
            "text": "Makes sense, asking questions about your religion is a fast track to abandoning said religion.  \n\nBecause religion is not supposed to be about knowledge it's meant to be a way to guide your morality.\n\nAnd that is done by use of fantasy and threat of fantasy punishment. (Exactly like how we tell kids to be good or Santa won't being presents)",
            "title_similarity": "0.73912287",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gy7k66n",
            "score": 10,
            "text": "Religious Studies classes made me an atheist.",
            "title_similarity": "0.5264129",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy7gata",
            "score": 42,
            "text": "Reading the Bible made me an instant atheist.",
            "title_similarity": "0.46282637",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy7wh6x",
            "score": 6,
            "text": "So, critical thinking?",
            "title_similarity": "0.17554191",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy813wx",
            "score": -2,
            "text": "All the science in the world now and forever will never explain WHY. Why are we here?",
            "title_similarity": "0.36892748",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy83azv",
            "score": -1,
            "text": "Firstly spirituality and religion are different. As a doctor, with a masters degree I feel I am spiritual. One cannot look at life and death on a day to day basis and not wonder about it all. However, I am hardly religious. But I do understand why some may need religion still. There was an evolutionary need for religion in the days of yore. It allowed disparate people to co-operate on the basis of mutual trust in a God that would punish them if they were supposedly unkind to fellow tribesman, cheated, or allowed crimes (/sins) to go unchecked. Additionally, people believed lives would be better if people abided by rules laid down to protect communities by the sacred texts. This would have been helpful in the absence of external laws which governed lives. As more and more people, and countries accepted the separation of religion from state affairs, the evolutionary benefits of believing in a omniscient/ omnipotent God became immaterial. I believe, it is this acceptance of human laws and morality over what scriptures say that has made people less religious than anything else. It is a absence of the necessity of religion in our day to day lives rather which has made people turn away.",
            "title_similarity": "0.7602692",
            "sentiment_compound": 0.9118
        },
        {
            "id": "gy7ynqd",
            "score": 32,
            "text": "When will people learn that science and religion can co exist comfortably",
            "title_similarity": "0.61006993",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gy7w9c5",
            "score": 4,
            "text": "The best way to become less religious is to spend time with religious people.",
            "title_similarity": "0.5600823",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gy7slot",
            "score": 0,
            "text": "Inquiry - the bane of gods",
            "title_similarity": "0.28460288",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy84sen",
            "score": 2,
            "text": "Watch the conservatives come after inquiry now. It’s literally the basis of critical thinking and free thought in education.",
            "title_similarity": "0.545372",
            "sentiment_compound": 0.25
        },
        {
            "id": "gy7vyhx",
            "score": 58,
            "text": "I'm religious and heavily into science, never understood why such trope ever existed",
            "title_similarity": "0.5251708",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy7vmbl",
            "score": 18,
            "text": "Religion is good for the comfort of your soul at least. What sucks about religions is the ones who are extremists . I like what I understand about religion and also I love the science. I think you can love both if you understand that one is for the mind and one is for the comfort of your soul.",
            "title_similarity": "0.65508014",
            "sentiment_compound": 0.946
        },
        {
            "id": "gy80jko",
            "score": 4,
            "text": "If exposure to science doesn’t lead away from religion the. Science isn’t doing it’s job",
            "title_similarity": "0.7712842",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy89ef3",
            "score": 4,
            "text": "People should be lead away from religion.",
            "title_similarity": "0.46076238",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy7m8ii",
            "score": 9,
            "text": "It seems to me that both studying science, and focusing on inquiry, would turn people away from religion, because both rely on evidence, which is missing in religion.",
            "title_similarity": "0.82351947",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy7z02q",
            "score": 4,
            "text": "People tend to try to say they aren’t mutually exclusive but if you apply science to religion it quickly makes religion seem outdated and simply not true.",
            "title_similarity": "0.77286255",
            "sentiment_compound": -0.4114
        },
        {
            "id": "gy82sy3",
            "score": -2,
            "text": "Any reasonable flexion of cognitive processes will yield a distrust of religion. Having the answer precludes you from finding the answer. In this case, the thinking is outsourced to an organization who has no business operating in high-cognitive-function. It's literally the blind leading the blind.\n\nSo yeah, if you're smart, religion's not for you.",
            "title_similarity": "0.7312666",
            "sentiment_compound": -0.5905
        },
        {
            "id": "gy7ywkq",
            "score": -13,
            "text": "Is every post in this science sub politics?\nSeriously \nAnyone ever heard of science?\nPost a photo of a galaxy or something",
            "title_similarity": "0.42689347",
            "sentiment_compound": -0.264
        },
        {
            "id": "gy8eemy",
            "score": 15,
            "text": "While this is an interesting study, I think the type of study and how it is presented is more of an explanation of the divide in America. First, know my bias, I am currently a teacher of Physics in the south with degrees in both Physics and Philosophy and Religion. However, I maintain strong religious beliefs and have been a pastor before. I see no conflict between Science, Inquiry research, or Christianity. Only different conclusions that take a leap of faith, even in science. Science is supposed to be about the questioning and systematically testing of the world. The drawing of conclusions has often been the biggest jump and error of scientific study especially when other test conflict with the finds or it is not repeatable. Newton tested and concluded that light was a particle, even though countless others did different test to show it was a wave, his conclusion was not fully over turned until Einstein that came up with the duality for light. In this article we are given a sample size that looks very impressive until you realize that it is only about 0.77% of the American college population and it relied on individuals being willing to take surveys and to do so honestly. Now this doesn’t mean it does not have some merit but it does mean that this is not something as certain as gravity that you can repeat any where any time and get the same results. The end conclusion takes a educated leap of faith that may hold true or may not, more will have to be done to really see and it might not take place in our lifetime. Yet, so many people read science and never question it again. Science is meant to be questioned and tested. In the same light I grew in my Faith by questioning what my parents taught and believed in my teens before ever going to college. Question and testing things is not a problem in either science nor religion but instead absolute rigidity is the problem. As long as people are mocked for questioning science it is nothing more than a new religion. Instead we must teach them how to test and evaluate scientific finding to see what is more conclusive than opinionated findings.",
            "title_similarity": "0.67377913",
            "sentiment_compound": 0.7882
        },
        {
            "id": "gy9f6vd",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.09318471"
        },
        {
            "id": "gy7n495",
            "score": 3,
            "text": "So a guy who started college as a physics major and switched to history would explain why I view religion as a cult. I was told by my deeply religious mother it was science that did it but guess it wasn’t.",
            "title_similarity": "0.7137173",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy7vuvb",
            "score": -2,
            "text": "Especially if they have Republican parents.",
            "title_similarity": "0.35675505",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8d3hm",
            "score": 3,
            "text": "I still can‘t take religious people seriously.",
            "title_similarity": "0.40351075",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gy83pbi",
            "score": 3,
            "text": "As the top comment already said: The more I find/found out about religion the less religious I am",
            "title_similarity": "0.6918657",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gy84q0x",
            "score": 5,
            "text": "Whats wrong with leading towards science and away from religion? If science wouldnt outsmart religion, we would still believe, that the earth is flat and that red-haired girls should be burned alive.",
            "title_similarity": "0.6145582",
            "sentiment_compound": -0.128
        },
        {
            "id": "gy82m8d",
            "score": 7,
            "text": "At 15 listening to the person at the pulpit make fun of another religion, and hearing everyone laugh with him, lead me away from the church.",
            "title_similarity": "0.42066836",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gy7rsua",
            "score": 8,
            "text": "Once I was exposed to a little of anthropology, history and psychology as a teenager, any legitimacy religion had evaporated.",
            "title_similarity": "0.62881184",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gy7fsu5",
            "score": 162,
            "text": "Shocker, when you question questionable stuff it falls apart.",
            "title_similarity": "0.3799413",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gy84kyv",
            "score": 5,
            "text": "Also, actually reading the Bible or Koran will do that also.",
            "title_similarity": "0.33830127",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8ddey",
            "score": 2,
            "text": "believing in sky fairies is stupid.",
            "title_similarity": "0.4506915",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gy7y0gi",
            "score": 1,
            "text": "I think it’s the hostility that some religious people have towards certain sciences that drives those who wish to learn more about those sciences away from religion.",
            "title_similarity": "0.7380882",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gy86gy9",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.115123264"
        },
        {
            "id": "gy8ggqi",
            "score": -1,
            "text": "As a Christian I’ve never understood the rift between science and religion. Maybe if you’re a young earth creationist or something, but as a catholic there is nothing that science has found out that wouldn’t be consistent with my beliefs.",
            "title_similarity": "0.6555454",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gy9om8t",
            "score": 1,
            "text": "I wonder what makes me less religious... Uhhh... Logic?",
            "title_similarity": "0.5463047",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy7oe1o",
            "score": -13,
            "text": "People who study science is the logical type, and if you think logically, religion doesn't make sense(not to say there isnt a God like being). i mean if you religion is real, why doesnt the whole world knows it? why does half the world has no record of the world changing event on your sacred text or something. why does every region has their own totally different version of world creation and such?",
            "title_similarity": "0.7475189",
            "sentiment_compound": -0.5242
        },
        {
            "id": "gy85pw9",
            "score": -7,
            "text": "Haha science good, religion bad! And if someone is religious they must be uneducted. Welcome to reddit.",
            "title_similarity": "0.6642005",
            "sentiment_compound": 0.69
        },
        {
            "id": "gy7nu25",
            "score": 81,
            "text": "If learning and studying science ends up being detrimental to people's belief in religion, that is not a failing of learning and  of science, that is a failing of religion.",
            "title_similarity": "0.8312226",
            "sentiment_compound": -0.1526
        },
        {
            "id": "gy7qnqq",
            "score": 14,
            "text": "Of coarse developing critical thinking skills and learning to apply them to everything will naturally make you see things differently",
            "title_similarity": "0.4613849",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy81bw5",
            "score": 5,
            "text": "So... critical through leads to less religion? Who'd have thought?",
            "title_similarity": "0.6104934",
            "sentiment_compound": -0.3939
        },
        {
            "id": "gy87l5a",
            "score": 5,
            "text": "Science doesn't kill religion. \nThe SCIENTIFIC METHOD does!",
            "title_similarity": "0.63011897",
            "sentiment_compound": 0.6162
        },
        {
            "id": "gy7sees",
            "score": 7,
            "text": "I studied Philosophy & Religious Studies and I came out of it as a scholarly observer to religion rather than an active participant. I learned to question the brain washing I had when I was growing up as the daughter of a Southern Baptist Pastor.",
            "title_similarity": "0.57032263",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gy8ejey",
            "score": 31,
            "text": "The title of this seems like semantic warfare rather than anything interesting. Very sloppy headline writing.",
            "title_similarity": "0.50996983",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gy81arf",
            "score": 3,
            "text": "The scientific method is the antithesis of faith.",
            "title_similarity": "0.5660471",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gy7yekl",
            "score": 1,
            "text": "Some people are just wilfully ignorant. I did biology in university but the evolution modules were not compulsory (though profs from all the specializations wanted the uni to make it compulsory). My religious friends deliberately avoided those modules cause they knew it would conflict their religious beliefs.",
            "title_similarity": "0.7715727",
            "sentiment_compound": -0.3506
        },
        {
            "id": "gy887pf",
            "score": 0,
            "text": "I’m pretty sure watching the 700 club as a teenager led me away from religion. Watching Pat Robertson be a jerk to anyone who didn’t worship him was enough for me.",
            "title_similarity": "0.6352031",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gy89wm4",
            "score": 1,
            "text": "So asking questions instead of blindly accepting fables leads to a more secular mindset. Who knew?",
            "title_similarity": "0.73052716",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gy8aijv",
            "score": 2,
            "text": "Exposure to science doesn't move people away from religion.\n\n1) Critical thinking\n\n2) Five minutes of common sense\n\n3) A desire to take personal responsibility, rather than delegate it to mystics.\n\nThese are the things that move people away from religion.  Due to the serious shortage of these things in humanity, religion still hasn't been discarded the way dragons and wizards were.",
            "title_similarity": "0.7923014",
            "sentiment_compound": 0.0351
        },
        {
            "id": "gy8055t",
            "score": 209,
            "text": "In my experience, most people who see it as \"Science VS Religion\" don't have a lot of experience with either.",
            "title_similarity": "0.6100974",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy7ly3k",
            "score": -6,
            "text": "Now, couple this with the earlier post regarding general uncertainty and political polarization.\n\nCould it be that religion, whether through organized practice or general influence, plays an important role is stabilizing society in terms of moral direction. When religiosity breaks down, what will fill the vacuum? Without a common overarching moral direction, we are - well, directionless. \n\nWhat the article shows is that as we become more sophisticated in our thinking - by virtue of education, in general - the less the answers that religion provided regarding the origins of man and of existence, satisfy our evolving understanding of the world.",
            "title_similarity": "0.78015554",
            "sentiment_compound": 0.9041
        },
        {
            "id": "gy8axri",
            "score": 11,
            "text": "Science doesn't make me less religious...you know what made me less religious? Finding out the religion I was raised in was run by a bunch of pedophiles disguising themselves as priests",
            "title_similarity": "0.78469557",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy7wm5d",
            "score": 4,
            "text": "Wouldn’t a scientific major have a focus on inquiry?",
            "title_similarity": "0.5579199",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy806pe",
            "score": 4,
            "text": "Developing critical thinking skills makes one more likely to be both less religious and less conservative. If one is able to question dogma from authoritarians it crumbles upon examination.",
            "title_similarity": "0.7439146",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy8297l",
            "score": -2,
            "text": "Lots of people making fun of conservatives here, calling them uneducated, but if civilization collapsed a poor Kentucky farmer would last much longer than any city dwelling liberal.  And I’m not even that conservative.",
            "title_similarity": "0.6229319",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gy7yt3a",
            "score": 0,
            "text": "I think it's also a combination of both. You have conspiracy theorists and tinfoil hatters who studied in their respective scientific fields yet wound up inquiring and applying knowledge to the wrong things, but then again, they're probably the exception to what the article meant.",
            "title_similarity": "0.6393831",
            "sentiment_compound": -0.3291
        },
        {
            "id": "gy7zatq",
            "score": 0,
            "text": "Wouldn't this party explain why so many Islamic terrorists are engineering majors, when the Middle-East is full of physics and chemistry majors who don't seem to end up working for Al-Qaeda and the like?",
            "title_similarity": "0.66050994",
            "sentiment_compound": -0.6275
        },
        {
            "id": "gy7zueu",
            "score": 0,
            "text": "I am so glad I did read the comments on here and that it wasn’t just me thinking this article had a lot of misinformation in it. \n\nI was a little confused on why applied and inquiry is separate, so are we just seeking knowledge to hold on to it now and never use it? We explore our curiosities to make sense of the world and how it works but then we just say “ok I’m never going to use that so I’m done here?”",
            "title_similarity": "0.6710737",
            "sentiment_compound": 0.1629
        },
        {
            "id": "gy809u1",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.115123264"
        },
        {
            "id": "gy8278q",
            "score": 0,
            "text": "You’d think that The Academic Times would know, or at least do the research to find out where Stanford is. The caption says Stanford is in Santa Clara, CA. Nope. It’s in Stanford, CA or Palo Alto, CA depending on the address of the building.",
            "title_similarity": "0.55712795",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy84e8t",
            "score": 0,
            "text": "Studying the facts of science and selective choosing which facts you adopt doesn't steer you away from religion. \n\nBeing actually scientific does.\n\nA scientific cannot hold the position that such fantastical things exist, without evidence indicating as much. \nBut you could be a scientific, no problem.",
            "title_similarity": "0.77479935",
            "sentiment_compound": 0.6413
        },
        {
            "id": "gy84p5w",
            "score": 0,
            "text": "Inquiry is the basis for science....",
            "title_similarity": "0.3671248",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8ape4",
            "score": 0,
            "text": "I think in a way it does, but it's better.\n\nAs Neil deGrasse Tyson once said \"religion is a faith\". \n\nAnd I think there should be a balance between faith and facts.",
            "title_similarity": "0.6193563",
            "sentiment_compound": 0.9052
        },
        {
            "id": "gy8cet2",
            "score": 2,
            "text": "This should be something to think about for all those people I know who think they are intellectually superior because they study science. \n\nApplying scientific knowledge doesn’t automatically/necessarily make you smarter than other people, or more rational.",
            "title_similarity": "0.7911669",
            "sentiment_compound": 0.836
        },
        {
            "id": "gy8hnjg",
            "score": 0,
            "text": "Some of the best minds of history even in recent times have been religious.",
            "title_similarity": "0.4475839",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gy8i5a3",
            "score": 0,
            "text": "I have no idea why people think that. The ratio of scientists who are religious is about the same as any other career path.",
            "title_similarity": "0.63825476",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy8lqgc",
            "score": 0,
            "text": "Science and religion should be seen as the same thing. Science is nothing more than our attempt to understand the world around us, created by God. By studying his creation and seeking truth, we are studying him and getting closer to him.",
            "title_similarity": "0.59001714",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gy8p5qc",
            "score": 0,
            "text": "Islam is based on science",
            "title_similarity": "0.4837197",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8s856",
            "score": 0,
            "text": "Science is the how, religion is the why.",
            "title_similarity": "0.5304192",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9cd43",
            "score": 0,
            "text": "I’m wondering if this is only Christianity based or was the study across a variety of religions and what the effect was on each... that would be fascinating reading.",
            "title_similarity": "0.5792341",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gy9d7fb",
            "score": 0,
            "text": "Curiosity, not knowledge, is the antidote to religion.",
            "title_similarity": "0.6374054",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9gn63",
            "score": 0,
            "text": "So, turns out exposure to knowledge does not steer people away from believing in Santa Claus and fairy tales. Interesting.",
            "title_similarity": "0.6382319",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gya593n",
            "score": 0,
            "text": "All you have to do is look at reddit, where people treat science like a religion",
            "title_similarity": "0.59979975",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gyaev72",
            "score": 0,
            "text": "Why would someone want to lead anyone “away” from religion? I understand a lot of Reddit has a weird hate for Christianity but religion has been proven to help people be better humans. Sure some take it too far but for the large majority religion (not just Christianity) is good for the soul!",
            "title_similarity": "0.7636949",
            "sentiment_compound": 0.9176
        },
        {
            "id": "gyalryi",
            "score": 0,
            "text": "tough look for religious people everywhere when learning how to ask questions leads people to leave. couldn’t be me",
            "title_similarity": "0.5599395",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gy7uu6f",
            "score": 4,
            "text": "Going to church made me not want to have anything to do with religion. Imagine working your ass off in school, pulling all nighters and grinding away only to be told that I didn’t actually do it, that it was god that did it and that was ultimately responsible because it was all part of his plan. Are you shitting me?",
            "title_similarity": "0.6592173",
            "sentiment_compound": -0.4805
        },
        {
            "id": "gy7ygtq",
            "score": 176,
            "text": "Idk I just feel like one doesn't effect the other as much ad people think. Also, \"religious\" can be vague. I'm probably a version of an agnostic tempered by a fierce imagination. But many people I know who work in fields of science are religious. They aren't Bible thumpers or anything, but they believe in the specific stuff. Mainly \n\n1.) When I die, it isn't the end. I don't know what it is. But it is not the end. \n2.) I feel like there is a higher order to things. You can call it God or whatever. \n\nIn fact, most people I know are like this to one level or another and those two beliefs are things that science currently cannot answer, and probably never will, so the two realms don't quite mix. In this case, you can be a person of science and spirituality simultaneously. They don't interfere. So I'm not really surprised by this study.",
            "title_similarity": "0.7675127",
            "sentiment_compound": 0.2085
        },
        {
            "id": "gy7tq5y",
            "score": 1,
            "text": "I know that fact since my childhood. People apply knowledge to make the world a better place to live in. \nBut people who enquire more, they try to understand the world. \nIt's not a very good analogy but this is how i interpret this.",
            "title_similarity": "0.6131432",
            "sentiment_compound": -0.3578
        },
        {
            "id": "gy7ue1p",
            "score": 1,
            "text": "It's not exposure to science per se; it's instruction on how to use critical thinking, something most die-hard religious people haven't been exposed to before (especially those who attended parochial schools prior to college).",
            "title_similarity": "0.6673387",
            "sentiment_compound": -0.2681
        },
        {
            "id": "gy7vofh",
            "score": 1,
            "text": "Exposure to drugs is what did it for me.",
            "title_similarity": "0.3443706",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy7xvq9",
            "score": 1,
            "text": "Does it matter? We have come to the point where we need science more than we need religion (some people even debate if we need religion at all to begin with). Science has both pros and cons while lately religion seems to have much more cons lately.",
            "title_similarity": "0.749653",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gy7zagy",
            "score": 1,
            "text": "Majors that force students to think for themselves and use their brain make students less religious. . .\n\nHmm . . .",
            "title_similarity": "0.772509",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy83g5l",
            "score": 1,
            "text": "Honestly it’s not a great sign for religion that we’ve gone from “studying truths about the world makes someone less religious” to “pursuing truth makes someone less religious “",
            "title_similarity": "0.8001417",
            "sentiment_compound": 0.5867
        },
        {
            "id": "gy83jk6",
            "score": 1,
            "text": "Hear me out, all my life I went to a catholic school and when I was a kid I used to be very religious but I was really into science as well and that didn’t have any effect on my faith. What made me change my opinion wasn’t science classes, it was philosophy classes. Nietzsche, Kierkergaard and Weber did the trick, but honestly since Aristotle I stopped considering god as humane and that made be less considered towards religion",
            "title_similarity": "0.75614595",
            "sentiment_compound": 0.8847
        },
        {
            "id": "gy86976",
            "score": 1,
            "text": "Higher education teaches you, more than anything else, how to think critically (or at least it should). Compare and contrast different viewpoints, etc. THIS is truly the benefit of a higher education IMO.",
            "title_similarity": "0.5827915",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gy88v0b",
            "score": 1,
            "text": "Which is why my christian elementary school always focused on blind faith and discouraged any critical questioning.  \n\nIt wasn’t till I left that school that I saw how dangerous that kind of thinking is. It’s probably why we have so many religious people who succumb to the QAnon cult. \nBlind faith.",
            "title_similarity": "0.62091845",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gy891wg",
            "score": -1,
            "text": "Ahh the false dichotomy of science vs religion.",
            "title_similarity": "0.6379591",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy898pg",
            "score": 1,
            "text": "Uuh, now conservative people will try to ban inquiring studies, that shouldn't have been revealed",
            "title_similarity": "0.72502965",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gy8asqp",
            "score": 1,
            "text": "In other words, teaching students how to perform critical thinking arms them with the tools to consider and reject superstition.",
            "title_similarity": "0.5497823",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gy8ddaw",
            "score": -1,
            "text": "The is why the modern Catholic Churh loses so many followers. When you use religion to justify the disinclusion of science, you fail to have a functioning  system. Religion and science can live together, id you let them. Most of the time, people dont let them mix.",
            "title_similarity": "0.7553811",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gy8dgvt",
            "score": 1,
            "text": "I think there is a also a certain subset of religious scientists that can reconcile the two.  My dad's side of the family are very scientific, my dad and all of his brothers are scientists by trade (mostly mechanical engineers and chemical engineers)\n\nThey are also religious but the way the connect the two is basically this. \"God is omnipotent and could whatever he prefered in the creation of the earth.\" So to them, evolution makes sense because if God was going to create a system for intelligent life developing, evolution would be a good way to do it.\nScience doesn't invalidate god to them because they feel God could create any scientific system and obscure himself from the system he created.\n\nWhich as someone who is an atheist coming from a family like this it's let's of a how come this works with way of god exists. It's more a \"If god is good and he has so much power, why are people allowed to be so awful to one another and why do so many people suffer?\"",
            "title_similarity": "0.692888",
            "sentiment_compound": 0.976
        },
        {
            "id": "gy8fxe4",
            "score": 1,
            "text": "There are so many prolific, famous, world-changing scientists who believe in God. People with weak faith can’t handle science. There are plenty who have a strong faith who understand science is another way to marvel at God. Furthermore, to believe that God would create a nonsensical universe NOT governed by the rules of science is to imply that God is somehow not clever or thorough enough to create the universe so many believe He did. Science Vs. God is yet another silly pointless thing people argue over. They’re not mutually exclusive.",
            "title_similarity": "0.719311",
            "sentiment_compound": 0.9366
        },
        {
            "id": "gy8g56f",
            "score": 1,
            "text": "Exposure to honest critical thought, reasoning, and investigation away from constant reinforcement of the doctrine is what does it.",
            "title_similarity": "0.5524078",
            "sentiment_compound": 0.25
        },
        {
            "id": "gy8mu8d",
            "score": 1,
            "text": "“The best cure for Christianity is reading the Bible” - Mark Twain",
            "title_similarity": "0.45417303",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gy8ps8q",
            "score": -1,
            "text": "r/science is awfully political these days.",
            "title_similarity": "0.43250704",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8q4ke",
            "score": 1,
            "text": "It's about exposure to critical thinking skills",
            "title_similarity": "0.22017059",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy8zftn",
            "score": 1,
            "text": "The very religious blame science for students leaving religion.  They are wrong and they know it.  Religion only exists because it's believers refuse to think deeply about it.  Higher education forces critical thinking and to think deeply about issues. Religion is ignorant.",
            "title_similarity": "0.7635597",
            "sentiment_compound": -0.8854
        },
        {
            "id": "gy937hs",
            "score": 1,
            "text": "I though having common sense made people less religious.",
            "title_similarity": "0.6440315",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy99sy5",
            "score": 1,
            "text": "So, philosophy. \n\nRather than the yields of science, which while derived undogmatically, are taught, especially at general ed level, dogmatically.",
            "title_similarity": "0.6956641",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9ta9o",
            "score": 1,
            "text": "Some of the greatest scientists in the world were religious, from Newton to Einstein.",
            "title_similarity": "0.5119102",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gy7bmgb",
            "score": 91,
            "text": "[deleted]",
            "title_similarity": "0.115123264"
        },
        {
            "id": "gy7uxb2",
            "score": 2,
            "text": "This why conservatives don’t like Liberal Arts colleges and they’ve created their own.",
            "title_similarity": "0.7579452",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gy817zc",
            "score": 2,
            "text": "Church corruption and nonsense magical thinking made me less religious",
            "title_similarity": "0.6767456",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gy81xuv",
            "score": 2,
            "text": "Isn't inquiry, like, literally the core of science, though? I'd like to know what the hell kind of science degree doesn't delve deeply into the scientific method.",
            "title_similarity": "0.7368684",
            "sentiment_compound": -0.6381
        },
        {
            "id": "gy84wmk",
            "score": 2,
            "text": "Never got less spiritual from college but wow learning about how bigotry works made it real hard to go to church.",
            "title_similarity": "0.61177135",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gy895mi",
            "score": 2,
            "text": "Who knew teaching someone to ask questions would lead to them asking questions?",
            "title_similarity": "0.46715087",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy89bao",
            "score": -2,
            "text": "“The first gulp from the glass of natural sciences will turn you into an atheist, but at the bottom of the glass God is waiting for you” -Werner Heisenberg",
            "title_similarity": "0.6607338",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gy89fk8",
            "score": 2,
            "text": "Ask any philosophy major how many religious students were in their major. From my own experience about 70% were aggressively atheist and almost the entire remainder were secular/non-religious",
            "title_similarity": "0.49754995",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy89son",
            "score": 2,
            "text": "What's that, spending time thinking and making decisions base on evidence makes people less likely to accept a system that requires blind faith? Hardly surprising.",
            "title_similarity": "0.7638347",
            "sentiment_compound": 0.5012
        },
        {
            "id": "gy8bbsp",
            "score": -2,
            "text": "I actually converted to religion while studying an engineering masters degree in college, so take from that what you will. My wife at the time was a PhD physicist and also converted.",
            "title_similarity": "0.5198353",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8g2gw",
            "score": 2,
            "text": "History classes are what made me lose faith.",
            "title_similarity": "0.5634469",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gy9czqf",
            "score": 2,
            "text": "What leads people away from religion is evidence. Religion has none.",
            "title_similarity": "0.5254996",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9fis9",
            "score": 2,
            "text": "Ummmm, science is a discipline of formalized inquiry.....so...",
            "title_similarity": "0.36602932",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy7zwh7",
            "score": 9,
            "text": "I think this is a strange distinction, and I question any \"science\" program that doesn't rest on learning the process of inquiry. It is utterly impossible to do rigorous science without knowing how to conduct skeptical inquiry.\n\nSide note: studying the Bible in college (e.g., reading it cover-to-cover and learning how tenuous its construction was) did more to undermine my Christianity than any of my science courses.",
            "title_similarity": "0.73720276",
            "sentiment_compound": -0.7703
        },
        {
            "id": "gy80tnz",
            "score": 3,
            "text": "Good to see a study that proves that this old claim is fallacious. Maybe we can see the Young Earth \"sciences\" die off. Personally, I made my way toward atheism by the thorough study of religion itself. By studying the history of Christianity, for example, you realize how absolutely bizarre are the things that you've accepted for so long. My fascination with science is a fairly new phenomenon by comparison.",
            "title_similarity": "0.7053938",
            "sentiment_compound": 0.2431
        },
        {
            "id": "gy81g54",
            "score": 3,
            "text": "I’m a mix of engineer and scientists. Lost my appetite in religion long before either of that happened.",
            "title_similarity": "0.516438",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy83cvs",
            "score": -3,
            "text": "As a spiritual person, I’ve always found spirituality and science went hand in hand",
            "title_similarity": "0.344153",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gy855ra",
            "score": -3,
            "text": "A lot of scientists throughout the ages were religious.",
            "title_similarity": "0.32804453",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9qkid",
            "score": 2,
            "text": "I might be an outlier but studying science and critical thinking made me more religious.",
            "title_similarity": "0.76098233",
            "sentiment_compound": -0.4497
        },
        {
            "id": "gy7nmta",
            "score": 720,
            "text": "To me, this article is founded on misinterpreting the base argument. The core concept behind the statement \"Science makes people less religious\" is about scientific thinking and methodology. Questioning and testing. The article agrees that fields that require these qualities have a notable rate of secularization, and fields that rely on rote learning do not.",
            "title_similarity": "0.8473007",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gy831w9",
            "score": -6,
            "text": "Religion and science go together. Churchies that make up their own rules and don’t use reason, or use the name of Christ/Mohammed/whomever as an excuse to be racist, are causing ethical people to leave",
            "title_similarity": "0.76285017",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gy7n26m",
            "score": -8,
            "text": "Best way to make an atheist is with a Jesuit education",
            "title_similarity": "0.5400789",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gy7ydf5",
            "score": -9,
            "text": "According to Carl Sagan the first sip of science makes one an atheist, but at the bottom of the glass god is waiting for you",
            "title_similarity": "0.6803385",
            "sentiment_compound": 0.3919
        },
        {
            "id": "gy7qrvu",
            "score": 2370,
            "text": "Isn't science about inquiry rather than just applying knowledge? Does remembering all chemical formulas and the atomic table make you a scientist or just a dictionary?",
            "title_similarity": "0.64255106",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy7gcnb",
            "score": 7790,
            "text": "[removed]",
            "title_similarity": "0.09318471"
        },
        {
            "id": "gy85z92",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "0.09318471"
        },
        {
            "id": "gy7mihm",
            "score": 1,
            "text": "The columns in this picture are mildlyinfuriating",
            "title_similarity": "0.27636647",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy7zfc4",
            "score": 2,
            "text": "I'm curious to know how many history and psychology majors walked into their universities as believers and walked out as atheists or agnostics.",
            "title_similarity": "0.62317073",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gy83w45",
            "score": 1,
            "text": "But it's not exactly what the study is saying. (well it's in the title chosen by the researchers but not really in its data). It says applied knowledge fields don't get this secular boost but actually researching and inquiring about the world which studying science (and philosophy) usually entails does make you more secular.Because yes just using knowledge without actually understanding how we came to its conclusion won't change your understanding nor is a lot different from how religion works, that mostly exposes you to what you need to believe and not asking questions.And yes if we define studying as just trying to know enough to pass exams and not really trying to comprehend the topic, which is not uncommon on science students unfortunately, then yeah no secular inclination there.I don't think I even heard of a non religious person believing that just reading a bunch of physics equations or theories will automatically make you agnostic or atheist. Sure a book explaining stuff will help but learning stuff by heart without analysing is not learning.",
            "title_similarity": "0.8838887",
            "sentiment_compound": 0.9496
        },
        {
            "id": "gy84tcd",
            "score": 1,
            "text": "What’s the evidence that the religiosity-studying science dependance is not the reverse way?",
            "title_similarity": "0.64494777",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy84xvj",
            "score": 1,
            "text": "Interesting to find that this is a weird cause and effect relationship thing.\n\nI had always assumed folks who are more religious tend to ask less questions. This seems to show it more as a methodology change.",
            "title_similarity": "0.7091154",
            "sentiment_compound": 0.25
        },
        {
            "id": "gy84z2c",
            "score": 1,
            "text": "Utah puts out the highest per capita of college graduates in the US, as well as the highest per capita ratio of Engineers and Scientists. They also tend to leave the University still highly religious.\n\nI suspect there's some other variables here at play.\n\nI'm a scientist myself and I would say a fairly high ratio of them tend to be religious. That's just an anecdotal observation from my own experience though in Arizona.\n\nI found that the people that drift more from secularism are the social science majors. Oddly, I found a ton of education majors that were hardcore atheists and I found it less common to find straight up atheists in the sciences vs more agnosticism. Again, anecdotal, but I felt it worth mentioning.",
            "title_similarity": "0.71310854",
            "sentiment_compound": 0.497
        },
        {
            "id": "gy85vx2",
            "score": 1,
            "text": "Is there a link to this study?  I’d like to read the primary source or paper.",
            "title_similarity": "0.34706676",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy85wom",
            "score": 1,
            "text": "Its not about what you learn, its learning to be open minded and apply that everything you encounter.  You can teach science without teaching students to be open minded.",
            "title_similarity": "0.71975905",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy86dsf",
            "score": 1,
            "text": "Surely if you're being taught a scientific topic, you should be taught the methodology and how to apply it?",
            "title_similarity": "0.48052424",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gy86qu5",
            "score": 1,
            "text": "Well BYU knows what it’s going to do with this news",
            "title_similarity": "0.20712495",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gy86sdf",
            "score": 1,
            "text": "Any education that teaches people the more effective epistemologies will get you away from faith, because faith is the least effective epistemology out there. Faith is belief without evidence.",
            "title_similarity": "0.7437057",
            "sentiment_compound": 0.8496
        },
        {
            "id": "gy87jrd",
            "score": 1,
            "text": "That’s because science isn’t a body of knowledge. It’s a way of knowing things about the world. It’s the rigour and the requirement of evidence that sets it apart from religious beliefs, some of which, it should be noted, survive contact with a serious and specialized study of science.",
            "title_similarity": "0.75023866",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gy88cnw",
            "score": 2,
            "text": "Inquiry destroys dogma.",
            "title_similarity": "0.34796235",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gy88j3r",
            "score": 2,
            "text": "Studying art history really put the nail in the coffin for me. Well, that and growing up in the Catholic Church.",
            "title_similarity": "0.4589898",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gy88tuv",
            "score": 1,
            "text": "Military tech school where I learned troubleshooting and the half split method is what got me to leave god behind",
            "title_similarity": "0.54272133",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gy897ww",
            "score": 1,
            "text": "I alwaya argued that hypocritical religious leaders that lead people away from religion.",
            "title_similarity": "0.62028325",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gy89cfn",
            "score": 1,
            "text": "Maybe. How many studies draw this conclusion? Who funded the study? If a person boils everything down to \"God didit\" then I guess so. But there's no way to reconcile accounts of any religion with science.\n\nIt's tiresome to read a lot of \"study says\" and have people buy into it. One study with an agenda means absolutely nothing.",
            "title_similarity": "0.7044741",
            "sentiment_compound": -0.3839
        },
        {
            "id": "gy8a6c6",
            "score": 1,
            "text": "Philosophy does it for sure. I'm in the process of secularizing several students of mine simply by teaching them critical thinking skills.",
            "title_similarity": "0.5448466",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8a7z4",
            "score": 1,
            "text": "Goes to show that science is being taught dogmatically too, there is no critical thinking involved",
            "title_similarity": "0.536016",
            "sentiment_compound": 0.2411
        },
        {
            "id": "gy8abim",
            "score": 1,
            "text": "Applying basic logic makes people less religious",
            "title_similarity": "0.5895129",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8acs3",
            "score": 1,
            "text": "The venn diagram of inquiry and science is a single circle.",
            "title_similarity": "0.34294784",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8am7n",
            "score": 2,
            "text": "Any discipline that teaches, directly or indirectly, critical thinking skills will inevitably lead to the rejection of religion (in general).  This will be obvious to anyone with critical thinking skills.  The scientific method itself, applied to religion, will dictate its rejection.",
            "title_similarity": "0.6304921",
            "sentiment_compound": -0.891
        },
        {
            "id": "gy8b6u8",
            "score": 1,
            "text": "I'm having some trouble with their definition of morality here. It's being treated as if morality isn't also fact. In a study literally about religion and how science effects it. Which is odd considering if it weren't for science religion would define killing as being moral. When we know logically that's wrong. In god's name and all that but still wrong. Morality is very much fact based. Kind of odd seeing a difference being placed on that.\n\n&#x200B;\n\nAlso, applied vs inquiry is also pretty odd to me. Considering science becomes to the base for which most of their lives are lived by. With of course there being religious challenges lying in wait. That being my overall confusion. College is usually treated as a time capsule in the minds of most students. Once out many of them aren't the same as when they were going. And their feelings also change again when challenged outside of college. I can understand inquiry being the inspiration for questions regarding religion but when it comes to applied don't those questions just come up later?\n\n&#x200B;\n\nVaccines for instance. It wasn't until recently have antivaxxers/religious people began to refuse them. On account of covid-19. Sure, there were a bit here and there but generally it wasn't nearly as wide spread as it is now. If the study were done again. Wouldn't the results be different because of recent events? Making even applied people give religion the side eye? I'm not one of those people who thought science made people anything. I've always been of the mind that no one makes atheists like religious people. Could it be because religion is so baked into society that it's generally not addressed seriously and therefor can't react with applied people's newly learned ideas? Again. Pretty sure a lot of doctors and nurses have had a change of heart surrounding religion regarding covid-19 and religious people's action/inaction on it.",
            "title_similarity": "0.78150165",
            "sentiment_compound": 0.4584
        },
        {
            "id": "gy8b85e",
            "score": 1,
            "text": "Is that not the definition of science? The scientific method?",
            "title_similarity": "0.5352478",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8bjl1",
            "score": 2,
            "text": "Studying religion made me less religious.",
            "title_similarity": "0.68443817",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8bnc4",
            "score": 2,
            "text": "Learning how to think logically for yourself, will generally make you think logically for yourself.",
            "title_similarity": "0.5306535",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8cmnj",
            "score": 1,
            "text": "This is in line with my personal experience.\nI was raised in a very isolated and religious place and I studied science throughout my whole life which didn't really affect my faith all that much. \nAs I approached adulthood, I started questioning my faith but I always pushed those thoughts to the back of my head because of the fear.\nI was finally able to accept those doubts and abandon my faith after I got into philosophy which I studied one my own online (didn't have access to the Internet when I was younger). \nAlso, funny thing is, I remember them warning us about philosophy in one of the religious classes. They blamed philosophy amongst other reasons for a historical secularisation in a community of people of my religion. So, it was considered a tabboo to learn philosophy. Guess they were right about that one.",
            "title_similarity": "0.6552512",
            "sentiment_compound": -0.7442
        },
        {
            "id": "gy8czsg",
            "score": 1,
            "text": "That's in the margin of error.",
            "title_similarity": "0.19078013",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gy8dghe",
            "score": 1,
            "text": "So if I'm reading this right... the difference is 11% more secular for inquiry-based majors vs. 8% more secular for applied knowledge majors?\n\nI mean... ok yes, that's a significant difference... but both are pretty small effects. \n\nIsn't that a *better* way to \"break with the traditional claim that exposure to science leads people away from religion\"? I.e. \"It doesn't, much\".",
            "title_similarity": "0.80851877",
            "sentiment_compound": 0.6598
        },
        {
            "id": "gy8dhrg",
            "score": 1,
            "text": "I mean to me they can’t coexist unless you put up a large impenetrable wall up in your brain....because holding the idea of a system that is evidence based and that allows us to see things for what they truly are rather than what you want to believe while also accepting something on faith seems impossible without turning a blind eye",
            "title_similarity": "0.6380945",
            "sentiment_compound": 0.8707
        },
        {
            "id": "gy8e55t",
            "score": 1,
            "text": "I think the world could be a better place if more people questioned and scrutinized their perception of reality. Following beliefs with stubborn determination can lead to a wide range of issues ranging from inefficient and ineffective solutions for everyday problems, all the way to genocide. There’s a lot of people who need people to believe the ideas they are selling to push their agenda, and too many of those agendas are harmful to the individual or society in general. Scammers, cults, politicians, anti vaxxers, conspiracy theorists, all don’t want you to question and doubt what they are selling. There’s still plenty of ideas like working together to solve climate, economic, and societal problems where critical thinking helps eliminate misconceptions and find real solutions.",
            "title_similarity": "0.6419881",
            "sentiment_compound": -0.6786
        },
        {
            "id": "gy8efav",
            "score": 1,
            "text": "But focusing on inquiry without focusing on application divorces the inquiry from reality. To maintain the best quality of inquiry, a school should focus on both.  \n\nWhere else can you measure the coefficient of friction, other than where the rubber meets the road?",
            "title_similarity": "0.70297825",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gy8fk0s",
            "score": 1,
            "text": "Logical.  People who \"know\" things will tend towards being more religious.  People who question things, will not.  Pretty straightforward line.  \n\nA) Know, teach, preach  \nB) Think, question, learn  \n\nPretty much a war of the old and the young.",
            "title_similarity": "0.7078961",
            "sentiment_compound": -0.5152
        },
        {
            "id": "gy8g0az",
            "score": 1,
            "text": "🤔💭if more \"science'y\" folks researched psychedelics🌈 it might lead to some really profound and interesting research. \n\nTesla himself said once we move past the science of the 'known senses' we'd really make some progress in science.",
            "title_similarity": "0.66596043",
            "sentiment_compound": 0.7208
        },
        {
            "id": "gy8g8dc",
            "score": 1,
            "text": "I mean, when you ask god questions and she never answers, what do you expect?",
            "title_similarity": "0.42337143",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gy8g8y2",
            "score": 1,
            "text": "No no. Exposure to sound reasoning, not exposure to science necessarily. Exposure to the world and different cultures as a whole. All that combined with actually reading a few books of the Bible and that should get the ball rolling with Christianity anyway.",
            "title_similarity": "0.60482967",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy8gm7h",
            "score": 1,
            "text": "Inquiry actually drew me to spirituality. Either way this makes a lot of sense: religious indoctrination is stronger than scientific indoctrination, so of course it won't be as effective as independent thinking.",
            "title_similarity": "0.76758254",
            "sentiment_compound": 0.0119
        },
        {
            "id": "gy8gt9y",
            "score": 1,
            "text": "Giving people a space to question their religion without backlash just so happens to lead to atheism pretty often",
            "title_similarity": "0.66279894",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gy8gvst",
            "score": 1,
            "text": "Interesting so learning/doing for yourself instead of indoctrination is the trick.",
            "title_similarity": "0.5285752",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy8gxzb",
            "score": 1,
            "text": "curiosity killed catholocism i suppose",
            "title_similarity": "0.45299226",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gy8h1l4",
            "score": 1,
            "text": "I grew up in a republican, Christian household. A critical thinking course I took my freshman year of college was the tipping point. Rewiring how to think critically about things on both sided really opened my eyes.",
            "title_similarity": "0.5164261",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy8h3yy",
            "score": 1,
            "text": "It's the narrow view of accepted sciences that lead those away from religion. Unacceptable sciences are called pseudo sciences.",
            "title_similarity": "0.67757684",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gy8h8rs",
            "score": 1,
            "text": "My old friend from middle school overbearingly religious  dad is what made me less religious",
            "title_similarity": "0.65262634",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gy8hr0a",
            "score": 1,
            "text": "Who’d have thought that critical thinking was the deathknell of religion.",
            "title_similarity": "0.5917739",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy8hrmt",
            "score": 1,
            "text": "So does this mean that if you make inquiries at a seminary that you’ll become a scientist?",
            "title_similarity": "0.4866359",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8ht14",
            "score": 1,
            "text": "Science IS the new religion.",
            "title_similarity": "0.55928016",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8hw6a",
            "score": 1,
            "text": "The claims of this study overreach what they actually examined. They claim that certain *majors* are more involved in inquiry than others, like philosophy. Maybe so for philosophy, but which college majors are not involved in inquiry? Most of the ones I can think of have that component. In other words, the supposed results rely on the assumption of which majors involve inquiry. It's not surprising that more philosophy majors end up atheist.\n\nHere's the actual paper\nhttps://academic.oup.com/socrel/advance-article-abstract/doi/10.1093/socrel/srab005/6258789?redirectedFrom=fulltext",
            "title_similarity": "0.8178724",
            "sentiment_compound": 0.1126
        },
        {
            "id": "gy8hxl0",
            "score": 1,
            "text": "Science drew me closer to god in my experience. I’ve always wanted to understand gods creation in detail.",
            "title_similarity": "0.47614402",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gy8i9j1",
            "score": 1,
            "text": "I kinda feel like studies as this one is more just confirmation bias.\n\nPeople go to a secular school and they come out more secular.  They get taught by secular people and as thus become more secular.",
            "title_similarity": "0.72388107",
            "sentiment_compound": 0.1426
        },
        {
            "id": "gy8ihhv",
            "score": 1,
            "text": "My exposure to religion led me away from religion. \n\nCatholic school in the US in the early 00’s. Weird time to to be around the holy of holies with all that stuff in the news.",
            "title_similarity": "0.6183349",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gy8isuh",
            "score": 1,
            "text": "So…..critical thinking skills? What does it say about religion if the only ones remaining are the people who don’t question things?",
            "title_similarity": "0.61092174",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8j319",
            "score": 1,
            "text": "Read the headline and figured it was a sensationalized version of a more refined argument from the paper. Opened paper and was very disappointed... \nCORRELATION DOESN’t EQUAL CAUSATION!!! How hard is that to remember?!",
            "title_similarity": "0.5794257",
            "sentiment_compound": -0.8289
        },
        {
            "id": "gy8j9rl",
            "score": 1,
            "text": "Catholic school made me hate religion",
            "title_similarity": "0.55711347",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gy8jiwo",
            "score": 1,
            "text": "So when one gains more of an ability to critically think, they stray away from religion. Wild.",
            "title_similarity": "0.626681",
            "sentiment_compound": 0.6402
        },
        {
            "id": "gy8jpe2",
            "score": 1,
            "text": "Hmm. When a person learns \"you are allowed to think and ask questions\" after a lifetime of being told \"you are NOT allowed to think and ask questions\", their loyalty to a religion decreases. Shocking. \n\nFrom a Reform Jewish perspective, I have to give props to my Sunday School teachers. I Judaism you're *encouraged* to ask questions, and in fact some of the core stories from the Torah/Talmud are about historical questions and how they were answered. \n\nBut my teachers didn't shy away from tough topics or issues, like how you can reconcile all the 613 Commandments. You can't. They're out of date and incompatible with a modern view of morality. You're allowed to conclude that a lot of what was once dogma is problematic. You're allowed to reject or reinterpret. \n\nIt helps that the core of Judaism is not the Torah, it's the Talmud, which is basically a compendium of a bunch of historical rabbis' debates. As one of my Sunday School teachers said, \"old dead guys have been known to be wrong sometimes.\"",
            "title_similarity": "0.6427508",
            "sentiment_compound": -0.8844
        },
        {
            "id": "gy8ka79",
            "score": 1,
            "text": "Also, going to college and getting perspectives outside the cult tends to help you escape it",
            "title_similarity": "0.67703927",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gy8kiaf",
            "score": 1,
            "text": "For me, it was learning more about how to think, not about what to think. The scientific method, Socratic method, mathematical proofs, these were all huge in changing the way I thought about pretty much everything, not just religion.",
            "title_similarity": "0.6668243",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gy8km9n",
            "score": 1,
            "text": "I think personally that science is just the rules of whatever deity or god made us. It’s kind of like source code with coding with a video game. I believe there might be a god and I believe that god made science and that it doesn’t go against god.",
            "title_similarity": "0.61900663",
            "sentiment_compound": 0.8228
        },
        {
            "id": "gy8knvx",
            "score": 2,
            "text": "We need to teach kids critical thinking in schools",
            "title_similarity": "0.43686962",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy8kryh",
            "score": 1,
            "text": "I’m sure religious leaders absolutely clowning themselves has nothing to do with it.",
            "title_similarity": "0.4311869",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gy8kwp6",
            "score": 1,
            "text": "Understandable, but political ideologies seem much more ingrained from what I can tell. People seem more likely to abandon or change religions than their political alignment/priorities.\n\nCould be a label/tribal thing, or that people often realize their current religion isn't the only way to adhere to or realize what's important to them, or the perception one's political ideology doesn't have alternative paths and it's more salient to them, they remain intractable.",
            "title_similarity": "0.76331484",
            "sentiment_compound": 0.0113
        },
        {
            "id": "gy8l1ut",
            "score": 1,
            "text": "I’m a PG, and I will say my studies of geology only further influenced my beliefs in the Bible",
            "title_similarity": "0.56928647",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8lmh6",
            "score": 1,
            "text": "Religion is a tool to explain the questions that science can't yet fully explain. It basically takes the things we *can* prove and then fills in the gaps with things we can't prove.",
            "title_similarity": "0.6864929",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8lnha",
            "score": 1,
            "text": "You can give up being religious, but no one can give up their metaphysical human nature.",
            "title_similarity": "0.55895317",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gy8lnwd",
            "score": 1,
            "text": "My most secularizing college course was Comparative Religions. That’s what made me realize they all have a lot in common - and the one I happened to be raised in didn’t have much to distinguish it.",
            "title_similarity": "0.64491785",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8lqyv",
            "score": 1,
            "text": "Being forced to go to church, and the way they interpreted the bible made me unreligious. And the fact that people wrote the bible made me less confident in it’s goal.",
            "title_similarity": "0.57745486",
            "sentiment_compound": -0.024
        },
        {
            "id": "gy8lzyh",
            "score": 1,
            "text": "I’d say that studying history makes people less religious, atleast in terms of traditional religions. Jews? Christians? Muslims? All used to control people, nothing more, nothing less. Muhammad wanted Jews to join him, then hated them for not doing so. Christian popes were practically emperors with all benefits it had, waged wars. Religion is still used in countries like Poland or Iran to control people. \n\nThe only people actually believing and living religious lives were and are those on the very bottom of hierarchy. Not pope, not cardinals, not even Bishops. Priests? Maybe, but that’s it. \n\nI am not against believing in sort of God, Creator or whatever you call it. But if there is one, there is nobody who knows it. And traditional religions are certainly not right.",
            "title_similarity": "0.66273",
            "sentiment_compound": 0.6726
        },
        {
            "id": "gy8m2l5",
            "score": 2,
            "text": "Good, religion needs to die. Believing in a fictional deity isn't going to make the world a better place.",
            "title_similarity": "0.6800654",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gy8m364",
            "score": 1,
            "text": "Except that science IS questioning (inquiry). What the heck do you think hypothesis means!?",
            "title_similarity": "0.53935003",
            "sentiment_compound": -0.1759
        },
        {
            "id": "gy8m6i1",
            "score": 1,
            "text": "The quote I heard is that religious studies in university is the place where faith goes to die.",
            "title_similarity": "0.46894974",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gy8maoq",
            "score": 2,
            "text": "Studying science made *me* less religious.  I was 16 or so when I took an AP bio class and became an athiest.",
            "title_similarity": "0.5918609",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8mqhg",
            "score": 2,
            "text": "Learning to think for yourself certainly does",
            "title_similarity": "0.26018286",
            "sentiment_compound": 0.34
        },
        {
            "id": "gy8mvjn",
            "score": 1,
            "text": "If only there was a term for a particularly effective method of inquiry...",
            "title_similarity": "0.33573672",
            "sentiment_compound": 0.5256
        },
        {
            "id": "gy8mvqv",
            "score": 1,
            "text": "People need logic and problem solving skills. I am so dyslexic and ADHD that I just about qualify for SSD but I swear that most people couldn't problem solve their way out of a wet paper bag.",
            "title_similarity": "0.5496913",
            "sentiment_compound": 0.2369
        },
        {
            "id": "gy8n2m0",
            "score": 1,
            "text": "I would say the extreme violence and atrocities, as well as human rights violations all in the name of religion has made me pretty non religious. There's  no justification for it.",
            "title_similarity": "0.6168708",
            "sentiment_compound": -0.6901
        },
        {
            "id": "gy8n89m",
            "score": 1,
            "text": "I have to say, learning about science is MOSTLY what secularized me...just so many things that were backed by evidence that contradicted what I had learned about religion...That, and learning about other religions.",
            "title_similarity": "0.75653654",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy8nklo",
            "score": 1,
            "text": "How about religiosity?",
            "title_similarity": "0.224247",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8nvru",
            "score": 2,
            "text": "Reading the first 10 pages of the Bible started my path to atheism.",
            "title_similarity": "0.37678695",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8nx7f",
            "score": 1,
            "text": "Studying science isn’t what makes students less religious: pedophile priests do. Oh and common sense",
            "title_similarity": "0.86602086",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8o05h",
            "score": 1,
            "text": "What i get from it is, asking critical questions may secularize.",
            "title_similarity": "0.4917783",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy8ofui",
            "score": 1,
            "text": "You will loop all the way back round to religion when you reach an understanding of the quantum world and critical theory",
            "title_similarity": "0.44276875",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy8ofvz",
            "score": 1,
            "text": "Yeah, critical thinking, not taking things for granted just because a trusted older person told you them (i.e. faith)",
            "title_similarity": "0.5370784",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gy8og5j",
            "score": 1,
            "text": "There is nothing you can learn that points to atheism, that everything dumb-lucked into existence for no reason. Being less religious is a spiritual thing, not a learned thing.",
            "title_similarity": "0.56880057",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy8oi0k",
            "score": 1,
            "text": "Inquiry is the backbone of the scientific process.",
            "title_similarity": "0.33640736",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8ol1v",
            "score": 1,
            "text": "I got no problem with atheists, but atheists who say they are atheists because of science is the dumbest of them all.",
            "title_similarity": "0.61785877",
            "sentiment_compound": -0.5888
        },
        {
            "id": "gy8olb3",
            "score": 1,
            "text": "Religion leads away from religion. Once you study it, you realise it only makes sense in terms of myths and folklore, and you can get much better moral teachings from moral philosophy.",
            "title_similarity": "0.7179585",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gy8opo0",
            "score": 1,
            "text": "Don't ask too many questions at summer vacation bible school or you get stuck with the \"special\" group.",
            "title_similarity": "0.62034374",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gy8oxww",
            "score": 2,
            "text": "It's almost as if facts don't matter to them.",
            "title_similarity": "0.34139216",
            "sentiment_compound": -0.0191
        },
        {
            "id": "gy8pi13",
            "score": 1,
            "text": "I'm curiously what this means. Does this mean that engineers and doctors (more applied knowledge) will be more religious on average than research scientists (more inquiry)?",
            "title_similarity": "0.74976647",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8pie4",
            "score": 1,
            "text": "In other words, fields that require critical thinking are more likely to be populated by athiests",
            "title_similarity": "0.4163674",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy8py11",
            "score": 1,
            "text": "It’s called learning. Intelligence over ignorance. Like what?",
            "title_similarity": "0.42522073",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gy8q297",
            "score": 1,
            "text": "\"Study reinforces traditional claim that scientific inquiry leads people away from religion\"\n...",
            "title_similarity": "0.74809235",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8q50m",
            "score": 2,
            "text": "I always thought the claim was that exposure to the *methods* typically attributed to science is what \"led people away from religion.\" Things like critical thinking, inquiry, testing new ideas, etc.\n\nI suppose I've never really thought of science as being antithetical to religion, especially since quite a few well known scientists are, in fact, religious. Good for the confirmation, though.",
            "title_similarity": "0.78483367",
            "sentiment_compound": 0.6666
        },
        {
            "id": "gy8q8u6",
            "score": 1,
            "text": "Religion would prefer you to know less and accept more.",
            "title_similarity": "0.59942424",
            "sentiment_compound": 0.323
        },
        {
            "id": "gy8qlkp",
            "score": 1,
            "text": "I met a religious neuroscientist with a doctorate in genetics.",
            "title_similarity": "0.488126",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8qo3n",
            "score": 1,
            "text": "College solidified my militant atheism",
            "title_similarity": "0.43181884",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8qtu1",
            "score": 1,
            "text": "Catholic Church has been saying this. Many prominent scientific study has been by monks, clerics, or priests.",
            "title_similarity": "0.42262536",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gy8qu7o",
            "score": 1,
            "text": "College makes people dumber, I’m not even kidding. The amount of free thinking kids I’ve seen become hive mind sheep is saddening. North Korea please press the button.",
            "title_similarity": "0.6411761",
            "sentiment_compound": -0.1017
        },
        {
            "id": "gy8rdgi",
            "score": 1,
            "text": "That's because a lot of science \"study\" isn't based on analyzing evidence, but most people just read a text book and apply basic stuff to basic industries. \n\nIf it was actually evidence based thinking, then we would automatically disqualify religious books and the sources for all this material",
            "title_similarity": "0.7469226",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8rk9n",
            "score": 1,
            "text": "As a math major, I converted to atheism a few years ago.",
            "title_similarity": "0.45833138",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8rksg",
            "score": 1,
            "text": "Angels and Demons by Dan Brown really brought forward an interest in the relationships between science and religion for me. The concepts were completely alien to me before but they do coincide and compliment each other.",
            "title_similarity": "0.6491041",
            "sentiment_compound": 0.7311
        },
        {
            "id": "gy8rub5",
            "score": 1,
            "text": "Finally an explanation of my fundamentalist engineer friend.",
            "title_similarity": "0.3360418",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gy8ruc2",
            "score": 1,
            "text": "Seems plausible.  Engineers are probably more religious than actual researching scientists.",
            "title_similarity": "0.7137378",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8rw1p",
            "score": 1,
            "text": "Yeah, I bet a LOT scientist that are religious.\n\nPraying that the experiment result would valide the hypothesis, that is basically their daily routine.",
            "title_similarity": "0.53517324",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gy8s9wr",
            "score": 1,
            "text": "that's obvious, going to college doesn't cure stupidity",
            "title_similarity": "0.63656485",
            "sentiment_compound": 0.3412
        },
        {
            "id": "gy8sdt0",
            "score": 1,
            "text": "Religion is for pédophiles.",
            "title_similarity": "0.5997307",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8soyt",
            "score": 1,
            "text": "Truth leads you away from untruth",
            "title_similarity": "0.44344294",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gy8srfd",
            "score": 2,
            "text": "Who would’ve thought critical thinking would result in secularism",
            "title_similarity": "0.62707585",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy8t280",
            "score": 1,
            "text": "I became less religious while on college because I realized my church, and many like it were closed minded and only used the Bible for their own personal gain buly selecting which chapters and verses they wanted to follow or preach. Then those same people get upset when something is done to help another religion not be targeted, but when someone talks about taking \"In God we trust\" off a dollar its a travesty and we are experiencing the end of the world.",
            "title_similarity": "0.7132119",
            "sentiment_compound": 0.6187
        },
        {
            "id": "gy8t32p",
            "score": 1,
            "text": "That precise moment where one starts feeling blessed,  and achieves superiority complex from the religion or race that one belongs to, is exactly where humanity ends.\n\nLearn to respect and love one another first, so much so,  that no imaginary god or line drawn across a parchment makes you feel entitled enough, to belittle another.",
            "title_similarity": "0.58040714",
            "sentiment_compound": 0.883
        },
        {
            "id": "gy8tahc",
            "score": 1,
            "text": "\"We oppose the teaching of Higher Order Thinking Skills (HOTS) (values clarification), critical thinking skills and similar programs that are simply a relabeling of Outcome-Based Education (OBE) (mastery learning) which focus on behavior modification and have the purpose of challenging the student’s fixed beliefs and undermining parental authority.\" -- Republican Party of Texas",
            "title_similarity": "0.6804139",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gy8tjpr",
            "score": 1,
            "text": "I'm strongly religious and believe in science (studying Mechanical Engineering at undergraduate right now). The more I study science the religious I get.",
            "title_similarity": "0.62520516",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gy8tkv5",
            "score": 1,
            "text": "Maybe it's because people are tired of organized religion.",
            "title_similarity": "0.637903",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gy8tl5k",
            "score": 1,
            "text": "Sociology is a very good class to break students from the rigid mindsets they grew up with and start looking at the social systems and norms with a more inquisitive mindset rather than assigning strict value judgements to everything.\n\n\"Why does X tend to Y?\" instead of \"X naturally tends to Y\".",
            "title_similarity": "0.7423488",
            "sentiment_compound": 0.7258
        },
        {
            "id": "gy8tnaa",
            "score": 1,
            "text": "Raised Catholic > Go to Catholic college > Take a comparative religions class (taught by a Catholic Priest and intended to strengthen my faith)\n\nEnded up an agnostic. I have no idea what is going on. Not quite an atheist though.",
            "title_similarity": "0.6501175",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gy8tnc6",
            "score": 1,
            "text": "This is not about science.",
            "title_similarity": "0.28660214",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8tvpl",
            "score": 1,
            "text": "> Evans said. \"Rather, it's about learning to question the assumptions of what you've learned to this point in your life.\"\n\n> The college majors with the highest effect on secularization were... Pre-law studies ranked the absolute lowest.\n\nI find this to be the most interesting conclusion from the study, the implication that pre-law studies are the absolute least effective in teaching students to think for themselves and ask questions about the world around them.",
            "title_similarity": "0.73455954",
            "sentiment_compound": -0.2871
        },
        {
            "id": "gy8tx7u",
            "score": 1,
            "text": "\"allowing students to ask questions made them less religious\"",
            "title_similarity": "0.6994092",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8u2r1",
            "score": 1,
            "text": "It’s not that university’s are liberal indoctrination camps, it’s that they teach you to reach your own conclusions using critical thinking and facts. \n\nAs a victim of this liberal indoctrination, I refuted my religion and disappointed my family. Blame the line and SoCiAlIsM",
            "title_similarity": "0.7549804",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gy8u3sf",
            "score": 1,
            "text": "In order words, supporting critical thinking destabilized the hold on religious ideology",
            "title_similarity": "0.5897534",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gy8u5p6",
            "score": 1,
            "text": "It’s was mostly common sense that lead me there",
            "title_similarity": "0.20638245",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8ujmn",
            "score": 1,
            "text": "Seeing overly religious folks makes me less religious.",
            "title_similarity": "0.61898184",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8vcez",
            "score": 1,
            "text": "Yes, being exposed to actual facts may deter some from believing the baseless stories and ideals that they have blindly followed.",
            "title_similarity": "0.64787644",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gy8vl2o",
            "score": 1,
            "text": "The only thing I know for sure.....everyone of my professors scoffed at the idea of a higher power. Then lo and behold the quantum physicists discover something they named the “God Particle”. Hmmm",
            "title_similarity": "0.57238936",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8vroq",
            "score": 1,
            "text": "I got an add that said something to the effect of “some people view their existence as a narrative and others view it as a system”.\n\nIt solved any issues with religiosity as far as I’m concerned. I’m not going to convince anyone that their god-centered narrative is not that because anything I posit will just be interpreted as a message or a sign.\n\nBut they’re also not gonna convince me because their claims won’t affect me how they expect them to affect me. I’ll scrutinize them and they simply won’t influence me for long enough that they’ll change my attitude permanently.",
            "title_similarity": "0.73114264",
            "sentiment_compound": -0.2335
        },
        {
            "id": "gy8vxrv",
            "score": 1,
            "text": "Less religious perhaps, but not less spiritual.",
            "title_similarity": "0.4378312",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8w7r3",
            "score": 1,
            "text": "Studying Greek and Roman mythology in high school was a real eye opener.",
            "title_similarity": "0.46571702",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8wpx6",
            "score": 1,
            "text": "Reminds me of a friend from HS who got a PhD in inorganic chemistry. I always wondered how someone that smart could still be religious I suppose the “hard” sciences don’t really push you to that point of existential curiosity that fields like sociology and philosophy. Just goes to show the resiliency of the mental coding done by religious ideas and upbringing. To most people, they are integral to their personal identity. So they are (usually) only broken when challenged directly. Most smart people of faith have adopted a “created through evolution, etc.” stance that makes things like biology and chemistry not directly contradictory with their faith. But this kind of mental adjustment doesn’t work as well against, for example, learning about the history of the birth of colonial capitalism and the “age of heroic capitalism”. It’s hard to reconcile man’s brutality towards man with a rhetorical flourish like “we don’t know what a day means for him”. It’s hard to trust the plan when you study how the plan’s been going for the last couple thousand years and how it’s going now.",
            "title_similarity": "0.7616041",
            "sentiment_compound": 0.9321
        },
        {
            "id": "gy8wudn",
            "score": 1,
            "text": "Studying science just makes me believe in God more because its so wonderful and I'm just a small human that can't comprehend how all this just... is.",
            "title_similarity": "0.62145436",
            "sentiment_compound": 0.7809
        },
        {
            "id": "gy8x7mb",
            "score": 1,
            "text": "My decade+ of catholic schooling provided a strong educational background that prepared me for university as well as a comfortable understanding of my own atheism. \n\nI’m in the sciences.",
            "title_similarity": "0.5349985",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gy8xdao",
            "score": 1,
            "text": "Science led me to religion.",
            "title_similarity": "0.4747661",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8xoh4",
            "score": 1,
            "text": "> More recently, research has narrowed this claim and shown that conflict over knowledge in the USA is primarily limited to one religion—conservative Protestantism—and only to a few fact claims.\n\nSo in this context the effect is only observed among the Evangelical Christian groups, not other religious groups in the US. Given their monopoly of religious outrage in government and in the media, I'm not surprised.",
            "title_similarity": "0.71978796",
            "sentiment_compound": -0.8001
        },
        {
            "id": "gy8yst8",
            "score": 1,
            "text": "No it's usually the exposure to other cultures that causes it.",
            "title_similarity": "0.41779414",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy8yuuq",
            "score": 1,
            "text": "I thought I would love my philosophy of religion class as an atheist and former Christian, but it turned out to just being 3 months of Atheism vs Christianity. As if those are the only to options there are. Disappointing but telling about our close mindedness, even in a philosophy class.",
            "title_similarity": "0.6421633",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gy8yx36",
            "score": 1,
            "text": "I actually had a teacher who was way, way, way too qualified for his position teaching high school level physics, and as he was getting even more education he remarked that he had been a super hardcore atheist for his entire life and thought the concept of religion to be completely and utterly stupid, but getting deeper and deeper into his studies of physics convinced him of a higher order and the possibility of a higher power/creator. Ignoring that these aren't really the things you're supposed to talk about with your students at a public school, the acquisition of information isn't nearly as important to ou values and beliefs so much as how we interpret it.",
            "title_similarity": "0.7160742",
            "sentiment_compound": 0.3886
        },
        {
            "id": "gy8z5qy",
            "score": 1,
            "text": "As an engineer, as much as it pains me to say it, it's true in my experience. I'm from India so maybe it's worse here than the rest of the world, but Engineers and Doctors are literally machines trained to remember a bunch of rules.\n\nWe are not taught how to arrive at those conclusions ( atleast it's not actively encouraged ), we are given 3 - 4 dictionaries worth of stuff to remember and write exams based on that. It's easy to loose the actual science behind all the drama for a person whose only concern is to get a good grade. Offerings of sweets, heavy incense and quite a bit of chanting of mantras can heard on the morning of the exam dates in college hostels.",
            "title_similarity": "0.70312715",
            "sentiment_compound": 0.6381
        },
        {
            "id": "gy8zghg",
            "score": 1,
            "text": "I think now a days religion make people less religious.",
            "title_similarity": "0.62465835",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy8zuxi",
            "score": 1,
            "text": "From Quran:\nBut it is only those amongst His worshippers that fear Allah who have knowledge. Indeed, Allah is the Almighty and the Forgiving",
            "title_similarity": "0.4451139",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gy903m5",
            "score": 1,
            "text": "I’m Roman Catholic and in science. And, I’ll admit, I had to bargain between the two. What I ended up settling on is this:\n\nI choose to believe in God and a life after death because there is no proof otherwise and I don’t lose anything by believing. What I do gain is a small measure of comfort in believing that, when  my loved ones die, the goodbye won’t be final and I may see them again. It’s a comfort in this life, and if there is nothing after death but oblivion, then there won’t be a “me” to realize that my belief was naive and foolish. It’s a win-win situation.\n\nI believe in the values of loving one another that are central to my religion, among other values. That said, I recognize that any religion is man-made, and that by virtue of being man-made it is fallible and corruptible. That is why I take everything with a grain of salt and cherry-pick what I want for my own life. \n\nDoes it make it a bad Catholic by some people’s standards? Oh, most definitely. But I identify with Catholicism and I feel pride when I see our buildings and our art, just as I feel embarrassment and anger for all the times the Church was and is, for lack of a better term, a corrupt asshole. I’m Catholic because I say so, and they could try to excommunicate me (as if that’s still a thing) and I’d still call myself Catholic.\n\nSo yeah. Pretty sure that the super-religious don’t like it when people are educated, because no matter whether the people stay or leave the religion, they lose power.",
            "title_similarity": "0.6311838",
            "sentiment_compound": 0.9683
        },
        {
            "id": "gy90531",
            "score": 1,
            "text": "This jives with my personal experience. I know plenty of science types that are very religious but I don’t know a single philosophy type that’s religious at all",
            "title_similarity": "0.47511244",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy910v4",
            "score": 1,
            "text": "Alas , creation of Gods to what end of the human experience....Same as it ever was , welcome to EARTH",
            "title_similarity": "0.22480318",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gy91251",
            "score": 1,
            "text": "I studied history. I just could never be religious after studying how religions came about. Just made no sense to me",
            "title_similarity": "0.5718427",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy916o3",
            "score": 1,
            "text": "I think the opposite is true, one realizes this universe could not have been accidental and a proper balance between nature, logic, and spirituality are more likely to be achieved.",
            "title_similarity": "0.6386217",
            "sentiment_compound": 0.4628
        },
        {
            "id": "gy91bwp",
            "score": 1,
            "text": "Im not very super smart but learning sbt black holes and stuff like that makes me believe theres more out there",
            "title_similarity": "0.6200814",
            "sentiment_compound": 0.0866
        },
        {
            "id": "gy91hhp",
            "score": 1,
            "text": "Most people I know who don’t believe in god were once Christians. It seems to me, religion is what turns people away from religion.",
            "title_similarity": "0.60411036",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gy91ob4",
            "score": 1,
            "text": "Well if religion were to focus less on the supernatural aspects of their beliefs and instead pivot to promoting a moral/ethical social order that perhaps would not happen.",
            "title_similarity": "0.72387356",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gy91vzo",
            "score": 1,
            "text": "Seems like the concept and practice of understanding you don’t understand much/enough would directly contradict the practice a lot of believers ive known.",
            "title_similarity": "0.58520365",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gy91w1g",
            "score": 1,
            "text": "The method of science, the goal of religion",
            "title_similarity": "0.47961485",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy92300",
            "score": 1,
            "text": "Inquiry is kind of the back bone of science so.... Yeah studying science does lead people away.",
            "title_similarity": "0.713429",
            "sentiment_compound": 0.296
        },
        {
            "id": "gy92i7p",
            "score": 1,
            "text": "Yeah, in other words; forming a hypothesis, testing that hypothesis, analysis of the evidence. It's called science.",
            "title_similarity": "0.46522576",
            "sentiment_compound": 0.296
        },
        {
            "id": "gy92j6h",
            "score": 1,
            "text": "Religion bad, science good.",
            "title_similarity": "0.5559069",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gy93q78",
            "score": 1,
            "text": "Well, science is a way of thinking, so yes it is a focus on inquiry",
            "title_similarity": "0.4736624",
            "sentiment_compound": 0.6799
        },
        {
            "id": "gy93yyw",
            "score": 1,
            "text": "I was a Christian who went to a Christian college and walked away an agnostic. They definitely emphasized inquiry and I did so much exploration and research that I realized that the Bible was incredibly fallible. That was a huge crack, and soon everything about my religious perspective fell apart. \n\nI am happy being agnostic. Sometimes I lean toward atheism, but still I feel I could never be certain.",
            "title_similarity": "0.62097174",
            "sentiment_compound": 0.497
        },
        {
            "id": "gy946xj",
            "score": 1,
            "text": "Teaching students to think for themselves makes them less religious. Who would have known?",
            "title_similarity": "0.74233854",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy94fk3",
            "score": 1,
            "text": "Uhhhh.  That basically means that doing science is more secularizing than taking scientific knowledge and applying it.  In other words, science is secularizing.",
            "title_similarity": "0.81509686",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy95bu7",
            "score": 1,
            "text": "a lot of people like to simplify religion as one narrow thing and then feel smart when they can destroy it with science. truth is, religion and science can coexist. they coexist right now, because they address different problems. it doesn't make sense to interpret a spiritual text with a material framework",
            "title_similarity": "0.80163825",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gy95bwa",
            "score": 1,
            "text": "\"We thought that knowing things made people less religious, but it turns out it's just being smart that does it\" *shrug*",
            "title_similarity": "0.75112367",
            "sentiment_compound": 0.5499
        },
        {
            "id": "gy95scd",
            "score": 1,
            "text": "Rational thinking leads people away from religion, to believe in religion you have to compartmentalize your brain to not apply the same rational scrutiny that you put everything  else through to religion.",
            "title_similarity": "0.7732754",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy95voi",
            "score": 1,
            "text": "Unsurprising, considering that most religion is a bunch of horseshit",
            "title_similarity": "0.3345176",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy96n74",
            "score": 1,
            "text": "It’s normal for older teens and young adults to temporarily lose interest in religion.  As we age, that interest grows through pursuit of curiosity, grief, and other dimensions of adult development.",
            "title_similarity": "0.62308675",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gy96p3o",
            "score": 1,
            "text": "What science does is create a set of rules that don’t require religion to work. It doesn’t invalidate it but it does make it... “unnecessary”, I guess.",
            "title_similarity": "0.7472556",
            "sentiment_compound": 0.1406
        },
        {
            "id": "gy96tlh",
            "score": 1,
            "text": "It bothers me that I’m the caption of the picture of Stanford they say it’s in Santa Clara, CA. It’s not! It’s in Stanford, near Palo Alto! Source: I go to Stanford",
            "title_similarity": "0.5158826",
            "sentiment_compound": -0.3365
        },
        {
            "id": "gy970nx",
            "score": 1,
            "text": "Im Christian but love to study buddisim and greek and roman mythology really fascinating stuff",
            "title_similarity": "0.47714642",
            "sentiment_compound": 0.9184
        },
        {
            "id": "gy977u5",
            "score": 1,
            "text": "I am getting my PhD in genetics and am Catholic. Science and religion are completely distinct in their scopes and cannot prove or disprove the other. Science cannot be used to explain the supernatural, just as religion is not meant to make sense of the natural world. We believe faith flows from reason ant that truth cannot contradict truth. Thus whenever an apparent contradiction arises, either our understanding of nature is wrong, or our interpretation of scripture. Christianity has never once been proved false, as science cannot disprove religion. It simply can’t.\n\nAs for the Bible, it isn’t a science textbook, but a collection of writings. We hold that it contains revealed truths, but not always literally. You need to consider the genres of its different books to discern when a literal interpretation is appropriate. Genesis especially isn’t meant to be taken completely literally and intelligent Christians know this. \n\nReason and inquiry are encouraged by the intelligently religious and key discoveries have been made by religious scientists (in particular Catholics btw), for it all flows from the same source.",
            "title_similarity": "0.7110895",
            "sentiment_compound": 0.9524
        },
        {
            "id": "gy97cg5",
            "score": 1,
            "text": "Wow, science is as much a religion as traditional religions. It’s just an intellectual religion, still requiring faith in some principles that have no proof or cannot be recreated. Erudites are no different than Christians, Jews, Muslims, Hindus, or Atheists, they all think they are right and more enlightened.",
            "title_similarity": "0.6960196",
            "sentiment_compound": 0.8748
        },
        {
            "id": "gy97r8q",
            "score": 1,
            "text": "what are you expecting from thousands of years old literatures? Just start with making peace with that concept first.",
            "title_similarity": "0.37556076",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gy97sx3",
            "score": 1,
            "text": "Religion is about giving answers not asking questions.",
            "title_similarity": "0.572534",
            "sentiment_compound": 0.34
        },
        {
            "id": "gy97tlp",
            "score": 1,
            "text": "College level history classes made me question everything I was ever taught including religion",
            "title_similarity": "0.50602734",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy98p6e",
            "score": 1,
            "text": "I’m religious and study astrophysics so I’ve def seen some of the full extent of the sciences (which I agree with) \nBut I think what leads people away from religion definitely is secular culture and the desire to be accepted in a society that sometimes undermines religion.\nI’d say one of the only science that may lead someone away is physics cause it really makes u question how the world works very often. But this probably isn’t the ultimate deciding factor, just one of the things that adds to it",
            "title_similarity": "0.7856281",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gy994k4",
            "score": 1,
            "text": "So learning to ask questions make people realize that religion doesn't answer all of your questions. Hence people become disillusioned.",
            "title_similarity": "0.66335005",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gy9953m",
            "score": 1,
            "text": "Nowdays there are studies who tell animals enjoy cages.\nHonestly? I never drank religion because it literally tries to do the same as science: explaining the existence. And guess what? Traditional religions always contradict science.\nMaybe science wont pull you away from guessing there might be something higher, but if we talk about mayor religions then i dont buy any study who contradict facts.",
            "title_similarity": "0.7052358",
            "sentiment_compound": -0.2168
        },
        {
            "id": "gy99njf",
            "score": 1,
            "text": "Isn't science about inquiry?",
            "title_similarity": "0.48799434",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy99vjf",
            "score": 1,
            "text": "All the rape probably isn't helping their cause.",
            "title_similarity": "0.6229652",
            "sentiment_compound": -0.7641
        },
        {
            "id": "gy9a1pz",
            "score": 1,
            "text": "Hopefully this trend continues!",
            "title_similarity": "0.13564175",
            "sentiment_compound": 0.4574
        },
        {
            "id": "gy9a64c",
            "score": 1,
            "text": "I myself am in a science major and am religious. I just don’t believe everything the Bible or church says. It’s not hard to be both",
            "title_similarity": "0.7007205",
            "sentiment_compound": 0.0762
        },
        {
            "id": "gy9ab35",
            "score": 1,
            "text": "“Science can tell us how, but it can’t tell us why”",
            "title_similarity": "0.6014371",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9aciu",
            "score": 1,
            "text": "Just crazy how the majors that teach objective observation as the basis for their research tend to do that.",
            "title_similarity": "0.6222551",
            "sentiment_compound": -0.34
        },
        {
            "id": "gy9ae3n",
            "score": 1,
            "text": "In recent decades, the **internet** killed religion, because it allows people to easily exchange views from outside their local community",
            "title_similarity": "0.6642568",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gy9as8d",
            "score": 2,
            "text": "I would argue that exposure to reality is what leads people away from religion.",
            "title_similarity": "0.6858985",
            "sentiment_compound": -0.34
        },
        {
            "id": "gy9b14e",
            "score": 1,
            "text": "You do realise science essentially is inquiry right? It's pretty much just inquiry plus.",
            "title_similarity": "0.4497987",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gy9b37n",
            "score": 1,
            "text": "Amazing that inquiring about the truth based on facts & evidence and not just taking somebody’s word for something would lead to secularism.  Really, I am shocked.",
            "title_similarity": "0.6739027",
            "sentiment_compound": 0.5478
        },
        {
            "id": "gy9b9uf",
            "score": 1,
            "text": "I love science, if I was religious I would be interested in founding religion of my own spiriitual experience.",
            "title_similarity": "0.60015714",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gy9bduq",
            "score": 1,
            "text": "Glad the study confirms what many of us suspected anyway. Ask questions. Demand answers that are logical.",
            "title_similarity": "0.45121998",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gy9bnjm",
            "score": 1,
            "text": "When you have to prove your understanding on very complex topics to a world leading expert on the topic, you tend to throw away all faulty forms of logic building and commit yourself to being objective and factual.  \n\n\nNo matter how much you want to believe the right answer is y when it's x, it's still x.",
            "title_similarity": "0.6008413",
            "sentiment_compound": 0.0325
        },
        {
            "id": "gy9bv2a",
            "score": 1,
            "text": "I only thought exposure to science curtailed religious belief because everybody ive ever talked to about this said that exposure to science removed their ability to believe in religion.",
            "title_similarity": "0.7047075",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gy9bvo7",
            "score": 1,
            "text": "When people are given both the opportunity and tools to question the world around them, they start to see it for what it is.",
            "title_similarity": "0.36544245",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gy9cbgu",
            "score": 1,
            "text": "Religion thrived because there was no internet",
            "title_similarity": "0.46455503",
            "sentiment_compound": -0.296
        },
        {
            "id": "gy9ccc8",
            "score": 1,
            "text": "I feel like the title and article push a science vs religion narrative. When in actuality, most people highly educated in science or religion understand that the 2 can go hand in hand. At the end of the day, we just need an answer to 1)is there life after death and 2) are we made by chance or god. Unfortunately, you'll never get any clear proof like people want. You just choose which makes most sense to you.",
            "title_similarity": "0.69880015",
            "sentiment_compound": 0.7443
        },
        {
            "id": "gy9ccnp",
            "score": 1,
            "text": "Inquiry. Yep. The only way religion works is if you stop asking questions.",
            "title_similarity": "0.5441587",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9cczb",
            "score": 1,
            "text": "I have long felt the the rote job training of STEM education is lacking compared to the classic liberal arts like history and philosophy.\n\n Engineers who never learned Kant should not be allowed to design the next generation of artificial intelligence.",
            "title_similarity": "0.76777077",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gy9ck30",
            "score": 1,
            "text": "Religions drive away their own.",
            "title_similarity": "0.36545306",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9cy8l",
            "score": 1,
            "text": "This is true from what I've seen. College majors who studied things like engineering still tend to be heavily as religious as they were when they got into college whereas majors who studied things like philosophy and psychology tend to become more atheist. In those fields, you are trained to ask questions about how things are created and why whereas in other fields you don't apply that mentality to digging deeper into the fundamentals of reality. So the scope of view isn't as grand because it doesn't lead to them asking questions why we're all here and what's at the end of this journey. At least, I haven't seen business majors asking such questions.",
            "title_similarity": "0.865667",
            "sentiment_compound": 0.7446
        },
        {
            "id": "gy9dhwk",
            "score": 1,
            "text": "Einstein believed in god",
            "title_similarity": "0.41711056",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gy9e03r",
            "score": 1,
            "text": "In my youth group we studied about a ton of other religions. That’s what got me out of the religious cycle.",
            "title_similarity": "0.50512123",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9e215",
            "score": 1,
            "text": "Study: Exposure to Critical Thinking May Cause People to Question the Legitimacy of Fairytales.",
            "title_similarity": "0.5426805",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy9el8e",
            "score": 1,
            "text": "I majored in cell & molecular biology with a minor in religion. I just graduated this past week with my doctorate. My faith has been made stronger the more I learn about science",
            "title_similarity": "0.54567564",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gy9f0wm",
            "score": 1,
            "text": "A superficial look into science will make u think u understood how the world works and it has nothing to do with superpowers. \n\nA deep look into science will make you always put questions even if u don't believe in god , a reasonable person would always put this idea as a possibility .",
            "title_similarity": "0.71981186",
            "sentiment_compound": -0.2057
        },
        {
            "id": "gy9f3p1",
            "score": 1,
            "text": "So its not about the science, but the analytical tools that science provides?\n\n...Right, thanks",
            "title_similarity": "0.6104476",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gy9fl3q",
            "score": 1,
            "text": "Hot take: university taught me how to be even more skeptical and inquisitive than I already was.",
            "title_similarity": "0.61652756",
            "sentiment_compound": -0.1604
        },
        {
            "id": "gy9g38c",
            "score": 1,
            "text": "Weird how teaching people to think causes religion to be left by the wayside. So bizarre.",
            "title_similarity": "0.64349633",
            "sentiment_compound": -0.5706
        },
        {
            "id": "gy9g8ru",
            "score": 3,
            "text": "...But isn’t inquiry an essential element of science itself?",
            "title_similarity": "0.55954665",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9gmgv",
            "score": 1,
            "text": "As a very religious person I will say that people who are blindly religious are the most irritating thing to me, you should absolutely stop and ask questions, if you can't get answers you need to be able to learn and form your own conclusions. That being said sometimes the answer is just I don't know, and it can be infuriating but if you have every answer I guess you don't really need faith do you?\n\nOne of the biggest/most irritating points is the \"Well why would I listen to someone who believes the world was created in 7 days\" I don't LITERALLY believe the world was created in 7 days... Time is subjective our days are not the equal to the \"days\" an all powerful creator may see. Holy crap I believe in dinosaurs, yup there's obvious proof they were here they are fascinating, why were they here? I don't know. But they were.",
            "title_similarity": "0.66754436",
            "sentiment_compound": 0.168
        },
        {
            "id": "gy9hxd7",
            "score": 1,
            "text": "Some people actually find God _through_ academic, secular research.",
            "title_similarity": "0.61467457",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gy9i30s",
            "score": 1,
            "text": "Uhh, wasn’t einstein and neils bohr both religious? I don’t see a correlation between being scientifically literate and a decline in religiousness",
            "title_similarity": "0.73023546",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9ikmj",
            "score": 1,
            "text": "How come every post I see on this sub was posted by OP\n\nThese articles are awful",
            "title_similarity": "0.251822",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gy9inxh",
            "score": 1,
            "text": "I wish there was more of a differentiation made between someone having a belief in god/creator/ a reason for existence/reality, questioning how, why, when, where etc... The enquiring mind, a scientific mind seeking answers to questions as to why they exist for a purpose or not etc.... and man made religions with rules and punishments (supposedly for gods benefit) (you need to cut off a bit of your penis/bow down facing a portion of meteorite in a giant black cube/ only eat fish on a Friday, don't eat pork, don't eat shellfish, left handed people are evil etc etc) .. .... There might be a few similarities between people that believe in god/creator of reality and religious followers , but oh so many more differences... They are not the same thing.",
            "title_similarity": "0.6510577",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gy9jjzb",
            "score": 1,
            "text": "And the fact that it’s utter nonsense.",
            "title_similarity": "0.119964905",
            "sentiment_compound": -0.4576
        },
        {
            "id": "gy9jkc1",
            "score": 2,
            "text": "I can at least confirm it was after my philosophy 101 class that I stopped believing, so yeah, so critical thinking really goes a long way.",
            "title_similarity": "0.5970434",
            "sentiment_compound": -0.4074
        },
        {
            "id": "gy9jt7w",
            "score": 1,
            "text": "Studying the Great Books was an inquiring process that brought me deeper into religion",
            "title_similarity": "0.51932544",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gy9jvn0",
            "score": 1,
            "text": "Atheism is a religion",
            "title_similarity": "0.37594366",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9k2uv",
            "score": 1,
            "text": "This 'traditional claim' is almost entirely unique to the USA",
            "title_similarity": "0.31965238",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9kif2",
            "score": 1,
            "text": "Philosophy more than biology makes sense.",
            "title_similarity": "0.54762113",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9kpzx",
            "score": 1,
            "text": "It brought me closer to “god”",
            "title_similarity": "0.19004698",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9ku9d",
            "score": 1,
            "text": "Religion is a cancer on humanity.",
            "title_similarity": "0.5230859",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gy9l29k",
            "score": 1,
            "text": "Do these \"inquiry focused\" majors also have a lower percentage of wokesters?",
            "title_similarity": "0.56856394",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gy9l3lb",
            "score": 1,
            "text": "That pesky critical thinking strikes again",
            "title_similarity": "0.2591575",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gy9l4yy",
            "score": 1,
            "text": "Growing up in the Midwest I found this to be true. I think most of my science teachers were religious. Most Christians I know find that science just glorifies God.",
            "title_similarity": "0.45140892",
            "sentiment_compound": 0.8316
        },
        {
            "id": "gy9l6hu",
            "score": 1,
            "text": "Religions have a long history of hating critical thinkers.",
            "title_similarity": "0.47420603",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gy9lggs",
            "score": 1,
            "text": "This is exactly the kind of thing science would say to hide the truth from us!",
            "title_similarity": "0.51247406",
            "sentiment_compound": 0.2244
        },
        {
            "id": "gy9llta",
            "score": 1,
            "text": "A lot of this “I hate religion” tends to just be I hate human nature. Everything is corruptible.",
            "title_similarity": "0.42442352",
            "sentiment_compound": -0.8126
        },
        {
            "id": "gy9lq07",
            "score": 1,
            "text": "Intelligence, it’s intelligence that leads people away",
            "title_similarity": "0.4319403",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gy9ltvn",
            "score": 1,
            "text": "Inquiry is science. What we understand as science is the process to handle the Inquiry test verify loop.\n\nSo, title is self contradictory.",
            "title_similarity": "0.5715276",
            "sentiment_compound": -0.34
        },
        {
            "id": "gy9lyfz",
            "score": 1,
            "text": "Scepticism and critical thinking are the keys.",
            "title_similarity": "0.35499176",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gy9mad2",
            "score": 1,
            "text": "What traditional claim that people who study science break away from religion? That’s a bunch of baloney. There are many Christian priests who are scientists and have been dating back over a thousand years. \n\nThe Catholic Church knew the earth was round long before anyone else. About 500 years before. Nikola Tesla was a Serbian orthodox believer. And he gave us electricity. Arguably the greatest scientist of all time. \n\nReligious people are scientists. Always have been. All through history.",
            "title_similarity": "0.50046986",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gy9mf95",
            "score": 1,
            "text": "Weird seeing a ton of comments that are simple anecdotes that don't even touch what the study said. I guess r/science comments rules aren't as strict as they let on.",
            "title_similarity": "0.6885343",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gy9mi00",
            "score": 1,
            "text": "\"Pre law students ranked the absolute lowest in secularization\" in a study that suggests secularization in college is strongly related to studying inquiry based learning. Don't lawyers have a great need for inquiry? Seems like a slam on the poorly conceived notion of pre law.",
            "title_similarity": "0.74441975",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gy9mqxs",
            "score": 1,
            "text": "Quite interesting. \n\nSome science requires rote memorization as opposed to inquiry - IE medicine. That's why so many physicians and nurses are also hardcore fundamentalists and creationists.",
            "title_similarity": "0.64392185",
            "sentiment_compound": 0.5413
        },
        {
            "id": "gy9mree",
            "score": 1,
            "text": "So...what majors make people less religious?",
            "title_similarity": "0.6048918",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9mvmf",
            "score": 1,
            "text": "This is why inquiry is something not touted as good in the New Testament. Questioning is bad....",
            "title_similarity": "0.55833066",
            "sentiment_compound": -0.7317
        },
        {
            "id": "gy9my00",
            "score": 1,
            "text": "I find it funny that when I majored in philosophy i became religious within 6 months. Had been an atheist for years.",
            "title_similarity": "0.4458907",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gy9n2d1",
            "score": 1,
            "text": "If studying science doesn't make you more inquisitive you should transfer",
            "title_similarity": "0.76543134",
            "sentiment_compound": 0.2484
        },
        {
            "id": "gy9n6hj",
            "score": 1,
            "text": "I lost my religion in college studying history.",
            "title_similarity": "0.5550809",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gy9npby",
            "score": 1,
            "text": "Exposure to science brought me closer to religion. I started to understand a lot of what the Holy texts were saying when I understood how nature works. I'm Muslim for reference and I believe this study only took into account a certain group of Protestant Christians). \n\nI think an unbalanced exposure to either science or religion ends up distancing people from religion. Although that seems contradictory, I've noticed it many times. You would have a extremely \"religious\" person talking against some science tidbit not knowing that his/her religious texts clearly affirm that exact science tidbit. On the other hand, you'll have prominent atheists, who make a living bashing religion, quoting science as proof of their claims, not knowing that the religion clearly includes that which they are mentioning. \n\nNow in regards to the majors which focus on inquiry, I wonder if it has more to do with the fact that those majors teach students how to question, but not how to find answers. Sure you get to think about an issue, but more focus is given to concluding based on your own opinion (quoting the opinions of other people who are more often than not thinkers themselves rather than subject matter experts), rather than searching for answers directly from primary sources.",
            "title_similarity": "0.6890735",
            "sentiment_compound": 0.8126
        },
        {
            "id": "gy9o3xd",
            "score": 1,
            "text": "And that's why the humanities are constantly under attack...",
            "title_similarity": "0.29472667",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gy9o8l3",
            "score": 1,
            "text": "One year of Sociology studies turns many towards non theist thinking.",
            "title_similarity": "0.4902512",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9ob4l",
            "score": 1,
            "text": "Studying is bad and in American.  It leads to thinking.  Also bad.",
            "title_similarity": "0.48587656",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gy9olcy",
            "score": 1,
            "text": "I don’t understand people who are very inquisitive in science and math, wanting to understand why formulas work, but then just accept religion at face value. I truly don’t understand why religion is such a big thing.",
            "title_similarity": "0.74292207",
            "sentiment_compound": 0.8967
        },
        {
            "id": "gy9ozyj",
            "score": 1,
            "text": "Which is why there are so many deeply religious doctors and psychologists/psychiatrists.",
            "title_similarity": "0.3701504",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9p4e9",
            "score": 1,
            "text": "Important to note: inquiry based learning will also secularize you away from the Church of Science as well. \n\nMainstream politicized science is just another de facto religion.",
            "title_similarity": "0.8287147",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gy9pcf2",
            "score": 1,
            "text": "Really hated religious education, it was however mandatory. \nThose were the only lessons that I was absent \"without reason\" from.\nOffered to do the religious education time in any other subject as I did, and still do view religious texts as a waste of time (you are graded on remembering the delusions of those long dead, you are graded on your memory and recollection of those long dead), alas.... young me learned the word mandatory....\n\nI did not find a higher power or god, but I did find smoking around 6 weeks later as I skipped more religious education classes.",
            "title_similarity": "0.63475263",
            "sentiment_compound": -0.8247
        },
        {
            "id": "gy9pfd7",
            "score": 1,
            "text": "UK national curriculum in the 80s/90s featured a lot of critical thinking skills, and I think has contributed to such a drop in religious tendencies.",
            "title_similarity": "0.5699383",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gy9plf7",
            "score": 1,
            "text": "Cool. I'm studying science but Im still religious. Ive just been a lot more liberal with my beliefs. I've accepted that things in the bible don't make sense and that it's okay if what science says is contrary to what I believe. I'll believe in both.",
            "title_similarity": "0.75815934",
            "sentiment_compound": 0.6858
        },
        {
            "id": "gy9pwnj",
            "score": 1,
            "text": "Is this why economy majors are so batshit insane?",
            "title_similarity": "0.46594515",
            "sentiment_compound": -0.4549
        },
        {
            "id": "gy9qt0k",
            "score": 1,
            "text": "love how this assumes that through inquiry people become secularized, but that the inverse cant or doesnt often happen.",
            "title_similarity": "0.7112239",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gy9r8vh",
            "score": 1,
            "text": "You can't get rid of religion. People will find something else to be dogmatic about. \n\nSee wokeism.",
            "title_similarity": "0.64376426",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9rca6",
            "score": 1,
            "text": " Being bombarded in second grade parochial school and told that the class was going to partake in reconciliation during afternoon mass was the beginning of my questioning Catholicism. The principal called my parents because I asked why I should be partaking in reconciliation and speaking to the mean priest if we could talk to God ourselves whenever we felt the need to. \n\nAnd then there was my question getting shutdown in catholic high school religion class regarding  the catholic archdiocese sex abuse scandal in Boston.  It’s not a coincidence that the adults who had a responsibility to teach me about the religion helped me turn away from it.",
            "title_similarity": "0.60124767",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gy9skt0",
            "score": 1,
            "text": "I graduated with a bachelors in biology from a Christian university and I can 100% say that studying the Bible is what made me less religious",
            "title_similarity": "0.566612",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9srul",
            "score": 1,
            "text": "For me, i was raised in a cult and for a long time was very bitter about it. Learning about religion in an academic sense, especially Islam and Hinduism, has really openned my eyes to the advantages and disadvantages to religion. I approach it from a far more secular POV but i can still appreciate the beauty in some of the doctrine/culture.",
            "title_similarity": "0.6452321",
            "sentiment_compound": 0.8226
        },
        {
            "id": "gy9svm9",
            "score": 1,
            "text": ">The college majors with the highest effect on secularization were women's studies, anthropology, physics and philosophy, while the majors with the lowest effect were physical education, nursing, theology and kinesiology. **Pre-law studies ranked the absolute lowest. **\n\nWell, that's...odd. I'm not that familiar with the curricula of dedicated pre-law programs (the attorneys I know all had normal majors), but I'd expect them to have a very heavy overlap with philosophy and history, which are \"inquiry-based.\"\n\nThis makes me suspect that the observed effect has less to do with the majors themselves than with the kinds of people who choose them. I suspect that there's a hidden personality variable (openness to experience, probably) that's not being captured by the demographic control variables.",
            "title_similarity": "0.7149737",
            "sentiment_compound": -0.3716
        },
        {
            "id": "gy9t0t7",
            "score": 1,
            "text": "Why do the posts on this sub rarely have anything to do with science?",
            "title_similarity": "0.5651965",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9tjnc",
            "score": 1,
            "text": "Actually science and my inquisitive nature are what led me away. No college necessary.",
            "title_similarity": "0.6385808",
            "sentiment_compound": -0.128
        },
        {
            "id": "gy9tuls",
            "score": 3,
            "text": "I'm a former atheist, born into a secular family, learned about evolution and studied materialist philosophy etc. Was completely satisfied with my life, with god not being real and with no life after death. \n\nI started opening up to religion having at least some answers around 3 years ago. It was a gradual process, it first began after I found out that a lot of modern mathematicians and physicists were religious in some form. I went into it with the idea I would salvage the few good parts and disregard the fiction, I ended up being a trinitarian theist. \n\nI'm more interested in science of all forms than I was before, and I constantly try to seek truth with an open mind. \n\nSo no, exposure to science doesn't kill faith. The decline of \"religiosity\" in the modern world is an incredibly complex phenomenon and can't be explained away by: haha religion old and stupid - we moderns smart and rational.",
            "title_similarity": "0.64909136",
            "sentiment_compound": 0.8356
        },
        {
            "id": "gy9tutq",
            "score": 1,
            "text": "Well gee I wonder why the field of study about asking questions and applying your mind would lead people away from religion",
            "title_similarity": "0.6982749",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gy9u7mb",
            "score": 1,
            "text": "I thought it was seeing how hypocritical some religious people can be, that made others less religious.",
            "title_similarity": "0.6464772",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gy9v8dm",
            "score": 1,
            "text": "I've always found that studying science, due to all the crazy miracles and phenomenon, makes me somewhat more religious (spiritual, at least).",
            "title_similarity": "0.58433044",
            "sentiment_compound": -0.34
        },
        {
            "id": "gy9vpdc",
            "score": 1,
            "text": "People who study science think everything through...  it’s basic history that showed me that whatever religion is now is just political.",
            "title_similarity": "0.5714271",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9wukn",
            "score": 1,
            "text": "Isn’t science a field of inquiry though?",
            "title_similarity": "0.5542074",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9wwvb",
            "score": 1,
            "text": "The extremists in it made me less religious.",
            "title_similarity": "0.63564694",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9xcnx",
            "score": 1,
            "text": "Raised Fundamental Baptist (the Bible is literal) and grew up in private Christian schools. Went to public school at 14 for HS - starting to question things.\nFF 20 years, both my brother and I question so much. He is 100% Atheist and I am now more aligned with Buddhism.",
            "title_similarity": "0.5158351",
            "sentiment_compound": 0.5473
        },
        {
            "id": "gy9xx0t",
            "score": 1,
            "text": "Isn't it crazy that knowing that human beings truly know nothing will lead people to being ok with religion.",
            "title_similarity": "0.7051024",
            "sentiment_compound": 0.7299
        },
        {
            "id": "gy9yoqh",
            "score": 1,
            "text": "There aren’t any atheists in foxholes.",
            "title_similarity": "0.31281227",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9ys1a",
            "score": 1,
            "text": "Which fields blindly apply knowledge?",
            "title_similarity": "0.3533266",
            "sentiment_compound": 0.0
        },
        {
            "id": "gy9z1t8",
            "score": 1,
            "text": "The more I know about science, the more I believe in God heretic.",
            "title_similarity": "0.6673377",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gy9z3qu",
            "score": 1,
            "text": "i'm a master science student and i'd say studying science do not make one less religious but studying religions did, at least for me.\n\nmy whole life before adulthood, i was exposed and learnt about only 1 religion and when i reached adulthood, i exposed and learnt about other religions. this is what made me became non-religious. still a 'believer' tho.",
            "title_similarity": "0.691458",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gya0560",
            "score": 1,
            "text": "The search for knowledge can have two effects; it can strengthen your beliefs or it can completely change your beliefs.  What's important is that our children can make decisions for themselves.",
            "title_similarity": "0.54874414",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gya1z67",
            "score": 1,
            "text": "When I was 12 years old, my first existential crisis was the result of researching the validity of \"miracles\" on Google.  The miracles were really the corner stone of my faith.  When I found out I've been lied to my entire life, my religiosity dropped to zilch.\n\nSo, yes.  If science is defined as truth, then it is absolutely detrimental to religion.",
            "title_similarity": "0.6199792",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gya22fv",
            "score": 1,
            "text": "I am doctor yet religious and medicine helped me become more religious. How many religions in this world, how many ways people can understand the same sentence with different meaning, how many students became less religious “in numbers or percent”, what are the questions, the survey was mandatory or optional? Many things need to be reviewed before we judge the validity of this study. They should change the title to (people who study women study, anthropology, physics and philosophy at university of california, los angeles become less religious) to not misleading the title readers.",
            "title_similarity": "0.77920544",
            "sentiment_compound": 0.4325
        },
        {
            "id": "gya2id7",
            "score": 1,
            "text": "It was ap world history in high school that made me no longer a Christian",
            "title_similarity": "0.5878874",
            "sentiment_compound": -0.296
        },
        {
            "id": "gya2vlt",
            "score": 1,
            "text": "Isn’t inquiry just a less strict scientific method? Can someone tell me how many college majors are not social science or a pure science? Doesn’t that just leave a few fine arts degrees?",
            "title_similarity": "0.77870905",
            "sentiment_compound": 0.2824
        },
        {
            "id": "gya3uv8",
            "score": 1,
            "text": "Man, so many great points! I would also like to add that the strictness of the religion or if it is a fundamentalist/literalist religion also plays a role. I notice that people from fundamentalist religions tend to end up being non-religious when exposed to college and that people from more liberal/moderate religious upbringings maintain their religiosity.",
            "title_similarity": "0.77794576",
            "sentiment_compound": 0.8347
        },
        {
            "id": "gya48d1",
            "score": 1,
            "text": "faith and religion are different things.\n\nall major religion is outdated corrupted garbage. New religion has to come and it should not have any contradiction with science...",
            "title_similarity": "0.6360363",
            "sentiment_compound": 0.5484
        },
        {
            "id": "gya4hqz",
            "score": 1,
            "text": "Science isn't what leads people away from religion. Albert Einstein was a believer. \n\nThe church can only blame itself for a hostile dogma that drives people away. Not just atheists, but christians have stepped down church attendance as well.",
            "title_similarity": "0.7588706",
            "sentiment_compound": 0.0387
        },
        {
            "id": "gya4l2o",
            "score": 1,
            "text": "Exposure to science doesn’t drive people away from religion.\n\nIt’s the people who use religion to harm others or force aspects of it upon others that drive them away. \n\nI’d like to think I’m fairly religious, but seeing how the local church treated my father when he was ill and on the brink of poverty, ill never go back for a service there. But that wasn’t the religion as a whole, that was because of the people.",
            "title_similarity": "0.7661811",
            "sentiment_compound": -0.9239
        },
        {
            "id": "gya5egn",
            "score": 1,
            "text": "Science and critical thinking has done MORE to solidify my faith in Christianity than anything else!",
            "title_similarity": "0.62396026",
            "sentiment_compound": 0.2003
        },
        {
            "id": "gya61ge",
            "score": 1,
            "text": "I found myself out of religion after **winning** a debate about a very feared religion. One in which I was raised and soaked. I won the debate, I proved the person wrong about their point against what was my religion back then and then I realized how blinding of a power religion has on a person. The “smarter” you are the more damage you can do because you can debate your way into any illogical actions.",
            "title_similarity": "0.7040192",
            "sentiment_compound": -0.4563
        },
        {
            "id": "gya68ff",
            "score": 1,
            "text": "i’m a philosophy major and reading Nietzsche made me turn away from religion",
            "title_similarity": "0.57967997",
            "sentiment_compound": 0.0
        },
        {
            "id": "gya6w8e",
            "score": 1,
            "text": "Some common sense is what takes away the delusions of a magic man in the sky... you read the bible and there is more magic and crap than lord of the rings",
            "title_similarity": "0.5822076",
            "sentiment_compound": -0.4336
        },
        {
            "id": "gya6xwh",
            "score": 1,
            "text": "I've never seen a scientific study done on the *type* of religion when secularization occurs.\n\nI've been a pastor for more than 30 years, and I've seen LOTS of teens from very controlling, repressively religious homes go buck wild when they got out from under control of that environment.\n\nI've also seen numerous teens (including my own) who were raised in a home where it was encouraged to question everything (religion especially) who didn't lose their faith as they were exposed to deeper learning environments.\n\nDoes anyone know of a study (my guess would be sociology, or perhaps ethnography) that has dealt with that topic? I'd be **very** interested to read that!",
            "title_similarity": "0.5052484",
            "sentiment_compound": 0.4012
        },
        {
            "id": "gya75lc",
            "score": 1,
            "text": "Once you start asking reasonable questions, religion mostly falls apart. That's why they say walk by faith, not by sight. You're not supposed to question anything. Just  tithe and pray!",
            "title_similarity": "0.6189089",
            "sentiment_compound": 0.6588
        },
        {
            "id": "gya8dkf",
            "score": 1,
            "text": "Science IS the inquiry though. Science is the method by which we acquire knowledge.",
            "title_similarity": "0.48840594",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyaa068",
            "score": 1,
            "text": "Hence the push toward vocational programs and applied sciences... a questioning population is dangerous to those in power. Learning a sequence of movements or formulas is basically plug and play disguised as \"education.\"",
            "title_similarity": "0.62427205",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gyaagqy",
            "score": 1,
            "text": "I like how the picture is taken right in front of the Stanford Memorial Church",
            "title_similarity": "0.31003517",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gyaahy3",
            "score": 1,
            "text": "Logic and knowledge lead people away from blind faith in religion. It’s really obvious once you know the history of religion that they’re all stories passed down through the ages and altered slightly each time their used. Originally people worshipped the sun and eventually it became the son. I think they had the giver of life right the first time...",
            "title_similarity": "0.6135473",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gyaakv5",
            "score": 1,
            "text": "Yeah it’s called “indoctrination”.",
            "title_similarity": "0.11342137",
            "sentiment_compound": 0.296
        },
        {
            "id": "gyabf07",
            "score": 1,
            "text": "Some of us have different religions",
            "title_similarity": "0.29298365",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyablss",
            "score": 1,
            "text": "The more you read into religious texts, the more bizzare and fictitious sounding they become",
            "title_similarity": "0.5260296",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyad8a8",
            "score": 1,
            "text": "I’m always interested to know what people think “science” is. Or if they know what they are saying when they say “trust the science” and what not.",
            "title_similarity": "0.5643273",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gyadp9v",
            "score": 1,
            "text": "Nothing makes people move away from religion like studying the bible.",
            "title_similarity": "0.54822594",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gyae7vd",
            "score": 1,
            "text": "If I understand the statement right, learning to ask questions vs. Monkey do, leads to people not being religious?",
            "title_similarity": "0.66415584",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyaebpr",
            "score": 1,
            "text": "Science… is inquiry, other majors are just comprehensive rundowns of things that have been spewed about through history",
            "title_similarity": "0.5167053",
            "sentiment_compound": 0.25
        },
        {
            "id": "gyaemd7",
            "score": 1,
            "text": "We should all focus on inquiry, we don’t know everything",
            "title_similarity": "0.3655206",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyaf3da",
            "score": 1,
            "text": "    There are more things in heaven and earth, Horatio, \n    Than are dreamt of in your philosophy. \n    - Hamlet (1.5.167-8)\n\nIn the olden days, \"Science\" and \"Philosophy\" were synonymous.",
            "title_similarity": "0.50650495",
            "sentiment_compound": 0.552
        },
        {
            "id": "gyafc44",
            "score": 1,
            "text": "Critical thinking does amazing things",
            "title_similarity": "0.20924935",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gyafdkw",
            "score": 1,
            "text": "without inquiry science is religion",
            "title_similarity": "0.5267815",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyafln5",
            "score": 1,
            "text": "Religion is what makes students less religious. Can't pretend it's  not Santa claus for grown ups. It's pretty see through.",
            "title_similarity": "0.81671405",
            "sentiment_compound": 0.4994
        },
        {
            "id": "gyagqma",
            "score": 1,
            "text": "What leads intelligent people away from religion is the hypocrisy and complete fictional agenda and it's inability to relate to reality",
            "title_similarity": "0.650787",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gyahfl9",
            "score": 1,
            "text": "If you believe in religion then you have no place in the education or science fields. You've already chosen unproven things and lies over fact and logic.",
            "title_similarity": "0.6481415",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gyaiykp",
            "score": 1,
            "text": "I view them both as equals. Sciences answers *how* and possibly *when*, while religion answers *why*.",
            "title_similarity": "0.5033177",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyajbqk",
            "score": 1,
            "text": "As a Buddhist we have been taught to do not believe from what we are told but try the practice by ourselves and see the result. Very sciencetific method to me",
            "title_similarity": "0.64586294",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyajgn7",
            "score": 1,
            "text": "The crux of any science is inquiry. The study of almost any discipline is \"technically\" a science.",
            "title_similarity": "0.44053847",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyajjmq",
            "score": 1,
            "text": "Anthropology will do it too .",
            "title_similarity": "0.21606712",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyak3ar",
            "score": 1,
            "text": "I started a Masters in Theology believing in God. I graduated an atheist.",
            "title_similarity": "0.4928961",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gyal101",
            "score": 1,
            "text": "It’s the religious scientists that I find baffling.  \n\nOn Friday:  ‘That reaction will never work, because the kM for the enzyme is an order of magnitude too high at that pH and salt concentration’.  \n\nOn Sunday:  ‘God buried the dinosaur skeletons underground to bamboozle the faithless’",
            "title_similarity": "0.60039806",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gyal129",
            "score": 1,
            "text": "Agreed, or at least plausible. Even study of theology (and not just doctrine) tends to adjust views on religiosity. The topic is less relevant than the method when it comes to reduction of zealotry in all but a few outlying cases.\n\n&#x200B;\n\nedit: I don't mean to suggest study makes you an atheist, just that it usually makes you less of a hardline fundamentalist",
            "title_similarity": "0.78520703",
            "sentiment_compound": 0.1406
        },
        {
            "id": "gyaleck",
            "score": 1,
            "text": "Inquiring about things is stressful for clergy",
            "title_similarity": "0.37791562",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gyalt9p",
            "score": 1,
            "text": "For me it was world history class. I learned about all the wars fought over religion and such. I was in a science/medical related major and those classes didn’t turn me off of religion at all.",
            "title_similarity": "0.5902549",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gyamr80",
            "score": 1,
            "text": "inquiry probably makes the religious more irreligious and the irreligious more religious",
            "title_similarity": "0.609095",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyane5p",
            "score": 1,
            "text": "I am a Christian and studying science didn't make me less religious because science and religion ask two different questions how and why",
            "title_similarity": "0.7271958",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyapo8b",
            "score": 1,
            "text": "Is the science subreddit a more intelligent r/atheist?",
            "title_similarity": "0.68961525",
            "sentiment_compound": 0.5095
        },
        {
            "id": "gyarq56",
            "score": 1,
            "text": "I wonder if this study only counts undergraduates? I ask that because even professionals like lawyers and doctors usually have majored in something that focuses on inquiry like political science, philosophy or biology.",
            "title_similarity": "0.58907765",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gyasssd",
            "score": 1,
            "text": "So I just want to talk about my own science/religion journey on here.  I was brought up Christian, as many kids during the 90’s in the US were at the time.  While I was a kid I thought it was the only way to be—I was even embarrassed when I didn’t get to church.\n\nSlowly, as I started to learn about my religion, I became distanced from it.  By the time I was a teenager I claimed I was an atheist. (Most of that was Teenage edge lord, but still.)\n\nI go to college with this attitude.  I major in Physics.  Professor says, “There are 2 ways people can study God, study to become a priest or study to become a scientist.”  That little quote always stuck with me.  I wouldn’t say the more I studied the closer I got to God, but I always did find the coincidences for the existence of life to be just absolutely mind-blowing.  (Along with the complexity of even the simplest life.)  NOW I KNOW that does not mean God exists.  Nobody should EVER look at a complicated system and explain it away as being created by God.  (As Michael Shermer would say, it’s the end of the causal chain.  There’s nothing wrong with saying that, it just doesn’t add any new understanding to it.)\n\nWell, years later I’m still at a quandary with my religion.  A civics teacher says that life is not fair. (To me asking about everyone but Christians going to hell.)  Then explained that life is not fair, why should the after-life be fair?  That kinda stuck with me too, why would a God that created a world where there is injustice and there is no sense of natural “fairness” concern themselves with making entry into heaven fair?\n\nThat kinda swayed me back towards religion...  I know that sounds kinda f-ed up, and it is.  I know this story doesn’t have a nice little conclusion—or even a middle and beginning.  But there we go.",
            "title_similarity": "0.63509077",
            "sentiment_compound": 0.9052
        },
        {
            "id": "gyb5jpj",
            "score": 1,
            "text": "I am more appalled that some atheists thought they are intelectually superior just by disbelieving in any deity. I live in a Muslim majority country so that means I am also surrounded by educated and non-educated religious alike. It doesnt stop us from excelling in any Science field. Quite common to see professors and field experts wearing hijab. And usually the loud atheists one dont really have any significant achievement in Science.",
            "title_similarity": "0.7055961",
            "sentiment_compound": 0.769
        },
        {
            "id": "gyb7fzd",
            "score": 1,
            "text": "I would say History instead of Science",
            "title_similarity": "0.59274757",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyb8k26",
            "score": 2,
            "text": "Asking questions was what got me kicked out of Methodist Confirmation class. This makes sense and I’m glad to hear it!",
            "title_similarity": "0.52941525",
            "sentiment_compound": 0.5093
        },
        {
            "id": "gybdgjk",
            "score": 1,
            "text": "Understanding religion makes people less religious.",
            "title_similarity": "0.6549155",
            "sentiment_compound": 0.0
        },
        {
            "id": "gybi3bv",
            "score": 2,
            "text": "Neil DeGrasse Tyson: I want to put on the table, not why 85% of the members of the National Academy of Sciences reject God, I want to know why 15% of the National Academy don’t.",
            "title_similarity": "0.55424696",
            "sentiment_compound": 0.0
        },
        {
            "id": "gycpcpu",
            "score": 1,
            "text": "Reading the bible is what kills religous belief.",
            "title_similarity": "0.51359683",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gyfjqqg",
            "score": 1,
            "text": "Seeing how hateful Evangelicals are towards anyone different turned me off of religion in college. Also, seeing supposedly religious people support Trump of all people sealed the deal. Utter madness.",
            "title_similarity": "0.67402315",
            "sentiment_compound": -0.5709
        },
        {
            "id": "gz4a4e3",
            "score": 1,
            "text": "Correlation not causality",
            "title_similarity": "0.25774425",
            "sentiment_compound": 0.0
        }
    ]
}