{
    "17 US states implemented laws allowing people age >21 to possess, use and supply limited amounts of cannabis for recreational purposes. This has led to a 93% decrease in law enforcement seizures of illegal cannabis and >50% decrease in law enforcement seizures of heroin, oxycodone, and hydrocodone.\n": [
        {
            "id": "gyfjfqi",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.39102805",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gyfz7ii",
            "score": 1,
            "text": "Oh imagine that, access to an organic painkiller lowers the use of opiates!",
            "title_similarity": "0.5154084",
            "sentiment_compound": -0.2003
        },
        {
            "id": "gyfx67b",
            "score": -28,
            "text": "16,800 overdose deaths in 1999. \n\n70k overdose deaths in 2019.\n\n84,000 overdose deaths in 2020. \n\nOpioids are the most deadly. Oregon recently made Heroin a non-criminal offense. Despite it being the single most deadly killer since 1999. \n\n\\------------------------------\n\n\n841,000 people have died since 1999 of overdoses. 10% of which died in 2020. The source for my numbers is. \n\nhttps://www.cdc.gov/drugoverdose/data/statedeaths.html\n\n---------------\n\nDecriminalization and normalization of drugs reduce the effect of incarcerations on society, at the cost of more deaths.",
            "title_similarity": "0.7914586",
            "sentiment_compound": -0.9515
        },
        {
            "id": "gyfuini",
            "score": 15,
            "text": "Oh no I wonder what local police departments will do without all that money they steal from minor drug offenders!!",
            "title_similarity": "0.6319603",
            "sentiment_compound": -0.8168
        },
        {
            "id": "gyfytg2",
            "score": -3,
            "text": "It's the law, not the cops.",
            "title_similarity": "0.18638802",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyg302f",
            "score": -17,
            "text": "[deleted]",
            "title_similarity": "0.12236753"
        },
        {
            "id": "gyhgnpa",
            "score": 0,
            "text": "the entire basis of cannabis being illegal is literally racism and land theft (texas first state to make illegal and started the marijuana smear propaganda to make white people afraid of mexicans.) and to silence political opposition (nixon)",
            "title_similarity": "0.6313676",
            "sentiment_compound": -0.9413
        },
        {
            "id": "gyfzf0y",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.12236753"
        },
        {
            "id": "gyfwdir",
            "score": 7,
            "text": "Are the closures of a lot of pill mills also part of this???\n\nWeed should be legal country wide and be the preferred treatment over oxy or hydrocodone\n\nBut we all know why it's not..... Cus another green rules America",
            "title_similarity": "0.5884367",
            "sentiment_compound": 0.1999
        },
        {
            "id": "gyg3zqe",
            "score": 2,
            "text": "Oww no.. But how will they fill all the prisons now??",
            "title_similarity": "0.38570172",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyg6ahg",
            "score": -1,
            "text": "Can we stop calling it medical marijuana, I think we all know what it's really being used for.",
            "title_similarity": "0.43380702",
            "sentiment_compound": -0.296
        },
        {
            "id": "gyfjicb",
            "score": 33,
            "text": "[deleted]",
            "title_similarity": "0.12236753"
        },
        {
            "id": "gyfuxis",
            "score": 5,
            "text": "And the reason for fighting legalization revealed.",
            "title_similarity": "0.13705356",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gyfzi84",
            "score": 24,
            "text": "[removed]",
            "title_similarity": "0.072363734"
        },
        {
            "id": "gyg2bku",
            "score": -8,
            "text": "Shift the goalpost, change the rule. Calling it a win. Typical.",
            "title_similarity": "0.057008",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gyg42ye",
            "score": 1,
            "text": "Now if they could just de-criminalize all substances that would be great. Just treat it as a medical issue.",
            "title_similarity": "0.43378597",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gyg52py",
            "score": 1,
            "text": "Cops will still try and say it’s because they’re winning the war on drugs",
            "title_similarity": "0.38889718",
            "sentiment_compound": -0.128
        },
        {
            "id": "gyfsro4",
            "score": -30,
            "text": "See California's relaxed stance on drug possession and mental illness to know that these things aren't always positive with regards to getting people the help they need. 'not jail' doesn't always equal a utopia.",
            "title_similarity": "0.53815097",
            "sentiment_compound": 0.0711
        },
        {
            "id": "gyfwcg5",
            "score": 12,
            "text": "Now cops can go after real criminals",
            "title_similarity": "0.2943703",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gyfzf2d",
            "score": -14,
            "text": "500% rise in crackhead population",
            "title_similarity": "0.44349802",
            "sentiment_compound": 0.0
        },
        {
            "id": "gygyhk9",
            "score": 0,
            "text": "So what does this mean for my cannabis stocks?",
            "title_similarity": "0.39055848",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyhlypv",
            "score": 0,
            "text": "Sounds like making cannabis illegal is the real gateway drug.",
            "title_similarity": "0.51290363",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gyhwp5b",
            "score": 0,
            "text": "Uh yeah that's bad. That means they're not catching people with weed who are also carrying an array of other more dangerous drugs. What's being implied here? Am I missing something?",
            "title_similarity": "0.464394",
            "sentiment_compound": -0.8049
        },
        {
            "id": "gyhyq16",
            "score": 0,
            "text": "I feel like a lot of people need to be reminded that, just because it becomes legal, does not mean that it's allowed by your employer.\n\nYour employer can, and most likely will, continue to require drug tests and fire you if you test positive.",
            "title_similarity": "0.5327986",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gyi3bu2",
            "score": 0,
            "text": "$COMFY is the best DEFI on the market with the best community. Also with a EOY PT of .0002 if achieved they are holding a drawing for a $comfy holder to be gifted $150,000 !! now thats comfy ! And life changing for most people.",
            "title_similarity": "0.35191432",
            "sentiment_compound": 0.8827
        },
        {
            "id": "gyiag20",
            "score": 0,
            "text": "Now set the drinking age to a realistic 19!",
            "title_similarity": "0.28829777",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyg8253",
            "score": 9,
            "text": "You're taking the police's \"free\" search card away. All they have to say is they \"smell something\" and it's free access to violate your rights.\n\nLegalize drugs, treat it like a health problem, and let's get the police demilitarized by ending the war on drugs. Let's stop using 90% of our police force to generate revenue for the State in the form of drug arrests.\n\nThis isn't justice. It's a business.",
            "title_similarity": "0.6610928",
            "sentiment_compound": -0.7074
        },
        {
            "id": "gyglrbh",
            "score": 6,
            "text": "That’s not a good thing. The reason that it’s reduced seizure of other drugs is not because people are using them less. It’s because of a cop smells weed they can search the car and then find these other drugs. I’m pro decriminalization of all drugs in favor of sponsored rehab clinics, don’t get me wrong. But I don’t want people to think that legalizing weed results in less opioid use because it does not.",
            "title_similarity": "0.55392474",
            "sentiment_compound": -0.1162
        },
        {
            "id": "gyfwwjy",
            "score": 55,
            "text": "Insane how much money we have wasted on this stupid \"war\" that was started. But we do love wasting money and time so",
            "title_similarity": "0.36378282",
            "sentiment_compound": -0.5187
        },
        {
            "id": "gygaowj",
            "score": 1,
            "text": "It's almost as if *\"possession\"* or *\"intent to distribute\"* of drugs should not be a crime.",
            "title_similarity": "0.3320837",
            "sentiment_compound": 0.431
        },
        {
            "id": "gyggz8x",
            "score": 1,
            "text": "Up here in Canada there are still jurisdictions that try to either limit home growing, limit recreational stores therefore making people go online to buy product which also includes illegal goods (by their definition) and try to limit where you can smoke ￼whe outdoors or face fines. The police also lobbied the government to give them a cut of the taxes from cannabis which seems totally backwards.￼",
            "title_similarity": "0.6720748",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gygvxpj",
            "score": -1,
            "text": "Trust me they are finding the dope in Illinois now and the guns and crack heads",
            "title_similarity": "0.43549314",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gygxovu",
            "score": 1,
            "text": "Dont mind me just headin down to controversial",
            "title_similarity": "0.045915835",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gygyj6p",
            "score": 1,
            "text": "How much money was taken from the Cartels with legalization is what matter the most. Money will be the ultimate reason why legalization will happen. No politician care about freedom or any other crap.",
            "title_similarity": "0.42643678",
            "sentiment_compound": -0.2796
        },
        {
            "id": "gyh739f",
            "score": 1,
            "text": "The U.S. with their fetish on abstinence and their drug age of 21 is weird anyway. 18 is the standard in most other countries, and it is known that education and responsibility is better than abstinence.",
            "title_similarity": "0.66615534",
            "sentiment_compound": 0.296
        },
        {
            "id": "gyhfstc",
            "score": -1,
            "text": "What was interesting to me is that after legalization, drug use went up significantly.  They tested sewage in Washington state to get an unbiased comparison of before and after legalization.  It turns out that prohibition and making drugs illegal actually worked to a significant degree.",
            "title_similarity": "0.5485127",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gyhk2ec",
            "score": 1,
            "text": "Legalizing marijuana and self driving cars are a major concern for police departments. A majority of revenue is generated through drug seizures and traffic tickets.",
            "title_similarity": "0.61642915",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyg6pzs",
            "score": 2,
            "text": "Ehh the reduction in the other drugs is due to not finding them along side the marijuana during the arrest. The usage never slowed. \n\nAnyone who knew someone selling knows they always had the others available.",
            "title_similarity": "0.60868615",
            "sentiment_compound": -0.34
        },
        {
            "id": "gyg78qe",
            "score": 2,
            "text": "I wonder how the cops feel about not having that easy source of income anymore? JK don't care.",
            "title_similarity": "0.44469708",
            "sentiment_compound": -0.3402
        },
        {
            "id": "gygra0e",
            "score": 2,
            "text": "hmm I wonder what neoliberal talking point /r/science will be peddling this morning?\n\n*shuffles cards* \n\nah, “drugs? actually good”",
            "title_similarity": "0.49725473",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyfyes3",
            "score": -10,
            "text": "Weed = good, abortion = bad. USA is very odd",
            "title_similarity": "0.4441835",
            "sentiment_compound": -0.4927
        },
        {
            "id": "gyfz7nx",
            "score": -10,
            "text": "What is this supposed to imply? Homicide rates will drop if you make it legal?",
            "title_similarity": "0.5128318",
            "sentiment_compound": -0.2406
        },
        {
            "id": "gyg4pi1",
            "score": 2,
            "text": "Us military dudes can’t even invest in weed company’s, can’t buy our parents cbd if they want. If we’re caught in a weed store it’s punishment ASAP. I can’t wait to get out",
            "title_similarity": "0.5697842",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gyg7s40",
            "score": 3,
            "text": "Good, now to legalize all drugs and stop this madness.",
            "title_similarity": "0.4150669",
            "sentiment_compound": -0.397
        },
        {
            "id": "gyfs0fz",
            "score": -26,
            "text": "[deleted]",
            "title_similarity": "0.12236753"
        },
        {
            "id": "gyg95ed",
            "score": 5,
            "text": "Noooo! How will we fill private prisons with free labor now???",
            "title_similarity": "0.44108456",
            "sentiment_compound": 0.6288
        },
        {
            "id": "gyfqngz",
            "score": 404,
            "text": "I'm all for weed but the \"93% decrease in law enforcement seizures of street/illegal cannabis\" seems like a somewhat useless stat. \n\nOfc there will be less seizures of illegal things if the illegal things are made legal. \n\nIn most cases dispensaries/coffeeshops are a way better experience than the average dealer.",
            "title_similarity": "0.7759223",
            "sentiment_compound": -0.7017
        },
        {
            "id": "gyg85wo",
            "score": 6,
            "text": "I feel like marijuana is actually a gateway drug for cops to continue to search you/your vehicle and harass you.",
            "title_similarity": "0.47974503",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gyfzlpr",
            "score": 23,
            "text": "This seems to make sense though... if cannabis isnt illegal then of course seizure of illegal cannabis is going to go down...",
            "title_similarity": "0.5496284",
            "sentiment_compound": -0.1719
        },
        {
            "id": "gyfspnh",
            "score": 152,
            "text": "I wonder if there was any affect on opioid deaths?",
            "title_similarity": "0.44500172",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyfvpso",
            "score": 591,
            "text": "The title implies less opioid use but it could also be inferred that there are just fewer chances to seize opioids, right?",
            "title_similarity": "0.47019747",
            "sentiment_compound": 0.296
        },
        {
            "id": "gyg8bkm",
            "score": 31,
            "text": "Harder to seize drugs when you don't have probable cause to search some one after \"smelling weed\"",
            "title_similarity": "0.45209455",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyg6m27",
            "score": 177,
            "text": "Is the 50% decrease in illegal narcotics seizures explained further? For example, to play devil's advocate, could this be simply due to police just generally not searching as many people (since they no longer search for weed), causing previously caught narcotics possessers to now fly under the radar?",
            "title_similarity": "0.79138124",
            "sentiment_compound": -0.5803
        },
        {
            "id": "gyfx5jm",
            "score": 2355,
            "text": "Legalizing marijuana decreases arrests for illegal marijuana",
            "title_similarity": "0.64954823",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gyfn2wu",
            "score": 1340,
            "text": "Original title to the article: *New study of how US recreational cannabis legalization could change illegal drug markets*\n\nThis addresses the increase in opioid prices, decreased pot prices, as well as the decreased amounts of opioids being shipped.",
            "title_similarity": "0.7050263",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gyfvju6",
            "score": 13064,
            "text": "**And in Mississippi** - after an OVERWHELMING number of voters agreed that they wanted medical marijuana in their state, the Mississippi Supreme Court *overturned the will of the people*.  \nWhy?  \nBecause they said that at least 5 Congressional districts needed to vote on it, and the medical marijuana initiative only got 4.  \n**Mississippi only has 4 Congressional districts**.  \nTalk about a stolen election.",
            "title_similarity": "0.7119145",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gyg009z",
            "score": 1,
            "text": "The title of the post, to me, reads like law enforcement is performing less seizures of the drugs mentioned, not the amount being seized.",
            "title_similarity": "0.5787911",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gyg0tb5",
            "score": 1,
            "text": "War On Drugs = Waste Of Dough",
            "title_similarity": "0.44350365",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gyg16v7",
            "score": 1,
            "text": "And to think they took the Championship away from RVD for this and drastically hurt his career around 2006. Such a shame.",
            "title_similarity": "0.5154489",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gyg1hmu",
            "score": 3,
            "text": "Doesn't this decrease in other drug seizures really moreso reflect the amount of extra drugs that were seized during casual marijuana busts that are not being found anymore?",
            "title_similarity": "0.7245109",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gyg1hq9",
            "score": 1,
            "text": "I'm pretty sure I've read multiple times that DEA seizure of cannabis is up like 400%  this year",
            "title_similarity": "0.59065664",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gyg2fw4",
            "score": 1,
            "text": "From my experience, those who use opiods also use weed. I feel like since they can't arrest people for *only* weed, they are missing some of the opiates.",
            "title_similarity": "0.6702745",
            "sentiment_compound": 0.3261
        },
        {
            "id": "gyg38nh",
            "score": 1,
            "text": "I have nothing against Marijuana usage but I wish people don't smoke it out in public it reeks when they light it up. They should allow recreational drugs only on private property not residential neighborhoods and parks speaking from New York",
            "title_similarity": "0.5923396",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gyg3doi",
            "score": 1,
            "text": "And how has it coorelated with police violence? As we've seen in decadal studies, police violence increases as the crime rate drops, so if cops aren't engaging in non violent drug offenders does that result in decreased violence or does it somehow cause the opposite?",
            "title_similarity": "0.6390327",
            "sentiment_compound": -0.9766
        },
        {
            "id": "gyg3f7g",
            "score": 2,
            "text": "What exactly does it prove? That cops seized less opioids because they arrested less people?",
            "title_similarity": "0.642513",
            "sentiment_compound": -0.5362
        },
        {
            "id": "gyg3ke7",
            "score": 1,
            "text": "The decrease in pain med seizures is likely just because they can’t use marijuana as a way in as easily any more. I’ve known countless pain med / heroin addicts and easy access to marijuana wouldn’t decrease their pain med usage.",
            "title_similarity": "0.7115326",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gyg44k3",
            "score": 1,
            "text": "Legalizing marijuana results in a decrease in the seizure of marijuana. Wow, nobody could have seen this result.",
            "title_similarity": "0.7125107",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gyg4kuf",
            "score": 1,
            "text": "Interesting that it's only 93%",
            "title_similarity": "0.3283527",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gyg4zoz",
            "score": 2,
            "text": "Uh oh. Time for law enforcement to find another cash cow.",
            "title_similarity": "0.28151497",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyg5bwq",
            "score": 1,
            "text": "Because marijuana is the gateway to a search",
            "title_similarity": "0.28485423",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyg5yv3",
            "score": 1,
            "text": "Good job for finally taking on the chemo-mental health crisis!",
            "title_similarity": "0.36333245",
            "sentiment_compound": -0.3595
        },
        {
            "id": "gyg5z5l",
            "score": 1,
            "text": "It is almost as if drug law enforcement is less about trying to take drugs off the street and more about supplying the criminal system with more slaves.",
            "title_similarity": "0.47360507",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gyg74h8",
            "score": 1,
            "text": "Either ADULTS can choose what they put in their bodies or they aren't really adults.\n\nWe already have countless laws to prosecute criminal and bad behavior of people under the influence, so people are already supposed to be held responsible for their own bad actions.\n\nSo, why are we criminalizing a decision they can make in the privacy of their own homes when it doesn't criminally affect others?!",
            "title_similarity": "0.5200184",
            "sentiment_compound": -0.902
        },
        {
            "id": "gyg79s4",
            "score": 1,
            "text": "Unpopular opinion: the same small limits should be allowed with all other drugs.\n\nPeople who are addicted should not be punished for their addiction.",
            "title_similarity": "0.47749984",
            "sentiment_compound": 0.357
        },
        {
            "id": "gyg7a1j",
            "score": 2,
            "text": "They said pot was a gateway drug. I see what they meant.",
            "title_similarity": "0.27129644",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyg7d13",
            "score": 1,
            "text": "But how is the government supposed to make money off peoples’ lives/freedom now...",
            "title_similarity": "0.34169465",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyg7q5l",
            "score": 1,
            "text": "Even thought I live in England, imma get stoned af",
            "title_similarity": "0.37863874",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyg7raa",
            "score": 1,
            "text": "We need federally legalized marijuana in America!",
            "title_similarity": "0.40856877",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyg7umo",
            "score": 1,
            "text": "Why would we want 50 percent less of other illegal drugs? Hopefully it’s because there is less circulating not because less are being searched",
            "title_similarity": "0.6519317",
            "sentiment_compound": -0.0865
        },
        {
            "id": "gyg7xl4",
            "score": 1,
            "text": "So… it’s a gateway solution?",
            "title_similarity": "-0.087393925",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gyg8kiv",
            "score": 1,
            "text": "Almost like the war on drugs doesn’t work.  I have an idea, let’s ban menthol.",
            "title_similarity": "0.53551817",
            "sentiment_compound": -0.721
        },
        {
            "id": "gyg8pel",
            "score": 1,
            "text": "I wonder how much of that other drugs number is from DEA not finding it during weed busts, rather than a decreased use",
            "title_similarity": "0.6992609",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gyg8ti7",
            "score": 2,
            "text": "Who would've thought that decriminalization and legalization would reduce the arbitrary *crime* that legislators created.",
            "title_similarity": "0.5163431",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gyg8tqd",
            "score": 2,
            "text": "Yes, of course and this is exactly why it’s taking the government so long to legalize it federally. Too much money to be made on the wAr On dRuGs",
            "title_similarity": "0.5328992",
            "sentiment_compound": -0.296
        },
        {
            "id": "gyg8zlv",
            "score": 2,
            "text": "17 States: CO, Washington, Alaska, Oregon, Washington, DC, CA, Maine, Mass., NV, MI, VT, Guam, IL, AZ, Montana, NJ, SD, NY, VA",
            "title_similarity": "0.3404886",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyg9i4l",
            "score": 1,
            "text": "Yeah well when you decriminalize something you can’t enforce a law against it …",
            "title_similarity": "0.34393293",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gyg9use",
            "score": 1,
            "text": "stupidests statistic ever.   If you make something legal of COURSE it's going to lower arrests.",
            "title_similarity": "0.5177685",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gyg9zym",
            "score": 1,
            "text": "So you're saying that if you make a thing legal then law enforcement won't arrest you for possessing said thing? Wow, that's a shock. Good thing Science realized this. Look, I get the difference between legal and illegal possession but you can imagine cops generally aren't going to pat down someone smoking a joint to find out if they possess more than they should. We don't need science to tell us that.",
            "title_similarity": "0.49605227",
            "sentiment_compound": 0.3111
        },
        {
            "id": "gyga3bc",
            "score": 1,
            "text": "Drugs won the War On Drugs.",
            "title_similarity": "0.40676484",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gygalkh",
            "score": 5,
            "text": "Conclusions\n\nRecreational cannabis laws in US states appear to be associated with illegal drug market responses in those states, including reductions in the street price of cannabis. Changes in the street prices of illegal opioids analyzed may suggest that in states with recreational cannabis laws the markets for other illegal drugs are not independent of legal cannabis market regulation.",
            "title_similarity": "0.7153002",
            "sentiment_compound": -0.9036
        },
        {
            "id": "gygapz5",
            "score": 1,
            "text": "Last year during a pandemic it was considered an essential business. If that isn't reason enough to legalize at the federal level than I don't know what is.",
            "title_similarity": "0.49752674",
            "sentiment_compound": 0.0
        },
        {
            "id": "gygau7v",
            "score": 1,
            "text": "... so making canabis legal... has decreased seizures of illegal cannabis... wow reddit that's big news huh",
            "title_similarity": "0.6792844",
            "sentiment_compound": 0.2415
        },
        {
            "id": "gygayro",
            "score": 2,
            "text": "Just federally legalize weed across the board in the U.S. and be done with it.",
            "title_similarity": "0.494853",
            "sentiment_compound": 0.0
        },
        {
            "id": "gygb1gi",
            "score": 3,
            "text": "Finally. They criminalized entire generations with the archaic war on drugs laws. I know dozens of people I grew up with, myself included, that had significant life setbacks because of victimless minor drug possession charges.",
            "title_similarity": "0.6616664",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gygb9cn",
            "score": 1,
            "text": "Remember kids. It's illegal to do drugs. Unless your hustler is big Pharma",
            "title_similarity": "0.5611177",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gygbblm",
            "score": 1,
            "text": "Wait, why has the seizure of other drugs gone up? Were police actually just too busy trying to bust high schoolers for smoking weed? Somehow I feel like priorities need to be investigated based on these findings",
            "title_similarity": "0.59868145",
            "sentiment_compound": 0.4329
        },
        {
            "id": "gygbc2k",
            "score": 1,
            "text": "See? decriminalization WORKS! now to make it Federal... plus legal drugs can be regulated and Taxed. Like Alcohol or Tobacco.",
            "title_similarity": "0.5295404",
            "sentiment_compound": 0.5093
        },
        {
            "id": "gygbf7r",
            "score": 1,
            "text": "Legalizing the recreational use of marijuana has been great here in Canada, with basically the same control laws as alcohol.  Turns out that pretty much the only people who get intoxicated in public, or drive while high, etc, are the kind of people who already had a habit of doing so with alcohol, and the majority of people who smoke marijuana or use edibles would rather do so in the comfort of their own home.",
            "title_similarity": "0.6701654",
            "sentiment_compound": 0.8768
        },
        {
            "id": "gygbudp",
            "score": 1,
            "text": "I’m curious based on the percentages display if it’s a matter of causation or correlation?  Like the 93% decrease in seizures is pretty self explanatory; they aren’t seizing something that’s legal, but the 50% is that just because they’re searching less people?  Or is this because people with those drugs will typically have weed on them as well.\n\nThat then brings up a further question, is the belief that weed is a “gateway drug” due to the fact that a heroin dealer probably also has less hard drugs on them too?",
            "title_similarity": "0.7678442",
            "sentiment_compound": -0.1656
        },
        {
            "id": "gygc179",
            "score": 1,
            "text": "Sounds like the government is releasing more opioids to make up for the lost revenue from marijuana arrests.",
            "title_similarity": "0.66694236",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gygcehf",
            "score": 1,
            "text": "They used to call weed the \"gateway drug\" for drug users. Turns out it's more like the gateway drug for cops catching criminals...",
            "title_similarity": "0.5683322",
            "sentiment_compound": -0.228
        },
        {
            "id": "gygcg3h",
            "score": 2,
            "text": "If you make something legal, of course the number of crimes decreases. I don't know if Marijuana should be sold for \"recreational\" purposes. I have a friend that went into rehab. He had to smoke every day to the point he wouldn't socialize anymore. Smoking weed for a long time can be dangerous.",
            "title_similarity": "0.75147736",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gygddgu",
            "score": 2,
            "text": "I mean, isn't it logical? Legalizing something, won't it in turn lower the crime rate for that specific thing?",
            "title_similarity": "0.35469443",
            "sentiment_compound": -0.7236
        },
        {
            "id": "gygdo9h",
            "score": 2,
            "text": "Turns out pot's mostly a gateway drug for the police to do seizures.",
            "title_similarity": "0.54414946",
            "sentiment_compound": 0.0
        },
        {
            "id": "gygdt3b",
            "score": 1,
            "text": "> \\>50% decrease in law enforcement seizures of heroin, oxycodone, and hydrocodone.\n\nAh, there is why more states haven't made it legal",
            "title_similarity": "0.8489491",
            "sentiment_compound": -0.5529
        },
        {
            "id": "gygeftv",
            "score": 1,
            "text": "#SafeBTC Official Chat\nWelcome to SafeBTC Official\nEvery transaction the protocol automatically distributes 2% rewards to holders and 2% auto-locks and burn liquidity forever.\nhttps://safebitcoin.io\nhttps://t.me/safebtc",
            "title_similarity": "0.3788283",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gygehb3",
            "score": 1,
            "text": "We, as people view this as good, police department/leadership tend to view this as bad, as more arrests =‘s more money",
            "title_similarity": "0.45573285",
            "sentiment_compound": -0.5849
        },
        {
            "id": "gygex1s",
            "score": 1,
            "text": "Now if only all of those above-mentioned opioids were decriminalized, or we did what Switzerland did and implement HAT instead of methadone/buprenorphine maintenance. Illegality is the root of most woes with all drugs. Overdoses, disease risk, incarceration, poverty - all are rooted in and derived from prohibition. But real progress will never happen, because both the illegal drug trade and the War on Drugs are big business. Police department budgets, the prison industrial complex, even rehabs; all of them need drugs to remain illegal to make the money they do. The stigma/puritan anti-drug rhetoric they push is disguised as altruism, but is simply to serve that money-making agenda.",
            "title_similarity": "0.6586878",
            "sentiment_compound": -0.976
        },
        {
            "id": "gygf8e4",
            "score": 1,
            "text": "Imagine being arrested for cannabis days before these laws were enacted. ;(",
            "title_similarity": "0.61684155",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gygfkxo",
            "score": 2,
            "text": "If you make something g legal of course seizures of illegal cannabis will go down. How rudimentary is that. Am I missing something here?",
            "title_similarity": "0.6180452",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gyggigi",
            "score": 1,
            "text": "And made my life 100% more awesome!",
            "title_similarity": "-0.020838015",
            "sentiment_compound": 0.6893
        },
        {
            "id": "gygh15n",
            "score": 1,
            "text": "Where are cops going to get their weed at now.",
            "title_similarity": "0.38317806",
            "sentiment_compound": 0.0
        },
        {
            "id": "gygh2vm",
            "score": 2,
            "text": "A 50% decrease in seizures of other drugs doesn't mean a reduction in use of other drugs. \n\n It's most likely corollated with the loss of \"I smell weed\" as probable cause for conducting searches.",
            "title_similarity": "0.69374144",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gygh4ie",
            "score": 1,
            "text": "And the drug testing workplaces can't find employees. Weird?",
            "title_similarity": "0.5869439",
            "sentiment_compound": 0.1326
        },
        {
            "id": "gyghf86",
            "score": 1,
            "text": "Don’t we want them seizing heroin and prescription drugs though?",
            "title_similarity": "0.51547515",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gygilhg",
            "score": 1,
            "text": "Let the people smoke some weeeeeedddddddd",
            "title_similarity": "0.23160073",
            "sentiment_compound": 0.0
        },
        {
            "id": "gygintp",
            "score": 1,
            "text": "I think it’s good the 17 states made weed legal because when people get arrested for weed and trying to get a job the person wanting to employ them will find out about their background and see they went to jail and the reason would just be “drugs” which range to (not bad to lethal) and then because of the drugs charge, the employer wouldn’t want to employ the person, but if they knew it was just weed they would probably let it slide and let them be employed.",
            "title_similarity": "0.64355224",
            "sentiment_compound": 0.3016
        },
        {
            "id": "gygir4b",
            "score": 1,
            "text": "This title reads as cannabis is exactly the opposite of a gateway drug",
            "title_similarity": "0.4037671",
            "sentiment_compound": 0.0
        },
        {
            "id": "gygjb3d",
            "score": 1,
            "text": "Really says something about those 17 states if them making weed legal decreased all US weed arrests by 93%",
            "title_similarity": "0.85023713",
            "sentiment_compound": -0.34
        },
        {
            "id": "gygjjdl",
            "score": 1,
            "text": "No witchhunting statistic included?  You know, hollier than thow people, cops, racist, bad neighbors, jealous people, etc, fireman, unilingual linguistiques, ethnic cleanser, favoritism, behind the back stabbers, jealous pushers, humanity.  No, then it must be my imagination, people who want to destroy your family, your life, your honor, your character.  Nah, that would just be my paranoia.  Where there is man, there is humanity.  BUT it's coming to an end.  Burn me, oh that is illegal,NOW!",
            "title_similarity": "0.44235337",
            "sentiment_compound": -0.8398
        },
        {
            "id": "gygjs94",
            "score": 1,
            "text": "If the decrease in the other drugs is because people are using pot instead then great, but if it’s because they’re now slipping through the cracks then not so great.",
            "title_similarity": "0.5343414",
            "sentiment_compound": -0.6319
        },
        {
            "id": "gygkszr",
            "score": 1,
            "text": "How many fewer deaths caused by police over reactions?",
            "title_similarity": "0.61219174",
            "sentiment_compound": 0.0
        },
        {
            "id": "gygm72q",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.072363734"
        },
        {
            "id": "gygnc3q",
            "score": 3,
            "text": "Also society has somehow not crumbled.\n\nWeird. Almost like weed was never a huge problem.",
            "title_similarity": "0.2858362",
            "sentiment_compound": 0.4626
        },
        {
            "id": "gygokzm",
            "score": 2,
            "text": "Policing should hopefully one day be a very boring job.",
            "title_similarity": "0.37090847",
            "sentiment_compound": 0.0276
        },
        {
            "id": "gygpg9z",
            "score": 3,
            "text": "that 93 is a bit of a no brainer, but whats the 50% opiate about? to expensive to buy? reduced stops for marijuana with collateral hits,\n\nheres the important stuff:\n\n*\n\n9.2% decrease in street/illegal cannabis prices.\n\n19.5% decrease in low-quality street/illegal cannabis prices.\n\n*\n\n*i dint mess with the harder stuff, at least until i get hooked by rx but, it would seem to have had a run on heroin and oxy since legalization? \n\n\n64% increase in heroin prices.\n\n54% increase in heroin potency.\n\n7.3% increase in street/illegal oxycodone prices.\n\n5.1% increase in street/illegal hydrocodone prices.",
            "title_similarity": "0.8257557",
            "sentiment_compound": -0.7643
        },
        {
            "id": "gygpxux",
            "score": 1,
            "text": "Wait, when some becomes legal, the crime rate for it drops?  Whaaaat?",
            "title_similarity": "0.54070336",
            "sentiment_compound": -0.5204
        },
        {
            "id": "gygr2gm",
            "score": 1,
            "text": "It would be interesting to see if there is a rise in OWI charges in these states.",
            "title_similarity": "0.20539461",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gygruxn",
            "score": 1,
            "text": "States are allowing the research.",
            "title_similarity": "0.10005665",
            "sentiment_compound": 0.0
        },
        {
            "id": "gygs9m3",
            "score": 2,
            "text": "Of course seizures will go down. Most of the weed became legal and most of the other drugs busted were probably discovered during weed busts.",
            "title_similarity": "0.69508284",
            "sentiment_compound": 0.128
        },
        {
            "id": "gygsf7h",
            "score": 1,
            "text": "Good.\n\nLaw enforcement should be decreased. Treatment should be increased, and abolish mandatory minimum sentences.",
            "title_similarity": "0.39113235",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gygsnaf",
            "score": 2,
            "text": "The amount of evidence demonstrating that the war on drugs has been nothing but a massive problem to global societies (not just the USA) is mountainous. And it blows my mind that there are still people who oppose the revocation of the war on drugs. There are multiple countries that have made their own national policies based on the USA's War on Drugs initiative, and it's just such a tragic outcome.\n\nWe as humans need to end the \"War on Drugs\", not just in the USA, but globally. The scientific evidence conclusively proves that it does orders of magnitude more harm than \"problems it solves\".",
            "title_similarity": "0.5546258",
            "sentiment_compound": -0.9887
        },
        {
            "id": "gygsskv",
            "score": 1,
            "text": "There really is an argument to be made about removing this low hanging fruit. By removing these simple criminal acts, police are allowed to focus on more serious crimes. \n\nI recall something from a documentary I saw  many years ago about the door to door marijuana delivery men of New York employed by the wealthy. They dressed professionally and took cabs everywhere they went. When asked why they were so impervious to drug enforcement, a police officer noted they could go down to Central Park and bust dozens of Jamaicans for the same money it would take to indict one delivery man. \n\nPolice will naturally seek to enforce whatever is easiest and provides the highest yield. Marijuana convictions used to be the lowest hanging fruit (mostly non-violent, able to claim high street value of confiscated drugs, able to seize high value assets, able to turn 52% of adults in to criminals to be interdicted).",
            "title_similarity": "0.61815",
            "sentiment_compound": -0.684
        },
        {
            "id": "gygt4ej",
            "score": 2,
            "text": "All drugs should be legal for adults to make their own decisions. End the drug war.",
            "title_similarity": "0.49447763",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gygu3pj",
            "score": 1,
            "text": "Finally, uncle Sam has finally learned that violence doesn't always work",
            "title_similarity": "0.39757466",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gygw4cr",
            "score": 1,
            "text": "I’m tired of every political parties campaign making promises to legalize it and they don’t. I don’t see it being federally legalized by Biden.",
            "title_similarity": "0.43699446",
            "sentiment_compound": 0.34
        },
        {
            "id": "gygxakn",
            "score": 1,
            "text": "Are we not past time for grow your own opium?",
            "title_similarity": "0.4832289",
            "sentiment_compound": 0.0
        },
        {
            "id": "gygxjlm",
            "score": 1,
            "text": "So they made it legal _then_ it wasn't illegal? What is the story here?",
            "title_similarity": "0.14086956",
            "sentiment_compound": 0.5837
        },
        {
            "id": "gygxqr1",
            "score": 2,
            "text": "Wow making something legal results in people not being arrested for it. Crazy, what an unexpected result.",
            "title_similarity": "0.3502055",
            "sentiment_compound": 0.6656
        },
        {
            "id": "gygxuq6",
            "score": 1,
            "text": "Wish state of Georgia would get on board",
            "title_similarity": "0.17713419",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gygydfr",
            "score": 1,
            "text": "Biden won’t make cannabis reforms, another Great Depression will.",
            "title_similarity": "0.51031363",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gygyy4w",
            "score": 1,
            "text": "Is the reduction in dangerous drugs (heroin, oxycodone etc) due to the police's overall reduced engagement towards pot? As in because they dont pursue pot as an illegal drug, they miss the opportunity to find the harder stuff along with it? OR is it because when pot is legal, use of harder drugs is reduced as a result?",
            "title_similarity": "0.6569836",
            "sentiment_compound": -0.6946
        },
        {
            "id": "gygz06l",
            "score": 1,
            "text": "Over the long term, there should be a significant decrease in harder drug use because the underground market without marijuana will be significantly less populated.",
            "title_similarity": "0.61883235",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gygz4w4",
            "score": 1,
            "text": "Making something legal in limited quantities reduces the number of “small capacity” charges related to it?\n\nAmazing!",
            "title_similarity": "0.3813555",
            "sentiment_compound": 0.4389
        },
        {
            "id": "gygzhmh",
            "score": 1,
            "text": "Yeah great for the rest of the country that still has insanely primitive drug laws. But whatever. Nothing makes any sense.",
            "title_similarity": "0.5757115",
            "sentiment_compound": 0.4854
        },
        {
            "id": "gyh0fnw",
            "score": 1,
            "text": "Are they seizing fewer opiates because there are fewer seizures, and because marijuana was a good excuse to do more thorough searches? Or are people just doing less of it?",
            "title_similarity": "0.6052942",
            "sentiment_compound": 0.5514
        },
        {
            "id": "gyh0p71",
            "score": 1,
            "text": "And an increase in the number of snack sections in 7-11s being emptied",
            "title_similarity": "0.39816263",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gyh1odw",
            "score": 1,
            "text": "That's what happens when you remove the low lying fruit and force them to do their job. Put down the coffee and donuts and go after the meth dealer, not the nickel bag weed dealer.",
            "title_similarity": "0.5159166",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gyh1op6",
            "score": 1,
            "text": "Why would it lead to an increase in illegal opioid prices?",
            "title_similarity": "0.4616304",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gyh1vet",
            "score": 1,
            "text": "If you add Canada to the results, Legalizing not only didn't cause any augmentation in use, but underage use in the 15 to 17 years old age bracket dropped by 50%. \n\nTurns out that you really do get better results legislating rather than criminalizing.",
            "title_similarity": "0.65941375",
            "sentiment_compound": 0.6423
        },
        {
            "id": "gyh2fto",
            "score": 1,
            "text": "Are they seizing less opiates because people are now using weed more than opiates, or because they don’t search folks with weed in the first place and therefore wont find anything (opiates) if the person has them?",
            "title_similarity": "0.58637404",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyh2lv6",
            "score": 1,
            "text": "Mom: “we have science at home”\n\nScience at home:",
            "title_similarity": "0.25100204",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyh30jv",
            "score": 1,
            "text": "Interesting article. While it is not surprising that marijuana street prices fell, it is Interesting that opiate prices rose. I guess the dealers got to make their profit somewhere.",
            "title_similarity": "0.52265656",
            "sentiment_compound": 0.7569
        },
        {
            "id": "gyh3ig4",
            "score": 1,
            "text": "Sounds like those law enforcement officers need to stop smoking weed and make some arrests!",
            "title_similarity": "0.53124285",
            "sentiment_compound": -0.4389
        },
        {
            "id": "gyh3xs4",
            "score": 1,
            "text": "The US DEA is a super villian.  If you want the super villian origin story read [Chasing the Scream](https://chasingthescream.com/) by Johann Hari.\n\nExcessive recreational drug use is a behavior driven by despair.\n\nTRIVIA: look up  the 1970s *panel on drugs* discussion that included [Harry Anslinger](https://en.wikipedia.org/wiki/Harry_J._Anslinger#Rise_to_prominence).   Anslinger is hilarious - he essentially claims that the movie [Reefer Madness](https://en.wikipedia.org/wiki/Reefer_Madness) is fact and the other panelists just laugh at him.",
            "title_similarity": "0.5576129",
            "sentiment_compound": 0.9201
        },
        {
            "id": "gyh4mr0",
            "score": 2,
            "text": "Almost as though the real gateway behavior was getting arrested for something that only effects an individual.",
            "title_similarity": "0.39213973",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gyh4o67",
            "score": 1,
            "text": "Not sure whether to celebrate this news or fear it",
            "title_similarity": "0.10272153",
            "sentiment_compound": -0.1184
        },
        {
            "id": "gyh4y26",
            "score": 1,
            "text": "I'm all for marijuana, but the \"93 percent drop in law enforcement seizures of illegal/street cannabis\" seems like a pointless statistic.\n\nOf course, if illegal acts are made legal, there will be less seizures.\n\nIn most cases, dispensaries/coffeeshops have a superior experience than a typical dealer.",
            "title_similarity": "0.7891016",
            "sentiment_compound": 0.296
        },
        {
            "id": "gyh78v7",
            "score": 1,
            "text": "This isn't awesome.  There are some real human implications from this.",
            "title_similarity": "0.08806588",
            "sentiment_compound": -0.5096
        },
        {
            "id": "gyh7bt1",
            "score": 1,
            "text": "\\> 50% decrease in law enforcement seizures of heroin, oxycodone, and hydrocodone\n\n&#x200B;\n\nSo basically, we're seeing that cops weren't really doing their jobs so much as getting lucky.",
            "title_similarity": "0.8321924",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gyh7kfz",
            "score": 1,
            "text": "Well if you’re going to legalize or decriminalize something the cops aren’t going to have a reason so seize it now.\n\nAs for the other drugs, if they’re not going to be looking for weed, they’re probably not going to find anything else stashed with it. Less drug raids for weed means less drug raids overall.",
            "title_similarity": "0.57221735",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gyh7rt0",
            "score": 2,
            "text": "Wow no wonder republicans are against legalizing cannabis. It defunds the police and preserves the voting rights of people.",
            "title_similarity": "0.5521343",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gyh8m64",
            "score": 1,
            "text": "Theory is that people aren't buying weed from drug dealers who may be recommending harder drugs.  Similarly, people who are curious to try harder drugs don't already have a dealer that they can speed dial and ask, making harder drugs less easy to find.  Win win.",
            "title_similarity": "0.5049258",
            "sentiment_compound": 0.9101
        },
        {
            "id": "gyh8pzs",
            "score": 1,
            "text": "I wonder if it is because it made all of the drug dogs useless.",
            "title_similarity": "0.6521013",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gyharci",
            "score": 1,
            "text": "Gee, making something legal decreases how much law enforcement responds as though it were illegal!  Who knew?",
            "title_similarity": "0.48399046",
            "sentiment_compound": -0.5255
        },
        {
            "id": "gyhayt0",
            "score": 2,
            "text": "So weed is a gateway drug. For cops to arrest you",
            "title_similarity": "0.47065294",
            "sentiment_compound": -0.34
        },
        {
            "id": "gyhclmq",
            "score": 1,
            "text": "That doesn't mean that the hard drug usage has gone down. More likely just less seizures because they can't use the \" I smell weed \" excuse. Not completely sure that's a positive even though I am thoroughly pro cannabis",
            "title_similarity": "0.5280068",
            "sentiment_compound": 0.3229
        },
        {
            "id": "gyhcxoq",
            "score": 1,
            "text": "Start pumping out the Dope!",
            "title_similarity": "0.14692163",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyhd443",
            "score": 1,
            "text": "I mean like.... people who want to abuse dope aren't going to just not get dope because they can get  weed legally. That's not how drugs work. Legalizing weed won't have any effect on reducing heroin or opiate addicts. They don't want weed. They want dope. So I'm not seeing the correlation. There's other factors.",
            "title_similarity": "0.5085149",
            "sentiment_compound": -0.6276
        },
        {
            "id": "gyhd8zc",
            "score": 1,
            "text": "Wow, legalizing something resulted in less seizures of illegally possessed thing that was just legalized? Truly a groundbreaking title.",
            "title_similarity": "0.32359007",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gyhd9qp",
            "score": 1,
            "text": "Opioid death rates are lower in counties with cannabis dispensaries. \"According to this estimate, an increase from one to two storefront dispensaries in a county is associated with an estimated 17% reduction in all opioid related mortality rates.\" https://www.bmj.com/content/372/bmj.m4957",
            "title_similarity": "0.85763705",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gyhetq6",
            "score": 2,
            "text": "This actually brings up the interesting question of where the police would redirect their efforts if all drugs were legalized.",
            "title_similarity": "0.4619824",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gyhfirv",
            "score": 1,
            "text": "The phrase \"This has led to\" in the post title implies causation, which is misleading.",
            "title_similarity": "0.14121991",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gyhfpqw",
            "score": 1,
            "text": "Imagine the numbers if we could get everyone on that same page. One day...",
            "title_similarity": "0.11818801",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyhfuai",
            "score": 2,
            "text": "This is why pharma is against legalization. It's muscling in on their enterprise.",
            "title_similarity": "0.42868602",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyhh6ev",
            "score": 1,
            "text": "Is there another sub that posts actual science and not just statistics on pop culture?",
            "title_similarity": "0.3250305",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyhi1oo",
            "score": 1,
            "text": "Make something legal, and suddenly less people are arrested. I'm not understanding why this article is... anything really.  \nIf anything it sounds like cops are just being hands off on drugs as a blanket now and letting more people lose their lives to hard drugs, whether law enforcement is the correct solution or not.",
            "title_similarity": "0.6744888",
            "sentiment_compound": -0.2298
        },
        {
            "id": "gyhj5wj",
            "score": 2,
            "text": "So Marijuana is the gateway.... to the police  seizing illegal drugs.",
            "title_similarity": "0.49486685",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gyhj78h",
            "score": 1,
            "text": "Yeah buying weed from sketchy drug dealers is usually how I find the other stuff.",
            "title_similarity": "0.55429524",
            "sentiment_compound": 0.296
        },
        {
            "id": "gyhjzjy",
            "score": 1,
            "text": "Are people using less opiates because legal weed, or are police finding less opiates because they can't search for weed?",
            "title_similarity": "0.62666076",
            "sentiment_compound": 0.0609
        },
        {
            "id": "gyhkt8y",
            "score": 1,
            "text": "Okay, so taking the figures in the title at face value, has the decrease in the seizures of other drugs reduced because fewer law enforcement officers are being deployed, or instructed to check for drugs less? \n\nOr is the legalisation in weed somehow decreasing use or possession of other drugs?",
            "title_similarity": "0.7137789",
            "sentiment_compound": 0.5661
        },
        {
            "id": "gyhlmew",
            "score": 1,
            "text": "Some states are in the stone age compared to us in California on cannabis..",
            "title_similarity": "0.51786745",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyhmotl",
            "score": 1,
            "text": "We would solve so many problems around the world if we would get rid of our drug laws",
            "title_similarity": "0.46870083",
            "sentiment_compound": -0.2911
        },
        {
            "id": "gyhn0vl",
            "score": 1,
            "text": "Not seizing weed is good, but not seizing hard drugs is a different story",
            "title_similarity": "0.4170835",
            "sentiment_compound": 0.3387
        },
        {
            "id": "gyhnc4w",
            "score": 1,
            "text": "So they had both half the time?",
            "title_similarity": "0.22135979",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyhnibl",
            "score": 1,
            "text": "What are they gonna do with all the spare drugs they plant on people?",
            "title_similarity": "0.57063264",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyhofkq",
            "score": 1,
            "text": "Where is the decrease in opiates coming from? Is it because they aren’t catching those who do both now, or because people have switched to MMJ because it’s legal now? Genuinely curious, cuz I live in the middle of the Pacific and don’t have a frame of reference. We’ve always liked weed here. :)",
            "title_similarity": "0.6170032",
            "sentiment_compound": 0.8385
        },
        {
            "id": "gyhokgj",
            "score": 1,
            "text": "That's why oxy and heroin is everywhere again?",
            "title_similarity": "0.48647726",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gyhpe62",
            "score": 1,
            "text": "That is so fucked up. This whole weed thing is just population manipulation.",
            "title_similarity": "0.43065435",
            "sentiment_compound": -0.8323
        },
        {
            "id": "gyhpohi",
            "score": 1,
            "text": "93% decrease in seizures of illegal cannabis after it becomes legalized seems awwwwfully redundant..... seeing the decrees in harder drugs is cool though",
            "title_similarity": "0.81825745",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gyhs4x9",
            "score": 1,
            "text": "Just 1 thing holding it back.  The smell.  Yes, there are edibles but the vast amount of consumers like to smoke it.",
            "title_similarity": "0.44053668",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gyhu9kt",
            "score": 2,
            "text": "So they’re just planting crack instead of bud now... Right?",
            "title_similarity": "0.45650148",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyhy6x1",
            "score": 1,
            "text": "My dad worked in a position that had him dealing with offenders for a year or two. At the time he was so heated against marijuana. His tone has completely changed on it due to studies like this. Our state is doing pretty bad with the opioids, and he's read about the companies that are funding anti-pot legislation. I'm glad research like this keeps coming out, hopefully it'll keep shifting the public view.",
            "title_similarity": "0.7153779",
            "sentiment_compound": 0.7845
        },
        {
            "id": "gyhyg9i",
            "score": 1,
            "text": "Wouldn’t that be due to the fact that’s many of those marijuana arrests lead to the discovery of other drugs? I know many friends who, if searched because of mj, would no doubt land themselves a slew of possession felonies.\n\nI just don’t see how decriminalization of marijuana magically gets addicts off of opiates. And why isn’t crystal, coke, etc listed?\n\nLast but not least—anyone familiar with the current state of street level drug dealing knows that in the last three years fentanyl has replaced nearly all other opiates.\n\nI want this to be true, but as a recently sober opiate addict, this headline seems suspect.",
            "title_similarity": "0.7263697",
            "sentiment_compound": 0.2767
        },
        {
            "id": "gyhynaa",
            "score": 1,
            "text": "Australian law makers will be ready to play catch-up any decade now.",
            "title_similarity": "0.21741024",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gyhysbv",
            "score": 1,
            "text": "They can't afford Pot so they're buying Meth instead.  The disconnect between what is really happening and what academia is saying is as vast as ever.",
            "title_similarity": "0.593637",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyhz4jw",
            "score": 1,
            "text": "Kim Reynolds is a dumb old hag.",
            "title_similarity": "0.33901495",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gyhzrwn",
            "score": 1,
            "text": "I’d be pretty suspicious if the people on my design team didn’t fail a drug test. It’s pretty much a requirement here. No drugs no job.",
            "title_similarity": "0.5619739",
            "sentiment_compound": 0.0227
        },
        {
            "id": "gyi0i4c",
            "score": 1,
            "text": "Now we just need more politicians to acknowledge this truth and do more to act on it.",
            "title_similarity": "0.11739232",
            "sentiment_compound": 0.3869
        },
        {
            "id": "gyi1rjr",
            "score": 1,
            "text": "How do you know it led to less heroine seizure?",
            "title_similarity": "0.32607746",
            "sentiment_compound": 0.5279
        },
        {
            "id": "gyi235k",
            "score": 1,
            "text": "Regular dank smoker here. \nI haven’t done any narcotics or drugs since 2/17/2016, haven’t drank a drop of alcohol in 15 months and counting. I smoke bud all day every day (not at work) and I’m more healthy than I’ve been in over 25 years. My doctors word on my health was “optimal”. Cholesterol 60, no pre diabetes, BP 125/72 and hit the wax and bud. Stopping drinking and drugs given my body the ability to recover.",
            "title_similarity": "0.69666874",
            "sentiment_compound": 0.101
        },
        {
            "id": "gyi2lzh",
            "score": 2,
            "text": "We need a new revenue stream and class of criminals:\n\nLET’S BAN MENTHOL CIGARETTES!",
            "title_similarity": "0.5533966",
            "sentiment_compound": -0.8528
        },
        {
            "id": "gyi36ap",
            "score": 1,
            "text": "In other words, due to legalizing cannabis, there's a serious problem with other drugs not being properly caught by police. This is a direct example of how being soft on drugs causes massive problems.",
            "title_similarity": "0.59570545",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gyi3gqq",
            "score": 1,
            "text": "[...the drug is needed so we can do research, help our veterans...](https://www.marketwatch.com/story/john-boehner-is-joining-a-marijuana-company-2018-04-11)\n\nEveryone celebrates as they willingly put the shackles on their own ankles, they're being preyed upon by parasites and are complicit as usual.",
            "title_similarity": "0.50785476",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gyi3hwm",
            "score": 1,
            "text": "Shocking how what science has been saying for decades is true.",
            "title_similarity": "0.3091547",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gyi47qu",
            "score": 1,
            "text": "Maybe someday we can legalize poppy cultivation and get people away from the refined versions…just like pot",
            "title_similarity": "0.48324805",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gyi47w9",
            "score": 1,
            "text": "not sure why the decrease in other drugs is listed! Obviously if you're not breaking down doors looking for drugs, you're not going to find them. All this title really says to me is that 40% of pot smokers use other drugs",
            "title_similarity": "0.7266393",
            "sentiment_compound": -0.308
        },
        {
            "id": "gyi4faj",
            "score": 1,
            "text": "It’s not a gateway drug if it is enough to get you to your destination.",
            "title_similarity": "0.25128394",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyi4fpq",
            "score": 1,
            "text": "Less seizures of the hard stuff because now people can really focus on hiding the good stuff.",
            "title_similarity": "0.28316203",
            "sentiment_compound": 0.0094
        },
        {
            "id": "gyi4j7b",
            "score": 1,
            "text": "I just read the link. Looks to me this is increasing Heroin usage as the cops are confiscating 50% less?",
            "title_similarity": "0.786144",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gyi5lbr",
            "score": 1,
            "text": "oh man, so republicans were wrong? that's so weird ...",
            "title_similarity": "0.2428671",
            "sentiment_compound": -0.6549
        },
        {
            "id": "gyi5q7w",
            "score": 1,
            "text": "Unless you're black. Whatever amount you have will be charged with \"intent to sell\" instead of \"possession\". Happens all the time.",
            "title_similarity": "0.38522005",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gyi646b",
            "score": 1,
            "text": "\"Making a drug legal makes it so police confiscate less of that drug\"\n\nNeat",
            "title_similarity": "0.56302786",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gyi6dfl",
            "score": 1,
            "text": "Because they can't lie about smelling marijuana and search peoples cars for other drugs. Not likely that it reduces opioid use by that margin.",
            "title_similarity": "0.47860023",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyi6td9",
            "score": 1,
            "text": "Unfortunately, oxy and hydro theft/abuse are still out of control. It is a good start.",
            "title_similarity": "0.34256688",
            "sentiment_compound": 0.128
        },
        {
            "id": "gyi82ms",
            "score": 1,
            "text": "“But kids are dead literally everywhere.”\n-Pete Ricketts probably",
            "title_similarity": "0.4391553",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gyi86p6",
            "score": 1,
            "text": "Cmon Texas! Get there already!",
            "title_similarity": "0.053940505",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyi8r4g",
            "score": 1,
            "text": "Houston Tx  here, there’s a CBD store in each block of my area.   Weed still not legal though.",
            "title_similarity": "0.55840075",
            "sentiment_compound": -0.195
        },
        {
            "id": "gyi8zct",
            "score": 1,
            "text": "Assume there is a correlation to police pulling over people/searching them from the smell of weed only to find heroin etc.  have a friend who is a cop and he said they use weed smell as cause to search a vehicle",
            "title_similarity": "0.5884017",
            "sentiment_compound": 0.0
        },
        {
            "id": "gyi9t9z",
            "score": 1,
            "text": "Good. Focus on the drugs that destroy people's lives.",
            "title_similarity": "0.43597633",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gyi9v21",
            "score": 1,
            "text": "Keeping it illegal is the biggest/only real problem with cannabis",
            "title_similarity": "0.4799791",
            "sentiment_compound": -0.743
        },
        {
            "id": "gyi9wk5",
            "score": 1,
            "text": "Decrease of seizures doesn't necessary correlate perfectly with decrease of use.\n\nHow much of the decrease in pain killer seizures is because police no longer have the “I smell weed” excuse to search vehicles and maybe find other drugs? Or because states that legalize also make it less of a priority to find drugs in general? \n\nI’m sure accessible cannabis lowers use of other painkillers but it’s important to consider all other potential factors when analyzing data.",
            "title_similarity": "0.6549697",
            "sentiment_compound": -0.6362
        },
        {
            "id": "gyi9xwy",
            "score": 1,
            "text": "So, what the point here. Folks think there is now 50% less heroin, oxy and hydro out there?\n\nNot sure this is showing what folks hope.",
            "title_similarity": "0.73291487",
            "sentiment_compound": -0.2427
        },
        {
            "id": "gyiaw43",
            "score": 1,
            "text": "Meaning that opiates aren’t confiscated because people be keeping the pills and their weed in the same place. \n\nDear Science, thank you for these statistics that you have provided hear. Thank you for not performing surgeries on living beings. Now, can you please provide a cure for opioid addiction that continues to occur regardless of cannabis reform or lessening so you can be appreciated for such accomplishment?\n\nI’ll help you get started... a cure is not an excuse, a mood, something temporary or anything addictive or something that an addict would pay for indefinitely. \n\nThe people using the opiates might not be the addicts that need a cure...",
            "title_similarity": "0.5466076",
            "sentiment_compound": 0.9228
        },
        {
            "id": "gyib9w7",
            "score": 2,
            "text": "Isn’t a 93% drop in seizing illegal marijuana partially because most of its not illegal anymore? \n\nIt’s not like illegal marijuana trafficking vanished, it just stopped being illegal to possess and when the police stop looking for something that’s illegal they find fewer of the people selling that previously illegal to possess substance.",
            "title_similarity": "0.78496504",
            "sentiment_compound": -0.9419
        },
        {
            "id": "gyid0dy",
            "score": 1,
            "text": "I hope we get this in Germany soon too. I don't even smoke weed it's just so dumb that it's banned.",
            "title_similarity": "0.5050675",
            "sentiment_compound": -0.6532
        },
        {
            "id": "gyifn0q",
            "score": 1,
            "text": "Wait making a drug legal stops people from illegally using it?????? What",
            "title_similarity": "0.522468",
            "sentiment_compound": -0.264
        },
        {
            "id": "gyig9gb",
            "score": 1,
            "text": "If only it also led to a decrease of smell from downstairs neighbor's apartment - the victory would be perfect.",
            "title_similarity": "0.34669864",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gyihneu",
            "score": 1,
            "text": "Went from war on drugs, to war on law abiding citizens. Too many people breaking the law, it’s the laws fault and should be changed. Just say it’s racist and some dumb politician who wants to stay in power will get behind it. Downfall of American ideals.",
            "title_similarity": "0.5401418",
            "sentiment_compound": -0.9517
        },
        {
            "id": "gyiianv",
            "score": 1,
            "text": "Cool now let’s try this with guns....",
            "title_similarity": "0.12777126",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gyim184",
            "score": 1,
            "text": "So how does this not show that cannabis is a gateway drug? Seems like the numbers are pretty clear.",
            "title_similarity": "0.4435344",
            "sentiment_compound": 0.8074
        },
        {
            "id": "gyj2d25",
            "score": 1,
            "text": "Used to work as a civilian in law enforcement… just want to point out that the decrease in narcotic seizures is likely because dogs (and people!) can more easily hit on the smell of marijuana than other things. So, frequently the car/person would be searched because of the marijuana, and the other narcotics would be found incidentally",
            "title_similarity": "0.63427037",
            "sentiment_compound": 0.5081
        },
        {
            "id": "gyj5ya9",
            "score": 1,
            "text": "Technically you can't attribute it to that, but also yeah it probably helps a bit",
            "title_similarity": "0.11100317",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gyjrodu",
            "score": 1,
            "text": "Reading this from up North and I'm absolutely beside myself in shock that they would make landscapers and cashiers submit to a drug test. What in the actual..",
            "title_similarity": "0.49680787",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gyju59m",
            "score": 1,
            "text": "Ofcourse it has, if it's not illegal, there's nothing to seize.",
            "title_similarity": "0.1899226",
            "sentiment_compound": 0.4449
        },
        {
            "id": "gyomoz8",
            "score": 1,
            "text": "I don't believe that, I've gone to s dispensary a few time to buy Marijuana but the tax on it is so ridiculously high that it's cheaper for me to just buy it from my friend.",
            "title_similarity": "0.6876993",
            "sentiment_compound": 0.0324
        }
    ]
}