{
    "Study: COVID-19 lockdowns led to 95K fewer air pollution-related deaths globally\n": [
        {
            "id": "gz1pdyi",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.30216846",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gz21973",
            "score": -5,
            "text": "This is the first time I didn’t catch any flu or allergy in a year. Im going to wear masks a lot more often even after the pandemic is over.",
            "title_similarity": "0.6120199",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gz1ptq9",
            "score": 28,
            "text": "Perhaps negated by suicided and mental health crisis. (Not saying I disagree with the lockdowns, just that there is two sides) Cheers.",
            "title_similarity": "0.47534597",
            "sentiment_compound": 0.0475
        },
        {
            "id": "gz2lmq3",
            "score": -1,
            "text": "Or did they simply attribute all the pollution deaths to covid?",
            "title_similarity": "0.48484316",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz285c9",
            "score": 46,
            "text": "Ahhh, the silver lining to COVID-19. Thank goodness pollution deaths have decreased…much better for everyone to stay home and be “safe” than out in the world living normal lives. Would definitely rather die of mental health issues than pollution. \n\n“During June 24–30, 2020, U.S. adults reported considerably elevated adverse mental health conditions associated with COVID-19. Younger adults, racial/ethnic minorities, essential workers, and unpaid adult caregivers reported having experienced disproportionately worse mental health outcomes, increased substance use, and elevated suicidal ideation.”\n\nhttps://www.cdc.gov/mmwr/volumes/69/wr/mm6932a1.htm",
            "title_similarity": "0.6785483",
            "sentiment_compound": -0.4728
        },
        {
            "id": "gz2hgwn",
            "score": 26,
            "text": "There are 50,000 traumatic brain injury deaths in the US each year. Seems obvious that the government should mandate wearing helmets 24/7.",
            "title_similarity": "0.6166836",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gz2ia9q",
            "score": 22,
            "text": "Can’t wait for the climate lockdowns to start and for Reddit to shame anyone who questions it as “not caring about the environment”.",
            "title_similarity": "0.45597175",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gz2kgfb",
            "score": 1,
            "text": "What about the increase in suicides? Does it offset this number?",
            "title_similarity": "0.45831013",
            "sentiment_compound": 0.4651
        },
        {
            "id": "gz2i61a",
            "score": 2,
            "text": "Don't hundreds of individual temperature controlled rooms do more damage than a single office? Cam we stop with this nonsense of wfh being environmentally good?",
            "title_similarity": "0.66247773",
            "sentiment_compound": -0.7053
        },
        {
            "id": "gz2ewql",
            "score": 7,
            "text": "Love seeing good news. But I kinda call bs on this. Seems like it's an almost impossible thing to prove or disprove",
            "title_similarity": "0.2919777",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gz2bz46",
            "score": -15,
            "text": "Remember those three weeks early in 2020 that the sky turned blue and didn't reek of exhaust/smog/chemical fumes?\n\nI remember. It was great.\n\nThat was our chance, or LAST chance, to change how humans treat the planet and to rebuild our infrastructure for a clean ecology.\n\nUnfortunately that time has passed and corporate world won't let it happen again.",
            "title_similarity": "0.63167465",
            "sentiment_compound": 0.9149
        },
        {
            "id": "gz2is8g",
            "score": 0,
            "text": "I'm highly skeptical of ANY statistics related to covid-19.  There's deception everywhere.",
            "title_similarity": "0.25878805",
            "sentiment_compound": -0.6697
        },
        {
            "id": "gz2kqa0",
            "score": 0,
            "text": "Imagine if we held India and China accountable for their extreme contribution to pollution, how many more deaths would be avoided?",
            "title_similarity": "0.5816972",
            "sentiment_compound": -0.34
        },
        {
            "id": "gz2amws",
            "score": 25,
            "text": "Let me guess what the next headline will read. “Gov suggest full time lockdown to prevent air pollution deaths”",
            "title_similarity": "0.40899646",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gz2f0wy",
            "score": 13,
            "text": "Politicians will soon call for \"climate lockdowns\"",
            "title_similarity": "0.266537",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz2nwoz",
            "score": 3,
            "text": "Well if we lock all of ourselves in a bubble our entire lives we can probably live to 100 on average, so what?",
            "title_similarity": "0.51424587",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gz2v9nh",
            "score": 0,
            "text": "Unpopular theory here: they still died... *with covid*",
            "title_similarity": "0.40468615",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gz3tu3r",
            "score": 0,
            "text": "The media’s hard on for lockdowns knows no bounds.",
            "title_similarity": "0.21118008",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gz2lyzd",
            "score": 9,
            "text": "And if you sedated people...  strapped them to a bed... fed them a nutrient solution... almost noone would die.\n\nOr really live.",
            "title_similarity": "0.4408176",
            "sentiment_compound": -0.3262
        },
        {
            "id": "gz2mews",
            "score": 8,
            "text": "Yay! Let's stay locked in forever!",
            "title_similarity": "0.12591264",
            "sentiment_compound": 0.6103
        },
        {
            "id": "gz2o7fq",
            "score": 0,
            "text": "[https://www.psycom.net/covid-19-suicide-rates](https://www.psycom.net/covid-19-suicide-rates)\n\nAlmost a wash. I guess self inflicted gunshot is less painless that dying from car fumes.",
            "title_similarity": "0.62081933",
            "sentiment_compound": 0.204
        },
        {
            "id": "gz2gyj8",
            "score": 28,
            "text": "This is good but overdoses have doubled, mental health of children is plummeting and people are lost their livelihoods but those seem to matter",
            "title_similarity": "0.5793209",
            "sentiment_compound": 0.128
        },
        {
            "id": "gz28o0s",
            "score": 10,
            "text": "I wonder how many of the 95k died of covid instead? I’m sure the pandemic saved a lot from flu and pneumonia deaths as well.",
            "title_similarity": "0.6346855",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz23wyl",
            "score": 13,
            "text": "How many more died from Covid instead though?",
            "title_similarity": "0.49405554",
            "sentiment_compound": -0.5984
        },
        {
            "id": "gz2ei3r",
            "score": -2,
            "text": "better air to breathe yet people die suffocating :(",
            "title_similarity": "0.46076432",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gz2h8ly",
            "score": 3,
            "text": "It also leads to a higher student suicide rate, 60% of business going out of business indefinitely and higher suicide rates for the working class. I also wonder why.",
            "title_similarity": "0.54416215",
            "sentiment_compound": -0.875
        },
        {
            "id": "gz2k4jv",
            "score": 1,
            "text": "Wow thats pretty cool. Just curious in the flip side how many increased suicides ?",
            "title_similarity": "0.4555727",
            "sentiment_compound": 0.9136
        },
        {
            "id": "gz2mifj",
            "score": 1,
            "text": "But how many more suicides and over doses?",
            "title_similarity": "0.37294567",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz2q79y",
            "score": 1,
            "text": "Yeah cause they were all added to the covid death count.",
            "title_similarity": "0.33534175",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gz2zucx",
            "score": 1,
            "text": "And how many MORE deaths from suicide, domestic abuse, and neglect due to strict lockdowns?",
            "title_similarity": "0.41381937",
            "sentiment_compound": -0.9277
        },
        {
            "id": "gz30600",
            "score": 1,
            "text": "air-pollution related deaths: Cause they were all counted as COVID.\n\n\nThis is the problem with blowing up numbers to inflate the dangers of something. You cannot tell what numbers are true or false afterwards. \n\nPlus, you can make up statistics for just about anything and you can make statistics tell you anything. Data is much l like bikinis, what they tell you is far less important than what they hide or don't show.",
            "title_similarity": "0.567729",
            "sentiment_compound": 0.2975
        },
        {
            "id": "gz308jj",
            "score": 1,
            "text": "I would imagine COVID also led to over 100k suicides.\n\nThis article's main point basically implies that more pollution leads to fewer suicides.\n\nI think i need to throw some more plastic bags in a river",
            "title_similarity": "0.65669054",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz1z3z6",
            "score": -4,
            "text": "Covid saw pollution related deaths and said “hold my beer.”",
            "title_similarity": "0.4214432",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz1sxup",
            "score": 107,
            "text": "People in middle and lower income countries will have found the financial stresses of this crisis huge. This would limit their income thus access to basic health care. \n\nIts nice there is a positive to this, but we need a functioning global economy. Westerners seem to have little grasp how precarious lives outside their world is.",
            "title_similarity": "0.46812963",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gz3uieb",
            "score": 2,
            "text": "No, 95k air pollution deaths were labeled as COVID deaths.",
            "title_similarity": "0.7584492",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz3uitu",
            "score": 3,
            "text": "Don’t forget to count the increase in suicides and drug overdoses",
            "title_similarity": "0.41603386",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gz2qjv5",
            "score": 31,
            "text": "Yeah, but didn't like five million more people starve to death?",
            "title_similarity": "0.5525571",
            "sentiment_compound": -0.9133
        },
        {
            "id": "gz2dlpg",
            "score": -18,
            "text": "Oh so this is the real reason for the lockdowns and fear mongering. Your global warming/climate change fear porn didn’t work so you had to make it personal and lots of sheep fell for it. Good to know your end game!",
            "title_similarity": "0.39723927",
            "sentiment_compound": -0.68
        },
        {
            "id": "gz296g1",
            "score": -1,
            "text": "Unless you consider the airborne virus particle of Covid-19 to be a pollutant...",
            "title_similarity": "0.34045017",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz2gaso",
            "score": 0,
            "text": "I'm saying year over year death rates were a slight tick up. Almost every other category of death rates went down.",
            "title_similarity": "0.71316075",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gz2gzj0",
            "score": -4,
            "text": "Masking all the time is great policy for general health.",
            "title_similarity": "0.28922674",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gz2k1hu",
            "score": 0,
            "text": "And how many COVID deaths did they prevent? If the number is comparable to these other things then more of a sign that this is a failed policy",
            "title_similarity": "0.5904767",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gz2m8u1",
            "score": 0,
            "text": "I don’t know how realistic it is to say that lockdown lead to this specific number since surely many people that would have died due to pollution died because of covid instead",
            "title_similarity": "0.49896884",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gz2nn5h",
            "score": 0,
            "text": "Could also be that those who would've die of air pollution (esp older people) might've caught covid and died of covid.",
            "title_similarity": "0.50928295",
            "sentiment_compound": -0.8176
        },
        {
            "id": "gz2qcn6",
            "score": 0,
            "text": "The reduction in pollution, flu and traffic deaths makes excess deaths during covid much uglier. Are there any types of death that increased? Suicide is all I can think of.",
            "title_similarity": "0.65328026",
            "sentiment_compound": -0.9201
        },
        {
            "id": "gz3g67j",
            "score": 0,
            "text": "How many suicides did it lead to? Or how about domestic violence cases?",
            "title_similarity": "0.37290406",
            "sentiment_compound": -0.6662
        },
        {
            "id": "gz3j3xi",
            "score": 0,
            "text": "Totally worth the suicides and drug addiction CAUSED by them.  Totally.",
            "title_similarity": "0.3168999",
            "sentiment_compound": 0.2944
        },
        {
            "id": "gz3mmeh",
            "score": 0,
            "text": "And contributed to many deaths in other areas including suicide and drug overdose..",
            "title_similarity": "0.32002056",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gz3r3fr",
            "score": 0,
            "text": "I don't go to parties because alcohol is dangerous and drunk people sometimes get violent. I stay safe.\n\nI don't drive anywhere because driving is very dangerous and you rely on so many other people that make mistakes all the time that can kill you. I stay safe.\n\nI don't fly out of my hometown because if something happens to the plane, i would die. I stay safe.\n\nI don't work because there are so many workplace fatalities every year. I stay safe.\n\nI don't live anywhere too hot because sometimes there are fires, and people die of heat exhaustion! I stay safe.\n\nI don't live anywhere too cold because the winters are brutal and some people freeze to death or slip on ice. I stay safe. \n\nMan, the world sure is full of stuff that's dangerous. I don't really have a life, but at least I'm alive!",
            "title_similarity": "0.48529422",
            "sentiment_compound": -0.9125
        },
        {
            "id": "gz3rfiv",
            "score": 0,
            "text": "How many death related to loss of work and healthcare due to lockdowns? Especially in countries that did not offer any sort of PPP loans to business owners that got shut down. Probably a lot higher.",
            "title_similarity": "0.67302334",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gz2ji2t",
            "score": 14,
            "text": "Now do cancer and suicides, etc etc etc etc",
            "title_similarity": "0.31105137",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gz22cy1",
            "score": 153,
            "text": "I might argue that those 95k fewer air pollution related deaths died of COVID instead since the virus attacks the respiratory system and killed those with weaker immune systems.",
            "title_similarity": "0.7134222",
            "sentiment_compound": -0.9337
        },
        {
            "id": "gz3ddil",
            "score": 13,
            "text": "[deleted]",
            "title_similarity": "0.21341418"
        },
        {
            "id": "gz2qh69",
            "score": -1,
            "text": "Homicides, suicides, and overdoses make up for it though.",
            "title_similarity": "0.38354087",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz2svr1",
            "score": 1,
            "text": "Just think what would happen if petroleum companies stopped pumping their products with chemicals that are toxic when burned.\n\nCO2 is plant food.\n\nThe highest CO2 levels in Earth's history are around 6,000 parts per million and supported megaflora and megafauna while the current existential crisis we are being constantly bombarded with is a shade over 400 parts per million.\n\nThe Earth is not at risk of ending due to CO2 levels less than 7% of the highest theorized levels that supported life on the planet.\n\nIf sea levels rise, humans will migrate.  Humans have been migrating based on local and regional conditions for all of history.  All creatures do the same.\n\nSpend 12 seconds researching climate engineering and it becomes clear, just like scarcity in the money supply, things like modern water scarcity are intentional and artificial, especially as engineers can now manipulate the \"rivers of the sky\".  You're not going to find these answers on Google because they're in on the scam.\n\nGenuine inquiry and curiosity is no longer allowed because \"the science is settled\".  That's just a cult mantra.  The baseline facts and assumptions in the majority of our public policy today are just lies, and they're not that hard to suss out once you know what you're looking for. The Establishment arguments make sense as long as the baseline assumptions are correct, but the baseline assumptions are just hot nonsense under any level of scrutiny.\n\nReal truth and real science invites scrutiny and stands resolute in the face of any questioning and any challenge.  If an opposing viewpoint is censored or banned, it means that the mainstream viewpoint is unlikely to hold up to scrutiny.  But this is r/science, so you are probably either a bot or still asleep.",
            "title_similarity": "0.601819",
            "sentiment_compound": -0.7136
        },
        {
            "id": "gz3oyty",
            "score": -1,
            "text": "Here we go. Knew it was only a matter of time until people started suggesting lockdowns in order to sAvE tHe EnViRoNmEnT",
            "title_similarity": "0.37700227",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gz3vg3w",
            "score": 1,
            "text": "95k represents 0.001% of the world population. A statically insignificant number. Just pointing out facts. I don't want to hear \"If one of them was a friend or relative of yours...\" etc.",
            "title_similarity": "0.6277868",
            "sentiment_compound": 0.2211
        },
        {
            "id": "gz3yn4t",
            "score": -1,
            "text": "Cool. How many starvations and suicides did lockdowns cause, or are we waiting for the final results?",
            "title_similarity": "0.47529364",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gz430oh",
            "score": 1,
            "text": "who cares? how many suicides and deaths from untreated illnesses because people were afraid to come to the hospital?",
            "title_similarity": "0.46348247",
            "sentiment_compound": -0.1431
        },
        {
            "id": "gz46xlg",
            "score": 1,
            "text": "And how many suicides? So many in my circle went from getting ahead too going in debt.",
            "title_similarity": "0.5109668",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gz48du5",
            "score": 1,
            "text": "I want to see suicide rates during lockdown compared to no lockdown.",
            "title_similarity": "0.55559456",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gz2ewmr",
            "score": -2,
            "text": "Overall the job system and schedule is old and opressive. We human are used to populate the streets everyday even when is not neccesary. Going out is more dangerous than before.\nI support staying at home and less pollution but most people don't care about health they care only for their jobs and the rutine.\nHere in my contry (Panama) everyone wants to go out and gather with people. They really want to get rid of the mask and the social distancing and hygiene protocols.",
            "title_similarity": "0.4185346",
            "sentiment_compound": 0.2513
        },
        {
            "id": "gz2go45",
            "score": -2,
            "text": "And at least that many suicides.",
            "title_similarity": "0.351569",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz2hy6l",
            "score": -2,
            "text": "Being anti-social has some benefits to society…interesting.",
            "title_similarity": "0.26608273",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gz2i8og",
            "score": -2,
            "text": "What about suicide and divorces?",
            "title_similarity": "0.32256716",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gz2imm0",
            "score": -2,
            "text": "What about the deaths caused from suicide due to the pandemic?",
            "title_similarity": "0.45246765",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gz2mjzr",
            "score": -2,
            "text": "Awesome!  Maybe lockdowns should become part of the policy toolkit to combat climate change.",
            "title_similarity": "0.3082342",
            "sentiment_compound": 0.4574
        },
        {
            "id": "gz2o3d2",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.1593335"
        },
        {
            "id": "gz2otqy",
            "score": 2,
            "text": "Wonder how many people committed suicide and became alcoholics",
            "title_similarity": "0.45261258",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gz2ovc1",
            "score": -2,
            "text": "Trump knew windmills (actually wind turbines) caused cancer.",
            "title_similarity": "0.43192935",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gz2q1gz",
            "score": 2,
            "text": "How many more suicide and domestic assaults?",
            "title_similarity": "0.3215789",
            "sentiment_compound": -0.8516
        },
        {
            "id": "gz2yhpa",
            "score": 2,
            "text": "No stories on the increased suicide, job loss, and poverty created by the lockdowns.",
            "title_similarity": "0.592829",
            "sentiment_compound": -0.8481
        },
        {
            "id": "gz30nw7",
            "score": 2,
            "text": "There are also tens of millions of people suffering from famine because no one is making food due to the lockdowns.",
            "title_similarity": "0.51504767",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gz37zmp",
            "score": 2,
            "text": "Are there any studies about the effect of lockdowns on mental-health related deaths?",
            "title_similarity": "0.48292133",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz3aqq9",
            "score": 2,
            "text": "And how many suicides from depression and poverty?",
            "title_similarity": "0.48431987",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gz3x6qa",
            "score": -2,
            "text": "Another ploy for the Dems to force their “Green New Deal” down our throats and hope that we swallow. \n\n\nAin’t gonna happen",
            "title_similarity": "0.34606427",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gz2dkx5",
            "score": 19,
            "text": "A lot of “gotya” type reasoning with people asking easy to Google questions. I hate it because I can’t tell who is honestly curious or who’s just trying to be contrary.",
            "title_similarity": "0.34293076",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gz25glp",
            "score": -21,
            "text": "This helps explain why the death rate rose 5% during the pandemic that allegedly killed millions",
            "title_similarity": "0.5434403",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gz2gynx",
            "score": 96,
            "text": "That seems very, very quick to be coming out with a statistic like that.",
            "title_similarity": "0.12215784",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gz45r4b",
            "score": 3,
            "text": "This is the dumbest thing I’ve ever heard",
            "title_similarity": "0.29996023",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gz1xttf",
            "score": 950,
            "text": "Why don’t jobs that can be WFH, then stay WFH and continue to not contribute to the environment issues?\n\nHave we not learned from this?",
            "title_similarity": "0.4159225",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz2jgro",
            "score": -3,
            "text": "Makes you think that we should probably have a two week lockdown about every three months.",
            "title_similarity": "0.48081875",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz216hv",
            "score": 715,
            "text": "Also, flu deaths are also apparently way down as well.\n\nEdit: Found a source to back that up:\n\nhttps://www.cdc.gov/flu/about/burden/2019-2020.html\n\nThough I'd want to see the 2020-2021 numbers to be sure.",
            "title_similarity": "0.5454297",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gz3gpln",
            "score": 20,
            "text": "So apparently twice the amount of people who have died of COVID globally, die each year due to air pollution. Never talked about. Would be interesting if we gave the same scrutiny to all causes of human death, the way we have with COVID.",
            "title_similarity": "0.73987895",
            "sentiment_compound": -0.8658
        },
        {
            "id": "gz31zc4",
            "score": 78,
            "text": "Since a lot of people who have come here for lockdown polemics appear to miss this part: \"globally\" really does mean globally. Out of these 95k, the vast majority are in China, so adjust your rhetoric accordingly. From the paper itself:\n\nhttps://advances.sciencemag.org/content/7/21/eabe1178\n\n> **Change in air pollution–related premature mortality**\n>\n> Aggregating across pollutants based on monitor data, we find that changes in pollutant concentrations associated with COVID lockdowns up to 6 July 2020 resulted in −95,000 (95% CI, −160,000 to −29,000) premature mortalities from NO2, PM2.5, and ozone exposure during the lockdown period. Statistically significant changes in air pollution at the 5% level contribute to −67,000 (95% CI, −115,000 to +19,000) of the total premature mortalities. For comparison, the global death toll of COVID-19 as of 6 July 2020 was 544,000. Changes in NO2 exposure account for −31,000 (95% CI, 65,000 to −2300) premature mortalities, while changes in PM2.5 exposure account for −64,000 premature mortalities (95% CI, −95,000 to −32,000) and changes in ozone exposure for 300 additional premature mortalities globally (95% CI, −190 to 800).\n>\n> **China accounts for 79% of the estimated decrease in total premature mortalities, including 65% of the reductions in NO2 mortalities, and 85% of the reductions in PM2.5 mortalities. For Europe, we estimate a total change of −6600 premature mortalities (95% CI, −13,000 to +380) from reduced exposure to NO2 and −6100 premature mortalities (95% CI, −9100 to +3100) from changes in PM2.5**. If different CRFs are used (see Materials and Methods), we find average mortality estimates of −43,000 (95% CI, −62,000 to −25,000) for PM2.5 and −51,000 (95% CI, −62,000 to −40,000) for NO2 (see Materials and Methods). When using cause-specific CRFs, we find that changes in ambient levels of NO2 resulted in −2800 (95% CI, −11,000 to +6000) premature mortalities from respiratory diseases and −10,000 (95% CI, −41,000 to +21,000) from cardiovascular diseases. Ambient changes in PM2.5 are found to result in −10,000 (95% CI, −14,000 to −7000) premature mortalities from respiratory diseases and −38,000 (95% CI, −50,000 to −25,000) from cardiovascular diseases. Overall, using cause-specific CRFs results in a total of −60,000 (95% CI, −116,000 to −4200) premature mortalities, compared to −95,000 with the all-cause CRFs, with 75% of avoided premature mortalities being from cardiovascular diseases and 25% from respiratory diseases.\n>\n> **Reductions in air pollution–related premature mortalities per capita represent less than 2.8% (95% CI, 0.56 to 5.1%) of the deaths per capita from COVID-19 in the United States (51) and 6.4% (95% CI, 1.0 to 12%) in Europe, but are between 2.3 and 16 times greater than the reported number of COVID-19 deaths per capita in Asia.** (Up to last July that is, so resist the urge to comment about India or the like.)\n\nIn fact, the article also says the same thing later on, but of course, even the people who should know science cannot be condensed to headlines still do not read even the articles linked.\n\n> The United States saw a more than 4% drop in airborne nitrogen oxide levels, but a less than 1% decline in ozone, the data showed. Airborne particulate matter levels remained relatively stable nationally as well.\n>\n> As a result, the United States accounted for a fraction of the reduction in \"premature deaths\" -- or deaths occurring earlier than life expectancy -- caused by respiratory illnesses linked with air pollution exposure.\n>\n> Conversely, China, which, along with the United States, is among the world's biggest polluters, likely made up nearly 80% of the global reduction in premature deaths attributed to air pollution, according to the researchers.\n>\n> The findings suggest COVID-19 lockdowns \"exerted a limited effect\" on global air quality, although some parts of East Asia experienced \"pronounced improvements,\" they said.\n>\n> \"Although the COVID-19 related lockdowns brought significant reductions in economic activities, air pollution levels did not decrease as much as had been speculated at first,\" Chossiere said.\n>\n> \"Primary pollution [from] nitrogen dioxide had the largest decreases and associated health benefits, but, with the notable exception of China, secondary air pollution [from] fine particulates and ozone did not bring significant health benefits,\" he said.\n\nIn the study, they say that long-term air pollution policies would have more impact than the short-term lockdowns.",
            "title_similarity": "0.7050792",
            "sentiment_compound": 0.9641
        },
        {
            "id": "gz2cidy",
            "score": 1768,
            "text": "How many air-pollution deaths are there per year in a normal year?  That is not mentioned in the article which is odd.",
            "title_similarity": "0.6930493",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gz2hhxp",
            "score": 1,
            "text": "I would advise LAOP not to go blind pls",
            "title_similarity": "0.19119388",
            "sentiment_compound": 0.3732
        },
        {
            "id": "gz2irv3",
            "score": 2,
            "text": "During peak covid it was crazy how all the sudden I noticed all these places I could see the skyline from, that I've never seen before.",
            "title_similarity": "0.2868443",
            "sentiment_compound": -0.34
        },
        {
            "id": "gz2ixxn",
            "score": 1,
            "text": "The surplus deaths for COVID-19’s tenure are already significantly above the official count. So what other than unaccounted for COVID-19 deaths have brought that number up?",
            "title_similarity": "0.6045989",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gz2kzig",
            "score": 1,
            "text": "Yet at the same time 2020 we saw the worst forest fires on the west coast. My eyes were watery, my throat dry and I had asthma attacks (never had in my life) and I needed an inhaler. I couldn’t see the houses from my house or the trees from the smoke. The scientists said that what we saw in 2020 was predicted for 2050, so we have utterly failed. I am very anxious for this summer. We already have drought here but in California they have severe drought 70% and drought 90% in the State overall. It looks like this summer might be worse…",
            "title_similarity": "0.5955148",
            "sentiment_compound": -0.7645
        },
        {
            "id": "gz2p450",
            "score": 1,
            "text": "If true the real killer is artificial pollution and yet we don't call it a pandemic?",
            "title_similarity": "0.41851372",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gz2qkjd",
            "score": 1,
            "text": "Air pollution related deaths? Is that like cancer and asthma?",
            "title_similarity": "0.42127174",
            "sentiment_compound": -0.504
        },
        {
            "id": "gz2qnxb",
            "score": 1,
            "text": "That’s... not statistically significant",
            "title_similarity": "0.21385187",
            "sentiment_compound": -0.1511
        },
        {
            "id": "gz2r3oq",
            "score": 1,
            "text": "That's all? I mean 100k people is a lot of people and glad we saved them. It just seemed like the risk was way bigger and it should have been a lot higher number of lives saved.",
            "title_similarity": "0.53257155",
            "sentiment_compound": 0.8519
        },
        {
            "id": "gz2s32r",
            "score": 1,
            "text": "How many died because of the lockdown?",
            "title_similarity": "0.45489988",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gz2tz8y",
            "score": 1,
            "text": "How many covid deaths did it save?",
            "title_similarity": "0.54270166",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gz2tzrt",
            "score": 1,
            "text": "This is literally dumb",
            "title_similarity": "0.16158909",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gz2u2zs",
            "score": 1,
            "text": "Study: COVID-19 lockdowns led to fewer car accident related deaths globally, etc etc\n\nOk, so what?...",
            "title_similarity": "0.8292824",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gz2uzr3",
            "score": 1,
            "text": "Yeah and also lead to more suicide and overdose deaths. Stop glorifying lockdowns.",
            "title_similarity": "0.41128388",
            "sentiment_compound": -0.3384
        },
        {
            "id": "gz2v0v8",
            "score": 1,
            "text": "I bet you it will led to many hundreds of thousands of deaths to cancer because people weren't getting screened and put off medical testing because of the fear of COVID.\n\nThis is not to mention the hundreds of thousands of despair deaths we already know happened because of the lockdowns.",
            "title_similarity": "0.50388306",
            "sentiment_compound": -0.872
        },
        {
            "id": "gz2vivm",
            "score": 1,
            "text": "Stop trying to justify lockdowns we all know they were a net negative.",
            "title_similarity": "0.34701777",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gz2vj2d",
            "score": 1,
            "text": "Seriously doubt this can actually be proven.  1) Trying to prove a negative \"people didn't die...\" (2) during Covid, people were turned AWAY from medical care for routine treatment... chances are those people died with respiratory-related deaths that were then counted as... you guessed it... COVID.  OR... deaths from pollution were not diagnosed as such due to lack of near-term medical care.",
            "title_similarity": "0.5972141",
            "sentiment_compound": -0.3515
        },
        {
            "id": "gz2vs7z",
            "score": 1,
            "text": "Clearly pollution went down, but maybe the masks helped as well?",
            "title_similarity": "0.52007365",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gz2walf",
            "score": 1,
            "text": "I wonder how traffic deaths were affected",
            "title_similarity": "0.32204968",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gz2wojy",
            "score": 1,
            "text": "But we lost more to COVID. \nIs this like a 'pick your poison' kinda deal?",
            "title_similarity": "0.47185776",
            "sentiment_compound": -0.5977
        },
        {
            "id": "gz2x3ip",
            "score": 1,
            "text": "I’d love to know how many people have died from covid compared to how many people didn’t die this past year as a result of the global response to the pandemic so things like pollution and flu and car accidents",
            "title_similarity": "0.6754055",
            "sentiment_compound": -0.6621
        },
        {
            "id": "gz2x4ae",
            "score": 1,
            "text": "We're basically killing ourselves over little green pieces of paper and there's no end in sight. Keep it going.",
            "title_similarity": "0.38903677",
            "sentiment_compound": -0.765
        },
        {
            "id": "gz2x7v4",
            "score": 1,
            "text": "Maybe we should be doing a 2 week period where everyone stays home each year.",
            "title_similarity": "0.47761983",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz2xeuq",
            "score": 1,
            "text": "Will we ever know how many died from suicidal depression?",
            "title_similarity": "0.41885066",
            "sentiment_compound": -0.9153
        },
        {
            "id": "gz2y8sy",
            "score": 1,
            "text": "Passive smoking has also reduced significantly,\nIt's been more than an year since my nose caught cigarette smell",
            "title_similarity": "0.73886347",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gz2yrbz",
            "score": 1,
            "text": "How many people died last year because of covid?",
            "title_similarity": "0.6047069",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gz2ytj3",
            "score": 1,
            "text": "Sounds like a pretty solid case for more WFH.",
            "title_similarity": "0.19745332",
            "sentiment_compound": 0.743
        },
        {
            "id": "gz2yw07",
            "score": 1,
            "text": "Same same...but different....but still same!",
            "title_similarity": "0.13247748",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz2zay6",
            "score": 1,
            "text": "How much of this can be attributed to wearing masks? Because that seems a lot more plausible.",
            "title_similarity": "0.19425471",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz2zuae",
            "score": 1,
            "text": "This information should be at the forefront of our collective research and news.  We really have no choice but to make global changes that improve and maintain clean energy sources.  It’s been ignored for decades or put on the back burner as we focus on other things.",
            "title_similarity": "0.46061656",
            "sentiment_compound": 0.7477
        },
        {
            "id": "gz301m4",
            "score": 1,
            "text": "How many lives are saved through the means provided by the same technologies that utilize the structures which product the pollution?\n\nI bet the numbers aren’t comparable",
            "title_similarity": "0.6280449",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gz30b4f",
            "score": 1,
            "text": "Cool let’s just have everyone stay at home!",
            "title_similarity": "0.17635362",
            "sentiment_compound": 0.3802
        },
        {
            "id": "gz30ing",
            "score": 1,
            "text": "Do you think we'll have rolling climate lockdowns in the future?",
            "title_similarity": "0.30700943",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz31msy",
            "score": 1,
            "text": "Imagine that. Me not having to drive my bronco that gets 10mpg would put less pollutants into the air. Weird.",
            "title_similarity": "0.65774196",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gz327oq",
            "score": 1,
            "text": "And way more than 95k from obesity related issues from lockdown",
            "title_similarity": "0.6000097",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz32n2g",
            "score": 1,
            "text": "So what I read is the vid isn't as deadly as air pollution",
            "title_similarity": "0.5093299",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz32tod",
            "score": 1,
            "text": "They also led to much higher suicides.",
            "title_similarity": "0.35783762",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz33bf1",
            "score": 1,
            "text": "It’d be nice to have this more often. Like a mandatory one month lock down every other year to improve the air quality and no other reason.",
            "title_similarity": "0.5872613",
            "sentiment_compound": 0.7635
        },
        {
            "id": "gz33ltz",
            "score": 1,
            "text": "Can anyone tell me what city is this? It kinda looks like San Francisco",
            "title_similarity": "0.22326769",
            "sentiment_compound": 0.3008
        },
        {
            "id": "gz3551b",
            "score": 1,
            "text": "I wonder how this affected animal life?",
            "title_similarity": "0.120298535",
            "sentiment_compound": -0.1901
        },
        {
            "id": "gz355ne",
            "score": 1,
            "text": "Yes but another little particulate in the air got a couple million.",
            "title_similarity": "0.5315759",
            "sentiment_compound": 0.2144
        },
        {
            "id": "gz35ppd",
            "score": 1,
            "text": "Of course, because 95k of those probably died from COVID....",
            "title_similarity": "0.65848374",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gz3611w",
            "score": 1,
            "text": "And now we going to bring it all back let's rumble",
            "title_similarity": "0.0046802517",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz362vd",
            "score": 1,
            "text": "No one cares i need to pollute to enjoy life, even breathing produces co2. Unless we find a way to use co2 for energy and produce water or oxygen out of it i dont care.",
            "title_similarity": "0.40641946",
            "sentiment_compound": -0.6495
        },
        {
            "id": "gz3641y",
            "score": 1,
            "text": "Also way less road accidents I bet.",
            "title_similarity": "0.5118924",
            "sentiment_compound": -0.2551
        },
        {
            "id": "gz38zl4",
            "score": 1,
            "text": "Hey why don’t we all just stay home foever? Outside is too scary!!!! Right ?!?!",
            "title_similarity": "0.20122781",
            "sentiment_compound": -0.7103
        },
        {
            "id": "gz3a28v",
            "score": 1,
            "text": "And how many suicides?",
            "title_similarity": "0.36556423",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz3b4yr",
            "score": 1,
            "text": "I thought that this was an interesting read and I hope some of the changes made in the United States and China will help the population make better decisions in the future. We cannot afford to pollute our planet because it is the only home we have.",
            "title_similarity": "0.5023708",
            "sentiment_compound": 0.9403
        },
        {
            "id": "gz3bwy0",
            "score": 3,
            "text": "Yet we are still discussing the merits of encouraging remote work for jobs that working fully or partially remotely is immaterial...",
            "title_similarity": "0.24360634",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gz3dvam",
            "score": 1,
            "text": "I have asthma, and wearing a mask helped my breathing substantially!I mean almost never using my inhaler level changes.",
            "title_similarity": "0.5004394",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz3fh8f",
            "score": 1,
            "text": "This is nothing compared to the indirect deaths lockdown will cause in the third world.",
            "title_similarity": "0.55454004",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz3fng2",
            "score": 1,
            "text": "I told you guys lockdowns work!",
            "title_similarity": "0.2082364",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz3gqwu",
            "score": 1,
            "text": "TIL Life can kill you.",
            "title_similarity": "0.24090011",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gz3i8fj",
            "score": 1,
            "text": "Well you can't call it a pollution death if they take their own life.... There's more harm then good from lockdowns.",
            "title_similarity": "0.5157223",
            "sentiment_compound": -0.5314
        },
        {
            "id": "gz3jcql",
            "score": 1,
            "text": "So strictly speaking, if we agree not wearing a mask or not being vaccinated means you are killing other people, does that mean driving a car unnecessarily is killing other people too?",
            "title_similarity": "0.37004972",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gz3jgtb",
            "score": 1,
            "text": "So you can add that to the excess deaths related go covid i suppose.",
            "title_similarity": "0.30562395",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz3k77p",
            "score": 1,
            "text": "What about people who don't live in areas where pollution deaths aren't a factor",
            "title_similarity": "0.569975",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz3khnr",
            "score": 1,
            "text": "What type of air pollution death kills within one year of initial exposure?",
            "title_similarity": "0.6848426",
            "sentiment_compound": -0.8126
        },
        {
            "id": "gz3l7fp",
            "score": 1,
            "text": "I wonder how the overall reduced death rate due to lockdowns compares to previous years. We have the excess death numbers but we don't have a good idea of what may or may not have *actually* been covid to make accurate comparisons.",
            "title_similarity": "0.64405453",
            "sentiment_compound": -0.7911
        },
        {
            "id": "gz3lfra",
            "score": 3,
            "text": "More business should evaluate their employees working from home.",
            "title_similarity": "0.22796087",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz3m3ae",
            "score": 1,
            "text": "A person here in the UK had air pollution as the cause of death for the first time",
            "title_similarity": "0.57655936",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gz3p241",
            "score": 3,
            "text": "I am very proud to make the 1000th comment in this submission",
            "title_similarity": "0.33786762",
            "sentiment_compound": 0.5256
        },
        {
            "id": "gz3qreq",
            "score": 1,
            "text": "not that everyone is but we shouldn't be justifying the lockdown past the virus itself imo\n\ni do think a lot of society is wasting resources working. Bring on ubi as automation is coming anyways. But We should be having people home for those reasons over justifying what's currently going on with unrelated points.",
            "title_similarity": "0.38664064",
            "sentiment_compound": -0.5499
        },
        {
            "id": "gz3rpyi",
            "score": 1,
            "text": "I don't understand how does this even measured?",
            "title_similarity": "0.0630143",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz3sd42",
            "score": 1,
            "text": "I am curious to know where the increase in suicides landed? I’m sure it was less than 95k but would like to know the correlation. And the decrease of flu deaths. On a mean scale of “deaths due to…. Car crashes, suicides, flu” what was the +\\- of it all?",
            "title_similarity": "0.76243126",
            "sentiment_compound": 0.4871
        },
        {
            "id": "gz3u8wu",
            "score": 1,
            "text": "That's fascinating. When looking at the change in mortality rates due to Covid one has to consider factors that cause an increase and those that cause a decrease.  Nothing is as simple as it seems.",
            "title_similarity": "0.512195",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gz3wqj5",
            "score": 1,
            "text": "And every idiot learned nothing from this pandemic. Going back to business as usual is horrible. Commute times, pollution is damaging the world",
            "title_similarity": "0.47480288",
            "sentiment_compound": -0.8779
        },
        {
            "id": "gz3xqou",
            "score": 1,
            "text": "Tell Ron Desantis please.",
            "title_similarity": "0.094561614",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gz3y9hx",
            "score": 1,
            "text": "You say that like its a good thing.",
            "title_similarity": "0.09886434",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gz3yjbn",
            "score": 1,
            "text": "Middle managers that force people to commute every day responsible for ~95K deaths globally. :P",
            "title_similarity": "0.5716021",
            "sentiment_compound": 0.6166
        },
        {
            "id": "gz3yyf1",
            "score": 1,
            "text": "What is a air pollution death? Like natural causes?",
            "title_similarity": "0.46219292",
            "sentiment_compound": 0.1179
        },
        {
            "id": "gz3yzcb",
            "score": 1,
            "text": "Naw, they just got counted as Covid.",
            "title_similarity": "0.21617663",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz41xx9",
            "score": 1,
            "text": "Cool! We should all stay shut in forever!",
            "title_similarity": "0.22151953",
            "sentiment_compound": 0.4374
        },
        {
            "id": "gz435ah",
            "score": 2,
            "text": "After all the consternation surrounding the impact dealing with COVID would have on the economy, I'd be *very* interested in the number of economic-related deaths relative to non-covid years.\n\nEconomic-related deaths being starvation, mal-nutrition, exposure, things easily prevented in 1st world countries with even a nominal amount of wealth.",
            "title_similarity": "0.56656355",
            "sentiment_compound": 0.8399
        },
        {
            "id": "gz45c2g",
            "score": 1,
            "text": "Find light in the dark!",
            "title_similarity": "0.0764451",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz467di",
            "score": 1,
            "text": "All the world's highest peaks could be seems miles and miles away because of the global lockdown and reduced smoke and air pollution. hope we can lower and completely stop air pollution in this century.",
            "title_similarity": "0.6307237",
            "sentiment_compound": -0.2006
        },
        {
            "id": "gz47580",
            "score": 1,
            "text": "So does that increase the likely amount of covid-19 deaths because it increases the Delta between the predicted and actual annual deaths y/y?\n\nI say that because many nations have hid the true numbers and so my assumption is that using the predicted year over year death counts corrected for changes like this might be our best way of estimating in some areas.",
            "title_similarity": "0.61007935",
            "sentiment_compound": 0.7759
        },
        {
            "id": "gz47836",
            "score": 1,
            "text": "*Sigh*\n\nHere come the \"flatten the climate change curve\" lockdowns I guess.",
            "title_similarity": "0.45262578",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gz48v2b",
            "score": 1,
            "text": "One year of clean air doesn't negate the lifetime of bad air intake?",
            "title_similarity": "0.66264725",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gz49hsh",
            "score": 1,
            "text": "So you saying jobs that can be done from home instead of wasting half our lives commuting can save lives? :P",
            "title_similarity": "0.5417495",
            "sentiment_compound": 0.4995
        },
        {
            "id": "gz4afxp",
            "score": 1,
            "text": "This is good. It is worth noting, however, the following: \n\nWhile there was a decrease in deaths related to things such as this, there was an  _increase_ in deaths related to other things (e.g. mental health and domestic abuse). \n\nIn other words, there is an important caveat to be mindful of when reading about such findings. Yes, lives were saved  due to lockdown, but other lives were lost. Sadly, I saw this, even personally.",
            "title_similarity": "0.5793423",
            "sentiment_compound": -0.4678
        },
        {
            "id": "gz4aq02",
            "score": 1,
            "text": "Who would have known not needing to commute back and fro from work everyday would reduce pollution? \n\nWith current advances in technology and how common it is for people to have their own computers at home, there is not much reason for a physical office any more for most office based work.",
            "title_similarity": "0.51802564",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz4atug",
            "score": 1,
            "text": "\nTherefore invest in public transportation",
            "title_similarity": "0.1116648",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz4awa4",
            "score": 1,
            "text": "Instead they died of chronic depression, suicide, and diabetes resulting from a forced sendentary lifestyle.",
            "title_similarity": "0.42502785",
            "sentiment_compound": -0.9413
        },
        {
            "id": "gz4b4z6",
            "score": 1,
            "text": "Lockdown should be an annual event. Pick a month !",
            "title_similarity": "0.40111253",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz4bf9d",
            "score": 1,
            "text": "What about depression deaths?!?! I imagine it was a lot more than 95,000",
            "title_similarity": "0.64107853",
            "sentiment_compound": -0.6852
        },
        {
            "id": "gz4ca5m",
            "score": 1,
            "text": "It also led to double the suicides vs 2019 in my country",
            "title_similarity": "0.60297173",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz4cdlv",
            "score": 1,
            "text": "BS! How many deaths worldwide due to COVID-19? What is 95K in all that?",
            "title_similarity": "0.6125293",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz4dg6z",
            "score": 1,
            "text": "Air-pollution related deaths?  Not sure what they mean by that, but I’m guessing it’s more bunk science.",
            "title_similarity": "0.46752286",
            "sentiment_compound": -0.1232
        },
        {
            "id": "gz4e7qs",
            "score": 1,
            "text": "But most of the people who died of it were poor and could do nothing about it, including participating in lockdowns.",
            "title_similarity": "0.52408993",
            "sentiment_compound": -0.8765
        },
        {
            "id": "gz4fatm",
            "score": 1,
            "text": "That's almost nothing",
            "title_similarity": "0.16011745",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz4fjqt",
            "score": 1,
            "text": "Now that we are started back up, will these folks now die?",
            "title_similarity": "0.27597883",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gz4g6k3",
            "score": 1,
            "text": "However suicide and starvation increased by 3 million",
            "title_similarity": "0.50534385",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gz4g9cl",
            "score": 1,
            "text": "Sounds like they were delayed till next year.",
            "title_similarity": "0.3636567",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gz4gw1v",
            "score": 1,
            "text": "Bummer. We need more people to die so there is less air pollution.",
            "title_similarity": "0.5268141",
            "sentiment_compound": -0.7759
        },
        {
            "id": "gz4h968",
            "score": 1,
            "text": "I personally think that remote working should be the new norm. Less traffic and cars causing pollution.",
            "title_similarity": "0.46159506",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz4i1zu",
            "score": 1,
            "text": "How would you like to trade all other deaths for only 1 type?",
            "title_similarity": "0.4163288",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gz4jiuj",
            "score": 1,
            "text": "Mm, as I read it the point of the paper is really just highlighting the problems with air pollution more than anything else. Noting that we could be making similar strides to reducing air pollution every year sorta thing",
            "title_similarity": "0.6283853",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gz4jmfs",
            "score": 1,
            "text": "Literally anything to justify forcing half of all small businesses under.",
            "title_similarity": "0.48526296",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz4l8hr",
            "score": 1,
            "text": "So ...\n\nThe world would be a better place if we were all welded into our homes and not allowed outside - ever?\n\nIf all humans died in one day, the climate would “improve” immeasurably in a matter of months. But that’s not a very practical option, is it? You really don’t think that’s practical, do you?",
            "title_similarity": "0.58566725",
            "sentiment_compound": -0.212
        },
        {
            "id": "gz4lv7t",
            "score": 1,
            "text": "Probably incorrect, and they killed far more with suicide deaths and other things by locking people away",
            "title_similarity": "0.35871375",
            "sentiment_compound": -0.8828
        },
        {
            "id": "gz4wevi",
            "score": 1,
            "text": "They were just all falsy classified as covid deaths",
            "title_similarity": "0.37768435",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz518nf",
            "score": 1,
            "text": "We have so much work to do to clean up our biosphere. What this species has done to its own home is deeply concerning.",
            "title_similarity": "0.25810423",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gz56yj6",
            "score": 1,
            "text": "Dumb people on their way to say this is why god made covid and caused suffering:  \nI am not saying bad about theists here, I am just bringing up a point that you cannot just notice the good impact of something and \"prove\" why god did that. Everything in our world has a good impact and bad impact",
            "title_similarity": "0.424322",
            "sentiment_compound": 0.2382
        },
        {
            "id": "gz57dgg",
            "score": 1,
            "text": "Totally not true science \nIf it was true it would take into consideration of all the consequences as well",
            "title_similarity": "0.21074",
            "sentiment_compound": 0.3159
        },
        {
            "id": "gz57jja",
            "score": 1,
            "text": "Lockdowns also led to a spike in suicides and drug overdoses.",
            "title_similarity": "0.30975628",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz57kdf",
            "score": 1,
            "text": "And 2 million extra stress/domestic abuse related deaths.\n\nBut you got less deaths from common contagious diseases like the annual flu, so it kind of evens out.",
            "title_similarity": "0.80482244",
            "sentiment_compound": -0.5023
        },
        {
            "id": "gz58up0",
            "score": 1,
            "text": "Yet there were hundreds of thousands more mental health related deaths",
            "title_similarity": "0.42148292",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz59nmg",
            "score": 1,
            "text": "I wonder why the study didn’t include the 100K more suicides and 100k more overdoses.",
            "title_similarity": "0.6700543",
            "sentiment_compound": 0.0
        },
        {
            "id": "gz59op6",
            "score": 1,
            "text": "And imagine people still crying over wearing masks.  Airborne pandemic and people still think they are special.",
            "title_similarity": "0.3755712",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gz59q5v",
            "score": 1,
            "text": "Its only natural that people are more protected from the worlds dangers in their home so I guess it's time to lock everyone up forever and we'll have the perfect statistics.",
            "title_similarity": "0.36207104",
            "sentiment_compound": 0.7346
        },
        {
            "id": "gz6w3gp",
            "score": 1,
            "text": "I think this is the biggest reason people who can work home should. What a great effortless way to have such a huge impact.",
            "title_similarity": "0.23635921",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gz8fxxl",
            "score": 1,
            "text": "This should be circulated worldwide especially in India and Us where government's constant efforts to stop pandemic are being ridiculed   and criticized and trying to take advantage of down grading lock down effects by scoundrel politicians and some media for their advantage.",
            "title_similarity": "0.3359373",
            "sentiment_compound": -0.4939
        }
    ]
}