{
    "Study: Caffeine may improve the ability to stay awake and attend to a task, but it doesn’t do much to prevent the sort of procedural errors that can cause things like medical mistakes and car accidents. The findings underscore the importance of prioritizing sleep.\n": [
        {
            "id": "gzjf7vz",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.5672932",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gzk3ohd",
            "score": 0,
            "text": "Imma still drink a lot of it in the morning",
            "title_similarity": "0.27869123",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzk5vld",
            "score": 0,
            "text": "I am quite familiar with this phenomena",
            "title_similarity": "0.14417697",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkcnkx",
            "score": -1,
            "text": "This is where nootropics come in",
            "title_similarity": "0.09830961",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn0w2d",
            "score": 0,
            "text": "Finally someone did this study in a scientific manner, I've been saying it for years as a guy who doesn't drink coffee surrounded by the drinkers of nature's meth, they typically judge those of us who don't drink coffee as being too relaxed and that we get lucky when we get things done, but when they break stuff it's the stuff's fault, never theirs, coffee is more than a drink, it's a mentality, like diet nazi.",
            "title_similarity": "0.6447735",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzk4dc5",
            "score": 9,
            "text": "I stopped drinking caffeine a few years ago. While I miss that first jolt in the morning life has been so much better. \n\n5 Minutes after I wake up I'm awake.. I don't need to do anything else. When I lay down at night I'm asleep in 10 minutes versus staring at the ceiling for an hour. Plus I don't have to worry about getting Caffeine everyday to keep the withdrawal headache away.",
            "title_similarity": "0.65032214",
            "sentiment_compound": 0.4913
        },
        {
            "id": "gzk596n",
            "score": 9,
            "text": "> The findings underscore the importance of prioritizing sleep.\n\nAlternative conclusion:\n\"The findings underscore the superiority of methamphetamine over caffeine\".",
            "title_similarity": "0.7612195",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gzl03m8",
            "score": -1,
            "text": "I drink coffee black and cold because: I can't drink juice or soda because of sugar. I do drink flavored club soda which has no sugar. I also drink coffee cause I like the flavor. \n\n&#x200B;\n\n\\--enough said.",
            "title_similarity": "0.61619115",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzjngug",
            "score": 8,
            "text": "the way i would put it in my experience is that IT MAY WORK ONCE\n\nbut you pull water from that well a few too many times and you will pay the consequences",
            "title_similarity": "0.45565274",
            "sentiment_compound": 0.2617
        },
        {
            "id": "gzjq7rj",
            "score": -2,
            "text": "Sure, not surprising at this point. I like the smell and taste of coffee. And it makes it easier to stay awake in the morning. Do I need it to do anything more?",
            "title_similarity": "0.6818123",
            "sentiment_compound": 0.699
        },
        {
            "id": "gzk42do",
            "score": -2,
            "text": "Tired But Wired is not fun",
            "title_similarity": "0.5128911",
            "sentiment_compound": -0.6708
        },
        {
            "id": "gzkc7d3",
            "score": 2,
            "text": "Caffeine decreases perfusion to the brain. You only feel more alert because you’re stressed out.",
            "title_similarity": "0.75715876",
            "sentiment_compound": 0.024
        },
        {
            "id": "gzkepb9",
            "score": 2,
            "text": "Caffeine actually puts me to sleep, or doesn't prevent me from doing so, I drink black tea with nothing in it and it kind of makes me drowsy. I think this is because it was my evening beverage of choice ever since leaving home, so I probably associate with sleeping. At University I was just having tea while staying up to study, and that was counter productive.",
            "title_similarity": "0.6600329",
            "sentiment_compound": -0.0191
        },
        {
            "id": "gzjy9p8",
            "score": 3,
            "text": "I almost got in a crash during my battle with insomnia despite using buckets of caffeine to keep me awake.",
            "title_similarity": "0.7071649",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzk1xdp",
            "score": 2,
            "text": "This is just anecdotal but in college I did get plenty of sleep and caffeine made my thought processes more clear and I felt like I worked a lot faster. So maybe caffeine can’t replace sleep but it can enhance a well rested mind?",
            "title_similarity": "0.73551196",
            "sentiment_compound": 0.867
        },
        {
            "id": "gzk3gl9",
            "score": 4,
            "text": "Tell that to my boss. I work a minimum 40 hours a week for not a lot of money and absolutely no benefits, let alone breaks. Coffee is the perfect sleep and meal supplement.",
            "title_similarity": "0.50163794",
            "sentiment_compound": 0.1357
        },
        {
            "id": "gzk67lz",
            "score": 3,
            "text": "\"prioritizing sleep?\" That sounds like a recipe for better work life balance and happiness. No can do.",
            "title_similarity": "0.74433386",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gzkftet",
            "score": 3,
            "text": "Come on /r/science  you are better than this. \n\nThe study DID NOT make those claims. Those claims are being made from blog journalism, not a direct claim from the study \n\n>https://pubmed.ncbi.nlm.nih.gov/34014758/",
            "title_similarity": "0.600737",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzk2wze",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.08610852"
        },
        {
            "id": "gzjmmpz",
            "score": 102,
            "text": "Drinking coffee is like whipping a tired horse instead of giving it rest and a good meal.",
            "title_similarity": "0.6945679",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gzk68mc",
            "score": 109,
            "text": "[removed]",
            "title_similarity": "0.071656615"
        },
        {
            "id": "gzk3k4o",
            "score": 22,
            "text": "So, caffeine just blocks your ability to \"feel\" sleepy. \n\nBut you're still sleepy, you're just sleepy and mentally wired. \n\n\nI use caffeine all the time, I love it. The taste and smell. \n\n\nI wish you weren't able to OD on caffeine, because if that were the case I would be knocking back coffees all day long.",
            "title_similarity": "0.7040292",
            "sentiment_compound": 0.8898
        },
        {
            "id": "gzk5xi1",
            "score": 44,
            "text": "Prioritize sleep, okay. \n\nMake it so I can work for 6 hours a day and still survive and thrive then.",
            "title_similarity": "0.4661524",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzk81p2",
            "score": 26,
            "text": "Stop making us work so much to afford to live “enjoyable” lives. That’s the only way we’ll get the sleep we need.",
            "title_similarity": "0.67807746",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzju04g",
            "score": 17,
            "text": "This confirms how I often felt. It makes you awake... But it doesn't rly feel like your brain works better. Yeah, I FEEL awake, but it doesn't make my mind work better than before. Drinking coffee feels like... \n\nLike if you're a camera, your lenses get dirty, but also the chip that takes pics starts working less and less the longer you use it. Drinking coffee feels like clearing that lense, everything LOOKS good, but the information processing is still screwed up.",
            "title_similarity": "0.8029939",
            "sentiment_compound": 0.9229
        },
        {
            "id": "gzjvhuy",
            "score": 59,
            "text": "Try telling that to any major corporation, when someone tries to grab a nap on their break cuz they didn't get a good nights rest for one reason or another, and they get in trouble for it cuz \"it doesn't look professional\"",
            "title_similarity": "0.6287656",
            "sentiment_compound": -0.6256
        },
        {
            "id": "gzkdntv",
            "score": 41,
            "text": "Nothing is as pleasant as going to bed when you are dead tired, you just wiggle to find the most comfortable position and then fade out.",
            "title_similarity": "0.66502255",
            "sentiment_compound": -0.7437
        },
        {
            "id": "gzka9jz",
            "score": 101,
            "text": "I kid you not my life improved by several orders when I started to prioritize getting enough sleep AND a consistent sleep schedule (that means awake and out of bed as well).\n\nIt's not just about not being tired. Your hormone production steadies, which means your hunger queues steady, which means you can plan meals better, which means your workouts aren't limited by poor diet, which means you look better, which means you are more confident, which means you make friends more easily, which means...etc\n\nIf I could go back to my HS or even college days I'd prioritize developing a solid sleeping schedule over almost anything else. It makes other things so much easier.",
            "title_similarity": "0.800832",
            "sentiment_compound": 0.968
        },
        {
            "id": "gzk7biu",
            "score": 111,
            "text": "Caffeine, physically, just prevents the feeling of being tired, right?  So yeah, not much of a surprise but nice to have in a full study.",
            "title_similarity": "0.8353132",
            "sentiment_compound": 0.6648
        },
        {
            "id": "gzkbfdy",
            "score": 56,
            "text": "During the pandemic I got into some bad sleeping habits. \n\nI still had to go to work, but my schedule was all over the place. On nights I didn’t have to work the  next day, I would stay up until 3/4 am playing video games. Days I did work, I got up at 6 am. \n\nIt really effected my mental health. I was pretty depressed. After recognizing this, and making better efforts to have a more normal sleep schedule, I have been doing so much better. Just happier. \n\nSleep is so important.",
            "title_similarity": "0.6842309",
            "sentiment_compound": 0.9483
        },
        {
            "id": "gzk9n7k",
            "score": 61,
            "text": "Drugs are not a substitute for already healthy behavior.\n\nI mean, I knew that... But it is good to hear from time to time.",
            "title_similarity": "0.71125686",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzkf6jl",
            "score": 220,
            "text": "I wonder when medical schools and hospitals will get with the program and quit hazing new doctors. There is no reason to force 30 hour shifts, unless there is a major shortage of physicians. To the errors due to shift changes, it’s called documentation. You need to do it for a reason. A lack of documentation and communication is no excuse to push people past the breaking point. \n\nAll the complaining of “ but I want to follow the patient from beginning to ending!,” yeah, you’ll never do that in real life at hospitals. There are departments for a reason.",
            "title_similarity": "0.631446",
            "sentiment_compound": -0.2845
        },
        {
            "id": "gzjlr8o",
            "score": 2886,
            "text": "There is no substitute for sleep.. it's good.",
            "title_similarity": "0.49236885",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzjhxjs",
            "score": 138,
            "text": "[removed]",
            "title_similarity": "0.071656615"
        },
        {
            "id": "gzjnybh",
            "score": 342,
            "text": "I find caffeine is best served in addition to great sleep.  It’s one half of my secret to being a morning person.",
            "title_similarity": "0.72174823",
            "sentiment_compound": 0.8519
        },
        {
            "id": "gzjn1ll",
            "score": 2609,
            "text": "Former resident physician that took 24 hour in-house call. \n\nNot surprising and not a new finding. We have known that sleep dep is terrible for performing tasks involving critical thinking. Caffiene doesnt help you think, it just helps with the overwhelming need to sleep when fatigued. And despite this knowledge, it doesn't prevent hospitals and medical education authorities from staffing physicians (especially residents) this way. \n\nPersonally, I found that by the 20 hour mark, I start working on auto-pilot. By hour 22, I am actively upset at life. Hour 26, I couldnt care less about anything and anything impeding my path to sleep is met with barely contained rage. \n\nIt is a terrible thing to ask someone to do to themselves.",
            "title_similarity": "0.7121222",
            "sentiment_compound": -0.9493
        },
        {
            "id": "gzk9b4u",
            "score": 826,
            "text": "I have a commercial driver's license in Massachusetts. One of the parts of the written test really emphasized that if you're tired, you have to sleep. Don't just drink a coffee or energy drink - sleep. \n\nThen, at training for work, we had to watch a video from the insurance company. (The company is from Pennsylvania.) And they basically said \"if you're feeling tired and don't have a convenient place to stop, just have a coffee! It'll be fine!\"",
            "title_similarity": "0.65821385",
            "sentiment_compound": -0.6351
        },
        {
            "id": "gzk7p88",
            "score": 566,
            "text": "Unfortunately doctors have been one of the most sleep deprived groups (it’s getting a little better over the years but residents still are expected to work long shifts...hence the name).",
            "title_similarity": "0.5919398",
            "sentiment_compound": -0.2699
        },
        {
            "id": "gzka8ui",
            "score": 11,
            "text": "I thought it's common knowledge that Coffein is the \"stay awake\"-drug not the \"makes my sleep deprivation magically go away\"-drug. Reading the comments seems I was wrong",
            "title_similarity": "0.78315806",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gzkbk81",
            "score": 9,
            "text": "Caffeine makes you more awake but not less TIRED.",
            "title_similarity": "0.6880988",
            "sentiment_compound": 0.557
        },
        {
            "id": "gzkdcpk",
            "score": 3,
            "text": "I stopped drinking caffeine when I quickly realized instead of tired, I'd just be tired and jittery.",
            "title_similarity": "0.67828983",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gzkdurv",
            "score": 27,
            "text": "Like I said some time ago, caffeine lets you make sleep-deprived mistakes at full speed and volume.",
            "title_similarity": "0.58276093",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkee49",
            "score": 1,
            "text": "Problem is, there aren't enough folks to do the job available to allow the off shift folks to sleep.",
            "title_similarity": "0.5109383",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzkewtt",
            "score": 1,
            "text": "That title is a contradiction",
            "title_similarity": "0.17726152",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzkfpec",
            "score": 1,
            "text": "I like that you can change caffeine to meth and the study would probably come up with similar results",
            "title_similarity": "0.60897696",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzkfrsj",
            "score": 1,
            "text": "Just because you are wide awake does not mean you are efficient/effective.",
            "title_similarity": "0.62115884",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkgaxh",
            "score": 1,
            "text": "Wait, so I should sleep instead of consume caffeine??",
            "title_similarity": "0.626306",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkgez4",
            "score": 5,
            "text": "As a programmer I can attest to this personally. Fixing a simple bug becomes a Sisyphean task without enough sleep.",
            "title_similarity": "0.5443254",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkgrs4",
            "score": 1,
            "text": "If I ever have to describe the current world to aliens etc. I’ll say that we really understood things like the fact that sleep is really important and just didn’t do anything about it.",
            "title_similarity": "0.5504316",
            "sentiment_compound": 0.5936
        },
        {
            "id": "gzkgs7m",
            "score": 1,
            "text": "Who would’ve known that sleeping is very important. We only do it a 3rd of our lives.",
            "title_similarity": "0.40515962",
            "sentiment_compound": 0.2716
        },
        {
            "id": "gzkh677",
            "score": 1,
            "text": "And with that I will be prioritizing sleep by deleting Reddit.",
            "title_similarity": "0.45950305",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkheks",
            "score": 3,
            "text": "But what if the researchers who conducted and analyzed the results were sleep deprived themselves, and using caffeine to stay awake? How would they know if they made mistakes?",
            "title_similarity": "0.7811369",
            "sentiment_compound": -0.8299
        },
        {
            "id": "gzkhk5g",
            "score": 1,
            "text": "Caffeine should be more a tool to help focus on top of having good sleep, it should not be used to skip sleep.",
            "title_similarity": "0.8283485",
            "sentiment_compound": 0.7506
        },
        {
            "id": "gzkiomi",
            "score": 2,
            "text": "What about 2 caffeines?",
            "title_similarity": "0.2746643",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkir88",
            "score": 1,
            "text": "@ my job that requires me to be awake for 24hrs+ and make very critical decisions",
            "title_similarity": "0.27929795",
            "sentiment_compound": -0.3804
        },
        {
            "id": "gzkiy2b",
            "score": 1,
            "text": "I wipe carts for a living, Caroline, I don't need to be laser-precise",
            "title_similarity": "0.47241998",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkjca6",
            "score": 1,
            "text": "I mean, if you're moving faster with the same amount of errors that's an improvement.",
            "title_similarity": "0.49039674",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gzkjvum",
            "score": 2,
            "text": "I chugged 4 energy drinks! Im energized to face the day! \n\nI can be stupid...faster!",
            "title_similarity": "0.4130944",
            "sentiment_compound": 0.7412
        },
        {
            "id": "gzkk3yd",
            "score": 1,
            "text": "Tell our employers and boomers",
            "title_similarity": "0.13372874",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkkfwo",
            "score": 1,
            "text": "That's not really what the study is saying.\n\nCaffeine is very good at enhancing performance. BUT it cannot outcompete proper sleep.\n\nThe way this title is worded makes it sound like even in a well-rested individual, caffeine does not improve focus or accuracy.\n\nThough this is a really mild case of it, Blogspam needs to die on this sub.",
            "title_similarity": "0.86160624",
            "sentiment_compound": -0.6264
        },
        {
            "id": "gzkkikc",
            "score": 1,
            "text": "Try telling that to babies, they dont give a damn",
            "title_similarity": "0.40917355",
            "sentiment_compound": 0.3089
        },
        {
            "id": "gzkkmc8",
            "score": 1,
            "text": "When you are sleep deprived you are running on cloudy, sloppy thinking and poor concentration so you are apt\nto have slips from your hands and slow reactions so if you are pouring milk you may end up spilling it. It happened to me last night. I was transferring freeze-dried coffee from a large glass jar to a small one and the large one slipped from my hands, hit the small one which sent it cascading along the counter and off onto a chair and then shattering on the floor contaminating the coffee still in the jar with glass shards.",
            "title_similarity": "0.58546853",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gzkkvj2",
            "score": 1,
            "text": "Can I get “things everyone already knows for 1000”  Alex: “it’s a daily double!”",
            "title_similarity": "0.108079895",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkl1ki",
            "score": 1,
            "text": "Join us over at /r/decaf! It’s easier to quit than you think",
            "title_similarity": "0.54431224",
            "sentiment_compound": 0.6476
        },
        {
            "id": "gzklbhg",
            "score": 1,
            "text": "Caffeine helps my…  \n  \nAnxiety to never go away.  \n\n\nShrooms help my focus and they’re outlawed",
            "title_similarity": "0.7283337",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzkllq7",
            "score": 1,
            "text": "I don't know, last time I drank coffee before I performed a medical procedure while driving, everything went alright.",
            "title_similarity": "0.49108922",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzklr5s",
            "score": 1,
            "text": "Said the man with no kids.",
            "title_similarity": "0.21203627",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzklrlo",
            "score": 52,
            "text": "The caffeine is for the energy the Adderall is for the focus. Jeez guys do you even adult???",
            "title_similarity": "0.5443476",
            "sentiment_compound": 0.3899
        },
        {
            "id": "gzklssn",
            "score": 1,
            "text": "So in other words, it just makes you look like you're doing your job. That's good enough for most of us.",
            "title_similarity": "0.4521094",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gzkm5sa",
            "score": 1,
            "text": "If I slept as much as I should I would only get a couple hours a day with wife and kids M-F our society doesn't allow a proper work/ family/ sleep schedule.",
            "title_similarity": "0.5484721",
            "sentiment_compound": -0.1695
        },
        {
            "id": "gzkm8cu",
            "score": 2,
            "text": "Who knows what to believe.\n\nMy mandatory hospital training specifically states, every single year, that caffeine reduces fatigue and reduces medical errors.  Admittedly I haven't read the primary literature because who cares, it's not like I control my schedule anyways.\n\nSincerely, a tired doctor.",
            "title_similarity": "0.6703985",
            "sentiment_compound": -0.2523
        },
        {
            "id": "gzkmcqg",
            "score": 16,
            "text": "One of the strange and troubling things about our culture is how we encourage and celebrate certain addictions not just as acceptable but actually as being fun and charming. Coffee is one, wine is another (particularly among moms). Facebook memes in particular, of course, but lots of places on TV and movies, etc. etc. \n\nCoffee all day, wine at night, day after day... it's not crack and it's not heroin, but it ain't health food either.",
            "title_similarity": "0.72127616",
            "sentiment_compound": 0.9433
        },
        {
            "id": "gzkmmef",
            "score": 1,
            "text": "If you’re interested in cutting caffeine, check out r/caffeinefreelife",
            "title_similarity": "0.49107486",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzkmokj",
            "score": 1,
            "text": "It would be interesting to see the same study undertaken with Provigil (modafinil) and/or Nuvigil (armodafinil).  \n\nAlso, I can't seem to access the study full text-only can read abstract-thus I will ask here:   \n\nDid the study control for the regular dosage of caffeine study participants ingest?  It mentions that they received a 200 mg pill or placebo but I am curious if the study normalized for participant's regular caffeine dosages.  I hypothesize those that never use caffeine would have markedly different results than those ingesting caffeine daily.",
            "title_similarity": "0.64194256",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzkn78g",
            "score": 1,
            "text": "We are not robots though. We like to live a life and do things with our time other than sleep.",
            "title_similarity": "0.6392275",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzkn7dl",
            "score": 1,
            "text": "Everytime I see something from this subreddit reach the front page its always obvious statements like this that get confirmed by a study. Like did people ever think that Caffeine was a substitute for sleep and would help you avoid procedural errors like medical mistakes and car accidents???",
            "title_similarity": "0.68467176",
            "sentiment_compound": 0.3485
        },
        {
            "id": "gzkngka",
            "score": 1,
            "text": "Pandemic taught me that I just *thought* I needed 6-7. Turns out it's 7-9. Now that I don't commute as much, I get more sleep",
            "title_similarity": "0.6906069",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzknrn1",
            "score": 1,
            "text": "I read somewhere that caffeine will just keep awake at the level you are at, so of you're groggy you will stay awake groggy. It was better to either have caffeine just before taking a quick nap or napping then having the coffee. I started doing this through the last few years of university and found that it made a difference.",
            "title_similarity": "0.7446748",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzkns76",
            "score": 1,
            "text": "After 3x 12 hour nights shifts at the hospital you really start to learn what you can and can't do with caffine. Plenty of mornings I should not have driven home.",
            "title_similarity": "0.545927",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkns9y",
            "score": 1,
            "text": "Coffee: Do stupid things faster and with more energy!  That's the motto right?",
            "title_similarity": "0.46477017",
            "sentiment_compound": -0.318
        },
        {
            "id": "gzknx70",
            "score": 1,
            "text": "Maybe if people didn’t have to work so much to afford basic necessities then they would have more time to get a full 8 hours and also have a life outside of work.",
            "title_similarity": "0.5520015",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzknzow",
            "score": 2,
            "text": "So we should make doctors in training work 24 hour shifts!! That’ll learn em",
            "title_similarity": "0.30168134",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzko405",
            "score": 1,
            "text": "So, call me crazy here, maybe our hospitals shouldn't base staff shifts on like 24-48 continuous duty shifts.",
            "title_similarity": "0.54995334",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzkofcw",
            "score": 1,
            "text": "I knew it wasn’t my fault. Maybe I can convince my wife to leave her boyfriend now",
            "title_similarity": "0.44095048",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzkoff4",
            "score": 1,
            "text": "I guess it's good to do official studies on these things but I don't know why anyone would need proof of this. Feeling awake/energetic does not equal being rested. Hell you can even pull all-nighters and catch a second wind even though you should be exhausted; doesn't mean you suddenly don't require sleep.",
            "title_similarity": "0.8132911",
            "sentiment_compound": -0.83
        },
        {
            "id": "gzkoq9m",
            "score": 1,
            "text": "If you think i should get 8 hours sleep then pay me enough so that i only need 1 job",
            "title_similarity": "0.47909206",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzkot5q",
            "score": 1,
            "text": "Don’t show this to the military.",
            "title_similarity": "0.2560499",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkpkl2",
            "score": 2,
            "text": "Can’t sleep, too busy pulling myself up by my boot straps",
            "title_similarity": "0.35966048",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkprdy",
            "score": 1,
            "text": "If I'm pounding energy drinks to get soemthing finished, I'm long past the point of worrying if the thing is anywhere near quality.\n\nSubmitting a sub-par report is better than no report at all.",
            "title_similarity": "0.65129197",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzkq0i8",
            "score": 1,
            "text": "Thanks, employers need to know that not me.",
            "title_similarity": "0.32120094",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzkq4ru",
            "score": 1,
            "text": "In my personal life I've realized that quality of my sleep and my sleep schedule affects my mood for days after. Too little sleep in 2 and more consecutive days can put me in mind fog for 2 weeks. Coffee seems to help a little",
            "title_similarity": "0.66551733",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzkq7vn",
            "score": 1,
            "text": "Figures that this would come around the same day that I got up at 02:30 to photograph an eclipse, then went to work. I can vouch that the coffee ain’t keeping me sharp.",
            "title_similarity": "0.39531946",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkqjub",
            "score": 1,
            "text": "Also the after effects are bad as u feel tired af",
            "title_similarity": "0.5063877",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gzkr460",
            "score": 1,
            "text": "Joke’s on them, coffee doesn’t keep me from sleeping at all",
            "title_similarity": "0.6465776",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkr53c",
            "score": 1,
            "text": "I only notice if it combines with stress.  I drink coffee all day but if I ever drank it before my engineering exams the stress and the caffeine combined to make me very sloppy with mind racing and jittery hands.",
            "title_similarity": "0.5702223",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzkr8bv",
            "score": 1,
            "text": "Let corporations know",
            "title_similarity": "0.1335443",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkrvdb",
            "score": 1,
            "text": "Ironically, this useless article was a snoozer, haha.",
            "title_similarity": "0.40245074",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gzkrw0y",
            "score": 1,
            "text": "Honestly, caffeine just makes me happy\n\nIt means I’ve had the 2 minutes to drink something \n\nAnd that does make me a better surgeon",
            "title_similarity": "0.57204103",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gzksdmq",
            "score": 1,
            "text": "It also sets fire to my hemorrhoids",
            "title_similarity": "0.38433933",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzkskum",
            "score": 11,
            "text": "Not surprised at all by this... caffeine molecules fit in the slot where adenosine would normally fit. Adenosine = tired/sleepy molecule. Once the receptor is filled with adenosine, you cannot remove it and caffeine is rendered useless.",
            "title_similarity": "0.67548645",
            "sentiment_compound": 0.1366
        },
        {
            "id": "gzktjhr",
            "score": 1,
            "text": "That’s why pilots take methamphetamine",
            "title_similarity": "0.39403975",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkuce0",
            "score": 1,
            "text": "Yeah if you compare the PNS stimulants like caffeine to CNS stimulants like amphetamine, phenylpiracetam, methylphenidate, etc, caffeine has comparatively small effects on cognition. It just doesn’t affect the brain in a way that helps to perform complex tasks.",
            "title_similarity": "0.80907154",
            "sentiment_compound": 0.8316
        },
        {
            "id": "gzkulif",
            "score": 1,
            "text": "I need eight hours sleep a day.... and ten at night.",
            "title_similarity": "0.36255127",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkuqu2",
            "score": 1,
            "text": "I do feel like it helps with *drowsiness*, which certainly could impair the ability to make split decisions (e.g. the feeling you might have for a period of time after waking up, but not necessarily due to a total lack of adequate sleep). Obviously these effects are intensified if you have a caffeine habit. \n\nThat said I agree that if you are experiencing actual sleep deprivation (e.g. just not sleeping or not sleeping effectively) caffeine is just keeping you as a reanimated corpse. And I think anyone that has ever tried to do that will agree.",
            "title_similarity": "0.85752714",
            "sentiment_compound": -0.4316
        },
        {
            "id": "gzkv3ab",
            "score": 1,
            "text": "Is the journal the study was published in worth a damn? I didn't know this journal and wouldn't know whether it was any more reliable than the national enquirer",
            "title_similarity": "0.46131092",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzkvhwf",
            "score": 1,
            "text": "That's why it's best for the worker and soldier drones.",
            "title_similarity": "0.43650532",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzkw2h8",
            "score": 1,
            "text": "I have worked second shift most of my adult life, and I go to bed at 10:30, up at 7:30, nap from 1:00-1:30, and work from 2:00-10:00. It’s actually been a nice life (to even have the opportunity to take a nap)…especially in a place like America.",
            "title_similarity": "0.50142264",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gzkw93x",
            "score": 1,
            "text": "Thanks, Capitalism! :p",
            "title_similarity": "0.28677976",
            "sentiment_compound": 0.636
        },
        {
            "id": "gzkwbx7",
            "score": 1,
            "text": "Huh, if only life was prioritized for sleep and not work, or maintenance.",
            "title_similarity": "0.6345443",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkwedo",
            "score": 1,
            "text": "This is how bugs are made… software engineering is fueled by caffeine.",
            "title_similarity": "0.57356787",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkwekz",
            "score": 1,
            "text": "Yeah well if people want to prioritize sleep over caffine, stop making me wake up at 7am for work. Move to a work from home structure where I work whenever my circadian rhythm tells me I should be getting up and when I should be going to bed. \n\nUntil that happens it's more of the brown zoom zoom juice for me.",
            "title_similarity": "0.614692",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzkxhhs",
            "score": 1,
            "text": "Is this study suggesting drinking a cup of coffee doesn’t make me a super human?",
            "title_similarity": "0.61172545",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gzkyf9g",
            "score": 1,
            "text": "A sleep professor once had this to say for me:\n\n“Caffeine improves results.”",
            "title_similarity": "0.64284796",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzkyhst",
            "score": 1,
            "text": "Woke up from a nap just now, opened Reddit, saw this, and gonna take it as a sign to go back to napping.",
            "title_similarity": "0.46774435",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzkz1n1",
            "score": 2,
            "text": "Doctor often forced to work 30+ hours with no sleep.  \n\nWhy the hell are we forced to do this again?\n\nItS fOR yOuR BenEFiT.\n\n...but what about the patients\n\nHanDOvERs ArE DanGErOUs!!\n\nSo improve handover and get sleep.\n\nUnPReCEdentEd TIMES!",
            "title_similarity": "0.5713693",
            "sentiment_compound": -0.6502
        },
        {
            "id": "gzkzc10",
            "score": 1,
            "text": "I guess we night shifters with kids are screwed then...",
            "title_similarity": "0.40339428",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzl03l0",
            "score": 1,
            "text": "in the end you must rest and refresh",
            "title_similarity": "0.46357447",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzl094l",
            "score": 2,
            "text": "I feel for all the new doctors who are in school or in their residency. Why are they allowed to work such long shifts? They have to work 12+ a day and get very little sleep. I wonder how many mistakes they may have caused just because of the lack of sleep.",
            "title_similarity": "0.52605456",
            "sentiment_compound": -0.5859
        },
        {
            "id": "gzl13wi",
            "score": 1,
            "text": "I work overnight shift, and I used to take an energy drink a couple hours before heading home. The reason I did this was so I can play with my dogs, walk them, feed them, and make sure they go potty outside. I didn’t want to come home and have them go to sleep again with me. I find out that I was misplacing their leashes, forgetting to put water in their bowls, and other small things like that. I just knew I have to go to sleep and sleep more hours before heading to work because I’m someone who don’t misplace things or forget about stuffs like this. Luckily for me I have a partner who decided to switch his first shift to second shift, now whenever I come home I can go to sleep, while he spend time with my dogs. When he go to work I wake up, and I spend more time with them and take a 4 hour nap before heading to work. Don’t deprive yourself from sleeping and alway put your mental health health first. Luckily for me it works out, if it doesn’t for you please get another job that doesn’t drive you to insanity.",
            "title_similarity": "0.6129682",
            "sentiment_compound": 0.903
        },
        {
            "id": "gzl1k6n",
            "score": 1,
            "text": "Cool, now give me a structure in which I can actually afford to sleep the healthy amount.",
            "title_similarity": "0.62646985",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzl1q21",
            "score": 2,
            "text": "You’d hate to see what army medical does every day then",
            "title_similarity": "0.43449324",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gzl22s4",
            "score": 1,
            "text": "So tired of these articles. \n\n“This may do that, but it also may make this worse/better.”\n\nRinse and repeat. No facts, just hypotheticals.",
            "title_similarity": "0.6034472",
            "sentiment_compound": -0.5989
        },
        {
            "id": "gzl2gsv",
            "score": 1,
            "text": "Well this explains why I keep losing patients despite pounding Redbull all day",
            "title_similarity": "0.36784542",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzl2wel",
            "score": 1,
            "text": "I worked with a woman who would go through five Red Bulls in a day.  Everyone was impressed with how much work she got done.  I was not, because I was the one who had to re-do about 20% of her work because she was so amped up, she did it wrong.\n\nIf you want to be awake, aware, full of energy and stamina, sleep  eight hours a night and do some basic exercise.",
            "title_similarity": "0.43630943",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzl3egt",
            "score": 1,
            "text": "Please tell me this isn’t news to anybody.\n\nI remember the first time I used caffeine to actually keep me awake- on a family caravan jaunt to a semi-nearby city, about 3 hours away.\n\nI was home from college for the summer and tasked with driving my sister and her friend behind my parents and brother.\n\nI had stayed up all night talking on the phone with a boy I liked, and just needed to push through the ride so I could get a nap at the hotel.\n\nRed Bull was just becoming a thing, and so I gave it a shot.\n\nI was... awake for the ride, and for some time thereafter. But I wouldn’t say I was *alert* in terms of divided attention tasks.\n\nAfter that my belief that the whole coffee thing was a farce was reinforced.\n\nI still do the caffeine thing sometimes, knowing that I’ll be awake but stupid. Basically just to push through physical presence.",
            "title_similarity": "0.49323744",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzl3j52",
            "score": 1,
            "text": "Oh wow, that’s what we were lacking, the knowledge that we need sleep over caffeine and not actual time and means of making enough time to get enough sleep. I was sure I could just caffinate my way to making time for everything. I’ll let my employer know I need more time.",
            "title_similarity": "0.7280886",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gzl4ctf",
            "score": 1,
            "text": "Right. Caffeine makes you *not tired* vs giving you *more energy*. You cant make up for lack of sleep/revitalization with coffee, you can just mask the effects.",
            "title_similarity": "0.8251591",
            "sentiment_compound": 0.1187
        },
        {
            "id": "gzl4e2k",
            "score": 1,
            "text": "This is probably the hardest part about being a new parent. Even though caffeine and adrenaline keep you going, it’s impossible to be your best self and best parent that you can be when your brain is running on fumes. Double sucks when you don’t really talk to family so you’ve got no help.",
            "title_similarity": "0.63984",
            "sentiment_compound": 0.7009
        },
        {
            "id": "gzl4hj7",
            "score": 1,
            "text": "What is sleep? I don't know her.",
            "title_similarity": "0.3357427",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzl4iyx",
            "score": 1,
            "text": "Sleep is detrimental for everyone to have 8 hours. Children and teens need to have 9 hours or more. I would reference to Dr. Walker’s book on Why We Sleep. More car accidents are caused due to the lack of sleep. You being deprived of sleep with 6 hours or less is just as bad as drunk driving if not worse. Plus lack of sleep can affect testosterone levels and increase the risk for cancers and cardiovascular issues. Also lack of sleep can provide a hormone imbalance and make people feel more hungry than usual. You need SLEEP.",
            "title_similarity": "0.7021705",
            "sentiment_compound": -0.8876
        },
        {
            "id": "gzl4o8t",
            "score": 1,
            "text": "It's always difficult to explain this to people but we've actually been hearing it for years. I heard this in my driver's ed course back in maybe 2004 and I think did a little personal research on the subject. Can't tell you how defensive people get about their caffeine and coffee, hehe.\n\nI do think quite a bit of it is tasty and great for simple things like basic gaming sessions but no substitute for hydration and sleep.",
            "title_similarity": "0.6592634",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gzl55zs",
            "score": 1,
            "text": "Are there people put there thinking coffee is a replacement for sleep...? I don't think many people have the luxury of going ohh I'm tired, I guess I'll just nap right in the middle of working!",
            "title_similarity": "0.6825397",
            "sentiment_compound": -0.4926
        },
        {
            "id": "gzl5boh",
            "score": 1,
            "text": "Fine! I’ll quit my job so I can sleep more!",
            "title_similarity": "0.4389344",
            "sentiment_compound": 0.3365
        },
        {
            "id": "gzl5wsf",
            "score": 3,
            "text": "This is why 36 hour residency shifts are a bane. Medical schools should do away with this arcane practice.",
            "title_similarity": "0.48609298",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzl5y2a",
            "score": 1,
            "text": "I’ve noticed it feels like my brain is awake but I still feel physically tired. \n\nCoffee works best for me when I also get a decent sleep and don’t use it to supplement.",
            "title_similarity": "0.8006175",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzl6io0",
            "score": 1,
            "text": "I get 8 hours of sleep and do a 24 Oz coffee every morning. One will work, both are great.",
            "title_similarity": "0.40520802",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gzl76v4",
            "score": 1,
            "text": "In related news: washing hands makes your hands cleaner.",
            "title_similarity": "0.37995255",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzl7kie",
            "score": 1,
            "text": "I heard one someone explain that caffeine works by binding to receptors instead of the chemicals that trigger tiredness. As he summed it up, \"Caffeine doesn't hit the gas, it cuts the breaks\".",
            "title_similarity": "0.76449025",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzl7mpq",
            "score": 1,
            "text": "I discovered this in college.  DMAA and Adderall both let me stay up and remain more focused at least for a time.  Can't get either anymore though.",
            "title_similarity": "0.50574523",
            "sentiment_compound": 0.4391
        },
        {
            "id": "gzl7s0b",
            "score": 1,
            "text": "Caffeine just helps you feel more awake while you make the same awful mistakes",
            "title_similarity": "0.7736022",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzl7skg",
            "score": 1,
            "text": "I worked a day construction shift from 6am-4pm and was \"asked\" to work a night shift 30 minutes later from 7pm-7am with a 2 hour drive there and back.  \n\nMy employer got mad at me because I forgot to properly unload the truck and put equipment back properly. I literally fell asleep when I put the truck in park in the shop driveway, and when I woke up locked the truck and drove my personal vehicle home.   \n\nShould have called OSHA.",
            "title_similarity": "0.41312265",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzl7tpe",
            "score": 1,
            "text": "Professional driver here. This isn't exactly new information. The FMCSA, which is the Federal Motor Carrier Safety Administration, has told us for years that caffeine is not a sleep substitute.\n\nI learned this in 2002 when I first started driving trucks and a lifetime of work in the industry has driven the point home time and again.\n\nI am shocked that it took this long for a proper study.",
            "title_similarity": "0.5522778",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzl7vin",
            "score": 1,
            "text": "I gave up regular caffeine about three months ago.  Between coffee and energy drinks, I just felt like I was consuming way too much.  Now, if I feel like I need a boost, I'll take a half of a caffeine pill and it works wonders. It's amazing how effective it is when you're not abusing it.",
            "title_similarity": "0.6242395",
            "sentiment_compound": 0.953
        },
        {
            "id": "gzl7vry",
            "score": 1,
            "text": "My Death Wish Coffee says otherwise!",
            "title_similarity": "0.41950333",
            "sentiment_compound": -0.3595
        },
        {
            "id": "gzl85uk",
            "score": 1,
            "text": "The sign in my vet’s office: “Caffeine allows me to make more mistakes and with greater enthusiasm.”",
            "title_similarity": "0.5950434",
            "sentiment_compound": -0.0754
        },
        {
            "id": "gzl8rvv",
            "score": 1,
            "text": "Well caffeine doesn't actually wake people up per say, it just blocks your adenosine receptors, so you are incapable of feeling tired. Its like taking pain killers and saying you can't be hurt anymore. In a sense its true, but you'll still be damaged. \n\nThe only way to \"burn off\" the adenosine build up is to sleep, so this makes a lot of sense.\n\nThere's a pretty cool book I've been listening to called \"why we sleep\" which covers this if anyone is interested",
            "title_similarity": "0.83250123",
            "sentiment_compound": 0.6317
        },
        {
            "id": "gzl8ycu",
            "score": 1,
            "text": "Best unregulated drug ever!",
            "title_similarity": "0.26985288",
            "sentiment_compound": 0.6696
        },
        {
            "id": "gzl9s38",
            "score": 1,
            "text": "*laughs painfully in army*",
            "title_similarity": "0.21654424",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzla1qb",
            "score": 1,
            "text": "If really love to see caffeine compared to Ampakines & modafinil\n\nCaffeine removes some of the symptoms of being tired, but not the consequences.\n\nModafinil seems better at removing the effects of tiredness & doesn’t force you to stay awake when sleep is an option.\n\nIt’s always annoying when you have 2 hours of work to do 2 hours before bed at which point caffeine will end up stealing even more of your sleep.",
            "title_similarity": "0.86473465",
            "sentiment_compound": -0.6064
        },
        {
            "id": "gzlayl4",
            "score": 1,
            "text": "Wonderful just as I’m going back to working graveyard on Monday.",
            "title_similarity": "0.16959557",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzlbe0r",
            "score": 1,
            "text": "Caffeine only wakes up part of the human brain.  Not all.",
            "title_similarity": "0.6344874",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzlbgde",
            "score": 1,
            "text": "How does this analysis compare to the effects of cocaine or Adderall?",
            "title_similarity": "0.4295521",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzlbk28",
            "score": 1,
            "text": "Only downside of sleep is it can dehyrade you. Take a good hearty swig of H2O before laying down.",
            "title_similarity": "0.6990366",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzlbkdt",
            "score": 1,
            "text": "The difference between caffeine and methamphetamine is that the former blocks sleepy things from being processed by your body, the latter actually tricks your body into thinking it has a bunch of energy.\n\nCaffeine can keep you alert for maybe four hours until the sleepiness overtakes the blocking ability of caffeine; meth can keep you alert until you run out of meth.",
            "title_similarity": "0.7642195",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzlcva3",
            "score": 1,
            "text": "Known science for 800 Alex.",
            "title_similarity": "0.0031198766",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzldjvz",
            "score": 2,
            "text": "Now if only my body could figure out how sleep works. It's a complete mystery. I lay down. I close my eyes. BOOM. I'm a fuckin' pretzel and wake up in more pain than the night before and just as tired. Complete mystery.",
            "title_similarity": "0.56649923",
            "sentiment_compound": -0.7574
        },
        {
            "id": "gzldvb5",
            "score": 1,
            "text": "Well coffee when I should be sleeping is definitely bad",
            "title_similarity": "0.5394113",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzlepej",
            "score": 1,
            "text": "It makes sense only if they’re comparing driving drowsy to driving with caffeine when you would otherwise be drowsy. But if you’re literally falling asleep on the road, then caffeine is helpful.",
            "title_similarity": "0.80459654",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzlexkk",
            "score": 1,
            "text": "Always a good reminder! But is this really news? I thought this has plenty of evidence behind it already. Why are people still researching the exact same question??",
            "title_similarity": "0.30634597",
            "sentiment_compound": 0.418
        },
        {
            "id": "gzlf19l",
            "score": 1,
            "text": "TL;DR caffeine helps keep you awake but doesn't make you a good driver",
            "title_similarity": "0.87677526",
            "sentiment_compound": 0.6858
        },
        {
            "id": "gzlf2yr",
            "score": 1,
            "text": "I feel like I knew this already just by drinking caffeine",
            "title_similarity": "0.3538642",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzlf5id",
            "score": 1,
            "text": "Sleep is just as important as your diet.",
            "title_similarity": "0.6704035",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gzlgkul",
            "score": 1,
            "text": "Caffeine simply cannot do what good sleep does. Get sleep!",
            "title_similarity": "0.68056273",
            "sentiment_compound": -0.4015
        },
        {
            "id": "gzlhj4h",
            "score": 1,
            "text": "Caffeine makes me tired. Overrated",
            "title_similarity": "0.5513428",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzli0h0",
            "score": 1,
            "text": "Sleep is the best medicine, nothing can replace that!",
            "title_similarity": "0.56369853",
            "sentiment_compound": 0.6696
        },
        {
            "id": "gzli6we",
            "score": 1,
            "text": "I did read a different study where they found errors were reduced in sleep-impaired people taking caffeine - these results should be taken holistically!",
            "title_similarity": "0.7550249",
            "sentiment_compound": -0.4003
        },
        {
            "id": "gzli7hb",
            "score": 1,
            "text": "I used to say coffee helped me with the quantity of my thoughts, not the quality.",
            "title_similarity": "0.6624646",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzlj3cm",
            "score": 1,
            "text": "I rarely if ever drink caffeine. I find that if I drink it one day, I feel fantastic I'm able to focus on what I need and I'm happy. Although the next day I feel like absolute garbage. Even if I haven't drank coffee or tea in 6 months if I drink it for a single day the next day I will feel terrible.",
            "title_similarity": "0.6378096",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gzljf8p",
            "score": 1,
            "text": "I have been unable to sleep lately, even with melatonin. Sucks.",
            "title_similarity": "0.43202585",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzljmsz",
            "score": 1,
            "text": "Thanks, this was the motivation I needed to get off Reddit and go to bed!  Good night.",
            "title_similarity": "0.50818276",
            "sentiment_compound": 0.8172
        },
        {
            "id": "gzlkipb",
            "score": 1,
            "text": "i’m too stubborn to sleep more than 5 hours a night. go to bed too late and drag myself out for the gym.",
            "title_similarity": "0.40231216",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzlkm5t",
            "score": 1,
            "text": "Good to see this an hour after i was supposed to go to sleep...",
            "title_similarity": "0.39532742",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzlkv8t",
            "score": 1,
            "text": "I just went through like 2/3 months of 1/2 to usually 4 max 5 hours of sleep. \n\nDon't be me. \n\nYou will die, at some point.",
            "title_similarity": "0.31492513",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzlllal",
            "score": 1,
            "text": "I dropped Coke/Pepsi back in Feb.  I was doing about 2 cans almost daily.  It's been rough.  I don't crave it anymore, and the headaches are gone.  I do feel food tasted way better with a coke/pepsi...  I've been drinking tea throughout the day, some with caffeine some without.",
            "title_similarity": "0.5784547",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzlmxlx",
            "score": 1,
            "text": "I’d say that it actually increases the chances of making those mistakes.",
            "title_similarity": "0.42866623",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzlnpqn",
            "score": 1,
            "text": "Ah this does kinda explain a lot in my life. Sleep deprivation is a very real problem, guys...",
            "title_similarity": "0.5451219",
            "sentiment_compound": -0.6983
        },
        {
            "id": "gzlokek",
            "score": 1,
            "text": "A study wasn’t needed here.",
            "title_similarity": "0.3817814",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzlon52",
            "score": 1,
            "text": "Don’t drink caffeine too much, I learned that one the hard way.",
            "title_similarity": "0.6465949",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzlooa5",
            "score": 1,
            "text": "I don't understand how people operate on little sleep.  I usually end up having to sleep like 12 hours on weekends if I get like 7 hours of sleep during the week.  I really need 8-9 usually...",
            "title_similarity": "0.51578534",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzlowf3",
            "score": 1,
            "text": "I used to have a problem getting too drowsy on my commute after work, I would start dozing off. I tried drinking an excess amount if caffeine before leaving work to help and it did nothing.",
            "title_similarity": "0.70690346",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzlpybm",
            "score": 1,
            "text": "I need to find a link where I can buy that red clock. It’s perfect.",
            "title_similarity": "0.37495723",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzlq4oo",
            "score": 1,
            "text": "Tell that to my insomnia ... less than 8 hours sleep in the last 3 days combined.  =(",
            "title_similarity": "0.34751755",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzlq9qq",
            "score": 1,
            "text": "If you actually read the pubmed publication of this study, you will see that the journal article in the link Reddit posted journal is making quite the generalization of this study about of Caffeine use. The actual publication is comparing 2 groups: one being a cohort of participants who went home and got a “full” night of sleep in their homes, and the other being a group of participants that were instructed to stay awake all night in the laboratory. The next morning both groups received 200mg of caffeine and were instructed to complete various tasks. Obviously the sleep deprivation group did poorly on them as they were running on 0 hrs of sleep. To make the generalization of this study’s results to a population level isn’t realistic, no one does better with no sleep. Of course the group that sleeps is going to be more cognizant of their surroundings. That is all for now.",
            "title_similarity": "0.5731598",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzlqclt",
            "score": 1,
            "text": "Have they tried using Adderall to eliminate the procedural errors?\n\nI would like a study where they try combining the two.",
            "title_similarity": "0.5949632",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzlr2av",
            "score": 1,
            "text": "Tell that to every US Residency program in existence",
            "title_similarity": "-0.070998184",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzlrbvo",
            "score": 1,
            "text": "On that note, it’s midnight and I have to wake up early.. I’m off to bed",
            "title_similarity": "0.34502652",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzlrlvt",
            "score": 1,
            "text": "You should sleep late, man, it's much better for your constitution. Medical advice from the beastie boys.",
            "title_similarity": "0.68698955",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzlrxb1",
            "score": 1,
            "text": "While I can appreciate the science, one of the procedural hallmarks of bad driving is being asleep, so actually improving the ability to stay awake is a pretty big procedural win.",
            "title_similarity": "0.79392743",
            "sentiment_compound": 0.8905
        },
        {
            "id": "gzlthb2",
            "score": 1,
            "text": "I kicked in a 20 year caffeine addiction a couple of years ago, and I've never felt better. I'm calmer, more alert and sleeping better than ever. I still drink decaf as I love the taste.",
            "title_similarity": "0.52247757",
            "sentiment_compound": 0.8653
        },
        {
            "id": "gzlugj4",
            "score": 1,
            "text": "Yeah I’ve noticed this. I won’t necessarily feel tired after 20 hours and four cups of coffee downed every five hours, but my hand-to-eye coordination is not trusted by myself whatsoever. I make numerous errors and laps in judgment as if I was tired.",
            "title_similarity": "0.66279805",
            "sentiment_compound": -0.8917
        },
        {
            "id": "gzlutid",
            "score": 1,
            "text": "Eli5: how to prioritize sleep when you have an infant who doesn't sleep through the night yet, and a toddler who comes to wake you up in the morning??",
            "title_similarity": "0.56245416",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzluvzn",
            "score": 1,
            "text": "I would give anything to just sleep normally and not need sleeping medication.",
            "title_similarity": "0.57594275",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzlv7gj",
            "score": 1,
            "text": "It may not prevent but it does mitigate errors and accidents",
            "title_similarity": "0.711229",
            "sentiment_compound": -0.7259
        },
        {
            "id": "gzlvico",
            "score": 1,
            "text": "Dismissed in the name of capitalism.",
            "title_similarity": "0.21853967",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzlw6ip",
            "score": 1,
            "text": "So, in simple words, caffeine makes you do, but not do good, correct?",
            "title_similarity": "0.72133434",
            "sentiment_compound": -0.4782
        },
        {
            "id": "gzlxca3",
            "score": 1,
            "text": "Ok. Im going to bed now.",
            "title_similarity": "0.2736861",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzlxh45",
            "score": 1,
            "text": "Everybody that ever consumed caffeine knew this already",
            "title_similarity": "0.13898814",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzlxlvb",
            "score": 1,
            "text": "Mods need the ability to prune comments that do not follow the rule clearly stated at the top of these comments and paste them under that top.\n\nThis comment should also be understood to posit that Reddit's comments sections might be a good place to study people's reading comprehension as it relates to their lack of sleep and r/science might be a great place to start.",
            "title_similarity": "0.7246084",
            "sentiment_compound": 0.9062
        },
        {
            "id": "gzlypni",
            "score": 1,
            "text": "Fine I’m going to sleep already. Geez",
            "title_similarity": "0.36001903",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gzlyy0m",
            "score": 1,
            "text": "Employers: \"that's nice\"",
            "title_similarity": "0.2512485",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzlzoqq",
            "score": 1,
            "text": "I don't really drink coffee except when needed.   I remember during one of the finals in my 3rd year in college, I knew that I am in trouble as I have 10 chapters to study in 1 day.   I studied all day and all night.   The exam was at 8:00am.     I went to McDonald and got coffee before the exam.   I was on a caffiene high.    Super alert and finished my exam early.\n\nThen, I walked back to my apartment and the crash was happening as I walk.   I was able to open the door, then I crashed to my bed.   I left my keys in the keyhole of my apartment door and my roommate can't wake me up.   \n\nI got an A on the exam.   So, I do think caffiene works but just like any stimulus, it only works if you don't do it all the time.  :)",
            "title_similarity": "0.44410077",
            "sentiment_compound": 0.8225
        },
        {
            "id": "gzm0fp8",
            "score": 1,
            "text": "The nazi meth experiments back in the days had the same results",
            "title_similarity": "0.41833216",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzm0kda",
            "score": 1,
            "text": "TLDR: drink more watee",
            "title_similarity": "0.2564846",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzm0pjp",
            "score": 1,
            "text": "Look at my code... You don't have to do research anymore.",
            "title_similarity": "0.39524418",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzm0sh6",
            "score": 1,
            "text": "Idk my 3.85 gpa disagrees",
            "title_similarity": "0.34038672",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzm1gou",
            "score": 1,
            "text": "Isn't there a similar problem with methamphetamines? Don't they more or less just trick the brain into thinking you're not exhausted so the brain doesn't regulate the body properly, causing one to go beyond the natural limits? I know that meth can keep one awake and focused for a long time but eventually one will still just collapse from exhaustion.",
            "title_similarity": "0.7923293",
            "sentiment_compound": -0.7661
        },
        {
            "id": "gzm1xtp",
            "score": 1,
            "text": "100%\n\ni make lots of typos when sleep deprived + caffeinated",
            "title_similarity": "0.430627",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzm31cg",
            "score": 1,
            "text": "I wonder if the same goes for other stimulants. Since Ive been on Ritalin I certainly need less sleep and Im able to concentrate on tasks, but Im not sure about the effect on making mistakes",
            "title_similarity": "0.848245",
            "sentiment_compound": -0.6115
        },
        {
            "id": "gzm43ti",
            "score": 2,
            "text": "As I read this on hour 20 of my 24 hour radiology shift. Yaaaay residency.",
            "title_similarity": "0.20405845",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzm58ap",
            "score": 2,
            "text": "I would recommend Why We Sleep by Matthew Walker to literally everyone. \n\nOnce you do you'll realise how odd and staggeringly stupid it is that we live in a society that not only doesn't prioritise sleep but actually seeks to motivate people to get as LITTLE sleep as they can physically stand.",
            "title_similarity": "0.6688652",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzm5agk",
            "score": 1,
            "text": "I did a PhD in training surgeons for error prevention with vr. Nothing but cognitive training can improve performance. Cognitive training>sleep>caffeine. However, there is a sleep threshold that will shut your mind down too much, which is kind of obvious.",
            "title_similarity": "0.7654613",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzm5fze",
            "score": 1,
            "text": "As I read this at 4:30 am",
            "title_similarity": "0.118752256",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzm6ags",
            "score": 1,
            "text": "As I read this at 2:43 am...",
            "title_similarity": "0.10339755",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzm6mal",
            "score": 1,
            "text": "I wonder what studies are out there on people for whom caffeine doesn't affect their alertness/attentiveness at all.",
            "title_similarity": "0.67868054",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzm7eu6",
            "score": 1,
            "text": "I'm a bus driver in England the company I work for is regularly in the paper for drivers falling asleep at the wheel and killing themselves/others in the process. the md of the company went on the news and said in no circumstances will a driver work more than 4 days in row (blatant lie) that they will never go from late shifts to early shifts (blatant lie). And that the latest one is an isolated incident. They changed my shifts about without telling me and because I picked up a day's overtime it meant I had to work 9 12 hr shifts in a row instead of 7, was falling asleep at work sent an email to 2 different managers and they both ignored me and was told if I went home it would count as an absence and I would get a disciplinary.",
            "title_similarity": "0.47025892",
            "sentiment_compound": -0.9081
        },
        {
            "id": "gzm7opk",
            "score": 1,
            "text": "Am I the only one who feels like caffeine has no effect on your sleepiness anymore because you drink so often and your body is kinda used to it?",
            "title_similarity": "0.7585366",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzm8xrf",
            "score": 1,
            "text": "Me at 2 am really looking forward to my morning cup of coffee :)",
            "title_similarity": "0.37742633",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzm97cm",
            "score": 1,
            "text": "Gonna file that one under \"things I could have told you for free on the bus ride from the terminal to the plane if you'd asked\"",
            "title_similarity": "0.4342069",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzma71w",
            "score": 1,
            "text": "I got in late to this topic, but the study seems to be an exercise in extremes, which is well represented by some of the extremes involving doctors being required to work a 24 hour shift, etc.\n\nThat said, the comparison between staying up all night in a strange place and sleeping at home is fairly extreme. Plus, there is an extrapolation of the measured cognitive deficits as they relate to real world skills required to practice medicine or drive a car.\n\nAt the end of the day, who the f-ck stays up all night before driving or performing other important tasks? And, all things equal, wouldn't it be better if those folks had a strong cup of coffee or two?",
            "title_similarity": "0.61548954",
            "sentiment_compound": 0.6543
        },
        {
            "id": "gzma8no",
            "score": 1,
            "text": "[The circadian clock is an emerging factor in cancer research](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7120250/#S1title)\nDisruption in circadian rhythms thus predisposes the onset of numerous chronic diseases, (such as cancer and metabolic disorders). A large body of work strongly supports the existence of a crosstalk between cancer and the circadian clock.",
            "title_similarity": "0.45576206",
            "sentiment_compound": -0.9201
        },
        {
            "id": "gzmacc4",
            "score": 1,
            "text": "Not surprising but welcome that this has been established in research.",
            "title_similarity": "0.3564949",
            "sentiment_compound": -0.5613
        },
        {
            "id": "gzmav1w",
            "score": 1,
            "text": "Caffeine is an unregulated drug.",
            "title_similarity": "0.35267222",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzmb8tt",
            "score": 1,
            "text": "Time to make caffeine a Schedule II controlled drug in the US?: https://www.dea.gov/drug-information/drug-scheduling\n\n####Schedule II\n\n> Schedule II drugs, substances, or chemicals are defined as drugs with a high potential for abuse, with use potentially leading to severe psychological or physical dependence. These drugs are also considered dangerous. Some examples of Schedule II drugs are:\n\n> Combination products with less than 15 milligrams of hydrocodone per dosage unit (Vicodin), cocaine, methamphetamine, methadone, hydromorphone (Dilaudid), meperidine (Demerol), oxycodone (OxyContin), fentanyl, Dexedrine, Adderall, and Ritalin",
            "title_similarity": "0.58922434",
            "sentiment_compound": -0.872
        },
        {
            "id": "gzmc1fy",
            "score": 1,
            "text": "Yeah, modafinil is much better in that respect. There is no substitution for a healthy diet and a good night’s sleep though.",
            "title_similarity": "0.7878532",
            "sentiment_compound": 0.891
        },
        {
            "id": "gzmctcn",
            "score": 1,
            "text": "World records of staying awake are now no longer recognised by Guinness as a result of massive ill health effects.",
            "title_similarity": "0.5706916",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gzmeu3y",
            "score": 1,
            "text": "....This wasn't known before? I always thought thats been established.",
            "title_similarity": "0.17446072",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzmg18t",
            "score": 1,
            "text": "So, basically, if you're sleep deprived, coffee is liquid Dunning-Kruger?",
            "title_similarity": "0.587417",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzmg3z8",
            "score": 1,
            "text": "Thanks. I’m about to have a new baby so...",
            "title_similarity": "0.24647465",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzmhsav",
            "score": 1,
            "text": "Or when you’re cleaning your expensive figures and statues and accidentally scratching one because even though you were awake and alert you were more susceptible to making mistakes.",
            "title_similarity": "0.64862764",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzmig28",
            "score": 1,
            "text": "Well the same can be said for cocaine?",
            "title_similarity": "0.29882777",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzmnphk",
            "score": 1,
            "text": "I know from experience that when you're really tired, you don't even want coffee, you want sleeeeeeeep! (And I am coffeeaholic fwiw)",
            "title_similarity": "0.57014155",
            "sentiment_compound": -0.5279
        },
        {
            "id": "gzmrtd3",
            "score": 1,
            "text": "I don’t think I ever heard the coffee was going to make you better at procedures. It just wakes you up.",
            "title_similarity": "0.672739",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzmsjlt",
            "score": 1,
            "text": "That’s why we drink matcha instead of coffee!",
            "title_similarity": "0.4747914",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzmxww0",
            "score": 1,
            "text": "Yeh adderall motherfooker",
            "title_similarity": "0.17574337",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzmyyu3",
            "score": 1,
            "text": "So we know the importance of sleep.  Now the question is how much?  We all agree it's a priority but how much?  I am not talking the 7-9 hours but what do we really need for optimal benefit?\n\n&#x200B;\n\nStudies need to be done on what sleep actually does for the body and how much is appropriate.  Does it vary by person?  Do we need one block of sleep or do we need a long period of sleep followed by x number of shorter periods of rest during the day.",
            "title_similarity": "0.72294897",
            "sentiment_compound": 0.8274
        },
        {
            "id": "gzn2wuq",
            "score": 1,
            "text": "Although caffeine is great short term the long term it’s overrated",
            "title_similarity": "0.60158324",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gznfpxq",
            "score": 1,
            "text": "Why is this even a study? It’s obvious that sleep can’t be replaced by caffeine.",
            "title_similarity": "0.5972389",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzocdne",
            "score": 1,
            "text": "Is this news ? I mean coffee is great for a pick me up , but I wouldn’t expect it for actually prevent me making errors if I was over tired. It’s crazy how people actually spend there time studying this stuff , it’s pretty obvious.",
            "title_similarity": "0.7230469",
            "sentiment_compound": -0.4678
        },
        {
            "id": "gzojhrl",
            "score": 1,
            "text": "Not to mention its laxative effect!",
            "title_similarity": "0.50449204",
            "sentiment_compound": 0.0
        },
        {
            "id": "h07swpq",
            "score": 1,
            "text": "Okay, but let's also look at all the, ahem, *other* popular chemicals for \"stay awake/get things done\"... how many co-workers are showing signs of Adderall or cocaine dependency?\n\nI undoubtedly drink more coffee than I really should- but at least I can simply cut back on it, if insomnia, irritability, etc. start making themselves known... I hate watching people lose themselves in upper/downer-cycle addiction, but \"gotta stay sharp/GO GO GO\" culture is all-prevailing.",
            "title_similarity": "0.70686996",
            "sentiment_compound": -0.8807
        }
    ]
}