{
    "'Brain fog' can linger with long-haul COVID-19. At the six-month mark, COVID long-haulers reported worse neurocognitive symptoms than at the outset of their illness. This including trouble forming words, difficulty focusing and absent-mindedness.\n": [
        {
            "id": "gzm9vze",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.41339886",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gzmwmrm",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzmwvhl",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzmvk2y",
            "score": 7,
            "text": "My mom is having this effect from the covid vaccine. It’s not as bad but it’s still there. It’s been 2 months since the vaccine.",
            "title_similarity": "0.5712973",
            "sentiment_compound": 0.2323
        },
        {
            "id": "gzmvawp",
            "score": -21,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmwrdx",
            "score": 31,
            "text": "Brain fog and trouble focusing is also a symptom of depression. How do they know these aren’t symptoms of depression, which seem to have increased in prevalance due to the lock down and social distancing? The link in the article just links to a CDC informational site, but I’m interested to see if this is addressed in the study.\n\nedit: link to the actual study: https://www.researchgate.net/profile/Harasit-Paul/post/Post_viral_fatigue_syndrome_in_covid19/attachment/5f17618bceab7c0001381cfc/AS%3A915853168099328%401595367819071/download/10.1080%4021641846.2020.1778227.pdf",
            "title_similarity": "0.6683973",
            "sentiment_compound": -0.1154
        },
        {
            "id": "gzn47b8",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmws98",
            "score": -7,
            "text": "I was not going to get the vaccine, but after all the pressure from work and my wife i finally went and got it. I didnt feel well, or right for a 3 weeks.  I have tried to ride my dirtbike on 2 occasions and i can not for the life of me do everything i need to do correctly on the bike when im trying to race. I feel off.  Shifting, accelerating, cornering. Anything that requires me to multitask on the bike just seems like i have never ridden before. I have been on a dirtbike for over  30 years. EVERYONE i tell about this just says im anti covid vaccine.  So i dont know whats worse, getting covid and experiencing these issues, or injecting this issues into myself.",
            "title_similarity": "0.5695306",
            "sentiment_compound": -0.1002
        },
        {
            "id": "gzn1z6n",
            "score": 7,
            "text": "Is it possible that correlation does not mean causation here? With depression and anxiety at an all time high, I'm not surprised people have a little PTSD and brain fog.\n\nIve had anxiety and depression my whole life. Nothing got worse after covid. I've always had trouble speaking and recalling information when anxious or tired. I feel as if people are just not used to living with it and blaming it on Covid",
            "title_similarity": "0.73116136",
            "sentiment_compound": -0.9566
        },
        {
            "id": "gzmodgm",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmknxj",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmve40",
            "score": 1,
            "text": "Just about 6 months here, and the fatigue, fog, doe, and anosmia/phantosmia (smelling smoke) is persisting. I had mono pretty bad as a teen. Makes you wonder..",
            "title_similarity": "0.8360852",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzn18ng",
            "score": -2,
            "text": "Brain fog is psychosomatic",
            "title_similarity": "0.49673963",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn6a2i",
            "score": 21,
            "text": "I have serious doubts that the virus is causing all this. The entire planet went on lockdown for prolonged periods. Depression is at an all time high, and there's a lot of denial going on.\n\nIs there any physical proof that this is happening, or is it all self-reported?",
            "title_similarity": "0.6703476",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gzmw7t0",
            "score": 21,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gznotlx",
            "score": 1,
            "text": "Hard to trust anything labelled as \"science\" these days.",
            "title_similarity": "0.4061756",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzmxw8b",
            "score": 8,
            "text": "I bet everyone is experiencing this from being locked up and staring at screens all day.",
            "title_similarity": "0.3578522",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzmtq5d",
            "score": -17,
            "text": "Fear fear fear. Get your vaccine. Don’t take vitamins, just get vaccinated.",
            "title_similarity": "0.3641714",
            "sentiment_compound": -0.8625
        },
        {
            "id": "gzmlzzv",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzn0w3n",
            "score": 0,
            "text": "Hard to tell when that's been a life-long part of your day.",
            "title_similarity": "0.4443292",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzn9p3h",
            "score": 0,
            "text": "Did they possibly try to link this to depression as well. Brain fog is a big part of depression and I would imagine a lot of people were depressed being stuck inside not knowing what the future held financially and health wise.",
            "title_similarity": "0.7517129",
            "sentiment_compound": -0.8176
        },
        {
            "id": "gzmx9n5",
            "score": 2,
            "text": "Great, I've had long-covid since I was 13.",
            "title_similarity": "0.32587507",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gzmxb4z",
            "score": 2,
            "text": "Has anybody experienced this after vaccination?",
            "title_similarity": "0.35749495",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn43z4",
            "score": 6,
            "text": "All sound like lockdown symptoms tbh. Wouldn’t place much value on this study.",
            "title_similarity": "0.5145922",
            "sentiment_compound": 0.5994
        },
        {
            "id": "gznxomt",
            "score": -1,
            "text": "Feels like people in this thread WANT Covid to cause these symptoms",
            "title_similarity": "0.4155048",
            "sentiment_compound": 0.5473
        },
        {
            "id": "gzmtw1k",
            "score": -25,
            "text": "What about neurological side effect from the vaccine?",
            "title_similarity": "0.39891198",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzmvv4r",
            "score": -14,
            "text": "As someone with ADHD who has heard \"we're all a little ADHD\" my whole life... well now haven't the turntables, uh, haven't they? Yeah now you're like me.",
            "title_similarity": "0.5679498",
            "sentiment_compound": 0.4043
        },
        {
            "id": "gzn3wz8",
            "score": 1,
            "text": "Why are soooo many comments deleted? Smacks of political bias",
            "title_similarity": "0.5126603",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzn7u84",
            "score": 3,
            "text": "Take your sub off the /all algorithm",
            "title_similarity": "0.20905375",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznezj0",
            "score": 2,
            "text": "I was diagnosed with Covid Long Haulers (or Long Covid) several months ago. \n\nthe brain fog is real, but the physical changes are really strange. covid19 is a crazy infection, and it’s even crazier there are people who don’t believe it exists.",
            "title_similarity": "0.7964105",
            "sentiment_compound": -0.7086
        },
        {
            "id": "gzmhjm5",
            "score": 38,
            "text": "What do they mean exactly by *long-haul covid-19* please?",
            "title_similarity": "0.36957347",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzmjzax",
            "score": -48,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzn7cqt",
            "score": 1,
            "text": "People with compromised immune systems deal with lingering issues for months after battling a viral disease, you just don't hear about it because it isn't a trend when it's not COVID related.\n\nWhy is this being treated as something new or COVID specific only?",
            "title_similarity": "0.67544293",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gznfjb0",
            "score": -3,
            "text": "Joe Biden must be a long hauler.",
            "title_similarity": "0.33954802",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznqbpn",
            "score": -2,
            "text": "This 'brain fog' might be caused by other things: senility, obesity, diabetes, diacetes, left-wing views, right-wing views, Trump madness, tear gas, legalised weed, prescribed opiates, pillbillies, etc.",
            "title_similarity": "0.5522975",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzmtyzu",
            "score": 24,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmtlwh",
            "score": 3,
            "text": "I just want to know what long haul means",
            "title_similarity": "0.21241093",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzmzg1x",
            "score": 1,
            "text": "I'm sure insane levels of stress that we have all been dealing with has affected that as well.",
            "title_similarity": "0.5598192",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzni01m",
            "score": 1,
            "text": "I have several friends who are experiencing this as a result of the vaccine. Any reports on that?",
            "title_similarity": "0.38656908",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzmlf5b",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmunqk",
            "score": 0,
            "text": "This is honestly the only long-covid symptom I have.  I struggle to remember names.  I saw a guy the other day and could not for the life of me remember his name.  I grew up with this guy for about 10 yrs and went to school with him during that time.  I see him 2-3 times a week now and talk to him in passing once or twice a week.  I could not for the life of me remember his name.",
            "title_similarity": "0.6243853",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzmwjd0",
            "score": 0,
            "text": "Eating gluten does this to me which is NOT fun",
            "title_similarity": "0.45379508",
            "sentiment_compound": -0.4023
        },
        {
            "id": "gznfh33",
            "score": 0,
            "text": "Jokes on you I already have all these symptoms!",
            "title_similarity": "0.30021077",
            "sentiment_compound": 0.3164
        },
        {
            "id": "gznvhf1",
            "score": 0,
            "text": "\"But the vaccine might have side effects!!!\"\n\nThere's unknowns on both sides, and it's a bit of a gamble either way, but getting the vaccine at least you know you're protecting those around you.",
            "title_similarity": "0.47315246",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznzzsa",
            "score": 0,
            "text": "I would ask that the mods delete this. UPI is not a reliable news source, the journal publishing the study (Fatigue) ranks extremely low on most journal impact and reputation measures when it ranks at all, and the organization publishing that journal is interested in building a case for the existence of a set of conditions that are not widely considered to exist in themselves in the broader medical world. This is clearly pseudoscience and doesn’t belong here.",
            "title_similarity": "0.6430639",
            "sentiment_compound": -0.0498
        },
        {
            "id": "gzojq82",
            "score": 0,
            "text": "Isn't that a self-diagnosed database, and didn't most of them have no antibodies when tested?  It's hypochondriasis",
            "title_similarity": "0.5991122",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzn9ypz",
            "score": -4,
            "text": "Are they mistaking symptoms with just basic life?",
            "title_similarity": "0.32578325",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzmlvo4",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gznv0vz",
            "score": -3,
            "text": "i think those are just the symptoms of isolation.\n\nedit: yes 1 year of quarantine and no interactions can provide those symptoms. (similar to depression)",
            "title_similarity": "0.6193011",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gzmth64",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmucgq",
            "score": -13,
            "text": "[deleted]",
            "title_similarity": "0.22116542"
        },
        {
            "id": "gzmui3n",
            "score": 30,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzn356q",
            "score": -4,
            "text": "I’m curious how they measure brain fog? And how does that compare to others just exposed to a covid world? \n\nI don’t believe I ever got covid and yet I say working at home has greatly increased all three symptoms stated in the title in my own life.",
            "title_similarity": "0.53607035",
            "sentiment_compound": 0.5794
        },
        {
            "id": "gzn9gi7",
            "score": -4,
            "text": "I feel like all this evidence points to a large pneumonia problem that we're ignoring.  But that goes against the mask mandate since they restrict your lung capacity and retain lung moisture so we've just conveniently ignored the situation.",
            "title_similarity": "0.5225487",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gzmwpvq",
            "score": -1,
            "text": "What helped me through the period was video games. Engaging video games that had a lot of hand eye coordination like Call of Duty, The Division, Resident Evil....also really helped with stress",
            "title_similarity": "0.44858474",
            "sentiment_compound": 0.617
        },
        {
            "id": "gzmyvok",
            "score": 1,
            "text": "Is it possible for the vaccine to have these effects? I've been noticing similar symptoms but to my knowledge I've never had COVID. I assumed I was just getting stupider",
            "title_similarity": "0.5822742",
            "sentiment_compound": -0.6956
        },
        {
            "id": "gzn1lnp",
            "score": -1,
            "text": "Which is why Republican Covid long haulers report no noticable symptoms",
            "title_similarity": "0.4503402",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzn3oi3",
            "score": -1,
            "text": "Sounds like menopause.",
            "title_similarity": "0.4057749",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzn8gma",
            "score": -1,
            "text": "Is there any correlation between covid patients and pot smokers?",
            "title_similarity": "0.4298555",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznti7e",
            "score": 1,
            "text": "A good friend of mine is battling this “long haul” thing with COVID. He had COVID-19 months ago and had fairly mild symptoms. Weeks after seeming to recover from then initial symptoms, he began to feel extremely tired, had persistent brain fog, severe depression, etc. Prior to having COVID he was a very active, social type person who was always busy with new projects or doing charity work. Now he struggles to even get out of bed. \n\nHe got accepted to be a patient at the Mayo Clinic, but his insurance refuses to pay for it. So his family is now forced to try to raise money through GoFundme type stuff to be able to afford to get him help. Something seems very wrong about that.  We should be taking care of our neighbors who are going through incredible struggles due to COVID symptoms that aren’t even understood by medical science yet.",
            "title_similarity": "0.7202778",
            "sentiment_compound": -0.7252
        },
        {
            "id": "gzntra2",
            "score": 1,
            "text": "Long hauler here. Although I’m thankful I’m not having brain fog my long haul symptom does suck as it feels like I have permanent hay fever with the sneezing, nasal congestion, and eye irritation.",
            "title_similarity": "0.5617441",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznv4ot",
            "score": 1,
            "text": "Biden and Fauci got this under control thank god",
            "title_similarity": "0.10094373",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzo45v1",
            "score": 1,
            "text": "Before or after they received a vaccine?",
            "title_similarity": "0.32224733",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznk77w",
            "score": -6,
            "text": "Man I would love to stop hearing about this weak ass virus, it's been almost a year and a half......I couldn't care less about how it affects people I have absolutely zero connection to.",
            "title_similarity": "0.6084037",
            "sentiment_compound": -0.7582
        },
        {
            "id": "gzmttk2",
            "score": -9,
            "text": "I think Chinese has been on this com[REDDACTED]",
            "title_similarity": "0.31866145",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn5m4l",
            "score": 15,
            "text": "Do they account for the social effects of the pandemic, like restricted social behaviour, sedentary lifestyle and the like?\n\nFrom my understanding, brian fog is linked to monotony in daily life and lack of stimulation.",
            "title_similarity": "0.6501081",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzmn5q3",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gznbv94",
            "score": -5,
            "text": "Hmm, no wonder Biden is having such trouble reading a teleprompter…",
            "title_similarity": "0.54654",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzmprnf",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmw66b",
            "score": 1,
            "text": "Welcome to a typical day in the life of a neurodivergent",
            "title_similarity": "0.27899557",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzn6p77",
            "score": -1,
            "text": "Did they control for the effects of social isolation during the pandemic? Which could contribute to verbal fluency.",
            "title_similarity": "0.5033199",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzn86b6",
            "score": -3,
            "text": "Has there been any thoughts or research into distinguishing if it's actually viral-related or possibly related to mental-issues caused by burnout or depression from lockdown/covid restriction-related angst?",
            "title_similarity": "0.53372514",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gznctrl",
            "score": -2,
            "text": "Looking like the vaccine does the same thing",
            "title_similarity": "0.1360703",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzmufes",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmtl05",
            "score": 36,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmglpg",
            "score": 21,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmv234",
            "score": 16,
            "text": "Does anyone have a link to a free copy of the study? I'm concerned that the facts are behind a paywall.",
            "title_similarity": "0.41789025",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzmtnum",
            "score": 31,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzn4p0c",
            "score": 4,
            "text": "I’ve been dealing with brain fog half my life. Anyone else here with fibromyalgia?",
            "title_similarity": "0.65927935",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzna6nj",
            "score": -3,
            "text": "Explains the GOP current state.",
            "title_similarity": "0.1561526",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn63j1",
            "score": -8,
            "text": "sure but the vaccine is fake or made with baby placenta so why not take your chances with the real thing?",
            "title_similarity": "0.40608636",
            "sentiment_compound": -0.6584
        },
        {
            "id": "gzn1mu7",
            "score": 7,
            "text": "for those that need to find some help you can start at r/covidlonghaulers\n\nknow you are not suffering alone, there are at least 12 million in the USA\n\nthere are no cures yet but some things that will help you get by",
            "title_similarity": "0.5312049",
            "sentiment_compound": 0.7138
        },
        {
            "id": "gzmty97",
            "score": 53,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmmmrc",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzmuui7",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzn2wy3",
            "score": 0,
            "text": "Well don’t get rona then.",
            "title_similarity": "0.18737501",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzn63ey",
            "score": 0,
            "text": "So we’re going to have a world with half a brain dead people?",
            "title_similarity": "0.503794",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzn6ddg",
            "score": 0,
            "text": "Well Dang I must have had covid for the past few years then",
            "title_similarity": "0.457718",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzn8v9d",
            "score": 0,
            "text": "These numbers are based on statistics that are also based on people's opinion of themselves",
            "title_similarity": "0.29448044",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn8zx2",
            "score": 0,
            "text": "When I got my Phizer shot (2nd dose) I was stuttering all night and I do not have a stutter. I could barely form words but I could think perfectly fine. It was incredibly strange.",
            "title_similarity": "0.6687564",
            "sentiment_compound": 0.7253
        },
        {
            "id": "gznaerb",
            "score": -4,
            "text": "Sounds like the average, everyday trumper jackass.",
            "title_similarity": "0.20772731",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gznaln4",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.22116542"
        },
        {
            "id": "gznggpa",
            "score": 0,
            "text": "can you get long covid after being vaccinated? Does anyone know?",
            "title_similarity": "0.40396398",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznin88",
            "score": 0,
            "text": "Those adderall scripts will be going up...",
            "title_similarity": "0.2006518",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznlz38",
            "score": 0,
            "text": "Brain fog is a prerequisite for long covid.",
            "title_similarity": "0.42817706",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznpo9n",
            "score": 0,
            "text": "Gee I must've caught Covid in 2017...",
            "title_similarity": "0.28594545",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznt2sa",
            "score": 0,
            "text": "I must have had covid for the last 10 years",
            "title_similarity": "0.48969182",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznu2sh",
            "score": 0,
            "text": "I feel for these people. I really do. \n\n\nI just hope they don't drive.",
            "title_similarity": "0.3005664",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gznukad",
            "score": 0,
            "text": "I wonder if whimever coined this term was a fan of Joe vs the volcano? They told him he had a brain cloud.",
            "title_similarity": "0.46941352",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gznxvpu",
            "score": 0,
            "text": "Like Americans need any help getting dumber",
            "title_similarity": "0.39293933",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzo5gk0",
            "score": 0,
            "text": "Brain fog not at all subjective.",
            "title_similarity": "0.058205277",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo7am2",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzo91zd",
            "score": 0,
            "text": "So covid gives you ADHD? Nice",
            "title_similarity": "0.42204726",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzoal48",
            "score": 0,
            "text": "Sounds like me after a long smoke session",
            "title_similarity": "0.3579266",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzobsoj",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.22116542"
        },
        {
            "id": "gzogr88",
            "score": 0,
            "text": "This explains why I’ve been so confused lately!!",
            "title_similarity": "0.49272555",
            "sentiment_compound": -0.5537
        },
        {
            "id": "gzojauw",
            "score": 0,
            "text": "Brain fog? This is no different from my usual",
            "title_similarity": "0.33677053",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzojna9",
            "score": 0,
            "text": "Maybe i do have covid",
            "title_similarity": "0.30352318",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzojwiw",
            "score": 0,
            "text": "Not sure if I got covid, or too tired of even care at this point. Could it be my excessive internet use, coupled with covid stress?",
            "title_similarity": "0.5528493",
            "sentiment_compound": -0.5365
        },
        {
            "id": "gzok3xc",
            "score": 0,
            "text": "Does anyone think that this might also have a correlation with family members who have become part of the QAnon Cult? If they got COVID, didn’t know, and are now suffering brain fog, would that make their brains more pliable to believing the outlandish theories?",
            "title_similarity": "0.5320846",
            "sentiment_compound": -0.5362
        },
        {
            "id": "gzol1rw",
            "score": 0,
            "text": "Out of curiosity, how do they know these symptoms actually arose post-covid and aren’t a result of the patient paying more attention to negatives? Not denying this at all, just curious on the science behind this study",
            "title_similarity": "0.47281224",
            "sentiment_compound": 0.5165
        },
        {
            "id": "gzomu7x",
            "score": 0,
            "text": "To those who experience \"Brain Fog\": \nHave you ever looked into Depersonalization/Derealization?\nSome of those description sound similar(I also suffer from those conditions). Or does it just sound the same but is different in reality?",
            "title_similarity": "0.6297412",
            "sentiment_compound": -0.3839
        },
        {
            "id": "gzon7ig",
            "score": 0,
            "text": "That’s crazy. I never had COVID (thank god) but I pretty much had the exact same symptoms from just sitting inside on my phone because of quarantine. Hope there’s a solution to this.",
            "title_similarity": "0.48958775",
            "sentiment_compound": 0.8859
        },
        {
            "id": "gzooxdo",
            "score": 0,
            "text": "This title is NSFS (not safe for stoners).",
            "title_similarity": "0.34535113",
            "sentiment_compound": -0.3412
        },
        {
            "id": "gzoq5ab",
            "score": 0,
            "text": "TIL I’ve had COVID brain fog for years",
            "title_similarity": "0.5594334",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoqyb7",
            "score": 0,
            "text": "Damn I’ve had covid since 2010",
            "title_similarity": "0.32374558",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzot910",
            "score": 0,
            "text": "So it is the Trixie virus from 'The Crazies' huh? I knew it",
            "title_similarity": "0.32499397",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzotdmk",
            "score": 0,
            "text": "Sounds similar to chronic Lyme disease with similar amounts of weak data.",
            "title_similarity": "0.53446007",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzotnzg",
            "score": 0,
            "text": "What if they were just dumb before corona?",
            "title_similarity": "0.43538162",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzotoao",
            "score": 0,
            "text": "How do I differentiate my general laziness, apathy and sloth-like nature from long haul covid?",
            "title_similarity": "0.5535277",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzotsyc",
            "score": 0,
            "text": "Awesome, I can start blaming Covid for this.",
            "title_similarity": "0.3388493",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzov5og",
            "score": 0,
            "text": "So Joe Biden had Covid? That sucks...",
            "title_similarity": "0.47488812",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzov7bx",
            "score": 0,
            "text": "Ah great, you're all getting down to my level <3",
            "title_similarity": "0.23428118",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gzovv7d",
            "score": 0,
            "text": "My long time friend said smoking marijuana got rid of his brain fog. He was on the path to try anything to fix it and toking up was his 1st “self medication” and he claims it worked wonders. Not saying everyone go get high... but... everyone go get high!",
            "title_similarity": "0.4487712",
            "sentiment_compound": 0.3382
        },
        {
            "id": "gzovv8v",
            "score": 0,
            "text": "They didn't want to manufacture a virus that would kill you, we are worth more alive. Just break us down cognitively, through subliminal programming, hijacking the education, financial, and health aspects of our reality. Until we just.. give up",
            "title_similarity": "0.4514802",
            "sentiment_compound": -0.2799
        },
        {
            "id": "gzown9m",
            "score": 0,
            "text": "I think this explains why nonewnormal exists. It's the brain fog.",
            "title_similarity": "0.4297573",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoyjpa",
            "score": 0,
            "text": "And how do you make sure this isn’t just stress/depression related from the pandemic? Long term is months? 270 people? No link to study? Hundreds of comments deleted in thread? Yep it’s r/science time",
            "title_similarity": "0.69854784",
            "sentiment_compound": 0.504
        },
        {
            "id": "gzoz66m",
            "score": 0,
            "text": "  Should a science subreddit really be talking about something as poorly defined and understood as 'brain fog?  \n\n  The last article I read about this mentioned that a large portion of people reporting having brain fog and fatigue never even tested positive for covid or for covid antibodies.",
            "title_similarity": "0.68840563",
            "sentiment_compound": -0.6025
        },
        {
            "id": "gzoziw1",
            "score": 0,
            "text": "Brain fog. Welcome  to my life",
            "title_similarity": "0.24243675",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzp1k3u",
            "score": 0,
            "text": "I've had brain fog my whole life",
            "title_similarity": "0.47254694",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp2q1k",
            "score": 0,
            "text": "You know what helped me when I had covid. \n\nGoing outside and walking everyday with my dog. I remembered my childhood doctor telling me to exercise when I’m sick and so that’s what I did.",
            "title_similarity": "0.38458365",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzp32m6",
            "score": 0,
            "text": "monkaS so you basically become an American",
            "title_similarity": "0.21698107",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp44at",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.22116542"
        },
        {
            "id": "gzp4du0",
            "score": 0,
            "text": "Tell me about it. @.@  been dealing with it for 2 decades now.",
            "title_similarity": "0.43751153",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp6x2r",
            "score": 0,
            "text": "I've always got brain fog so I don't think COVID-19 can make it any worse!",
            "title_similarity": "0.53699017",
            "sentiment_compound": -0.5255
        },
        {
            "id": "gzpa5zs",
            "score": 0,
            "text": "Is this why I’m dumb or was I born with it?",
            "title_similarity": "0.36513922",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzpfkbl",
            "score": 0,
            "text": "Are we these people didn't have some pre existing undiagnosed disease that are causing these symptoms like alsheimers or something.",
            "title_similarity": "0.45987725",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzpgj7i",
            "score": 0,
            "text": "I must have had Covid for 45 years now.",
            "title_similarity": "0.4577322",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpk2ei",
            "score": 0,
            "text": "These people and anyone experiencing these symptoms should look into vitamin deficiencies. I had similar symptoms and soon after eating a balanced diet and taking things like magnesium that were hard to get in a modern diet, i felt absolutely amazing. But I don't want to mislead anyone, so look into things yourself, but I can totally see a disease depleting your body of vitamins and minerals especially if you were already low and then didn't eat much during the course of the illness and then compound that with stress, which further depletes your body of nutrients and you could be pretty unhealthy at a micro and macro nutrient level.",
            "title_similarity": "0.573834",
            "sentiment_compound": -0.7806
        },
        {
            "id": "gzpkyp0",
            "score": 0,
            "text": "Food for thought for all the nonbelievers. Wonder how Trump's doing these days?",
            "title_similarity": "0.33045173",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzplg34",
            "score": 0,
            "text": "I live with this most days because of an injury. It’s okay",
            "title_similarity": "0.41637254",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzpm2kv",
            "score": 0,
            "text": "So they’ve become complete Republicans. Diabolical.",
            "title_similarity": "0.3876498",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpmpzj",
            "score": 0,
            "text": "I experience these symptoms every time I smoke weed",
            "title_similarity": "0.3120045",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpmqtu",
            "score": 0,
            "text": "This is reassuring because I feel like that everyday, and it’s been two years of lockdown with a few months of break in between",
            "title_similarity": "0.5737232",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzpn83t",
            "score": 0,
            "text": "Hack: Be diagnosed with severe mental illness and have to take antipsychotics every day for the rest of your life and experience brain fog from that instead.",
            "title_similarity": "0.6894202",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzpnljk",
            "score": 0,
            "text": "Diet, exercise, sleep; blood vessels got beat up with COVID, that's how you fix them.",
            "title_similarity": "0.58653504",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpnmwt",
            "score": 0,
            "text": "Brain Clouds are much more deadly.",
            "title_similarity": "0.46024907",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzml0o0",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzmngb4",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmts1l",
            "score": -18,
            "text": "Rejoice! idoits everywhere now have an excuse for the stupid",
            "title_similarity": "0.33506685",
            "sentiment_compound": -0.126
        },
        {
            "id": "gzmdu8f",
            "score": 568,
            "text": "How do they account for confirmation bias? Must be hard to objectively assess something like 'brain fog'",
            "title_similarity": "0.4620436",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzmgm68",
            "score": 32,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmyvr0",
            "score": -6,
            "text": "Guess I've had covid since college! \nOr is it the weed? Hmm... Can't remember",
            "title_similarity": "0.47205147",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn9rmu",
            "score": -6,
            "text": "That’s just normal human behavior, if you don’t do brain fog normally somethings wrong with you",
            "title_similarity": "0.32806015",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzn1sra",
            "score": 180,
            "text": "It's interesting to see the disconnect some people have in regards to COVID. Yeah, the likelihood of dying for healthy persons is low, but there's things like this article that show there are potentially permanent side effects. A colleague of mine still has no sense of smell (contracted COVID in December 2020). \n\nUntil there's a definite answer to \"Can vaccinated people infect non-vaccinated people\", I'm going to keep the mask on. I can't/won't risk my children potentially having lifelong complications from this disease.",
            "title_similarity": "0.61265427",
            "sentiment_compound": 0.7947
        },
        {
            "id": "gzn0zhk",
            "score": 1,
            "text": "I've had brainfog for the past 6 years.....",
            "title_similarity": "0.60527515",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn13h6",
            "score": 1,
            "text": "i had all of these symptomes for most of my adult life",
            "title_similarity": "0.32006723",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn44d1",
            "score": 1,
            "text": "That’s me 24/7 for most of my life.",
            "title_similarity": "0.3318783",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn75mz",
            "score": -1,
            "text": "I think I must have got covid about 10 years ago",
            "title_similarity": "0.42935413",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznbg1r",
            "score": -1,
            "text": "omfg ive had covid for like a decade now D:)",
            "title_similarity": "0.459629",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gznec9b",
            "score": 1,
            "text": "I heard from a doctor that most cases of brain fog are undiagnosed early onset dementia anyway.",
            "title_similarity": "0.6989142",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzneric",
            "score": -1,
            "text": "Omg, I'm having almost all of the symptoms without any covid.",
            "title_similarity": "0.53881645",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznf71j",
            "score": -1,
            "text": "Sounds like they just have early onset ADHD",
            "title_similarity": "0.4361084",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gznfimi",
            "score": 1,
            "text": "As someone who has severe epilepsy, welcome to my world.",
            "title_similarity": "0.5457259",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzngshe",
            "score": -1,
            "text": "Brain fog? Isn’t that what Joe had in Joe vs the Volcano.",
            "title_similarity": "0.377225",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznh3kp",
            "score": 1,
            "text": "That’s ADHD me on a day to day basis... ima be totally screwed if I get Covid!",
            "title_similarity": "0.5869224",
            "sentiment_compound": -0.5838
        },
        {
            "id": "gzni7j3",
            "score": 1,
            "text": "First, penis gets smaller, now this. I hate covid",
            "title_similarity": "0.5367415",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gznir7z",
            "score": 1,
            "text": "Honestly this virus seems like the perfect thing to infect people with given the mental effects",
            "title_similarity": "0.26258868",
            "sentiment_compound": 0.8481
        },
        {
            "id": "gznmhpx",
            "score": -1,
            "text": "\"Get the vaccine!\" Nuh uh, this puppy needs to get to Texarkana.",
            "title_similarity": "0.31591436",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzno80f",
            "score": -1,
            "text": "Dark humor here for a second. So parts of ADHD?",
            "title_similarity": "0.51197374",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gznpct5",
            "score": -1,
            "text": "MY question is how many of these family annihilators slash mass shooters we are seeing this year had covid related neurological damage.",
            "title_similarity": "0.68722534",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gznplki",
            "score": -1,
            "text": "Nah, that's the recreational weed doing it's job.",
            "title_similarity": "0.1694735",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gznqbai",
            "score": 1,
            "text": "Based on how intelligent the anti vaxers in my life are, they have no spare brain cells to fog!",
            "title_similarity": "0.37731475",
            "sentiment_compound": -0.2003
        },
        {
            "id": "gznrt6a",
            "score": -1,
            "text": "If anyone is curious, I saw a post on r/peptides about peoples experience with taking peptides that really helped a lot with long haul symptoms. Unfortunately you need to inject peptides because they are too fragile to survive stomach acid. I have only taken them to heal injuries, but in my experience, peptides are on a whole other level as far as effectiveness compared to anything else available.",
            "title_similarity": "0.59301865",
            "sentiment_compound": -0.0129
        },
        {
            "id": "gznsdix",
            "score": 1,
            "text": "Brain fog was one of the ways my bout with COVID started, it was horrible and bizarre. For three months after my moderate bout with COVID I struggled with fatigue, brain fog and odd joint pain. Thankfully, it seems to have finally passed.",
            "title_similarity": "0.7914705",
            "sentiment_compound": -0.9001
        },
        {
            "id": "gznt9gp",
            "score": 1,
            "text": "As one of the long- haulers, I concur with this report.",
            "title_similarity": "0.23530053",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznudl1",
            "score": 1,
            "text": "Removed Removed Removed Removed Removed Removed Removed Removed Removed Removed Removed Removed",
            "title_similarity": "0.29683292",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznvsr9",
            "score": -1,
            "text": "That kinda sounds like everybody.",
            "title_similarity": "0.0346378",
            "sentiment_compound": 0.3008
        },
        {
            "id": "gznvtrl",
            "score": 1,
            "text": "And here I was thinking I’m developing Alzheimer’s at 19",
            "title_similarity": "0.6058701",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznwe10",
            "score": 1,
            "text": "Do you believe it is something that can be considered disabled enough to get disability form your insurance? Mine denied me.",
            "title_similarity": "0.495674",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gznycgh",
            "score": 1,
            "text": "Discussion is not allowed. ECHO ONLY.",
            "title_similarity": "0.18222815",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznze0c",
            "score": 1,
            "text": "Most anti-vaxxers would never recognize these symptoms as being unusual for them.",
            "title_similarity": "0.41501927",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo08zb",
            "score": -1,
            "text": "Looks like I had Covid.",
            "title_similarity": "0.24989903",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzo3n0z",
            "score": 1,
            "text": "From speaking to people with post-Covid issues, my understanding is those hit hardest by Covid seem to be developing autoimmune-like inflammatory conditions.\n\nWe already know that Covid causes inflammatory-like responses on the lungs via cytokine storms, but now it seems as if some people are becoming more susceptible to future cytokine issues (like brain fog).\n\nThe real answer lies in diet - remove inflammatory foods to minimise inflammatory responses, but it's very interesting (and concerning) how people are developing these autoimmune-like issues - very similar to my own problems I fixed through diet.",
            "title_similarity": "0.6024662",
            "sentiment_compound": -0.0027
        },
        {
            "id": "gzo8oco",
            "score": -1,
            "text": "more like boob tube syndrome hehe",
            "title_similarity": "0.36490804",
            "sentiment_compound": 0.4201
        },
        {
            "id": "gzobbwq",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.22116542"
        },
        {
            "id": "gzobor1",
            "score": 1,
            "text": "I don't know if this is a dumb question, but could the same symptoms come from the vaccine? Because it's a weakened version of Covid?",
            "title_similarity": "0.534716",
            "sentiment_compound": -0.6662
        },
        {
            "id": "gzobzfj",
            "score": -1,
            "text": "It couldn't have anything to do with living through the pandemic.. not being able to properly socialize or function as you've been used to for your entire life?",
            "title_similarity": "0.50321025",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzodi1x",
            "score": -1,
            "text": "I dont know, just seems like anxiety or depression from all of this. I've gotten intense brain fog since last year and have never had covid",
            "title_similarity": "0.700248",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzoe59t",
            "score": 1,
            "text": "I have all of this without COVID. And I’m in my 20s",
            "title_similarity": "0.4268155",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzomq7n",
            "score": 1,
            "text": "Bloody hell, I must have had Covid for 36 years now then.....",
            "title_similarity": "0.5358907",
            "sentiment_compound": -0.8176
        },
        {
            "id": "gzomwrb",
            "score": 1,
            "text": "So, 'long haulers' still have the 'virus' and will continue to test positive, right?",
            "title_similarity": "0.37477008",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzomxi8",
            "score": 1,
            "text": "I get a version of brain fog the next few days after being high (THC) almost like a constant and persistent hangover. Have trouble hearing/understanding and comprehension.",
            "title_similarity": "0.79327637",
            "sentiment_compound": -0.1263
        },
        {
            "id": "gzotml0",
            "score": -1,
            "text": "Lions mane mushroom and nac would come in handy.",
            "title_similarity": "0.2386148",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzou6fi",
            "score": -1,
            "text": "Is it because of the vaccines?",
            "title_similarity": "0.3166665",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzow0om",
            "score": 1,
            "text": "My first vaccine can't come fast enough. COVID is NOT something that I want to experience...",
            "title_similarity": "0.48170403",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzoyejy",
            "score": 1,
            "text": "I got pretty bad brain fog after covid in august. \n\nA good buddy of mine invested in a men’s health clinic, and told me to try stem cell “injections”. Basically they shoot stem cells in your nose. Only reason I did it was he gave me a great price. \n\nIt. Was. Unbelievable. Felt like my brain was 1000x better for a week or so.",
            "title_similarity": "0.654073",
            "sentiment_compound": 0.8885
        },
        {
            "id": "gzpkjwc",
            "score": -1,
            "text": "A Reminder: No one was born  with  these diseases \nEverything that the LORD had made was good and \nVery good, he made us in his on image and likeness.",
            "title_similarity": "0.34785807",
            "sentiment_compound": 0.5984
        },
        {
            "id": "gzpriz4",
            "score": 1,
            "text": "As someone who has had brain fog, not having the correct problem solving skills in my construction career, constantly not thinking of solutions I used to think of, this just overwhelms me as strange. I’ve felt off ever since this pandemic, in my ability to think ahead on a job site, remembering our direction, progression, staying focused and then also not having MacGyver solutions to things like I was known for. Just slow. Idk. Could be stress, and my life. Could be COVID too apparently.",
            "title_similarity": "0.6565883",
            "sentiment_compound": -0.1867
        },
        {
            "id": "gzmutls",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmz6yp",
            "score": 17,
            "text": "The brain fog was always my biggest covid fear by a long shot. Somehow living with brain fog seems ultimately worse than any other option.",
            "title_similarity": "0.664019",
            "sentiment_compound": -0.743
        },
        {
            "id": "gzmufn5",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzmmwi2",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmwbsw",
            "score": -2,
            "text": "guys, I might have had it",
            "title_similarity": "0.1941615",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzmy97u",
            "score": -2,
            "text": "Sounds like getting adhd to me",
            "title_similarity": "0.4422868",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzn157c",
            "score": -2,
            "text": "I must have gotten covid at a young age.",
            "title_similarity": "0.33500588",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn1ew3",
            "score": -2,
            "text": "Whew I thought it was just my cannabis use",
            "title_similarity": "0.23630494",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn2w29",
            "score": 2,
            "text": "People with ADHD live this.",
            "title_similarity": "0.44877514",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn5ho4",
            "score": -2,
            "text": "Yeah, or they have an excuse now for having trouble forming words, difficulty focusing, and absent-mindedness.",
            "title_similarity": "0.44356456",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gznbkip",
            "score": 2,
            "text": "“BuT iT oNlY kIlLs 1% oF pEoPlE!!”",
            "title_similarity": "0.49325687",
            "sentiment_compound": -0.6229
        },
        {
            "id": "gznl4sp",
            "score": -2,
            "text": "Sounds like symptoms associated with severely limiting social interaction...",
            "title_similarity": "0.4529584",
            "sentiment_compound": -0.128
        },
        {
            "id": "gznwc29",
            "score": 2,
            "text": "Isn't that fog more likely caused by living in a covid world than covid itself? \n\nLockdowns, constant looming fear, lack of social interaction, staying indoors more, less exercise, diet changes, working-from-home burnout, doom-scrolling...",
            "title_similarity": "0.64545107",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gznww2a",
            "score": 2,
            "text": "This is literally me, I had Covid back in November. I still can not go to the bathroom without laxatives and have headaches daily. The brain fog seems to never go away and I have been having a lot of trouble focusing on my work. It sucks when you truly have no idea when you will get better.",
            "title_similarity": "0.7157464",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gznxxpc",
            "score": -2,
            "text": "Nah but I think its just due to the fact that the human species is degenerating like the filth that they are considering how most people live their lives in an unambitious haze",
            "title_similarity": "0.5926184",
            "sentiment_compound": 0.4678
        },
        {
            "id": "gznypvc",
            "score": 2,
            "text": "I had  COVID (not hospitalized) in October 2020.  I’m still dealing with headaches, and I get some kind of brain fog, I’m not sure if it’s the same as described here or if it’s just a part of getting older (41).  I lose my train of thought right in the middle of a sentence, struggle to find a word like there’s a wall blocking it, and my attention span is way down.  I can’t focus through a tv program I enjoy.  It’s so frustrating because I have to talk a lot for work, and I just trail off in the middle of the sentence and look like a fool.  It happens daily and even when I’m not having a headache.",
            "title_similarity": "0.785806",
            "sentiment_compound": -0.7055
        },
        {
            "id": "gznytda",
            "score": 2,
            "text": "Yep. I know someone who had COVID, survived, but now they’re dealing with “COVID Brain”. They were definitely struggling to focus on conversation and small things like that.",
            "title_similarity": "0.59025556",
            "sentiment_compound": 0.705
        },
        {
            "id": "gzo12mf",
            "score": -2,
            "text": "Apparently I've been post-COVID ever since I was in Middle School",
            "title_similarity": "0.3994819",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo41ub",
            "score": -2,
            "text": "Oh no I’ve had covid for my whole life",
            "title_similarity": "0.24245977",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzob4sp",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.22116542"
        },
        {
            "id": "gzogdk2",
            "score": -2,
            "text": "Yup, it's totally long covid and long covid only and not the long term effects of a 15 month societal shutdown and alienation from your fellow community members.",
            "title_similarity": "0.5065682",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzoghc6",
            "score": -2,
            "text": "My **opinion** is that brain fog is caused by anxiety and anxiety is caused by excessive stress and Covid has caused lots and lots of stress. So yes there is most certainly a link here \n\nSource: me, living every day of my life full of anxiety and brain fog. I notice I don’t feel the fog as much when I’m happier",
            "title_similarity": "0.6756256",
            "sentiment_compound": 0.2226
        },
        {
            "id": "gzoi52f",
            "score": -2,
            "text": "Fear mongering for karma. Classic Reddit.",
            "title_similarity": "0.44593126",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gzokceh",
            "score": -2,
            "text": "I feel like this and I haven’t had Covid, how can we be sure it’s not a psychological response to the stress the pandemic has had and the associated restrictions on our mental health?",
            "title_similarity": "0.54778796",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzovnlh",
            "score": 2,
            "text": "This is straight facts. I feel like no one believes me when I tell them I’m experiencing these exact symptoms. I’ll forget a word I literally just used a few sentences prior. I’ll know a word I want to say, the meaning of the word and everything but can’t form the word in my head. If I’m doing a basically easy math problem then do another one right after, I’ll forget the total of the first one. I have to reread things such as instructions easily twice or more to remember what to do and a host of other similar issues. Almost feels like what I’ve read some of the symptoms Early-Onset Alzheimer’s has. It’s concerning to say the least.",
            "title_similarity": "0.56675243",
            "sentiment_compound": 0.6466
        },
        {
            "id": "gzoyu6c",
            "score": 2,
            "text": "This...I am a performer and I was really worried I was going to lose my career because I lost...what? My edge? My boss cried when he saw me severely confused. It took me over a year to start feeling better.",
            "title_similarity": "0.6855537",
            "sentiment_compound": -0.8423
        },
        {
            "id": "gzoz198",
            "score": -2,
            "text": "ITS THE VAX YOU IDIOTS. Actually get it. We need to shrink our population may as well be dumbasses who get it",
            "title_similarity": "0.5533469",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzmvtzx",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzmtpm2",
            "score": 12,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzmlvw6",
            "score": 32,
            "text": "These neuro problems permanent?",
            "title_similarity": "0.4223719",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzmwdbm",
            "score": 3,
            "text": "Can this happen post vaccine?\n\nGot the vaccine a few months ago and I noticed that even if I get a full sleep, as the day goes on, I feel brain fog increase and I feel like I:m half here, half not",
            "title_similarity": "0.7416026",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzmy2l3",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzn39yn",
            "score": -1,
            "text": "Hmmmm ... sorta sounds like sucking too much air from lead-additive gasoline fumes.\nOh, right, the new unleaded gas fumes are so much better ...\nCovid comorbidity, air pollution and poor water mean nothing eh?",
            "title_similarity": "0.53661776",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzn3f5o",
            "score": -3,
            "text": "Worst thing you can do is read this stuff, just ignore it and go on with life and it goes",
            "title_similarity": "0.32840735",
            "sentiment_compound": -0.765
        },
        {
            "id": "gzn424f",
            "score": -3,
            "text": ">This including trouble forming words\n\nWeird how this happened to my Father and three of my brothers after taking Pfizer vaccine!\n\nDoes anyone one have an explanation for this? I'm too afraid to take the vaccine.",
            "title_similarity": "0.56780505",
            "sentiment_compound": -0.5707
        },
        {
            "id": "gzn9evy",
            "score": -3,
            "text": "Also hunger for human flesh",
            "title_similarity": "0.19193587",
            "sentiment_compound": -0.25
        },
        {
            "id": "gznagxh",
            "score": -2,
            "text": "Or you could just be hella booooooooooooooooooooooored.",
            "title_similarity": "0.31853494",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzng01w",
            "score": -3,
            "text": "Not trying to be snarky or anything, but I wonder if a correlation between refusal to comply with covid guidelines and just being a stupid person in general would make a study like this difficult. Is the covid causing brain fog, or is that the person's normal state - now they just have a scapegoat.",
            "title_similarity": "0.5323617",
            "sentiment_compound": -0.8662
        },
        {
            "id": "gznh28w",
            "score": -3,
            "text": "Probably just all the brain cells killed off from wearing a mask all day.",
            "title_similarity": "0.6265255",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gznla6q",
            "score": 3,
            "text": "I really wonder if long-term brain fog can happen to people who had COVID but only with mild/minimal symptoms.\n\nWhen I got COVID in early January, I was mildly sick for literally <12 hours and then just fatigued for a week. No other symptoms. At times I was even doubting that my positive test was accurate or maybe it was a false positive. But since that time, I have struggled **so hard** with focus and I have no explanation for it.\n\nI'm a person with diagnosed ADHD and I take Adderall twice daily. I see a psychiatrist monthly and a therapist every other week. This is just to say that I'm someone who stays pretty mindful as far as mental health goes particularly as it relates to attention span and focus. These regular check-ins help me keep track of my mental state long-term, so I'm pretty conscious of when I'm in a \"rut.\" When I'm having a difficult time, I try to reflect (by myself and with the help of my therapist/psychiatrist) on *why* I'm having trouble, what triggers it, and what I can do to get out of it.\n\nMy lack of focus these past few months are **FAR** worse than any I have experienced in my entire life. It's crippling. I sit down to do 2 hours of work and suddenly it's 12 hours later, the sun is coming up, and I'm screaming at myself internally *the entire time* without any ability to make progress. In my adult years with ADHD, my focus comes and goes just like anyone else, and when I'm stuck in a rut I might have a rough week or two. Right now I feel like it's been a solid three months where I just can't come up for air.\n\nSome people bring up that brain fog can possibly be linked just to the difficulties of living during a pandemic, but my life is essentially the exact same as before the pandemic. I'm lucky enough where my job didn't change, I never even worked from home, I live with 3 family members (and 4 dogs!) so I'm not isolated by any means. The first year I was totally fine, and then the past ~3 months have been maybe the most mentally challenging I've ever experienced, I feel helpless and it feels unending.",
            "title_similarity": "0.7727548",
            "sentiment_compound": 0.4238
        },
        {
            "id": "gzno5a9",
            "score": 2,
            "text": "I hate brain fog...you feel like your brains eroding away I couldn’t find the word for pizza the other day",
            "title_similarity": "0.5544464",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzoxnjm",
            "score": 2,
            "text": "This is a 100% true. I am 18 and when I was little I used to have symptoms of adhd but my mom thought it was best if I just grew out of it instead of taking medication. I had Covid New Years weekend and right after I was healthy again I had the hardest time focusing and reading things. It was so bad that I went from getting the top grades in my classes to literally the lowest in the school. Multiple teachers reached out to me and asked if I was ok because of how poorly I was doing in school. I went to my doctor and she had to prescribe me a prescription of a form of Adderall to try and help. It only worked for about a month and now even with me taking the prescription daily I have the hardest time reading and talking. But the worst part is remembering things, i could be talking to someone and than three words in forget what I said previously and be totally lost. Covid it self was fine for me and my family but the after brain fog has been the worst illness I have ever tried to face.",
            "title_similarity": "0.72229993",
            "sentiment_compound": -0.8916
        },
        {
            "id": "gzmy520",
            "score": 49,
            "text": "Does anyone know if long-haul COVID-19 can still happen if one has the vaccine? Since the vaccine more or less brings the active virus symptoms down to asymptomatic or a common cold.",
            "title_similarity": "0.6154568",
            "sentiment_compound": 0.3477
        },
        {
            "id": "gzn9s2d",
            "score": 36,
            "text": "If you want to know what brain fog is, just speak to someone with migraines. \n\nI didn't know what it was when I started experiencing symptoms in college because I was not diagnosed until my senior yr, but I remember thinking I was getting dumb. I was a very high achieving student and I found it difficult to do math or just concentrate. I seriously thought my brain wasn't working right anymore. I had never been like that before. I was also expericing severe headaches frequently and they would not respond to anything OTC.\n\nFound out I have migraines. It makes so much sense now. Unfortunately, brain fog and pain aren't my only symptoms. Toss in some dizziness, nausea, the occasional visual aura, and you've got yourself a fun time ahead. Thankfully, though, now I have meds to stop it when it happens. Those have fun side effects too.",
            "title_similarity": "0.69192994",
            "sentiment_compound": -0.9084
        },
        {
            "id": "gzmxdkt",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzmxsbg",
            "score": -4,
            "text": "Bet this study was in Colorado. Long term covid bro.....",
            "title_similarity": "0.32847625",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn0ra2",
            "score": -5,
            "text": "take iron supplements that’s what that is!!",
            "title_similarity": "0.17795104",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn13mg",
            "score": -6,
            "text": "How do you Muppets manage to catch the virus? Do you all lack common sense or something? Does your ignorence blind you? How hard is it to follow basic safety measures ?",
            "title_similarity": "0.57186234",
            "sentiment_compound": -0.5514
        },
        {
            "id": "gzn1kk1",
            "score": -5,
            "text": "How can we verify that this is only from the vaccine? And perhaps not being stuck inside all day/depressed/not as stimulated compared to pre-pandemic life? Just curious what kind of controls were put in place to make the conclusion!",
            "title_similarity": "0.6048136",
            "sentiment_compound": 0.68
        },
        {
            "id": "gzn1q6k",
            "score": -2,
            "text": "I’m sure having a rod jammed up your nose to your fuckin brain stem to test for it isn’t a contributing factor though.",
            "title_similarity": "0.34397078",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzncdwm",
            "score": 5,
            "text": "I'm an Occupational First Aid (OFA2) attendant. Let's assume I'm doing a first aid assessment on a \"brain fog incident\" for a Covid long hauler.   \n     \nI've read and watched numerous \"just the facts, ma'am\" articles and presentations by reputable journalists. Statistics give me confidence in knowing that all people infected by Covid experience reduced Oxygen saturation in their blood.    \n      \nFurther, Covid ICU patients can experience:    \n* blood clots      \n* heart attacks      \n* strokes      \n* gangrene in extremities due to severely reduced Oxygen saturation, which forced their body to tightly ration Oxygen and send as much as possible to their brain to keep it alive.    \n   \nIf someone had only a very mild case of Covid, they would have felt fine although they couldn't smell or taste anything. \nPerhaps their body didn't recognize modestly decreased blood Oxygen saturation and it carried on with business as usual. If that happened, their brain could have sustained ever-so-slight damage that is causing brain fog.     \n       \nIt does make me wonder.",
            "title_similarity": "0.63830876",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gznh2m4",
            "score": 15,
            "text": "I combine and scramble my words now, post COVID-19.\n\nI was so worried as I have had male family members diagnosed with MS, that I went in for a full examination, and was referred to a neurologist for brain scans. No signs of MS, thankfully.\n\nMy primary care physician, along with the neurologist, have written it up to be a bad case of post-COVID brain fog. I’m 28, nearly 29 years old - and I have essentially developed a stutter due to COVID-19.\n\nIt’s good some days, more noticeable on others. I have been prescribed Adderall by my primary care in order to combat the brain fog, lack of attentiveness and energy levels, and to regain the same levels of determination I had before COVID.\n\nI wish more people would have taken it seriously, rather than a literal illness becoming a political talking point and wedge in societies.\n\nNot all opinions are equal, and we should have gone beyond ignoring, beyond challenging, to outright banning misinformation tactics against COVID awareness. It should bring fines and jail time for those who actively spoke against the scientific community and experts, and encouraged the spread of the illness.",
            "title_similarity": "0.7744783",
            "sentiment_compound": -0.0941
        },
        {
            "id": "gznazwh",
            "score": 149,
            "text": "Patient with fibromyalgia here. Brain fog is a permanent symptom for people like me. I'm really hoping that the awareness brought on by neurological symptoms around Covid will bring about better treatment for us too. Living with brain fog feels like a neverending nightmare of uncertainty where you can never be sure if you've forgotten something or not.",
            "title_similarity": "0.6353307",
            "sentiment_compound": 0.6938
        },
        {
            "id": "gzn2gpz",
            "score": 91,
            "text": "My mother has complained of severe brain fog since she had covid in November. She is not depressed or been “isolated” (that’s how she got covid in the first place). She says the brain fog has been terrible and her worst long term issue with covid. \n\nMy dad also had covid but didn’t suffer the same brain fog, or at least is ignoring it if he has. He did, however, almost die.",
            "title_similarity": "0.72951806",
            "sentiment_compound": -0.9618
        },
        {
            "id": "gzn4k6c",
            "score": 60,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzn3t6c",
            "score": 21,
            "text": "Why is every comment I try to reply to deleted by the time I reply?  What the hell are you doing mods???\nBrain fog from covid is real, and is one of the less intense long term side effects of covid.  This needs to be talked about more!!!",
            "title_similarity": "0.6064136",
            "sentiment_compound": -0.8141
        },
        {
            "id": "gzm9y6z",
            "score": 1011,
            "text": "Long-haulers continue to have symptoms long after their COVID diagnosis, and these symptoms can be mental as well as physical.\n\n\"People have trouble problem-solving, or they get in the car and forget where they're supposed to be going,\" said study author Leonard Jason, a psychologist at DePaul University in Chicago.\n\nThe researchers compared long-haulers' complaints with those with myalgic encephalomyelitis/chronic fatigue syndrome, or ME/CFS.\n\nPatients with ME/CFS have long-term symptoms possibly triggered by the Epstein-Barr virus or for other unknown reasons.\n\nThe team defined long-haul COVID-19 as having serious, prolonged symptoms three months after contracting the virus.\n\nThe study included 278 long-haul COVID-19 patients who were asked about their symptoms at two points, six months apart.\n\nhttps://www.tandfonline.com/doi/abs/10.1080/21641846.2021.1922140?journalCode=rftg20",
            "title_similarity": "0.7516391",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gzmyug3",
            "score": 6,
            "text": "But is there a control group of comparing brain fog of people who didn't get Covid? A lot of us are suffering during lockdown, even if we didn't catch the virus.",
            "title_similarity": "0.72804606",
            "sentiment_compound": -0.631
        },
        {
            "id": "gzneqew",
            "score": 6,
            "text": "Can the mods remove this comment too? Thanks",
            "title_similarity": "0.30268887",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzmu830",
            "score": 42,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzmaif8",
            "score": 583,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzmwfeu",
            "score": 64,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzmnlpn",
            "score": 41,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzmuw0j",
            "score": 36,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzn4v5p",
            "score": 277,
            "text": "UPI is not a reliable source.   They are owned by the reactionary religious cult that calls itself \"The Unification Movement\" who are commonly referred to as \"moonies\" after the founder Sun Myung Moon.\n\nFrom their own [About page:](https://about.upi.com/)\n\n> UPI is owned by News World Communications. \n\nFrom the Dun & Bradstreet business [profile](https://www.dnb.com/business-directory/company-profiles.news_world_communications_inc.dbf6743f9d33a9e46032f1a5cc3ff890.html) of News World Communications:\n\n>  News World Communications is a newspaper publishing company owned by the Reverend Sun Myung Moon's Unification Church.",
            "title_similarity": "0.4824048",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznfys4",
            "score": 13,
            "text": "But who will moderate the moderators?",
            "title_similarity": "0.13416049",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzml3jk",
            "score": 255,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzmtg9b",
            "score": 265,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzmtxvl",
            "score": 70,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmtfrx",
            "score": 840,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmxf6r",
            "score": 228,
            "text": "I got vaccinated for this very reason. I have adhd so  brain fog is already part of the package. When I got COVID last month my confusion and lack of focus was majorly amplified.",
            "title_similarity": "0.7518648",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzn4svw",
            "score": 175,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmhr3x",
            "score": 851,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmubbr",
            "score": 74,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzn34ms",
            "score": 4472,
            "text": "The symptoms of long-haul COVID are essentially the same as chronic fatigue syndrome/myalgic encephalomyelitis. Most cases of CFS/ME are thought to be triggered by an injury or infection, maybe now that there’s more of a spotlight on the disease it’ll actually be researched and taken seriously by those in the medical community. It’s an incredibly difficult thing to live with.",
            "title_similarity": "0.63296676",
            "sentiment_compound": -0.807
        },
        {
            "id": "gzmlgl7",
            "score": 192,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmlkp6",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmn9cg",
            "score": 19,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmoq92",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmpno9",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmpsmv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmqqul",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmrkph",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmsalg",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmsds9",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmv75b",
            "score": 26,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmwhag",
            "score": 2,
            "text": "Any data on if you can get brain fog if you are fully vaccinated and only then get covid? Can breakthrough cases get the brain fog?",
            "title_similarity": "0.42687967",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzmwlzb",
            "score": 1,
            "text": "They've found that the vaccine mitigates physical symptoms after having contracted COVID-19, I wonder if it works on the brain fog as well?",
            "title_similarity": "0.5342227",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzmwpg5",
            "score": 2,
            "text": "Anyone who has access to the paper that can kindly share it here? Please",
            "title_similarity": "0.12859479",
            "sentiment_compound": 0.7717
        },
        {
            "id": "gzmwpga",
            "score": 1,
            "text": "Still have brain fog and my smell hasn't really come back either. Anyone else having difficulties with focusing on things at a distance now too?",
            "title_similarity": "0.5061526",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzmx6s3",
            "score": 1,
            "text": "Great. Like my brain wasn’t “foggy” enough already.",
            "title_similarity": "0.38104594",
            "sentiment_compound": 0.765
        },
        {
            "id": "gzmx858",
            "score": 1,
            "text": "I didn’t get Covid (that I know of) but after my first and second vaccine I would get unbelievably tired - like sitting at the table eating dinner and my eyes would close and I felt so sleepy.  I went to the doctor thinking it might be diabetes or some other health concern and everything came back normal in my blood work/tests.  Did anyone else experience this?  I have never experienced being tired like that, and it continued for weeks after the second vaccine (thankfully back to normal mostly now)",
            "title_similarity": "0.67062914",
            "sentiment_compound": 0.8561
        },
        {
            "id": "gzmxp30",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzmy4im",
            "score": 1,
            "text": "I feel these symptoms and was recently diagnosed with mild sleep apnea. I'm guessing COVID-19 had a play in this because I believe I had sleep apnea before I got COVID, but after I recovered from COVID, I gradually started feeling worse. I just got a CPAP machine, so hopefully that helps",
            "title_similarity": "0.728546",
            "sentiment_compound": 0.7803
        },
        {
            "id": "gzmy843",
            "score": 1,
            "text": "I got covid fairly bad for my age in late December. When I returned to work I found it really hard to concentrate and focus and think. I chalked it up to SAD, but maybe something else was going on. I have however felt better since spring began, so maybe I was right. Or maybe it was a little bit of both. Who knows",
            "title_similarity": "0.7705384",
            "sentiment_compound": -0.042
        },
        {
            "id": "gzmy9th",
            "score": 1,
            "text": "I read a great article in the Atlantic about the research and treatment of long covid.\nThey are finding one of the main issues is oxygen deprivation. Several studies show that people with mild covid symptoms are breathing much more shallow and arent aware of it.",
            "title_similarity": "0.6812388",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzmzj2p",
            "score": 1,
            "text": "Honestly I don’t know if I’ve just gotten lazier or if I have the brain fog. I had COVID in September/October, and idk if I noticed the lack of focus because my old job was super easy and didn’t pay enough for me to put more than a few hours of work into a day, but in my new job I just feel unmotivated, unfocused and uninterested all the time, even though I know it pays more, the stakes are higher and because I’m new the need to perform is greater to ensure my value.",
            "title_similarity": "0.63220596",
            "sentiment_compound": 0.6486
        },
        {
            "id": "gzmzqhh",
            "score": 1,
            "text": "'Brain fog' just made me think of Joe VS the Volcano, with his Brain Cloud.",
            "title_similarity": "0.39438596",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzmzuwh",
            "score": 1,
            "text": "Anyone else get a lingering cough that comes mostly whenever you want to speak? I got the big covid in Jan 2020, and I've been coughing \"at random\" ever since then.",
            "title_similarity": "0.64245236",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzmzzw4",
            "score": 1,
            "text": "I was never diagnosed with COVID but Feb 20th 2020 I was diagnosed with double lung pneumonia.  I currently have body aches, brain fog-like I used to remember so much but now I forget why I get up some times. It's also very hard to wake up.",
            "title_similarity": "0.71870506",
            "sentiment_compound": -0.7086
        },
        {
            "id": "gzn00sz",
            "score": 1,
            "text": "I'm at 14 months and the brain fog is still there. It has been slowly getting better, but still shows up. Especially during exercise, or unfortunately, sex. Getting the second shot tomorrow, so we'll see.",
            "title_similarity": "0.6036908",
            "sentiment_compound": -0.2846
        },
        {
            "id": "gzn0cvw",
            "score": 1,
            "text": "r/covidlonghaulers in case it helps anyone. It’s a harrowing experience. I’m still feeling occasional chest pain over a year later, but thankfully the brain fog went away after around 10-12 months.",
            "title_similarity": "0.7831421",
            "sentiment_compound": 0.5774
        },
        {
            "id": "gzn0dzh",
            "score": 1,
            "text": "I’ve been having brain fog too, but it could be just this chronic ass sativa.",
            "title_similarity": "0.6437781",
            "sentiment_compound": -0.6956
        },
        {
            "id": "gzn0msy",
            "score": 1,
            "text": "this is true. my partner’s father had covid (hes in his 70s) and he has had memory loss, cant sign his name AFTER having covid, and had serious confusion while with covid.",
            "title_similarity": "0.71667147",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzn0pmo",
            "score": 1,
            "text": "My cousin who had COVID experienced this for months after. Antidotal: the day after he got his second shot, all the brain fog went away. Anyone else experience this?",
            "title_similarity": "0.6510203",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn0x8y",
            "score": 2,
            "text": "This is me every day anyway",
            "title_similarity": "0.14408529",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn0xkr",
            "score": 1,
            "text": "got covid last july, i definitely have little moments where i can't remember the person i'm talking tos name or whatever. it comes and goes. for me the most noticeable effect has been lung damage. i used to exercise regulaarly, and now just climbing the stairs to my 2nd floor apartment has me really winded and my heart pounding. it was worse before and it slowly got better, but 1+ year out it feels like the healing has stagnated and i'm not getting better anymore. i worry this is just how life will be for me from now on. i'm 32.",
            "title_similarity": "0.76138645",
            "sentiment_compound": -0.3525
        },
        {
            "id": "gzn0z96",
            "score": 1,
            "text": "This virus just gets worse and worse",
            "title_similarity": "0.566206",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gzn11fs",
            "score": 1,
            "text": "Ive noticed this in my grandma. She got tested for dementia and alzheimers recently just to be safe, but since she had it last fall she still regularly has trouble getting the right names, forgets what she got up to do, or mixes up pronouns (call my dog a he instead of she and their dog she instead of he)",
            "title_similarity": "0.6945254",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzn15l4",
            "score": 2,
            "text": "I got sick with what was probably COVID last year, and I have massive focus/attention/memory problems now. But I had them before COVID, too, so I dunno.\n\nI'm seriously trying to think if it got worse after I was sick. Hard to say. The only thing I've specifically noticed since then is that my tongue feels weird. Just a tiny bit of odd numbness/sensitivity, like when your foot was asleep and is waking up, but more subtle.\n\nIf they come up with actual treatments for COVID brain fog, I wonder if they'd work on ADD?",
            "title_similarity": "0.82038486",
            "sentiment_compound": -0.9432
        },
        {
            "id": "gzn1j0t",
            "score": 2,
            "text": "Yep. And don't forget the frustration from an inability to articulate and mood swings.",
            "title_similarity": "0.48030448",
            "sentiment_compound": 0.4059
        },
        {
            "id": "gzn1o00",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.18108165"
        },
        {
            "id": "gzn1xqr",
            "score": 2,
            "text": "I developed a similar issue after an illness but my memory never recovered.",
            "title_similarity": "0.6051971",
            "sentiment_compound": -0.2144
        },
        {
            "id": "gzn2q1m",
            "score": 2,
            "text": "As someone who had brain fog after cancer/chemo, this is literal hell, and sometimes I think some of it still lingers, 10 years later",
            "title_similarity": "0.7812974",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzn2zij",
            "score": 2,
            "text": "I’m gonna blame forgetting to change the laundry like my wife asked on Covid!\n\nSeriously though I can believe it. I didn’t have it too bad but I have seemingly been a little more absent minded than before. Or it’s in my head.",
            "title_similarity": "0.6143178",
            "sentiment_compound": -0.4295
        },
        {
            "id": "gzn3hlr",
            "score": 2,
            "text": "So what does this mean in relation to the vaccine?",
            "title_similarity": "0.23246107",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn3jaa",
            "score": 4,
            "text": "Had a bad bout with Covid in December. My work is mostly manual labor. Took me 8 weeks to regain my strength and get fully back to work. Now I have what feels like arthritis in my hands and I forget vocabulary in a strange way. Like I know the word, I know what it means and how to use it in a sentence but when I get to that point in the sentence the word just vanishes. I know it's in there, my brain just won't produce it. \n\nAdditionally my tinnitus has been turned up to 11 (partly my fault for playing in a band, and using power tools, but it has definitely gotten worse recently).\n\nIt sucks that these symptoms are so nebulous, because half the time I think that it's all in my head, or my hands hurt because of a hard day of work. I know I've abused my body and brain over the years which makes diagnosis complicated, but I know in my heart that my hands, my words and the ringing in my ears have become markedly worse post Covid.",
            "title_similarity": "0.74784994",
            "sentiment_compound": -0.9059
        },
        {
            "id": "gzn3n0t",
            "score": 2,
            "text": "Experiencing this now. Covid sucks man. My sickness wasn’t horrible but I couldn’t get out of bed. No breathing issues though. Now I’m horrendously exhausted all the time, can’t think straight. 30 years old.",
            "title_similarity": "0.6678771",
            "sentiment_compound": -0.8898
        },
        {
            "id": "gzn3nvw",
            "score": 2,
            "text": "Does this happen with the vax too because my brain has felt like it’s left my body all spring. It might be the insane allergies this uear but damn...",
            "title_similarity": "0.72190857",
            "sentiment_compound": -0.5647
        },
        {
            "id": "gzn3qh2",
            "score": 2,
            "text": "I started feeling light headed (kinda severe if I ran out of breath) about 4 months ago, which never happened before along with feeling pain in my chest specially during things like pushups or laying face down\n\nCan anyone who've been through Covid-19 confirm please. I don't think there's a test to determine if someone had covid before",
            "title_similarity": "0.67680776",
            "sentiment_compound": 0.0498
        },
        {
            "id": "gzn3tzb",
            "score": 2,
            "text": "I have these issues and can relate after my bout with COVID in December.",
            "title_similarity": "0.47995776",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn42qk",
            "score": 2,
            "text": "I have been tested twice and both times negative. But i have never been tested for the antibodies. But i did get vaccinated. I have been having issues with this brain fog and it doesn't seem to be getting any better",
            "title_similarity": "0.66777027",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzn481e",
            "score": 2,
            "text": "I can attest to that. Symptoms lasted way longer than what the news is reporting. I had a fever that would come and go at random and a cough that was intermittent too. Also serious fatigue.",
            "title_similarity": "0.73040915",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzn4awf",
            "score": 2,
            "text": "Do we have any clues as to why?",
            "title_similarity": "0.13230059",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn4f5k",
            "score": 2,
            "text": "I'm not surprised. COVID mechanisms aside, every viral infection I've ever had has led to a period of brain fog. The worst of which was after a nasty mono infection where the fog took 2-3 years to fully improve.",
            "title_similarity": "0.7269387",
            "sentiment_compound": -0.733
        },
        {
            "id": "gzn4olz",
            "score": 2,
            "text": "On month 8. The brainfog sucks but the fatigue is next level. 12 hours of sleep on an average night but can go as many as 16 with naps",
            "title_similarity": "0.76914006",
            "sentiment_compound": -0.5023
        },
        {
            "id": "gzn4sca",
            "score": 2,
            "text": "My brain fog is getting better. Still have times that it really concerns me. Open a drawer and forget why I opened it. It is that quick. Fatigue is an issue. It also has improved but I am no where near where I was before covid. Also it wrecked my cells that control my blood sugar so I have to take medicine for diabetes. That too has improved. I got covid last year at this time.",
            "title_similarity": "0.69624233",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzn5550",
            "score": 1,
            "text": "There is nothing that can be done with long haul covid symptoms.  Everybody got covid we are all on the same boat and everyone is dealing with some degree of post covid symptoms.  I really do hope symptoms eventually clear out of the body on its own; but if it doesn't, realistically what can be done???  Start with the basics.  Exercise, nutrition, sleep, remove bad habits.  Hopefully this ignites people's motivation to find research, pursue academia, to prevent diseases like this happening again or to find some sort of cure.  This is all wishful thinking and really if anything a very long term pipe dream... but too many of us have chosen to play the victim and use covid as an excuse.  \"I can't reach my full potential because of covid, brain fog, I get tired.  I'm waiting for the cure or for everyone else to acknowledge my sickness is real.\"  That day is never coming.  Our generation is screwed if we take that mindset but hopefully we can improve the situation for future ones.",
            "title_similarity": "0.45034763",
            "sentiment_compound": 0.8825
        },
        {
            "id": "gzn5724",
            "score": 2,
            "text": "Long haul symptoms are not specific to Covid-19. In fact, almost every virus that has infected large numbers of humans has a cases of long haul symptoms. It is an active area of research in medicine and is not surprising. However, the real causes are still unknown as they seem to be independent of what virus you are infected with.",
            "title_similarity": "0.5295495",
            "sentiment_compound": -0.672
        },
        {
            "id": "gzn5kni",
            "score": 1,
            "text": "Feel like I have that all the time",
            "title_similarity": "0.034842957",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzn5v9i",
            "score": 2,
            "text": "So anti-vaxxers and covid deniers are going to MORE stupid???",
            "title_similarity": "0.502491",
            "sentiment_compound": -0.7944
        },
        {
            "id": "gzn7ho9",
            "score": 2,
            "text": "My co-worker still has some of these issues 6 months out. She also has nodules on her lungs and a hacking cough that randomly comes out of nowhere. The doctor's say it may go away some day or it may not, the nodules are most likely permanent. What a nasty bug, so glad I avoided it until vaccination.",
            "title_similarity": "0.7874914",
            "sentiment_compound": -0.4535
        },
        {
            "id": "gzn7jrp",
            "score": 2,
            "text": "Yeah, I'm worried that there are gonna be a lot of long term effects to this virus that we still have yet to recognize.",
            "title_similarity": "0.5747067",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn7n85",
            "score": 2,
            "text": "I have those symptoms everyday I think.",
            "title_similarity": "0.25407267",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn7yaw",
            "score": 2,
            "text": "As someone who has suffered from brain fog off an on and dealt with doctors who didn't have much guidance on how to improve it. It's somewhat encouraging to see this symptom be studied with more scrutiny. It's very real and debilitating, but there is no obvious treatment.",
            "title_similarity": "0.68304104",
            "sentiment_compound": -0.2255
        },
        {
            "id": "gzn80bj",
            "score": 1,
            "text": "This is what terrifies me the most about covid",
            "title_similarity": "0.43940806",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzn83wg",
            "score": 2,
            "text": "I had covid and pneumonia in November I was out for almost 3 months I remember my memory was really bad I would talk to my gf one minute and forget what I was saying and I honestly cried, it was scary not remembering and I knew something was wrong but I was too scared to find out I’m glad to know I wasn’t the only one with this",
            "title_similarity": "0.76221865",
            "sentiment_compound": -0.6855
        },
        {
            "id": "gzn8f0j",
            "score": 2,
            "text": "Do the COVID vaccines help in any way in reducing brain fog and other long COVID symptoms?",
            "title_similarity": "0.5339169",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzn8gqf",
            "score": 1,
            "text": "I would assume the lack of oxygen has a huge factor into this affect",
            "title_similarity": "0.50425756",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn8uje",
            "score": 2,
            "text": "My mother is a long hauler, we have noticed that her hand shakes a whole helluva lot more than it did before (in fact I don't remember it shaking at all prior) while it could just be old age and regular cognitive issues, I'm having trouble getting my mother to actually go to the doctor.\n\nDoes anyone have any information on long haulers with the 'shakes' for lack of a scientific term?\n\nIf this isn't relevant please delete.",
            "title_similarity": "0.62989414",
            "sentiment_compound": -0.3058
        },
        {
            "id": "gzn8vvo",
            "score": 1,
            "text": "My long term mental problems from covid went away when I did about two weeks of 1200 mg NAC per day.  \n\nOut came a ton of mucus the first couple of days. I think it was interfering with oxygen transfer in my lungs.  \n\nSince then, I’ve been back at 100%",
            "title_similarity": "0.6679046",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzn8wmg",
            "score": 1,
            "text": "What is long haul? Haven't heard that term outside of trucking.",
            "title_similarity": "0.4036535",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzn8yfy",
            "score": 2,
            "text": "I wonder if there is a correlation between the 'brain fog', and the frequent dizzy spells many of the recovered are also experiencing.",
            "title_similarity": "0.6552158",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzn9qu8",
            "score": 3,
            "text": "Good to know I didn’t just imagine myself being more tired overall",
            "title_similarity": "0.34202257",
            "sentiment_compound": -0.0754
        },
        {
            "id": "gzna2b3",
            "score": 2,
            "text": "Is this actually being diagnosed, measured in the body or somehow quantified? I certainly notice a difference in myself, but maybe I'm just getting older? Would be nice to definitively know.",
            "title_similarity": "0.52279305",
            "sentiment_compound": 0.6966
        },
        {
            "id": "gzna75d",
            "score": 2,
            "text": "I feel lucky, I had Covid very mildly for two weeks then it was gone, I felt completely normal as I always did ever since.",
            "title_similarity": "0.43417493",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzna98m",
            "score": 1,
            "text": "\"It's just the flu\"\n\n\"Why are you still wearing a mask\"",
            "title_similarity": "0.50193715",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzna9qa",
            "score": 1,
            "text": "Any possibility they are getting hypoxic?",
            "title_similarity": "0.46004567",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznaqe3",
            "score": 1,
            "text": "Sounds like me on a normal day. COol.",
            "title_similarity": "0.09327908",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gznb97y",
            "score": 1,
            "text": "I've been ill since September, initially having Covid a few weeks before. I've had pretty bad brain fog and short term memory issues that have made doing schoolwork really difficult. It's crap",
            "title_similarity": "0.83268106",
            "sentiment_compound": -0.8297
        },
        {
            "id": "gznbp53",
            "score": 2,
            "text": "Haha, it's funny how you think my brain fog comes from covid, it's just who I was.",
            "title_similarity": "0.40676275",
            "sentiment_compound": 0.7096
        },
        {
            "id": "gznc2dg",
            "score": 2,
            "text": "This happened to me when I took spironolactone for my acne. Better skin wasn't worth it.",
            "title_similarity": "0.6013224",
            "sentiment_compound": 0.3036
        },
        {
            "id": "gzncqev",
            "score": 1,
            "text": "Oddly enough my typing has been all messed up for like 6 months now, and I cant remember if it was always like that, bc im also dumb",
            "title_similarity": "0.8096118",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzncxl3",
            "score": 2,
            "text": "What was the age range in the study? Wondering how young  it went and how old.",
            "title_similarity": "0.40393063",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznd2t2",
            "score": 2,
            "text": "Mine wore off about a week after my other symptoms stopped, but goddamn it was terrible.  Could not focus on anything I was doing.",
            "title_similarity": "0.72233164",
            "sentiment_compound": -0.8674
        },
        {
            "id": "gzndknz",
            "score": 1,
            "text": "Thank you China for giving us this crap!",
            "title_similarity": "0.33532792",
            "sentiment_compound": 0.3802
        },
        {
            "id": "gzndy8h",
            "score": 2,
            "text": "It’s stuff like this that makes me want to punch the “But you don’t have much chance of dying” idiots. I wonder if they’d tell a paraplegic as the result of a car accident that at least they didn’t die.",
            "title_similarity": "0.5449948",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzndyem",
            "score": 2,
            "text": "Could someone suffer from brain fog if they didn't show symptoms of covid exposure?",
            "title_similarity": "0.5641843",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzne0zq",
            "score": 2,
            "text": "great even more people will lose their jobs because of this and the unrealistic perfection jobs require these days.",
            "title_similarity": "0.61911553",
            "sentiment_compound": 0.7037
        },
        {
            "id": "gzner9m",
            "score": 2,
            "text": "Interestingly, I would say I suffered from this brain fog after getting covid the first time, but after the second time it seems to have gone away.",
            "title_similarity": "0.6869216",
            "sentiment_compound": -0.0644
        },
        {
            "id": "gznf13n",
            "score": 3,
            "text": "I know I’m late to this thread but I have to say that I recently co-wrote/edited a paper on the similiarity between chronic fatigue syndrome and Covid-19, and the paper found that A LOT of the treatments prescribed to Chronic fatigue patients were actually EXTREMELY harmful (some patients lost the ability to walk!). By focusing on a combination of exercise and CBT and treating this as a mental disorder rather than as a physical disorder, doctors’ prescriptions have led to fatigue growing worse due to overextrenous “treatments”. Another huge issue is that studies show doctors don’t take patients with these kinds of disorders seriously - especially women, young people and POC. If you are experiencing these long COVID symptoms and your doctor suggest GRE and CBT then it’s a red flag - request a second opinion if possible.",
            "title_similarity": "0.77415335",
            "sentiment_compound": -0.9441
        },
        {
            "id": "gznfle5",
            "score": 2,
            "text": "I got it for a couple weeks after getting the first dose of Moderna too, really frustrating to just not feel like you're all there mentally. Just got the second shot two days ago and really hoping it doesn't come back",
            "title_similarity": "0.6587461",
            "sentiment_compound": -0.2982
        },
        {
            "id": "gznflep",
            "score": 2,
            "text": "Wish they had indicated the average age of those studied in the article.",
            "title_similarity": "0.48083502",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gznfpf4",
            "score": 1,
            "text": "Damn, I have had tinnitus since I got it in January. Also, I have had insomnia for the first time in my life and I had no idea why, didn’t know it could have been from Covid. Timing lines up too.",
            "title_similarity": "0.7344322",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gznfzwt",
            "score": 2,
            "text": "Is it also occuring in vaccined individuals ?",
            "title_similarity": "0.28156632",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznga83",
            "score": 1,
            "text": "Well, Trump is fucked.",
            "title_similarity": "0.367733",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzngo2o",
            "score": 2,
            "text": "I've been covid free for a month now, and I'm still having trouble with neurocognitive symptoms. For three weeks, the brain fog was so bad I couldn't do anything more than lay in bed. Now, I have horrible memory and can't keep a thought straight half the time. It sucks.",
            "title_similarity": "0.78330874",
            "sentiment_compound": -0.8398
        },
        {
            "id": "gznhgzi",
            "score": 2,
            "text": "I wasn’t diagnosed but I am fairly certain I had Covid in January 2020, before it had spread widely. \n\nI had the craziest brain fog from probably August 2020 - March 2021, it was pretty jarring because I am normally pretty quick so not being able to put two thoughts together was very noticeable. I was noticing my speech was not super coherent and I was really struggling to form sentences.\n\nI tried a bunch of stuff to sort it out not knowing about Covid long term effects. Resumed a normal diet (was keto at the time), drank more water, supplements, got more exercise, etc. Nothing seemed to have an effect, then one day it just went away and I have been back to normal.\n\nObviously I can’t say with certainty that I had Covid, and cant say the brain fog was a lingering effect. It was definitely weird enough for me to look up early signs Alzheimer’s ..... I’m 32.",
            "title_similarity": "0.71871233",
            "sentiment_compound": 0.784
        },
        {
            "id": "gznhmeo",
            "score": 2,
            "text": "Had the same, insane brain fog, can’t concentrate well, and it was worse with glasses on (I’m short-sighted). In sunny conditions it seems like I’m seeing the world with a layer of tinted goo around it. Still happens sometimes during the week. I went did everything kind of test, brain scan mri, ear and throat doctor, all fine. It’s the most annoying thing ever. I think exercise helps though a little.",
            "title_similarity": "0.7161447",
            "sentiment_compound": -0.0498
        },
        {
            "id": "gzniat8",
            "score": 2,
            "text": "I wonder if it's the fevers. I had strep throat in 94 and had days of 100°+F fevers. I hallucinated multiple times before I got a course of antibiotics. This was shortly after the Northridge earthquake and the aftershocks would set off crazy visions of portals to hell. For months following I had issues with multisyllabic words. I simply knew there was a word for the idea I was trying to express but could not recall it. I didn't become inarticulate but I was constantly getting hung up on that feeling that I used to know the words for things and couldn't put it together. It was probably a year or so before I wasn't left feeling that way during complex discussions. Or I got used to being more stupider. It was a weird year.",
            "title_similarity": "0.7671714",
            "sentiment_compound": -0.8553
        },
        {
            "id": "gznilvj",
            "score": 2,
            "text": "I've never heard the term \"long-haulers\" before. Does that refer to people who recovered from COVID-19 more than six months ago?",
            "title_similarity": "0.6267016",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznir1j",
            "score": 2,
            "text": "Trump even had these symptomps long before his infection with covid °~°",
            "title_similarity": "0.45551768",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznizhz",
            "score": 2,
            "text": "I hope research comes out from this in terms of brain fog in general.\n\n\nI've completely given up on ever feeling totally normal again and I don't even have the excuse of covid.\n\n\nThis is coming from someone who still gets 100% bonus / review  + additional merit raises every year in a private company due to good performance.\n\n\nImagine living every second of your like your brain is underwater. The lines start to blur after the years and you don't even know what normal is anymore.\n\n\nDoctors. Specialists. Sleep specialists. Diet changes. No dice.",
            "title_similarity": "0.59528077",
            "sentiment_compound": 0.9217
        },
        {
            "id": "gznj8qi",
            "score": 2,
            "text": "Now how do I know if that's Covid or my ADHD",
            "title_similarity": "0.4307198",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznjnfw",
            "score": 2,
            "text": "Almost reads like the last day of a five day work week @ $14 and hour.",
            "title_similarity": "0.58614093",
            "sentiment_compound": 0.3008
        },
        {
            "id": "gznjqwq",
            "score": 2,
            "text": "I think that I contracted low-symptom COVID at some point and have had brain fog ever since. Is there some way of finding out if I previously contracted it and have healed since? I have had my first vaccine so I'm not even sure if there's a decent way to measure it anymore. \n\nMy head hasn't felt right. It's not *quite* a headache but it's also not right. Dull ringing that seems to be lasting forever.",
            "title_similarity": "0.7106044",
            "sentiment_compound": 0.3412
        },
        {
            "id": "gznkk8h",
            "score": 2,
            "text": "Brain fog? Celiac squad represent! We know what that's like.",
            "title_similarity": "0.15642697",
            "sentiment_compound": 0.4199
        },
        {
            "id": "gznkm8h",
            "score": 1,
            "text": "Have I had COVID-19 my entire life?",
            "title_similarity": "0.3660627",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznkpqc",
            "score": 2,
            "text": "Jokes on covid, iv been like this for years",
            "title_similarity": "0.42763492",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gznkrfc",
            "score": 1,
            "text": "Hah, I dont need covid for brain fog... I mean, oh no..",
            "title_similarity": "0.23541468",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznkuv5",
            "score": 2,
            "text": "semi-related, is it true that in some cases the vaccine has been shown to deplete / help with some of the lasting side effects of covid? i was told this by a friend but brushed it off as some facebook fake post, but i realized a couple months after getting my vaccines that i didn't have any more chest pains (pre-vaxx the pain would be bothersome once or twice a week)",
            "title_similarity": "0.69937867",
            "sentiment_compound": -0.9156
        },
        {
            "id": "gznl7q9",
            "score": 1,
            "text": "I need to show this to my boss",
            "title_similarity": "0.20141813",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznl8td",
            "score": 1,
            "text": "I think I’m experiencing this",
            "title_similarity": "0.050461557",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznle37",
            "score": 13,
            "text": "One thing I've noticed is the inability to get to deep sleep.\n\nI have CFS and a smart watch. At one point I noticed that when I got less than 2 hours of deep sleep at night, I start having the inability to remember what I'm doing while doing a task. I have like a brain lag where I have a hard time pulling up the word I need and I have a pause before I finally get it. Sometimes I don't get it and have to choose something else. Small decisions, like what to make for dinner, are difficult. My reactions are slow.\n\nWhen I got covid, the first thing I noticed was that the cbd I took to help me get deep sleep no longer worked. It didn't matter how much I took. It worked one day, the next day it didn't. I tried cbg too. Nothing. It was December when I had covid but the cbd still doesn't work. I had to get a prescription to help me achieve deep sleep. It doesn't always work and I'm not a fan of the side effects. \n\nMy hope is that one day it will work again. I'm going to try psilocybin for a brain reset at the six month mark to see if that helps.\n\nAnyways this is my anecdotal account that I haven't seen anyone else discuss",
            "title_similarity": "0.68612206",
            "sentiment_compound": 0.821
        },
        {
            "id": "gznlrlw",
            "score": 1,
            "text": "Oh my god. This explains so much. I had the exact same thing",
            "title_similarity": "0.06602467",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gznlt28",
            "score": 2,
            "text": "“Just the flu, snowflakes”",
            "title_similarity": "0.37444252",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gznm1bn",
            "score": 2,
            "text": "I feel as if scientist are rediscovering Fibromyalgia all over again and don't want to acknowledge how utterly inept they are when it comes to a solution",
            "title_similarity": "0.53967035",
            "sentiment_compound": 0.2681
        },
        {
            "id": "gznm9kc",
            "score": 3,
            "text": "I have good days and bad days. The last two days were bad. Falling asleep too easily, can’t remember words, can’t muster up the focus or energy for tasks. It’s like someone switched my multivitamin with a Benedryl. Luckily today is better so I can catch up on all the work tasks I just let drift past me this week. \n\nThe scary thing is I was sub-clinical. I felt lousy in February, but not enough to go to the doctor or get tested (and potentially expose others), and my family members tested negative so I figured it was something else. I haven’t been quite the same since, and lo and behold I tested positive for antibodies. COVID is no joke.",
            "title_similarity": "0.77347016",
            "sentiment_compound": -0.5396
        },
        {
            "id": "gznmxf9",
            "score": 2,
            "text": "Welcome to the world of adhd and depression",
            "title_similarity": "0.45537618",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gznnh5i",
            "score": 2,
            "text": "I wonder if lions mane could help w this",
            "title_similarity": "0.2380496",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gznnvsh",
            "score": 2,
            "text": "I find this interesting because after my second dose of the vaccine, I feel like I had a brain fog for 24 hours. Wonder if it has to due with the immune response, similar to how others get other covid symptoms for a short period after the vaccine",
            "title_similarity": "0.7700045",
            "sentiment_compound": 0.7798
        },
        {
            "id": "gzno41s",
            "score": 2,
            "text": "Is there a remedy for this? I feel like I have this problem from before but it has gotten seriously worse since I got covid last year.",
            "title_similarity": "0.77873313",
            "sentiment_compound": -0.7588
        },
        {
            "id": "gznoj3x",
            "score": 2,
            "text": "I have this right now. I don’t know what is real anymore, because everything just feels like a dream or a simulation. I feel like I’m the only one who’s actually in control, and I constantly feel this pressure in my head that makes me feel like I was in a Get Out like hypnosis. I had none of this before having Covid.",
            "title_similarity": "0.5761924",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gznp8e4",
            "score": 2,
            "text": "I am seeing this with my Mother in law .. suddenly started behaving strange!!",
            "title_similarity": "0.40837222",
            "sentiment_compound": -0.3365
        },
        {
            "id": "gznpfns",
            "score": 1,
            "text": "Anecdotally, I've been suffering from this since covid (early February)\n\nI have about 25% smell - but only certain smells...oddly enough my dog's poop smells like absolutely nothing...but I can smell coffee a bit...yet it smells sweet and different.\n\nI've had chronic inflammation causing an old hip injury to flare up constantly.\n\nBrain fog, fully body fog, and exhaustion 5-6 days a week.  Seems like I get one or two normal days.\n\nMemory issues and difficulty concentrating. To the point where it is depressingly difficult to do my job.\n\nI'd say the symptoms are a 7/10 they significantly impact my life and are well above a placebo.",
            "title_similarity": "0.7319206",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gznpgpj",
            "score": 5,
            "text": "10 weeks after I tested positive and I am still feeling like I am seeing the world from behind some curtain. Sometimes I leave my house and I don't know why, feeling tired all the time. There are days when writing an email is extremely difficult for me. My sinuses are blocked as well which does not help. I am 44 yo, never felt like that before.",
            "title_similarity": "0.7361616",
            "sentiment_compound": -0.4644
        },
        {
            "id": "gznptz3",
            "score": 2,
            "text": "Smokin more weed helped me.",
            "title_similarity": "0.2832173",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznqvw4",
            "score": 2,
            "text": " Hey Reddit I’ve been searching on vaccine information.  I keep getting a lot of flip flopping info. \nCould someone help point this(me) covid long hauler to some information on vaccine side affects positive or negative for people dealing with Long haul issues. \nI’ve been experiencing this for a year now. With added vision issues; eye pressure, eye dominance changes with optical migraines, floaters, auras, light sensitivity, white of the eye changing shape(like a ball point pen poking out from the inside of my eye). I’ve had mri and ct scans and neurologists I’ve been seeing don’t know. \nThanks",
            "title_similarity": "0.67683876",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gznr5c1",
            "score": 3,
            "text": "This is my life. I tested positive in January, and while the majority of my symptoms subsided by April, I am really different from brain fog. It is frustrating and affecting all aspects of my life.",
            "title_similarity": "0.69695485",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gznrp6j",
            "score": 2,
            "text": "What's kinda funny about this to me is that with how severe my ADHD is that's just every day life for me",
            "title_similarity": "0.57473135",
            "sentiment_compound": 0.0018
        },
        {
            "id": "gznt0wu",
            "score": 2,
            "text": "All of you merely adopted the fog; I was born in it, moulded by it. I didn't think straight until I was already a man, by then it was nothing to me but CONFUSING!",
            "title_similarity": "0.46767503",
            "sentiment_compound": -0.6217
        },
        {
            "id": "gznt4dv",
            "score": 2,
            "text": "This is making a lot of sense. I caught covid in April of last year and my doctor has diagnosed me as a “long hauler” because of shortness of breath (I’m only 30 and my symptoms manifested as a stroke more than a respiratory illness) and chronic fatigue. \n\nI had zero issues with breathing while I had covid, but within the past 6 months I have seemed to be so aloof. Forgetting things, not quite as articulate as I used to be…and add all that to the fact that I *already* had congenital heart disease as well as severe clinical depression. These have been the most physically and mentally (and financially of course) exhausting few years of my life. And I’m worried it won’t get any easier.",
            "title_similarity": "0.76056075",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gzntbg6",
            "score": 2,
            "text": "I personally wouldn't be able to tell the difference, because this is one of the wonderful symptoms of PTSD that I already have :')",
            "title_similarity": "0.48989686",
            "sentiment_compound": 0.7906
        },
        {
            "id": "gzntes3",
            "score": 2,
            "text": "I still get brain fog a year later. It's not as bad now, but it's frustrating. Breathing and fatigue issues have gotten way better, thanks to deep breathing exercises. But I'm not where I was pre covid. Not sure if I ever will be.",
            "title_similarity": "0.7147145",
            "sentiment_compound": 0.21
        },
        {
            "id": "gzntnaa",
            "score": 2,
            "text": "Has anyone seen any reliable data on whether or not a vaccinated person who catches covid can develop long haul covid?\n\nFor example, the 8-9 New York Yankees who were all vaccinated caught covid, and were all fine, is it possible for one of them to get the long covid?",
            "title_similarity": "0.53613204",
            "sentiment_compound": 0.2869
        },
        {
            "id": "gznu48p",
            "score": 2,
            "text": "Not surprised about this at all. Covid-19 is in reality a circulatory disease where one mode of infection is respiratory. One this virus hits your circulatory system, game over.",
            "title_similarity": "0.43573046",
            "sentiment_compound": -0.1695
        },
        {
            "id": "gznvmmo",
            "score": 2,
            "text": "What defines  a \"Long-hauler\"?",
            "title_similarity": "0.2577386",
            "sentiment_compound": 0.0
        },
        {
            "id": "gznvnu0",
            "score": 2,
            "text": "I'm not even able to get out of bed most days now. I feel exhausted literally all day long.",
            "title_similarity": "0.6242932",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gznxwyu",
            "score": 2,
            "text": "My wife and I got covid back in oct, wasn't hospital stay levels of bad, but enough to keep us both bedridden for about a week. I suffer from asthma already and my cough and breathing has gotten worse compared to pre covid. My wife got it worse, she still has brain fog to the point where I less she writes things down she forgets them shortly after.  Mainly short term but it's still bad for her and she struggles to remember things from a few days ago.  Or she will constantly repeat herself after telling me things she mentioned earlier in the day. We're only in our mid 40s and ive seen several grandparents and my father suffer and pass from dementia.  I'd this is an indication of what's to come I'll find a way to avoid it",
            "title_similarity": "0.8085269",
            "sentiment_compound": -0.9859
        },
        {
            "id": "gznyh36",
            "score": 2,
            "text": "Very similar symptoms in thyroid auto immune diseases. It’s like our bodies fritz out fighting it off and don’t know how to reset.",
            "title_similarity": "0.6589787",
            "sentiment_compound": 0.296
        },
        {
            "id": "gznzc0p",
            "score": 2,
            "text": "Sounds like another day in the ADHD life.",
            "title_similarity": "0.42110547",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gznzoa2",
            "score": 2,
            "text": "Does anyone have any ideas about how location might affect symptoms?\n\nI believe I experienced a mini-stroke probably from covid in June 2020.  Since then I've had symptoms like occasional tingling or weakness in extremeties (mostly left arm), headaches, pressure in a specific point in my head, a bit of brain fog, fatigue, etc.  Some days not too bad, other days, I just want to lie down all day.\n\nFrom June 2020 until November 2020, I was in Mexico City, and it seemed like symptoms were very bad most days.\n\nFrom November 2020 until February 2021, I was in a few different cities in Brazil along the coast, and I mostly felt great, can only remember 2-3 days with headaches in the whole 3 month period.\n\nFrom February 2021 until April 2021, I returned to Mexico City, and symptoms got bad again, not quite as bad as the first stint in Mx City, but pretty debilitating most days.\n\nSo in late April, I decided to move to Puerto Vallarta thinking that maybe the conditions in Mx City (lots of smog and very high altitude) were to blame, but after about 5 weeks in Puerto Vallarta, it has been mostly the same.  Occasional days with low symptoms, but other stretches with brutally bad symptoms.  So I thought maybe coastal living would be the remedy, but it appears no.  Apparently there was something about Brazil that helped my condition a bit.\n\nSo I'm curious if others have noticed symptoms get better/worse based on certain locations, and maybe there's a pattern we can find.\n\nMaybe we'll have to create a community in Rio de Janeiro with long-haul Covid sufferers!",
            "title_similarity": "0.77737075",
            "sentiment_compound": -0.8931
        },
        {
            "id": "gznzpv2",
            "score": 2,
            "text": "I had chemo. They say chemo brain goes away, but I can still tell after 11 yrs when its lingering chemo brain, not old age",
            "title_similarity": "0.61567926",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo0dpp",
            "score": 1,
            "text": "And breathing. I have those issues too.",
            "title_similarity": "0.2307592",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo0en4",
            "score": 2,
            "text": "This makes a lot of sense. My wife and I got Covid in November, and ever since, she has trouble forming a sentence without losing at least one word. I noticed that I've been habitually filling it in for her, but when I hold back, it becomes a lot more apparent.",
            "title_similarity": "0.66753125",
            "sentiment_compound": -0.0279
        },
        {
            "id": "gzo13ry",
            "score": 2,
            "text": "This may be a stupid comment, but as someone with relatively severe ADHD I experience brain fog quite a lot and recognize myself in these symptoms and I always wonder if it's comparable, if what is happening on a neurological level is somehow related and if there could be some overlap in treatment. I always feel awful reading comments like these and knowing that at least I can take medication to make the symptoms less debilitating. Wishing you guys all the best.",
            "title_similarity": "0.69595194",
            "sentiment_compound": 0.3362
        },
        {
            "id": "gzo14dv",
            "score": 2,
            "text": "Is there any data yet on the possibility of getting long haul symptoms if you get breakthrough covid after getting the vaccine?",
            "title_similarity": "0.46116698",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo154k",
            "score": 2,
            "text": "Thats me. 6 month ago I didnt have a terrible case. Felt like crap for a few days but was able to return to work after my 14 days. I've noticed the foggyness more since covid. That and I'm on reddit a lot more while at work than I ever was also contributing to my loss of productivity.",
            "title_similarity": "0.78017986",
            "sentiment_compound": -0.3011
        },
        {
            "id": "gzo1g9m",
            "score": 2,
            "text": "Does anyone with expertise have a rationale for this? Like is it something unique about SARS-CoV-2, such as it’s mechanism of attack or spike protein? Or is it just more related to the severe illness in those *specific* people?",
            "title_similarity": "0.56093776",
            "sentiment_compound": -0.724
        },
        {
            "id": "gzo1krz",
            "score": 2,
            "text": "Soooo what I’ve been struggling with since I was 21? Chronic fatigue syndrome ? Hopefully they’ll keep doing more studies so it can help them and us plagued with these weird chronic illnesses",
            "title_similarity": "0.679792",
            "sentiment_compound": -0.5262
        },
        {
            "id": "gzo284b",
            "score": 2,
            "text": "I've seen this first hand.\n\nThere's a patient who comes into the practice I work at. One of the most eloquently speaking people I've met. Really smart guy. A Real-estate agent. Genuinely friendly and chatty.\n\nSaw him just before COVID lock down hit. He came back 9 months later for a 3 month follow up from his hospital stay due to a bad COVID infection.\n\nHe was stuttering. He'd stop half way through sentences because it would take him at least 15-20 seconds to say the word he wanted to say. The frustration and hopelessness in his eyes broke me. I had to walk to the bathroom to have a quiet cry after he left.",
            "title_similarity": "0.7304411",
            "sentiment_compound": -0.8887
        },
        {
            "id": "gzo2pgo",
            "score": 2,
            "text": "Is there any evidence that COVID vaccines could cause CFS?   I’m totally pro-vaccine, and have had my two jabs, but I’ve been feeling exhausted since the last one.",
            "title_similarity": "0.6093726",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzo2pso",
            "score": 2,
            "text": "I already have brain fog and memory issues from my medication. That's why I'm terrified of getting covid. Doubling down on those problems might make me completely unable to function in my daily life.",
            "title_similarity": "0.71004856",
            "sentiment_compound": -0.7717
        },
        {
            "id": "gzo2wxh",
            "score": 2,
            "text": "My cousin and his gf had COVID about half a year ago. We got to see them during Easter luckily and my gf asked how it was having it. My cousin replied with it being the worst flu he has ever had, loss of smell and taste, and has this sense of fogginess in his head (brain fog).\n\nHe committed suicide less than a month ago.",
            "title_similarity": "0.7057849",
            "sentiment_compound": -0.8442
        },
        {
            "id": "gzo35zo",
            "score": 2,
            "text": "How is this quantified or is it purely patient testimony? Someone pointed out that the symptoms are identical to chronic fatigue syndrome. Is it possible that something else is causing the symptoms and it's just being attributed to covid?",
            "title_similarity": "0.49999487",
            "sentiment_compound": -0.3313
        },
        {
            "id": "gzo3e1u",
            "score": 2,
            "text": "Is there any correlation between severity of covid and this brain fog? \n\nAsking for someone who was asymptomatic but now uses this every time they forget to do something....",
            "title_similarity": "0.6709656",
            "sentiment_compound": -0.3291
        },
        {
            "id": "gzo3zg0",
            "score": 2,
            "text": "When I got covid I definitly felt absent-mindedness. It was fuckin crazy. Like my consciousness just disappeared or went blank sometimes",
            "title_similarity": "0.5724133",
            "sentiment_compound": -0.2058
        },
        {
            "id": "gzo4ba1",
            "score": 2,
            "text": "How can this be improved?",
            "title_similarity": "0.18028532",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzo4wo6",
            "score": 2,
            "text": "I would like to know how this was compared with the general population. I think a lot of us are feeling some of these things, even without having had covid, after the last year of isolation and restrictions.",
            "title_similarity": "0.6690023",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzo4xn1",
            "score": 2,
            "text": "I think it is a very good thing in that this is being studied!\n\nOn that note, it sure would be nice if attention was also being directed towards the exact same brain fog symptoms that those of us with auto immune system disorders have been, and still are, experiencing.\n\nSoap box rant over.",
            "title_similarity": "0.46282813",
            "sentiment_compound": 0.8118
        },
        {
            "id": "gzo52nr",
            "score": 2,
            "text": "I had COVID in September of last year. I had a lot of symptoms including no taste or smell, but the most notable symptom I had was a headache that lasted me almost 4 weeks straight. I used to suffer from migraines earlier in my life, those went away years ago. This was different, just a stubborn and consistent headache. Since then I have had problems with comprehension, keeping focused/on track and I will sometimes forget what I'm doing or where I'm going in the middle of things.\n\nThis is highly distressing as up until now I have been a very healthy person. I've never had problems with health, especially with mental dexterity which is now such a challenge at times.  I wonder if anyone else with long-haul COVID experienced a headache that lasted for upwards of a month before having mental lapses/challenges.",
            "title_similarity": "0.76221776",
            "sentiment_compound": -0.8887
        },
        {
            "id": "gzo5ns3",
            "score": 1,
            "text": "I got that, and coupled with my ADHD I really struggle to function.",
            "title_similarity": "0.6012322",
            "sentiment_compound": -0.3804
        },
        {
            "id": "gzo5qy2",
            "score": 2,
            "text": "I have had CFS/ME/CIDS/SEIDS, whatever you want to call it, for two years. I don’t know why these guys are still being called Covid Long-Haulers, they are CFS sufferers. Brain fog sucks.",
            "title_similarity": "0.741217",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzo62xb",
            "score": 2,
            "text": "Yup,  my friend is experiencing all this",
            "title_similarity": "0.12789448",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzo81yv",
            "score": 2,
            "text": "Remember when you couldn't remember when?",
            "title_similarity": "0.27661186",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo8avj",
            "score": 2,
            "text": "My dad experienced this. He’s all better now though but it was scary in those first couple months...",
            "title_similarity": "0.6900328",
            "sentiment_compound": -0.5187
        },
        {
            "id": "gzo8hwb",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.22116542"
        },
        {
            "id": "gzo90qd",
            "score": 1,
            "text": "Its been like being sleep deprived regardless of how much sleep Ive gotten off and on for weeks since last year. The brain fog has felt like Ive been awake three days at times.",
            "title_similarity": "0.6987308",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzo93uk",
            "score": 2,
            "text": "Sounds like my MS symptoms",
            "title_similarity": "0.32741702",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzo9dqo",
            "score": 2,
            "text": "So it’s lasting effects are ADHD? Noice",
            "title_similarity": "0.42350388",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoaar2",
            "score": 2,
            "text": "I am a \"long hauler\" or Post Covid Syndrome sufferer. I've been unable to work since December, primarily due to fatigue, but also as an Air Traffic Controller, the brain fog is straight up dangerous. Most of the time I don't have a big issue with brain fog, but as soon as I start to construct sentences involving anything more than low level social chit chat then either individual words, or absolutely everything I was talking about just fall out my head into a void. I have to back track to the last known concept and reconstruct what I was talking about.",
            "title_similarity": "0.73985225",
            "sentiment_compound": -0.7945
        },
        {
            "id": "gzobbny",
            "score": 2,
            "text": "These same symptoms have been affecting herpes sufferers for decades. Nobody takes people with herpes seriously.",
            "title_similarity": "0.6406516",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gzocj27",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.22116542"
        },
        {
            "id": "gzocniw",
            "score": 2,
            "text": "I've been pulled out of school by my therapist for this exact thing.",
            "title_similarity": "0.44794187",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzodnun",
            "score": 2,
            "text": "Depression prepared me for this",
            "title_similarity": "0.4618808",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzoe6z4",
            "score": 2,
            "text": "I had covid in november, and have had memory issues since. I often go to the store and forget what i came for ( with a list) i love to read and find it hard to concentrate. I can also be watching tv and forget something minuted after i've seen it. I often forget words. It is so frustrating. I had hoped it would get better.",
            "title_similarity": "0.64456904",
            "sentiment_compound": 0.2165
        },
        {
            "id": "gzoe8hm",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.18108168"
        },
        {
            "id": "gzoecyv",
            "score": 2,
            "text": "Oh god, maybe it's because of my ADHD but I already have 2 of these 3 symptoms. I'd hate to think getting COVID could make it even worse. I made the right move staying a shut-in for the past year.",
            "title_similarity": "0.6894182",
            "sentiment_compound": -0.8641
        },
        {
            "id": "gzoeh4c",
            "score": 2,
            "text": "It's not fun. Lately, I've been forgetting things in the bottom of my shopping cart. I get home, realize didn't I buy X? and then heading back to the store. Hard to concentrate on things I should be learning to help my job, reading comprehension doesn't seem up to snuff. I need to exercise more, but bad knees keep me from doing a lot.",
            "title_similarity": "0.59016234",
            "sentiment_compound": -0.7483
        },
        {
            "id": "gzoepvp",
            "score": 1,
            "text": "Would this apply to those who were vaccinated also?",
            "title_similarity": "0.28988293",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoer9e",
            "score": 1,
            "text": "Could also be symptoms of just being away from people for so long",
            "title_similarity": "0.49713698",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzof1ql",
            "score": 1,
            "text": "I’m sure this will be buried but hopefully it helps someone. I had a mild case almost a year ago and am still having brain fog and anxiety. It was only helped (and cured from what I’m a seeing now) when my doctor gave me some PTSD medication (Venlafaxine). It’s helped so much that I really don’t want to go off of it.",
            "title_similarity": "0.67815816",
            "sentiment_compound": 0.8135
        },
        {
            "id": "gzog2bk",
            "score": 2,
            "text": "Absolutely! I’ve been fighting it by playing games and using Elevate, but I can’t find words to string together a sentence under pressure. They’re banging the drum to stop unemployment and my efforts at interviewing are falling way short. I’m scared.",
            "title_similarity": "0.5997335",
            "sentiment_compound": -0.9385
        },
        {
            "id": "gzog5xo",
            "score": 1,
            "text": "Since having covid in December, I had a little brain fog, nothing too bad. But more importantly I seem to have developed a slight stutter. It usually only happens when I’m excited and trying to get something out quick.",
            "title_similarity": "0.6254526",
            "sentiment_compound": 0.7472
        },
        {
            "id": "gzog801",
            "score": 2,
            "text": "I had gotten COVID in December of last year, I lost my taste and smell until February. When it did come back everything smells and tastes sickly sweet. My favorite thing to drink was coffee prior to COVID. I used to beable to distinguish the different flavor profiles of the grind and the flavor of the roast but now it all tastes foul. A common occurrence of things not smelling correct would be body wash and shampoo, normally smelling like “fresh meadow” or whatever old spice smell, now all smells like the unidentifiable overpowering sweet smell. The best I can describe it would be a thick heavy burnt caramel. Overall it really sucks.",
            "title_similarity": "0.6502714",
            "sentiment_compound": 0.9429
        },
        {
            "id": "gzogtz0",
            "score": 1,
            "text": "Sounds like my chemo brain",
            "title_similarity": "0.3552183",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzohqk4",
            "score": 5,
            "text": "Too many people died and way too many are going to have chronic illness because some of you had to be dumb and selfish.",
            "title_similarity": "0.6465248",
            "sentiment_compound": -0.9136
        },
        {
            "id": "gzojbug",
            "score": 2,
            "text": "My wife and I had COVID in early November. It took until very early February for the brain fog to lift, for her.  She *still* doesn't fully have her sense of taste/smell back, and deals with some lingering fatigue.",
            "title_similarity": "0.70826554",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzojrbg",
            "score": 2,
            "text": "Are there any long hauler studies that show the percentage chance of being a long hauler if you contract covid-19.",
            "title_similarity": "0.46971095",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzokd2l",
            "score": 2,
            "text": "Never had Covid, but I've been getting these symptoms for years now. It's probably one of the most annoying things that can happen to you.",
            "title_similarity": "0.70257765",
            "sentiment_compound": -0.611
        },
        {
            "id": "gzol7l1",
            "score": 2,
            "text": ">This including trouble forming words, difficulty focusing and absent-mindedness.\n\nWelcome to my ADHD world.",
            "title_similarity": "0.56939024",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzolcha",
            "score": 2,
            "text": "The brain fog that I had is mostly gone now about 7 months later. Still get it a little when I drive at times.",
            "title_similarity": "0.6872325",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzon4ns",
            "score": 2,
            "text": "Is there a link to the actual study?",
            "title_similarity": "0.21783073",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzon5rl",
            "score": 2,
            "text": "My dad is in this group. He says he is slowly getting better, but it is going to take a long time to get back to normal, if he ever does. This guy used to be able to fall asleep at 10, wake up at 5, work a full day, and still needed stuff to do around the house to keep himself occupied.\n\nNow it’s bed by 7:30-8, works most of the day but he admits his head isn’t all there in the afternoons, then he can’t quite keep the energy up to putz around on home projects.\n\nNot fun to see happen to someone.",
            "title_similarity": "0.6798419",
            "sentiment_compound": 0.5011
        },
        {
            "id": "gzonjuw",
            "score": 2,
            "text": "Right or wrong, real or imagined, we (the world) are in for a lot of disability claims for the next 60+ years.\n\nNote I am not saying anyone is being untruthful at all.",
            "title_similarity": "0.5489298",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzoo6na",
            "score": 2,
            "text": "My mom at 73 contracted Covid and I swear it's aged her 10+ years cognitively.  It's really been difficult for her. I catch her staring off trying to refocus and trying to remember what she wanted to say.",
            "title_similarity": "0.7159473",
            "sentiment_compound": -0.4549
        },
        {
            "id": "gzoojil",
            "score": 2,
            "text": "Is it weird that I feel like this after the JJ vaccine?",
            "title_similarity": "0.49852222",
            "sentiment_compound": 0.5473
        },
        {
            "id": "gzop289",
            "score": 2,
            "text": "It wouldn't be /r/science if half the comments weren't removed.",
            "title_similarity": "0.46864885",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzop8kv",
            "score": 1,
            "text": "I was hospitalized for Covid last spring.  I got to experience the ventilator for about 2 weeks, so yeah I almost died. \n\nI have issues with brain fog.  Based on recent testing, I probably lost quite a bit of my cognitive ability.  Whether directly from the virus or the associable anoxic event, this disease has hurt me.  This damned thing has caused mental health issues and I am trying to get better.  There isn't a lot of help out there.\n\nTo those who have been hurt by this, just keep going and doing what you can.  None of us deserved this, but it is our lot in life now.  Know that you are not alone in this.  Educate yourself and keep persevering.",
            "title_similarity": "0.7691806",
            "sentiment_compound": -0.1306
        },
        {
            "id": "gzoq5ex",
            "score": 1,
            "text": "Is the same the case with the vaccine?",
            "title_similarity": "0.24051267",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoq9hc",
            "score": 2,
            "text": "Wow. I had a 3.8 GPA coming into this semester, and I'm struggling like crazy. My grades are right around the line between b and c. I just can't seem to focus, I keep forgetting assignments and deadlines, super out of character for me. My work has been off as well, making little mistakes that should he no brainers. I never connected the dots, but I got covid last year, and these problems started just after I got over it. Crazy.",
            "title_similarity": "0.7424315",
            "sentiment_compound": -0.649
        },
        {
            "id": "gzoqf5r",
            "score": 1,
            "text": "Oh wow my friend have this and he described it. I thought he was special.\n\nI didn't realize how prevalent it is. He works in Orange Country. It is like California's capital of Karens.",
            "title_similarity": "0.32828578",
            "sentiment_compound": 0.9042
        },
        {
            "id": "gzor0a6",
            "score": 1,
            "text": "As a person that already suffers from brain-fog, this scares me.",
            "title_similarity": "0.58888775",
            "sentiment_compound": -0.705
        },
        {
            "id": "gzosbrs",
            "score": 1,
            "text": "What’s the solution or cure",
            "title_similarity": "0.14763552",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzosl1h",
            "score": 1,
            "text": "Fantastic. I have often found myself staring at a blank screen until the computer goes to sleep and startles me. Great to hear this can get worse.",
            "title_similarity": "0.64153236",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gzosqo2",
            "score": 1,
            "text": "just what this world needs, more brain fog.",
            "title_similarity": "0.30464298",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzot4of",
            "score": 1,
            "text": "Ahh... well that explains alot",
            "title_similarity": "0.042573027",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzotvoz",
            "score": 1,
            "text": "Brain fog after having covid is so much worst for me. There are days I can’t recall simple words.",
            "title_similarity": "0.78515506",
            "sentiment_compound": -0.6573
        },
        {
            "id": "gzou5jv",
            "score": 1,
            "text": "So I’m just learning about this “long haul” stuff. I’m 3 months removed from my C19 positive test and I still have weird symptoms. I was never hospitalized but I had a kidney infection, lung infection, anemia, and other major issues during the first two weeks of testing positive. Those seem to go away with treatment, but I’m left with the brain fog, fatigue, a bunch of weird things like tingling on my tongue, trouble sleeping, low immune response to infections, and nerve issues. I’m super over it. My husband was positive at the same time and his was a week then done. I had a blood test done and it looks like being vitamin D deficient might have played a role in my long haul.",
            "title_similarity": "0.7115289",
            "sentiment_compound": 0.9737
        },
        {
            "id": "gzov26p",
            "score": 2,
            "text": "Purely anecdotal but I have experienced all of these since November and I had an extremely mild case of the virus.",
            "title_similarity": "0.5481827",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzovqx6",
            "score": 2,
            "text": "I’m 24 and had a rough case of Covid in December. Have asthma, so it hit me hard and my lungs didn’t feel normal til about the beginning of this month. The brain fog is real. Even now I find myself mixing up words like I never have before. Gotta tell myself it’s not Covid related though. It became discouraging and depressing dealing with all of the symptoms for so long.",
            "title_similarity": "0.82161844",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzow2so",
            "score": 2,
            "text": "THIS! Had covid back in January. I feel like my cognitive function is getting worse.",
            "title_similarity": "0.70898175",
            "sentiment_compound": -0.2244
        },
        {
            "id": "gzowmwi",
            "score": 2,
            "text": "My memory wasn't perfect before catching Covid-19, but I've found my memory to be incredibly unreliable now. I have a hard time remembering the names of famous actors/singers that I like, family members I see often, or coworkers I see almost every day. Even basic information from my degree is becoming increasingly difficult to remember and it is incredibly basic stuff that I'm forgetting.",
            "title_similarity": "0.7046585",
            "sentiment_compound": -0.3816
        },
        {
            "id": "gzox7ym",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.22116542"
        },
        {
            "id": "gzoxvcg",
            "score": 1,
            "text": "Should be motivation to Vax.",
            "title_similarity": "0.17813237",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzoy7ha",
            "score": 2,
            "text": "There is a phase 1 fda trial of Pro-140 (Leronlimab) with results due this summer. Anecdotal reports of participants who think they got the drug (double blinded) are astounding. The theory is that the brain fog is ongoing neurological inflammation from rantes. I have two patients who I am trying to get enrolled in the next trial who have severe neurological issues post Covid.",
            "title_similarity": "0.67098176",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gzozm6s",
            "score": 2,
            "text": "Is this linked to the blood clotting issue? This seems to mirror the symptoms of a minor stroke.",
            "title_similarity": "0.47482297",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzozmvr",
            "score": 2,
            "text": "My dad is a covid long hauler.\n\nHe has a speech therapist for his stutter. \nHe has a physical therapist for his dizziness. \nHis memory lapses have become the butt of everyone's joke. \nHe used to go to the hospital almost daily due to panic attacks. \n\n\"But only 1% of people die\"",
            "title_similarity": "0.7181771",
            "sentiment_compound": -0.8537
        },
        {
            "id": "gzp2fe1",
            "score": 1,
            "text": "Yeah sure it's just like the flu and was never modified in a lab",
            "title_similarity": "0.31201363",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzp38bi",
            "score": 1,
            "text": "Glad Brain Fog is finally getting recognized somewhat on a worldwide scale. Have had for 2 years so far and it sucks. I actually found out I had brain fog because of hearing it on the news and researching the term. I just summed it up to be anxiety.",
            "title_similarity": "0.6884134",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzp3tzk",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.22116542"
        },
        {
            "id": "gzp4n21",
            "score": 2,
            "text": "In COVID the mechanism sort of makes sense -- microvascular damage to small blood vessels, which we know the virus affects. So it's probably a similar mechanism to like a very mild vascular dementia. Only question is whether it will improve, stay the same, or progress later on.",
            "title_similarity": "0.52526087",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzp4nc2",
            "score": 2,
            "text": "I’m pretty sure I had covid in July. The last few months I’ve had the worst time saying the right words in sentences. Ex. I want to ask my kid if they want a piece of cake, but instead I’ll say something like Do you want a carrot? I thought of cake, pictured cake but said carrot. Some days I’ll mess up 5-10x and some days none. This has me worried!",
            "title_similarity": "0.6760924",
            "sentiment_compound": -0.2598
        },
        {
            "id": "gzp5n55",
            "score": 1,
            "text": "So it's going to make the people who refuse the vaccine even dumber than they already are.",
            "title_similarity": "0.60932744",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gzp5u4u",
            "score": 1,
            "text": "Damn, that's rough. Covid caused lotsa damage to the majority of my vital organs, but as far as I can tell my neurological function remains unimpaired. I guess I'm one of the lucky ones after all...",
            "title_similarity": "0.62858474",
            "sentiment_compound": 0.3291
        },
        {
            "id": "gzp8jqf",
            "score": 1,
            "text": "I had Covid. I stutter a lot more but that’s kinda it, but it’s still brain damage",
            "title_similarity": "0.68831027",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gzp9npy",
            "score": 1,
            "text": "Another fun thing is your sense of taste seems to change. Absolutely hated mustard before…now I love it. Used to prefer Mayo and detest Miracle Whip, that flip flopped. Can’t stand overly floral smells anymore as they now give me a headache.",
            "title_similarity": "0.56069314",
            "sentiment_compound": 0.7787
        },
        {
            "id": "gzp9o9b",
            "score": 2,
            "text": "One of my friends works for the health service and has told me of the varying symptoms and conditions that long covid can have and that they have dealt with. Lung damage, ulceration of the throat in relatively “young and healthy” people. Its such an unknown and should not be taken lightly.",
            "title_similarity": "0.6338402",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzpc3v3",
            "score": 2,
            "text": "I had COVID in early February and noticed neurological dysfunction after the respiratory issues subsided. The neuro stuff was so bad that I thought I had early onset dementia and got a neuro-psych workup before I lost my private insurance (I was fired for \"excessive absences\" the week before the US went into lockdown). My mental health tanked and I was unable to get an appt with a psychiatrist or counselor until late summer. It was The Worst.\n\nI also have ADHD and I am in grad school. The neuro symptoms made the ADHD worse and my usual compensatory tactics were no longer as effective. I could read a page in a textbook and recall nothing. It took me 2-3 days to write a short paper when usually it takes one. I experience aphasia several times a day. Executive functioning was awful. The brain fog still persists even though it's not as bad as it was last spring. I recently began taking a low dose of Ritalin and it's helped my symptoms somewhat.",
            "title_similarity": "0.8010882",
            "sentiment_compound": -0.9672
        },
        {
            "id": "gzpcwy0",
            "score": 2,
            "text": "The brainfog I experienced from covid was traumatizing for me. I have ADHD, I had 2 dental abscesses and one flared up when I had covid and the combination of things made me feel like I had lost my mind. Scariest experience of my life.",
            "title_similarity": "0.7785699",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzpdw4b",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.22116542"
        },
        {
            "id": "gzpfd7d",
            "score": 2,
            "text": "I thought it was just me. It’s crazy how it’s worse now than it was in December when I had it. I feel like I’m screwed .",
            "title_similarity": "0.7033032",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gzpg3f2",
            "score": 1,
            "text": "Had the brain fog for almost a year but it actually has gone away since i got my vaccination.  Not sure if its from the shot or it just finally cleared up but i’m so grateful it did",
            "title_similarity": "0.62051606",
            "sentiment_compound": 0.6658
        },
        {
            "id": "gzphebl",
            "score": 2,
            "text": "I wish people who don’t take Covid seriously would realize that just because there is a high survival rate doesn’t mean it’s completely harmless.",
            "title_similarity": "0.48450875",
            "sentiment_compound": 0.5095
        },
        {
            "id": "gzpi4xj",
            "score": 2,
            "text": "Reddit has really been a great help to me. At times I felt like I was going insane. I had the dizziness and the vertigo , mainly at night when I would try to sleep. Now I just don’t feel sharp, it’s hard to do difficult thinking procedures at work. I also quit drinking because I felt drunk every night for months. I don’t think I’ll be going back to my old ways. People say I’m not fun anymore, they don’t even know what’s going on. This virus is a mother, it has taken and ruined many lives",
            "title_similarity": "0.7424859",
            "sentiment_compound": -0.5004
        },
        {
            "id": "gzpj7h5",
            "score": 3,
            "text": "I'm a bit over a year out and still feel this way.",
            "title_similarity": "0.35781035",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpl20k",
            "score": 2,
            "text": "My stutter is back (had COVID) and worse than ever.",
            "title_similarity": "0.6435214",
            "sentiment_compound": -0.6249
        },
        {
            "id": "gzpnhv4",
            "score": 1,
            "text": "Is there a CV19 vaccine subreddit?",
            "title_similarity": "0.30304712",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpnnql",
            "score": 1,
            "text": "Has there been any cases of long-haul Covid in break through cases (ie folks who got Covid even after being vaccinated)?",
            "title_similarity": "0.5558824",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpp5au",
            "score": 2,
            "text": "I contracted covid on April 9th. One month (2 week safe period) after getting both doses of the Pfizer vaccine. I have a few autoimmune diseases so I ended up getting the antibody infusion. Felt better after that but the brain fog didn’t go away. I have been in what feels like being inside a cloud since April 9th. I have gone to multiple doctors to try and figure out why I feel like this and all of my tests and labs have come back normal. Every single task is difficult, sometimes even waking up. I was talking to someone about this exact thing today! So interesting!",
            "title_similarity": "0.6857445",
            "sentiment_compound": 0.9095
        },
        {
            "id": "gzpq321",
            "score": 1,
            "text": "I don’t know if this has been asked already, but do you know if the COVID that we can get from vaccinated people is less invasive than the COVID from unvaccinated ones?",
            "title_similarity": "0.4878775",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpxon2",
            "score": 1,
            "text": "This is an attack on consciousness.",
            "title_similarity": "0.2860099",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzpz115",
            "score": 1,
            "text": "I’ve been in and out of my doctors office for what I thought was my ADHD exacerbated ten fold by something or another. I absolutely CANNOT focus. I forget everything if I don’t set a reminder in my phone. Drive 35 miles and not remember the drive. \n\nI’ve switched meds twice. Talked to a few different therapists. Introduced “new” coping methods. I’m at my wits end with it. Nothing is helping. My job requires serious amounts of tedious attention. It’s affecting my life and livelihood negatively.",
            "title_similarity": "0.71372163",
            "sentiment_compound": 0.0716
        },
        {
            "id": "gzq49fp",
            "score": 1,
            "text": "Is there a way to get easily tested to accurately see if I contracted COVID? I have this fog and could swear I had COVID in late December prior to it being officially found in the states... obviously I didn’t know this was possible or knew the symptoms back then but the more I hear about long term effects the more I’m seeing similarities",
            "title_similarity": "0.6718875",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gzq925v",
            "score": 1,
            "text": "Also sounds also like symptoms of a parasitic worm and/or fungal infection. Just because someone had or has COVID doesn't mean one should assume that it is the only illness they're coping with.\n\nNot saying this is the case for everyone with \"long-haul COVID\" but from what I have experienced, extremely negative reactions to CoV-2 is often a result of compound illnesses.\n\nIf this is what you or someone you know is experiencing, don't panic and contact a doctor and get your hands on fluconazole (CanesOral, also many off-brand versions) for fungal infections and pyrantel pamoate (Combantrin) for worm parasites. Both are available without prescription.\n\nI recommend treating worms before a fungal infection if you suspect or confirm you have both. Always read the label and instructions that come with the medication, and please consult your doctor if you or anyone you are treating has underlying health conditions such as kidney, liver, lung or heart disease. Older folks and children might need to split their dosage and consume over a longer period of time (12-24 hours). Do not force someone to take more medicine than they are comfortable taking but to cure the disease a full dose must eventually be consumed. Combantrin can cause quite the rash and other side effects when the worms are present in your body. Stay hydrated and take with food.\n\nTreat your whole household (including pets)--these are communicable diseases. Be extra clean around the house and only wear clothes once before washing until cured. All laundry but especially bedding, towels and underwear need to be washed in warm to hot water with detergent as well as a bleaching or disinfecting additive (OxyClean, Resolve, chlorine bleach or similar).",
            "title_similarity": "0.61439013",
            "sentiment_compound": 0.9174
        },
        {
            "id": "gzqhs3y",
            "score": 1,
            "text": "How vague. How do you measure “brain fog”?",
            "title_similarity": "0.39420497",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzqkjw9",
            "score": 2,
            "text": "Its good to see people recognising the truth of this.\n\nI am not bitter, its just my life was wasted, thrown under the bus of ignorance. If you multiply my case by the number of longcovid cases we have a serious economic problem and that is before you consider the humanity of the situation.\n\nI hope the numbers of people affected translate into better support for longcovid than I had for ME CFIDS after EBV - which lead to immune dysfunction involving recurring viruses - significant brain fog was part of that.\n\nIn 1988 I could not remember three digits from a phone number long enough to dial them. One number at a time was all I could manage but usually ran out of time to enter the whole number, usually took a few practice goes, even with the number written down on a piece of paper, strategically placed right next to the keypad.\n\nHad to abandon my involvement in acting because I could not remember the lines. Short term memory is the neurological gateway to long term and it was shot to hell. Didnt have the strength left to get involved in production either so bye-bye Miss American pie.\n\nI also have a bioscience degree from a reasonably well regarded academic institution known as Oxford University but that didnt help, was so befuddled I had no clue what was happening, could not add value in a job or cope with one without getting iller and just did voluntary work on the dole for years trying to work it out.\n\nNobody and I mean nobody medical was willing or able to recognise my condition or offer help until I had been ill for 10 years by which time it was too late and my fate was sealed, whereas better recovery might have been possible if I had not mismanaged my condition so badly through ignorance in the first few years.\n\nOne doctor even told me \"that doesn't happen\"... but it does.\n\nLets hope this changes with the recognition of longcovid as a reality.",
            "title_similarity": "0.64107823",
            "sentiment_compound": -0.9631
        },
        {
            "id": "gzqktui",
            "score": 3,
            "text": "Oh look, it's my life since Feb 2020.\n\n-_-",
            "title_similarity": "0.21365345",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzr61wa",
            "score": 2,
            "text": "Sort of expected from a disease that messes up with oxygen absorption.",
            "title_similarity": "0.4675683",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrbj6l",
            "score": 1,
            "text": "Not good.  Nourish your bodies.",
            "title_similarity": "0.28072798",
            "sentiment_compound": -0.3412
        },
        {
            "id": "gzrkgv6",
            "score": 1,
            "text": "I had my thyroid ablated (radiated to remove.) I was one of the rare people who couldn’t break down the T4 thyroid supplement and it wouldn’t go through the brain barrier causing really bad brain fog. Imagine suddenly not being able to do simple math or remembering how to get to any destination? Brain fog can severely impact your daily life. It feels like when a word is on the tip of your tongue but it just won’t come out…but it is your entire brain function.",
            "title_similarity": "0.65369594",
            "sentiment_compound": -0.4398
        },
        {
            "id": "gzsbbsi",
            "score": 1,
            "text": "Nah, it's just my overpowering disassociation because the world kind of sucks.",
            "title_similarity": "0.51220465",
            "sentiment_compound": -0.4927
        },
        {
            "id": "gzt4hn2",
            "score": 1,
            "text": "Since most people who get covid are Republicans, how certain are we that they didn’t have brain fog before getting covid?",
            "title_similarity": "0.48707914",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gztcb30",
            "score": 1,
            "text": "My post COVID Syndrome has been going on since I contracted it in April 2020 and than went into insane mode after the second vaccine. Fear not, I am a super pro-vaccine person and almost got into a fist fight about it once. Anyway, daily migraines that are crippling are the worst, joint pain, occasional dizziness, and all the symptoms of brain fog are a typical Tuesday for me. University of Pennsylvania has a post-COVID syndrome clinic but I can only get a virtual appointment and that’s July 29. Sometimes al you pray for is less (not even completely) but simply one day you will have manageable pain",
            "title_similarity": "0.7106259",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h07arlp",
            "score": 1,
            "text": "The  months after I \"recovered\" from COVID have been terrible and I'd say worse than having COVID in my case. I'm constantly spacing out, becoming forgetful, it's been a challenge to focus on things, and sometimes I just can't get the words I want to say out. Recently I was diagnosed with sleep apnea, so I'm wondering if COVID just made it worse and amplified it for me. I say that because I've had this brain fog, but post COVID, it's been much worse.",
            "title_similarity": "0.84288275",
            "sentiment_compound": -0.8608
        },
        {
            "id": "h12guuk",
            "score": 2,
            "text": "Does anyone know if there's any word from an expert or literature out there emphasizing the importance of early diagnosis for cognitive impairment linked to Covid? I know this is the case with CI that acts as a transitional stage before dementia, but I'm wondering if there's anything specific to Covid in this regard.",
            "title_similarity": "0.5389633",
            "sentiment_compound": 0.1901
        },
        {
            "id": "h76lsx4",
            "score": 1,
            "text": "Yes. Psychosomatic disorders are difficult to get rid of.",
            "title_similarity": "0.5357235",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hdtz9eh",
            "score": 1,
            "text": "6 mos out and I have lupus symptoms along with this. Another trip to doc for bloodwork. I don't know anymore. Sometimes pages of a book or internet turn into word-soup. I'm on supplements, a medication or two, but when it stops varies from one person to the next.",
            "title_similarity": "0.66526484",
            "sentiment_compound": -0.2263
        }
    ]
}