{
    "Approximately one-third of all U.S. counties do not exempt grocery foods from the general sales tax, which means the lowest-income families living in those areas are most susceptible to food insecurity. New research finds even a slight grocery tax-rate increase could be problematic for many.\n": [
        {
            "id": "gzo2f4h",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.39669162",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gzou91j",
            "score": 2,
            "text": "Take a look at Alabama’s sales tax rate.  Super high, and the property tax rate is super low.  It’s designed to screw low income folks.",
            "title_similarity": "0.6746464",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzo71g9",
            "score": -9,
            "text": "Or make sure people are paid enough salary to afford food..",
            "title_similarity": "0.44167557",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzp4gld",
            "score": 1,
            "text": "Great!\n\nYou all are going to volunteer for political campaigns to elect members to your state legislators who will protect and expand your state's income tax so that our public institutions rely less on sales taxes, right?\n\nYou're definitely going to do that, RIGHT??????",
            "title_similarity": "0.5547596",
            "sentiment_compound": 0.9178
        },
        {
            "id": "gzp32pf",
            "score": 1,
            "text": "Taxes hurting the poor more than helping? Gee, It's like I've been saying this for my whole life",
            "title_similarity": "0.5861238",
            "sentiment_compound": -0.2075
        },
        {
            "id": "gzp6mzn",
            "score": 0,
            "text": "They can always price shop on their new iphone.",
            "title_similarity": "0.28213263",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp61fg",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "0.10927044"
        },
        {
            "id": "gzo9iag",
            "score": 1,
            "text": "Move to NJ. We don't tax food.",
            "title_similarity": "0.36960274",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzom8sz",
            "score": 2,
            "text": "I was shocked upon discovering when I moved to Mississippi that they taxed groceries.\n\nHaving lived here a while now, I am no longer even surprised.",
            "title_similarity": "0.563962",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzoc9hr",
            "score": 10,
            "text": "From what I read they are assuming households earning $30,000 per year or less are spending about $7000 per year in groceries. Either they are vastly over estimating grocery costs or they are including significant amounts of non-essential food products. The lower the income and larger the household then the higher the SNAP benefits as well. Personally I've seen over $600 per month in SNAP benefits for a family of 4 with a single parent. I doubt the validity of a study that doesn't justify the assumptions it makes.",
            "title_similarity": "0.82559776",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzp52ts",
            "score": -5,
            "text": "Sales tax is regressive and shouldn't be a thing",
            "title_similarity": "0.49598902",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzo4y5b",
            "score": -8,
            "text": ">Approximately one-third of all U.S. counties do not exempt grocery foods from the general sales tax, which means the lowest-income families living in those areas are most susceptible to food insecurity. \n\nNow there's some flawed logic.  This implies that in the 2/3 of counties which don't have sales tax on food, the lowest income families there are not the most susceptible to food insecurity.  Apparently the wealthy are the ones starving there, or some such thing.",
            "title_similarity": "0.96973103",
            "sentiment_compound": -0.8978
        },
        {
            "id": "gzp867u",
            "score": 0,
            "text": "Food is so expensive... especially if you want to actually eat healthy....",
            "title_similarity": "0.52294147",
            "sentiment_compound": 0.5046
        },
        {
            "id": "gzp1tbe",
            "score": 2,
            "text": "tax chips soda and other unhealthy options and don't tax healthy options. Make all food welfare as strict as WIC",
            "title_similarity": "0.6103202",
            "sentiment_compound": -0.6866
        },
        {
            "id": "gzozul1",
            "score": -9,
            "text": "But most people buy junk food like Twinkies and red bulls. We should not tax healthy food but we SHOULD tax junk food considering most women are overweight these days, and most of those are obese. Men also have an obesity problem but more often men work physical jobs so it's less.\n\nI worked at a grocery store and watched lots of people buy junk with their food stamps (tax free) so removing the tax doesn't really make people buy better food. My city had a program where food stamps made veggies and fruit half off, that was a good idea.\n\nWe need taxes to disincentive things. And no tax should be for good things, like healthy foods. \n\nBut people want to eat crap no matter what.",
            "title_similarity": "0.80749536",
            "sentiment_compound": 0.9023
        },
        {
            "id": "gzot4no",
            "score": 0,
            "text": "Iowa doesn't tax grocery items which is great. The horrendous state of Misery has different tax rates for different types of food items and almost every county is a little different! It's insane and trying to sort through it is a compliance nightmare.",
            "title_similarity": "0.7982508",
            "sentiment_compound": -0.7293
        },
        {
            "id": "gzpbgf7",
            "score": 0,
            "text": "Yet in many cities around the country, progressive politicians imposed a \"heroes\" raise for mostly unionized grocery supermarket workers, ignoring that this surcharge was going to be passed on to customers, including those susceptible to food insecurity.  \n\nIn Seattle, the progressive government specified that it would apply to higher-paid supermarket workers, but specifically exempted convenience stores like 7-11 and the like, where front line \"heroes\" were much lower paid, not to mention, ignoring nursing home aides, hospital orderlies, and other low-paid front line workers.  Yes in Seattle groceries have been exempt for many years from sales tax, but the progressive government took the opportunity to undo that by imposing a wage increase without provision to prevent it from being passed on to consumers.  \n\nI've heard of nowhere there was a government imposed heroes wage to workers, not front line health workers, not first responders, just, supermarket employees.  I've heard of no \"heroes\" raises that protected lower income customers from footing the bill. Can someone explain what's progressive about arbitrarily choosing a favored group like that?",
            "title_similarity": "0.787544",
            "sentiment_compound": 0.9831
        },
        {
            "id": "gzp2d5u",
            "score": 6,
            "text": "If you think a tax is problematic wait until you find out what inflation will do",
            "title_similarity": "0.4721046",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzp91oy",
            "score": 1,
            "text": "why would you exempt groceries from sales tax? Would you exempt gasoline from sales tax?",
            "title_similarity": "0.5658628",
            "sentiment_compound": 0.2869
        },
        {
            "id": "gzp0s3c",
            "score": 0,
            "text": "Shouldn't all foods be exempt from taxes?",
            "title_similarity": "0.5994076",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzp81i0",
            "score": 0,
            "text": "Can we stop using the word \"problematic\" please",
            "title_similarity": "0.16119811",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzp0ez1",
            "score": -7,
            "text": "I thought it was common knowledge that sales tax is a regressive tax. Yet democratic leaning areas continue to vote for them, because it makes voters feel good.",
            "title_similarity": "0.5306009",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzp6fqe",
            "score": 2,
            "text": "And yet in many broke low population counties sales tax make up a good portion of their income.  SO stop taxing food or shut the county down?",
            "title_similarity": "0.81197137",
            "sentiment_compound": -0.6987
        },
        {
            "id": "gzpbd1g",
            "score": 3,
            "text": "the sales tax in poland is 23%, most food 3-7%.\n\nnot sure why there would be no sales tax on sold goods.",
            "title_similarity": "0.7906829",
            "sentiment_compound": -0.4874
        },
        {
            "id": "gzozro5",
            "score": -6,
            "text": "Did we really need research from Cornell to figure this out? Is that how far we have fallen intellectually?",
            "title_similarity": "0.479938",
            "sentiment_compound": -0.1179
        },
        {
            "id": "gzpb09s",
            "score": 8,
            "text": "The far bigger concern is that all food prices are going up due to inflation fueled by money printing by the Federal Reserve to finance deficit spending by both obsolete US parties.",
            "title_similarity": "0.588079",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzo4wnn",
            "score": 41,
            "text": "One reason for not exempting grocery foods is that it can create anomalies and tax administration overheads when groceries and restaurants sell similar foods and start to behave in similar ways, especially if there is a tax incentive to encourage that. There are other mechanisms that might create fewer anomalies, such as increasing the minimum wage.",
            "title_similarity": "0.6830919",
            "sentiment_compound": 0.8402
        },
        {
            "id": "gzoxlwu",
            "score": -1,
            "text": "is this a science sub for americans?",
            "title_similarity": "0.28857175",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoyuk0",
            "score": 1,
            "text": "These same people would support a flat tax.",
            "title_similarity": "0.33465996",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzp6h9j",
            "score": 1,
            "text": "Why do we keep sales tax when it is a regressive tax?",
            "title_similarity": "0.5202565",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp8bf2",
            "score": -1,
            "text": "Remember people America calls itself the greatest country",
            "title_similarity": "0.19795838",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzoq1mq",
            "score": -5,
            "text": "Luxury sales taxes would be nice...",
            "title_similarity": "0.2902531",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzp3g35",
            "score": -2,
            "text": "Stay out of the state of Mississippi",
            "title_similarity": "0.20462747",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp69wj",
            "score": -3,
            "text": "Let's see the list of shame.",
            "title_similarity": "0.17112747",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzq9nq4",
            "score": 1,
            "text": "We need more taxes. - said no poor person ever. \n\nToo bad the poor have no power.",
            "title_similarity": "0.6344518",
            "sentiment_compound": -0.7388
        },
        {
            "id": "gzpigdl",
            "score": 41,
            "text": "Ah, yes, the “science” subreddit.",
            "title_similarity": "0.014390869",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzo9w9f",
            "score": 91,
            "text": "being poor is expensive.",
            "title_similarity": "0.4216157",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzoyrda",
            "score": -13,
            "text": "Progressive taxes are anything but. Taxes are legal theft and have always taken more from the poor than from the wealthy.",
            "title_similarity": "0.6635015",
            "sentiment_compound": -0.1395
        },
        {
            "id": "gzosxpe",
            "score": 2,
            "text": "Food insecurity leads to a whole lot of other problems later down the line as well such as obesity; this affects many aspects of life, such as healthcare etc",
            "title_similarity": "0.61883336",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzp2030",
            "score": -4,
            "text": "~~I'm not sure who wrote this, but, in America,~~ *~~counties~~* ~~do not charge sales tax,~~ *~~states~~* ~~do.  Each state has multiple counties, or in Louisiana's case, \"parishes.\"~~\n\nNever mind.",
            "title_similarity": "0.53435385",
            "sentiment_compound": -0.1232
        },
        {
            "id": "gzp3o44",
            "score": 3,
            "text": "Another area that hurst consumers is the programs that supermarkets pass on to suppliers. Every couple of years it’s a 1%-2%. That cost eventually gets built into pricing that the supplier charges to said retailer who passes it on to the customer.\n\nWith major retailers making record profits like Walmart, Loblaws, Sobeys (Canada) it’s a little unscrupulous to pass along arbitrary programs. They use it to bolster profit margins and fund their infrastructure. Although collusion would be very difficult to prove all major retailers in Canada put through and E-comm fee within 6 months of each other even though many of them had already invested in E-comm before the pandemic. \n\nIn the UK they have a grocery code of conduct that puts limitations on arbitrary fees. In Canada that idea is lobbied against by you guessed it retailers",
            "title_similarity": "0.7304411",
            "sentiment_compound": 0.5279
        },
        {
            "id": "gzodmwm",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.10927044"
        },
        {
            "id": "gzovsik",
            "score": 0,
            "text": "TIL that not every parish or county charges sales tax on groceries.",
            "title_similarity": "0.6887398",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzp32u1",
            "score": 0,
            "text": "We should probably text yachts more than bread",
            "title_similarity": "0.3432062",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp8nrp",
            "score": 0,
            "text": "Margins after income are low for low income folks. Period. It’s hard enough to keep up with inflation/cost of living when wages have not historically kept up with the increase of prices on an annual basis.\n\nI know some science is common sense, but yes, adding (I’m assuming) a 10% sales tax on food that is not normally taxed makes it more expensive. People on tightening margins after paying bills on a low income are obviously going to experience “food insecurity” if they can’t keep up to begin with, let alone when they pay an extra 10% for food. Something we need to survive.",
            "title_similarity": "0.810059",
            "sentiment_compound": -0.431
        },
        {
            "id": "gzp9a8r",
            "score": 0,
            "text": "As a european, coming to america it’s weird how they dont implement the tax in the price. You “ger charged” alot extra at the register for taxes.",
            "title_similarity": "0.63334167",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzp9zqu",
            "score": 0,
            "text": "I remember being so poor, a $0.50 increase seriously affected my ability to function.",
            "title_similarity": "0.6852739",
            "sentiment_compound": -0.4002
        },
        {
            "id": "gzpodfb",
            "score": 0,
            "text": "So the study found that taxes are bad and make a big difference in decisions? I am shocked! I thought that taxes are always good and we couldn't effect things in a negative way with taxes.",
            "title_similarity": "0.6261413",
            "sentiment_compound": -0.784
        },
        {
            "id": "gzpvjfu",
            "score": 0,
            "text": "Regulate the cost of essential goods & services.",
            "title_similarity": "0.22089666",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpz0dz",
            "score": 0,
            "text": "This is how Republicans WANT it",
            "title_similarity": "0.069208026",
            "sentiment_compound": 0.2577
        },
        {
            "id": "gzpzqva",
            "score": 0,
            "text": "This is all part of the Reagan shift.  Shifting from income taxes to user taxes, which puts more of the burden on the working class.  It's not something that just happened.  It was planned.",
            "title_similarity": "0.55892795",
            "sentiment_compound": -0.4877
        },
        {
            "id": "gzqcuyi",
            "score": 0,
            "text": "The income is the problem here not the sales tax.",
            "title_similarity": "0.38415393",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzsah7u",
            "score": 0,
            "text": "This is why we should limit government, they won't spend your money better than you.",
            "title_similarity": "0.5571377",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzsg306",
            "score": 0,
            "text": "What kind of liberal tax going on here. We just tax fast food",
            "title_similarity": "0.5579407",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzsi6cs",
            "score": 0,
            "text": "I support taxing everyone equally",
            "title_similarity": "0.01885815",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzp43ss",
            "score": -4,
            "text": "Unsurprisingly, Republicans love them some sales taxes to increase revenue.",
            "title_similarity": "0.42889798",
            "sentiment_compound": 0.7579
        },
        {
            "id": "gzp06c2",
            "score": -1,
            "text": "of course. the poor can barely get by as is. making them pay rich people's bills for them even more is too much for a family who doesn't even have enough money to feed themselves.",
            "title_similarity": "0.67834604",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzp3ra5",
            "score": 1,
            "text": "Hmm I did not know that.",
            "title_similarity": "0.062041767",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp4xz3",
            "score": 1,
            "text": "No one should ever go hungry in this damn country.",
            "title_similarity": "0.3600915",
            "sentiment_compound": -0.6514
        },
        {
            "id": "gzpae8c",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.06529895"
        },
        {
            "id": "gzpaq74",
            "score": -1,
            "text": "It shouldn’t be called sales tax. It should be tax the poor tax.",
            "title_similarity": "0.5095671",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzpariv",
            "score": 1,
            "text": "Restaurants, fast food OK, but grocery store food, NO TAX please. Reminds me of a line in the movie Total Recall, where the Mars colony is owned by a corporation. \"They raised the price of air again' .......",
            "title_similarity": "0.5116272",
            "sentiment_compound": -0.7463
        },
        {
            "id": "gzpasat",
            "score": 1,
            "text": "For once Texas does something right... Only soda and candy and (I think) made to order food (like grocery store sushi, etc.) is taxable. Everything else is exempt.",
            "title_similarity": "0.6217078",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzpauta",
            "score": 1,
            "text": "Gas, basic foods, anything non-luxury really, has a disproportionate burden on the poor.",
            "title_similarity": "0.7002683",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gzpcmtq",
            "score": -1,
            "text": "No, because they get govt assistance. It's always the middle class that hurts the most...",
            "title_similarity": "0.5342075",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzpdn5o",
            "score": 1,
            "text": "I grew up food as tax free, now I live in a tax food place. For me in central Illinois, no where near a city, it’s basically 11% on everything. So you get $100 groceries you are paying $111. That’s a lot when I never even use to think of it for groveries",
            "title_similarity": "0.6431911",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzpebbe",
            "score": -1,
            "text": "The reason I can only afford to eat once a day, and I'm indigenous [native to america] 🤠",
            "title_similarity": "0.565043",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpeowa",
            "score": -1,
            "text": "You gots to pay your protection money or the iraqistan ell get ya in your sleep",
            "title_similarity": "0.32706052",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzpf72k",
            "score": -1,
            "text": "Pssh, who can afford groceries any more even without tax?",
            "title_similarity": "0.58938646",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpow0u",
            "score": 1,
            "text": "Well, gettttt ready for more taxes!!\n\n-Biden",
            "title_similarity": "0.25672305",
            "sentiment_compound": 0.6351
        },
        {
            "id": "gzprrit",
            "score": -1,
            "text": "capitalism, in the banana republic.",
            "title_similarity": "0.26681232",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqbygs",
            "score": 1,
            "text": "You’re less of a country and more of a loose grouping of states. Is there anything you all agree on?",
            "title_similarity": "0.34278035",
            "sentiment_compound": -0.0164
        },
        {
            "id": "gzqd7pk",
            "score": 1,
            "text": "Who would’ve thought that if you tax things people buy less of it and sellers sell less as well. Shocking breakthrough.",
            "title_similarity": "0.69561994",
            "sentiment_compound": -0.1567
        },
        {
            "id": "gzqekj5",
            "score": 1,
            "text": "The answer to most poverty is just to abolish taxes.",
            "title_similarity": "0.5928446",
            "sentiment_compound": -0.5563
        },
        {
            "id": "gzqyg7r",
            "score": 1,
            "text": "Regressive tax systems disproportionately affect those with the least money. This isn't really news. It is more of a verification of the theory.",
            "title_similarity": "0.715594",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzoqufc",
            "score": 135,
            "text": "Maybe the bigger problem here is that so many people are living on such thin margins that even a slight increase in prices causes instability.",
            "title_similarity": "0.7262768",
            "sentiment_compound": -0.1761
        },
        {
            "id": "gzoxht9",
            "score": 7,
            "text": "I’m pretty sure there is a tax on many grocery foods in Miami-Dade county",
            "title_similarity": "0.5544816",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gzo66ck",
            "score": -27,
            "text": "Imagine taking the money spent on these ridiculous studies and giving it to the poor instead.",
            "title_similarity": "0.5251411",
            "sentiment_compound": -0.4939
        },
        {
            "id": "gzp2n6i",
            "score": -9,
            "text": "The most undertaxed group of people in the world are poor people.",
            "title_similarity": "0.6061218",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzp3aha",
            "score": -2,
            "text": "What about a slight in price increase in general? This isn’t just a tax issue. On a $100 bill the sales tax would be $7-8.",
            "title_similarity": "0.5859343",
            "sentiment_compound": 0.2585
        },
        {
            "id": "gzp4dlm",
            "score": 2,
            "text": "Taxation is war waged on the poorest among us",
            "title_similarity": "0.5264889",
            "sentiment_compound": -0.8126
        },
        {
            "id": "gzp6k09",
            "score": -2,
            "text": "People need clothes too, and toiletries. We should get rid of the sales tax altogether.",
            "title_similarity": "0.43687367",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqbuv8",
            "score": 2,
            "text": "Taxing food is a fundamentally tyrannical exercise of government powers.\n\nBut then again the government taxes me for the privilege of pretending I own my home, and literally another tax on the amount of rain that falls of my house.",
            "title_similarity": "0.66122186",
            "sentiment_compound": 0.5927
        },
        {
            "id": "gzoml3v",
            "score": -3,
            "text": "My system. 1, nothing more than 5 bucks, 2 pick something, round up to next quater, add 50 cents. 3 have how much you brought with you on a piece of paper and subtract.  4 stop shopping at 5 bucks remaining.",
            "title_similarity": "0.53729814",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzp09cu",
            "score": -3,
            "text": "Grocery tax is 1.5% I think.",
            "title_similarity": "0.61894715",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp4j5s",
            "score": -3,
            "text": "The government loves their taxes",
            "title_similarity": "0.33418924",
            "sentiment_compound": 0.5719
        },
        {
            "id": "gzp7mct",
            "score": -2,
            "text": "Who cares you are all gonna die amounting to no more than a piss stain in your undies and the human race with long be wiped from this planet. Y’all think you are forever..",
            "title_similarity": "0.37441763",
            "sentiment_compound": -0.7239
        },
        {
            "id": "gzph9ve",
            "score": -3,
            "text": "Cant feed it dont breed it",
            "title_similarity": "0.3087411",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpqsn8",
            "score": 2,
            "text": "Say it with me\n\nTaxation is theft",
            "title_similarity": "0.30929786",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzprc1s",
            "score": 2,
            "text": "Just get rid of federal taxes. Problem solved",
            "title_similarity": "0.3625502",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzqdn41",
            "score": -3,
            "text": "Florida and free I love this state all you democratic left wing dummies stay put",
            "title_similarity": "0.15107067",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gzof1ib",
            "score": 266,
            "text": "I don't know if groceries being taxed is the cause of food insecurity. I suspect it has more to do with:   \n1) People not making enough money.   \n2) Grocers not operating in places where lots of people don't make much money.   \n\n\nTaxing groceries \\*is\\* a not-progressive tax, but tax-exempting groceries is a marginal solution for making more people food-secure.",
            "title_similarity": "0.82534033",
            "sentiment_compound": 0.0027
        },
        {
            "id": "gzowkjm",
            "score": -4,
            "text": "It surprises me to see how much is taxed, followed by the state doing 1 million dollar raffles to get vaccinated. To me, its a bit concerning to know that they have 1 million just laying around.  Makes me wonder why taxes work the way they do.",
            "title_similarity": "0.6980061",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzpfxxy",
            "score": -5,
            "text": "So you’re telling me that something like $0.60 on $10 is a make or break amount for people?  Sorry, I don’t buy it.",
            "title_similarity": "0.6417901",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzp0paj",
            "score": 15,
            "text": "Remember when I was kid and my parents talking about bread price again going up and how frustrating that is.",
            "title_similarity": "0.5266989",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzp4r0h",
            "score": -5,
            "text": "How's many cigarettes are purchased in these low income areas?",
            "title_similarity": "0.62761617",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzo3x8m",
            "score": -17,
            "text": "This is why sending out huge budgets doesn't work. \n\nThey lead to more taxes.",
            "title_similarity": "0.6205182",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzp1z2m",
            "score": 213,
            "text": "Here in Kansas we substantially “cut taxes”.  This income tax cut was accompanied by a large increase in sales tax. In most larger towns the total stare+county+city sales tax is over 10%. Food is *not* exempt. This change raised taxes for the poor and middle class. Those of us in the middle pay about $300-400 more per year in total taxes than before the change.",
            "title_similarity": "0.7101158",
            "sentiment_compound": -0.5568
        },
        {
            "id": "gzpe0ve",
            "score": 20,
            "text": "here In Mississippi In some counties you might even pay more then the state sales tax bevuase they have tacked in there own 1~2 % on top",
            "title_similarity": "0.62023646",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzodsll",
            "score": 505,
            "text": "I was under the impression, actually I just checked and it's a fact:  *If a food or beverage item is ordinarily subject to sales tax, the purchase will be nontaxable if the item is purchased with food stamps.* and *Under federal law, states may not tax food that is purchased with SNAP benefits.* and *When a customer pays part of the grocery bill with SNAP and part in cash, federal law requires that the SNAP benefits be applied to foods that would be subject to tax first. The federal prohibition on taxing food bought with SNAP means that some otherwise taxable food sales escape taxation.* \n\nLowest income families are normally the ones using food stamp benefits the most.  Were SNAP benefit purchases taken into account?",
            "title_similarity": "0.73075324",
            "sentiment_compound": 0.8768
        },
        {
            "id": "gzo78sk",
            "score": 2389,
            "text": "I'm in Canada. We don't pay taxes on produce, fresh meats, most dairy, cereals but everything else in the supermarket is taxed, basically if it's processed food, it's taxed unless it's considered what's called a \"basic food item\" (canned soup for example). Am I correct in assuming that there are places in the US that tax ALL groceries?",
            "title_similarity": "0.70822597",
            "sentiment_compound": 0.2018
        },
        {
            "id": "gzpd5xg",
            "score": 35,
            "text": "In New Zealand, our sales tax (GST, 15%) is on everything, no exceptions. \n\nThe argument for removing it from food comes up reasonably often, but considering there are also people arguing for sugar taxes as well, that will just make things really complicated. \n\nI think no exceptions makes sense, but the rate should be lower (10% or less), with the difference coming from increasing income tax.",
            "title_similarity": "0.7227018",
            "sentiment_compound": -0.8519
        },
        {
            "id": "gzqb4zd",
            "score": 32,
            "text": "In Denmark we have a 25% sales tax on everything. Food, electronics, entertainment, you name it.",
            "title_similarity": "0.60198",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzp0lha",
            "score": 1,
            "text": "What is a “Kiln Roast Salmon Fillet” and where can I get multiple for $2.89?",
            "title_similarity": "0.49975684",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp3x4q",
            "score": 1,
            "text": "Why was all I read “kill salmon filet” over and over on the receipt for a full minute.",
            "title_similarity": "0.4907602",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp476d",
            "score": 1,
            "text": "I’m just glad that I’m blessed enough to afford groceries no matter how high they soar. Twenty dollars gets maybe four items nowadays. \n\nIt’s pretty bad on the west coast, tbh.",
            "title_similarity": "0.60197157",
            "sentiment_compound": 0.7598
        },
        {
            "id": "gzp4ge4",
            "score": 1,
            "text": "for some counties, the only store you got is the Dollar General.",
            "title_similarity": "0.6329396",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp6qr6",
            "score": 1,
            "text": "Not to mention inflation on those goods!!",
            "title_similarity": "0.40652388",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzp7cps",
            "score": 1,
            "text": "Yeah noodles aren 1 buck anywhere",
            "title_similarity": "0.32665414",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzp7mkl",
            "score": 1,
            "text": "I just found  out I live below the poverty line. Does that mean I live in super-poverty? Feelsbadman",
            "title_similarity": "0.6400659",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzp8aep",
            "score": 1,
            "text": "Farmers who produce food for their Country's domestic market should not pay any taxes on the income derived from anything sold to that domestic market....",
            "title_similarity": "0.58123684",
            "sentiment_compound": 0.0762
        },
        {
            "id": "gzp9mav",
            "score": 1,
            "text": "I live in Missouri, and it is wild to me that other places don't charge it. I could be saving that money??? Damn.",
            "title_similarity": "0.5233017",
            "sentiment_compound": -0.5007
        },
        {
            "id": "gzpb9uu",
            "score": 1,
            "text": "Seeing some essentials not being taxed when I went on vacation was jarring",
            "title_similarity": "0.50726974",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpcywr",
            "score": 1,
            "text": "I work at a grocery store. Nevermind raising the tax. Every week when I put up new sales tags over the last few months, I have noticed a sharp increase in prices on a lot of items throughout the store.",
            "title_similarity": "0.5734682",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzpdmh0",
            "score": 7,
            "text": "Yes so get Rid of the sales tax and lower all taxes so they can have more of their own money",
            "title_similarity": "0.50900257",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzpfxa6",
            "score": 1,
            "text": "I hope that most folks so close to the edge are getting food assistance. This stupid country tho...",
            "title_similarity": "0.61858296",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzpg7y3",
            "score": 1,
            "text": "You can already see it. The cost of food has skyrocketed in the last 2-3 months. We used to be able to get a rack of ribs on sale for $7-8 a rack. Now you’re looking at $16-$17 a rack on sale. That’s going to cause us a lot of issues soon if the prices keep going up so much.",
            "title_similarity": "0.651177",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzph63m",
            "score": 1,
            "text": "Florida here, no tax on any \"non-prepared\" food.\n\nSo grocery, breads, cereals, meats, basically anything that's not ready to eat right there.\n\nBut pub subs, cakes, restaurants obv.",
            "title_similarity": "0.5062462",
            "sentiment_compound": -0.2858
        },
        {
            "id": "gzphgl6",
            "score": 1,
            "text": "I just don’t get it. I’ve lived and worked in 11 countries, the only one that does this is the US. It’s weird,",
            "title_similarity": "0.47162586",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzphtdd",
            "score": 1,
            "text": "> A total of 17 states impose grocery taxes, ...    \n  \nI wonder why they elected to say counties instead of states.      \n  \nEither way those states should fix this.  Food taxes are absolutely more harmful to the poor than anyone else.",
            "title_similarity": "0.8126626",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzphut4",
            "score": 1,
            "text": "It literally doesn’t mean that at all.",
            "title_similarity": "0.11047649",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpi3s3",
            "score": 1,
            "text": "PA doesn't tax non-prepared food (so you pay tax at restaurants and for cooked food at supermarkets) or clothing because it is essential. This should be federal law.",
            "title_similarity": "0.60518694",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzpib5a",
            "score": 1,
            "text": "Food prices are rising and it is not taxes that are causing it. It would be better to spend time on something that made a difference. Removing the taxes would have almost no effect when prices double or triple.",
            "title_similarity": "0.5913818",
            "sentiment_compound": 0.2484
        },
        {
            "id": "gzpjg2l",
            "score": 1,
            "text": "But also vat right guies",
            "title_similarity": "0.052700996",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpjjsd",
            "score": 1,
            "text": "Wait, are groceries tax exempt in other places?",
            "title_similarity": "0.546463",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzpjmc0",
            "score": 1,
            "text": "Just imagine what inflation is doing to them.",
            "title_similarity": "0.3065318",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpkfi7",
            "score": 1,
            "text": "The rich don’t care. They never have.",
            "title_similarity": "0.3009687",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gzpkgdv",
            "score": 1,
            "text": "They'll be fine.  Poor people are fatter than rich people and consume more calories.   Increasing taxes on foods could be seen as a humanitarian gesture.",
            "title_similarity": "0.6441005",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzpkq9u",
            "score": 1,
            "text": "Research money was spent to understand how poor people have to pick and choose what food to buy because 1) US wages are crap 2) adding tax to essential items is hurting the common person and 3) those that run this country want more tax payer money to protect big businesses and continue to laugh to the bank???\n\nCongratulations, you found out what “capitalism” is all about…",
            "title_similarity": "0.73146665",
            "sentiment_compound": 0.5484
        },
        {
            "id": "gzpku3j",
            "score": 1,
            "text": " I always thought it was a federal law to not tax food",
            "title_similarity": "0.47716317",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpldzi",
            "score": 1,
            "text": "Reddit looking down on taxes…. My my my….. you are going to make me blush.",
            "title_similarity": "0.4533684",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzplt4q",
            "score": 1,
            "text": "It incentives people in those counties to grow their own food. I live in such a county and grow much of our food  as do many of our neighbors. Low taxes across the board mean that a middle class existence is shared by a much larger percent of the population here than the major city I  lived in much of my life.",
            "title_similarity": "0.6839623",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzpm9jz",
            "score": 1,
            "text": "Its not taxing people on the money that they earn,  or businesses for paying them,  or land,  or cars, or licenses plates,  or fishing licenses,  hunting, breathing, water,  life,  walking,  shitting...\nLet's focus on the 2-10% sales tax on food. That will fix everything.",
            "title_similarity": "0.632431",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzpmfsk",
            "score": 1,
            "text": "from the NE: WFT is a county",
            "title_similarity": "0.09152439",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpmqjp",
            "score": 2,
            "text": "Pa doesn’t tax food or clothing",
            "title_similarity": "0.3788356",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpn1rk",
            "score": 1,
            "text": "Anything to keep the state from enacting the all dreaded income tax. (Former TN and FL resident)",
            "title_similarity": "0.54795015",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gzpnnn5",
            "score": 28,
            "text": "Here's one for you:\n\nFor a while in MN, a Snickers bar is taxable, because it is candy and candy is taxable. However, Twix was considered a cookie, and therefore non taxable. I believe that's now changed however.\n\nThere were another weird sales tax situation that stood out: if you (as a restaurant) hand out plastic silverware with a take out order, that silverware is non taxable at purchase, as it's considered part of the cost of the meal prepared. However, if you have a basket of plastic silverware inside the restaurant for customers when dining in the restaurant - the restaurant has to pay sales tax at purchase.",
            "title_similarity": "0.6946827",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzpou9n",
            "score": 3,
            "text": "Let's get rid of income tax all together.  It's regressive and hurts the poor the most.",
            "title_similarity": "0.59427994",
            "sentiment_compound": -0.7351
        },
        {
            "id": "gzppdj2",
            "score": 1,
            "text": "Unless you're exclusively raising taxes on products and services beyond the reach of low-income people, isn't pretty much any tax/tax increase on a common product service going to have this effect?\n\nI've seen a lot of articles about various taxes make mention of the \"disproportionate impact\" to low-income people and families, arguing this as a deterrent to certain kinds of new or altered taxes.  I get the sentiment, and the sympathy for people living in that income bracket, but unless the cashier is able to check your latest tax filings for your income level to adjust the taxes you pay for goods and services, this seems like an unavoidable consequence of being in that income bracket.\n\nUnless governments get a lot better at reducing costs and spending efficiently (seemingly antithetical to government), its going to be really hard to generate the tax incomes necessary to pay for all the interests and programs people want to see without new and increased taxes somewhere.",
            "title_similarity": "0.760545",
            "sentiment_compound": 0.879
        },
        {
            "id": "gzppr2i",
            "score": 1,
            "text": "This is common sense, no need for a research. Look at the state of the country. People working multiple low paying jobs .... Which were supposed to be summer jobs for high schoolers.... \n\nWe and only we alone can change it by coming together and putting others needs before our own.",
            "title_similarity": "0.5357391",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzppuoi",
            "score": 3,
            "text": "Now do taxes generally.",
            "title_similarity": "0.23554525",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpq47g",
            "score": 1,
            "text": "Worst you can do in America is to be poor",
            "title_similarity": "0.53330505",
            "sentiment_compound": -0.802
        },
        {
            "id": "gzpq8bx",
            "score": 1,
            "text": "I didn't even know NOT taxing grocery items was a thing except in states that have no sales tax at all.",
            "title_similarity": "0.55958253",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzpq8uj",
            "score": 1,
            "text": "Should low income families simply be exempt from all taxes then? They certainly don’t pay Federal income tax. Should there not be minimum tax obligation for all Americans?",
            "title_similarity": "0.73568916",
            "sentiment_compound": 0.168
        },
        {
            "id": "gzpqc6x",
            "score": 1,
            "text": "Lowest income families also receive the most assistance and tax breaks.  Those taxes probably double or triple and go right back to them",
            "title_similarity": "0.6599019",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzpqeep",
            "score": 1,
            "text": "When I was stationed at AZ, I use to shop at the military commissary a lot.  Being overseas my entire career, it was the only place I knew to shop for “affordable” groceries.  Overseas, it always drilled into us to shop there instead of the local grocery stores.  They always promoted they don’t apply a tax (even stated its 22% off base), but when look at the receipt, they add a 3% surcharge on all purchases.  \n\nIt was by accident one weekend that I went to the nearby Kroger because I didn’t want to drive all the way to base. And that’s when I realize the city I live in doesn’t tax groceries (except already prepared food).  Never shopped the commissary again after that.",
            "title_similarity": "0.70584655",
            "sentiment_compound": -0.3291
        },
        {
            "id": "gzpqhug",
            "score": 1,
            "text": "All consumption taxes disproportionately impact the poor.",
            "title_similarity": "0.65796685",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzpqlcj",
            "score": 1,
            "text": "This one thing Texas did right, we don't have sales tax on food items.",
            "title_similarity": "0.5269384",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpqopb",
            "score": 5,
            "text": "wait.. taxes on food is not normal? Where i am we have a \"prepared food\" and a \"non prepared food\" tax. You're taxed more for prepared food but you are still taxed a lot for non prepared foods.",
            "title_similarity": "0.73414195",
            "sentiment_compound": 0.5912
        },
        {
            "id": "gzpqy9f",
            "score": 1,
            "text": "I thought it was awesome when I moved away from Oklahoma City that groceries weren't taxed.  TIL it's actually more normal to not tax groceries.\n\nNow I live in a state that has no sales tax!  Save for restaurants, alcohol, and probablynother vices.",
            "title_similarity": "0.59391224",
            "sentiment_compound": 0.75
        },
        {
            "id": "gzprqir",
            "score": 1,
            "text": "Until you realize those ‘poor’ people get over $300 a month in food stamps. Which means they eat better than I do with a full time job.",
            "title_similarity": "0.7198987",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzprsek",
            "score": 1,
            "text": "In New Zealand, our sales tax applies to nearly everything, including food. It has a big advantage at avoiding all the disputes over edge cases that people have brought up here. Don't be like those places - tax everything, and help the poor with transfer payments.",
            "title_similarity": "0.6177019",
            "sentiment_compound": -0.6136
        },
        {
            "id": "gzprsut",
            "score": 1,
            "text": "Its a great way to raise taxes without targeting the rich. So now you know why it happens...",
            "title_similarity": "0.39227718",
            "sentiment_compound": 0.2905
        },
        {
            "id": "gzps1sh",
            "score": 1,
            "text": "I remember how surprised I was when I moved from California (you know, the place where all the conservatives complain about taxes) to a red state and had to start paying tax on food.",
            "title_similarity": "0.6579804",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzpsa07",
            "score": 1,
            "text": "I live in such an area. Yes, it's very unfair. The reason in my area is because sales taxes are higher because property taxes are lower. You see what's going on there, right? The wealthy have expensive property that would have high property taxes, in comparison to groceries and medication. So the wealthy pay less in taxes, when property taxes are shifted to necessities. The middle class & poor have to pay sales taxes on necessities. They have no choice but to cut the food they buy. Their property taxes are lower, but not as much lower as the wealthy.\n\nMany people don't realize this. This is an area run by the monied class.",
            "title_similarity": "0.78058016",
            "sentiment_compound": -0.3307
        },
        {
            "id": "gzpstoe",
            "score": 1,
            "text": "Sounds like a problem the U.S.A. needs to figure out.  \nGo red white and blue",
            "title_similarity": "0.2588366",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzpt60s",
            "score": 1,
            "text": "So I am screwed if I am poor? And you needed to do science to prove that?\n\nTalk about a waste of time!",
            "title_similarity": "0.470295",
            "sentiment_compound": -0.8755
        },
        {
            "id": "gzpt84m",
            "score": 1,
            "text": "Lowest-income families get food stamps. If used wisely they are plenty. Used at Taco Bell, they run out pretty quick.",
            "title_similarity": "0.7417758",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gzptql1",
            "score": 1,
            "text": "I don’t see why we can’t implement a flexible system that applies tax to a customer based on their reported income.",
            "title_similarity": "0.5559864",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzptqw8",
            "score": 1,
            "text": "Tax in Enid, Oklahoma is 9.1%!!!!! It is a joke!!",
            "title_similarity": "0.5783797",
            "sentiment_compound": 0.5216
        },
        {
            "id": "gzptu9j",
            "score": 2,
            "text": "Growing up I lived in Pennsylvania where they didn't have tax on food and clothing. I believe it is still that way and should be that way every where.",
            "title_similarity": "0.45668006",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzpu0in",
            "score": 1,
            "text": "I'm guessing that 1/3rd is concentrated in the south, because I have never seen,nor heard of, a grocery store not having sales tax.",
            "title_similarity": "0.5982192",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpuoh6",
            "score": 1,
            "text": "Sales taxes on necessities are among the most regressive.",
            "title_similarity": "0.6444876",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpux0o",
            "score": 1,
            "text": "Most places, the “Healthier food” is also the most expensive.\nWhereas the cheapest food is mostly processed food, but also much less healthy.",
            "title_similarity": "0.66494447",
            "sentiment_compound": 0.4785
        },
        {
            "id": "gzpw6si",
            "score": 1,
            "text": "Congratulations. You just discovered regressive taxation. Did you know that middle class Americans pay more taxes in Texas than California? Look it up.",
            "title_similarity": "0.6896312",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gzpwlvr",
            "score": 1,
            "text": "We don’t have sales tax in Oregon. It took me 10x of reading this to realize this",
            "title_similarity": "0.6503479",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzpykh5",
            "score": 1,
            "text": "Let’s make damn sure we vote in the ppl who raise taxes then, right ?",
            "title_similarity": "0.41410702",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzpzjt4",
            "score": 1,
            "text": "Yeah,  I'm an accelerationist now",
            "title_similarity": "-0.025019955",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzpztj0",
            "score": 1,
            "text": "I am 29 next month and I swear to the Holy Chalupa I thought every single thing in the store was taxed. This is absolutely mind boggling to me!",
            "title_similarity": "0.58928454",
            "sentiment_compound": -0.126
        },
        {
            "id": "gzpzvml",
            "score": 1,
            "text": "Yet those same food insecure people were layer found wearing Jordans and sipping expensive alcohol",
            "title_similarity": "0.48184088",
            "sentiment_compound": -0.4215
        },
        {
            "id": "gzq0kcq",
            "score": 1,
            "text": "They should just exempt everyone from paying taxes",
            "title_similarity": "0.45275038",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzq0zum",
            "score": 1,
            "text": "So we face taxes even when buying necessities like groceries while a multi-billion dollar hedge fund can avoid income tax on profits gained from shorting a publicly traded company into bankruptcy.\n\nIs this real life?",
            "title_similarity": "0.7013956",
            "sentiment_compound": 0.7003
        },
        {
            "id": "gzq12ut",
            "score": 1,
            "text": "I'm glad we have no sales tax here in Montana at all. It's nice to pay exactly what's on the price tag.",
            "title_similarity": "0.4202571",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzq19vo",
            "score": 1,
            "text": "Poor peoples number one health problem is obesity",
            "title_similarity": "0.7032491",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gzq2k70",
            "score": 1,
            "text": "They're talking about a slight grocery tax on the poorest of the poor while billionaires pay nothing.",
            "title_similarity": "0.77924633",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gzq2u2b",
            "score": 1,
            "text": "A related problem is that the CPI does not include taxes. So basically, the government can raise taxes to any amount (including on food) and claim there has been no inflation.",
            "title_similarity": "0.58736336",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzq2vwc",
            "score": 1,
            "text": "America has an obesity problem.. especially with low income people.. I'm not saying we shouldn't consider cutting taxes for the less fortunate, im saying we should cut taxes for them in other places.",
            "title_similarity": "0.76115394",
            "sentiment_compound": -0.4941
        },
        {
            "id": "gzq352z",
            "score": 1,
            "text": "This is something that should unite right and left. Food and necessities should not be subject to a sales tax.",
            "title_similarity": "0.44688094",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzq3rbh",
            "score": 1,
            "text": "Same with any country that has a VAT or GST applied to basic essentials..it hits those least able to afford the cost of living hardest..",
            "title_similarity": "0.6327612",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzq4xmr",
            "score": 1,
            "text": "I can walk into my local grocery and buy the makings of a salad, enough to feed 4 ppl. For $25. Is that good? I’m not sure. Before sales tax it’s usually around $19-$21 depending on which part I skimp on or go without. It’s literally cheaper to go to McDonalds, even when I know I’d be feeding my family and myself poison. However where I am in OH is significantly more expensive to buy any food at all, compared to where we lived in NC. NC was larger and more populated. There was little to no sales tax on most food items. Where we are in OH, sales tax applies to everything, literally every single thing, separately.\n\nEdit to note; the unemployment rate in my current city, is substantially higher and has been for years in comparison to other cities in my county. There are no living wage jobs, or public transportation systems in my area. This compounds the often 7-12% sales tax on food products. The homeless rate is rising in my area, at this point there are as many empty/foreclosed homes as there are inhabited.",
            "title_similarity": "0.7667647",
            "sentiment_compound": -0.8217
        },
        {
            "id": "gzq56t3",
            "score": 1,
            "text": "People can write off a car lease and a mortgage from their taxes. We should be able to write off our groceries.",
            "title_similarity": "0.51002526",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzq5xe6",
            "score": 1,
            "text": "This is also true in the EU.",
            "title_similarity": "0.0541236",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzq6hgv",
            "score": 1,
            "text": "Taxes make things cost more? Who knew? Thank you science, for revealing the shocking truth.",
            "title_similarity": "0.4700361",
            "sentiment_compound": 0.4066
        },
        {
            "id": "gzq6z74",
            "score": 1,
            "text": "Here in Indiana we’re not known for good ideas, but this is one idea that I’m happy to say we take part in. If you go to the grocery store you’re only paying tax on items like toilet paper, paper towels, cleaning products, any non food related item at the store. \nI buy ice and water everyday for my crew and it’s not taxed.",
            "title_similarity": "0.63740146",
            "sentiment_compound": 0.8223
        },
        {
            "id": "gzq7d0g",
            "score": 2,
            "text": "NYC would tax the air if they could",
            "title_similarity": "0.3568033",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzq7mdy",
            "score": 1,
            "text": "Has anyone else notice the price of food going up significantly. Some items I regular get are up an entire dollar or more.",
            "title_similarity": "0.5627173",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqah4n",
            "score": 1,
            "text": "New research finds that new research posts on reddit doesnt make the situation better.",
            "title_similarity": "0.55596805",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzqbnir",
            "score": 1,
            "text": "And my state wants to end income tax and bump our sales tax from 6% to 10%",
            "title_similarity": "0.66518384",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqcimb",
            "score": 1,
            "text": "I had no idea that there was anywhere that grocery foods were exempted from sales tax. Where I live (Colorado), we pay sales tax on every thing. Depending on where you are, you may pay multiple sales tax (state, county and city sales tax separately). I don't know of any items which are exempt.",
            "title_similarity": "0.6737751",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzqdvx0",
            "score": 1,
            "text": "Not to be the cynical one here. But I dont think anyone who makes laws actually cares. I care, but I don't make the laws.",
            "title_similarity": "0.42161432",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gzqe2i9",
            "score": 1,
            "text": "So here is something interesting the states that don't have Groceries fully exempt from taxes are Alabama, Mississippi, South Dakota, Kansas, Oklahoma, Idaho. Now if I am not mistaken these are Republican strongholds. Seems odd to me that republican lead states would not lower taxes on the poor.",
            "title_similarity": "0.7828493",
            "sentiment_compound": 0.4572
        },
        {
            "id": "gzqgutv",
            "score": 1,
            "text": "Is Systemic Classism a thing?",
            "title_similarity": "0.23670156",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqh8r6",
            "score": 1,
            "text": "Hate it here. It's like they're trying to say you don't deserve to live unless you can pay up like a nice cash cow. Hate hate hate it here.",
            "title_similarity": "0.54146415",
            "sentiment_compound": -0.8555
        },
        {
            "id": "gzqi284",
            "score": 1,
            "text": "[Wait, there are places where you don't pay tax on food?](https://i.kym-cdn.com/entries/icons/original/000/028/312/will_poulter.PNG)  \n5, 8 or 23% + extra tax for sugary stuff and alcohol, all depending on a product here and we make 1/3 of what 1st world does with prices at similar level :(",
            "title_similarity": "0.7508204",
            "sentiment_compound": -0.3826
        },
        {
            "id": "gzqj7ff",
            "score": 1,
            "text": "This is a tax on the poor.  No sales tax on food in Australia.",
            "title_similarity": "0.6064836",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzqjdez",
            "score": 1,
            "text": "But taxes are good! The higher the taxes the better the government never poorly allocates our dollar!",
            "title_similarity": "0.45597312",
            "sentiment_compound": 0.8513
        },
        {
            "id": "gzqjvgc",
            "score": 1,
            "text": "Oh come to philadelphia, where the sales tax is 2% higher than the rest of the state and a beverage tax of 1.5 cents an ounce is charged on drinks, including ones like orange juice. Yet, Philly’s too broke to pay its sanitation department.",
            "title_similarity": "0.7766537",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzqkjvl",
            "score": 1,
            "text": "There are places that don't have tax on grocery items?",
            "title_similarity": "0.56572497",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqkk5c",
            "score": 1,
            "text": "Simple solution: Increase tax on unhealthy food, lower tax on healthy foods. It's baffling that the price of fresh veggies is higher than a bag of candy",
            "title_similarity": "0.70304185",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzqknkg",
            "score": 1,
            "text": "I have spent a lot of time in Alabama throughout my life, and for all the small government screeching they do, they still taxed groceries in most places. It's pretty backwards, and I'm glad I don't have to experience that hypocritical stew of religion and conservatism anymore.",
            "title_similarity": "0.6433498",
            "sentiment_compound": 0.5367
        },
        {
            "id": "gzqmca6",
            "score": 1,
            "text": "Tax is not a problem if you have safety nets or program to help the poor.\n\nIncrease in tax won’t affect them if they receive similar increase in food stamps",
            "title_similarity": "0.55169725",
            "sentiment_compound": 0.8052
        },
        {
            "id": "gzqmpj5",
            "score": 1,
            "text": "Why are counties levvying sales tax?",
            "title_similarity": "0.51215917",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqmylf",
            "score": 1,
            "text": "Taxes are evil? Who would've thought.",
            "title_similarity": "0.46923286",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gzqmzxi",
            "score": 1,
            "text": "Here in Albemarle, VA there’s a 2.5% tax on every food item and hygiene item. I just thought that’s the way it was and never questioned it. No wonder I’m broke",
            "title_similarity": "0.6813115",
            "sentiment_compound": -0.1571
        },
        {
            "id": "gzqoedz",
            "score": 1,
            "text": "If the claim in the title is true then a lot of people are staving to death right now...The same can of soup that cost $1.80 2 months ago costs $2.86 at my super market today.  I spent at least 10%-15% more at the store yesterday then I would have at the begging of the year...let alone before covid.",
            "title_similarity": "0.7507323",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gzqohl7",
            "score": 1,
            "text": "There are some strange rules. Ice cream at Culver's (Wisconsin) charges tax on scoops, but pints are exempt because they are bulk items.",
            "title_similarity": "0.70621693",
            "sentiment_compound": -0.09
        },
        {
            "id": "gzqowo6",
            "score": 1,
            "text": "So glad Canada doesn't allow for food taxes for this exact reason.",
            "title_similarity": "0.6029219",
            "sentiment_compound": 0.3873
        },
        {
            "id": "gzqpdt0",
            "score": 1,
            "text": "Huh. I never even realized some states taxed groceries. I’m fortunate, and come from a state where no groceries are taxed. This includes processed food, soda, candy... all zero tax. The only food you’ll pay tax on at a grocery store is something like a slice of pizza at Costco. In that case, it’s more like paying for convenience food than groceries.",
            "title_similarity": "0.72614825",
            "sentiment_compound": 0.6801
        },
        {
            "id": "gzqpefl",
            "score": 1,
            "text": "Regressive taxes at its finest.",
            "title_similarity": "0.29775575",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqpexq",
            "score": 1,
            "text": "Fascinating. Here in Austria everything is taxed (some essential items a bit less) and while of course no tax would make it cheaper, it really isn't seen as a problem at all. But on the other hand we have a working social security system...",
            "title_similarity": "0.55700314",
            "sentiment_compound": 0.802
        },
        {
            "id": "gzqq8qq",
            "score": 1,
            "text": "Wait I had idea that was even a thing! I feel scammed! I’m in Orange County California",
            "title_similarity": "0.21391171",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqqp4x",
            "score": 1,
            "text": "No one should pay tax on food that’s just wrong",
            "title_similarity": "0.53969324",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzqr1aw",
            "score": 1,
            "text": "Delawareans: “you guys are paying taxes?”",
            "title_similarity": "0.4303354",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqr8ob",
            "score": 1,
            "text": "TIL most states don’t pay grocery taxes.",
            "title_similarity": "0.7712233",
            "sentiment_compound": -0.1689
        },
        {
            "id": "gzqr8yk",
            "score": 1,
            "text": "Imagine if the government did take 30% of their paycheck",
            "title_similarity": "0.519544",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqs579",
            "score": 1,
            "text": "Wait, you guys don't pay sales tax on your groceries? \n\n-Texan",
            "title_similarity": "0.6521022",
            "sentiment_compound": 0.0762
        },
        {
            "id": "gzqsacu",
            "score": 1,
            "text": "No tax on food in Nebraska.",
            "title_similarity": "0.47260296",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzqsfgz",
            "score": 1,
            "text": "In Germany basic food items are taxed at lower rates. However, in Germany if you are low income enough to get into food problems, you will receive government assistance.",
            "title_similarity": "0.70579064",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gzqtw2p",
            "score": 1,
            "text": "A tax on food is straight up inhumane and nothing will ever convince me otherwise. There is no rational for this. This is the result of sociopath polices driven by politicians and bureaucrats who get paid ridiculous amounts of money but cannot balance their city and state budgets. \n\nThis is oppression by any other name.",
            "title_similarity": "0.654644",
            "sentiment_compound": -0.3116
        },
        {
            "id": "gzqtwx5",
            "score": 1,
            "text": "Wait you mean to tell me taxing people to death isn't good for them? Gasp.",
            "title_similarity": "0.43735847",
            "sentiment_compound": -0.7435
        },
        {
            "id": "gzqu4ga",
            "score": 2,
            "text": "That’s science ? Looks like géo politics to me",
            "title_similarity": "0.23368898",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzqvsd3",
            "score": 1,
            "text": "This is unsurprising considering that previous studies indicated that most have negligible incomes and no savings. Then again, we are dealing with consequences of decision making by lawmakers who convinced themselves that $2000 is good enough to pay bills and buy food for over 6 months.",
            "title_similarity": "0.85717857",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzqwbui",
            "score": 1,
            "text": "Hi. Welcome to earth where since humanity’s dawn, we have oppressed and destroyed those that are in the most vulnerable state because we, as a species, SUCK.",
            "title_similarity": "0.46406788",
            "sentiment_compound": -0.8452
        },
        {
            "id": "gzqx3g4",
            "score": 1,
            "text": "How else can we keep poor people fat, dumb and sick?",
            "title_similarity": "0.59962606",
            "sentiment_compound": -0.8658
        },
        {
            "id": "gzqxjpx",
            "score": 1,
            "text": "Are you kidding me? As if the price of food hasn't gone up enough",
            "title_similarity": "0.57043797",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzqxmwi",
            "score": 1,
            "text": "Welcome to Tennessee, where groceries are taxed at 9.25%.",
            "title_similarity": "0.5494238",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzqy9br",
            "score": 1,
            "text": "You're telling me that the difference between buying a pack of ramen at $1 and $1.10 is killing people? This seems a bit exaggerated... If you buy $100 of food in TN you're only going to pay $110 after tax. I don't feel that's killing people.",
            "title_similarity": "0.76689124",
            "sentiment_compound": -0.3987
        },
        {
            "id": "gzqym8d",
            "score": 1,
            "text": "When would the lowest income families not be the most susceptible to food insecurity?",
            "title_similarity": "0.75364083",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gzqyumt",
            "score": 2,
            "text": "This is coming from the side that advocates for more taxes. There should be less taxes across the board.",
            "title_similarity": "0.51609045",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqyxi0",
            "score": 1,
            "text": "TIL that some parts of the country tax groceries.",
            "title_similarity": "0.5483556",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqz75s",
            "score": 1,
            "text": "Where i grew up it was between 8-9% on groceries and even higher for cigs and alcohol.",
            "title_similarity": "0.5768504",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqzffw",
            "score": 1,
            "text": "there are counties where the water is so toxic, they have to buy bottled water, and get TAXED on it. this is criminal",
            "title_similarity": "0.59827137",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzr129m",
            "score": 1,
            "text": "I just can’t help notice that the image of the receipt for me has Kiln Roasted Salmon Fillets, like daaaamn dude.",
            "title_similarity": "0.38480914",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzr1kj1",
            "score": 2,
            "text": "Look at the data analysis. What a joke. Politicized af.",
            "title_similarity": "0.25138277",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzr1kps",
            "score": 1,
            "text": "While millionaires and billionaires pay zero tax on their yachts and private planes.",
            "title_similarity": "0.43748653",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzr1peb",
            "score": 1,
            "text": "If a few cents of taxes on your groceries is all that's between you and hunger, there are far bigger problems at play than the tax. Like you're not getting paid anything near a living wage.",
            "title_similarity": "0.7903131",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gzr28d9",
            "score": 1,
            "text": "It seems EVERYTHING in the world affects poor people in a bad way. EVERYTHING.",
            "title_similarity": "0.5029397",
            "sentiment_compound": -0.765
        },
        {
            "id": "gzr2gic",
            "score": 2,
            "text": "Oh, oh the irony of my big govt country with its allegedly oppressive taxes.\n\nNO TAX ON GROCERY IN CANADA. \n\nNot even in Quebec :)",
            "title_similarity": "0.62774247",
            "sentiment_compound": -0.4278
        },
        {
            "id": "gzr2ic9",
            "score": 1,
            "text": "Taxes are problematic in general. Science.",
            "title_similarity": "0.44637033",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzr3ifm",
            "score": 1,
            "text": "Bro, I pay 21% VAT on 90% of things, Imagine how fucked that is.",
            "title_similarity": "0.5725082",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gzr48zs",
            "score": 1,
            "text": "It's called a regressive tax",
            "title_similarity": "0.29758704",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzr51fw",
            "score": 1,
            "text": "In Argentina we pay 21% on everything. Food included.\n\n\nThat's peronism for you.",
            "title_similarity": "0.4817637",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzr5mi4",
            "score": 1,
            "text": "No sales tax on food and clothes in PA.",
            "title_similarity": "0.53715986",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzr5nf3",
            "score": 1,
            "text": "Welcome to America land of the only money gets you life",
            "title_similarity": "0.31487644",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzr6xpt",
            "score": 1,
            "text": "Some states have lower tax on food items and it will itemize on your receipt. 2 or 3% is better than 7%.\n\nInflation is the other hidden tax people pay each year.",
            "title_similarity": "0.80604696",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzrbjn4",
            "score": 1,
            "text": "Virtually all taxes ultimately hurt the poor more than the rich.",
            "title_similarity": "0.7439632",
            "sentiment_compound": -0.3892
        },
        {
            "id": "gzrlgwi",
            "score": 1,
            "text": "Out of curiosity the data by itself while seemingly convincing doesn't say much.\n\nWhat is the average income of these counties? Are these 250 population counties in the middle of Nebraska, or the ultra wealthy in Beverly Hills?\n\nThe data might seem convincing at first glance, but I'd like to see a more detailed breakdown.",
            "title_similarity": "0.64586055",
            "sentiment_compound": 0.7941
        },
        {
            "id": "gzrmn3j",
            "score": 1,
            "text": "Here in NY the normal foods idk what you consider normal are not taxes but it’s basically junk foods and hot “prepared” foods that are taxed.\n\nIt doesn’t completely follow that path though. Cause like Doritos and ice cream are not taxed while candy bars are. I mean junk is junk in my eyes if anything ice cream is dairy but other than that... and then when people use food stamps it exempts tax but someone is still paying the tax one way or another.\n\n8.75% here in NY 4% is state and the other 4.75% the county i guess. Clothes are 4% prob state only tax no county not sure. I know people would go to PA for school shopping season.",
            "title_similarity": "0.78931737",
            "sentiment_compound": -0.2944
        },
        {
            "id": "gzrn36u",
            "score": 1,
            "text": "I wonder if sales tax actually makes people not buy more things like $2000 on a car and the state had the nerve to say we underpay are tax time probably can’t write off state taxes unless you can beat the standard deduction and itemize higher so we just get stuck eating it... or $5 every time we buy a new $60 game $50 tax on a TV, Xbox, PlayStation etc.\n\nI’m part of the political side taxation is theft but i get if it’s a necessary evil for roads or whatever, also budget better to need less tax money, or if more people worked all of us individually would pay less... but why tax our paychecks AND when we spend our pay? It’s BS! One or the other. Like FL no paycheck tax but i think there’s is 6% at least when we were in St Pete. Then you’re taxed on how much you spend but you can work all you want idk which is better but you get my point. 5 states have 0% sales tax but probably get it property tax etc.\n\n2 of those are NH and Delaware but if you live in NY and are gonna move i don’t think it’s to another snow belt state",
            "title_similarity": "0.7653947",
            "sentiment_compound": 0.777
        },
        {
            "id": "gzro096",
            "score": 2,
            "text": "People are gonna need all the money they can get if landlords and banks are allowed to start kicking people out",
            "title_similarity": "0.5005536",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrt8fc",
            "score": 1,
            "text": "Afaik most European countries have sales tax on everything, including food. So this seems like a strange conclusion on a international scale",
            "title_similarity": "0.6163198",
            "sentiment_compound": 0.2415
        },
        {
            "id": "gzrvdi8",
            "score": 1,
            "text": "Taxes increase costs of living? How could nobody have ever predicted this!",
            "title_similarity": "0.5152371",
            "sentiment_compound": 0.3802
        },
        {
            "id": "gzrxx83",
            "score": 1,
            "text": "European here. Are we talking VAT here or an additional tax on top of that?",
            "title_similarity": "0.40421242",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gzsctin",
            "score": 1,
            "text": "I was just talking about this last night and my gf insisted grocery store food is not taxed. We're going shopping I'mma show her the receipt this time.",
            "title_similarity": "0.51193",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzsgxbw",
            "score": 1,
            "text": "In AZ it is down to city choice. Most don't, but some mismanaged places, like Glendale, do tax food. It makes a big difference, especially considering the criminally rampant runaway inflation.",
            "title_similarity": "0.7402127",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gzsn0ja",
            "score": 1,
            "text": "This isn’t true, the lowest income families receive food stamps, negating the sales tax on food by multiple orders of magnitude, not so?",
            "title_similarity": "0.8614582",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gzt76pg",
            "score": 2,
            "text": "That country hates poor people",
            "title_similarity": "0.48876202",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gzthf3m",
            "score": 1,
            "text": "Once again, I am bewildered by the idea of a county being anything other than a bunch of pointless lines of a map that maybe meant something 50 years ago. The whole idea of county taxes or counties having any authority at all is just bizarre to me.",
            "title_similarity": "0.5937412",
            "sentiment_compound": -0.25
        },
        {
            "id": "gztxz2m",
            "score": 1,
            "text": "Wait, 2/3rds of the us doesn’t have to pay sales tax on groceries?!?!",
            "title_similarity": "0.74857944",
            "sentiment_compound": -0.3278
        },
        {
            "id": "gzu30hl",
            "score": 1,
            "text": "Europe has VAT on food items, too. Sure some countries have lower VAT on food but still. So in fact 2/3 of US counties are actually on the progressive side of things.",
            "title_similarity": "0.6951486",
            "sentiment_compound": 0.0129
        },
        {
            "id": "h565fux",
            "score": 1,
            "text": "we should make the use of [sales tax calculator](https://www.calculatored.com/finance/accounting/sales-tax-calculator) everywhere. it is a necessary education.",
            "title_similarity": "0.30818525",
            "sentiment_compound": 0.0
        }
    ]
}