{
    "Adopting a plant-based diet can help shrink a person’s carbon footprint. However, improving efficiency of livestock production will be a more effective strategy for reducing emissions, as advances in farming have made it possible to produce meat, eggs and milk with a smaller methane footprint.\n": [
        {
            "id": "gzqqzyz",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.49364328",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gzr1xr9",
            "score": -1,
            "text": "A child has a carbon footprint of about 60 tons/year. So, eat meat but don't have kids.",
            "title_similarity": "0.50616163",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzr4yvv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0077305064"
        },
        {
            "id": "gzrbfdt",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.0077305064"
        },
        {
            "id": "gzrassf",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.0077305064"
        },
        {
            "id": "gzr4z82",
            "score": -4,
            "text": "Even better is 100% lab grown meat, no need to slaughter animals.",
            "title_similarity": "0.5101938",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzr9z0v",
            "score": 0,
            "text": "Plant based diet is the way to go. It’s the best for our health, the animals and the planet. Anything else is just people on typical diets who lack the humility to make a change and stand up for something.",
            "title_similarity": "0.685362",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzr4nn0",
            "score": 51,
            "text": "Or maybe stop breeding captive living creatures with the sole purpose of slaughtering and devouring them, because that would make the world a better place regardless of carbon footprint? Just a thought.",
            "title_similarity": "0.6805771",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzr4kfs",
            "score": -4,
            "text": "You don't need to go cold turkey. \n\nLimiting to 1 meal a day, only on weekends, cut portion sizes, eating chicken instead of beef,  will all have a impact. \n\nAfter working in the meat industry I highly recommend people consider whole muscle only products so you get the benefit of great taste with less of the potential issues.",
            "title_similarity": "0.6903659",
            "sentiment_compound": 0.8313
        },
        {
            "id": "gzrhspv",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.0077305064"
        },
        {
            "id": "gzr24tu",
            "score": 15,
            "text": "I will do what I can to find it, but on The Skeptics Guide to the Universe podcast they discussed a study on methane production using satellite imagery.  What they found was that all livestock production was only responsible for I believe 3% of methane production.  Most of it was landfills.",
            "title_similarity": "0.48212177",
            "sentiment_compound": 0.3291
        },
        {
            "id": "gzr45u3",
            "score": 83,
            "text": "What a nice play on words to push a pro meat narrative.  \n\nThe entire study is based on the assumption that people will not change their diet.\n\nStop eating animals.  Save the world.",
            "title_similarity": "0.6359268",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gzrc0cg",
            "score": -2,
            "text": "Oh wow the idiot vegans just refuse to accept this. Anyone surprised? Nope.",
            "title_similarity": "0.25109524",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzrqsij",
            "score": 1,
            "text": "People will do whatever it takes to cling on to eating animals. It’s quite sad.",
            "title_similarity": "0.40063947",
            "sentiment_compound": -0.5256
        },
        {
            "id": "gzr4n0s",
            "score": -3,
            "text": "Interesting work to show that a certain seaweed fed to cattle reduces methane production by up to 90%. Not a total solution but a step in the way if it could be scaled up. https://www.future-feed.com/",
            "title_similarity": "0.7074783",
            "sentiment_compound": 0.2049
        },
        {
            "id": "gzrcvyx",
            "score": 4,
            "text": "Everybody thinks cows downgrade the environment. Cattle need cellulose, a nitrogen source, minerals , and water. Humans can not digest this diet. If you look at the big cattle states, Wisconsin, Kentucky, Texas, Florida, non of these states are in the corn belt. Cattle utilize an environmental habitat that is not useful to humans. In return we get high grade protein.",
            "title_similarity": "0.62720454",
            "sentiment_compound": -0.3412
        },
        {
            "id": "gzri0vo",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "0.0077305064"
        },
        {
            "id": "gzr1sk0",
            "score": 14,
            "text": "Properly managed pastureland is an incredible carbon sink.\n\nBut very heavy emphasis on the properly managed part.",
            "title_similarity": "0.6329378",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzr6wns",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.027004626"
        },
        {
            "id": "gzrkoj8",
            "score": -1,
            "text": "Of course, this doesn't address what is, to me, the much larger issue: the ethics of an \"industry\" that is predicted on unfathomable cruelty to sentient, feeling creatures.",
            "title_similarity": "0.40192592",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzr4ugg",
            "score": -4,
            "text": "we need less people on the planet, thats all",
            "title_similarity": "0.4423008",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzqwjef",
            "score": -36,
            "text": "Vegans on soapboxes in 3...2....1....",
            "title_similarity": "0.27451253",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrd0dx",
            "score": 4,
            "text": "What about abolishing meat industries all together? Should that be the end goal for lowest methane and carbon emissions with the title used as a transition phase?",
            "title_similarity": "0.662205",
            "sentiment_compound": -0.4515
        },
        {
            "id": "gzr7kf9",
            "score": -3,
            "text": "Not having kids is #1 on that list.",
            "title_similarity": "0.20294595",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzr55yd",
            "score": 12,
            "text": "Ahh yes reddit post, let me just saunter out to my industrial farm here and get these technologies a brewing!\n\nOr\n\nIt's up to me to dig through the behaviors of meat companies and ensure they're being ethical!\n\nOr\n\nI'm really glad this super green technology meat company is TOTALLY NOT up charging because they're more ethical!\n_________________________________________________________________\n\nYeah I think I'll keep my plant based diet, and vote with every dollar I can.",
            "title_similarity": "0.7140045",
            "sentiment_compound": 0.9744
        },
        {
            "id": "gzr5wgk",
            "score": 3,
            "text": "The biggest issue we face is nothing to do with meat consumption but rather the total amount of food waste produced. A third of all food we produce is wasted, and that food waste decomposition produces a lot more greenhouse gas than the whole farming industry. If food waste was a country it would represent the third largest greenhouse gas emitter.",
            "title_similarity": "0.5662982",
            "sentiment_compound": -0.9468
        },
        {
            "id": "gzr8869",
            "score": 14,
            "text": "Anything to not change the diet huh?\n\n Just change it, eat less meat, don't leave it to the hands of the \"concerned producers\".",
            "title_similarity": "0.6273009",
            "sentiment_compound": -0.0299
        },
        {
            "id": "gzrkrew",
            "score": 18,
            "text": "So gross. Just eat plants people! Those poor animals are suffering enough. I can't imagine what horror show \"efficiency of livestock production\" would do to them.",
            "title_similarity": "0.54166687",
            "sentiment_compound": -0.6583
        },
        {
            "id": "gzr9s23",
            "score": 13,
            "text": "Don’t tell me to stop eating meat when 71% of the worlds pollution comes from 100 of the biggest corporations. This isn’t a personal failure on our parts.",
            "title_similarity": "0.5139264",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gzs2fag",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.0077305064"
        },
        {
            "id": "gzremyb",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.0077305064"
        },
        {
            "id": "gzr85o3",
            "score": -1,
            "text": "I'll all about increasing my carbon footprint. So I'll eat your fried chicken.",
            "title_similarity": "0.5964916",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrnvb9",
            "score": -1,
            "text": "Imagine caring more about carbon than the lives of billions of sentient animals.",
            "title_similarity": "0.52971065",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzr06ri",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.0077305064"
        },
        {
            "id": "gzr5iye",
            "score": 13,
            "text": "They might as well have titled this article\n\nEAT MEAT!!!",
            "title_similarity": "0.43095684",
            "sentiment_compound": 0.4545
        },
        {
            "id": "gzr72yi",
            "score": 12,
            "text": "Or we could have legislation that goes after industrial polluters. Stop putting the burden of saving the planet on me eating soy or making only right turns when driving.",
            "title_similarity": "0.6474387",
            "sentiment_compound": -0.7964
        },
        {
            "id": "gzrar6h",
            "score": 17,
            "text": "Forcing or shaming people to give up meat was never a viable strategy anyway.",
            "title_similarity": "0.37951365",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzr7vdk",
            "score": -3,
            "text": "It’s not the cows. It’s the industry and the cars and the exploitation of resources by “first world” countries.",
            "title_similarity": "0.31135827",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzswhru",
            "score": 3,
            "text": "Literally just stop eating meat and dairy.  Just.  Stop.",
            "title_similarity": "0.3333634",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzrbpd8",
            "score": 9,
            "text": "I am in dismay at how animal agriculture is being made the scapegoat. The fossil fuel companies must be laughing all the way to the bank! Even Microsoft paying $9 million to a cattle ranch to sequester their carbon and then having Bill Gates tell us we need to stop eating meat is just insanity",
            "title_similarity": "0.53967",
            "sentiment_compound": -0.8172
        },
        {
            "id": "gzrgi24",
            "score": 0,
            "text": "It is a misconseption that a more optimized production leads to reduced emissions or production. \nOptimizing the combustion engine did not lead us to a better future. E.g. We are selling and drivin more Cars then ever.\nThe demand is increasing too fast for that.\n\nThats why I am not in favor of this headline. I do not agree.",
            "title_similarity": "0.58072364",
            "sentiment_compound": 0.6514
        },
        {
            "id": "gzr6r9q",
            "score": -6,
            "text": "But it's not a healthy diet",
            "title_similarity": "0.18722725",
            "sentiment_compound": -0.438
        },
        {
            "id": "gzr11f4",
            "score": 7,
            "text": "Legit question: doesn't increasing the food generated only eanble us to increase our population and thus requiring more food to be produced? \n\nOr will the world birth and mortality rate just plateau in the future just like what we are seeing in well developed countries?",
            "title_similarity": "0.61123264",
            "sentiment_compound": 0.7399
        },
        {
            "id": "gzqxtnx",
            "score": 15,
            "text": "Of course it is always methane. Who give a damn about N2O at all, right?",
            "title_similarity": "0.19267246",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzr3skg",
            "score": 112,
            "text": "This sounds like something funded by the livestock production industry.",
            "title_similarity": "0.4912449",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzragye",
            "score": 3,
            "text": "Carbon footprint is horseshit propaganda promoted by the actual perpetrators of climate crime; hope this helps.",
            "title_similarity": "0.6019131",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gzror49",
            "score": 2,
            "text": "Yet meat, eggs and dairy still contribute massively to all cause mortality, DT2 and so on. It's unhealthy and unethical.",
            "title_similarity": "0.4905966",
            "sentiment_compound": -0.7884
        },
        {
            "id": "gzra1js",
            "score": 3,
            "text": "I’m always confused why there’s always a debate between industry changes that have more impact on climate than personal changes which are negligible on a grander scale.",
            "title_similarity": "0.46229947",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzr37hn",
            "score": 443,
            "text": "What a misleading title, reading it could easily make you believe it is saying \"efficient\" animal agriculture is better than a plant based diet per person.\n\nThat is not what the article means.\n\nThey mean because so many folks will oppose a plant based diet that partially negating their selfish behaviour is more effective than trying to stop them being selfish. Which sadly is probably true. However, it doesn't give you, the reader, an excuse.\n\nedit: Imagine if it was about litter\n\n> Not littering [and using a bin like a real person, not a waste of oxygen] can shrink someone's litter foot print. However, improving packaging will be a more effective strategy for reducing litter.\n\nFeels gross right? Sure, it's technically correct, because people will be selfish littering jerks, but it clearly is coddling those selfish jerks so they can feel less bad about littering.",
            "title_similarity": "0.7647316",
            "sentiment_compound": -0.6909
        },
        {
            "id": "gzr5rtq",
            "score": 18,
            "text": "Why not both? Both is good.",
            "title_similarity": "0.18033046",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzr3vla",
            "score": 197,
            "text": "Confused. How would it be more efficient? Wouldn't the most efficient way be if everyone adopted a plant based diet? Rather than improving efficiency in current farming? Surely cutting it out completely would best improving efficiency?",
            "title_similarity": "0.800127",
            "sentiment_compound": 0.9513
        },
        {
            "id": "gzrcr7s",
            "score": 40,
            "text": "[removed]",
            "title_similarity": "0.0077305064"
        },
        {
            "id": "gzr939d",
            "score": 4,
            "text": "I think it is generally good to seek out workable realistic scenarios like this than counting on magic bullet solutions like \"the whole world adopts a vegan diet.\"",
            "title_similarity": "0.7226247",
            "sentiment_compound": 0.8519
        },
        {
            "id": "gzre8kp",
            "score": 4,
            "text": "Your post title is misleading. It implies that reduced emission livestock is more efficient than a plant based diet.\n\nThe problem is with your sentence structure the word \"more\" seems to be relative to the only other strategy in your title: \"a plant based diet.\"\n\nHowever, the \"more\" from the paper refers to reduced emission live stock *in addition* to plant based diets.\n\nLow emission livestock + plant based diets is more efficient at reducing methane than just pushing for plant based diets. Your title has completely changed how people are reading your post.\n\nOriginal title of paper:\n\n>The Key Role of Production Efficiency Changes in Livestock Methane Emission Mitigation\n\nConclusion from original paper:\n\n>Our results highlight the fact that (a) efforts on the demand-side to promote balanced, healthy and envi-ronmentally sustainable diets in most counties, as assumed in the TS scenario (FAO,2018), will not be suf-ficient for livestock methane emission mitigation without parallel efforts to improve production efficiency and decrease the emission intensity per unit protein produced; and (b) efforts to decrease emission intensity should be prioritized in a few developing countries with the largest mitigation potential\n\nhttps://agupubs.onlinelibrary.wiley.com/doi/epdf/10.1029/2021AV000391",
            "title_similarity": "0.8582896",
            "sentiment_compound": 0.953
        },
        {
            "id": "gzr8n6u",
            "score": 2,
            "text": "How would this be more effective than if everyone stopped consuming these products entirely? It’s greenwashing.",
            "title_similarity": "0.61779356",
            "sentiment_compound": 0.2058
        },
        {
            "id": "gzrkvkn",
            "score": 1,
            "text": "At the end of the day, it’s all propaganda to make you change your personal lifestyle instead of trying to change the systematic failures",
            "title_similarity": "0.48263785",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gzrwpiv",
            "score": 0,
            "text": "> Adopting a plant-based diet \n\nLiterally billion-trillion dollar corporations dumping waste directly into rivers and oceas, and you gonna tell ME to adopt a plant base diet. No, I don't think I will",
            "title_similarity": "0.42266023",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzs1nkx",
            "score": 2,
            "text": "I'll eat a extra steak to this. For every dislike, I'll eat another.",
            "title_similarity": "0.48118302",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzseo8o",
            "score": 2,
            "text": "We also need to acknowledge that plant-based diets with large amounts of things like almonds, quinoa, and to a degree soy can be more harmful to the environment than animal based alternatives. We also need to be significantly more critical of industrial farming practices for both animal and plant products.\n\n I took a class on plant biology, and my professor was a doctor of ecology. His suggestion was to expand food crop options, reduce almond and quinoa consumption, and focus on farming native plants as well as reduce export and import of foods due to the environmental impact of constant back-and-forth transport. We also need to develop more friendly farming practices- less pesticides, more spoil conservation techniques, more allowing animals to graze and forage naturally over raising corn and soy as fodder, and CERTAINLY supporting heirloom breeds of animals over the over-bred domesticated varieties plagued with health issues because of their being raised as walking meat and not animals that coincidentally are edible. \n\nOn that note, things like growing your own food garden and supporting neigbors with one or two cows or chickens selling their milk and eggs can make a huge impact if we all pitch in. More small-time domestic agriculture can reduce demand for mass production and the harmful techniques used therein, and right now, at this point teetering on the edge of no return with climate change, that's EXTREMELY important. \n\nThe entire industrialized food system on this planet needs a significant overhaul- remember, plant agriculture can harm wild animals just as much as industrial animal agriculture harms domesticated ones, and neither are excusable for their environmental impact at this point. Support pet chickens and cows and other farm animals raised independently, support small farms, and grow food for yourself if you can. Money talks, and a significant reduction of profit for a broken system will send a message.",
            "title_similarity": "0.7805562",
            "sentiment_compound": 0.9659
        },
        {
            "id": "gzt9a1d",
            "score": 3,
            "text": "In America, livestock only causes 4% of the overall pollution. The only reason the worldwide number is around 15% is because of innefficient methods that other developing countries use.\n\nLivestock help the environment in many ways. We can feed livestock the part of certain plants that humans can't eat like the straws of oats ot husks of almonds. Livestock can even eat the leftover waste from beer factories (none of these will harm the animals) or eat fruits and vegetables that would normally be thrown in the thrash because people waste way too much food.\n\nMyths like \"theh use too much water\" are mostly false, because most of the water they drink is rain water. \n\nNo, they don't waste land either because the land that they're on is mostly land with soil that's not suitable for plant growth, other than maybe grass and whatnot but nothing that actually people eat.\n\nWhat about the methane? Well, that's a part of a cycle, much like the water cycle. They eat grassa s their carbon intake, they give off methane to the environment and that methane gets turned into water which is given back to the grass in the form of rain.\n\nThere are just far, far better ways of reducing pollution.",
            "title_similarity": "0.75066376",
            "sentiment_compound": 0.8724
        },
        {
            "id": "gztcq4p",
            "score": 1,
            "text": "Nope, omnivorous till the end",
            "title_similarity": "0.22655894",
            "sentiment_compound": 0.0
        },
        {
            "id": "gztko3u",
            "score": 2,
            "text": "r/zerocarb\n\nwe the consumers are not responsible for the environmental crisis. eat what we evolved eating, eat what makes you feel and perform your best.",
            "title_similarity": "0.571949",
            "sentiment_compound": -0.2173
        },
        {
            "id": "gzr2lyg",
            "score": 81,
            "text": "What would have even more impact is if countries stopped subsiding meat industries.",
            "title_similarity": "0.6481043",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzr9cxe",
            "score": 21,
            "text": "Yes- instead of preventing the suffering of farm animals let’s just *checks notes* make it faster, less costly suffering.",
            "title_similarity": "0.76271796",
            "sentiment_compound": -0.5313
        },
        {
            "id": "gzrb2c6",
            "score": 8,
            "text": "So if you own an animal farm this is very good news for you and you should definitely look into it.\n\nIf you're 99.99999999% of humanity, consume less animal products.",
            "title_similarity": "0.77596205",
            "sentiment_compound": 0.7089
        },
        {
            "id": "gzsdkk9",
            "score": 9,
            "text": "University agricultural scientist that works in climate topics here. This study actually meshes well with other literature.\n\nThere was [another study](https://www.pnas.org/content/pnas/114/48/E10301.full.pdf) I like to have students read just to get an idea of how vast the ecological questions and modeling are when looking at livestock and emissions. Basically, they looked at the most extreme case of entirely getting rid of livestock in the US looking at *net* emissions rather than just gross in CO2 equivalents. That means looking at both emissions, but also carbon sinks that livestock provide ranging from crop residue recycling to maintaining grasslands (you need disturbances like grazing or else those ecosystems are destroyed). \n\nI still have some criticisms of that study that bias the estimate upward, but they still only found that in that extreme scenario, you'd only reduce US emissions in CO2 equivalents by 2.6%, and that's really at best too. Livestock can be large emitters of greenhouse gases, but they also have significant associated carbon sinks. That's also lumping together livestock, some like pigs really aren't on pasture that much, where cattle are, so I do wish they had split it up by livestock type since I'd expect there would be differences where cattle would be much more likely to already be a carbon sink.\n\nSo basically what that means is that such an action is roughly carbon neutral rather than reducing emissions significantly. There's where the premise of the OP paper comes in. At least for cattle that are already largely at least carbon neutral at least in the previous scenario, that is a prime opportunity for turning them into a good carbon sink by reducing methane emissions associated with diet. There's a lot of work going into actually making that happen, but that's still in very early stages. That is the area to target though since it's likely to give the most change in net emissions while producing food and maintaining grassland ecosystems.\n\nAs some background, I usually try to chime in agricultural topics, and this is one where there's a lot of misconceptions (at least with cattle where I have more background), largely because people just don't have a background in agricultural science (or even just farming) to call out things on the internet. Here are a few things that often come up in the background related to assessments like this study does:\n\n**Grassland.** Beef cattle spend the majority of their life on pasture (these are called cow-calf farms where calves a born and most breeding cows spend their entire life). Usually this is land like I mentioned above that is not suitable for row crops and usually has been grassland for quite some time. If you tried row crops there, you could maybe eek out some crops in the short term, but you'd need to pump that land full of fertilizer while being more prone to runoff, use more water, etc. as well as releasing even more carbon by plowing while removing the carbon sink of grass. It's very short sighted at best, but it tends to happen when a farmer is purely a row crop person rather than having both crops and livestock. We're both taking away food sources from ourselves by reducing grasslands, but also destroying endangered ecosystems like grasslands. The Nature Conservancy had a decent write-up awhile back on this: [Why Canada’s prairies are the world’s most endangered ecosystem](https://www.natureconservancy.ca/en/blog/archive/grasslands-the-most.html) Scrub trees invade these grasslands if they don't have disturbances like grazing, and you actually [lose carbon sink capacity by transitioning from grassland to trees](https://climatechange.ucdavis.edu/news/grasslands-more-reliable-carbon-sink-than-trees/).\n \nWhat's going on in the Amazon is an exception to that with cattle rather than the norm, but that's another good example of misusing land like I mentioned with grasslands to row crops. In that case, the soil type is so poor there that it's not even suited for grassland. Rainforests actually have very poor soils that quickly degrade when the vegetation that has built up there over a long period of time is removed. Usually what happens after that is cut down is that people try to get crops off it for a little bit, that fails, and then they try establishing pasture, which also does not last very long on that soil.\n\n**Life cycle.** I mentioned cow-calf farms briefly above, so for those not familiar with how beef cattle are raised, USDA has a [good overview](https://www.ers.usda.gov/topics/animal-products/cattle-beef/sector-at-a-glance/) on the life cycle of cattle. In the US at least, nearly all calves are born either on pasture or overwintering pens until grass is growing again. Their mothers typically spend all of their life on pasture and get hay in winter. When those calves are mature enough to be weaned, some are held back for eventual breeding stock to go back on pasture, while others go for meat. This is where terminology splits a bit.\n\n**Feed.** I mentioned the cows above are getting hay in winter and are otherwise eating forage. The calves after weaning are called feeders, and their dietary needs change at this point where they need more carbohydrates to reach finishing (when they're ready for butcher). This is often where the most misunderstanding is related to \"grass-fed\". Because of the pasture feeding, practically all cattle are grass-fed. The correct term here based on what they eat is grain-finished or grass-finished, but grain-finished does not mean those cattle only eat grain. Remember that [about 86% of the things livestock eat don't compete with human use.](http://www.fao.org/ag/againfo/home/en/news_archive/2017_More_Fuel_for_the_Food_Feed.html). Those grain-finished calves are eating a mix of forage, crop residue and some grain like mentioned in the study summary I just linked. Usually they stay on the same farm they were born for a time in feedlots and then are sold to those who get them to finishing.\n\nGrass-finished means these cattle are grazed to reach the finishing stage instead. There are issues with this though as I mentioned how dietary needs change over time. Trying to finish cattle just by grazing is actually more resource intensive and doesn't make use of crop residue, grain byproducts, etc. that would otherwise be wasted. There's quite a bit of [scientific literature](https://iopscience.iop.org/article/10.1088/1748-9326/aad401) about that in terms of resource use, extra greenhouse gas emissions, etc. That's not to single out criticism just on grass-finishing, but that is largely the net of why grain-finishing is actually done both from a financial and ecological standpoint.\n\nThat at least addresses some of the common misconceptions that come up in these posts, but I might try to add more background later if it's needed. That's trying to tackle a large topic in one single post, but at least it's a start for those needing some more background of what goes in to these studies and discussions.",
            "title_similarity": "0.7393229",
            "sentiment_compound": 0.9567
        },
        {
            "id": "gzqt1r3",
            "score": 4735,
            "text": "There’s a distinction to be made here between personal choices and industry choices. \n\nThe page says people are less likely to adopt a plant-based diet, so spending money on reducing methane emissions from meat farming is the better investment. \n\nEating less meat or no meat will still have more of an impact.\n\nEdit: the meatatarians have arrived.",
            "title_similarity": "0.85907674",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzr5xp3",
            "score": 190,
            "text": "This should literally be removed for the misleading title, which falsely implies that efficient meat is less environmentally harmful than eating plants.",
            "title_similarity": "0.72033775",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzriebq",
            "score": 18,
            "text": "How is this arguing that producing animal products in a more eco-friendly way is better for the earth than just not producing them at all?? This is ass-backward thinking. The best way to reduce your personal carbon footprint is to go vegan.",
            "title_similarity": "0.7825416",
            "sentiment_compound": 0.6072
        },
        {
            "id": "gzrr62k",
            "score": 19,
            "text": "The utter idiocy of ignoring the measuring the literal torture and murder of billions  of animals to justify a  \"carbon footprint\" number which is meant to distract and justify capitalist and personal murder and torture of animals, along with the destruction of forests.\n\nWake up from your personal disassociation and recognize capitalist animal torture-murder propaganda. This carbon footprint propaganda term is obfuscating personal responsibility and capitalist responsibility, while claiming to do the opposite.",
            "title_similarity": "0.5646447",
            "sentiment_compound": -0.983
        },
        {
            "id": "gzrdvde",
            "score": 2,
            "text": "Encouraging a plant based diet and investing heavily in lab grown substitutes is the way forward. Not doubling down on a system that at its core is cruel, has a massive carbon footprint even without the methane emissions, and is a WILDLY inefficient way to feed people.",
            "title_similarity": "0.72432476",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzru9vp",
            "score": 2,
            "text": "Or... don’t raise so much livestock for meat and dairy and eat common sustainable foods?",
            "title_similarity": "0.6837279",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrzaa0",
            "score": 8,
            "text": "Yeah, I like the environment but like meat more so you couldn’t make me go plant based. That impossible burger stuff is too dry for a good burger, I’m gonna stick with the real stuff.",
            "title_similarity": "0.6909782",
            "sentiment_compound": 0.8573
        },
        {
            "id": "gzrwhhz",
            "score": 27,
            "text": "I'm sorry but I hate articles like this. I feel like when people make a point of going out of their way to look down upon veganism, and make excuses as to why it's not the best idea, it's because they feel guilty because they know what they're doing is wrong and they need justification. \n\nI'm not trying to be a preachy vegan, but like this article would have served it's purpose without making it seem like an either or situation of whether you go vegan to reduce your's and only your footprint, or you support efficient ways to lower greenhouse gasses.\n\nVegans don't want to see the world dying, and so any progress is progress with emissions. We'll take it, because we know that everyone won't suddenly go vegan to save the planet. But wouldn't fighting to remove these industries completely be a good end goal to work towards? Instead of some, we lose all the emissions of these industries, and use these techniques or aspects of them for plant agriculture. I just hate when people feel the need to put down plant based diets because to make them others feel better about supporting such a terrible system.",
            "title_similarity": "0.5850557",
            "sentiment_compound": 0.9099
        },
        {
            "id": "gzrfodd",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.027004626"
        },
        {
            "id": "gzr6clx",
            "score": -5,
            "text": "If you think you’re the problem, you’re the problem. \n\n\nBig Oil wants you to believe that you are responsible for climate change.",
            "title_similarity": "0.422669",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzr6f5o",
            "score": 0,
            "text": "I work in natural gas and the market for harvesting this methane from dairies absolutely exploding right now. I work on another side of biogas where we harvest natural gas from landfills.",
            "title_similarity": "0.53555954",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzr77gl",
            "score": 0,
            "text": "I have wondered if we could do methane capture. This methane is biofuel so you could even burn it with minimal impact.",
            "title_similarity": "0.7387235",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzraax4",
            "score": 5,
            "text": "I’ll just not have kids and continue never driving anywhere instead, beats living on beans and cricket flour for the rest of my life",
            "title_similarity": "0.31855014",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrdhos",
            "score": 0,
            "text": "Most problems with our current food production is just for being lazy and short-sighted. A lot of very efficient circular economic workflows could be applied (and are already being applied by many farmers already) by using both plants and animals.  \nYou could easily set up a system were animals are feed only non-edible plants, these animals can also be raised only on land unable to sustain crops (most of the land is unable to anyways). All the animal by-products can be used as fertilizers on the crops.  \nMost of the water consumed by animals is in the form of the food they consume, so most of the \"water consumed by cattle\" kind of articles and bibliography is at least misleading on how they present the raw data.",
            "title_similarity": "0.65721166",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzrdick",
            "score": 0,
            "text": "Yeah I mean basically what they're highlighting is the difference between individual and systemic approaches to solving systemic problems such as the climate impacts of agriculture.\n\nBy implementing a feed based system that we can mandate to the handful of agricultural giants, we can affect quicker, more effective change than by trying to convince billions of individuals to change their diet and then waiting for the industry to crumble.",
            "title_similarity": "0.73857784",
            "sentiment_compound": 0.7425
        },
        {
            "id": "gzrdly7",
            "score": 0,
            "text": "Most of the food that ends up in land fills is plant based where it sits in waste producing greenhouse gases for years and years. The meat industry (at least in the US) is much more efficient than how we handle plants.\n\nIt also takes way more water to grow coconut, and almonds ( crops for replacing animal fats and fair) than it does to grow a more nutrient rich lb of beef. If we replaced all cattle with plant based alternatives we would be in the same spot.",
            "title_similarity": "0.7494793",
            "sentiment_compound": 0.7559
        },
        {
            "id": "gzrf55i",
            "score": 0,
            "text": "This is always get more traction than the vegan attacks on omnivore diets.\n\nThere was a recent study into cow feed that could [reduce emissions by 82%](https://www.theguardian.com/environment/2021/mar/18/cows-seaweed-methane-emissions-scientists). Now, given that cattle themselves are the biggest contributor from the whole industry (rather than the machinery and logistics) then this could go a long way to reducing emissions without expecting people to reduce their diet.\n\nI'm sure a lot of people could stand to eat less meat, for their own health, but the alternative approach was never going to work. It was also ideologically drive. The science behind it was sound, but \"eat less meat\" was pushed over \"produce less emissions\" as an ideological thing.\n\nIf such a feed could be feasibly mass-produced then we'd be able to cut the emissions of the cattle food industry hugely, which would have a huge global impact.\n\nHere's the key: this has a much more realistic chance of happening.",
            "title_similarity": "0.7205172",
            "sentiment_compound": 0.4437
        },
        {
            "id": "gzrgjpo",
            "score": 5,
            "text": "Why not just make milk, meat and eggs without using animals at all? \n\nMilk already has tons of plant based alternatives that make it completely obsolete. Yet, there are fermentation based methods in development to make proper milk without cows.\n\nMeat also has many alternatives, though the taste of it may or may not be 100% perfect at the moment. (Still no excuse to go plant based). Asia has been using Seitan and tofu as replacements for a long time and are well regarded.\n\nFor eggs, Just Egg is the only alternative I'm aware of, but there may be others..\n\nWhile more products make stepping away from animal products more and more attractive, we do need to decrease emissions from factory farms.",
            "title_similarity": "0.63288367",
            "sentiment_compound": 0.5233
        },
        {
            "id": "gzrhg29",
            "score": 0,
            "text": "Shaming people for eating meat and being annoyingly obnoxious about it wont change our minds, vegans.",
            "title_similarity": "0.5672657",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gzrhhc5",
            "score": 0,
            "text": "The real way to help shrink a carbon footprint is to legislate companies pollution, not to push the responsibility of climate change onto individuals.",
            "title_similarity": "0.6778019",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzrjat9",
            "score": 0,
            "text": "I’ll stick to my steak, but it would of course be great if we could raise the same cow with far less emissions",
            "title_similarity": "0.74295795",
            "sentiment_compound": 0.7684
        },
        {
            "id": "gzrjukg",
            "score": 0,
            "text": "I’ll switch to a plant based diet when Exxon gets held accountable for its pollution.",
            "title_similarity": "0.58373344",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrkaxz",
            "score": 0,
            "text": "The methane produced come from a CO2 previously absorbed by a plant. These emissions do not add to climate change because they don't add new carbon into the system as fossile fuel does",
            "title_similarity": "0.6265278",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrl9b2",
            "score": 0,
            "text": "You don’t have to give up meat but make an effort to support grass fed beef and pasture raised chicken can make a big change",
            "title_similarity": "0.6997714",
            "sentiment_compound": 0.5499
        },
        {
            "id": "gzrmqkq",
            "score": 0,
            "text": "I’m all for more efficiency, at the end of the day, it’s a lot more comforting when the ingredients list of my meat can be counted on one hand.\n\nThe only time I think I’ll really consider plant-based will be when it’s cheaper then real meat and I’m too broke for real meat.",
            "title_similarity": "0.76031333",
            "sentiment_compound": 0.734
        },
        {
            "id": "gzrnmsf",
            "score": 0,
            "text": "There is nothing you can do to reduce your carbon footprint more than not having children.  Yet this is the one thing no one wants to talk about.  But I guess we can all keep arguing about cows.",
            "title_similarity": "0.5322262",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzrom3z",
            "score": 0,
            "text": "I just chose to not have kids. My carbon footprint is now negative. I can do what I want. Eat what I want. Go where I want. It’s amazing.",
            "title_similarity": "0.63637906",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzrox0c",
            "score": 0,
            "text": "Get that lab grown meat tech going.\n\nIt's not realistic to tell people to give up eating meat.",
            "title_similarity": "0.57932544",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrp02u",
            "score": 0,
            "text": "Yeah the moment veganism was more about the planet and less about lecturing like a religion, everyone started to listen. Especially when it was rebranded as ‘plant based’ to disassociate from that history.",
            "title_similarity": "0.55791813",
            "sentiment_compound": 0.5325
        },
        {
            "id": "gzrpaz6",
            "score": 0,
            "text": "No sh**, regenerative agriculture is what we should be fighting for, eat less meat but better meat",
            "title_similarity": "0.75868237",
            "sentiment_compound": 0.2742
        },
        {
            "id": "gzrpb56",
            "score": 0,
            "text": "I love eating meat, and won't give it up. However, I made a decision a year ago that every Tuesday would be meat free.\n\nIt is a small change at least.",
            "title_similarity": "0.60921216",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gzrqghx",
            "score": 0,
            "text": "Regenerative agriculture is the way, no soy based ultra processed slop for me",
            "title_similarity": "0.5391178",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzrroh8",
            "score": 0,
            "text": "i'll worry about my carbon footprint when China takes it seriously, they opened more coal powerstations than the rest of the world closed in one year ..",
            "title_similarity": "0.45815116",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzrrv8f",
            "score": 0,
            "text": "I have to work harder to make more money to spend more money on impossible burgers. Just saying",
            "title_similarity": "0.5090921",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrwegj",
            "score": 0,
            "text": "this will go over well with vegans",
            "title_similarity": "0.43023703",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzs3gfe",
            "score": 0,
            "text": "Personal carbon footprint? Individuals arent the issue. The industry is the issue. They are the ones who need to change, people will adapt/figure it out later.",
            "title_similarity": "0.58135295",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzsc8e3",
            "score": 0,
            "text": "Your friendly reminder that 100 CEO are responsible for 71% of all global warming.",
            "title_similarity": "0.3554439",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gzsekko",
            "score": 0,
            "text": "Tell the people near lake erie that in a month when all the farm runoff poisons the water again. All forms of agriculture farming and livestock has its advantages and disadvantages.",
            "title_similarity": "0.50205743",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzsgnho",
            "score": 0,
            "text": "Livestock produced methane is insignificant compared to naturally occurring emission such as hydrates on the ocean floor during it transformation from ice into a gaseous state",
            "title_similarity": "0.5004366",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzsyxy1",
            "score": 0,
            "text": "fake food to save the planet... nah that doesn't sound like it would work",
            "title_similarity": "0.4474921",
            "sentiment_compound": -0.3421
        },
        {
            "id": "gzsyylr",
            "score": 0,
            "text": "I will never ever be vegetarian/vegan/plant-based. I do eat plants like everyone else but only plants? No.",
            "title_similarity": "0.3525433",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gzt40gt",
            "score": 0,
            "text": "I don't eat plants in any form, except the odd bit of garlic.\n\nMeat only. One meal a day.\n\nNow what?",
            "title_similarity": "0.3390432",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzt5tg0",
            "score": 0,
            "text": "Nice I'll have that premium steak",
            "title_similarity": "0.41413164",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzt61tr",
            "score": 0,
            "text": "Fixing Carbon footprint through diet is a distraction from the real problem which is corporate and state capitalism. Stop trying change public behavior.",
            "title_similarity": "0.6793177",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gzt7e7z",
            "score": 0,
            "text": "This is what annoys me about the zero-emmissions movement. They assume that it's the little people that cause the emissions, we're told to cut down on flight travel and organise waste into recyclables and non-recyclables.\n\nWhat about the big companies and corporations? They're the biggest polluter.",
            "title_similarity": "0.49838328",
            "sentiment_compound": -0.8591
        },
        {
            "id": "gztmx8x",
            "score": 0,
            "text": "Whos going to tell the vegans? Not it!",
            "title_similarity": "0.22780092",
            "sentiment_compound": 0.0
        },
        {
            "id": "gztn9y5",
            "score": 0,
            "text": "Regenerative agriculture with both livestock and crops is the way forward.  Plant based diets are devoid of nutrients and not sustainable for most people.",
            "title_similarity": "0.59786415",
            "sentiment_compound": 0.0
        },
        {
            "id": "gztwrui",
            "score": 0,
            "text": "Finally a science I can get behind with.",
            "title_similarity": "0.34564352",
            "sentiment_compound": 0.0
        },
        {
            "id": "gztzirm",
            "score": 0,
            "text": "Can we stop pinning carbon footprints on individuals",
            "title_similarity": "0.48641515",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzv4tnr",
            "score": 0,
            "text": "If you want to eat a plant based diet then that’s great. Good for you but leave the people who don’t alone.",
            "title_similarity": "0.65267277",
            "sentiment_compound": 0.2144
        },
        {
            "id": "gzr7xvl",
            "score": 216,
            "text": "This headline heavily is misleading. The study simply states that, as people will just continue eating meat, improving the efficiency of the animals slaughtering industry will have a large impact on reducing emissions. The largest impact would be of course to just \\*stop\\* eating meat, but is not even a scenario they considered.",
            "title_similarity": "0.7572632",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gzr3bgo",
            "score": 22,
            "text": "[deleted]",
            "title_similarity": "0.027004626"
        },
        {
            "id": "gzr1eoh",
            "score": 1011,
            "text": "What if in the US we stopped all the agricultural subsidies and let the free market decide?\n\nGround beef would cost 2-3x as much.\n\nThe federal government subsidizes the cost of cattle feed and as a result meat prices. If the real cost of meat was reflected in the price we wouldn’t eat so much of it and be the unhealthiest rich country.",
            "title_similarity": "0.6937393",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gzr3fx5",
            "score": 37,
            "text": "[deleted]",
            "title_similarity": "0.027004626"
        },
        {
            "id": "gzr6l39",
            "score": -5,
            "text": "Cool, how much impact would making China actually have environmental regulations do? Orders of magnitude more, you say?",
            "title_similarity": "0.52618426",
            "sentiment_compound": 0.3939
        },
        {
            "id": "gzrpvs2",
            "score": 22,
            "text": "No amount of methane reduction will ever make beef and pork production sustainable at an industrial scale. It completely ignores the resources used to raise, slaughter and distribute the animals. Not to mention run off, land usage, deforestation and antibiotic resistance due to over medicating.",
            "title_similarity": "0.53296363",
            "sentiment_compound": -0.5563
        },
        {
            "id": "gzrr88o",
            "score": 12,
            "text": "This is worded as if people shouldn't still be strongly considering adopting plant-based diets as their first option",
            "title_similarity": "0.5439888",
            "sentiment_compound": -0.2057
        },
        {
            "id": "gzriobs",
            "score": 63,
            "text": "This conveniently focuses on methane emissions, which are important contributors to climate change, but the more significant issue with meat production is the amount of land it requires. Instead of dedicating land to plants that absorb CO2 from the atmosphere, that land becomes pasture land that is degraded over time and absorbs almost no carbon dioxide in comparison. Not to mention we have to grow plants to feed the meat that we later consume, when we could just grow edible plants which is an order of magnitude more efficient.",
            "title_similarity": "0.83792126",
            "sentiment_compound": 0.2775
        },
        {
            "id": "gzrqr67",
            "score": 45,
            "text": "Anybody else wondering how these improvements in the efficiency of livestock production will affect animal welfare? Why is animal welfare always the least of anyone’s worries? Maybe that should be a reason that encouraging ppl to eat less animal products is better than making live stock production more efficient. And honestly there hasn’t been much attempt made to encourage people anyways.\nMaybe actually try before saying it doesn’t work. Spend some fraction of the money they would spend on these “improvements” on public education and making better and cheaper alternatives to animal products that people will want to eat. There’s no perfect answer to this problem but I do think animal welfare needs to be part of the equation.",
            "title_similarity": "0.81882584",
            "sentiment_compound": 0.8114
        },
        {
            "id": "gzr5bnk",
            "score": 3761,
            "text": "This is dumb, the main problem from livestock isn't methane, it's land use and water pollution. We are currently in a biodiversity crisis as well as a climate crisis, and the biodiversity crisis can have just as bad effects as the climate crisis. The main cause of species loss is habitat loss and the main reason humans clear natural habitat is to make room for livestock. Livestock farming is also the leading cause of eutrophication, a process which depletes oxygen in the waters of lakes, rivers and oceans to the point where no animal can survive. There are many other problems caused by raising livestock, such as the removal of predators from ecosystems and the spread of disease caused by fish farming, as well as many others. Assuming that simply reducing methane emissions is enough is so ill thought through.",
            "title_similarity": "0.6636739",
            "sentiment_compound": -0.9845
        },
        {
            "id": "gzrvjj6",
            "score": 13,
            "text": "Big meat and big dairy are modern day big tobacco, only with a much higher kill count",
            "title_similarity": "0.47129005",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzrazz0",
            "score": -7,
            "text": "Also, the plant based diet ruins your bones. Makes them brittle and prone to break. Ever broken a bone? IT HURTS LIKE A MOTHERFUCKER.",
            "title_similarity": "0.47419268",
            "sentiment_compound": -0.9175
        },
        {
            "id": "gzrdl2u",
            "score": -6,
            "text": "I can literally feel the vegan rage.",
            "title_similarity": "0.26126477",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzr5lvw",
            "score": 1,
            "text": "Hoofprint. Smaller methane hoofprint.\n\nYou're welcome.",
            "title_similarity": "0.45811993",
            "sentiment_compound": 0.4588
        },
        {
            "id": "gzr5z99",
            "score": 1,
            "text": "give anything for commercial fishing to not be a thing at all",
            "title_similarity": "0.17882763",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzr7ov8",
            "score": 1,
            "text": "I saw a programme recently where Greta Thunberg went to a research farm in Denmark that is currently running studies to investigate the use of additives to reduce methane produced by cattle.  \nEarly results showed that the seaweed additives were very effective. However, when quizzed on an estimated date for widescale use in farming, the study lead said the expectation was at some point between 2050-2060.",
            "title_similarity": "0.7106168",
            "sentiment_compound": 0.5256
        },
        {
            "id": "gzr8366",
            "score": -1,
            "text": "I can't wait until cultured meat becomes viable. Not only is it better for you and will probably taste better, a huge chunk of land and resources used in farming and ranching can be converted into carbon sinks.",
            "title_similarity": "0.84327614",
            "sentiment_compound": 0.7964
        },
        {
            "id": "gzr8n1l",
            "score": -1,
            "text": "I'm a pretty firm believer that lab-grown meat will be the way everyone becomes a \"vegan\". Same nutrition, same taste, animal friendly, environment friendly, and (eventually) cheaper.",
            "title_similarity": "0.6938275",
            "sentiment_compound": 0.8625
        },
        {
            "id": "gzr9ilx",
            "score": 1,
            "text": "If anyone commenting here has actual Ag experience or training, kudos, and I value your opinion. \n\nMost people just believe whatever they read on Reddit.",
            "title_similarity": "0.41814035",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzrai4r",
            "score": -1,
            "text": "I've heard before that just cutting out cow and lamb products from your diet has almost the same environmental affect as a vegan diet. Does anyone know if that's true\n\nAlso this seems like a good time to say that the aims suggested by this article are not possible to any serious degree without GMOs, which **are not bad for you as indicated by a meta-analysis of, if I recall, 2000 academic articles which found no adverse effects of GMO products.**",
            "title_similarity": "0.75397366",
            "sentiment_compound": 0.885
        },
        {
            "id": "gzrao24",
            "score": 1,
            "text": "And how can science exactly reduce the methane emmisions of domesticated livestock (the largest contributor to greenhouse emmision) that is their natural tendency and remained like that for milleniums. Except of course reducing their numbers and not artificially inseminating them.",
            "title_similarity": "0.770811",
            "sentiment_compound": 0.6124
        },
        {
            "id": "gzrbk92",
            "score": -1,
            "text": "Traditional ranching in the prarries actually leads to a massive carbon sink with the natural grass roots going down to depths of 8 feet. While a large portion of plant based food is made with palm oil which is made through clear cutting jungles.",
            "title_similarity": "0.5282279",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzrcodb",
            "score": -1,
            "text": "100 corporations are responsible for over 70% of carbon release.  The fashion and textile industry releases way more carbon than livestock.  \n\nI’m not saying there aren’t things we as individuals can do to reduce our carbon footprint and pressure corporations to reduce theirs…\n\nBut articles like this continue to put the onus on 8 billion individuals rather than the 100 corporations destroying the planet and making hundreds of billions doing it",
            "title_similarity": "0.5795605",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzrcqo5",
            "score": -1,
            "text": "i knew it, eat cows to save the planet and proliferate the cow species (of which there are many)",
            "title_similarity": "0.5422346",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzrf7yj",
            "score": -1,
            "text": "Look, I eat meat. It's delicious. But there is no denying that the amount of food (even better to think about it as energy) that an animal takes in is so, so much more than it can produce. \n\nI mean just the water content alone is staggering,  and some people are out there with no access to any drinking water.\n\nDoesn't matter how efficient you make producing meat, it's never going to be as energy efficient as not eating meat.\n\nI am speaking ENTIRELY from a point of view that looks at the evidence, and is detached from the morality involved in this question.",
            "title_similarity": "0.5914042",
            "sentiment_compound": 0.8222
        },
        {
            "id": "gzrfhw9",
            "score": 1,
            "text": "But thats still specifically worse than the emissions produced by plant-based meats, even. You know what would be even more effective of a strategy at reducing emissions from livestock production? Reducing livestock production. We get there by investing in new technologies, not giving in to the dying requests of an industry that is going to be made obsolete of its own inefficiency. Guarantee there's some biased-funding somewhere down the line here. Reducing the demand for these products via an offering of alternatives that are far less harmful for the environment to produce makes a ton more sense than pouring money into keeping factory farming alive as long as we can.",
            "title_similarity": "0.8550731",
            "sentiment_compound": 0.0607
        },
        {
            "id": "gzrgj35",
            "score": -1,
            "text": "My footprint is irrelevant when placed in contrast with Nestle’s",
            "title_similarity": "0.31237242",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrl551",
            "score": 1,
            "text": "I had an impossible burger today. It was good. But still made more sense than this article.",
            "title_similarity": "0.5258358",
            "sentiment_compound": 0.2382
        },
        {
            "id": "gzrpafc",
            "score": -1,
            "text": "Those massive herds of bison that use to roam North America did not worry about their carbon footprint. \nPerhaps less humans are the answer to lessen our carbon footprint.",
            "title_similarity": "0.6739204",
            "sentiment_compound": 0.3412
        },
        {
            "id": "gzrr9rv",
            "score": 1,
            "text": "Remove beef subsidies",
            "title_similarity": "0.45007128",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrx2uk",
            "score": 1,
            "text": "Were these studies funded by big agriculture? If so, then I think we should be skeptical. For example, most research supporting recycling in the 90s and early 2000s was actually funded by the plastics industry.",
            "title_similarity": "0.5549207",
            "sentiment_compound": 0.2212
        },
        {
            "id": "gzryj70",
            "score": 1,
            "text": "Methane isn't carbon dioxide, and doesn't have much to do with land/water usage.\n\nAlso, no matter how efficient animal production is, eliminating it entirely would always have a greater effect on its emissions. If people ate 50% fewer animal products, then that would logically cut down on all of animal farming's problems by roughly 50%, which is a lot more than the 20% improvement seen here.\n\nObviously any improvement is good, and making production more efficient might be easier (at least in the short term) than achieving wide-scale adoption of reduced-animal-product diets. But I still think the title is misleading since it implies that improving efficiency is *better* than changing diets (also because it appears to conflate methane with CO2 and ignores other effects of animal farming.)",
            "title_similarity": "0.7583535",
            "sentiment_compound": 0.9137
        },
        {
            "id": "gzrz695",
            "score": 1,
            "text": "I’m only just reading up on some of the points raised here so bear with me and I’m up for a bit of education but I can’t see why stopping the eating of meat helps. Like I said this is new on me so welcome a steer.\n\nThe table here (https://imgur.com/PiMfeBW) appears to show the split between arable and livestock emissions with 10.3% coming from arable and 5.8% from livestock. Wouldn’t the reduction in red meat eating therefore have zero impact as surely the arable practice would need to increase to meet demand?\n\nCropland (1.4%): depending on the management practices used on croplands, carbon can be lost or sequestered into soils and biomass. This affects the balance of carbon dioxide emissions: CO2 can be emitted when croplands are degraded; or sequestered when they are restored. The net change in carbon stocks is captured in emissions of carbon dioxide. This does not include grazing lands for livestock.\n\nCrop burning (3.5%): the burning of agricultural residues – leftover vegetation from crops such as rice, wheat, sugar cane, and other crops – releases carbon dioxide, nitrous oxide and methane. Farmers often burn crop residues after harvest to prepare land for the resowing of crops.\n\nRice cultivation (1.3%): flooded paddy fields produce methane through a process called ‘anaerobic digestion’. Organic matter in the soil is converted to methane due to the low-oxygen environment of water-logged rice fields. 1.3% seems substantial, but it’s important to put this into context: rice accounts for around one-fifth of the world’s supply of calories, and is a staple crop for billions of people globally. \n\nAgricultural soils (4.1%): Nitrous oxide – a strong greenhouse gas – is produced when synthetic nitrogen fertilizers are applied to soils. This includes emissions from agricultural soils for all agricultural products – including food for direct human consumption, animal feed, biofuels and other non-food crops (such as tobacco and cotton).\n\nLivestock & manure (5.8%): animals (mainly ruminants, such as cattle and sheep) produce greenhouse gases through a process called ‘enteric fermentation’ – when microbes in their digestive systems break down food, they produce methane as a by-product. \n\nThis means beef and lamb tend to have a high carbon footprint, and eating less is an effective way to reduce the emissions of your diet.\nAlso there would still be an environmental impact on removing livestock eating I would have thought. In the UK we use hedgerows for livestock farming which are vital for healthy soil which stores more carbon.  Widespread industrialisation of all agriculture removed a lot of these hedges.\n\nThe retention of grassland instead of conversion to crops is essential as it acts as a sponge against flooding and further soil erosion, and removes carbon from the air, with most grassland managed by livestock grazing, which also presumably leads to greater animal biodiversity as the removal of grasslands and hedgerows to accommodate more crops would remove the habitat of much wildlife. As they graze the manure produced is used for crops, so I would have though that without this artificial fertiliser will need to be used for the crops which has huge environmental impact, made worse by arable becoming the only food source surely. It still would reduce the need for import/export of food to areas not suited to crops as well.\n\nIs the problem with meat or with the industrialisation of all farming? Wouldn’t buying local and ignoring the big corporations have more of an impact? Wouldn’t this be better than eating mass produced energy burning methods of vat grown substitutes?",
            "title_similarity": "0.7468993",
            "sentiment_compound": 0.9909
        },
        {
            "id": "gzsa39i",
            "score": -1,
            "text": "Oh ya? Ask Mexico about their avocado industry impact to the environment then we can discuss your plant-based diet.",
            "title_similarity": "0.63468605",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzsbo1c",
            "score": 1,
            "text": "People are omnivores, we eat meat. Asking people to cut out a vital part of their diet is like asking them to jump off a building. That's not a solution. Finding better ways to raise live stock is a great first start, but we are going to need lab grown meat in the future. Not to cut down on carbon emissions, but just to feed people. We are quickly growing to a point where we may outpace our ability to feed everyone. And I feel prices are rising as a result, to keep the rich fed while the poor slowly starve.",
            "title_similarity": "0.6836896",
            "sentiment_compound": 0.787
        },
        {
            "id": "gzsebf5",
            "score": 1,
            "text": "Under 100 corporations Contribute to over 70% of the ENTIRE OF THE WORLDS EMITIONS. BETTER TO FOCUS ON THEM.",
            "title_similarity": "0.33796272",
            "sentiment_compound": 0.5622
        },
        {
            "id": "gzskozg",
            "score": -1,
            "text": "Plant based diets are actually pretty bad for the enviroment carbon- footprint wise and kill A LOT of animals. Not only do you have to use more pesticides but the amount of animals killed while farming is in the billions.",
            "title_similarity": "0.633445",
            "sentiment_compound": -0.8481
        },
        {
            "id": "gzsovho",
            "score": -1,
            "text": "Is there’s no moderators or are they shoving their vegan lifestyle down our throat?",
            "title_similarity": "0.38803685",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzstkf0",
            "score": 1,
            "text": "Just stop eating animals. It's really quite simple.",
            "title_similarity": "0.35739934",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzsy7da",
            "score": -1,
            "text": "Some people in this thread need to really get of their high horse",
            "title_similarity": "0.22627424",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzsza9c",
            "score": 1,
            "text": "Please post this r/lobbying it's not proper science and is juat lobbying from tye agricultural sector.",
            "title_similarity": "0.44624472",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzszfuf",
            "score": 1,
            "text": "OP is trash.\n\nPeople need to wake up and realize it’s the year 2021. There is a plant-based alternative for literally every single animal product you can imagine. “Oh but it doesn’t taste the sameee” shut up and try another brand you belligerent and ignorant child.\n\nStop paying for people to breed and slaughter animals for food. You’re ruining the planet, and you’re abusing animals and your own body in the process.",
            "title_similarity": "0.5317427",
            "sentiment_compound": -0.899
        },
        {
            "id": "gzt0y9x",
            "score": 1,
            "text": "My experience with a vegan diet is a disaster.  Got me really sick and I reversed eating meat. We are part of the everioment... if we get unhealthy the environment get unhealthy as well... i never felt better eating a paleo diet. I literally eat no process foods for over 4 years now, and I am healthier at 40 than at 30 (vegan).",
            "title_similarity": "0.5622417",
            "sentiment_compound": -0.9517
        },
        {
            "id": "gzt1umk",
            "score": 1,
            "text": "Efficiency, the cruelest form of farming",
            "title_similarity": "0.46819702",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzt3chz",
            "score": 1,
            "text": "Going vegan is not hard whatsoever. Where do you get your food? The grocery store, which sells a more than adequate supply of plant based foods which you can obtain 100% of your daily essential nutrients from.\n\nIt is your duty to the planet to stop consuming animal products.",
            "title_similarity": "0.59625244",
            "sentiment_compound": 0.0707
        },
        {
            "id": "gzt4awn",
            "score": 1,
            "text": "But killing animals is ghastly. Who gives a f about making animal farming ok become they can do a smaller footprint. It’s really missing the point",
            "title_similarity": "0.6194422",
            "sentiment_compound": -0.8196
        },
        {
            "id": "gzt4wws",
            "score": -1,
            "text": "Also, eating more pork and chicken instead of beef helps. Beef produces significantly higher carbon emissions.",
            "title_similarity": "0.71663916",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gztc5tc",
            "score": 1,
            "text": "Why not just become vegan?",
            "title_similarity": "0.33457705",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzteyro",
            "score": 1,
            "text": "Uhoh someone’s stumbled across the actual science of agriculture, livestock, and sustainable farming, and vegans are about to get pissed",
            "title_similarity": "0.5885489",
            "sentiment_compound": -0.6369
        },
        {
            "id": "gztn4nz",
            "score": 1,
            "text": "Yes, an innovation in which we can mass murder trillions of animals but in an environmental friendly way!",
            "title_similarity": "0.6585331",
            "sentiment_compound": 0.6588
        },
        {
            "id": "gzua427",
            "score": 1,
            "text": "This. The vast majority of agricultural land in the world is not arable for plants. It's rangeland that can only produces grasses. Cows can eat grasses. If we did away with meat completely it would devastate sustainability as we'd have to double the current plant agriculture resulting in huge decreases in sustainability efforts. \n\nThe current meat industry is also unsustainable as it mainly relies on corn and soybeans grown on land the is usable for plant production. \n\nI really wish people would stop thinking in all or nothing and shaping policy and legislation around it.",
            "title_similarity": "0.642401",
            "sentiment_compound": -0.3117
        },
        {
            "id": "gzuduz4",
            "score": -1,
            "text": "Y'all TRY to find a reason to make people feel bad about anything. People have always eaten meat, plenty of people like meat and find it efficient in terms of fuel and getting full. Vegans are re*arded since they can't even comprehend that. Glad their diet is usually more difficult/expensive just because of their unwarranted sense of moral superiority.",
            "title_similarity": "0.61005026",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gzuexy2",
            "score": -1,
            "text": "100 companies cause 71% of all greenhouse gases to be emitted.",
            "title_similarity": "0.30021554",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzuikv9",
            "score": -1,
            "text": "Almost all meat is non-toxic for humans to eat, almost all plants are toxic for humans to eat.",
            "title_similarity": "0.5283285",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrmaol",
            "score": 82,
            "text": "It won't. The largest chunk of emissions are embedded in the production chain. \n\nLet's see the article:\n\n> We found decreasing trends in emission intensity for major livestock categories during the past two decades due to increasing production efficiency. \n\nThis just means conversion to  more intensive animal farming (i.e. CAFOs) with breeds of animals that grow more and make more milk than older/traditional breeds.  Like how China is building vertical pig \"hotel\" farms.\n\n>Based on this finding, we constructed our “improving efficiency” \npathway, assuming a continuing decrease of emission intensity. Under this pathway, the future will see (a) a continuation of the country-specific historical trends of the development of gross domestic product \n(GDP) per capita for countries showing decreasing emission intensity during the past two decades; \n\nIt's hilarious that they think GDP growth helps with climate change. They're just describing a country doing more intensive animal farming. \n\n>and (b) constant emission intensities for countries that experienced no change or an increasing emission intensity in the past two decades. \n\nAnd the countries that are already at that level won't be improving, because they're already at that plateau of \"efficiency\".\n\nTheir Figure 1, Global livestock methane emission changes from 2000 to 2018 (a), and global and regional changes in livestock methane emissions between the periods 2000–2004 and 2014–2018, is even funnier, as it's showing* greater methane emissions from the sector than FAOSTAT. The (b) figure confirms that the improvement was coming from the developing / middle-income regions which are upgrading from more extensive animal farming (i.e. grazing) to CAFOs; while Eastern Asia (ESA) is looking maxed out already on efficiency. \n\n>Globally, we found that 88%–91% of the livestock methane emissions come from enteric fermentation (Ta-\nbleS2), and are dominated by cattle, sheep, goats, and buffaloes\n\nYeah. Especially the grazed ones.\n\n>Dairy cows and meat and other non-dairy cattle in developing countries are the major contributors to the increase of livestock methane emissions during 2000–2018\n\nYep.\n\n>During 2014–2018, methane emission intensity per kg of protein produced is the lowest for poultry meat  and eggs, followed by swine meat , because of negligible enteric fermentation emissions from monogastric (Figure2)\n\nIndeed. \n\nFigure 2 is nice, it basically shows where the animals are outside.  And they continue to show higher emissions than FAOSTAT.\n\n\nFigure 4: The prediction... they show methane emissions from the animal farming sector going up about +50%.\n\nThis isn't an environmental study, all it predicts is that meat and dairy will be relatively cheaper in those regions (or where they export) thanks to improved efficiency. Why do people keep* falling for Jevon's paradox?  This is not a climate solution, it's bad news for climate stability. \n\n>Livestock productivity of milk and beef in most developed countries is already high nowadays (methane emission intensity is already low; Figure2), and there is only little room for methane reduction through productivity increase (FigureS10).\n\noh, thanks for saying it, I guess.\n\n>On the other hand, further productivity increase requires high shares of concentrates (i.e., potential competition with human nutrition from \nplant-based food [Gill etal.,2010]) and encounters potential health prob-\nlems in cows (see review by Herzog etal.,2018).\n\nYeah. That's where the big GHG emissions are once you add them up. \n\n>In addition, the intensive livestock breeding and management have resulted in fragile systems that do not adequately handle their manure, causing air and water pollution. \n\nIndeed. \n\nOne for the average redditor:\n\n>There is a trend that some developing countries are moving from \nhigh efficiency systems toward more extensive livestock systems (such as \n“free range” chicken and grass-fed beef; e.g., Cheung & McMahon,2017). \nTherefore, there is a possibility that the emission intensity per kg of protein in those developed countries will increase, which is the opposite of \nour assumption of constant decreasing emission intensity.\n\nYep. That's even worse for the climate. \n\nAll in all the study is just describing animal agriculture industrialization (\"green revolution\") in developing countries. The climate is still getting fucked by this sector.\n\nReal reductions come from not wasting resources on eating second-hand proteins.",
            "title_similarity": "0.7246058",
            "sentiment_compound": 0.9874
        },
        {
            "id": "gzrbyn2",
            "score": -8,
            "text": "God made the animals for us to eat\nNoone complained during ratios\nCave man didn't live on berries or do amazon tribes",
            "title_similarity": "0.43139347",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzrc60y",
            "score": 369,
            "text": "Misleading. The article doesn't actually seem to say that lower methane livestock is better environmentally than plant based diets. It just seems to imply that it is easier to not have to convince people to change their diets.",
            "title_similarity": "0.76134425",
            "sentiment_compound": 0.0155
        },
        {
            "id": "gzrbsfy",
            "score": -2,
            "text": "While I'm not interested in a plant based diet, this is something I can get behind.  Lowering the industry's carbon footprint can have a more widespread effect than converting small numbers of people to plant based diets.",
            "title_similarity": "0.78086907",
            "sentiment_compound": -0.5037
        },
        {
            "id": "gzrktmg",
            "score": -2,
            "text": "This is how vegans and vegetarians should think instead of closing streets with signs that say stop killing cows and going into private properties to release livestock. Respect to OP for sharing and everyone behind this study!",
            "title_similarity": "0.67757165",
            "sentiment_compound": -0.2481
        },
        {
            "id": "gzrpeuv",
            "score": -2,
            "text": "I've said this many times to vegans.  But they don't want to hear it.\n\nAs for \"animal cruelty\" issues, I have recommended they work to get regulations and laws more stringent as well as better enforcement.  They don't want to hear that either.\n\nIt's either vegan or you are a Nazi/baby-killing/lying/supporter of rape/ignoramus.  (I've been told that I am all those things.)",
            "title_similarity": "0.5742725",
            "sentiment_compound": 0.2685
        },
        {
            "id": "gzrv2kf",
            "score": 2,
            "text": "Just my two cents, but I think the distinction should be less about meat vs plant-based, and more about sustainability through localization. I’m personally a vegetarian, but if I were to have my vegetarian food imported from all corners of the globe, that would still be problematic IMO. To me, what is important is that I get as much of my produce, eggs, and cheese from my local farmers market as I can. We can’t grow everything here in Canada, so I do pick up a few things from the grocery store, but I try to reduce that as much as possible. A similar approach can be taken easily with meat; buy from your local farmer, and if you need to go to the grocery store, just think critically about what you’re buying from there.",
            "title_similarity": "0.73732084",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gzs03fu",
            "score": 2,
            "text": "Go to lab grown meat.  Much lower emissions and no animals are harmed!",
            "title_similarity": "0.6505865",
            "sentiment_compound": -0.7777
        },
        {
            "id": "gzs2s7f",
            "score": 2,
            "text": "If scientists come up with multiple ways to reduce meat industry emissions but you still demand everyone stop eating meat, it’s pretty obvious you’re not concerned about emissions.",
            "title_similarity": "0.6190628",
            "sentiment_compound": 0.1901
        },
        {
            "id": "gzt7a61",
            "score": -2,
            "text": "Climate change is fake. Obama owns a multi-million dollar mansion right next to the ocean...",
            "title_similarity": "0.27246618",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzrmahg",
            "score": 181,
            "text": "How come no one talks about over fishing the oceans is our biggest problem next to farming? Our oceans are being wiped out and massively polluted by fishing  gear. If we cut out fish and meat, we may have a planet to live on by 2050",
            "title_similarity": "0.51777446",
            "sentiment_compound": -0.8402
        },
        {
            "id": "gzrkwwf",
            "score": 68,
            "text": "The study doesn’t factor in emissions from deforestation which is a massive problem as animal agriculture expands in the tropics.",
            "title_similarity": "0.55825514",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzrpr82",
            "score": 847,
            "text": "This is a misleading title.",
            "title_similarity": "0.099394545",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzr5e76",
            "score": -4,
            "text": "We should fit fart bags on the asses of all livestock to collect the gas and process.",
            "title_similarity": "0.44595936",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzrd4zr",
            "score": 3,
            "text": "The methane isn’t so much of a big deal as the fact we grow more than %50 of our food to feed to animals, that’s just an absolutely insane amount of habitat loss. Honestly depressing flying in the USA because all you see is farms and big cities where there was once beautiful forest, prairie, wetlands, etc….",
            "title_similarity": "0.62206835",
            "sentiment_compound": 0.0018
        },
        {
            "id": "gzsdxqc",
            "score": 4,
            "text": "What is up with these critiques on the article? It’s obvious plant based diets are more efficient, the article never refuted that. But to think more 20% of the population is going to be willfully changing to said diet is disingenuous, so why not address 80% of the people?",
            "title_similarity": "0.6220145",
            "sentiment_compound": 0.3413
        },
        {
            "id": "gzspg2u",
            "score": 2,
            "text": "How about reducing a persons suffering footprint? Does anyone have any ideas? If only there was a sure fire way to reduce the unfathomable suffering and despair of billions of factory farmed animals.",
            "title_similarity": "0.6511055",
            "sentiment_compound": -0.8385
        },
        {
            "id": "gzrkkc5",
            "score": 12,
            "text": "The problem is if you only focus on carbon footprint you're never going to win. \n\nLivestock production destroys far more than just the air we breathe. It destroys the land, water, air, harms food security, and the obvious lives of the animals being slaughtered.",
            "title_similarity": "0.5669432",
            "sentiment_compound": -0.9296
        },
        {
            "id": "gzr5lia",
            "score": -5,
            "text": "I can’t wait until meat is made in labs and indoor vertical farming takes hold.",
            "title_similarity": "0.4960936",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrtlt1",
            "score": 3,
            "text": "Yes, what we need is more corporate, industrial agriculture.... WRONG!!!",
            "title_similarity": "0.4979365",
            "sentiment_compound": -0.4605
        },
        {
            "id": "gzrrqab",
            "score": 17,
            "text": "So misleading, also for those of us in western developed nations this is not the case the main benefits they mention relate to China, India and developing nations. \nFollowing one of the papers sources Gill et al. (2010). Increasing efficiency includes improved breeding - increasing yields through selective breeding. \nWe already have broiler chicken that grow so fast their bones can't handle leading to bowing of the legs or spine... Yeh let's fix climate change by breeding cows to be big milk balloons we roll around the warehouse floor! Or ya know just have milk made from soy/almond/oat/cashew/hazelnut etc.",
            "title_similarity": "0.69914126",
            "sentiment_compound": 0.6704
        },
        {
            "id": "gzrwdkh",
            "score": 22,
            "text": "Anything to avoid personal responsibility",
            "title_similarity": "0.18402427",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzsxg2g",
            "score": 9,
            "text": "Weird bunch of carnivores in here",
            "title_similarity": "0.2047997",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzrqa5c",
            "score": 12,
            "text": "Unfortunately, this doesn't take animal welfare into consideration...\n\n(It's bad.)",
            "title_similarity": "0.30056036",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gzscjjg",
            "score": 878,
            "text": "When reading the study itself, we see there's a discrepancy between the article and the study. They've reworded the findings to make a different argument.\n\n**Article**: \"Adopting a plant-based diet can help shrink a person’s carbon footprint. But a new study finds that improving the efficiency of livestock production will be an even more effective strategy for reducing global methane emissions.\"\n\n**Study**: \"Our results highlight the fact that **(a)** efforts on the demand-side to promote balanced, healthy and environmentally sustainable diets in most counties, as assumed in the TS scenario (FAO, 2018), **will not be sufficient for livestock methane emission mitigation** ***without*** **parallel efforts** to improve production efficiency and decrease the emission intensity per unit protein produced; and **(b)** efforts to decrease emission intensity should be prioritized **in a few developing countries** with the largest mitigation potential.\"\n\nSo they're saying that based on their findings, both are needed, but they think (b) should be prioritized in some developing countries due to their conditions. They don't seem to factor in methane from the animal feed production, but only count methane from the animals themselves. Probably because they mostly compare grain-fed animals with grass-fed ones rather than comparing meat-fed humans with plant-fed ones.\n\nBased on the article's argument (not the study), which seems to be claiming plant-based diets are less effective than improving efficiency, there's a problem in not counting animal feed into the equation. In a 100% plant-based diet, the only pollution comes from the production of the plants. With meat, however, the pollution comes from both the production of the plants as well as the animals. Not only that, on average you need about 3 kg of feed per 1 kg of meat. Some types of meat, like beef require a shocking 25 kg. A large portion of our grain production goes towards livestock. The majority of soy goes to feed livestock as well. You also end up using 50 000 liters of water for 1kg beef, versus only 1000 liters for 1kg wheat or 2000 liters for 1kg soy or rice.\n\nWhen it comes to methane, you have to factor in the methane from plant production **AND** the livestock. If you just compare livestock farts to grain production emissions, you're not factoring in every variable. In a hypothetical world where every human has a plant-based diet, the amount of plant material humans eat would increase by an additional 600 calories per day, but the amount used to feed animals would decrease by 100%. So there's a huge difference in how much additional plants you have to produce to support a plant-based diet versus a meat-based one. You have to factor in the methane from the production of the plants used to feed the animals as well as the methane produced by the animals themselves.\n\nBy no means do you have to eat three times as much when living off of a plant-based diet, nor do you need to drink and additional 48 000 liters of water per kg you eat. So there's no way that producing that 1kg meat can somehow end up using less water or plants, or producing less emissions than a plant-based diet. On top of all of this, meat production requires huge amounts of antibiotics, which goes into the water and increase the amount of antibiotic-resistent bacteria.",
            "title_similarity": "0.885617",
            "sentiment_compound": 0.9942
        },
        {
            "id": "gzrsemo",
            "score": 22,
            "text": "Surely increasing livestock efficiency can only be detrimental to animal welfare? As if it wasn't bad enough in its current state?",
            "title_similarity": "0.71578085",
            "sentiment_compound": 0.8229
        },
        {
            "id": "gzr9s9a",
            "score": 1,
            "text": "Sorry pal, 10% efficiency gains on business as usual simply isn't enough. Everyone can have one exception, but we can't make exceptions for everything. So you can have your steak OR new clothes every month OR a yearly plane holiday OR a car, but not all at once, not even when they all emit 10% less.",
            "title_similarity": "0.53142273",
            "sentiment_compound": 0.705
        },
        {
            "id": "gzramzu",
            "score": 1,
            "text": "I eat meat, but I fully support ending this horrific nightmare we put animals through.",
            "title_similarity": "0.5207185",
            "sentiment_compound": -0.4785
        },
        {
            "id": "gzrat1v",
            "score": 1,
            "text": "What are the technologies being alluded to here? \n\nPossible take: We have problem caused specifically by the industrialised model of agriculture. We lack the flexibility to challenge this and live in genuinely better, more wholesome and sustainable ways, so we throw tech at the problem, and someone gets rich off it. Meanwhile, the fundamental problems are temporarily ameliorated but build up into an even bigger bubble.",
            "title_similarity": "0.6492783",
            "sentiment_compound": -0.0258
        },
        {
            "id": "gzrbieo",
            "score": 1,
            "text": "Climate emergency measures for centrists",
            "title_similarity": "0.32031822",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzrc0lp",
            "score": 1,
            "text": "People will mostly support the meat industry that is cheap(by support, i mean bying it) rather than the ethical one. Besides, imagine you order a pizza, or any food that contains meet(or any animal product) in it, well, you have no idea whether its made with a smaller or larger footprint. The statements saying we have some kind of technology in the works to make non vegan foods less polutent/unhealthy/ethical just give an excuse to meat-eaters to continue with their non ideal diets, when they would otherwise do the effort to cut the meat.",
            "title_similarity": "0.7288395",
            "sentiment_compound": 0.8807
        },
        {
            "id": "gzrc0vr",
            "score": 1,
            "text": "Ok, I am a bit confused because farming animals eat agricultural waste materials and food waste, if you stop producing meat this will be not consumed and will rot, digested by bacteria etc, producing a similar output of methane and co2 without producing meat, I don’t understand why this is never taken in consideration.",
            "title_similarity": "0.6747849",
            "sentiment_compound": -0.8442
        },
        {
            "id": "gzrcgzq",
            "score": 1,
            "text": "this is only true because of the massive consumption of those things already in place. the way this is worded is a little fucky. idk if its an accident or by choice. either way, thats a *major* qualifier to the way this data is presented.",
            "title_similarity": "0.39924365",
            "sentiment_compound": -0.1082
        },
        {
            "id": "gzrdgvw",
            "score": 1,
            "text": "What percentage of CO2 emissions would be eliminated if each consumer made purchase decisions that minimized their carbon footprint?",
            "title_similarity": "0.621681",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrearp",
            "score": 1,
            "text": "What about lab grown meat?",
            "title_similarity": "0.41508782",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrettx",
            "score": 1,
            "text": "Best solution: cultured/3D printed meat. Everyone gets what they want, no more livestock.",
            "title_similarity": "0.5213214",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gzrgan2",
            "score": 1,
            "text": "We should all be doing what we can to reduce our individual carbon footprints, AND we should be enacting legislation against the greatest polluters of our planets corporations. Their impact is far greater then civilians and it’s disgusting how often we are told to change (as every little impact matters) yet the individuals that would be able to have the most significant consistently don’t because they’d rather line their pockets than to let the next generation live in a habitable planet",
            "title_similarity": "0.6181799",
            "sentiment_compound": 0.2992
        },
        {
            "id": "gzrisj6",
            "score": 1,
            "text": "Aren't we all already in agreement that our individual carbon footprint is an exponential fraction compared to what even one single government contributes?\n\nSeriously asking.",
            "title_similarity": "0.43080196",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzrjpd2",
            "score": 1,
            "text": "Why not both? Some have already jumped on the train to vegetarianism and veganism and other need a push ... so regulate the industry more and more every couple of years to reduce emissions for the bit of meat production that remains, with the full aim to eventually wind down operations completely by a certain date but reducing emissions so far as is practicable in the meantime.\n\nHell, use the need to reduce emission ***AS*** the means of winding down these industries. When people who are on the fence see prices of meat, eggs and milk rise, they'll make the switch naturally.",
            "title_similarity": "0.72271806",
            "sentiment_compound": -0.7729
        },
        {
            "id": "gzrjsey",
            "score": 1,
            "text": "The article mentions that high yield breeds are one answer to improve efficiency. What does that entail? \n\nI'm curious how those breeds are achieved (ethical side of things) and what effects on the nutritional aspect  are.",
            "title_similarity": "0.72698224",
            "sentiment_compound": 0.875
        },
        {
            "id": "gzrkkfh",
            "score": 1,
            "text": "Lab grown meat is going to kill animal factory farming.",
            "title_similarity": "0.50239325",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzrknlc",
            "score": 1,
            "text": "Put 12 instead of 8 Chickens in that tiny cage in which they can't even move.\nLets save the planet with animal cruelty, not with actual positive change.",
            "title_similarity": "0.49982578",
            "sentiment_compound": -0.5609
        },
        {
            "id": "gzrko2h",
            "score": 1,
            "text": "In the early automobile era investing in making horses slightly faster was more efficient than investing in making the rarely used car faster. Terrible, misleading title.",
            "title_similarity": "0.5601975",
            "sentiment_compound": -0.4033
        },
        {
            "id": "gzrl9yj",
            "score": 1,
            "text": "You can also cut down on your carbon footprint by limiting the amount of red meat you eat.  Cattle produces a lot of methane.  Lamb is the worst in terms of their emissions to growth ratio",
            "title_similarity": "0.7367054",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzrls4i",
            "score": 1,
            "text": "Problem is solved if you get rid of mass-rearing of cattle. \n\nMake people buy organic from their local producer for four times the price.",
            "title_similarity": "0.6770923",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzrm2fb",
            "score": 1,
            "text": "If this is true, then show me the data, and more importantly, how the data was calculated.",
            "title_similarity": "0.26445007",
            "sentiment_compound": 0.659
        },
        {
            "id": "gzrm9ie",
            "score": 1,
            "text": "Reminds me of this documentary I watched called “Kiss the Ground”. Really cool and informative documentary. It’s all about how farming and cattle production effect the earth and talks about a different type of farming that negates this issue (or is at least more sustainable). I really recommend anyone with Netflix to watch it.",
            "title_similarity": "0.7041725",
            "sentiment_compound": 0.6582
        },
        {
            "id": "gzrmk7b",
            "score": 1,
            "text": "lab grown meat will be the answer.",
            "title_similarity": "0.48943534",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrnnaj",
            "score": 1,
            "text": "Not as much as going plant base I imagine though. I feel we are only going to get there when we can grow meat without the animals. Like insulin outside horses.\n\nEdit: good stuff still",
            "title_similarity": "0.7305069",
            "sentiment_compound": 0.1999
        },
        {
            "id": "gzrnoeu",
            "score": 1,
            "text": "Completely ignoring the ethical considerations of butchering and consuming other living things that feel pain and are shown to express emotions. \nBut if you monitor plants, you can hear them \"express\" pain & discomfort as well. The meatatarians? The vegetarians? Animals AND plants would consume US if afforded the opportunity,  so let's consume EVERYTHING!!! SOYLENT GREEN IS PEOPLE!!!",
            "title_similarity": "0.6251354",
            "sentiment_compound": -0.7346
        },
        {
            "id": "gzrp73f",
            "score": 1,
            "text": "Ah yes, titles with two totally unrelated sentences.\n\nMethane is bad, but was never the un-fixable problem.",
            "title_similarity": "0.39636487",
            "sentiment_compound": 0.4071
        },
        {
            "id": "gzrpkju",
            "score": 1,
            "text": "It said that making supply chain changes would be more effective than demand-side and I think I may have to disagree.\n\nI get that making less methane producing cattle would be the most beneficial. I don't think that cross breeding and a better diet would really be the solution.\n\nImporting cattle that has more carbon free logistics, or the beef and milk direct would accomplish that.\n\nThis is also not taking in the variables of beyond meat and other disruptions that aren't marketed to the global south. It could be a more affordable alternative, and with a generation growing up on it would pay off better then modified cattle.",
            "title_similarity": "0.84741086",
            "sentiment_compound": 0.9488
        },
        {
            "id": "gzrpssf",
            "score": 1,
            "text": "I thought we were supposed to be eating bugs like the overlord bill gates wants us to",
            "title_similarity": "0.46343473",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzrq2sf",
            "score": 1,
            "text": "u say smaller methane footprint but beans make me fart like it's going out of style",
            "title_similarity": "0.5562",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gzrq3ht",
            "score": 1,
            "text": "I've had a pretty easy time transitioning to a mostly vegetarian diet. I'm not completely plant based, but some days I am! Some days I eat meat, some days I eat dairy/eggs, but usually only for one meal. It's not perfect by any means, but at least I'm trying. \n\nWhat if, industry reduced their emissions AND people reduced their intake? #dreamwork",
            "title_similarity": "0.73028564",
            "sentiment_compound": -0.3047
        },
        {
            "id": "gzrrmfd",
            "score": 2,
            "text": "Shrinking C footprint is not the main answer.  We need to capture C, and to do that we need to bio char/terra preta.",
            "title_similarity": "0.62143016",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrsfxo",
            "score": 6,
            "text": "Only more effective in the sense that people don't have to change anything to make it happen. Objectively less effective if people are willing to change.",
            "title_similarity": "0.5028426",
            "sentiment_compound": 0.7351
        },
        {
            "id": "gzrsx8p",
            "score": 1,
            "text": "If labs can grow meat that tastes the same, has the same or better nutritional value, and the same or better texture while not producing any of these greenhouse gasses, why can't people just eat the lab meat. That way people won't be forced to change their diets.  We can even pay the farmers and put the labs on their land and then make the rest of their land grow plants. It will keep them employed and the supply chains to get the meat from the labs to people would all ready be set up since they are on the farms.",
            "title_similarity": "0.7923449",
            "sentiment_compound": 0.8952
        },
        {
            "id": "gzrt0d7",
            "score": 1,
            "text": "The whole industrial farming system is at fault. Healthy soil is LIVING soil with organisms, NOT a chemically charged medium devoid of fauna. I've been learning about regenerative farming lately and it isn't popular.  But we need to make it be.  Relying on reducing carbon footprint only slows the process.  We certainly need to do it, but not extreme measures like a family of 4 living in a 100ft2 mini house.  But altering land management is much more effective",
            "title_similarity": "0.8079773",
            "sentiment_compound": 0.6537
        },
        {
            "id": "gzrtxxp",
            "score": 1,
            "text": "There was a recent Danish study on this with similar conclusions \n\nhttps://www.reddit.com/r/science/comments/n8yym5/a_pathway_to_carbon_neutral_agriculture_in_denmark/",
            "title_similarity": "0.5481827",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzru4xo",
            "score": 3,
            "text": "Both is good. It shouldn't be an \"either or\" situation.",
            "title_similarity": "0.28139234",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzruoua",
            "score": 2,
            "text": "This is not an either / or. We need much less meat consumtion and massive changes to industry practices. And we need this now.",
            "title_similarity": "0.58779186",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzruzgg",
            "score": 1,
            "text": "US does not include live stock emission in according to Paris Accord.  One of the reason US left the Accord.",
            "title_similarity": "0.35979122",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrv0tp",
            "score": 1,
            "text": "Maybe we can just stop making so many people?",
            "title_similarity": "0.39012647",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzrvq5w",
            "score": 1,
            "text": "Where I live (India) majority of farm animals are owned in small numbers by farmers. They are fed agricultural waste like corn stalk, groundnut leaves etc. Milk is collected at village level through cooperative societies. Beef is usually from bulls or old cows that can no longer give milk, and are not the most consumed meat. Goat and chicken are predominantly consumed.",
            "title_similarity": "0.60781515",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzrwfzs",
            "score": 1,
            "text": "When people remove meat from their diet, they mostly end up replacing it with simple carbs and sugars, not vegetables and fruits.  This will make our country's obesity problem worse.",
            "title_similarity": "0.72859716",
            "sentiment_compound": -0.7003
        },
        {
            "id": "gzrwycz",
            "score": 1,
            "text": "I promise to help reduce my carbon footprint by using scrubbers on my smoke stacks, appropriately dealing with my industrial waste, and most importantly of all, I promise not to dump millions of barrels of oil into the ocean due to totally avoidable maritime accidents.",
            "title_similarity": "0.62566483",
            "sentiment_compound": 0.6921
        },
        {
            "id": "gzrx9vd",
            "score": 1,
            "text": "If i started eating a plant based diet only, there would be plenty of emissions.",
            "title_similarity": "0.5399665",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrxlyr",
            "score": 1,
            "text": "Have you ever eaten broccoli? You’ll be doubling your carbon footprint.",
            "title_similarity": "0.5446894",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzrxpxg",
            "score": 1,
            "text": "What's the solution to 2/3 of farmland being non-arable which the only productive use for it is raising ruminants? If we switch most or all farming operations to plants only we're effectively letting 2/3 of all farmland go to waste since there is no other beneficial use for that land.",
            "title_similarity": "0.5613014",
            "sentiment_compound": -0.2973
        },
        {
            "id": "gzs3wip",
            "score": 1,
            "text": "Vertical farming adoption and lab grown meat will be the two biggest environmental impacts of the next 20 years.",
            "title_similarity": "0.61181134",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzs4euc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0077305064"
        },
        {
            "id": "gzs4udu",
            "score": 1,
            "text": "What really needs to happen are more regulations on factory farming",
            "title_similarity": "0.51543194",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzs72ir",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0077305064"
        },
        {
            "id": "gzsa9ui",
            "score": 1,
            "text": "What does the carbon footprint of lab grown meat look like?",
            "title_similarity": "0.5657035",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzsb0pb",
            "score": 1,
            "text": "There are multiple ways to approach the problem. As they stated in the study, sure, eat less meat, but still push for more efficiency in the production itself.\n\nYou have seen how hard it is to make people wear mask in a global pandemic, I'd say it's not surprising at all that to make a significant change it's easier to change the production (efficiency, costs...) than to convince people to just drop animal products all together.    \nIf you are vegan, that's nice and all, but please understand the importance of pushing for a top-down change",
            "title_similarity": "0.78537285",
            "sentiment_compound": 0.9616
        },
        {
            "id": "gzsbub5",
            "score": 2,
            "text": "Feeding cattle grass instead of corn is huge.  Animals eating what they have evolved to eat (imagine that.  Nature knows what’s best) is what’s best.",
            "title_similarity": "0.64472646",
            "sentiment_compound": 0.8934
        },
        {
            "id": "gzsd5iw",
            "score": 1,
            "text": "And without ducking with people’s food. Asking people to change their diets will never go over well.",
            "title_similarity": "0.4420315",
            "sentiment_compound": -0.2057
        },
        {
            "id": "gzsf1hy",
            "score": 2,
            "text": "Eating chicken or pork over beef reduces carbon footprint by like 50x.",
            "title_similarity": "0.6075619",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzsmj1v",
            "score": 1,
            "text": "If we want global change, we should start targeting the major pollution problem around corporate industries.  Much easier to regulate that than try and convince billions of people to adopt a plant-based diet.  Here's a list of the top polluters.  https://www.peri.umass.edu/combined-toxic-100-greenhouse-100-indexes-current",
            "title_similarity": "0.62035227",
            "sentiment_compound": 0.1585
        },
        {
            "id": "gzso76b",
            "score": 4,
            "text": "This sounds an awful lot like “clean coal” and “filtered cigarettes”.",
            "title_similarity": "0.33243096",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzso7uw",
            "score": 1,
            "text": "Or you know farm bugs for protein [just some stats and easy to digest information proving this comment](https://www.weforum.org/agenda/2018/07/good-grub-why-we-might-be-eating-insects-soon/)",
            "title_similarity": "0.6256342",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzsq5nv",
            "score": 2,
            "text": "We are talking about live creatures, nice, good animals. We should stop exploiting them. We can't call ourselves civilized as long as we are treating cows, pigs, goats chickens and whatnot in the horrible, horrible way we are now.",
            "title_similarity": "0.62273467",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gzsqo4z",
            "score": 2,
            "text": "Oatmilk Lattes for the win",
            "title_similarity": "0.46576655",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzsqrts",
            "score": 1,
            "text": "The most efficient is to do both...",
            "title_similarity": "0.24059156",
            "sentiment_compound": 0.4754
        },
        {
            "id": "gzsr22m",
            "score": 1,
            "text": "Both industry and consumers need to adjust their unsustainable behaviour. We also need to destroy the fossil fuel industry immediately. Seize all their assets without compensation and dismantle their operations. They are the enemy of the people.",
            "title_similarity": "0.43964082",
            "sentiment_compound": -0.743
        },
        {
            "id": "gzsrn75",
            "score": 1,
            "text": "I love me some chuletas.",
            "title_similarity": "0.29290614",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzsrpxd",
            "score": 1,
            "text": "it's a circle. the carbon is as oxygen as hydrogen, FIXED\neither is in plants or in animals makes no difference\ncosts less to food industry though if it cultivates plants or bugs, maximizing its profits",
            "title_similarity": "0.6444399",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzsrqf8",
            "score": 2,
            "text": "BREAKING: study finds new and efficient animals can generate calories from thin air!\n\nObviously no. Animals still need to eat plants to create calories for us to consume. They will never be 100% efficient at this (probably not even close). Much more efficient for us to eat plants directly. Skip the inefficient animal step and cut out the middle mammal!",
            "title_similarity": "0.68139714",
            "sentiment_compound": 0.6304
        },
        {
            "id": "gzssbcf",
            "score": 1,
            "text": "CAFOS are already efficient. They just generate huge amounts of waste which doesn't have to be treated like human waste before discharge.",
            "title_similarity": "0.47185412",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzssrs8",
            "score": 1,
            "text": "Pretty sure its the corpos that ignore what they are doing to the environment, oh also the ocean is the largest carbon sink and the fishing industry is destroying it. If we stop eating fish and get corpos to take responsibility then we would be fine as long as we continue to move toward renewable energy sources.",
            "title_similarity": "0.6015986",
            "sentiment_compound": 0.0258
        },
        {
            "id": "gzssw1j",
            "score": 1,
            "text": "And he forced to drink plant based beer!? Forget it!",
            "title_similarity": "0.27440706",
            "sentiment_compound": -0.6688
        },
        {
            "id": "gzssx8h",
            "score": 1,
            "text": "The key is to get alternative meat like products so close that they can be changed out as ingredients.  The day I can order a meat lovers pizza and not know it has no meat on it is when we will be successful.",
            "title_similarity": "0.65473795",
            "sentiment_compound": 0.8176
        },
        {
            "id": "gzstacn",
            "score": 1,
            "text": "ran into my garden and got rid of all the veggies. gonna buy some milk now to save the world, thx op",
            "title_similarity": "0.5397843",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzstayd",
            "score": 1,
            "text": "You don't make friends with salad.",
            "title_similarity": "0.1923891",
            "sentiment_compound": -0.3724
        },
        {
            "id": "gzstm2z",
            "score": 1,
            "text": "Interesting. And how much are they paying you to post this? Blink twice if you’re in danger",
            "title_similarity": "0.24231037",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzsu64p",
            "score": 1,
            "text": "Yeah. Quit pushing the back plant diet. No one diet is good for everyone. Find out what works for your own body.",
            "title_similarity": "0.49601746",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzsuibe",
            "score": 1,
            "text": "It seems clear that the answer is using the best way to farm while also dramatically reducing meat consumption. It's interesting that there is a way to make at least part of the issue surrounding this better",
            "title_similarity": "0.834607",
            "sentiment_compound": 0.9165
        },
        {
            "id": "gzsw04o",
            "score": 7,
            "text": "Says the animal agriculture industry.",
            "title_similarity": "0.44269896",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzsw7wo",
            "score": 2,
            "text": "The Amazon is literally getting burnt down for growing animal feed and grazing cattle.\n\nAnimal agriculture isn't just bad because of methane. Don't forget the animal waste flowing into rivers and flowing into the sea causing fish dead zones.",
            "title_similarity": "0.6449593",
            "sentiment_compound": -0.2924
        },
        {
            "id": "gzswqgr",
            "score": 1,
            "text": "I can't trust an article that is designed for display on a 4/3 screen in 2021",
            "title_similarity": "0.19660175",
            "sentiment_compound": -0.4023
        },
        {
            "id": "gzsxbbr",
            "score": 2,
            "text": "Oh, thank god! I was worried I would actually have to do something to save our planet. The science behaving animal agriculture is definitely something I trust blindly. Oh look! There’s a Friends Reunion on HBO!",
            "title_similarity": "0.6123034",
            "sentiment_compound": 0.939
        },
        {
            "id": "gzsxk21",
            "score": 1,
            "text": "Instead of just not eating meat...",
            "title_similarity": "0.30883735",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzsxnq9",
            "score": 2,
            "text": "A pig waste swamp is a thing. Where does all that urine and feces go? Pool it into an unmanageable cesspool of hellish proportions.",
            "title_similarity": "0.3389747",
            "sentiment_compound": -0.7906
        },
        {
            "id": "gzsyzko",
            "score": 1,
            "text": "The post contradicts itself by using methane footprint and carbon footprint in the same scenario. It also does not distinguish between the most effective actions that the average person can take vs the action that a farmer or collection of farmers can take (and the politicians which influence these decisions).",
            "title_similarity": "0.62287074",
            "sentiment_compound": 0.2484
        },
        {
            "id": "gzsz2y0",
            "score": 2,
            "text": "\"Improving efficiency of livestock production\" translates to, \"Worsening the intensity of animal abuse\".",
            "title_similarity": "0.75659347",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzsz72v",
            "score": 1,
            "text": "Nope. They can improve it in feedlots, where cattle spend a small fraction of their lives and eat feed that can be dosed with various treatments to reduce methane. But cattle mainly eat grass and there is no even remotely practical way to change emissions there (short of reducing beef consumption).",
            "title_similarity": "0.7512387",
            "sentiment_compound": -0.5428
        },
        {
            "id": "gzt1ld3",
            "score": 1,
            "text": "“We are running low on eggs”\nWho said that!?",
            "title_similarity": "0.3317864",
            "sentiment_compound": -0.3382
        },
        {
            "id": "gzt1q5d",
            "score": 1,
            "text": "You can build farm in the cities and stop the insanity with emissions",
            "title_similarity": "0.6061312",
            "sentiment_compound": -0.7096
        },
        {
            "id": "gzt2wz4",
            "score": 1,
            "text": "Clean meat will still crush the abomination of factory farming thru simple economics, if not Homo sapiens concern for justice and sustainability",
            "title_similarity": "0.74770117",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gzt37ds",
            "score": 3,
            "text": "This message brought to you by Tyson Foods, Inc.",
            "title_similarity": "0.31839836",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzt39d8",
            "score": 2,
            "text": "Improving efficiency in holocaust concentration camps helped Germany in the war, didn't mean it was right!",
            "title_similarity": "0.64210767",
            "sentiment_compound": 0.1759
        },
        {
            "id": "gzt3ir0",
            "score": 1,
            "text": "Yeah but I cant tell Steve down the pub that if he wants to help save the planet all he has to do is enact drastic changes in the agricultural industry.",
            "title_similarity": "0.58165455",
            "sentiment_compound": 0.8573
        },
        {
            "id": "gzt3t94",
            "score": 1,
            "text": "BS , we need lab grown meat as soon as possible",
            "title_similarity": "0.40963715",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzt66yd",
            "score": 2,
            "text": "You still would contribute to this: https://www.reddit.com/r/vegan/comments/nm932j/fairlife_dairy_allows_their_cattleworkers_to_do/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "title_similarity": "0.54698867",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzt6rtx",
            "score": 2,
            "text": "That doesn’t solve the land and water waste tho",
            "title_similarity": "0.28894496",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzt6ygy",
            "score": 1,
            "text": "Who funded this study and what were their goals? Always ask who wrote the article, who is their target audience and what information are they trying to convey and for what reason. These are the most important questions and essential building blocks of a knowledgeable community.",
            "title_similarity": "0.32126927",
            "sentiment_compound": 0.0498
        },
        {
            "id": "gzt7kqu",
            "score": 1,
            "text": "I guess blockchain startups need to focus on green type of coins. Real green",
            "title_similarity": "0.4726253",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzt8pvl",
            "score": 2,
            "text": "Oh my, this dumb study is going to be used so much by anti-vegans.",
            "title_similarity": "0.4713124",
            "sentiment_compound": -0.596
        },
        {
            "id": "gzt965w",
            "score": 1,
            "text": "Lab grown meat and plant based meat will soon taste as good or better than animal based meat. Many of the leading food industries are investing in this technology. Once people see how great these alternatives are, and once they become cheaper, that’s when the entire meat industry will become efficient. There is no efficient way of raising and feeding live stock for slaughter at the scale we need. It’s impossible. None of this is a solution to reduce the carbon footprint.",
            "title_similarity": "0.72715795",
            "sentiment_compound": 0.913
        },
        {
            "id": "gztajmf",
            "score": 1,
            "text": "Reducing food waste would have a major impact as well, since it would also slow down the production.\n\nIirc rotting food also releases copious amount of methane. Win-win.",
            "title_similarity": "0.7921869",
            "sentiment_compound": -0.1119
        },
        {
            "id": "gztbcw2",
            "score": 2,
            "text": "There is absolutely no data presented for the claim that encouraging people to consume less meat and dairy won’t work. Their claim that this is so makes me question both the motives and methods behind this research. It reads like a meat/dairy industry promotion brochure. The report also intimates but glosses over the fact that meat production still produces more methane than a plant based diet. Encouraging people to eat less meat and dairy would be easy if the US government, at least, stopped incentivizing diary and meat production with subsidies.",
            "title_similarity": "0.6986343",
            "sentiment_compound": 0.852
        },
        {
            "id": "gztbhqz",
            "score": 1,
            "text": "The problem, as always, isn't whether we have a better method but whether anyone is willing to pay for the improvements to infrastructure.\n\nAmerican infrastructure is in an absolutely abysmal state.  Whether you're talking about sewage, telecommunications, water, or even power.",
            "title_similarity": "0.40383333",
            "sentiment_compound": 0.3506
        },
        {
            "id": "gztbygx",
            "score": 1,
            "text": "I love this kind of studies: 'this is something we can do to save the world' and they talk about this very small solutions that in reality do nothing because they always ignore the only one solution that would solve all our problems:  'stop having babies as if you were rabbits' because no matter how much we do today, tomorrow there will be so many more people that everything will be for nothing.",
            "title_similarity": "0.5204977",
            "sentiment_compound": 0.7188
        },
        {
            "id": "gztcith",
            "score": 1,
            "text": "If everybody went plant based for everything that we need animals for we wouldn't need those animals anymore. Would they end up going extinct? Or would we get over run by them?",
            "title_similarity": "0.5631412",
            "sentiment_compound": 0.0
        },
        {
            "id": "gztcud0",
            "score": 2,
            "text": "This is incredibly misleading. First of all, logically it makes no sense that it's more effective to use more resource efficient farming methods then eliminating your direct contribution in the first place. In addition, the impacts of animal agriculture on the environment extend much, much further than methane.",
            "title_similarity": "0.66567683",
            "sentiment_compound": 0.4549
        },
        {
            "id": "gztdr2u",
            "score": 1,
            "text": "We should attach giant methane bags to all cow butts and use the inflated methane balloons as a fuel source. It will lower their carbon hoofprint and give us free fuel.",
            "title_similarity": "0.60967493",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gztdw4k",
            "score": 1,
            "text": "The discussion on here feels very US centric. Feedlots are not the main form of animal production in many other countries. A lot of places they eat grass and are fed water that is captured from the rainfall on that place. Like my own farm. My land is not suitable for broad acre cropping - it’s only 20 acres and very hilly. I’m a vegetable seed farmer instead and lend 18 acres of my land to my neighbor for sheep which prevent grass and bush fires. I’ll be revegetating 10 acres of land for wildlife in the coming years but I imagine there will always be some animals on our land - we have poultry that are an important part of fertilising our soil, clearing weeds organically and feeding our family. We have eaten entirely of our land for periods of time with no machinery involved. That would not be possible on a diet comprised of broad acre crops. We can integrate fruit and nut trees with animals quite happily. Our soil is building not diminishing. If we move away from centralised food systems there is much more opportunity to be more creative and sustainable. It’s not about animals vs plants. We need both. And if we can’t eat as much meat in such systems then so be it- eat what your local area provides sustainably based on its own unique circumstances. Follow the money - those making enormous generalisations about one thing being better than another on a global scale are supporting the interests of huge multinational corporations who sell gmo or propriety branded seed, massive farm machinery companies, mined fertilisers, pesticides and herbicides and global processed food companies. I’m not saying there’s some conspiracy but that defaulting to that isn’t going to be in the best long term interest. But they are profit based and don’t actually care about the environment.",
            "title_similarity": "0.6265914",
            "sentiment_compound": 0.992
        },
        {
            "id": "gztdyms",
            "score": 1,
            "text": "I know reddit hates animal farming but you CAN raise cattle regeneratively in a method that actually sequesters more carbon into the soil than it takes out.  \n\n\nBuy grass-fed cattle, preferably from your local farmers who actually care about this stuff.",
            "title_similarity": "0.7564559",
            "sentiment_compound": 0.5187
        },
        {
            "id": "gztetb4",
            "score": 3,
            "text": "Found the meat industry article.",
            "title_similarity": "0.3521281",
            "sentiment_compound": 0.0
        },
        {
            "id": "gztgrwx",
            "score": 1,
            "text": "That’s not a long term solution. It’ll be fake meat and insects to the rescue soon enough.",
            "title_similarity": "0.5411769",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzth144",
            "score": 1,
            "text": "The vegan talking point that plant-based diets reduce climate change is largely a myth. Glad to see more science on this. \n\nThe vast majority of greenhouse gases in animal agriculture comes from gasoline used for cars / trucks and natural gas used for heating / power, just like plant agriculture. Reducing methane from animals is a non-issue, it's not a significant greenhouse gas.\n\nThe amount of resources used by plant agriculture also varies. For example, almond milk uses more resources (mainly water) than cow's milk. A truly healthy vegan diet, not just rice and beans, is relatively resource expensive.",
            "title_similarity": "0.7630836",
            "sentiment_compound": 0.9002
        },
        {
            "id": "gzth86r",
            "score": 1,
            "text": "The most sustainable, carbon neutral farms **requires** the use of animals but I don't know think it's all realistic to believe we can feed everyone with sustainable farming alone.\n\nIf you have the money to invest/buy from one of these farms then it's *your* best bet for reducing your eco footprint.\n\nBut we'll still need a solution for the other 99% of the population.\n\nThere's unlikely to be a magic solution that fixes such a complex and ingrained problem.  We need to make incremental changes and adjust course as necessary to gradually change the established habits of the entire population.\n\nFirst things first:\n\nPhase out or fix the corn subsidy to help the market do what it's sometimes good at and change consumer behaviour in the face of increasing prices",
            "title_similarity": "0.7920855",
            "sentiment_compound": 0.9331
        },
        {
            "id": "gztikhd",
            "score": 1,
            "text": "I have heard of this before. Cow Yakult, some Musk millionaire should fund that.",
            "title_similarity": "0.41358033",
            "sentiment_compound": 0.0
        },
        {
            "id": "gztjb8x",
            "score": 1,
            "text": "Noo you are supposed to eat synthetic meat and crickets",
            "title_similarity": "0.43656975",
            "sentiment_compound": 0.0
        },
        {
            "id": "gztjgvi",
            "score": 1,
            "text": "Recycling your own trash can help the planet, however, studies show that building an entire recycling plant can be more effective.",
            "title_similarity": "0.79052085",
            "sentiment_compound": 0.7264
        },
        {
            "id": "gztjihv",
            "score": 1,
            "text": "This is so dumb. How about you stop eating animals? That's what is best for the world environmentally",
            "title_similarity": "0.6287494",
            "sentiment_compound": -0.3052
        },
        {
            "id": "gztkwhr",
            "score": 1,
            "text": "Try to eat locally produced food as much as possible.",
            "title_similarity": "0.48299876",
            "sentiment_compound": 0.0
        },
        {
            "id": "gztldvt",
            "score": 1,
            "text": "Worrying about your carbon footprint is corporate BS, designed to muddy the water. Place the blame anywhere but on the ruling class, who have known about climate change for 100 years.",
            "title_similarity": "0.47798574",
            "sentiment_compound": -0.34
        },
        {
            "id": "gztlz1w",
            "score": 1,
            "text": "Could just sow there bums up and make sure to eat them before they explode.",
            "title_similarity": "0.48551935",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gztm17o",
            "score": 1,
            "text": "If these efficiency gains come at the expense of animal welfare, I’ll pass, thanks. I’d rather just eat less meat (which I already eat sparingly).",
            "title_similarity": "0.7115154",
            "sentiment_compound": 0.7783
        },
        {
            "id": "gztnn54",
            "score": 1,
            "text": "Sponsored by..... be careful of disinformation.",
            "title_similarity": "0.21305059",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gztoimx",
            "score": 1,
            "text": "Why is this title an implied either or? We should be using any and all practical methods.",
            "title_similarity": "0.12981093",
            "sentiment_compound": 0.0
        },
        {
            "id": "gztp5ak",
            "score": 1,
            "text": "I'm a vegetarian bordering on vegan because I don't want to be cruel to animals.",
            "title_similarity": "0.60095763",
            "sentiment_compound": -0.6152
        },
        {
            "id": "gztpcda",
            "score": 1,
            "text": "I'm just gonna not read the comments on this and that will make my day easier...",
            "title_similarity": "0.5138129",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gztqve6",
            "score": 2,
            "text": "Hopefully this post gets removed, the title is so misleading as to be an outright lie.",
            "title_similarity": "0.3072875",
            "sentiment_compound": -0.2002
        },
        {
            "id": "gzttpj3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0077305064"
        },
        {
            "id": "gztv8s1",
            "score": 1,
            "text": "\"Doing the demonstrably bad thing better, is *actually* better than not doing that demonstrably bad thing at all.\" \n\nAre people really this numb to propaganda, or does it just feel monetarily better to be told not to worry about personal responsibility and pass it on to someone else... little of a) little of b).....",
            "title_similarity": "0.5091092",
            "sentiment_compound": -0.2481
        },
        {
            "id": "gztvkdi",
            "score": 1,
            "text": "Unsupported bald assertion.",
            "title_similarity": "-0.045502804",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gztvs86",
            "score": 2,
            "text": "The unfathomable scale of suffering is arguably more important. We needlessly kill three hundred million animals every single day.",
            "title_similarity": "0.39330265",
            "sentiment_compound": -0.8275
        },
        {
            "id": "gztwtmx",
            "score": 1,
            "text": "Yeah because improving livestock production efficiency will help the greenhouse gasses somehow.",
            "title_similarity": "0.8083662",
            "sentiment_compound": 0.8481
        },
        {
            "id": "gztzocq",
            "score": 1,
            "text": "One person vs an industry paradigm shift? True. Most people adopting a whole food plant based diet vs an industry paradigm change? Not True.",
            "title_similarity": "0.548007",
            "sentiment_compound": 0.2091
        },
        {
            "id": "gzu0rns",
            "score": 1,
            "text": "By far the best way to reduce your lifelong carbon footprint is to not have children. Any other \"lifestyle change\" is small potatoes compared to that. Just a personal opinion, but you cannot be environmentally conscious and also a parent. You just can't. Not creating more people the earth can't sustain is by far and away the best way to keep environmental impact at a minimum.",
            "title_similarity": "0.65635157",
            "sentiment_compound": 0.8856
        },
        {
            "id": "gzu3tzm",
            "score": 1,
            "text": ">improving efficiency of livestock production will be a more effective strategy for reducing emissions\n\nYeah, but only because nobody is willing to f**king do it. This title is appealing to people who don’t want to change their diet/lifestyle, but it’s misleading in that the alternative of abstaining from the products would be far more effective. Logical fallacies in r/science headlines are no good...",
            "title_similarity": "0.7901337",
            "sentiment_compound": 0.5896
        },
        {
            "id": "gzucgeh",
            "score": 1,
            "text": "Sounds like lobbyist bs to me.",
            "title_similarity": "0.20890853",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzudneu",
            "score": 1,
            "text": "This is not a realistic strategy. Reducing methane, slightly, by utilizing advanced technology unavailable to the developing world will not be the solution. What exactly do you mean by \"can shrink a person's carbon footprint\"? It's the single largest contributing factor a consumer in the 1st world produces. Improving efficiency of CAFOs will not be a more effective strategy than utilizing plant based proteins or even lab grown meat. And considering the US government's track record of simply ignoring methane leaks (https://en.wikipedia.org/wiki/Aliso_Canyon_gas_leak) I don't really see any kind of technocratic, business friendly \"solution\" working any time soon. I think if you were to actually read between the lines in an unbiased view of this study you would see that what it's really saying is that the agriculture industry as it's operated up until now cannot continue any longer. And that's a much different message than \"we need to get more efficient about this so we can keep making money\".",
            "title_similarity": "0.66141534",
            "sentiment_compound": 0.9226
        },
        {
            "id": "gzui3n5",
            "score": 2,
            "text": "Title’s kind of a mess. It’s basically saying that eating less meat results in fewer emissions than eating no meat, which is just not true. It’s probably a *more realistic compromise to the typical person* and a *better strategy for promoting change*.",
            "title_similarity": "0.75126153",
            "sentiment_compound": -0.1611
        },
        {
            "id": "gzuji1s",
            "score": 2,
            "text": "Like methane is the only consideration in meat production. What a complete waste of time this is. Industry sponsored fish and chip wrappings.",
            "title_similarity": "0.52632105",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gzupdad",
            "score": 1,
            "text": "The plant based food is unreal. Seriously I am spoiled for choice these days and it's not ludicrously expensive anymore. Its sweet.",
            "title_similarity": "0.59042966",
            "sentiment_compound": 0.3502
        },
        {
            "id": "gzus8tl",
            "score": 1,
            "text": "Reading only the thread title: The probabilty that \"more effective\" livestock production techniques will come anywhere remotely near to being universally adopted is, frankly (and to quote Douglas Adams), one to the size of my overdraft. Way too many people involved who rely on (or can't afford anything but) cheap labour and low tech solutions, or who have no interest in doing anything but gouging every last drop of profit. Until the newer techniques are unversally affordable and available, and unambiguously more profitable, this sort of thing is utter fantasy.\n\nAnd, yes, I'm aware that the actual study is rather more nuanced.",
            "title_similarity": "0.6002778",
            "sentiment_compound": 0.8321
        },
        {
            "id": "gzusrvb",
            "score": 1,
            "text": "Wow those lamb ads really worked in Aus.",
            "title_similarity": "0.45374116",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzuu4e8",
            "score": 1,
            "text": "How about working on the population explosion??? Reduce the overall carbon footprint...Why does no one talk about that???",
            "title_similarity": "0.56188774",
            "sentiment_compound": -0.4871
        },
        {
            "id": "gzuuzr7",
            "score": 1,
            "text": "A problem that I see in this article is that it focuses on reduction by efficiency. However, efficiency is not going to get us to net 0 carbon (eq) emissions.",
            "title_similarity": "0.60473734",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzv7dy8",
            "score": 2,
            "text": "I dislike this article and its title.  It promotes laziness and inaction and is geared towards people looking for reasons to not change.  \n\nEating a plant based diet alone yields better effects on the environment than a lifetime of taking your recycling to the curb.\n\nFrom Google:\nOne person who goes vegan can save approximately 219,000 gallons of water a year.  -Mar 22, 2016\n\nNot to mention all the animals saved, health benefits for the individual, and pollution avoided.  Watch Dominion, Forks Over Knives, anything...  We have to ignore these people and make legislation that protects our planet from depletion.  Stepping off soapbox now.  Source -an omnivore trying to change.",
            "title_similarity": "0.7025843",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzvcm63",
            "score": 1,
            "text": "Omnivores stay winning",
            "title_similarity": "0.20378748",
            "sentiment_compound": 0.5267
        },
        {
            "id": "gzvhvw0",
            "score": 1,
            "text": "“Adopting a plant-based diet can help shrink a persons carbon footprint”\n\nThis seems disingenuous, or at least very narrow. Why can’t studies consider the ripple effect of upstream demand lowering? Is it just too difficult?\n\nI’d love to see a study on supply chains all the way down to the producers what would happen if people reduced, say, their meat intake by 50%.",
            "title_similarity": "0.7393146",
            "sentiment_compound": 0.504
        },
        {
            "id": "gzvmi29",
            "score": 1,
            "text": "It’s crazy stuff! Their changing the enzymes in the cows stomach",
            "title_similarity": "0.46368113",
            "sentiment_compound": -0.4003
        },
        {
            "id": "gzwxwc0",
            "score": 1,
            "text": "Just another way to justify killing animals..",
            "title_similarity": "0.4524901",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gzwy7p0",
            "score": 1,
            "text": "So basically people don't want to reduce animal consumption so they recommend improving animal agriculture methods until people become less petty.",
            "title_similarity": "0.74058414",
            "sentiment_compound": 0.6265
        },
        {
            "id": "gzxa1nr",
            "score": 1,
            "text": "I'm still eating meat.",
            "title_similarity": "0.26773548",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxvhuo",
            "score": 1,
            "text": "Sounds like something that would raise the price of my steak",
            "title_similarity": "0.56478643",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzydx80",
            "score": 1,
            "text": "\nIt is not you're local cattle farmer (the meat industry) who is trying to control the narrative with fraudulent studies and bribed scientists. It is big oil and big food, just like they always did and always will do. (you can already see what is the narrative in the comment section) They have the money to buy their propaganda to greenwash all their activities and distract attention from themselfs. Just  intuitively, you really think that cattle in a grass field is the cause of all problems instead of some oil fracking plant? Try to falsify your believes that meat is the problem for once instead of searching for confirmation bias.",
            "title_similarity": "0.61801684",
            "sentiment_compound": -0.9382
        },
        {
            "id": "h0g0ktw",
            "score": 1,
            "text": "Lying pro-meat propaganda. Care about your future and the planet? Eat less meat. https://gerryha.gonevis.com/our-dying-planet",
            "title_similarity": "0.5933618",
            "sentiment_compound": -0.296
        }
    ]
}