{
    "Men die of suicide much more often than women. This is commonly blamed on men's unwillingness to seek help and talk about their problems. This paper disputes the conventional view, emphasizing instead socio-economic issues and obstacles to health care access\n": [
        {
            "id": "h08lmh2",
            "score": 1,
            "text": "The author of the paper has made a preliminary version of the manuscript available [on their website](https://dramychandler.wordpress.com/publications/) for those without institutional access to the journal.",
            "title_similarity": "0.30947733",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxfqx9",
            "score": -6,
            "text": "you're going to blame the men? I'm pretty sure soicety tells men they dont need help...not the other way around.",
            "title_similarity": "0.5810211",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzxpe37",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.09064232"
        },
        {
            "id": "gzxgkhk",
            "score": 6,
            "text": "Working in the mental health field, our shorthand for this phenomenon was “it’s hard to get the dosage wrong on a bullet.”  Men are much more likely to use a firearm for suicide whereas women are more likely to use pills.  This is based on USA numbers and stats, though.  In societies where firearms are more restricted, I understand the numbers are closer because both men and women are more likely to use pesticide.",
            "title_similarity": "0.7430663",
            "sentiment_compound": -0.8977
        },
        {
            "id": "gzxgvp9",
            "score": 2,
            "text": "Men are also much more likely to take on much more lethal methods of suicide. If I remember correctly, women attempt it much more often than men do. They choose methods that aren’t as brutal which often leads to a higher rate of survival. \n\nThis next part is purely anecdotal, but I’m a paramedic. I respond to many more female suicidal ideation / attempts than I do male. Likewise, I respond to many more successful male suicides / Self-inflicted DOA’s than I do female.",
            "title_similarity": "0.7807067",
            "sentiment_compound": -0.7452
        },
        {
            "id": "gzxg5d5",
            "score": -10,
            "text": "Fentanyl has been a saviour for many in countries that don't have easy access to guns. Life should be optional.",
            "title_similarity": "0.59224164",
            "sentiment_compound": -0.3412
        },
        {
            "id": "gzxd3fu",
            "score": 53,
            "text": "This \"paper\" has n=10 for the sample.",
            "title_similarity": "0.121378824",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxk9az",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzxeaa2",
            "score": 95,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzxfejv",
            "score": -1,
            "text": "I was always told it had more to do with men favoring firearms for suicide attempts compared to women. Much easier to pump a stomach to get rid of pills and save someone vs try and put a skull back together",
            "title_similarity": "0.6987071",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzx615u",
            "score": 252,
            "text": "Men die of suicide three times more often, but women attempt suicide at three times the rate. This is because men tend towards less reversible methods, such as shooting themselves, while women tend towards over dosing or cutting, which can more easily be reversed. \n\nhttps://www.verywellmind.com/gender-differences-in-suicide-methods-1067508",
            "title_similarity": "0.8424593",
            "sentiment_compound": -0.8645
        },
        {
            "id": "gzxi1wo",
            "score": 0,
            "text": "Did they examine the methods used between men and women?  From the studies I've read, men tend to use guns, and women slit their wrists or use drugs.  Obviously the gun is more effective at ending your own life.",
            "title_similarity": "0.65925014",
            "sentiment_compound": 0.2484
        },
        {
            "id": "gzy1r0c",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzxespr",
            "score": 74,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzxev67",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.1361165"
        },
        {
            "id": "gzxrzyp",
            "score": -6,
            "text": "As a psych student I was taught that the higher death-by-suicide rate in men vs women is due to the method. Men tend to choose deadlier or more efficient ways like guns whereas women tend to choose less violent and less efficient ways like pills and cutting.",
            "title_similarity": "0.7966342",
            "sentiment_compound": 0.6697
        },
        {
            "id": "gzxf5u4",
            "score": -81,
            "text": "That's not the commonly believed reason at all. The disparity is largely down to the more violent methods of suicide favoured by men, in particular shooting and hanging. They survive attempts much less frequently. There is simply no evidence that men feel despair at a higher rate than women; most population surveys suggest the opposite.\n\nNow, the reasons for the differences in suicide methods chosen by men and women are debated, but that's a different conversation.\n\nSource: am psychologist",
            "title_similarity": "0.87259156",
            "sentiment_compound": -0.815
        },
        {
            "id": "gzxvc4t",
            "score": 5,
            "text": "Wait a post on the front page that doesn’t have to do with bashing men, color me surprised",
            "title_similarity": "0.52813",
            "sentiment_compound": 0.2263
        },
        {
            "id": "gzxl36r",
            "score": 9,
            "text": "I thought it was because men are just better at completing tasks?",
            "title_similarity": "0.48577046",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzyuaun",
            "score": 0,
            "text": "Men, don’t ever open up",
            "title_similarity": "0.34046608",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxkoxg",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzy21ec",
            "score": -1,
            "text": "More apt title \"Incredibly small sample size study without structure suggest economic issues are the problem while only interviewing people with economic issues\". How is this in science? A study of only 10 people. Where there is no diversity or randomness to the subjects of the study. Instead it was intentionally done? The author went in with the answer to the question rather than looking for the answer.",
            "title_similarity": "0.552524",
            "sentiment_compound": -0.644
        },
        {
            "id": "gzxp30r",
            "score": 19,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzxfh0l",
            "score": 11,
            "text": "Men also usually will use more effective methods like hanging and asphyxiation. Women use pills more often.",
            "title_similarity": "0.5791675",
            "sentiment_compound": 0.7316
        },
        {
            "id": "gzxfnd0",
            "score": -33,
            "text": "This is why men, get paid more than women, we get the job done, No half-assing",
            "title_similarity": "0.54404336",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxmxwh",
            "score": 0,
            "text": "Its not the lack of comunication, its capitalism.\n\nPeople have been programmed all their life to value themselves based on their productivity, that once they go out of the machine, they find no sense for their free existence where they are actual human beings with a free will, and not just a cog in a mechanism just doing what its being told to do.\n\nFix this, and a lot of people will start seeing themselves in a more positive light.",
            "title_similarity": "0.58432233",
            "sentiment_compound": 0.9128
        },
        {
            "id": "gzy5iz3",
            "score": 16,
            "text": "Another factor is:\n\nOn one hand \"omg men open up\"\n\nAnd on the other \"male tears, male fragility, stop distracting from women, you're privileged you have no problems\"\n\nWelcome to a man's world. You're told to open up, but only in the ways others approve of.",
            "title_similarity": "0.5535039",
            "sentiment_compound": 0.0744
        },
        {
            "id": "gzxqz4z",
            "score": 0,
            "text": "Men are treated worse in society",
            "title_similarity": "0.6076908",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzxszk7",
            "score": 2,
            "text": "Maybe if getting a divorce didn't feel like somebody was literally ripping your heart out and handing it to the lady who ripped your meteorical heart out less of these guys would kill themselves.",
            "title_similarity": "0.70396805",
            "sentiment_compound": 0.3798
        },
        {
            "id": "gzxnl82",
            "score": 47,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzy0vf6",
            "score": -6,
            "text": "But life is harder for women? Interesting",
            "title_similarity": "0.4413619",
            "sentiment_compound": 0.5499
        },
        {
            "id": "gzy4szk",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.1361165"
        },
        {
            "id": "gzxll51",
            "score": 68,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzxgssj",
            "score": 5,
            "text": "It could also be that men typically choose methods that cause severe trauma (hanging, guns, jumping off an overpass) that have no treatment, as opposed to an overdose.",
            "title_similarity": "0.7322124",
            "sentiment_compound": -0.765
        },
        {
            "id": "gzxljot",
            "score": -5,
            "text": "#Why not both? It's socio-economic and unwillingness.\n\nBy the way, people aren't obligated to give me social status or wealth.",
            "title_similarity": "0.5928494",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzx9adw",
            "score": 274,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzxlm4m",
            "score": 35,
            "text": "Or maybe it’s the fact that men are only loved by their ability to provide, and not for who they are. \n\nOr the fact they never get custody of their children AND have to pay insanely high amounts of child support; literally to the point they can’t support themselves. \n\nBut what do I know.",
            "title_similarity": "0.7614713",
            "sentiment_compound": 0.6808
        },
        {
            "id": "gzy2kyc",
            "score": 3,
            "text": "/r/twoxchromosomes isn’t gonna like this one",
            "title_similarity": "0.38738477",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzzr6jd",
            "score": -1,
            "text": "Women attempt suicide much more. How you get to the conclusion in the title is beyond me",
            "title_similarity": "0.6679787",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h00soic",
            "score": 1,
            "text": "This smells like just another attempt to redirect resources away from women's care. Women are the *primary* victims of men's suicides. They lose their fathers, brothers, and sons to it after all.",
            "title_similarity": "0.7997902",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzxxqf0",
            "score": 24,
            "text": "If you blame toxic masculinity. You have to square that with the fact this is 2020. Look to 1960s and 1860s and compare and contrast the suicide rates. Oh wait the suicide rate has been increasing steadily since this period regardless of whether men are 'toxic'. Maybe you are looking for a different solution. Or maybe when you think men are in the wrong every problem men face starts to look like a nail.",
            "title_similarity": "0.74151397",
            "sentiment_compound": -0.9246
        },
        {
            "id": "gzxjra9",
            "score": -16,
            "text": "I wonder if correlation can be drawn between this assertion and the proclivity of males to be mass shooters?",
            "title_similarity": "0.5269252",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxkbjf",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.09064232"
        },
        {
            "id": "gzxl3j7",
            "score": -15,
            "text": "Capitalism strikes again. I thought it was mostly because men tend to choose more lethal methods to die by. Interesting to read this - we have a lot of work to do.",
            "title_similarity": "0.72311455",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gzxm7zz",
            "score": -20,
            "text": "[deleted]",
            "title_similarity": "0.1361165"
        },
        {
            "id": "gzxapi1",
            "score": 196,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzx1mmy",
            "score": 18,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.55647635",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gzxvoa8",
            "score": 3,
            "text": "Is academic social psychology still going through a replication crisis where peer review is replaced by dogmatic assertions? Or is it safe to trust them again?",
            "title_similarity": "0.48107117",
            "sentiment_compound": 0.3527
        },
        {
            "id": "gzy8oa2",
            "score": 5,
            "text": "The Reddit hive mind does not like this kind of science.",
            "title_similarity": "0.61523545",
            "sentiment_compound": -0.2755
        },
        {
            "id": "gzxux5z",
            "score": 8,
            "text": "How about the collective of society being like “your a dude, suck it up”\n\nAll in all it’s a multitude of factors and a large part is that people are getting soft these days",
            "title_similarity": "0.5636137",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzxfwk4",
            "score": 64,
            "text": ">men's unwillingness to seek help and talk about their problems\n\nbecause society tries to place men higher on the \"reliability\" scale.   Society unfortunately pushes a narrative to everyone that men are supposed to be relied on more than women for everything except child rearing and household duties.  \n\nmen feel they are supposed to be the ones that solve problems, and thus if they Have a problem they cant solve on their own, they see themselves as broken, or as failed versions of men that cant be relied on, and thus, are a danger to society since they use resources but contribute nothing.     \n\nThis drives severe depression and ultimately leads to men determining their most valuable contribution to society would be self sacrifice.   so they un-alive themselves.",
            "title_similarity": "0.84740406",
            "sentiment_compound": -0.7492
        },
        {
            "id": "gzyta9b",
            "score": 5,
            "text": "When we discuss trans suicide rates, the norm is compassion and not to blame the group itself. \n\nWhen we discuss male suicide rates, the norm is to poke at \"fragile masculinity\" and to argue that males are victims of their own masculinity, telling them that they are the problem.",
            "title_similarity": "0.71329963",
            "sentiment_compound": -0.9074
        },
        {
            "id": "gzxudak",
            "score": 3,
            "text": "It's the same argument about women raping men(even most cases when the male is underage). It doesn't happen in the eye of society.\n\nA paper will not change that.",
            "title_similarity": "0.63993084",
            "sentiment_compound": -0.8074
        },
        {
            "id": "gzy0s7l",
            "score": 3,
            "text": "Another thing to note is that women have to start managing mood swings due to hormones starting at age 9-11. Society doesn’t give much leeway for women showing negative emotions, so we learn coping skills much earlier.",
            "title_similarity": "0.5873569",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gzy5sh7",
            "score": 1,
            "text": "The fact that this got shadow banned shows that it's true",
            "title_similarity": "0.23636924",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzz3zud",
            "score": -1,
            "text": "no offense but any study or anyone who want to actually address suicide needs to acknowledge the reason men die by suicide at a much higher rate is *how* they commit suicide. Women attempt suicide 2x more than men and have higher rates of depression, but men attempt suicide in more violent ways that are less likely to survive (gunshot to the head, jumping off buildings/bridges) whereas women predominantly attempt to overdose, which has a very high rate of survival. It's pretty ridiculous to pretend that men face socio-economic issues that women don't (women have higher rates of poverty and are more likely to have dependents) or women have better access to healthcare (there have been countless studies that show women are less likely to be taken seriously by doctors). Idk why so many people pretend to care about suicide when all they really say is \"ha men have it so much worse than women!\" like.. sociopathic.",
            "title_similarity": "0.8678293",
            "sentiment_compound": -0.996
        },
        {
            "id": "gzxig8j",
            "score": -6,
            "text": "Isn't it because men use guns or cars to kill themselves as opposed to women who use pills or hanging for example.",
            "title_similarity": "0.6854442",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzxlxv3",
            "score": 100,
            "text": "I love how everyone but men get sympathy for their struggles. If men have a bad statistic it’s cause “they don’t seek help”. Hopefully more studies like this come out and move us to a more compassionate place.",
            "title_similarity": "0.67784214",
            "sentiment_compound": 0.8692
        },
        {
            "id": "gzxmof4",
            "score": -4,
            "text": "Men will hurt women and they also hurt themselves.",
            "title_similarity": "0.6301595",
            "sentiment_compound": -0.7783
        },
        {
            "id": "gzxtd67",
            "score": 4,
            "text": "Help is available.   \nSpeak with someone today.   \nNational Suicide Prevention Lifeline.   \nHours: Available 24 hours. Languages: English,     Spanish. Learn more.   \n800-273-8255.    \n    \nEdit: the Reddit resource is also available and if not being misused could help save someone’s life.     \nWe all need help sometimes, and you shouldn’t feel ashamed to ask for it.",
            "title_similarity": "0.5243443",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzyv50u",
            "score": 3,
            "text": "What are there like 700 nationwide shelters for women and like 5 for men in the US? I wonder why that is?",
            "title_similarity": "0.42449367",
            "sentiment_compound": 0.6553
        },
        {
            "id": "gzyzas4",
            "score": -4,
            "text": "What do you expect when you blame everything you disagree with on straight white men?",
            "title_similarity": "0.6130293",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzz08gp",
            "score": 7,
            "text": "Friendly neighborhood Suicidologist here:\n\n1. It it not universal that men die by suicide more than women. In fact, not too long ago in China women were dying by suicide more than men. The socio-economic factors that improve lives for Chinese women in rural/agrarian areas, as well as changes in managing lethal agricultural chemical reduced suicide deaths so effectively in China that it reduced global suicide mortality rates. The popular narrative that masculinity is to blame isn't as well supported by the data as people think.\n2. In the cultures/countries such as the UK and US where men die by suicide more than women, women still attempt suicide more often. It is the lethality of the means that people use which largely determine mortality rates.\n3. This article is not \"new news\" and Suicidologists have been aware for some time that telling men to just \"talk more\" is not a strategy that significantly reduces risk or reduces suicide attempts/deaths. The \"talking cure\" for mental health is a Victorian age mental health innovation that was always heavily biased towards feminine communication styles in Western culture. It's been 100+ years since then. It is time to invest in better science and better suicide care, rather than make it the suicidal person's job to just \"act differently\" so they don't feel like dying (or actually die) by suicide.\n\nPS: In the US we spend a pittance on researching suicide. We also fail miserably to insist on suicide care training as a routine part of provider's licenses (especially mental health licenses). We do not insist on health care standards to address suicidality. That is a failure of our public health system, and not a failure of masculinity. And this article does accurately reflect that men to go seek help.\n\nWe have known for some time that 90% of licensed MH providers would not pass a suicidal assessment and intervention competency exam (90% score less than 70%). And these are just \\*fundamentals\\* for the 10 or 11th leading cause of death in the US. That is unacceptable, but state licensing boards have largely been unwilling to change that. I was personally present in Louisiana when all of the state mh licensing boards showed up with their lawyers to protest state legislation requiring training and continuing education. I had partnered with Sen Nevers on that legislation and I have never been so disappointed with my profession. Shout out to the Social Work licensing board in Louisiana who was the ONLY professional board in favor of requiring this training for licensure. This was about 5 years ago, btw.\n\nBottom line: If we can't rely on adequate funding of science, or adequate training and accountability of our providers and health care systems, why do we think ALL MEN should suddenly \"just talk about it\" and magically change things?\n\nrant/over",
            "title_similarity": "0.82250214",
            "sentiment_compound": -0.9828
        },
        {
            "id": "gzxllc9",
            "score": 29,
            "text": "When I have the energy to tilt against windmills, one of the conversation topics I have with \"men don't need any help, and men don't need support groups\" feminists is the subject of access to mental health in colleges. For men, functionally, there isn't _any_ baring a very few schools which have _some_ form of program, and none are close to on par to what's available to women.  \n\nAnd that's just one subject. There's also prison terms for men being drastically worse than women for the same type of offenses. \n\nThere are more wealthy men at the top, but there's drastically more safety net for women at the bottom in our society.",
            "title_similarity": "0.71967924",
            "sentiment_compound": 0.1969
        },
        {
            "id": "gzxkfsv",
            "score": 7,
            "text": "The obstacles to getting men to go to the hospital are a lot more difficult to overcome.  [Most men are breadwinners and unlikely to take time off of work for health](https://www.menshealthforum.org.uk/lets-remove-barriers-mens-healthcare).  Only 68% of men in the UK said they'd take time off of work if they had identifiable blood in their stool.  Almost no man will take time off for back pain (which can be a sign of something much worse).\n\nWomen are more likely to go to the doctor because there are promoted and mandated cancer screenings, reproductive health, birth control prescriptions,  and are far less likely to take children to a doctor.",
            "title_similarity": "0.84608966",
            "sentiment_compound": -0.936
        },
        {
            "id": "gzxmc5k",
            "score": -3,
            "text": "Men also choose violent and destructive methods more often than women, making their suicide attempts more successful.",
            "title_similarity": "0.6930213",
            "sentiment_compound": -0.8522
        },
        {
            "id": "gzxmhl9",
            "score": 0,
            "text": "I cannot access the article, but off reading the info that OP posted, it seems to me that the conventional view the author presents and criticizes is largely invented. In my experience, men's unwillingness to talk about their problems is never presented as the sole, or even leading cause of suicide increase among men. The celeb campaigns the author mentions might not solve the problem at the core of this increase, but it may be the only one that media in that manner has the power to address. What is an actor supposed to do about the outsourcing of manufacturing jobs to foreign labor, or about the loss of an arm?",
            "title_similarity": "0.80368346",
            "sentiment_compound": -0.8578
        },
        {
            "id": "gzxofok",
            "score": 0,
            "text": "“I can do anything, you can do, better” my ass.",
            "title_similarity": "0.19836691",
            "sentiment_compound": -0.5423
        },
        {
            "id": "gzxrdbd",
            "score": -5,
            "text": "OP is pretty obsessed with discrediting women’s struggles",
            "title_similarity": "0.46099165",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxrqc3",
            "score": 0,
            "text": "I don't know how scientifically correct or backed this is but I always heard that men have a higher percentage death rate via suicide was the method. For example i was told was that men are more likely to try to commit suicide via something instant like gun or car. Whereas women were more likely to do something like try to OD on pills or with cuts in a tub. \nI am in no way saying that only men or women do it in that way.",
            "title_similarity": "0.8335683",
            "sentiment_compound": -0.9648
        },
        {
            "id": "gzxrtxq",
            "score": 0,
            "text": "I am intrigued.\n\nI am asking this publicly and rhetorically as I hope to get an answer reading this...\n\nIs it that men are better with follow through, choose more definitive methods, or is it that women are actually wanting help through the situation so choose less “permanent” methodologies?\n\n***Point of clarification*** I don’t ask to make light of a very real mental health issue. I am genuinely questioning as to why stats have borne out the fact that men are more “successful” at suicide... not that that is something to succeed...",
            "title_similarity": "0.7697441",
            "sentiment_compound": 0.6743
        },
        {
            "id": "gzxuq4z",
            "score": 0,
            "text": "I have also heard that while a man will go for the most effective method (often a hand gun) women prefer to leave a beautiful corpse and are restricted to far less effective methods.",
            "title_similarity": "0.71606284",
            "sentiment_compound": 0.6597
        },
        {
            "id": "gzxv9sz",
            "score": 0,
            "text": "I heard something about it being because of testosterone leading to more assertiveness leading to following the desire through",
            "title_similarity": "0.33419278",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzxvkj9",
            "score": 0,
            "text": "I was told by a psychologist friend that men and women attempt suicide at about the same rate, but men tend more likely to choose to use rope or a gun, whereas women more often tend to choose overdose with pills. Men die more often from suicide not because more men are suicidal, but because they more often use methods that don’t allow time to call for help or for help to arrive before they already pass on.",
            "title_similarity": "0.8563842",
            "sentiment_compound": -0.9512
        },
        {
            "id": "gzxwriy",
            "score": -3,
            "text": "so when my best friend killed herself out of nowhere it means her suffering was unimaginable right?",
            "title_similarity": "0.62917686",
            "sentiment_compound": 0.0164
        },
        {
            "id": "gzxy349",
            "score": -4,
            "text": "Men are also more violent by nature.  Prisons are full of men, arrests for violent crimes are by and large committed by men. 90% of incarcerated are men to 10% women.\n\nMen and women have a lot of biological differences in how they act and think.",
            "title_similarity": "0.730358",
            "sentiment_compound": -0.8718
        },
        {
            "id": "gzxyhwa",
            "score": 0,
            "text": "Women attempt twice as much. I think it has more to do with risk taking behavior.",
            "title_similarity": "0.4777636",
            "sentiment_compound": -0.2732
        },
        {
            "id": "gzxyyf7",
            "score": 0,
            "text": "Women are more likely to attempt suicide, but men are more likely to follow through. This is thought to be that women usually take non-violent methods, such as overdosing on pills or cutting their wrists in a bathtub, while men take more violent actions, such as shooting themselves in the head or driving at high speeds into a wall.",
            "title_similarity": "0.72719014",
            "sentiment_compound": -0.8831
        },
        {
            "id": "gzxzdma",
            "score": 0,
            "text": "Women actually attempt suicide more than men but men succeed more often because men are more affiliated with suicide by gun which you can not have your stomach pumped to save you from or you can’t go to the hospital to stitch you back up.",
            "title_similarity": "0.8540506",
            "sentiment_compound": -0.5988
        },
        {
            "id": "gzy22ef",
            "score": 0,
            "text": "Is it possible that men are more likely to own firearms than women? There are many ways to revive overdoses, even slit wrists. Bullets; not so much.",
            "title_similarity": "0.6570226",
            "sentiment_compound": 0.34
        },
        {
            "id": "gzy4d1w",
            "score": 0,
            "text": "Reason why men die more often of suicide is because of methods they use in general. Guns, rope for hanging, exhaust fumes, all pretty much always lethal in a very short time. Women often take sleeping pills or cut wrists which generally take longer and are often saved if found during this time. This only includes method, not reasons why they pick suicide in the first place.",
            "title_similarity": "0.8344907",
            "sentiment_compound": -0.9112
        },
        {
            "id": "gzycmht",
            "score": 0,
            "text": "Wait... actually listen and trying to understanding men shows that we are wrong about men? What a shock...",
            "title_similarity": "0.59726304",
            "sentiment_compound": -0.6908
        },
        {
            "id": "gzyqlr1",
            "score": 0,
            "text": "Really deserves more attention",
            "title_similarity": "0.13807733",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzyrwws",
            "score": 0,
            "text": "Financial situations lead to suicide quite a bit, also getting bad grades in school, men are expected to be money trees, if not we are considered worthless to the world, even to our own mothers and sisters who expect us to replace our dads who left in the role of taking care of them, and they will get other men they meet in bars or whatever to make sure we pay up.\n\nThis could just be my life story but I'm sure it's happened to other men, anyway there's so much more to why men commit suicide than women other than biological reasons, mostly societal factors, at least in America it's like this.",
            "title_similarity": "0.86718416",
            "sentiment_compound": -0.3919
        },
        {
            "id": "gzyu5oz",
            "score": 0,
            "text": "I think it's interesting that its blamed on \"men's unwillingness to seek help\" and not the fact mens mental health is not really taken seriously\n\nEdit: \"man up\" is something heard all too often among men who suffer from things like depression and anxiety",
            "title_similarity": "0.82118803",
            "sentiment_compound": -0.5229
        },
        {
            "id": "gzyuia1",
            "score": 0,
            "text": "but if men refuse to seek help even that is a societal  issue as the reason they don't seek help or talk about it is because as men we are told we are supposed to be the strong silent type, grin and bear  it, man up and so on. so if we don't seek help its because society has dictated that's just not what men do and we don't want to be perceived as weak or unmanly.",
            "title_similarity": "0.6769248",
            "sentiment_compound": 0.101
        },
        {
            "id": "gzyuqj1",
            "score": 0,
            "text": "Even if it is the original reason, we need to not make them think it's bad to seek help.",
            "title_similarity": "0.28859407",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzyvbpt",
            "score": 0,
            "text": ">This is commonly blamed on men's unwillingness to seek help and talk about their problems. \n\nBecause why would it be blamed on the society that refuses to help said men, or on the contrary, makes it worse by belittling them because they have issues? \n\nOh, nevermind. Opened the link and the author is a womxn, of course.",
            "title_similarity": "0.78995085",
            "sentiment_compound": -0.765
        },
        {
            "id": "gzyweye",
            "score": 0,
            "text": "Maybe it's because talking to someone for money is ridiculous... pretend to give a damn.",
            "title_similarity": "0.51515573",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzywkc4",
            "score": 0,
            "text": "If doesn’t help that they have a lot of expectations from their romantic counterparts and are most of the time expected to be the main provider for their partner or family. You men are the true mvps, you always try to better things and a lot of the times it must not feel like it’s enough. I hope you all know there’s people that do appreciate all you do for society and your country. Please try to give yourselves a break and don’t be too harsh, most of the time you’ve earned a good break.",
            "title_similarity": "0.6381442",
            "sentiment_compound": 0.9422
        },
        {
            "id": "gzywstj",
            "score": 0,
            "text": "Long story short, society and cultural norms kinda suck. Toxic masculinity and femininity suck.",
            "title_similarity": "0.5979096",
            "sentiment_compound": -0.6712
        },
        {
            "id": "gzyxds0",
            "score": 0,
            "text": "Yep. In the US, there are women's shelters and women's programs ad naseum and if any man says hey what about me they are told that men are the problem.",
            "title_similarity": "0.65282726",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzyxjlq",
            "score": 0,
            "text": "Women make one post on social media about being mildly upset and they are showered with support. Men make a post crying for help and are told to man up or grow up.",
            "title_similarity": "0.60267264",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gzyxt5g",
            "score": 0,
            "text": "It's not that men don't seek help, its that the help that they find is completely inadequate and doesn't take mens issues seriously. Even mental help service are prone to telling men to \"suck it up\". So they do, they suck up a bullet. And if they don't, they are looked at as weak, unfit as a partner, employee, and sometimes friend. Men with mental health issues are considered 'less than'.",
            "title_similarity": "0.807039",
            "sentiment_compound": -0.7228
        },
        {
            "id": "gzz1eza",
            "score": 0,
            "text": "Women attempt suicide more often than men but are less successful.",
            "title_similarity": "0.7795739",
            "sentiment_compound": 0.4607
        },
        {
            "id": "gzz2k3j",
            "score": 0,
            "text": "Maybe women make men want to kill themselves.",
            "title_similarity": "0.62700254",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gzz32vv",
            "score": 0,
            "text": "Correct me if I am mistaken, but when I was doing my psych rotation, the take away was that it often has to do with method selection in men vs women. While the ratio of M:F varies a bit by age, men who commit suicide do so more often by method that are more likely to be successful. For example, firearms vs poison.",
            "title_similarity": "0.7749817",
            "sentiment_compound": -0.6956
        },
        {
            "id": "gzz3qnn",
            "score": 0,
            "text": "I thought women actually attempted suicide more often but were just a lot less successful at it. So men are actually more mentally stable and more skilled.",
            "title_similarity": "0.75645506",
            "sentiment_compound": 0.7374
        },
        {
            "id": "gzz3su0",
            "score": 0,
            "text": "Women attempt suicide more.",
            "title_similarity": "0.5192876",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gzz4281",
            "score": 0,
            "text": "Women still attempt suicide at higher rates than men, but men are more successful. Men tend to go for the more violence suicide which are more successful. The fact that men are more likely to die from a suicide attempt has nothing to do with the headline",
            "title_similarity": "0.8341891",
            "sentiment_compound": -0.9597
        },
        {
            "id": "gzz42rg",
            "score": 0,
            "text": "Women attempt suicide three times as often as men.\n\nMen succeed at suicide three times as often as women. Saying it's men's fault for not talking about their problems gets nobody anywhere. The real reason men die from suicide so much more is that they pick far deadlier, more \"final\" methods. Men tend to shoot themselves, jump off tall buildings, or jump into traffic.\n\nWomen are far more likely to attempt to overdose, or slit their wrists, giving family and medical workers more time to find the person before they die and get help for them. It's not really a societal gender issue (at least, as not as far as I can tell, it's not like there are many gender specific factors for suicide), more just that men don't give anyone the opportunity to stop the suicide. Not that that's what women are trying to do. They're just trying to die painlessly, but someone finds them while alive.",
            "title_similarity": "0.8599235",
            "sentiment_compound": -0.9344
        },
        {
            "id": "gzz4t9k",
            "score": 0,
            "text": "I remember reading either an article or an actual study, that claims that while more men commit suicide, that more women actually attempt it, but fail, as they're more averse to the kinds of \"sure thing\" attempts that men do.\n\nLike, a woman is more likely to attempt via an overdose, but will shy away from things like jumping off bridges/buildings, etc.\n\nIt was a long time ago, and I'm not sure even if it was just an article I read, or an actual study.",
            "title_similarity": "0.8638002",
            "sentiment_compound": -0.3369
        },
        {
            "id": "gzz4v2s",
            "score": 0,
            "text": "To agree with the argument about \"talking about problems\". More females attempt suicide compared to men. If \"emotions\" and talking about \"feelings\" had anything to do with it, as a negative male trait, then females would have no attempted suicides.",
            "title_similarity": "0.7882221",
            "sentiment_compound": -0.9241
        },
        {
            "id": "gzz60t8",
            "score": 0,
            "text": "Women attempt suicide much more frequently than men. Men are just way more successful at killing themselves. \n\nSuicide attempts are between two and four times more frequent among females.\\[9\\]\\[10\\]\\[11\\] Researchers have partly attributed the difference between attempted and completed suicides among the sexes to males using more lethal means to end their lives.\\[7\\]\\[12\\]\\[13\\] \n\nhttps://en.wikipedia.org/wiki/Gender\\_differences\\_in\\_suicide",
            "title_similarity": "0.81504005",
            "sentiment_compound": -0.8903
        },
        {
            "id": "gzz730k",
            "score": 0,
            "text": "I don't think we should be tying this to sex. It seems like an example of [neurosexism](https://en.wikipedia.org/wiki/Neurosexism).",
            "title_similarity": "0.5189142",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzzb0u6",
            "score": 0,
            "text": "Paradoxically women are more likely to attempt suicide, despite men being more likely to die by suicide. This is due, in part, to men using more lethal methods of suicide compared to women. So it is definitely a problem for both sexes, but risk and protective factors may vary.",
            "title_similarity": "0.8106408",
            "sentiment_compound": -0.9072
        },
        {
            "id": "gzzcfqs",
            "score": 0,
            "text": "This paper is not a data-based study, it's a critical analysis of 10 conversations the author had with men. Although I'm sympathetic with the idea, I'd like to see more and better data before this is used as an argument in a conversation about male suicide.",
            "title_similarity": "0.69324106",
            "sentiment_compound": -0.0828
        },
        {
            "id": "h001vo5",
            "score": 0,
            "text": "I think men also chose more lethal ways (like a gun) to commit suicide.",
            "title_similarity": "0.6439084",
            "sentiment_compound": -0.4472
        },
        {
            "id": "gzxu9z2",
            "score": -9,
            "text": "Heyyyyyyyy parents!! Raise your boys to be a little open and forthcoming with their feelings!!! It’s okay, really, for them to tell people how they feel inside. They do NOT need to ALWAYS remain tough and cold in order to be seen as “a man”! \nSorry for the outburst there.. but I really do believe that a lot of these issues stem from the way they’re raised, poor guys.",
            "title_similarity": "0.53905386",
            "sentiment_compound": -0.7405
        },
        {
            "id": "gzxf1ps",
            "score": 161,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzxj786",
            "score": 100,
            "text": "Just MHO of toxic societal norms, but I am definitely not a man, so feel free to have an oz or two of salt on hand:\n\nMen are forced to be invincible. \n\nMen are not to get tired. \n\nMen are not to feel sadness. \n\nMen are not to feel confused. \n\nMen are not to seek help.\n\nMen are not to feel anything but manly. \n\nMen are not allowed to share emotions, so anger often results from forced bottling of frustration anyway.\n\nAnger is acceptable.\n\nOther emotions = weak. \n\nWeak = undermined, unaccepted, ridiculed.\n\nAnger becomes a substitute to every other painful emotion.\n\nBottling continues.\n\nThe cycle of anger rinses and repeats.\n\nPatterns form. \n\nSociety ignores angry men while devaluing men deemed as weak.\n\nThe patterns pass through generations. Some consciously fight it and work their way out of it (thank you for doing the work); others continue the cycle and can even fall deeper into it. \n\nWe produce and perpetuate toxic males as a society. I'm sorry. :(\n\n\\_\\_\\_\\_\\_\n\nI was very lucky to grow up as a tomboy surrounded by wonderful guy friends I adore who helped form a far healthier perspective on male-identifying individuals throughout my life regardless of encounters with unhealthy individuals along the way. My friends and movement allies are largely emotionally mature, express themselves well, and are epic human beings overall. \n\nPerceiving these patterns in the world has only reinforced my belief that things actively need to change, and it starts with every single person who sees it, because the world at large still does not. <3",
            "title_similarity": "0.6584291",
            "sentiment_compound": -0.9676
        },
        {
            "id": "gzxl6vj",
            "score": 190,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzxgqdu",
            "score": 5,
            "text": "I always thought that men and women attempted suicide at similar rates but because of cultural reasons, men chose to attempt suicide with approaches that are harder to mess up, like hanging, gunshot, jumping off a building, etc. Whereas women were more likely to attempt suicide with things that are easier to mess up, like overdosing on medication.",
            "title_similarity": "0.83024275",
            "sentiment_compound": -0.9267
        },
        {
            "id": "gzxy4fa",
            "score": -6,
            "text": "Depression (including PTSD) is a REAL THING - it is not just about how you „feel“ - it is much more like diabetes; You cannot „think positive“ it away.\n\nIt is getting worse slower than one can recognize - every day feels like „just another normal day“ - and after some years - every day feels „just a little worse than the worst day of your life“. It starts hurting so much - it feels like nothing helps, nothing can stop it, all one wishes for is „to end“ the pain; suicide starts to look attractive as a last resort.\n\nSounds familiar? => TAKE the medicine! \n\nIt is called ANTIDEPRESSANT and it WORKS in most most cases.\n\n*) It took me almost 15 years to find out, that I have (at the end severe) Depression and I know now, that ALL my suffering was completely  needless.",
            "title_similarity": "0.8053983",
            "sentiment_compound": -0.9711
        },
        {
            "id": "gzyx00y",
            "score": 4,
            "text": "This is going to get much worse. Just read through these comments. I really think most women need to wake up to this.",
            "title_similarity": "0.52654016",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzxh4m0",
            "score": -19,
            "text": "It’s because they choose more lethal methods. Period.",
            "title_similarity": "0.41745555",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxvvg7",
            "score": 18,
            "text": "Men don’t complain because we know that nobody cares about us. \n\nJust the facts.",
            "title_similarity": "0.42889357",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzxjuz4",
            "score": 11,
            "text": "Have you ever try to seek help? Took me over a year to get in touch with a professional. At that point all my life/family was fucked. Only manage to salvage a bit of myself but at what cost? \n\nThis is the real problem.",
            "title_similarity": "0.6049911",
            "sentiment_compound": -0.4696
        },
        {
            "id": "gzxeosh",
            "score": 171,
            "text": "I think it’s more so about the despair felt by men. The expectations placed on them by their spouse/SO, family, society, friends, etc. are incredibly difficult to manage in today’s world. Let’s be real, if a woman isn’t fully self supporting, it’s not looked down upon in the same way it is when a man isn’t. The increasing difficulty for men to support themselves and/or their family coupled with those expectations creates deep pits of despair and makes suicide more likely",
            "title_similarity": "0.8436145",
            "sentiment_compound": -0.539
        },
        {
            "id": "gzxhc0q",
            "score": 12,
            "text": "This rings true for me: I've gone though two major depressive periods in my life due to physical health problems. The first when I had a temporary loss of cognitive abilities due to a brain injury in high school. The second when I couldn't walk for a few years due to severe rheumatism right after graduating college. While navigating the healthcare system to solve these cryptic medical issues while living alone, my friends and family constantly badgered me to \"talk to a therapist.\"\n\nThe fact that my legs won't bend is bumming me out and making my life difficult. My REACTION to this physical issue isn't the problem. I am working hard to solve the root of the problem and get my brain and my legs working again. I don't have TIME for that. \n\nI'm so glad I maintained focus and put all my energy into fixing my health problems rather than trying to talk myself into being ok with it. \n\nTen years on and I am happily married and able bodied and can work and compete in sports again.  Of course I'm not depressed anymore. \n\nTherapy might have it's place in dealing with past trauma. Veterans, victims of abuse. But ultimately they need to talk with other veterans/victims who shared their experiences, not someone with an academic understanding. Therapy might be useful in meditation between people and to help them communicate. If you have a friend who has REAL problems RIGHT NOW, please do not suggest they speak to a professional. They are taking to you about it.",
            "title_similarity": "0.7156336",
            "sentiment_compound": 0.8769
        },
        {
            "id": "gzxvrp1",
            "score": 11,
            "text": "Me: “ I need help…”\n\nReply:  \nMan up. \nGrow some balls. \nStop being a sissy.",
            "title_similarity": "0.37292808",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzxlduc",
            "score": -6,
            "text": "Men succeed at suicide more than women but women attempt suicide more than men. Men are more successful because they use more aggressive means that get the job done. So article is very misleading",
            "title_similarity": "0.802184",
            "sentiment_compound": -0.822
        },
        {
            "id": "gzxiv16",
            "score": 14,
            "text": "Try seeking professional help when society keeps telling you that men need to be strong. Men who talk about their feelings are perceived as weak by both women and other men. The idea that men themselves are to be blamed for their mental health issues ironically highlights the *exact* problem here.",
            "title_similarity": "0.7862165",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzxg0pl",
            "score": -1,
            "text": "Men also usually choose methods of suicide that are more effective.",
            "title_similarity": "0.6358449",
            "sentiment_compound": -0.2748
        },
        {
            "id": "gzxgcvf",
            "score": -1,
            "text": "men are stubborn and decisive when viewed as a group",
            "title_similarity": "0.41738403",
            "sentiment_compound": -0.2023
        },
        {
            "id": "gzxhxp1",
            "score": -1,
            "text": "I thought men died from suicide more than women because men tend to use guns more often than women.",
            "title_similarity": "0.8492877",
            "sentiment_compound": -0.8442
        },
        {
            "id": "gzxi2qo",
            "score": -1,
            "text": "It’s a combination of both!",
            "title_similarity": "-0.010657981",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxijq5",
            "score": -1,
            "text": "I also thought a reason men commit suicide more often is because men’s attempts are more often successful. But the amount of suicide being attempted is closer in number",
            "title_similarity": "0.7334793",
            "sentiment_compound": -0.7514
        },
        {
            "id": "gzxitwj",
            "score": -1,
            "text": "I thought men die more often because they are more likely to use violent means (I.e. gunshot to the head) while women generally use less violent means (Med overdose). You can intubate someone and wait for the drugs to clear from their system, but you can’t fix a hole in the brain.",
            "title_similarity": "0.84076774",
            "sentiment_compound": -0.6601
        },
        {
            "id": "gzxj5f8",
            "score": -1,
            "text": "Isn’t it because men tend to attempt with firearms whereas women tend to attempt using overdose (which is obviously less lethal)?",
            "title_similarity": "0.64640063",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxj9ny",
            "score": -1,
            "text": "~~unwillingness~~\n  \ninability",
            "title_similarity": "0.24556544",
            "sentiment_compound": -0.4019
        },
        {
            "id": "gzxjbt5",
            "score": -1,
            "text": "Theraphy helps lots my dudes",
            "title_similarity": "0.26825002",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzxkxg0",
            "score": -1,
            "text": "I always heard the difference was manner of suicide. Men were more likely to use a gun.",
            "title_similarity": "0.67901057",
            "sentiment_compound": -0.7845
        },
        {
            "id": "gzxlcaq",
            "score": -1,
            "text": "I mean it's likely both, but our cultural attitudes of mens health problems are certainly at the top of the list. \n\nWe see this even with Covid. Men don't wear masks. Men don't go to the hospital when they are sick. \n\nIf we lived in a perfect world preventative health care would be a priority of men and their employers. Instead of garbage diet pill ads being played on television, local communities could play ads about getting checkups, similar to what we have for breast cancer exams.",
            "title_similarity": "0.738639",
            "sentiment_compound": 0.6956
        },
        {
            "id": "gzxlwgx",
            "score": -1,
            "text": "I always thought the reason men successfully commit suicide more often is because men are more likely to own guns, which are a more effective way of committing suicide compared to alternatives like pills or cutting their wrists, which are methods women are more likely to use.\n\nWomen attempt suicide more often than men, but men die of suicide more often because they use guns.\n\n[About 50%](https://www.hsph.harvard.edu/means-matter/means-matter/duration/) of people who attempt suicide make their decision 20 minutes or less prior to their attempt, and only 13% make the decision a day before the attempt. So having easy access to effective ways of committing suicide can make a massive difference in suicide rates.",
            "title_similarity": "0.789933",
            "sentiment_compound": -0.9821
        },
        {
            "id": "gzxm5t1",
            "score": 1,
            "text": "Well, men are also more likely to choose more violent methods of suicide, which tend to be more successful, but the factors that lead them to that point do need to be taken into account as well.",
            "title_similarity": "0.63858795",
            "sentiment_compound": 0.1027
        },
        {
            "id": "gzxmlaf",
            "score": -1,
            "text": "women and children can afford to be careless, but not men.",
            "title_similarity": "0.5694872",
            "sentiment_compound": -0.1901
        },
        {
            "id": "gzxmtzw",
            "score": -1,
            "text": "This is purely anecdotal, but in my 10 years as a paramedic the women attempted suicide with sleeping pills and/or opiates while men were much more likely to use firearms to the head, or a combination of methods (for example, benzos and booze, then hanging oneself).\n\nI think men and women attempt suicide at about the same rates, but the men tend to use more lethal means.",
            "title_similarity": "0.76532054",
            "sentiment_compound": -0.9382
        },
        {
            "id": "gzxn39r",
            "score": -1,
            "text": "The conventional view is that men die of suicide much more often than women because they use more lethal means. The theory about men being unwilling to talk is a weird and toxic myth, not the baseline.",
            "title_similarity": "0.91535187",
            "sentiment_compound": -0.8779
        },
        {
            "id": "gzxn3z9",
            "score": -1,
            "text": "I was listening to a talk about this and the speaker explained that men and women tend to attempt suicide at around the same rate. The main reason why men die of suicide at a higher rate is because women tend to choose methods that are easily reversed if caught in time (like overdosing on pills) whereas men tend to use more quick and irreversible methods (like using a gun to the forehead).\n\nI'm only mentioning that just FYI, not to downplay the importance or pervasiveness of emotional troubles men experience.",
            "title_similarity": "0.8207903",
            "sentiment_compound": -0.853
        },
        {
            "id": "gzxn73z",
            "score": 1,
            "text": "Men are also the huge majority of the carceral population and we often put that solely on testosterone and I think that's a real discrimination to just think that and let it go like that's normal and there is nothing to do about it when you see the numbers.",
            "title_similarity": "0.7344118",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzxnfjq",
            "score": -1,
            "text": "A man two streets over from me just killed his girlfriend and committed suicide. They interviewed both families and both stated he was experiencing intense delusions and paranoia over the last 6 months. He apparently never sought out treatment because he didn’t want people to think he was crazy.\n\nBecause of his hesitation and worries about being labelled, two people are dead.",
            "title_similarity": "0.7460621",
            "sentiment_compound": -0.9633
        },
        {
            "id": "gzxpxz6",
            "score": -1,
            "text": "I also want to point out that men die more often then women from suicides (they make attempts at the same rate) bc they use more lethal methods such as guns while women will often use drugs which gives them a greater chance of being discovered alive.",
            "title_similarity": "0.74786943",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzxqxem",
            "score": -1,
            "text": "We are also alot more proficient in it generally. A gunshot to the temple is a lot more surefire than swallowing 25 pills.",
            "title_similarity": "0.5912926",
            "sentiment_compound": 0.3167
        },
        {
            "id": "gzxrana",
            "score": -1,
            "text": "Some of the reason needs to be attributed to men choosing more effective means.",
            "title_similarity": "0.45008174",
            "sentiment_compound": 0.5256
        },
        {
            "id": "gzxutrf",
            "score": 1,
            "text": "I believe it is both. Men are told by both men and women that they are 'this or that' if they wanna talk about their feelings or seek help. This definitely makes them unwilling. On top of that, there is way less help getting the help they need, less centers and awareness campaigns and shelters and funding for men's mental health.",
            "title_similarity": "0.8060385",
            "sentiment_compound": 0.8941
        },
        {
            "id": "gzxw8eu",
            "score": 1,
            "text": "\"blamed on men\"\n\nneat.jpg",
            "title_similarity": "0.44524625",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzy0oul",
            "score": -1,
            "text": "I don’t need a psychologist to tell me why men are more likely to commit suicide. It’s the same reason why women are more likely to cut themselves and men aren’t. If you’re pretty and a woman all you have to do is ask for attention and society (mainly men) gives it you. No man on earth has that luxury. A certain portion of women are born with their worth handed to them. Men have to earn their worth. All men do.",
            "title_similarity": "0.77112937",
            "sentiment_compound": 0.128
        },
        {
            "id": "gzymibr",
            "score": 1,
            "text": "Men would love help. But no one cares to help them.",
            "title_similarity": "0.57411486",
            "sentiment_compound": 0.2453
        },
        {
            "id": "gzyu4f3",
            "score": 1,
            "text": "No one cares though because men are expendable.",
            "title_similarity": "0.53972936",
            "sentiment_compound": -0.569
        },
        {
            "id": "gzyu961",
            "score": 1,
            "text": "Ive heard somewhere men die more of suicidie than women, but women do have more suicidie attempts. Can someone confirm this?",
            "title_similarity": "0.78278387",
            "sentiment_compound": -0.3506
        },
        {
            "id": "gzyuizk",
            "score": 1,
            "text": "There's also a distinct lack of support for men. Following open heart surgery (which carries risk of depression) I went looking for a support group. Found none.\n\nOh, there were plenty women's only groups. Nothing that accepted men.",
            "title_similarity": "0.78934187",
            "sentiment_compound": 0.1744
        },
        {
            "id": "gzyvven",
            "score": -1,
            "text": "Eh?  Men die of suicide because society sees us as useless if we can't compete and win, which is impossible to keep doing as we age.",
            "title_similarity": "0.8328868",
            "sentiment_compound": -0.9357
        },
        {
            "id": "gzyvw2m",
            "score": 1,
            "text": "Per my doctor: “why are you sad”.",
            "title_similarity": "0.5062713",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzywj1q",
            "score": 1,
            "text": "More men are successful at suicide, but more women attempt it. Just something I learned in my psych class I thought I would add.",
            "title_similarity": "0.6750453",
            "sentiment_compound": -0.0562
        },
        {
            "id": "gzywxpu",
            "score": 1,
            "text": "Like anyone wants to listen to a man's problems? Ive tried, people don't care.",
            "title_similarity": "0.5858828",
            "sentiment_compound": -0.4268
        },
        {
            "id": "gzyxaa0",
            "score": 1,
            "text": "I think it's mostly to do with the societal pressure on men to be the bread winners of the house. If a household is poor the man typically is the one catching the blame and men are typically raised to blame themselves as well. That pressure mounts until they off themselves. \n   \nThis also leads to alot of questionable work related deaths that are probably suicide but can't be proven. This is because these men know if they commit suicide their struggling family will get nothing but if they die of an accident at work the family will get a big pay out.",
            "title_similarity": "0.8110522",
            "sentiment_compound": -0.9791
        },
        {
            "id": "gzyxmvv",
            "score": 1,
            "text": "Men have higher rates of incarceration, higher rates of heart disease, they have higher on the job injuries and deaths, their value in society is highly determined by their ability to earn, as a group yet no one wants to talk about this inequality.  Instead its based on capitalism, as though in the animal kingdom males don't experience the similar things?",
            "title_similarity": "0.7841668",
            "sentiment_compound": 0.8553
        },
        {
            "id": "gzyxtsd",
            "score": 1,
            "text": "Men: the expendable sex.",
            "title_similarity": "0.44199523",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzyyhrm",
            "score": -1,
            "text": "Honestly, \nMen have more pressing hormonal problems than women. And that is the culprit of industrialization and urban dwelling and high density of population type of society. That is my take. So, that is a sort of an evolutionary drive I would say. Men spermatogenesis rate has declined in past decades tremendously. And with that hormone levels. However, male hormones and fertility is still a taboo.",
            "title_similarity": "0.8480357",
            "sentiment_compound": 0.0352
        },
        {
            "id": "gzyz0b4",
            "score": 1,
            "text": "You can open up, you can let your feelings out, but imagine how inconvenient and distressing it is to have to listen to it! After all, you’re a man, things shouldn’t be very hard for you.",
            "title_similarity": "0.51882875",
            "sentiment_compound": -0.8394
        },
        {
            "id": "gzz1sjw",
            "score": 1,
            "text": "I have to wonder what effect our current cultural climate contributes to male suicide.  Men are being generally portrayed  as racist, misogynistic, and rapists.  Not to mention we're being de-masculinized.",
            "title_similarity": "0.7596022",
            "sentiment_compound": -0.93
        },
        {
            "id": "gzz22ls",
            "score": -1,
            "text": "It’s simple. More is expected of men. Women just have to sit back and get pregnant and raise kids. That’s what we are biologically expecting. We expect men to go out there and be achievers and take on risks and be ambitious. Men are way more predisposed to disappointment for this reason. Because their expectations are higher and chance of failure or feeling inadequate is higher. No one will judge a woman for not being career driven or overly ambitious. The only way for them to screw up is to fail to have kids or let their eventual kids die. Ambition is not what their role is in society. All their energy goes to providing kids and nurture. From an evolutionary perspective. Men do all the rest.",
            "title_similarity": "0.7343362",
            "sentiment_compound": -0.8578
        },
        {
            "id": "gzz2umr",
            "score": 1,
            "text": "Men: “Suck it up/ Man up/ Be a man.”\n\nWomen: “You’re so powerful/ independent.”\n\nWomen live longer than men.",
            "title_similarity": "0.5877137",
            "sentiment_compound": 0.5598
        },
        {
            "id": "gzz4jmz",
            "score": -1,
            "text": "Women are the reason men commit suicide.",
            "title_similarity": "0.67566586",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzzct6f",
            "score": 1,
            "text": "14 year old white girl: Just man up!",
            "title_similarity": "0.20776711",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzzd13j",
            "score": 1,
            "text": "It’s not unwillingness, it’s fear of being mocked, shamed or put down by all the bro assholes permeating our culture.",
            "title_similarity": "0.58687985",
            "sentiment_compound": -0.7948
        },
        {
            "id": "gzzdjix",
            "score": -1,
            "text": "We should make it illegal to own guns to start with. Then we should open up more mental institutions. We obviously need them. Then strengthen the laws that allow for someone to be forcibly committed.",
            "title_similarity": "0.50521004",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzzqf57",
            "score": 1,
            "text": "Remember +80% of rough sleepers are men. Is it really so surprising that it contributes to suicide rates ?",
            "title_similarity": "0.773666",
            "sentiment_compound": -0.3423
        },
        {
            "id": "gzzzi2i",
            "score": -1,
            "text": "This is interesting. I thought that there was research that suggested women attempt suicide more often, however? Anyone know if that’s true and if so, how big the difference is?",
            "title_similarity": "0.6575648",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0020tb",
            "score": -1,
            "text": "Also guns. Men choose to shoot themselves while women take pills or cutting or other methods. \n\nBullets through the brain are much harder to survive.",
            "title_similarity": "0.71561253",
            "sentiment_compound": -0.4404
        },
        {
            "id": "gzxfnzv",
            "score": 48,
            "text": "I am a male. Took me a long time (about a decade) to get help after a couple of failed attempts. Please get help if you are suffering.",
            "title_similarity": "0.5793501",
            "sentiment_compound": 0.0772
        },
        {
            "id": "gzxuwm5",
            "score": -9,
            "text": "As a woman who has only been met with mockery, accusations of attention seeking and people claiming I’m lying about everything and being “hysterical,” I will gladly help even the statistics once I get my hands on some fentanyl!",
            "title_similarity": "0.55268127",
            "sentiment_compound": -0.4926
        },
        {
            "id": "gzxftqu",
            "score": 29,
            "text": " who raised you plays a huge roll in this. Was raised that a man should never cry or express even was hit when I was a kid when I expressed any sadness. Got it plenty of times when I need to be given a reason to cry. At 35 with two daughters just realizing how much it mentally fucked me up.",
            "title_similarity": "0.66967005",
            "sentiment_compound": -0.6753
        },
        {
            "id": "gzxk70n",
            "score": 110,
            "text": "Unwillingness to seek for help my ass. Men are looked down upon for looking for help. It's society's fault. Men who seek help are considered worthless, unmanly and weak.",
            "title_similarity": "0.7052752",
            "sentiment_compound": -0.5994
        },
        {
            "id": "gzx5px1",
            "score": 247,
            "text": "Because who takes these problems seriously? Even if you do go to a therapist... do they understand? Can they do anything about it? It often doesn't matter if \"talk about it,\" as that is indeed too simplistic a fix.\n\nOf course the social and economic conditions are damaging to any gender. A common theme among studies of well-being in younger generations. This study seems like a natural criticism of not only the psychiatric system, but the structure of society itself. Something more and more people have become vocal about.",
            "title_similarity": "0.7194762",
            "sentiment_compound": -0.5231
        },
        {
            "id": "gzx4sr5",
            "score": -76,
            "text": "Women good, men bad. #killallmen",
            "title_similarity": "0.5057807",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzxh7cj",
            "score": 9,
            "text": "Society shames people from seeking help.",
            "title_similarity": "0.6325122",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxmubd",
            "score": -9,
            "text": "Women are less likely to be treated seriously by medical professionals...",
            "title_similarity": "0.59679425",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzxhwqg",
            "score": -2,
            "text": "I thought it was men’s more direct approach to suicide?",
            "title_similarity": "0.6025887",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gzxkp4q",
            "score": 2,
            "text": "Revealing more root causes, can help find viable solutions. This is a crisis.",
            "title_similarity": "0.3060394",
            "sentiment_compound": -0.1779
        },
        {
            "id": "gzxl1eo",
            "score": -2,
            "text": "I always thought it was related to testosterone.",
            "title_similarity": "0.2833265",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxlh5p",
            "score": -2,
            "text": "Any control for gun ownership?",
            "title_similarity": "0.21354914",
            "sentiment_compound": -0.34
        },
        {
            "id": "gzxnms8",
            "score": -2,
            "text": "Men often choose more lethal means like firearms to carry out suicide where women often use less lethal means like drug overdose/poisoning.",
            "title_similarity": "0.73427916",
            "sentiment_compound": -0.128
        },
        {
            "id": "gzxoko9",
            "score": 2,
            "text": "I’m 23 years old and I secretly go to a therapist because I don’t want anyone to look at me like i’m a weak guy. It’s really hard to hide my mental issues for a long time and I honestly have been considering an end to it",
            "title_similarity": "0.6517977",
            "sentiment_compound": 0.0627
        },
        {
            "id": "gzxq8k1",
            "score": -2,
            "text": "they are also more likely to uses guns in suicide, hence more likely to die by suicide than women.",
            "title_similarity": "0.7257906",
            "sentiment_compound": -0.9345
        },
        {
            "id": "gzxsty0",
            "score": -2,
            "text": "Women are 3x more likely to attempt suicide than men.  Men are 3x as likely to die by suicide attempt then women.\n\nThe bottom line is that men are more violent and that’s why they die at a higher rate.",
            "title_similarity": "0.82441354",
            "sentiment_compound": -0.9719
        },
        {
            "id": "gzxv2wa",
            "score": 2,
            "text": "Grew up with a navy dad for whom everything revolved around money, everything required a monetary exchange and we had zero emotional connection. I struggled a lot to connect with other people because the heavily conservative views he instilled in me since early childhood meant shutting everything else out. (He was incredibly racist,  sexist and homophobic, the works)\n\nI don't keep in touch with him anymore,  I was very suicidal for a long time because of the way my parents raised my sister and I to be so isolated and closed off and not do anything without monetary incent, and compete with each other to be a better symbol of status for them while they wrote off the notion I might be severely mentally ill, because that was inconvenient.  Then I experienced rapid fire trauma in my early twenties and couldn't effectively talk to anyone about it, I had no idea how to express myself.\n\nI'm incredibly blessed to have friends from many walks of life who pulled me out of my old mindset. A lot of the anger towards my dad has faded into a low simmering pity, he's just someone I don't ever want in my life again, but I get the feeling he struggles with suicidal thoughts himself and wonder how he's doing often.",
            "title_similarity": "0.7724056",
            "sentiment_compound": -0.9726
        },
        {
            "id": "gzxyd6s",
            "score": -2,
            "text": "I feel like this title is a little misleading. The common theory is that society puts pressure on men to lift their chin up and be \"strong\" in the face of any and all challenges. Which is true, this attitude was and still is very common. It's not the men's fault they were brought up with this mindset being ingrained into their young minds.",
            "title_similarity": "0.5708158",
            "sentiment_compound": 0.7616
        },
        {
            "id": "gzxz0t1",
            "score": -2,
            "text": "This is obviously due the fact that men are bad. That's why they kill themselves. Because they don't like being bad. Glad we are able to shed some light, getting specific with the laser beam of \"socio economic issues\"..",
            "title_similarity": "0.7364427",
            "sentiment_compound": -0.6662
        },
        {
            "id": "gzy37ok",
            "score": -2,
            "text": "Mental health is a money trap to get people addicted to drugs as opposed to fixing their lives, sunlight and an hour in the weight room everyday is worth more than a lifetime in the shrink room",
            "title_similarity": "0.72776383",
            "sentiment_compound": -0.1027
        },
        {
            "id": "gzyu6io",
            "score": -2,
            "text": "It’s because men know how to follow through on a decision.",
            "title_similarity": "0.27525315",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzywtk1",
            "score": 2,
            "text": "Used to live in Northern California and had Kaiser. A generally well-praised health care company, their mental health support was god-awful. I kept missing their return calls because I worked as an 911 EMT during the 9-5 m-f time of the week and was always on a call. For whatever reason I couldn't schedule anything online or with the receptionist directly.\nI often wonder how many people killed themselves because that particular health care company failed so miserably at connecting people with mental health professionals.",
            "title_similarity": "0.7592912",
            "sentiment_compound": -0.7088
        },
        {
            "id": "gzyxq1i",
            "score": -2,
            "text": "Affordable healthcare is non-existent to millions of americans.",
            "title_similarity": "0.5491054",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzzdnpn",
            "score": -2,
            "text": "Women are more likely to attempt suicide, men are more likely to succeed at the attempt.  This is the cause of the disparity",
            "title_similarity": "0.75222737",
            "sentiment_compound": -0.2585
        },
        {
            "id": "gzxoxl4",
            "score": 12,
            "text": "Counseling has done nothing for me. At least in my area, it doesn't feel like they actually care and are just doing it for the paycheck. If I were suicidal they'd only help because they're required by law and not because they actually cared.",
            "title_similarity": "0.6195913",
            "sentiment_compound": 0.2709
        },
        {
            "id": "gzxpqsg",
            "score": 52,
            "text": "Men have nowhere to go",
            "title_similarity": "0.36075225",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxjt8y",
            "score": 83,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzxgwid",
            "score": 32,
            "text": "I'm a male. I don't seek help because I'm in the US and can't afford treatment and the minute you mention suicide they call the helpful authorities come to take you away. I can't afford all that. Death is clearly a better option. But suicide is taboo, because humans must work and suffer until they die.",
            "title_similarity": "0.8124927",
            "sentiment_compound": -0.966
        },
        {
            "id": "gzxau9j",
            "score": 102,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzxouay",
            "score": -1,
            "text": "Did you ever consider that, men commit suicide because of women?",
            "title_similarity": "0.73068464",
            "sentiment_compound": -0.5106
        },
        {
            "id": "gzxp7vr",
            "score": 2,
            "text": "Of course it's socio-economic, all problems can be linked to socio-economic troubles. Now lets make more cuts to welfare and social services",
            "title_similarity": "0.45210373",
            "sentiment_compound": -0.8016
        },
        {
            "id": "gzxql7e",
            "score": 3,
            "text": "Interesting. Completely anecdotally, I a woman, have an annual physical every year and most women i know do too because we got in the habit young as it was the only way to access birth control. Most of the men i know do not have annual physicals unless they're really into a competitive sport. That annual physical does include a mental health screening and helped me get diagnosed and treated for depression.",
            "title_similarity": "0.57633567",
            "sentiment_compound": -0.0094
        },
        {
            "id": "gzxrjld",
            "score": 4,
            "text": "Men seem to hold on to negative thoughts for far longer than Women. Women get bursts of extreme depression but have the ability to bounce back.   \nMen more often, slowly cascade into a lifetime of misery that feels inescapable. I know from experience.",
            "title_similarity": "0.77239203",
            "sentiment_compound": -0.7874
        },
        {
            "id": "gzxxx0n",
            "score": -2,
            "text": "Men are more successful",
            "title_similarity": "0.38320053",
            "sentiment_compound": 0.624
        },
        {
            "id": "gzxym68",
            "score": -2,
            "text": "Women attempt suicide much more often though. Just less likely to use guns and other more violent methods.",
            "title_similarity": "0.7055516",
            "sentiment_compound": -0.8655
        },
        {
            "id": "gzxz085",
            "score": 3,
            "text": "The way the title is worded it makes it sound like we should be helping women get better at killing themselves. Like instead of saying men commit suicide more often; it kind of cuts the sentence up by using men die of like making it sound like women try but fail",
            "title_similarity": "0.73030686",
            "sentiment_compound": -0.7267
        },
        {
            "id": "gzz0sri",
            "score": 3,
            "text": "Valid government websites:\n\nhttps://www.womenshealth.gov/\n\nhttps://www.girlshealth.gov/\n\n\nNot valid websites:\n\nhttp://www.menshealth.gov/\n\nhttp://www.boyshealth.gov",
            "title_similarity": "0.4437578",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzx25vy",
            "score": -74,
            "text": "Durkheim would be unimpressed by these conclusions.  If you don’t know who Durkheim is, well you probably shouldn’t comment.\n\nAnd it only took 4min for someone to become offended....\n\nEdit-Okay, apparently nobody here knows who Durkheim was.  He is credited as the founder of sociology as a science, he wrote the first major study of SUICIDE (see, there was a POINT to the reference), he demanded that the study of social phenomena be done in a rigorous manor, unlike this paper which is filled with breezy comments.  Yes, Durkheim would NOT be impressed with this paper at all.",
            "title_similarity": "0.7185833",
            "sentiment_compound": -0.8462
        },
        {
            "id": "gzxu3fu",
            "score": 3,
            "text": "I’ve lost 8 friends to self inflicted deaths, all guys in their early 20’s. I’d say it is in fact all of those reasons, being “unwilling” to get help, socio economic stuff and lack of easily accessible health care. And if you whittle it down, I believe the root cause comes down to patriarchal masculinity (aka toxic masculinity) setting unrealistic and harsh standards for how a man is supposed to be. That kind of masculinity hurts everyone, regardless of gender. Men are supposed to be strong and this feeds into not getting help or talking about their feelings, on top of the fact that depression by itself makes it difficult to do anything and healthcare is a mess here in the US at least . Men are also expected to be able to support themselves and their families, so that adds to the feeling of being no good, if you are not super comfortable financially...",
            "title_similarity": "0.8323775",
            "sentiment_compound": -0.8447
        },
        {
            "id": "gzxzt0x",
            "score": 5,
            "text": "And it’s literally victim blaming by definition",
            "title_similarity": "0.37045032",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzyxx91",
            "score": 2,
            "text": "Call it stupid, I don't care, but I think it has to do with the traditional nature of the man as the provider.\nWhen women are at their weakest, they can seem the most attractive to men because it  makes men feel important and appreciated when helping them. Even if women at their weakest find no partner, they will more easily get support by random people who feel pity.\nMen on the other hand are the most unattractive at their weakest, and the chances of getting supported by a woman in form of a providing relationship will lessen. So the effect is the contrary from vice versa.\nI don't think it's the lack of seeking for help but rather the lack of getting help.",
            "title_similarity": "0.69797933",
            "sentiment_compound": 0.7796
        },
        {
            "id": "gzxpahx",
            "score": 146,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzywr7i",
            "score": 15,
            "text": "As a US Army Officer I did an administrative investigation (AR-15) into the suicide of a Soldier. During the review of his medical records, I found a suicide risk assessment that placed him at high risk. Since the risk assessment was completed by a Nutritionist during a healthy eating seminar, the red flags were not acted upon. When I asked the Nutritionist why nothing was done, she said, “It was outside the scope of her practice.” In my follow-up question that if it was outside the scope of her practice to act, then why did she do the assessment, she shrugged her shoulders and said they were just told to do them for everyone.\n\nThis happened in late 2017 when suicide in the US Military was a focus area for leadership (still is) and various avenues (inside the chain of command and out) for assistance were available. My findings were a complete failure of first line leadership due to lack of proper training and oversight by mid-level and senior leadership within the Brigade.",
            "title_similarity": "0.7075193",
            "sentiment_compound": -0.9709
        },
        {
            "id": "gzxgeqm",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.1361165"
        },
        {
            "id": "gzxu6bz",
            "score": 48,
            "text": "The only country on the planet where women suicide at a significantly higher rate than men is China. It’s also a country where the role of women changed a lot somewhat recently. The one child policy meant women had far fewer children, but at the same time they took on other responsibilities that had once been only the province of men. Perhaps the different types of stressors one experiences as a “bread winner” are more likely to cause significant depression and anxiety of the kind or intensity that raises the risk of suicide. This may also be part of the explanation for the increas of female suicide in western countries. So more recognition of what those stressors are and a better understanding of how to help people experiencing them would bring the rate down. \n\nAnother issue is genetic risk factors for major depression, and the different forms of depression that arise. There needs to be better knowledge of the many different genetic bases for depression and how to treat each type. Few people experience depression the same as the next person, so that makes it hard to spot and treat. Whilst some people with depression have low seratonin others do not, so that whole class of seratoninin boosting meds does nothing for them.\nThis is an interesting and very credible study on the genetics of depression. \n\nhttps://www.sciencedaily.com/releases/2019/02/190205102550.htm",
            "title_similarity": "0.8029863",
            "sentiment_compound": -0.9924
        },
        {
            "id": "gzxcxm0",
            "score": 663,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzxuk10",
            "score": 16,
            "text": "Its also because there are no men's resources. No men's abuse shelters, no men's mental health clinics, men don't get any support when it comes to this stuff.",
            "title_similarity": "0.5857092",
            "sentiment_compound": -0.5408
        },
        {
            "id": "gzxmfro",
            "score": 6,
            "text": "I'll be honest. I genuinely don't think it's entirely the fault of men being too stubborn to talk to someone. I think most people are just really bad at listening and helping someone in need. This may just be my personal experience but most people I've talked to don't really know what to say or are just uncomfortable with the real issues that I've faced. Even actual therapists didn't really help me, not that they didn't try.",
            "title_similarity": "0.75460064",
            "sentiment_compound": -0.8441
        },
        {
            "id": "gzxnw91",
            "score": -6,
            "text": "Have the incels found this thread yet? I’m scared to sort by controversial.",
            "title_similarity": "0.46318376",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gzxkrlq",
            "score": 51,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzx6gg5",
            "score": 1201,
            "text": "People in general are looked down upon if they have mental health issues. This is **especially** prevalent in men, who are seen as weak. Its a problem for everyone, but it manifests worse in men unfortunately.",
            "title_similarity": "0.7809425",
            "sentiment_compound": -0.8765
        },
        {
            "id": "gzx1s3q",
            "score": 1824,
            "text": "This paper is not a quantitative statistical study; it's the author's narrative summary of ten unstructured interviews with men who had a history of self-harm or suicidal thoughts. The author criticizes the notion that \"men don't talk enough about their issues and should open up more\"; in her view, it is too simplistic, it disregards the differences between individual men (and women) in favor of a misleading stereotype, and distracts attention from the social and economic risk factors of suicide.\n\nHere are some excerpts from the paper:\n\n> Talking about problems or emotions does not change the structural, economic, or political conditions which may shape men’s distress. Most participants in this study were out of work and receiving benefits. Lack of work, or inability to work, and the shaming of benefits claimants in 21st century austerity Britain shapes and produces distress [...]. Talking and having some social support may help individuals to feel better, but as noted knowingly by several participants, it does not significantly change their housing situation, money worries, or employment status; and it does not generate valuable jobs that can be undertaken by men who have worked in manual labour all their lives but are now physically disabled. [...] Campaigns which focus on ‘talking’ or ‘tackling stigma’ in response to mental health are deeply entangled with the interests of neoliberal capitalism, in diverting attention from the social and economic conditions which produce and maintain distress.\n\n[...]\n\n> Neglecting the importance of the sometimes-shameful content of men’s talk has given rise to social-media campaigns featuring celebrities sharing their troubles, seeking to normalise ‘talking’ about problems. The problems such celebrities share contrast starkly with the unsettling problems participants in this study articulated. [...] While such campaigns generate good feelings, I suggest more care needs to be taken with the effects of these in affirming ‘talk’ as an unproblematic and straightforward response to suicide among men.\n\n[...]\n\n> Access to mental health support in the UK (and elsewhere) is notoriously challenging. Men in this study described thwarted attempts to ‘seek help’ from statutory services, finding some solace with community-based services they attended. [...] Indeed, the community-based service men accessed was praised for the role workers took in supporting men with all aspects of their lives - including accessing benefits and housing. Rather than a focus on ‘talk’ as a response to suicide among men, suicide prevention initiatives might instead seek to engage more broadly with economic and housing security, access to non-stigmatising welfare/disability support, robust programmes promoting gender equality, easy access to well-resourced community-based services in relation to mental health and substance use. Each of these is of course much more complicated and politically sensitive than encouraging men to ‘talk more’ about their problems, but without addressing these concerns I would suggest that focusing on ‘talk’ will be ineffective at best.",
            "title_similarity": "0.7877743",
            "sentiment_compound": 0.2284
        },
        {
            "id": "gzxhv16",
            "score": 181,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzxisfr",
            "score": 715,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzxja01",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.09064232"
        },
        {
            "id": "gzxk1yn",
            "score": 5563,
            "text": "Criminologist here, I studied this a bit a while ago. \n\nA big reason why is psychological differences in how man and women experience depression. For whatever reason, men tend to experience suicidal tendencies and depression as a long, steady, slow decline, whereas women tend to get spikes of suicidal thoughts, usually as a reaction to a real-life negative event. \n\nHow does this translate into suicide? Men tend to think long and hard about it, and plan their suicides. They will go off and away and commit suicide, making sure they do it in a place where nobody sees them, and making sure they do it successfully. Women tend to attempt suicide (at a much higher rate, actually, they are just less successful) in acute periods of suicidal thoughts, meaning they don't plan it, and they often do it in the home where others find them, meaning they survive. \n\nPeople like to bring up 'methods', in that men use guns more. But men have higher death rates for every other type of suicide as well. \n\nThere is a theory I read that women evolutionarily tended to commit suicide when they were in danger, whereas men tended to commit suicide when they were ashamed or dishonored. This would play a big role in how suicidal thoughts affect us. But its obviously a very loose theory.",
            "title_similarity": "0.8442607",
            "sentiment_compound": -0.9948
        },
        {
            "id": "gzxjz2h",
            "score": 60,
            "text": "[removed]",
            "title_similarity": "0.09064232"
        },
        {
            "id": "gzyzuze",
            "score": 51,
            "text": "U.S. male here. Struggled with severe depression and anxiety driven by isolation and exacerbated by improperly treated adhd.  Told family members and mostly got uncomfortable responses and “hope you won’t do anything like that...”. Only my father understood that it was serious. He insisted I hand over all firearms to him and checked in with me daily, sometimes dropping everything to meet me somewhere and try to help me get my head above water. He also got me involved with a men’s group that I sit with weekly.  The day that a man showed up to process his son’s suicide I knew that I was on the other side of the line. Standing in a room while a dozen men helped this grieving father was like being at my own funeral, and I knew I could never visit this kind of agony on my family, especially not my father who had done his damndest to keep me alive. Now I was the man who would be there to pick up the pieces for others. \n\nI’m doing much better now- going on a year plus without depression or anxiety. No meds, just rearranged my life (career change can be quite the game changer). Still sit with that group as often as I can manage. Isolation kills men.  Knowing that I was deeply loved saved my life.",
            "title_similarity": "0.75898427",
            "sentiment_compound": -0.8801
        },
        {
            "id": "gzxij7e",
            "score": 96,
            "text": "[removed]",
            "title_similarity": "0.09064232"
        },
        {
            "id": "gzxlc6z",
            "score": 39,
            "text": "[removed]",
            "title_similarity": "0.09064232"
        },
        {
            "id": "gzxv1an",
            "score": 1066,
            "text": "[deleted]",
            "title_similarity": "0.1361165"
        },
        {
            "id": "gzxpb9k",
            "score": 3147,
            "text": "\"We found that in 67% of \\[men who died of suicide\\], there had been contact in previous three months with frontline services, 38% in final week.\"\n\n[https://sites.manchester.ac.uk/ncish/reports/suicide-by-middle-aged-men/](https://sites.manchester.ac.uk/ncish/reports/suicide-by-middle-aged-men/)\n\nMen do seek help, they just don't get it.",
            "title_similarity": "0.7518037",
            "sentiment_compound": -0.7506
        },
        {
            "id": "gzxtojz",
            "score": 547,
            "text": "Why is it $57 to actually read this?  I was curious to actually read through more then the abstract.",
            "title_similarity": "0.40651935",
            "sentiment_compound": 0.3182
        },
        {
            "id": "gzxjspf",
            "score": 48,
            "text": "Not a lot of comments here mentioning worsening economic conditions and pressures - [https://www.vox.com/2020/4/15/21214734/deaths-of-despair-coronavirus-covid-19-angus-deaton-anne-case-americans-deaths](https://www.vox.com/2020/4/15/21214734/deaths-of-despair-coronavirus-covid-19-angus-deaton-anne-case-americans-deaths)\n\n[https://www.statnews.com/2019/03/05/deaths-despair-prevention-comprehensive-strategy/](https://www.statnews.com/2019/03/05/deaths-despair-prevention-comprehensive-strategy/)\n\n&#x200B;\n\n[https://theconversation.com/machines-can-do-most-of-a-psychologists-job-the-industry-must-prepare-for-disruption-154064](https://theconversation.com/machines-can-do-most-of-a-psychologists-job-the-industry-must-prepare-for-disruption-154064)\n\n[https://www.sixthtone.com/news/1006531/the-ai-girlfriend-seducing-chinas-lonely-men](https://www.sixthtone.com/news/1006531/the-ai-girlfriend-seducing-chinas-lonely-men)\n\n[https://www.huffpost.com/entry/barbers-black-mental-health-lorenzo-lewis\\_n\\_5d4890b0e4b0d291ed0542b1](https://www.huffpost.com/entry/barbers-black-mental-health-lorenzo-lewis_n_5d4890b0e4b0d291ed0542b1)\n\n&#x200B;\n\nhttps://www.technologynetworks.com/neuroscience/news/neural-inflammation-critical-for-stress-induced-depression-306569  \nhttps://scitechdaily.com/aspirin-tylenol-fish-oil-effectively-and-safely-help-curb-depression/  \nhttps://www.eurekalert.org/pub\\_releases/2021-05/ncoc-lra052721.php  \nhttps://thethirdwave.co/about\n\n[https://www.psycom.net/ketamine-suicidal-ideation-treatment](https://www.psycom.net/ketamine-suicidal-ideation-treatment)\n\n[https://www.bbc.com/news/health-56373202](https://www.bbc.com/news/health-56373202)\n\n[https://www.npr.org/sections/health-shots/2019/08/14/746614170/mdma-aka-ecstasy-shows-promise-as-a-ptsd-treatment](https://www.npr.org/sections/health-shots/2019/08/14/746614170/mdma-aka-ecstasy-shows-promise-as-a-ptsd-treatment)",
            "title_similarity": "0.60286725",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzxvkdc",
            "score": 67,
            "text": "I reached an all time low this year and searched for help. It was impossible to find them even accepting patients. \n\nI just accepted life is what it is and keep going. It sucks, I want professional help so badly.",
            "title_similarity": "0.6697514",
            "sentiment_compound": 0.2979
        },
        {
            "id": "gzxhyi5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09064232"
        },
        {
            "id": "gzxixri",
            "score": 1,
            "text": "id be curious what the rates of attempted suicide are. from my experience and very small sample of people women are more likely to attempt suicide and men are more likely to commit suicide.",
            "title_similarity": "0.7614453",
            "sentiment_compound": -0.8942
        },
        {
            "id": "gzxjo2t",
            "score": 1,
            "text": "Of course. Because it has to be about money, instead of  the stigma from people.",
            "title_similarity": "0.37418076",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxjoms",
            "score": 1,
            "text": "Not like anything's going to change. Let us do what we want.",
            "title_similarity": "0.11820746",
            "sentiment_compound": -0.2047
        },
        {
            "id": "gzxl1do",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.1361165"
        },
        {
            "id": "gzxl2sk",
            "score": 1,
            "text": "It’s not that they aren’t willing to seek help, they get shamed when they asked for help.",
            "title_similarity": "0.58215207",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gzxl3j3",
            "score": 1,
            "text": "There was an askreddit post a few days ago where we say this unfolding before our eyes. I don't know what the question was.",
            "title_similarity": "0.31368497",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxl4wg",
            "score": 1,
            "text": "I thought a big part of it was that men tend to have more knowledge and access to firearms.",
            "title_similarity": "0.4179509",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxlqyd",
            "score": 1,
            "text": "A step in the right direction, everyone deserves appropriate care.",
            "title_similarity": "0.05459841",
            "sentiment_compound": 0.4939
        },
        {
            "id": "gzxm0tv",
            "score": 1,
            "text": "Why can't it be both in addition to multiple other reasons?",
            "title_similarity": "0.24825332",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxngbj",
            "score": 1,
            "text": "more evidence we need a national single payer healthcare system",
            "title_similarity": "0.3447848",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxnk9q",
            "score": 2,
            "text": "Could it not be the case that both are true?",
            "title_similarity": "0.14838639",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzxnnu8",
            "score": 1,
            "text": "And the lack of people that can actually sympathize with you.",
            "title_similarity": "0.4547192",
            "sentiment_compound": -0.3182
        },
        {
            "id": "gzxnp1y",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.1361165"
        },
        {
            "id": "gzxnuwo",
            "score": 1,
            "text": "From what I read years ago a big factor is also that men tend to follow through on suicide attempts. For women it's predominantly failed attempts.",
            "title_similarity": "0.811916",
            "sentiment_compound": -0.8316
        },
        {
            "id": "gzxo6av",
            "score": 1,
            "text": "It’s also because it’s just difficult to even find help that is actually helpful!",
            "title_similarity": "0.47420055",
            "sentiment_compound": 0.5093
        },
        {
            "id": "gzxownx",
            "score": 1,
            "text": "I've been waiting for the psychologists for 3 months to have an available date, services are absolutely swamped in NZ",
            "title_similarity": "0.5145413",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxpeqw",
            "score": 1,
            "text": "So late last year. Had to take a vitamin . on top of the 1 med I take. Come to find out any amount above 100mg. Would cause massive mood swing and suicide thought.  I stop taking it after 1 week. Idk why am allergy to a high does of a vitamin.\n\nWhy I wanted to. One share the story. Is am male. But I realize I need to share my feeling more.\nBut also to bring up. Side effects of drugs or unknown combo of a drug and simple vitamin combo.",
            "title_similarity": "0.6613675",
            "sentiment_compound": 0.7184
        },
        {
            "id": "gzxplzx",
            "score": 1,
            "text": "I’d love to read it but it’s way too expensive",
            "title_similarity": "0.5378172",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzxpu8x",
            "score": 1,
            "text": "This is because of guns. Men tend to comity suicide with handguns and handguns are, quick, easy, require no set-up, and are very very effective at killing people. So men die way more often when they attempt suicide than women.",
            "title_similarity": "0.70965445",
            "sentiment_compound": -0.9379
        },
        {
            "id": "gzxpwwx",
            "score": 1,
            "text": "Men also also use more lethal ways to try and commit suicide compared to women. Hence the greater success rate.",
            "title_similarity": "0.6880798",
            "sentiment_compound": 0.4404
        },
        {
            "id": "gzxq5th",
            "score": 5,
            "text": "I have always thought it had more to do with society not taking men’s emotions seriously than with those men being “unwilling” to seek help.",
            "title_similarity": "0.73744047",
            "sentiment_compound": 0.25
        },
        {
            "id": "gzxqbjq",
            "score": 1,
            "text": "No it’s because men are called weak or pansy for talking about feelings or crying",
            "title_similarity": "0.6717202",
            "sentiment_compound": -0.802
        },
        {
            "id": "gzxqc8o",
            "score": 1,
            "text": "\"Uh yeah, but we have to pay slightly more for deodorant, so check your male privilege there.\" - a feminist somewhere.",
            "title_similarity": "0.57713723",
            "sentiment_compound": 0.5023
        },
        {
            "id": "gzxqehh",
            "score": 1,
            "text": "It's quite a shame. Everyone goes through their own share of problems, but for the majority of men, they either don't know how to open up, who to open up to, and whether they'd be taken seriously. This needs to change.",
            "title_similarity": "0.7077932",
            "sentiment_compound": -0.5407
        },
        {
            "id": "gzxqjqa",
            "score": 3,
            "text": "So its not that we dont want help its that no one wants to hear it? Isnt that what we've all been saying and now its just ironic?",
            "title_similarity": "0.47659856",
            "sentiment_compound": -0.6747
        },
        {
            "id": "gzxqrtn",
            "score": 1,
            "text": "Well yeah because whenever I would say how I felt it was always “man up” or “quit listening to sad music”",
            "title_similarity": "0.64322853",
            "sentiment_compound": 0.0516
        },
        {
            "id": "gzxqwpa",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.1361165"
        },
        {
            "id": "gzxrb2d",
            "score": 1,
            "text": "Thank you God someone brought this to light.",
            "title_similarity": "0.014398174",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzxrbll",
            "score": 1,
            "text": "If this was related to more economic and health care access issues, women would most likely be affected just as much",
            "title_similarity": "0.5601504",
            "sentiment_compound": 0.3262
        },
        {
            "id": "gzxrmva",
            "score": 1,
            "text": "Yep. My stepdad tried to off himself a few years ago. He was on a 5150 hold for 3 days. Won’t go to any kind of therapy and says he can’t take any medication for it.",
            "title_similarity": "0.5690572",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzxrn85",
            "score": 1,
            "text": "This article really resonates, from my attempts at dealing with my depression and anxiety, I felt both PCPs I discussed it with and a few psychiatrist I was seeing really didn’t make the discussion of treatments easy or feel like being helpful. I took meds for a while during a rough time I was having due to medical issues and tried talking to someone and shopped around it just didn’t seem to help or no one wanted to be helpful.\n\nAll the advice seemed counterintuitive to helping fix the situation and was more just ignore it and hope it doesn’t come back. Rather then giving me tools to deal with the situations that triggered it.\n\nCurrently doing much better in life and depression is manageable now without meds.",
            "title_similarity": "0.72925025",
            "sentiment_compound": 0.8411
        },
        {
            "id": "gzxrs2v",
            "score": 3,
            "text": " Not to seek help or…. When they tell their physician or therapist how they are feeling etc they get the ol “ I’m sure everything will be fine. You look tough. “. Uh what??  True story all the time.  This paper need to look deeper than just the kiddie pool.",
            "title_similarity": "0.54128635",
            "sentiment_compound": 0.6126
        },
        {
            "id": "gzxrwoy",
            "score": 1,
            "text": "Well I could have told you this. Being here, doing this.",
            "title_similarity": "-0.0473528",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzxryvl",
            "score": 1,
            "text": "Come on y’all go see therapists!!",
            "title_similarity": "0.16542608",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxs3et",
            "score": 2,
            "text": "It's ALWAYS socio-economics. Always.",
            "title_similarity": "0.22063415",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxssxn",
            "score": 1,
            "text": "This is common knowledge literally to every one of the millions of men who have tried to reach out for help and have gotten roadblocked, shamed, or ignored the entire way.",
            "title_similarity": "0.5411718",
            "sentiment_compound": -0.4767
        },
        {
            "id": "gzxstod",
            "score": 1,
            "text": "Depression and being lonely are what fucks me up. The medication helps with the depression but being lonely is a killer..i thought of self harm once in the last year. Moved past it.",
            "title_similarity": "0.71265626",
            "sentiment_compound": -0.9287
        },
        {
            "id": "gzxsuiz",
            "score": 1,
            "text": "Like It's her choice, It's his choice.",
            "title_similarity": "0.14935997",
            "sentiment_compound": 0.3612
        },
        {
            "id": "gzxt0b4",
            "score": 1,
            "text": "I'm currently seeking help, and surprise no one is helping me. I get the same advice and I tell them that's something I am doing or already did, what's the next step, oh you didn't have constructive help you just wanted to feel like you were helping. People just don't want to lift a finger is all.",
            "title_similarity": "0.5032706",
            "sentiment_compound": 0.7202
        },
        {
            "id": "gzxt0bm",
            "score": 1,
            "text": "Yeah, but what was he wearing? Was he basically asking for it?",
            "title_similarity": "0.11708671",
            "sentiment_compound": 0.2406
        },
        {
            "id": "gzxt3pk",
            "score": 1,
            "text": "I tried it. I failed. But the reason is cause we as men are told we can’t talk about it we have to be strong",
            "title_similarity": "0.58353364",
            "sentiment_compound": 0.5106
        },
        {
            "id": "gzxto3f",
            "score": 1,
            "text": "Men are just more efficient at killing themselves. Women probably attempt more suicides but fail at it more too.",
            "title_similarity": "0.77907884",
            "sentiment_compound": -0.7864
        },
        {
            "id": "gzxu1hh",
            "score": 3,
            "text": "This is just my experience but honestly for me it was a mix of being conditioned to be emotionally mute and mental health costing an arm and a leg. I’ve had therapists twice in my life, one at 16 that misdiagnosed me as bipolar and manic. And a second one at 25 that was helping me through severe PTSD and ADD (until I had to get my own insurance at 26 and couldn’t afford anything). I definitely still need help but I can’t afford to get help. It’s hard to fix any problem when you can’t afford to get the help.",
            "title_similarity": "0.74304247",
            "sentiment_compound": 0.9253
        },
        {
            "id": "gzxu2vc",
            "score": 1,
            "text": "Not a doctor or an expert in any way but it feels like as men we have a burden to bear. We gotta be tough and strong at all times because its whats expected of us. Just my two cents.",
            "title_similarity": "0.5768101",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzxu5ny",
            "score": 3,
            "text": "Depression is a weird thing I feel like it almost paralyzes me. It destroyed my last relationship and no matter how much I’ll try to talk it doesn’t really change things. At the end of the day I’m still a man who doesn’t know what hat path to take in life it makes you feel inadequate. No matter how much I talk about it nothing will change the fact that if I don’t find some sort of success in a career path soon I won’t know how to feel useful or feel like I have any worth. There are a thousand comments and no one will read this but I still try to talk even though it doesn’t help all that much.",
            "title_similarity": "0.73257244",
            "sentiment_compound": 0.5154
        },
        {
            "id": "gzxug7g",
            "score": 1,
            "text": "Every time I try to get help it's always some form of suck it up.",
            "title_similarity": "0.39014852",
            "sentiment_compound": -0.0516
        },
        {
            "id": "gzxukwo",
            "score": 1,
            "text": "Felt that depressive slow burn during covid real bad",
            "title_similarity": "0.5740173",
            "sentiment_compound": -0.7269
        },
        {
            "id": "gzxul98",
            "score": 1,
            "text": "Who attempts more?  I think men, and men tend to mean it an commit.",
            "title_similarity": "0.5198126",
            "sentiment_compound": 0.296
        },
        {
            "id": "gzxulyf",
            "score": 7,
            "text": "I know I am dying because of mental health but I don't have the will to seek help becuz I am ashamed to seek help.",
            "title_similarity": "0.7745752",
            "sentiment_compound": 0.4497
        },
        {
            "id": "gzxun0d",
            "score": 1,
            "text": "If I didn't live in America and have to worry about going into medical debt, I bet my life could be quite different with access to mental healthcare/therapy/prescription drugs..",
            "title_similarity": "0.59376454",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gzxurz0",
            "score": 1,
            "text": "I also thought a lot of the higher rate of men dying was based on the method used. Men use firearms while women don’t as often. Is that not true?",
            "title_similarity": "0.77529943",
            "sentiment_compound": -0.3252
        },
        {
            "id": "gzxv3hx",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzxvfl1",
            "score": 15,
            "text": "[deleted]",
            "title_similarity": "0.1361165"
        },
        {
            "id": "gzxvquk",
            "score": 1,
            "text": "I had many times where I was very depressed. During the worst of it I knew if I had a gun in my hand I would've taken my life. So glad I didn't add what I was scared of and thought there wasn't any way out of was very minimal and nothing I ever needed to worry about. Is depression ever there? To an extent. When my life feels boring and like I can't finish what I be started with college or fix things that can't be fixed, along with my nightmares it's gets hard. But hey I had a good dream last night and with was easy :) I have talked to my dad about depression though and he says the exact same. Granted he has sever never damage, internal radiation burns, and is literally radioactive to the point if you put a Geiger counter in him he is gonna lite tf up. Oh and a fused back. So I understand where he would've killed himself and all that puts it into perspective for me so I know if he didn't do it so he could see what I do in life I can do the same for my future family's sake and benefit the world by raising some great kids with good values.",
            "title_similarity": "0.7612581",
            "sentiment_compound": 0.9614
        },
        {
            "id": "gzxw6w7",
            "score": 1,
            "text": "Men are also more willing to violently take their lives, which results in “success” more often. read: Pills don’t work great, shotguns do.",
            "title_similarity": "0.7233052",
            "sentiment_compound": 0.0094
        },
        {
            "id": "gzxwilt",
            "score": 1,
            "text": "Once I read that also men seek for more \"savage\" ways to commit suicide, I don't remember well but let's say that women would try to drink a bottle of pills while men would buy a shotgun and shot themselves on the head.",
            "title_similarity": "0.7221956",
            "sentiment_compound": -0.5724
        },
        {
            "id": "gzxwlx4",
            "score": 1,
            "text": "Unwillingness?  \n\nNo.  It's because we know society won't care.",
            "title_similarity": "0.44176668",
            "sentiment_compound": -0.3875
        },
        {
            "id": "gzxwmjc",
            "score": 1,
            "text": "Reading this thread full of people who immediately dismiss this because it would mean being empathetic towards men is extremely depressing.",
            "title_similarity": "0.74415416",
            "sentiment_compound": -0.0498
        },
        {
            "id": "gzxwzfn",
            "score": 1,
            "text": "Since this paper is based on an analysis of just ten interviews, none of which the paper writer actually conducted himself, I'm very skeptical of his conclusions. That's an especially small pool when it's supposed to cover sub-groups including \"men who had self-harmed, thought about, or attempted suicide.\" Those are very different category groups to lump together and represent in such small numbers.",
            "title_similarity": "0.72890043",
            "sentiment_compound": -0.796
        },
        {
            "id": "gzxxb2x",
            "score": 1,
            "text": "Definitely not an unwillingness to seek help and more of society not caring about depressed men.  We are judged for reaching out and are taught to hold everything in",
            "title_similarity": "0.559445",
            "sentiment_compound": 0.741
        },
        {
            "id": "gzxxdwu",
            "score": 1,
            "text": "I thought men die from suicide more than women because they use more efficient methods and tend to be more committed.",
            "title_similarity": "0.77730817",
            "sentiment_compound": -0.6012
        },
        {
            "id": "gzxxfg3",
            "score": 18,
            "text": "When I was suffering the peak of my depression I attempted to seek out professional help. In my home city of 128,000 people, there were several companies and organizations that I could choose from to find a qualified professional. \n\nAfter contacting each one I was placed on their waiting lists which I was told at the time would (only) be a few months. Not a single place had any openings for new clients.\n\nDesperate and on the edge of just ending it all; I reached out to people I knew, asking them what other alternatives there were. \n\nIn the end I was lucky as a local church had set up a grant for mental health issues and after contacting them they told me I qualified, however I too would be put on another waiting list. though they informed me that it would only be a few weeks.\n\nAlmost a month went by and finally I was contacted by a therapist who agreed to book me in.\n\neven though it was subsidized through the grant I insisted that I paid full price and the grant money be used for someone else. \n\nAlmost a year later I was finally contacted by one of the other organizations I had been on a waiting list with. \n\nThis whole process made me realize how desperately underfunded and underequipped the mental health industry is in my country.  I feel that I was one of the lucky ones. I had managed to persevere through the constant self doubt and defeatism that accompanies depression. I know there are some unfortunate souls who could not withstand that level of neglect. \n\nFor those out there, both men and women, suffering from mental illness, keep holding on. It's always darkest before the light.\n\nKia Kaha (Stay strong)",
            "title_similarity": "0.6324588",
            "sentiment_compound": -0.9571
        },
        {
            "id": "gzxxiac",
            "score": 6,
            "text": "I feel like today it's more about men's inability to seek help, and other's unwillingness to listen to their problems.",
            "title_similarity": "0.68098366",
            "sentiment_compound": -0.1189
        },
        {
            "id": "gzxxnit",
            "score": 1,
            "text": "I'm in this article and I don't like it",
            "title_similarity": "0.43123165",
            "sentiment_compound": -0.2755
        },
        {
            "id": "gzxxqvj",
            "score": 1,
            "text": "It's because nobody actually cares.  It's that simple.  We recognize this and wait until the time is right and handle it when it's the least impactful to the ones we love.  \n\nYou realized they'll be better off without me, whether they admit it or not.",
            "title_similarity": "0.5157624",
            "sentiment_compound": 0.8979
        },
        {
            "id": "gzxxt4v",
            "score": 6,
            "text": "I disclosed my history of depression when applying for disability and life insurance.\n\nI was informed that I no longer access disability insurance in the event that I require time off due to ‘mental ilness’. \n\nFortunately, it doesn’t impact my life insurance in the event of a suicide.\n\nInteresting how that’s structured.",
            "title_similarity": "0.59426427",
            "sentiment_compound": -0.8271
        },
        {
            "id": "gzxysml",
            "score": 1,
            "text": "I know this will be buried and may have been said, but men are more status sensitive and their sexual value depends on that. Socio-economic factors are a huge part of what is entailed in status. It’s a hard world to live in, and women are quite selective.",
            "title_similarity": "0.7074946",
            "sentiment_compound": 0.6652
        },
        {
            "id": "gzxyudx",
            "score": 1,
            "text": "As a young adult male who very often wants to burst into tears every night what's the best way for me to try and get better and improve my mental health? I know therapy is an obvious go to but it's way too expensive for me.",
            "title_similarity": "0.77994674",
            "sentiment_compound": 0.6187
        },
        {
            "id": "gzxz84s",
            "score": 1,
            "text": "Or. Just hear me out. Can be a bit of all of these. Or none. Or just a bit. There isn’t once answer for everyone.",
            "title_similarity": "0.35286656",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzxzbn3",
            "score": 1,
            "text": "My gf of six years is probably going to leave me for another man, my dad died last year and my mom moved across the country.\n\nI'm pretty close.",
            "title_similarity": "0.42683914",
            "sentiment_compound": -0.1531
        },
        {
            "id": "gzxzt16",
            "score": 1,
            "text": "*sorts by controversial*\n\nThis should be good, grabbing some popcorn",
            "title_similarity": "0.22240932",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzxzwsl",
            "score": 1,
            "text": "I always assumed it’s because of social stigma against men who express vulnerability with mental health struggle. Women know, consciously or not, that there is sympathy and support waiting for them after a “cry for help” suicide attempt. Men make the suicide attempt successful because they don’t have the same support system waiting for them if they fail.",
            "title_similarity": "0.81621563",
            "sentiment_compound": -0.7184
        },
        {
            "id": "gzy06mm",
            "score": 1,
            "text": "I got close last year.\n\nDue to a variety of issues, I'm *still* having trouble finding proper help for my situation, and I was first diagnosed back in 2006.\n\nNew Jersey, USA btw",
            "title_similarity": "0.5018839",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy0794",
            "score": 1,
            "text": "To be honest my solution is a bit morbid I contemplate it come up with a solid plan but the key pieces into place and then move on with my day I’ve been doing this every day for over a decade.",
            "title_similarity": "0.48634928",
            "sentiment_compound": 0.4767
        },
        {
            "id": "gzy0bo6",
            "score": 1,
            "text": "One of my best friends committed suicide a few years ago and it still hurts to this day \n\nHe never spoke up and said anything just one day he was gone",
            "title_similarity": "0.67971027",
            "sentiment_compound": 0.2023
        },
        {
            "id": "gzy0u1h",
            "score": 1,
            "text": "I've been seeking and occasionally receiving help for about 20 years.\n\nFor many men (and women), there just IS no help.\n\nSome folks just have no intrinsic value as a human being.\n\nMy self worth is basically just my net worth. \n\nWhich is also pathetically low.",
            "title_similarity": "0.73155",
            "sentiment_compound": -0.6337
        },
        {
            "id": "gzy17o2",
            "score": 1,
            "text": "Is the article paywalled for anybody else or just me? I’d love to read more than just the abstract",
            "title_similarity": "0.5139905",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzy1899",
            "score": 1,
            "text": "I concur with the unwillingness to get help! This is me anyway",
            "title_similarity": "0.28225318",
            "sentiment_compound": 0.4574
        },
        {
            "id": "gzy1aln",
            "score": 1,
            "text": "Humans are clever primates. And excellent predators. If they have decided to kill themselves, they will do it. I once spent 4 hours walking the floor in the wee hours, talking with my therapist bestie bc she was inconsolable- a client who had promised he would not harm himself, and she had performed every possible intervention with, decided to lie to her and his parents to get out of suicide watch....and kill himself anyway. If even HIGHLY trained professionals can be fooled on occasion, how can regular folks? It’s important to remember- you can’t stop them if they decide to hide their plans from everyone.",
            "title_similarity": "0.68131095",
            "sentiment_compound": -0.8201
        },
        {
            "id": "gzy1exz",
            "score": 1,
            "text": "I worked with a gentleman.   We were cargo drivers.  He got a ticket for turning on a red without coming to a  complete stop.  He asked the office to cover it and they told him no.  \n\nI saw him leaving the office piping mad.  Just shaking.   He told me how distressed he was.   I was headed to clock in.  I remember saying something,  but not exactly what.   \n\nI got back to the yard late that evening,  and my daughter was waiting for me at the court agreed exchange point.  \n\nI saw him sitting in his truck.   He didn't acknowledge my wave, but I was in a hurry.   I don't like to distress my child and if I was late for the exchange her father would be annoyed.  \n\nI found out two weeks later that he committed suicide that night.  Our company didn't inform us about the death.   I  remember him muttering-- I quit,  I  quit , I  quit. \n\nAnd I wondered if I could have done anything if I had not been in such a hurry?",
            "title_similarity": "0.6398738",
            "sentiment_compound": -0.9398
        },
        {
            "id": "gzy1ez5",
            "score": 5,
            "text": "Can a mod sticky resources for suicide prevention to the top of this discussion?",
            "title_similarity": "0.5354152",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gzy1jxt",
            "score": 1,
            "text": "Learning how to deal with them in a positive way is better than talking about them. Find you a group and or psychologist might lead to cult like ideas.",
            "title_similarity": "0.38704544",
            "sentiment_compound": 0.8402
        },
        {
            "id": "gzy1ked",
            "score": 1,
            "text": "They are also much more successful.  Seldom do we have a male attempted suicide in the ER.",
            "title_similarity": "0.6737975",
            "sentiment_compound": -0.1045
        },
        {
            "id": "gzy1xdt",
            "score": 1,
            "text": "100% obstacles to healthcare access. I've always considered my depression as a terminal illness with a cure. Either I'll find a way to afford it or I'll find another way out.",
            "title_similarity": "0.6195782",
            "sentiment_compound": -0.8402
        },
        {
            "id": "gzy24hs",
            "score": 1,
            "text": "This is interesting given how frequently I’ve been hearing on the radio advertisements for something called mantherapy dot com. Looks like they’re trying to target this and help make therapy feel more “manly” or less “pansy to talk about your feelings.” Can’t fathom what goes through the mind of an individual whose suicide is imminent. May those who need help get it without judgement.",
            "title_similarity": "0.64693195",
            "sentiment_compound": 0.6249
        },
        {
            "id": "gzy2cdb",
            "score": 1,
            "text": "Someone can only die for suicide once",
            "title_similarity": "0.5265718",
            "sentiment_compound": -0.8555
        },
        {
            "id": "gzy2e5v",
            "score": 1,
            "text": "Depression can be one side effect of low testosterone in men. Here in the UK, good luck trying to get hormone replacement therapy on the NHS though. Your levels have to be super low in the low range to be even considered. Obviously as men age their levels drop and it's just excepted as part of life, get on with it. It can effect many other things that effect quality of life. \n\nBut if you are female and you reach that age ... Or you decide you want to transition to the opposite sex, well you are in luck. Hormone Replacement Therapy Party !!!!!",
            "title_similarity": "0.75542575",
            "sentiment_compound": 0.9156
        },
        {
            "id": "gzy2epp",
            "score": 1,
            "text": "As someone with suicidal thoughts from time to time,\n\nI blame the lack of financial support (psychology paid for by medicare or other insurances) and the stigma that still allows for people to just ignore suffering.\n\nI am fully willing to talk about it **but when you have family who changes the subject or cannot afford a mental health professional, what help do you really have?**",
            "title_similarity": "0.80573213",
            "sentiment_compound": -0.3612
        },
        {
            "id": "gzy2fyu",
            "score": 1,
            "text": "I’m pretty sure it’s much more then that",
            "title_similarity": "0.055869073",
            "sentiment_compound": 0.6705
        },
        {
            "id": "gzy2ksc",
            "score": 1,
            "text": "To seek help when you’re mentally unwell you have to REALLY try to find help, it can be very intimidating and draining to do so.\n\nSometimes when you seek help and it doesn’t turn out the way you want it to, it turns you off on seeking help in the future.\n\nI’ve gone to doctors, I’ve tried seeing a psychologist, tried medication, I’ve tried telling my family and friends how I feel, at the end of the day, everyone has their own problems to deal with. No one can help you but yourself. A lot of the time and for a lot of people it is too difficult to keep going on your own.\n\nI use to think suicide is crazy talk. I still don’t think I would ever do it, but some days it seems like a better alternative than keeping at whatever I’m doing now..",
            "title_similarity": "0.7410488",
            "sentiment_compound": -0.3811
        },
        {
            "id": "gzy2m1g",
            "score": 1,
            "text": "Part of what also I've heard is that men are much more likely to succeed in an attempt. Like men are more likely to use a method that will assure death in a violent way more than women, statistically that is.",
            "title_similarity": "0.7102239",
            "sentiment_compound": -0.1119
        },
        {
            "id": "gzy2np0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09064227"
        },
        {
            "id": "gzy2o57",
            "score": 1,
            "text": "It’s also more common because of method used.",
            "title_similarity": "0.2873299",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzy2vw5",
            "score": 1,
            "text": "r/MaleSupportNetwork\n\nLet’s make this sub more popular fellas",
            "title_similarity": "0.40353304",
            "sentiment_compound": 0.4754
        },
        {
            "id": "gzyn5pa",
            "score": 1,
            "text": "As a guy I think it's a combination of both. Especially having prior problems with doctors a lot of guys are uncomfortable with going to the doctor's in general. I think the biggest problem with articles like this is that it is usually multiple causes that create this overlying problem not just one.",
            "title_similarity": "0.78621614",
            "sentiment_compound": -0.7479
        },
        {
            "id": "gzyuit0",
            "score": 1,
            "text": "Interesting, the thought of suicide hits everyone at some point in their life.\nThe only reason I own a gun is just for a nice speedy exit from a long agonizing terminal illness.\nIm a perfect stable human being, im not affraid of death.\nI believe everyone have the right to end his own life when confronted with the fact of agony. Nowadsys society give all sorts of excuses and studies not to help anyone, just to keep you as a client until your last sip of air you exhale.",
            "title_similarity": "0.7112539",
            "sentiment_compound": -0.682
        },
        {
            "id": "gzyuxxl",
            "score": 1,
            "text": "I'm surprised the conventional view lasted so long, considering it's essentially victim blaming.",
            "title_similarity": "0.5975831",
            "sentiment_compound": -0.5267
        },
        {
            "id": "gzyuy4e",
            "score": 1,
            "text": "I hate how bad my mental health has gotten but I don’t know how to fix it",
            "title_similarity": "0.6624429",
            "sentiment_compound": -0.5574
        },
        {
            "id": "gzyvan1",
            "score": 1,
            "text": "My grandpa went to a family doctor a week before he took his own life. My grandpa had BPD and his depressive episode had been going on for about half a year. He would not get out of bed, talk to anyone or take showers. He would sneak cigarettes when my grandma wasn’t around. His family doctor ignored all his symptoms of depression and put my grandpa on Chantix to help him quit smoking. Which amplified his suicidal thoughts. My grandpa reached out and was fucked in the process.",
            "title_similarity": "0.687753",
            "sentiment_compound": -0.9371
        },
        {
            "id": "gzyvhny",
            "score": 2,
            "text": "Would love to read the whole article.",
            "title_similarity": "0.17212859",
            "sentiment_compound": 0.6369
        },
        {
            "id": "gzyvt94",
            "score": 1,
            "text": "Healthcare is free in my country but my teeth and my mental health don't get included in that package",
            "title_similarity": "0.5082094",
            "sentiment_compound": 0.2846
        },
        {
            "id": "gzyw457",
            "score": 1,
            "text": "also because if men are vulnerable and seek out help they are ridiculed and made fun of and told to man-up. So they avoid opening up that way they aren't made fun of by people.",
            "title_similarity": "0.68669367",
            "sentiment_compound": -0.3778
        },
        {
            "id": "gzyw5rp",
            "score": 1,
            "text": "“Keep a stiff upper lip. Keep calm and carry on.”\n\nUK isn’t known for talking about emotional troubles. I like that this paper is pointing out that talking about a problem isn’t the same thing as fixing the root of it. If society is the cause of death then maybe society needs to be treated as a major factor in people’s suicides. \n\nMedical help and talk therapy doesn’t land a person meaningful work or a stable family life. Education and opportunity bring that.",
            "title_similarity": "0.7266587",
            "sentiment_compound": 0.5859
        },
        {
            "id": "gzyw7rw",
            "score": 1,
            "text": "I wish assisted suicide was a real thing. I've attempted suicide so many times through various means but now, I'm at the point where I think God likes the punchlines of his jokes to still be up and around and my options for doing it are becoming more and more clear. \n\nHopefully, one of these days I get it right",
            "title_similarity": "0.61836",
            "sentiment_compound": 0.9246
        },
        {
            "id": "gzyw8kk",
            "score": 1,
            "text": "“First agriculture, and then industry, changed two fundamental things about the human experience. The accumulation of personal property allowed people to make more and more individualistic choices about their lives, and those choices unavoidably diminished group efforts toward a common good. And as society modernized, people found themselves able to live independently from any communal group. A person living in a modern city or a suburb can, for the first time in history, go through an entire day—or an entire life—mostly encountering complete strangers. They can be surrounded by others and yet feel deeply, dangerously alone. The evidence that this is hard on us is overwhelming. Although happiness is notoriously subjective and difficult to measure, mental illness is not. Numerous cross-cultural studies have shown that modern society—despite its nearly miraculous advances in medicine, science, and technology—is afflicted with some of the highest rates of depression, schizophrenia, poor health, anxiety, and chronic loneliness in human history. As affluence and urbanization rise in a society, rates of depression and suicide tend to go up rather than down. Rather than buffering people from clinical depression, increased wealth in a society seems to foster it.”",
            "title_similarity": "0.67699814",
            "sentiment_compound": -0.9752
        },
        {
            "id": "gzywc8i",
            "score": 1,
            "text": "So it's not unwillingness ... but inability.",
            "title_similarity": "0.031756423",
            "sentiment_compound": -0.5499
        },
        {
            "id": "gzywqyj",
            "score": 1,
            "text": "I always thought that Men are just better at suicide than women who screw it up. Men are more likely to blow their brains out or jump in front of a train or hang themselves than women who on average attempt less successful methods.",
            "title_similarity": "0.813988",
            "sentiment_compound": 0.1298
        },
        {
            "id": "gzywvp3",
            "score": 1,
            "text": "Is this seriously what sociology papers have as their methods? I don't want to be overly critical but I come from a more hard science background and the methods and results of this paper reads like a blog. How the hell is anyone meant to trust the interpretations from this?\n\n\\>Transcripts were read multiple times by myself and a research assistant (Chandler & Nugent, 2016). This process generated a number of themes, some of which were subject to further analysis. Coding, generation and refinement of themes was an iterative process, working between themes, existing research and relevant social theory \n\n&#x200B;\n\nWell, ok? I still have no idea what they actually did.",
            "title_similarity": "0.568456",
            "sentiment_compound": -0.475
        },
        {
            "id": "gzyx0o4",
            "score": 1,
            "text": "I was taught that the statistic is skewed because men tend to commit suicide using a gun while women use pills.\n\nThus, men are more likely to do and there is no doubt that it was suicide whole women are much less likely to die and when they do the cause of death might not be so obvious.",
            "title_similarity": "0.848956",
            "sentiment_compound": -0.9487
        },
        {
            "id": "gzyxp17",
            "score": 2,
            "text": "I have no family doctor and my job is killing me. I work in social services and just got out of my shift I was mandated 48 hours (paid to sleep) I buy this 100% when I went to the emerg about stress they told me “stress is a diagnoses I can’t do anything go to your family doctor” - ok but I don’t have one and there are none taking patients in my area I’ve checked.  it wasn’t until a kid bit me and I had to get a tetanus shot that they listened to me and gave me a week off. I had to get pretty angry to even get a week . I can only imagine someone who’s job stresses them out, family\nLife is on the rocks, car broke down, etc.",
            "title_similarity": "0.6526702",
            "sentiment_compound": -0.9091
        },
        {
            "id": "gzyxrlh",
            "score": 1,
            "text": "There’s also a discrepancy in the way that women and men attempt suicide- women are more likely to survive their attempts because they use methods such as asphyxiation or pill overdose, things that can be fixed with timely medical intervention. Men use different methods, like guns, where it’s less likely to survive an attempt.",
            "title_similarity": "0.8032238",
            "sentiment_compound": -0.4588
        },
        {
            "id": "gzyxsko",
            "score": 1,
            "text": "\"Help is available\" is something healthy people say to manage their own emotional response to encountering someone suffering or in crisis.  It's not a real thing.",
            "title_similarity": "0.43779352",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzyyprm",
            "score": 2,
            "text": "I thiught it had pretty much been established that this was a false premise? Men commit suicide more frequently than women, but men and women *attempt* suicide at roughly the same rates. The difference in outcomes is that men tend towards more violent solutions, like shooting themselves, whereas women tend to choose gentler methods with a lower rate of success, like taking pills.",
            "title_similarity": "0.84289193",
            "sentiment_compound": 0.159
        },
        {
            "id": "gzyyt17",
            "score": 2,
            "text": "More like, talking about it doesn’t help, and neither does sticking people on antidepressants. Men are mostly on their own in this world and that can be both very good & very bad depending on what they have going on. You cannot chalk it up to they’re too stubborn to talk, they need to look into the issues itself and what most of these men had in common. I wonder what percentage recently took huge losses like losing their custody of children or finances in a divorce, or how many were diagnosed with fatal diseases or faced addictions",
            "title_similarity": "0.86318743",
            "sentiment_compound": -0.4228
        },
        {
            "id": "gzyz63z",
            "score": 2,
            "text": "First sentence makes it sound like we are better at it.",
            "title_similarity": "0.17769116",
            "sentiment_compound": 0.6908
        },
        {
            "id": "gzyzgzu",
            "score": 2,
            "text": "Anyone have a link that doesn't need an account? Or wants to charge me $60 for a pdf.",
            "title_similarity": "0.33665168",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzyzxd0",
            "score": 1,
            "text": "This is all for the US. Oftentimes don’t men choose more lethal options than women? Don’t women attempt suicide more than men?",
            "title_similarity": "0.80191004",
            "sentiment_compound": -0.7059
        },
        {
            "id": "gzz05nj",
            "score": 1,
            "text": "Can anyone give a summary of what socio-economic issues they are referring to? the abstract just briefly mentions them in general, which is a shame because the specific causal factors here are both very interesting and very topical.",
            "title_similarity": "0.5565739",
            "sentiment_compound": -0.0276
        },
        {
            "id": "gzz087j",
            "score": 3,
            "text": "How many have children that they have limited contact with or don't live with?",
            "title_similarity": "0.28280488",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzz0adf",
            "score": 1,
            "text": "Isn't that common belief essentially victim blaming?",
            "title_similarity": "0.40973628",
            "sentiment_compound": -0.6486
        },
        {
            "id": "gzz11og",
            "score": 1,
            "text": "UK based male here, when I was 26 I was in a really bad place, and a series of events happened including my parents messy divorce. And then a period of time where my ex (it had been a few months since the breakup by this point) was doing everything she could to break me. And this culminated in a Christmas Eve at midnight mindfuck. Long story short, I could no longer support her through the breakup because she was threatening me, trying to break my will at every opportunity, and I was in the bottom of a pit with no idea what to do.\n\nI contacted the free private mental health support that was available at my workplace, and they made me do an over the phone quiz to see where I was at. By the end of the phonecall, they informed me that I didn't score enough points, and therefore was not sad or unstable enough to qualify for any mental health support.",
            "title_similarity": "0.68002367",
            "sentiment_compound": -0.0482
        },
        {
            "id": "gzz18ls",
            "score": 1,
            "text": "I was always under the impression it was because men tended to choose more violent permanent suicide methods.",
            "title_similarity": "0.7306788",
            "sentiment_compound": -0.8425
        },
        {
            "id": "gzz1isg",
            "score": 1,
            "text": "Women attempt more though, don't they? It seems to me that the answer is very obvious. Men die of suicide more because the traditional masculine man will go for much more gruesome and thus effective methods.",
            "title_similarity": "0.75019157",
            "sentiment_compound": -0.7624
        },
        {
            "id": "gzz1vjf",
            "score": 1,
            "text": "Last time I checked men and women attempted suicide at the same rate but men choose more aggressive methods that were more likely to result in death and women choose methods such as poisoning.",
            "title_similarity": "0.7769813",
            "sentiment_compound": -0.9489
        },
        {
            "id": "gzz22gk",
            "score": 1,
            "text": "Also society has generally looked down on males who are emptionally in touch with themselves. I dont think men are 'unwilling', we are just what we were made to be.",
            "title_similarity": "0.65197825",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzz2n1r",
            "score": 1,
            "text": "Not a man, but when I did reach out for help, there was a very long waiting list. So if you already at your wits end, this makes it harder. And there is just so much they can help you with. A lot of techniques they teach you, don’t really do anything and meditation is touch and go.",
            "title_similarity": "0.64857185",
            "sentiment_compound": 0.8047
        },
        {
            "id": "gzz2q9q",
            "score": 1,
            "text": "***Becoming*** suicidal is blamed on men's unwillingness to seek help and talk about their problems. Once they start thinking about suicide, they look for help, but still have trouble talking about why they're suicidal.\n\nIt's obvious that most people don't want to talk about these issues, because it requires them to admit that biology plays a large role in how people think.",
            "title_similarity": "0.8362579",
            "sentiment_compound": -0.9264
        },
        {
            "id": "gzz2rjo",
            "score": 1,
            "text": "Combining snippets of the article, and taking in to account what some commentors have explained, and some anecdotal experiences, my understanding of all this, in layman's terms would be something like this:\n\nOn average, women tend to experience spikes in depressive attitudes and feelings, generally because something happen*ed* to them. And if it's severe enough to lead to serious suicidal thoughts they take quick and unplanned action, which usually leads to a failed suicide attempt. But because the stress/trauma they experienced is (usually) something that has happen*ed* to them, talking about something in the past that is over and done with is going to be fairly successful in helping them cope with it and move on.\n\nMen on the other hand, tend to experience depression due to things that are currently happen*ing* to them, and as the situation continues they slowly fall deeper in to depression. As a result, they have much more time to think about the problem and ways to get out, which means they when they are leaning towards suicide it is much more planned/thought out and successful, leading to greater suicidal success. This would also explain why just talking about their issues is not as effective as it is for women: it does not solve the problem they are *still currently experiencing*.\n\nDoes that make sense? Is this a plausible theory?",
            "title_similarity": "0.7237264",
            "sentiment_compound": -0.9134
        },
        {
            "id": "gzz2u5y",
            "score": 1,
            "text": "There’s also the stigma others place on “a man who just can’t man up.” \n\nThey talk down to, criticize and even ridicule men who seek therapy. \n\nI know. It’s happened to me. Every single time I sought help. \n\nNow? I don’t seek help. Not like that. \nI pull inward and “go hermit mode” when things get to overwhelming. \n\nIt’s sucks to be sure, but at least I’m classified as an “uncaring and cold asshole at times” and not a “fragile male ego who can’t handle life.”\n\nSo, there’s that.",
            "title_similarity": "0.75310904",
            "sentiment_compound": -0.1913
        },
        {
            "id": "gzz2uv3",
            "score": 1,
            "text": "Unwilling?\n\nWe aren't allowed to talk about our problems and fears, because it isn't \"manly\".",
            "title_similarity": "0.539227",
            "sentiment_compound": -0.6705
        },
        {
            "id": "gzz2vna",
            "score": 1,
            "text": "My personal experience with getting help has been absolute garbage. I asked my parents for help many times, got in trouble with drugs (self medicating), and made it clear how people could help me. If people actually wanted to help me they only ever wanted to help me in ways they wanted to instead of actually listening to me. I was told several times “you don’t need counseling”, now as an adult after finally getting counseling I found out I have ADHD. I spent my whole life not fitting in and feeling stupid, not knowing why. All it took was one appointment to get me diagnosed and now I’m getting the proper help that I truly did need all along.",
            "title_similarity": "0.71653414",
            "sentiment_compound": 0.9337
        },
        {
            "id": "gzz35w0",
            "score": 1,
            "text": "Men are just better at stuff, including suicide. \n\nBut seriously don't men choose more effective methods of suicide.",
            "title_similarity": "0.7986196",
            "sentiment_compound": -0.6716
        },
        {
            "id": "gzz3mpe",
            "score": 1,
            "text": "Men are just better at succeeding at suicide than women .",
            "title_similarity": "0.7042068",
            "sentiment_compound": 0.1531
        },
        {
            "id": "gzz3u09",
            "score": 1,
            "text": "Just from reading the abstract I can tell that the headline for this posts is wildly misleading. \n\nLet’s start off with the fact that men’s inability to talk about their feelings is also a socio-economic issue. The abstract then focuses on “where the talk happens” and doesn’t quite dispute that men’s unwillingness to seek help is at the core of this problem but explains that the issue is more complex and has a few more aspects.",
            "title_similarity": "0.7494318",
            "sentiment_compound": -0.6006
        },
        {
            "id": "gzz3wuw",
            "score": 1,
            "text": "Also men tend to have access to and use more lethal means ie firearms and are less likely to be able to be saved compared to other methods.",
            "title_similarity": "0.7281548",
            "sentiment_compound": 0.4215
        },
        {
            "id": "gzz479a",
            "score": 1,
            "text": "Are these suppose to motivate me to talk to someone? Kinda does the opposite.",
            "title_similarity": "0.2278091",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzz4aiq",
            "score": 1,
            "text": "Also too that men often choose more violent ways to die, such as guns, trains, and jumping, whereas women often choose less violent methods, like pills, and razors.\n\nThe women's methods are more likely able to be discovered and given lifesaving care, rescued.",
            "title_similarity": "0.7207514",
            "sentiment_compound": -0.6666
        },
        {
            "id": "gzz4eqw",
            "score": 1,
            "text": "The \"Man up\" mentality is having huge consequences here. I wish society could finally change and accept men can have feelings too.",
            "title_similarity": "0.65901256",
            "sentiment_compound": 0.765
        },
        {
            "id": "gzz4prp",
            "score": 1,
            "text": "It was way easier for my wife to find free counseling than it was for me. We. Pups t afford it.",
            "title_similarity": "0.53540194",
            "sentiment_compound": 0.7269
        },
        {
            "id": "gzz4u4h",
            "score": 1,
            "text": "It’s a funny phrasing in the headline. I’d guess that people die of suicide 100% of the time ;)",
            "title_similarity": "0.72267604",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzz4u4o",
            "score": 1,
            "text": "Your primate society programs males to view seeking help as weakness, therefore they will never/rarely seek help on any particular subject.\n\n&#x200B;\n\nReap the harvest sown, or change the fuckin' seeds.",
            "title_similarity": "0.5684962",
            "sentiment_compound": 0.3818
        },
        {
            "id": "gzz513r",
            "score": 1,
            "text": "Being a good man has no utility anymore. Having the very evolutionary biology and psychology mean nothing anymore is why blokes kill themselves.",
            "title_similarity": "0.71114695",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gzz541m",
            "score": 1,
            "text": "the conclusion of the paper is based on conversations with 10 people. not exactly a representative number of subjects.\n\ni'm a man, and there is absolutely a taboo against men talking about and seeking help for mental and emotional health issues.",
            "title_similarity": "0.6803027",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzz5auk",
            "score": 1,
            "text": "Men also dont have anywhere near the amount of help, resources or mentors that women do and the more the media and women address this, then we the sexes will be equal.",
            "title_similarity": "0.7034414",
            "sentiment_compound": 0.4019
        },
        {
            "id": "gzz5dt0",
            "score": 1,
            "text": "\"Men need to talk about it\" is classic victim blaming. If a woman is subject to domestic abuse and keeps in that situation, society knows it isn't right to say \"why doesn't she leave that situation\" as its unhelpful. \n\nSociety doesn't really want to fix make suicide.\n\nThere are many structural challenges such as family courts and maintenance systems that make it impossible for someone to move on and build a sustainable life. Then when action is taken to address it, people get surprised and blame them.\n\nThe problem will only get better when people start asking why and start addressing it.",
            "title_similarity": "0.7962574",
            "sentiment_compound": -0.9359
        },
        {
            "id": "gzz5yh0",
            "score": 1,
            "text": "I like the idea of not existing but the pain of dying is too spooky for me",
            "title_similarity": "0.5874044",
            "sentiment_compound": -0.5719
        },
        {
            "id": "gzz5zlw",
            "score": 1,
            "text": "I've seen therapists my whole life (7 or 8 total), I've got a good feel for \"what's wrong\" and what I'd like to work on, and not a single one has given me the time of day regarding my thoughts or even their own. I see someone for months, nothing changes except money leaving the bank account, they don't talk to me while I get to pour out my soul (again) to basically a stranger, and I stop going. Yet, my female friends go to therapy and they're like \"oh yeah, I've been having a great and wonderful experience, we're at 6 weeks and discussing treatment options for my depression\". This paper is just proving what happens and putting it in black and white and it's nice.",
            "title_similarity": "0.5462674",
            "sentiment_compound": 0.93
        },
        {
            "id": "gzz6dk4",
            "score": 1,
            "text": "Then there are men like my father and my wife’s father who think getting help is a joke.\n\nOur dads are narcissistic assholes who are abusive and toxic and terrible people\n\nYet guess what, both my wife’s dad and my dad have attempted suicide \n\nI personally hate my father and have wanted him to die for a long time\n\nAnd men like my father make it more difficult for males to get help because of their stupid close minded attitudes.",
            "title_similarity": "0.82499",
            "sentiment_compound": -0.9628
        },
        {
            "id": "gzz6op7",
            "score": 1,
            "text": "I can't afford therapy.",
            "title_similarity": "0.4836822",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzz6ozp",
            "score": 1,
            "text": "Curious, wouldn’t access to mental health care be just as challenging for women because of the lack of resources and the difficulties in obtaining proper health care in that location? So how does that answer why men are more likely to commit suicide? I feel that there are emotional and mental difficulties at play. Of course I am just speculating! But the access part doesn’t make much sense to me in terms of as an explanation.",
            "title_similarity": "0.8439212",
            "sentiment_compound": 0.4467
        },
        {
            "id": "gzz6rkz",
            "score": 1,
            "text": "Because society views men as expandable and are given less attention than women.",
            "title_similarity": "0.6533328",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzz6roh",
            "score": 1,
            "text": "I was told in undergrad psych that the reason for this was due to the method used. Men tended to try and commit suicide with more \"fool proof\" methods like a gunshot to the head, whereas women tended to use methods such as pill overdoses or slitting their wrists, methods that take longer and leave room for error (pills didn't work, didn't cut deep enough) or for someone to find them in time. I don't know if this is true or not, as I went on to pursue a different specialty, not abnormal psych, but it made sense to me at the time.",
            "title_similarity": "0.78477675",
            "sentiment_compound": -0.4306
        },
        {
            "id": "gzz6t6r",
            "score": 1,
            "text": "I'm in a country with \"good\" healthcare and it took me a year on a waitlist to get proper therapy AFTER i had spoken about suicidal thoughts. The system sucks and is continually overwhelmed because so many people worldwide are losing it. Why? *gestures broadly at everything*",
            "title_similarity": "0.708694",
            "sentiment_compound": -0.7579
        },
        {
            "id": "gzz6v9z",
            "score": 1,
            "text": "All this shows is men have the emotional processing speed of one emotion per month - bringing a slow decline to suicide, while women process emotions at a much faster rate. I really love this constant gender wars on Reddit daily.",
            "title_similarity": "0.68807095",
            "sentiment_compound": -0.4601
        },
        {
            "id": "gzz6y7g",
            "score": 1,
            "text": "Men lack the capacity for hysteria, which is easily cured with a simple battery operated massager. \n\nThats the real issue. No cure for Testeria.",
            "title_similarity": "0.65645933",
            "sentiment_compound": -0.6124
        },
        {
            "id": "gzz6z36",
            "score": 1,
            "text": "I worked in the ER and a lot of men came for attempted suicide. I was told men were more “successful” than women when it came to following through with their ideas. It was scary because these were not your average junkie in the street. It was well established men, with good careers, wife/husband and kids... I went above and beyond to hear them out. Lots of time, they just didn’t have anybody that was willing to listen AND take them seriously..",
            "title_similarity": "0.8599557",
            "sentiment_compound": -0.6597
        },
        {
            "id": "gzz7auh",
            "score": 1,
            "text": "I've never heard of that \"common\" source of blame before and only ever heard the latter, and that's been for like a decade at this point... Has that really been the conventional wisdom on this point?",
            "title_similarity": "0.4845412",
            "sentiment_compound": 0.5423
        },
        {
            "id": "gzz7j7j",
            "score": 1,
            "text": "I wish I can see who they sampled and how many because I'd argue against this theory as we see the same pattern all over the world where the issues are different. Depression works on hopelessness and can be caused by a number of issues but the biggest problem we have with depression is that we dont know how to cure it so many will seek help but it fails them and so with that, they feel it's hopeless and that they'll never get better. Until we can truly understand how depression works and why, these figures will always look bad.",
            "title_similarity": "0.777167",
            "sentiment_compound": -0.9807
        },
        {
            "id": "gzz7kxf",
            "score": 1,
            "text": "Up to the age of 10 boys and girls both suffer the same occurence of sexual abuse.The province I live in has 44 women only centres to help women who were abused as children. There are ZERO such male centric places!!!",
            "title_similarity": "0.6052488",
            "sentiment_compound": -0.7163
        },
        {
            "id": "gzz7unv",
            "score": 1,
            "text": "On top of the comments here already- I live in a country with good healthcare. \n\nI also had depressive episodes already. But going to a therapist stays on your healthcare history- that makes it harder later to switch health insurances without a significant surcharge. It also disqualifies you for quite a lot of roles - law enforcement or being a judge for example. A lot of people working in that field who go to a therapist pay for themselves, which can accumulate a lot, sometimes so much that it’s not even considered and stays untreated. Things like this only lead to people not seeking help.",
            "title_similarity": "0.78374314",
            "sentiment_compound": -0.1469
        },
        {
            "id": "gzz7wan",
            "score": 1,
            "text": "But then why don’t women commit suicide the same amount as men if it was socio-economic issues and lack of healthcare access? That effects everyone.",
            "title_similarity": "0.8546568",
            "sentiment_compound": -0.8126
        },
        {
            "id": "gzz8otp",
            "score": 1,
            "text": "During the pandemic two of my classmates lost their fathers to suicide. They must had felt ashamed and weak about their declining mental health. The stigma around mental health causes many people to commit suicide which really says a lot about how less aware people are about mental health. \n\nI was diagnosed with depression two years ago. The things I heard about depression were really ridiculous. I felt more understood than judged but it still hurts.",
            "title_similarity": "0.84451365",
            "sentiment_compound": -0.9538
        },
        {
            "id": "gzz9cku",
            "score": 1,
            "text": "It’s because men get things done right the first time",
            "title_similarity": "0.2998255",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzza4c8",
            "score": 7,
            "text": "Why would I talk about my deeper problems? The first thing I'm told by every therapist or Healthcare professional at the start of a meeting is something along the lines of \"if we suspect intentions of self harm we will stop the meeting and contact emergency services\". Why would I want to deal with that.",
            "title_similarity": "0.53887427",
            "sentiment_compound": -0.8979
        },
        {
            "id": "gzza4vl",
            "score": 1,
            "text": "Men are both told by society that they have greater responsibility but also told to go suck eggs when they need help by same society.",
            "title_similarity": "0.55881155",
            "sentiment_compound": 0.1154
        },
        {
            "id": "gzzacdt",
            "score": 1,
            "text": "Scottish make here. Went through a really tough time a few years back and was given cbt and told to exercise. I basically self medicated with booze until I felt better. Absolutely no help given at all.",
            "title_similarity": "0.5838134",
            "sentiment_compound": -0.0352
        },
        {
            "id": "gzzakid",
            "score": 2,
            "text": "Thanks for this very interesting post.\n\nI'll add my experience to the discussion.\n\nI work in a reception facility for asylum seekers, our guests are adult males.\n\nMost of them have some kind of past trauma or ongoing trauma.\n\nThey don't talk about it.\n\nWe had a very few - unsuccessful - suicide attempts, they were acting perfectly normal until a couple of hours before trying to commit suicide. \n\nOthers engaged in self-destructive behaviors, mostly drug or alcohol addiction and self-imposed social isolation, for some of them we were able to uncover said behaviors in time, meaning before they completely consumed them, but all of them, including those who have attempted suicide, went out of their way to hide those behaviors and act perfectly normal in the presence of other guests and us members of the staff.\n\nWhat they all have in common is that they don't talk about their problems, they reach out only when they have a \"practical\" problem that know can be swiftly solved - e.g. I need to renew this document, my bed is broken, I need a new closet, this appliance needs to be changed, etc. -; I've discovered that all of those who attempted suicide, and all of those who engage(d) in self-destructive behavior, shared the same problems: I don't have a job, my family back home counts on me and I can't provide for them, I feel I'm a failure as a human being (since I risked my life to get to Europe from my country and now I'm here with nothing), I have no friends, no relationships, women wouldn't even look at me.\n\nI've talked about it with people working in female reception facilities and their reality is much different from ours, women, even though they do it in bursts of rage or hysterical crying, express their problems very clearly, so it's easier for those facilities' staff to act on it.\n\nI feel somehow a connection with the guys that live in the center I work in, I've been deeply unsatisfied with my life for years now, in the past there was a time when I'd given much thought to suicide, I planned it in detail (the place, the time, the methods, the note, a fund for my funeral, my will), but I realized, reading this topic, that something has happened to me, I don't reach for human companionship anymore, I don't feel like being around people, I'm not at ease when I'm around people, I don't care about meeting new people or engaging in activities, I'm involved with some activities, taht, most of the time, I see as a pain in the ass, but it's more like that \"I went with the flow\", other people made me involved with them, I didn't reach out to anyone, and I don't talk about it, I, like those asylum seekers, would ask for help or advice only when I know my problem can be solved, but I've never talked with anyone about the real reasons why I'm not happy with my life, not even my best friend, who, on the contrary, tells me everything about his life and most intimate fears. \n\nWriting this reply, and focusing more about my most inner feelings, I realize that, while I don't necessarily want to die, I'm not afraid of dying, because I feel I don't have much to lose and, like someone else posted in another reply, what makes me unsatisfied with my life is not something that can be easily solved, but it has more to do with general societal problems.\n\nI really don't know if this is some kind of light depression or if I just fail at coming to terms with the fact that my life hasn't been the way I wanted it to be for, at least, a decade, now.\n\nOf course, no one has the faintest idea how I feel, because, like many others, I act in front of everyone.",
            "title_similarity": "0.684638",
            "sentiment_compound": -0.9977
        },
        {
            "id": "gzzam9y",
            "score": 1,
            "text": "In college when we were studying suicide, my professor mentioned that another thing is that men often prefer the 'sure thing' methods of suicide.\n\nI.E death by gunshot, jumping off a bridge, etc.\n\nWhile women go for the less messy ones like asphyxiation or drug overdose.",
            "title_similarity": "0.7315165",
            "sentiment_compound": -0.9113
        },
        {
            "id": "gzzang2",
            "score": 1,
            "text": "I ended up being admitted to hospital after self isolating myself (the police were called). The cause was extreme stress. I basically had a break down. Healthcare professionals treated me like absolute garbage. What I learned from my experience is that there is zero help available for middle age men. None. And no one cares.",
            "title_similarity": "0.71737254",
            "sentiment_compound": 0.2299
        },
        {
            "id": "gzzaxzz",
            "score": 1,
            "text": "Yeah I’m sure the fact no one cares about our feelings is the main route of this issue. I’m sure being the main source of manual labor doesn’t help",
            "title_similarity": "0.50545466",
            "sentiment_compound": 0.5886
        },
        {
            "id": "gzzb9ul",
            "score": 1,
            "text": "My take on it is that (in general, not all) women need someone to listen and help with their emotions. Which is what a therapist can provide. Men are creatures of logic. Therapists are paid to listen and give out canned advice in an efficient manner, we know they don’t truly care, they’re just doing their job. Same with friendly wait staff, they don’t actually like you, they are just doing their job. You can talk till you’re blue in the face, but what men need is help with the situation that made them suicidal to begin with. Whether they lost the only career they know how to do, and legally can’t relocate for something better; whether they got fucked over by the legal system and anything they make gets garnished, things like that and more. Problem is nobody can help you with that unless you got connections with elite folks.\n\nAnd with men being creatures of logic, we do and mean what we say. We don’t self harm and hope someone finds us. We take care of business. It’s not hard to find a surefire method to put yourself out if that’s what you really want. At least it’s one success in a world of failures. Sad that’s how it often ends due to lack of other options.",
            "title_similarity": "0.71335495",
            "sentiment_compound": 0.6242
        },
        {
            "id": "gzzblf0",
            "score": 1,
            "text": "It’s actually a much simpler explanation as to why men commit suicide more than women. And it’s perfectly explained by a man called Winston Churchill. Please read this exchange: \n\nLady Nancy Astor: ‘Winston, if you were my husband, I'd poison your tea.’\n\nChurchill: ‘Nancy, if I were your husband, I'd drink it.’",
            "title_similarity": "0.71420395",
            "sentiment_compound": -0.0772
        },
        {
            "id": "gzzct1t",
            "score": 1,
            "text": "Just wanted to give a third world country perspective.\n\nWe have so many problems in our daily life that the moment a man comes out with mental issues we are labelled weak and unmanly. This labelling is usually done by both other men and women , just that the men tend to be much more vocal whereas the women play it cool but if you observe, you'll clearly see it. It's not that true for women tho whose mental health issues are not looked down upon which is great but theres not much help for them either so it's a net zero and this not labelling of women is because they are considered weaker and more sensitive which is fucked up in its own way.",
            "title_similarity": "0.82524645",
            "sentiment_compound": -0.8033
        },
        {
            "id": "gzzd8oo",
            "score": 1,
            "text": "Terms like “man up” don’t help, we are all raised to not cry and deal with things like men.\nMen dealing with mental health issues are often very isolated, blokes don’t generally talk to each other about it. \nLots out there in dead end jobs with no escape from their personal misery and no one to talk to.\nNo wonder the highest mortality rate in men under 50 is suicide (at least in the uk).",
            "title_similarity": "0.88145816",
            "sentiment_compound": -0.8947
        },
        {
            "id": "gzzh1p0",
            "score": 1,
            "text": "Grandpa killed him self with a gun in the garage with a car running while family was out. Maybe Men are just better at it, he had a backup in case the gun didn’t work and knew he’d be alone for hours.",
            "title_similarity": "0.6699643",
            "sentiment_compound": -0.8126
        },
        {
            "id": "gzziwb3",
            "score": 1,
            "text": "Honestly if I ever have a mental health crisis again I am going to demand to speak to a male therapist. Every time I went for help and had a female therapist I was met with passive aggression and hostility from the very person who was supposed to be safe to open up to. Every. Single. Time.",
            "title_similarity": "0.670243",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzzjddf",
            "score": 1,
            "text": "In Eastern European culture, a man complaining about depression is seen as weakness. Men will hide their depression. Also, generally men are more efficient at suicide due to the brutal methods used. Men will hang or shoot themselves in most cases, while women go to pills or try to cut their veins, which gives a large window of time for a savior to intervene.",
            "title_similarity": "0.8304266",
            "sentiment_compound": -0.9718
        },
        {
            "id": "gzzko0f",
            "score": 1,
            "text": "I feel my dad has been in a steady mental decline for 2 decades now. He had been suicidal before in his 20s. Went through a period of high when his career took off, but he made a career misstep and things went downhill from there. \n\nMy siblings and I have been asking him to seek professional help for years but he sees depression as a sign of weakness, especially since he is a man. He says he can exercise it away, or will it away. He wanted me to try that too when I was diagnosed with depression. I decided to get help instead, and I really wish he would too.",
            "title_similarity": "0.76997143",
            "sentiment_compound": -0.7551
        },
        {
            "id": "gzzktp5",
            "score": 1,
            "text": "but nooooo women are victims here remember?",
            "title_similarity": "0.292683",
            "sentiment_compound": -0.4497
        },
        {
            "id": "gzzou0c",
            "score": 1,
            "text": "Thought it was cuz bullets to the brain are more effective than pills or a sliced wrist.",
            "title_similarity": "0.5114329",
            "sentiment_compound": 0.5256
        },
        {
            "id": "gzzp1ga",
            "score": 1,
            "text": "This is interesting. I was always told that females are more likely to attempt suicide, but males are more likely to choose a methods that are more “final” (I’m blanking on the term here).",
            "title_similarity": "0.7212753",
            "sentiment_compound": -0.2263
        },
        {
            "id": "gzzw0md",
            "score": 1,
            "text": "Obstacles to healthcare...I mean is this not a bigger issues for everyone but men? Is just the two gender view including everyone or js this just \"mental health for suicide prevention\" is it culture obstacles then for men, or that they are overlooked? \n\nEdit: I have no idea...",
            "title_similarity": "0.8318269",
            "sentiment_compound": -0.9409
        },
        {
            "id": "gzzwro1",
            "score": 2,
            "text": "Recently during a Medicare year Heath check up, answered all the questions on the negative side to be as blatant as possible, trying to seek help. Told by the nurse and then practitioner this checkup was only a formality and if I wanted help to find it else where, that’s not their job",
            "title_similarity": "0.5727345",
            "sentiment_compound": 0.1779
        },
        {
            "id": "gzzxdil",
            "score": 1,
            "text": "I don’t need to read a word of any document to know that in the USA the issue s 100% ACCESS to mental health care, it’s either extremely restricted (as in my health package’s case) or simply WAY beyond the financial means of 90% of the population. Then that’s the ones who can actually accept and are willing to seek advice for their problems.\n\nUnless you have these issues people do NOT realize how massively debilitating it can be.",
            "title_similarity": "0.5728092",
            "sentiment_compound": 0.0534
        },
        {
            "id": "h002rjy",
            "score": 1,
            "text": "Meanwhile, therapists deal with daily no shows from people receiving Medicaid free healthcare. And as long as they keep answering the phone and rescheduling, they can't be removed from the list of other more deserving people who don't waste everyone's time.",
            "title_similarity": "0.55451787",
            "sentiment_compound": 0.5318
        },
        {
            "id": "h005tmi",
            "score": 1,
            "text": "I'm not so sure how the mental health system works in other states,  but what I can say is here in TX the system is a joke. They give jobs to people in training not suited for for the work they're being trained to do. Not only that, but they introduce you to a certain coping mechanism and thats all they repeat . They don't actually listen, instead they offer little to no help and they want to suggest medication.",
            "title_similarity": "0.6530564",
            "sentiment_compound": 0.7652
        },
        {
            "id": "h00djle",
            "score": 2,
            "text": "You wanna decrease male suicide? How about equitable custody of children in divorce hearings? How about putting a stop to wage garnishment / divorce rape? How about an executive order granting due process in rape allegations? How about decreasing the amount of \"haha dads are stupid\" shows and commercials and movies? How about the movie studio has to pay a $10,000 donation to a male-only homeless / abuse victim shelter every time the main male character gets suckerpunched / nads kicked in by the Strong Female Character? Oh wait, you aren't looking for solutions, you're looking for headlines",
            "title_similarity": "0.732357",
            "sentiment_compound": -0.9686
        },
        {
            "id": "h00e6ao",
            "score": 3,
            "text": "Unwillingness to seek help?  I barely have enough time to complete my weekly schedule let alone find time for therapy.  People don't kill themselves, society does.  A nation can't be both productive and mentally healthy at the same time.",
            "title_similarity": "0.7210805",
            "sentiment_compound": 0.7985
        },
        {
            "id": "h00l08b",
            "score": 1,
            "text": "There is no help. I started having all-consuming suicidal thoughts and my wife who is a nurse really didn't want me engaging with anyone medical or therapeutic because she's never seen a good outcome, or I'll just be given drugs which don't fix anything. I'd been leaning out from the train platform with my eyes closed and guessing when to duck back, but one of my train buddies spotted me and had a talk and then COVID hit and I've worked from home pretty much ever since. The one or two days a week I go in, train buddy drives. I did go to the GP in the end as well as accessing a psychologist via my company's Employee Assistance Programme, but he basically made me read Viktor Frankl's \"Man's Search for Meaning,\" and told me to harden up. I'm on a low dose SSRI anti-depressant now and have stopped obsessing about killing myself or constantly critiquing myself in a way that I would never do to another person. But I have zero motivation to do anything. I struggle to get dressed every day. But because I'm not obsessed with my own death anymore, I'm good, right?",
            "title_similarity": "0.7340914",
            "sentiment_compound": -0.9284
        },
        {
            "id": "h00m45c",
            "score": 6,
            "text": "heavily depressed person here: i always felt as if this was the case, lots of people say that due to toxic masculinity men don’t seek help and that’s why we commit suicide so often but i never found that to be the case, whenever i would reach out to friends i’d usually get the response “damn bro” overall not a lot of people cared ( i found someone who does tho) it’s quite sad honestly",
            "title_similarity": "0.859707",
            "sentiment_compound": 0.749
        },
        {
            "id": "h018dqg",
            "score": 1,
            "text": "Isn't not asking for help a socioeconomic issue?",
            "title_similarity": "0.31080967",
            "sentiment_compound": -0.3089
        },
        {
            "id": "h02dgz9",
            "score": 5,
            "text": "Its wild that at face value suicide is blamed on “men’s unwillingness to seek help and talk about their problems” in a day and age where such care and scrutiny is given to ensure we don’t victim blame. It takes a whole study to promote the idea that doesn’t sound quite right...",
            "title_similarity": "0.846147",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h04rrb3",
            "score": 1,
            "text": "You commit suicide and it is YOUR fault!",
            "title_similarity": "0.5658368",
            "sentiment_compound": -0.7424
        },
        {
            "id": "h04yd4w",
            "score": 1,
            "text": "Can someone get the article without it being behind a paywall?",
            "title_similarity": "0.42162135",
            "sentiment_compound": 0.0
        },
        {
            "id": "h086khp",
            "score": 1,
            "text": "Do I have to pay to gain access?",
            "title_similarity": "0.21706033",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0fn46m",
            "score": 1,
            "text": "There’s no point anyways it’s just a cliche because if anybody talks about their problems female or make people just make assumptions about the situation",
            "title_similarity": "0.55543464",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0javrv",
            "score": 1,
            "text": "I think the takeaway from this issue is that it is multifaceted, there is not one reason that men are more likely to die from suicide, rather there are many, just like the issue with ethnicity leading to different health outcomes. I know in New Zealand our mental health system is terrible for acute situations, and I am sure that this is echoed around the world, but don't let that be an excuse not to seek help, because realistically that is the easiest variable that can be changed.",
            "title_similarity": "0.7594788",
            "sentiment_compound": -0.4057
        },
        {
            "id": "h0kxv1x",
            "score": 1,
            "text": "Is this what the Feminists call winning?",
            "title_similarity": "0.19983938",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0n2ype",
            "score": 1,
            "text": "\"unwillingness to seek help and talk about their problems\" we are heavily scrutinized by everyone around us if we do, it \"isnt manly\" to talk about how we feel and to seek help for our problems, there are less organizations for men and more for women, men are disposable and treated as such by western society",
            "title_similarity": "0.7712116",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ogzq5",
            "score": 1,
            "text": "\"and laugh as he attempts to give you what he cannot give himself.\"",
            "title_similarity": "0.29425013",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0xpugl",
            "score": 1,
            "text": "I always thought it was just because women are just bad at following through with it.",
            "title_similarity": "0.60620135",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2i18ta",
            "score": 1,
            "text": "Men generally take more decisive actions (per NCIS training I took)",
            "title_similarity": "0.4694836",
            "sentiment_compound": 0.2944
        },
        {
            "id": "h2yok7l",
            "score": 1,
            "text": "Don't say that. It's men who are the problem! We need to keep the narrative alive!",
            "title_similarity": "0.45628926",
            "sentiment_compound": -0.1739
        },
        {
            "id": "h2zkf91",
            "score": 2,
            "text": "This myth is often annoying regarding women though as we actually really don't talk about our 'real' problems, only the socially acceptable ones.",
            "title_similarity": "0.6305667",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6lu9hx",
            "score": 1,
            "text": "I am not sure people are as willing to listen when a man opens up about his internal sadness.",
            "title_similarity": "0.61255306",
            "sentiment_compound": -0.5943
        },
        {
            "id": "h6vv7gw",
            "score": 1,
            "text": "A huge contribution women do attempt suicide more but men completed because they go to the extremes A lot of guns a lot of hanging Well women tend to go for pills and cutting statistically",
            "title_similarity": "0.7387475",
            "sentiment_compound": -0.0516
        }
    ]
}