{
    "Ban on flavored vaping may have led teens to cigarettes, study suggests. After the ban’s implementation, high school students’ odds of smoking conventional cigarettes doubled in San Francisco’s school district relative to trends in districts without the ban\n": [
        {
            "id": "gzzfnzs",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.4701103",
            "sentiment_compound": 0.7088
        },
        {
            "id": "gzzft32",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "-0.011691518"
        },
        {
            "id": "gzznwoe",
            "score": 19,
            "text": "[removed]",
            "title_similarity": "-0.05619866"
        },
        {
            "id": "h005bpm",
            "score": -3,
            "text": "So ban cigarettes as well and there will be nothing to smoke?",
            "title_similarity": "0.30360502",
            "sentiment_compound": -0.4201
        },
        {
            "id": "gzzov76",
            "score": 21,
            "text": "So odd.  It's almost like teens experiment with things, like it's part of growing up and banning stuff just moves them to other things.  Who could have imagined that?",
            "title_similarity": "0.5748697",
            "sentiment_compound": 0.4242
        },
        {
            "id": "h00ns2c",
            "score": -2,
            "text": "This might not actually be a bad thing. You’d have to look at the rate of cigarettes being used and compare that to how much the flavored vapes were used. While there may be an increase of cigarette use, the general practice of smoking could have gone down as expected.",
            "title_similarity": "0.7351438",
            "sentiment_compound": -0.296
        },
        {
            "id": "gzzg9jh",
            "score": -20,
            "text": "So vaping does get kids addicted...  who would have guessed?",
            "title_similarity": "0.53069085",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzzp5sy",
            "score": 10,
            "text": "Huh it's like you can't solve addiction by making it less appealing or punishing people for having one whoa",
            "title_similarity": "0.36499894",
            "sentiment_compound": -0.346
        },
        {
            "id": "h00b8hy",
            "score": 8,
            "text": "The number of people here whose natural inclination is more regulation rally confuses me. Friends, prohibition still doesn’t work.",
            "title_similarity": "0.43263474",
            "sentiment_compound": 0.5165
        },
        {
            "id": "gzzq0l1",
            "score": -9,
            "text": "I went backwards, and started with vaping because of the flavours, then for some stupid reason switched to cigarettes after seeing a big increase on news reports about how little we know about the dangers of vaping, and noticing an increase in breathing issues.   My justification was \"well, we know what cigarettes do to the body, but we dont know what vaping does long-term\"\n\nIs vaping better or worse than smoking cigarettes?  Do we have enough studies to quantify that?  I think we can agree that both have a negative effect overall, but is it better to vape or smoke?  Banning flavours will definitely push people towards smoking, and at least with vapes you can get the flavours without nicotine.\n\nEdit:  I am needing to quit smoking so I did a quick google search, it seems that the general consensus is that vaping is safer, but not as healthy as not smoking.  Here's an example article I found:  https://academic.oup.com/eurheartj/article/41/28/2612/5875664",
            "title_similarity": "0.7498523",
            "sentiment_compound": 0.7354
        },
        {
            "id": "h00om5f",
            "score": 3,
            "text": "Vaping led to exponential increase in teen nicotine use and banning vapes has led to exponential increase in teen smoking\n\nFor those of you who don't interact with teens on a daily basis this is a fact and has been for the past few years\n\n4/5 teens I know have had vaping addictions or know someone their age who has",
            "title_similarity": "0.80793524",
            "sentiment_compound": 0.5574
        },
        {
            "id": "gzzu44i",
            "score": 6,
            "text": "Its almost like it was done on purpose? When they noticed the new kids aren't getting hooked on cigs. But tell us again how the gov is to be trusted.",
            "title_similarity": "0.5874044",
            "sentiment_compound": 0.6959
        },
        {
            "id": "gzzut55",
            "score": -4,
            "text": "What ban? Seems to me that every town has at least one store with a wall of hundreds of different flavored vapes available to anyone over 21. I am on the east coast. Is this a regional thing? What concerns me about the vape thing is the fact that literally every single brand of vape is made in china.",
            "title_similarity": "0.4642313",
            "sentiment_compound": -0.6072
        },
        {
            "id": "gzzhmg9",
            "score": 301,
            "text": "Soooo.... Why not ban cigarettes?",
            "title_similarity": "0.39228898",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h0085ep",
            "score": 7,
            "text": "No flavored brightly packaged nicotine but flavored booze aimed at late teens is fine.",
            "title_similarity": "0.58078027",
            "sentiment_compound": 0.0116
        },
        {
            "id": "gzzx7pd",
            "score": 12,
            "text": "This doesn’t mean much without numbers. What if the number of minors who vaped was initially much higher than those who smoked, and the ban led to a large reduction in vaping that outweighed the increase in smoking?",
            "title_similarity": "0.7284092",
            "sentiment_compound": -0.25
        },
        {
            "id": "gzzuklr",
            "score": -13,
            "text": "Make the stuff deliberately more deadly, not less, and selective pressure will take care of the rest.",
            "title_similarity": "0.29334286",
            "sentiment_compound": 0.3102
        },
        {
            "id": "gzzzrhm",
            "score": 1,
            "text": "Herr derr derr Whooda thunk it!?",
            "title_similarity": "0.0963254",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzzi1pb",
            "score": -20,
            "text": "[removed]",
            "title_similarity": "-0.056198657"
        },
        {
            "id": "gzzqsh5",
            "score": -15,
            "text": "It's because vaping got them addicted to Nicotine.",
            "title_similarity": "0.54425406",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzzuu47",
            "score": 4,
            "text": "This was part of the plan",
            "title_similarity": "0.0058627576",
            "sentiment_compound": 0.0
        },
        {
            "id": "h006j09",
            "score": 3,
            "text": "Trying to make teenager abstain from something never works out well anyway.",
            "title_similarity": "0.40981102",
            "sentiment_compound": -0.2057
        },
        {
            "id": "h00n1vb",
            "score": 22,
            "text": "It’s almost like prohibition doesn’t work....",
            "title_similarity": "0.29648164",
            "sentiment_compound": 0.2975
        },
        {
            "id": "gzzzvr4",
            "score": 0,
            "text": "6 of 1, half a dozen of the other. Although ciggies are way worse, I think",
            "title_similarity": "0.33536196",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h006b4p",
            "score": -3,
            "text": "It’s still better than year and years of young kids getting hooked on nicotine through malicious marketing. Addiction is addiction and vaping leads to greater degrees of nicotine.\n\nIf you quite cigarettes and are using nicotine through vaping, you haven’t beat your addiction to nicotine. You’ve only reduced the harm of the addiction.",
            "title_similarity": "0.80315304",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h009f6g",
            "score": 0,
            "text": "Social engineering only goes so far. Just keep teaching people the dangers and they’ll decide from there.",
            "title_similarity": "0.3910556",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h00eo7t",
            "score": 0,
            "text": "Kids are stupid. Their parents even stupider.",
            "title_similarity": "0.3749818",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h00exf9",
            "score": 0,
            "text": "Surprise!  You’re addicted to nicotine!",
            "title_similarity": "0.43788344",
            "sentiment_compound": 0.3987
        },
        {
            "id": "h00fk3n",
            "score": 0,
            "text": "throughout my teens i've switched back and forth from vape to cigs for like 5 year. both suck cigs easier to quite cuz u can't smoke inside",
            "title_similarity": "0.6155187",
            "sentiment_compound": 0.34
        },
        {
            "id": "h00hd0k",
            "score": 0,
            "text": "Obviously if they are addicted to nicotine and you ban the source they use they will find an alternative.",
            "title_similarity": "0.53972864",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h00i4zu",
            "score": 0,
            "text": "I wonder if this effect will last. I am willing to bet many of the kids who started smoking cigarettes did so because they were already addicted to nicotine. My younger brothers (low 20s now) all had this happen to them after vaping. But if it weren’t for the cool electronics and flavors I doubt they would have even started smoking. I’m not sure though.",
            "title_similarity": "0.8335674",
            "sentiment_compound": -0.5095
        },
        {
            "id": "h00ruoe",
            "score": 4,
            "text": "How many of those students never would have started smoking if vapes weren’t available to them? That’s the study I’d like to see",
            "title_similarity": "0.7433641",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h00ydxn",
            "score": 0,
            "text": "Yeah, wouldn’t have anything to do with random people dying from vaping a year and a half ago.  That would drive smokers away from vapes and towards cigarettes.",
            "title_similarity": "0.6507908",
            "sentiment_compound": 0.296
        },
        {
            "id": "h01crps",
            "score": 0,
            "text": "Or, to put it another way: Mission Accomplished! Just when Big Tobacco was was losing most of its remaining customers to a COVID-accelerated early grave, inexpensive and “modern” vape pens have successfully addicted another generation!",
            "title_similarity": "0.72920716",
            "sentiment_compound": 0.3578
        },
        {
            "id": "h01d2st",
            "score": 0,
            "text": "Good.  If you’re gonna smoke at least look cool doing it.  \n\nVaping is for people who think smoking is too cool and healthy.\n\nI’m an EMS pilot.  I’ve flown two kids who vaped themselves into pneumonia in the last 5 years.  One of them died.  It’s not safe.  Don’t vape.",
            "title_similarity": "0.65084636",
            "sentiment_compound": 0.4929
        },
        {
            "id": "h01f7x7",
            "score": 0,
            "text": "This is temporary. Cigs and vaping should be banned",
            "title_similarity": "0.2882487",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h01gyxf",
            "score": 0,
            "text": "Hell yes. Smoking is cool af. Kids love retro stuff!",
            "title_similarity": "0.42853984",
            "sentiment_compound": 0.5983
        },
        {
            "id": "h01id7k",
            "score": 0,
            "text": "Fortunately, smoking is viewed as an indicator of low IQ. No sane, intelligent, thinking human being knowingly and willingly inhales something with over 70 known carcinogens in it. No one ever says, \"Look....a smoker!! I bet they're really smart!!\"",
            "title_similarity": "0.5987774",
            "sentiment_compound": -0.7315
        },
        {
            "id": "h01lmj9",
            "score": 0,
            "text": "Lesson .. Let people have freedom we gone do it regardless",
            "title_similarity": "0.1349021",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h01lwba",
            "score": 0,
            "text": "I never understood this tactic. The flavor is not what people with a nicotine addiction are after, it’s the nicotine. Also, why is it assumed that adults don’t like fruit flavored vapes? Utter nonsense imo",
            "title_similarity": "0.5377195",
            "sentiment_compound": -0.1263
        },
        {
            "id": "h01mtlq",
            "score": 0,
            "text": "Honestly analogs are a better alternative because you can just sit inside and chief a vape back to back to back and not notice and all of a sudden your dependence on nicotine is huge.",
            "title_similarity": "0.50541204",
            "sentiment_compound": 0.802
        },
        {
            "id": "h01o4nv",
            "score": 0,
            "text": "Who do you think was behind the ban.... Sometimes democrats are stupid too",
            "title_similarity": "0.3657537",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h01t78k",
            "score": 0,
            "text": "Scientific studies really telling us the obvious these days",
            "title_similarity": "0.23754255",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01zxjr",
            "score": 0,
            "text": "Big tobacco's body count grows by the day. One day they will meet their maker.",
            "title_similarity": "0.53605926",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0204o3",
            "score": 0,
            "text": "Now are we gonna follow the data and reverse it for the betterment of public health or was it just about feelings and control? -.-",
            "title_similarity": "0.34874797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02x80k",
            "score": 0,
            "text": "I feel like people don’t realize how much of an epidemic vapes are in high school/middles school’s",
            "title_similarity": "0.692719",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0314ey",
            "score": 0,
            "text": "Some people are just born to smoke. I doubt vapes led to cigarettes. They capped because they were gearing up for cigarettes.",
            "title_similarity": "0.75056994",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h001mse",
            "score": 18,
            "text": "It’s almost like prohibitions always have unintended negative effects.",
            "title_similarity": "0.32302713",
            "sentiment_compound": -0.3597
        },
        {
            "id": "h0031dj",
            "score": 28,
            "text": "Damn it's almost like the people that paid for the anti-vaping propaganda (big tobacco) actually succeeded.",
            "title_similarity": "0.606194",
            "sentiment_compound": 0.079
        },
        {
            "id": "h005awk",
            "score": 5,
            "text": "It's almost like the tobacco companies knew this would happen when they helped fund all these anti vaping policies.....",
            "title_similarity": "0.57740533",
            "sentiment_compound": -0.024
        },
        {
            "id": "h00aw89",
            "score": 5,
            "text": "We as a society don't understand the first thing about why people do drugs.",
            "title_similarity": "0.38340825",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzzhu4l",
            "score": 54,
            "text": "Wasn't that the point?",
            "title_similarity": "-0.13690239",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzzllcs",
            "score": 175,
            "text": "When will we understand that banning things does not ever work as planned? i.e. Alcohol, Weed, etc",
            "title_similarity": "0.38635212",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00ebvm",
            "score": 1,
            "text": "Almost as if big tobacco wanted it that way...",
            "title_similarity": "0.38016492",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00fdy9",
            "score": 1,
            "text": "Ehh, I don't know if I dislike the stupid vapers who breathe out cheap Chinese oil droplets, from their mildew laced lungs, all over the place with essence of apple pie or cigarette smokers leaving cigarette butts that apparently last thousands of years everywhere.\n\nWe should just go back to pipe tobacco.",
            "title_similarity": "0.6434602",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h00g6k5",
            "score": -1,
            "text": "It's almost as if getting more teens addicted to nicotine worked exactly as predicted",
            "title_similarity": "0.62955165",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00h2e7",
            "score": 1,
            "text": "Scientists really putting in the hard work I see",
            "title_similarity": "0.114264295",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h00hnux",
            "score": 1,
            "text": "Hmm. So taking things away does not solve the deeper mental dilemmas that drive people towards these kinds of habits. I can't understand why people keep thinking that if you try to take something away completely (which you never can), all the problems will be corrected. Forgetting that usually all the \"bad habits\" we mention have roots in something completely irrelevant to the habit. Every human can have the capacity to switch their state of mind, but they are only a product of their environment. Start looking into the psychology of problematic thinking instead of just weak band-aid approaches to fixing problems.",
            "title_similarity": "0.44694817",
            "sentiment_compound": -0.9397
        },
        {
            "id": "h00j85v",
            "score": 1,
            "text": "... because they couldn't get their fix on vape, they smoked regular cigarettes.    Yes, nicotine is addictive as hell, I would know, I'm a former smoker.",
            "title_similarity": "0.6783544",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h00jnxu",
            "score": -1,
            "text": "2.5mg of nicotine per cigarette opposed to 20-50mg vape sticks. Good move.",
            "title_similarity": "0.5905176",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h00k8ah",
            "score": -1,
            "text": "Obviously it will increase the odds of those who smoke vs vape, if you make vaping less attractive.\n\nBUT it also decreases the odds of kids getting involved with either of them in the first place which is a MUCH more important goal.",
            "title_similarity": "0.6747947",
            "sentiment_compound": 0.624
        },
        {
            "id": "h00lqcc",
            "score": 1,
            "text": "It’s almost like the same people own both the cigarette and vape companies, hmm...",
            "title_similarity": "0.45120388",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h00m48l",
            "score": -1,
            "text": "Fully legalize CBD nationwide, then ONLY allow flavorings with CBD vapes.  No high, isn't addictive, much safer, still looks cool... Problem solved.",
            "title_similarity": "0.52039057",
            "sentiment_compound": -0.234
        },
        {
            "id": "h00n5pm",
            "score": -1,
            "text": "So what? Vaping is not a good idea in the first place.\n\nIt's like saying banning guns is bad because people will start to own illegal weapons.",
            "title_similarity": "0.5035546",
            "sentiment_compound": -0.8722
        },
        {
            "id": "h00onlz",
            "score": -1,
            "text": "how are idiots still picking up this habit in 2021",
            "title_similarity": "0.32907563",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00tztl",
            "score": 1,
            "text": "But how much of this is because vaping got them addicted to nicotine to begin with? \n\nThat seems like an important distinction. Banning vaping isn't what's causing teens to smoke, it's because they ALREADY got addicted to nicotine and now need a new way to get their fix",
            "title_similarity": "0.67585623",
            "sentiment_compound": 0.6652
        },
        {
            "id": "h00uiq7",
            "score": 1,
            "text": "It's sad that cigarettes are still legal. They are more addictive than heroin and the health problems they create are a national problem. The only reason they are legal is because the government, who is so concerned about our health, makes 100's of millions in taxes. Unlike  alcohol, a ban would work. If someone wanted to grow their own Tabaco for personal use that should be legal.",
            "title_similarity": "0.6921738",
            "sentiment_compound": -0.8993
        },
        {
            "id": "h00v7dy",
            "score": 1,
            "text": "If you smoke, please try vaping. Over two decade smoker and I quit over night. I don't even vape anymore. Even if you never stop vaping it's better then smoking in so many ways. Everyone is different but give it time and really try a lot of different juices. That's probably the most expensive part of getting into it. I'd recommend Juice Head brand myself.",
            "title_similarity": "0.71817666",
            "sentiment_compound": 0.7426
        },
        {
            "id": "h017wfm",
            "score": 1,
            "text": "What’s with these top comments? They are being so disingenuous acting like the flavouring is somehow improving health. Guys the flavouring is a gateway tool. Yeah, conventional cigarette use will increase *initially*, but the net use of tobacco will *decrease*. \n\nAnd seriously to those people equating a ban on flavouring to a complete ban on cigarettes. Flavoured cigarettes were a thing and probably still are in some areas. They’ve were banned in areas because they act as a gateway. There’s precedent for this and it was part of the overall apparatus that’s been successful in decreasing addiction rates... until the explosion of vaping and vape flavours. \n\nAlso, those flavours are like super unhealthy. The long term science also doesn’t exist, so you can’t compare long term impacts of conventional cigarettes to vaping very nonchalantly, because vaping hasn’t existed long enough to really understand the extent of its impact. \n\nIf you care about reducing net addiction rates then this is a good thing.",
            "title_similarity": "0.695226",
            "sentiment_compound": 0.7865
        },
        {
            "id": "h01kjfg",
            "score": 1,
            "text": "Tobacco doesnt taste bad to someone who is addicted to it.",
            "title_similarity": "0.44612342",
            "sentiment_compound": 0.431
        },
        {
            "id": "h01oz3n",
            "score": 1,
            "text": "So can we just ban cigarettes? I'm currently battling an addiction to nicotine and having cigarettes banned would help my efforts greatly. Raising the price of them just gives the tobacco companies more money and me less money. It would of course cause an outrage but people would get over it eventually\n\nEdit: also by ban I mean ban the sale of cigarettes not criminalize tobacco use just to be clear",
            "title_similarity": "0.71393526",
            "sentiment_compound": -0.9109
        },
        {
            "id": "h01p2zp",
            "score": -1,
            "text": "Anyone with half a brain knew this was going to happen. It was an idiotic move. Old people are so damn stupid, but just stupid is better than a complete orange idiot demagogue that was actively trying to kill his competition. So its progress I guess...",
            "title_similarity": "0.50188285",
            "sentiment_compound": -0.9112
        },
        {
            "id": "h0272o4",
            "score": 1,
            "text": "It seems like folks commenting here forgetting that the food flavoring added to vaping fluids were NOT approved for delivering them to the lungs. There is very strong evidence they lead to the condition so called \"popcorn lungs\".\n\nNow if it is something you think is worth risking or not, is a different question. But there is a very good argument for the ban.",
            "title_similarity": "0.55928665",
            "sentiment_compound": -0.4762
        },
        {
            "id": "h029sm4",
            "score": 1,
            "text": "Why is everyone treating vaping as if it's healthy???",
            "title_similarity": "0.34676075",
            "sentiment_compound": 0.5007
        },
        {
            "id": "h032ijm",
            "score": -1,
            "text": "I mean, I’d rather high schoolers smoke cigarettes than middle schoolers vape, so still a net positive in my opinion.",
            "title_similarity": "0.7347637",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h00fpg0",
            "score": 28,
            "text": "It's funny because a lot of the anti vaping ads being aired are bought and paid for by big tobacco. Remember they can't say their products are healthy but they sure as hell CAN say their competition is unhealthy.",
            "title_similarity": "0.6118578",
            "sentiment_compound": -0.836
        },
        {
            "id": "h00pqj8",
            "score": 25,
            "text": "Data previously showed that flavored vape significantly increased high schoolers' use of tobacco products, which obviously implies that some percentage of users became nicotine dependent because of the original availability of flavored vape. This study doesn't appear to try to control for that, and I see that they remark on a number of other limitations.\n\nThe takeaway *could* be that once the cat is out of the bag with an addictive drug delivery system, you can't take that delivery system away when worse alternatives exist. See also: fentanyl and heroin.",
            "title_similarity": "0.81351537",
            "sentiment_compound": -0.3818
        },
        {
            "id": "gzzvxav",
            "score": 106,
            "text": "Well, yeah. First you give people an option that's much healthier and safer and then it's taken away in the name of \"health and safety\". \n\nWhat do you get? Future life long cigarette enthusiasts. It was a brilliant plan by the government and big tobacco. Pretty shitttttty.",
            "title_similarity": "0.67409015",
            "sentiment_compound": 0.9538
        },
        {
            "id": "gzzl1w8",
            "score": -8,
            "text": "Well they were already hooked on nicotine by the vape, weren't they?",
            "title_similarity": "0.5182117",
            "sentiment_compound": 0.2732
        },
        {
            "id": "gzzg20k",
            "score": 1158,
            "text": "I used to smoke so I'm not against letting people do what they want, even if it's harmful.  But the argument against flavored cigarettes or flavored vapes is just a fallacious argument. \"Won't someone please think of the children?\"  As if adults can't like flavored vapes too.  I tried vaping before I quit altogether and I quite liked the grape offerings. It didn't make me want to smoke more and it didn't contribute or detract from my quitting.",
            "title_similarity": "0.62033427",
            "sentiment_compound": -0.7685
        },
        {
            "id": "h00ctzw",
            "score": 49,
            "text": "It's almost like cigarettes wanted this all along...",
            "title_similarity": "0.43735605",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h00a53z",
            "score": 85,
            "text": "The British NHS have been evaluating vaping for several years. In [their latest bulletin](https://www.gov.uk/government/publications/vaping-in-england-evidence-update-march-2020/vaping-in-england-2020-evidence-update-summary), we can read (my emphasis):\n\n* **vaping regulated nicotine products has a small fraction of the risks of smoking**, but this does not mean it is safe\n* **smokers should be encouraged to try regulated nicotine vaping products** along with smoking cessation medications and behavioural support. This will greatly increase their chances of successfully stopping smoking\n* people who have never smoked should be encouraged not to smoke and not to vape\n* **vapers should be encouraged to use regulated nicotine products only** and stop smoking completely\n\nand once again we have do-gooders that never think about unintended consequences. Sigh.",
            "title_similarity": "0.6884297",
            "sentiment_compound": 0.973
        },
        {
            "id": "h00j1go",
            "score": 9,
            "text": "Wow, it’s almost like <insert vice> is the symptom and not the cause. If you ban one, they’ll go to another cause vaping was not the goal, it’s an option. The real answer is definitely a lot more complicated to discover, and solve.",
            "title_similarity": "0.40881667",
            "sentiment_compound": 0.7102
        },
        {
            "id": "h00mx6b",
            "score": 10,
            "text": "Banning flavored vapes does quite literally nothing. Vaping is better than smoking",
            "title_similarity": "0.53768736",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h0057sv",
            "score": 2,
            "text": "Oh, how the turn tables.",
            "title_similarity": "0.035559252",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00c3zy",
            "score": 2,
            "text": "Yeah guys, the stigma on vaping is something the cigarette lobby started a long time ago.",
            "title_similarity": "0.6106701",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h00gf7w",
            "score": 2,
            "text": "I read the study.  The authors have found a correlation, one happened and then the other happened, between the ban on flavored vaping and the increase of smoking cigarettes doubling. The study just came out recently. It's a start to determine whether or not there is causation, whether the increase in smoking cigarettes is a direct result of the ban on flavored vaping.  I am on my phone so it's not easy to bring more examples from the study and other studies confirming this.  I need to look more into their reasoning, sources, methods, how their summarized the findings, and what ideas they have for future research.  I don't have a photographic memory so I would have to tab back and forth and that's not happening on phone.",
            "title_similarity": "0.80519843",
            "sentiment_compound": -0.7407
        },
        {
            "id": "h00i8mh",
            "score": -2,
            "text": "People as a whole are stupid, so this should be no surprise.  Cigarettes are terrible for well established reasons, and e-cigarettes and vapes can cause EVALI.  It's a no-win situation since they refuse to just not.",
            "title_similarity": "0.4678946",
            "sentiment_compound": -0.8133
        },
        {
            "id": "h00p42m",
            "score": 2,
            "text": "I feel like the whole situation is just sort of dumb and misunderstood. Smoking cigarettes is obviously unhealthy AF, and vaping should’ve only ever been an alternative to those who were already addicted to tobacco/nicotine. Vaping is not safe or healthy either, and teenager who were never going to smoke cigarettes shouldn’t think it’s safe for them to start vaping.",
            "title_similarity": "0.60680366",
            "sentiment_compound": -0.8251
        },
        {
            "id": "h00p58c",
            "score": 2,
            "text": "Such a stupid justification for that law. Good tasting flavors means you are marketing to children. The. Ban all flavored alcohol.",
            "title_similarity": "0.5440164",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h00siw2",
            "score": 2,
            "text": "How about we just change the title to: Vaping causes teens to be so addicted to nicotine that they are twice as likely to smoke cigarettes when unable to buy flavored vaping liquid.",
            "title_similarity": "0.7458228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01iqpl",
            "score": 2,
            "text": "We had basically almost eliminated smoking in a single generation. Almost no one I know smokes and only a few people in high school (I'm 30) smoked anything but pot or an occasional hookah night. We had seriously almost eliminated smoking and then e-cigs became a thing",
            "title_similarity": "0.7182455",
            "sentiment_compound": -0.3619
        },
        {
            "id": "h01zjw1",
            "score": 2,
            "text": "Not that I don't disagree with the ban, but some of these comments are really similar to each other. Beware astroturfing.",
            "title_similarity": "0.36534137",
            "sentiment_compound": -0.1798
        },
        {
            "id": "gzzlgq2",
            "score": 417,
            "text": "Someone needs to send this data to the Canadian government as they are trying to get rid of vape flavors \"because kids\". Meanwhile, I have not had a single cigarette in almost 6 years because of vaping and the flavors are a big help.",
            "title_similarity": "0.6326205",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h00ojo9",
            "score": 3,
            "text": "That tends to happen when you have a bunch of kids consuming an addictive substance and then you ban the way that they consume it. A more useful statistic would be how many kids who vaped switched to cigarettes, and how many kids began doing both after vaping became common.",
            "title_similarity": "0.7976438",
            "sentiment_compound": -0.1045
        },
        {
            "id": "h011vgu",
            "score": 2,
            "text": "Do we have data on the dangers of smoking vs vaping? I was under the impression that the tar and ash is what's bad for you, and that pure nicotine is harmless in safe doses.",
            "title_similarity": "0.563222",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h00ebf1",
            "score": 13,
            "text": "Which was the plan from big tobacco all along.",
            "title_similarity": "0.35650662",
            "sentiment_compound": 0.0
        },
        {
            "id": "gzzxaxy",
            "score": 666,
            "text": "That's exactly what it was intended to do, and why big tobacco ran a full court press against them.",
            "title_similarity": "0.4168861",
            "sentiment_compound": 0.0
        },
        {
            "id": "h019n9l",
            "score": 14,
            "text": "Isn't the rule: not smoking is ideal, but vaping is healthier than traditional flame cigarettes?",
            "title_similarity": "0.59923846",
            "sentiment_compound": -0.2235
        },
        {
            "id": "h00fl6e",
            "score": 4,
            "text": "And the tobacco industry was behind the ban.  Is anyone surprised?",
            "title_similarity": "0.5691162",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h00n1i9",
            "score": 3,
            "text": "The flavour ban was lobbied for by tobacco companies. That was always the plan",
            "title_similarity": "0.5415107",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0076qb",
            "score": 59,
            "text": "When Michigan banned the flavoured vape, all my coworkers switched to regular smoking cause they couldnt bother with tobacco flavored juul or vape.",
            "title_similarity": "0.5604189",
            "sentiment_compound": -0.2415
        },
        {
            "id": "gzzhl88",
            "score": 5,
            "text": "It’ll never be like it was before the 90’s with where you could smoke etc, but that’d be pretty crazy if we went full circle on smoking being a stigma. Glad I got shamed out of the habit.",
            "title_similarity": "0.67204404",
            "sentiment_compound": -0.0657
        },
        {
            "id": "h009xio",
            "score": -5,
            "text": "That's good thing as cigarette is more healthy.",
            "title_similarity": "0.40560013",
            "sentiment_compound": 0.7089
        },
        {
            "id": "h00lb9a",
            "score": 6,
            "text": "Is this surprising to absolutely anyone?",
            "title_similarity": "0.055868875",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h00vssf",
            "score": 78,
            "text": "I stopped smoking for five years using e-cigs. They banned them in Massachusetts and I’ve been back smoking cigarettes for over a year now. People say both are equally bad for you. My lungs tell a very different story. \n\nI’m convinced the bans were indirectly facilitated by cigarette companies, to give them time to break into and regulate the e-cig market.\n\nEdit: the reason I think the cigarette companies helped lobby the ban and new regulations, is because they had the market cornered once the new regulations kicked in and the ban ended. I’m open to other ideas. It seems like corruption and big money influence, which is par for the course in America.",
            "title_similarity": "0.7401753",
            "sentiment_compound": -0.9081
        },
        {
            "id": "h00jdbq",
            "score": 691,
            "text": "Vaping has a 99.5% less cancer risk, and is far less harmful overall. It's really a shame that the vaping freakout happened because if every smoker switched to vaping it would probably be the biggest public health achievement in a long time.\n\nhttps://tobaccocontrol.bmj.com/content/27/1/10.abstract\n\nhttps://journal.chestnet.org/article/S0012-3692(20)30754-6/fulltext",
            "title_similarity": "0.69158435",
            "sentiment_compound": -0.9023
        },
        {
            "id": "h00jp5c",
            "score": 8,
            "text": "History has shown us time and time again that prohibition does not work",
            "title_similarity": "0.29513186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00p2z0",
            "score": 7,
            "text": "This is why these hysterical vape bans are so stupid. They took a product that was objectively less harmful than cigarettes, demonized it using hyperbole and outright lies, and petitioned elected officials to ban it. The result was predictable.",
            "title_similarity": "0.58515066",
            "sentiment_compound": -0.8972
        },
        {
            "id": "h00lm5g",
            "score": 42,
            "text": "Vaping helped me quit cigarettes",
            "title_similarity": "0.6115242",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01ediz",
            "score": 64,
            "text": "Mission accomplished. It's radiant =)",
            "title_similarity": "0.04918439",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h00peb2",
            "score": 10,
            "text": "All the antivaping legislation, lobbying and advertising has been really upsetting to me. I get it, it's not good for you to inhale really any substance into your lungs, but my dad switched to vaping about 10 years ago and I couldn't be happier about it. If you look at the list of chemicals in there vs cigarettes it's undoubtedly a preferable alternative to inhale flavored water vapor with nicotine. \n\nMaybe we should understand that people have been using tobacco products for centuries, and we should appreciate the technological advancements that allow people to do so at a lower risk to their overall health.",
            "title_similarity": "0.7170687",
            "sentiment_compound": -0.769
        },
        {
            "id": "h002i2y",
            "score": 2089,
            "text": "No kidding. You mean to say that Phillip Morris'  fundung of anti-vaping ads wasn't purely out of concern for public health?",
            "title_similarity": "0.44985986",
            "sentiment_compound": -0.0762
        },
        {
            "id": "h00grm0",
            "score": 627,
            "text": "Relative of mine used vaping to transition off a pack-a-day habit. His health dramatically improved, not to mention saving a ton of money. He is now down to zero nicotine, but still vapes due to nervous habit. Flavors were a big reason for him quitting and if they were banned, you bet he would be brewing up his own zero nicotine flavors in his basement.",
            "title_similarity": "0.7037724",
            "sentiment_compound": -0.6808
        },
        {
            "id": "gzzis7i",
            "score": 6872,
            "text": "Just as big tobacco planned.",
            "title_similarity": "0.2817725",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00ernm",
            "score": 889,
            "text": "Wouldn’t it have been a better idea to increase availability of vape flavors without nicotine?",
            "title_similarity": "0.52999353",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h00tdfc",
            "score": 25,
            "text": "Reminds me of the time people were offered money to kill cobras, trying to get rid of them, but instead, it led people to breeding them for money. Then, they stopped the program altogether, so those people let loose all the cobras into the wild, and there were more cobras after the program than before.",
            "title_similarity": "0.55300725",
            "sentiment_compound": -0.7992
        },
        {
            "id": "h01f567",
            "score": 67,
            "text": "[removed]",
            "title_similarity": "-0.05619866"
        },
        {
            "id": "gzzwfd1",
            "score": 10511,
            "text": "[removed]",
            "title_similarity": "-0.05619866"
        },
        {
            "id": "h008a1d",
            "score": 1,
            "text": "Wasn't this the entire idea to begin with",
            "title_similarity": "0.10909218",
            "sentiment_compound": 0.0
        },
        {
            "id": "h009p55",
            "score": 1,
            "text": "When they ban menthol they’ll start making menthol flavored meth and PCP.",
            "title_similarity": "0.51904255",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h00a4nr",
            "score": 1,
            "text": "yes. that was the point.",
            "title_similarity": "-0.13889772",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h00agsx",
            "score": 1,
            "text": "Shocked...  Shocked I say",
            "title_similarity": "-0.037365012",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h00dkw5",
            "score": 1,
            "text": "Just according to keikaku*\n\n*[translator's note: keikaku means \"plan\"]",
            "title_similarity": "0.13371058",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00eg7s",
            "score": 1,
            "text": "It’s not a bug, but a feature!!",
            "title_similarity": "0.04839973",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00f2ay",
            "score": 1,
            "text": "I would not have expected that result, pretty interesting!",
            "title_similarity": "0.27387923",
            "sentiment_compound": 0.7345
        },
        {
            "id": "h00g07d",
            "score": 1,
            "text": "Cobra effect\nhttps://en.wikipedia.org/wiki/Perverse_incentive",
            "title_similarity": "0.18530107",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00h47e",
            "score": 1,
            "text": "I'm sure none of it has anything to do with SFs economy and housing markets, it's an incredibly stressful city to live in thanks to the city and state governments.",
            "title_similarity": "0.31023812",
            "sentiment_compound": 0.1548
        },
        {
            "id": "h00i3tg",
            "score": 1,
            "text": "This is what big tobacco wants",
            "title_similarity": "0.28379935",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00i4po",
            "score": 1,
            "text": "How was the study determined?",
            "title_similarity": "0.05424421",
            "sentiment_compound": 0.34
        },
        {
            "id": "h00j47j",
            "score": 3,
            "text": "I'm okay with flavours just as long as they aren't made by scam artists and put some serious thought into how to make the most benign flavouring (least health damage). Cause I don't really care who smokes a cbd or thc vape, it's a lot healthier then the other methods if done correctly.",
            "title_similarity": "0.48273706",
            "sentiment_compound": 0.0377
        },
        {
            "id": "h00jigw",
            "score": 2,
            "text": "I'm super shocked. Almost as if the ban didn't stop them from smoking at all.",
            "title_similarity": "0.52137506",
            "sentiment_compound": -0.0289
        },
        {
            "id": "h00jvs9",
            "score": 1,
            "text": "Who didn’t see that one coming?",
            "title_similarity": "0.12850173",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00kwer",
            "score": 1,
            "text": "Proof that elimination of a vice is not about availability,  its about educated choices.",
            "title_similarity": "0.32051843",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00l2hd",
            "score": 1,
            "text": "as if that wasn’t the entire point of banning flavored vapes to begin with.",
            "title_similarity": "0.48167142",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00lb7x",
            "score": 1,
            "text": "Shocking. How could we ever have foreseen this?!",
            "title_similarity": "0.094527565",
            "sentiment_compound": -0.4574
        },
        {
            "id": "h00lmrd",
            "score": 5,
            "text": "I mean....yeah....that was the effect. I don’t know why they would have expected anything else..?",
            "title_similarity": "0.25071132",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00m74h",
            "score": 1,
            "text": "Whaaaattt? No, you don't say",
            "title_similarity": "-0.039598342",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00m7av",
            "score": 1,
            "text": "Their odds of being homeless quadrupled given the price of cigarettes is San Francisco",
            "title_similarity": "0.6701253",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00m7qs",
            "score": 1,
            "text": "The good old cigs, oil and weapons industrial triangle always win in the US",
            "title_similarity": "0.4345203",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h00mgv9",
            "score": 1,
            "text": "Who cares. If people want to smoke let them. Everything everyone does will make your life end eventually",
            "title_similarity": "0.45942473",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h00migo",
            "score": 3,
            "text": "Once something enters the market, you’ll never be able to get rid of it. There is no way to prevent something from entering the market either since you don’t know what that thing will be. \n\nIf it’s not an overtly immoral act, the best you can do is regulate it and set industry standards to try to keep that product/service safe. \n\nThat’s what should be done in this situation.",
            "title_similarity": "0.32263783",
            "sentiment_compound": 0.8166
        },
        {
            "id": "h00mkgo",
            "score": 3,
            "text": "almost as if big tobacco funded the anti-flavor campaign",
            "title_similarity": "0.61090535",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00mqii",
            "score": 3,
            "text": "Banning them didn’t make the nicotine addiction suddenly disappear",
            "title_similarity": "0.46574312",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h00n3vb",
            "score": 2,
            "text": "TLDR: kids want to smoke",
            "title_similarity": "0.42523047",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h00n68g",
            "score": 2,
            "text": "I wonder whether the ban on flavored vaping products happened at the same time that people started to question the safety of vaping and that teens were thus switching for reasons other than the flavor ban alone. In some states (for example in Massachusetts) sale of nicotine vaping products was banned entirely for part of 2019. Policies like this, and crackdowns in schools could also have led people addicted to nicotine to switch to tobacco. It is worth noting that even if these changes in perception and other policies occurred in other districts at the same time, those other districts might not have seen as many students switching to tobacco because fewer might have been vaping in the first place, so the difference in differences approach does not necessarily correct for this.",
            "title_similarity": "0.79561937",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h00nbqu",
            "score": 16,
            "text": "Flavor bans were never meant to curb smoking...",
            "title_similarity": "0.40390086",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00nmsg",
            "score": 1,
            "text": "I'm guessing the entire ban and its very successful PR was funded by Philip Morris & Altria Group. I should check my stock portfolio and see if their dividend went up since the ban.",
            "title_similarity": "0.62597835",
            "sentiment_compound": -0.4779
        },
        {
            "id": "h00npjw",
            "score": 1,
            "text": "In this thread: people don’t realize that “big tobacco” and vape companies are one and the same. [Philip Morris ](https://media1.tenor.com/images/ff2e556fd7c91eac11b178070969c228/tenor.gif?itemid=17913970)",
            "title_similarity": "0.5688889",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00nyxk",
            "score": 1,
            "text": "It was the grand plan all along to get kids back to regular cigarettes",
            "title_similarity": "0.5974369",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h00o6n6",
            "score": 9,
            "text": "A question I've never found the answers to: why don't these companies just make flavored vapor, without the nicotine? Did those exist? I've only ever see then with it, and seemingly almost all of the laws limiting vaping ans sales targets it because of the nicotine.",
            "title_similarity": "0.6408929",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00o7eu",
            "score": 2,
            "text": "I personally quit ecigs by switching to cigarettes. 2 years nicotine free this month.",
            "title_similarity": "0.68670815",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h00o8wx",
            "score": 1,
            "text": "Good ole big government at work. Trying to “help” then causing more harm like always",
            "title_similarity": "0.34530205",
            "sentiment_compound": 0.2228
        },
        {
            "id": "h00obmn",
            "score": 1,
            "text": "The Law of Unintended Consequences strikes again.",
            "title_similarity": "0.14808571",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h00ogq2",
            "score": 1,
            "text": "Just authorize all insurance companies to drop anyone who smokes or does illegal drugs.  That will fix it.",
            "title_similarity": "0.5012121",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h00oimx",
            "score": 1,
            "text": "Oh wow nicotine is addictive",
            "title_similarity": "0.31968462",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h00oiui",
            "score": 1,
            "text": "Did anybody with half a brain not see this coming? And don't get me started on the ban on menthols. Who could honestly, with a straight face, argue that menthols encourage kids to start smoking. Between vaping and menthols and if I had to make the IT'S TO PROTECT THE KIDS argument my head might pop.",
            "title_similarity": "0.70948076",
            "sentiment_compound": 0.4648
        },
        {
            "id": "h00ojb0",
            "score": 1,
            "text": "That was likely the point..",
            "title_similarity": "-0.08591834",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00ok81",
            "score": 2,
            "text": "Obviously it is not the addictive drug they are worried about.",
            "title_similarity": "0.2698806",
            "sentiment_compound": -0.296
        },
        {
            "id": "h00ol47",
            "score": 2,
            "text": "You don’t say? Hahah how did they not see this coming? It’s not like they were addicted to the flavors, you idiots! They were addicted to the nicotine, but just happened to like the flavor\n\nAlso, it’s not the governments job to ban things. It’s their job to teach the people and let them decide what they want to do",
            "title_similarity": "0.59539616",
            "sentiment_compound": -0.5279
        },
        {
            "id": "h00ov5d",
            "score": 1,
            "text": "Wow. The thing everyone who vaped predicted before they even banned a single vape. Amazing. Who could have seen this coming.  A true scooby doo mystery.",
            "title_similarity": "0.45755976",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h00ovum",
            "score": 1,
            "text": "Yes everyone knows prohibition is how you solve things",
            "title_similarity": "0.26814646",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h00owpg",
            "score": 1,
            "text": "And that's exactly what they wanted....",
            "title_similarity": "-0.023043394",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00p900",
            "score": 1,
            "text": "Pretty sure that was the tobacco lobyists' plan.",
            "title_similarity": "0.409343",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h00pghx",
            "score": 1,
            "text": "Didn't Portugal(?) lift the ban on all drugs in their country and cut the usage by half?",
            "title_similarity": "0.613824",
            "sentiment_compound": -0.7236
        },
        {
            "id": "h00pk62",
            "score": 1,
            "text": "I think this was the whole point.",
            "title_similarity": "-0.01956245",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00pldf",
            "score": 1,
            "text": "As a high school student. Literally everyone is vaping. It’s sad.",
            "title_similarity": "0.45809647",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h00pmey",
            "score": 1,
            "text": "If kids want to smoke, they're going to smoke. No amount of ads or policies trying to make it less \"attractive\" is going to change it.\n\nWho cares? Smoking had been on the decline for decades now. Overall the numbers having been trending downward.\n\nSo what if some kids continue to use tobacco products?",
            "title_similarity": "0.7946898",
            "sentiment_compound": 0.6208
        },
        {
            "id": "h00pmid",
            "score": 1,
            "text": "Luckily they included a ban on mail delivery of vape products in the last stimulus bill. \nSo glad they’re looking out for us/s",
            "title_similarity": "0.52686363",
            "sentiment_compound": 0.5524
        },
        {
            "id": "h00puvc",
            "score": 1,
            "text": "And Oakland banned menthol cigarettes. I don’t smoke, but I support other people’s rights to. Seems ridiculous to me that consumers can’t make their own choices. Everyone shits on smokers. It’s the last demographic you can openly discriminate against",
            "title_similarity": "0.6269492",
            "sentiment_compound": -0.705
        },
        {
            "id": "h00pvig",
            "score": 1,
            "text": "“IF ITS NOT GOING TO BE DELICIOUS, IM GOING TO MAKE IT DISGUSTING”",
            "title_similarity": "0.24547203",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h00pvs4",
            "score": 3,
            "text": "The fact that people thought this would be effective is mind boggling to me.Harm reduction works for all age groups, not just adults. By making flavorings illegal, you're just pushing more people onto traditional tobacco products which have far worse long-term outcomes. It's especially grating to see folks make a false equivalency between smoking and vaping when considering that a good portion of vaping companies that aren't tied to Big Tobacco often source their nicotine from non-tobacco sources such as tomatoes. There are always risk factors when using inhalants of any type, but if the risk register for one method is much smaller than the other, we should be promoting the less harmful option.",
            "title_similarity": "0.6714737",
            "sentiment_compound": -0.1646
        },
        {
            "id": "h00qfzw",
            "score": 1,
            "text": "the lesson here is that kids are dumb idiots and are going to finding something to inhale, so let’s find the least worst solution.",
            "title_similarity": "0.44376528",
            "sentiment_compound": 0.3169
        },
        {
            "id": "h00qhaw",
            "score": 1,
            "text": "Wait prohibition STILL doesn't work!?",
            "title_similarity": "0.1529926",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00qles",
            "score": 1,
            "text": "So... Mission accomplished?",
            "title_similarity": "-0.07253827",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h00qqtc",
            "score": 1,
            "text": "Yea because BIG tobacco are the ones lobbying against vapes, and turning teens to cigs instead.",
            "title_similarity": "0.6956778",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h00qt78",
            "score": 1,
            "text": "I thought this would happen from the beginning. If people (including teenagers) want to get intoxicated on something (drugs, alcohol, tobacco, etc.), they’re going to do it regardless of restrictions.",
            "title_similarity": "0.5715966",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h00qupv",
            "score": 1,
            "text": "why is vaping banned before smoking is?...",
            "title_similarity": "0.50321454",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h00r90s",
            "score": 1,
            "text": "Isn’t the devil you know better than the devil you don’t?\n\nAt least we have studies documenting exactly how bad cigarettes are for your health, so a kid is making an informed decision when deciding to smoke cigarettes.  All the uninformed hype around vaping really freaks me out",
            "title_similarity": "0.6637209",
            "sentiment_compound": -0.902
        },
        {
            "id": "h00rg0d",
            "score": 1,
            "text": "Most non-smoking/non-vaping americans: Who can have ever seen this coming?\n\n&#x200B;\n\nEveryone else: We did. We all did.\n\n&#x200B;\n\nFunny enough. No one called this cancel culture.",
            "title_similarity": "0.48868012",
            "sentiment_compound": -0.1406
        },
        {
            "id": "h00rim1",
            "score": 1,
            "text": "Yeah.... because they were already addicted to nicotine and still needed a fix. This is why flavored, addictive products should have been banned to begin with.",
            "title_similarity": "0.5592304",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h00rk1u",
            "score": 1,
            "text": "It’s almost as if banning things almost always has negative unintended consequences",
            "title_similarity": "0.2568376",
            "sentiment_compound": -0.5325
        },
        {
            "id": "h00rril",
            "score": 1,
            "text": "Of course, that was *literally* the reason they did it.",
            "title_similarity": "0.06032316",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00ru2w",
            "score": 1,
            "text": "N o f u c k I n g s h i t.",
            "title_similarity": "0.0744089",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00rxbz",
            "score": 1,
            "text": "Is this really surprising to anyone?",
            "title_similarity": "0.038475245",
            "sentiment_compound": 0.3384
        },
        {
            "id": "h00s0y2",
            "score": 4,
            "text": "My biggest criticism is vaping 0% nicotine is somehow still considered a tobacco product and regulated as such.",
            "title_similarity": "0.5614617",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h00s8iv",
            "score": 1,
            "text": "So they're stupid either way? Gotcha.",
            "title_similarity": "0.15248694",
            "sentiment_compound": -0.5688
        },
        {
            "id": "h00spz9",
            "score": 1,
            "text": "This was the intention all along",
            "title_similarity": "-0.048503496",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00t0nt",
            "score": 1,
            "text": "Let them learn the hard way",
            "title_similarity": "0.09053339",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h00t15i",
            "score": 1,
            "text": "Cigarette ceos - mission accomplished.",
            "title_similarity": "0.40172148",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h00t2gk",
            "score": 1,
            "text": "Big tobacco tried to ban vaping all together many many years back, do I even need to finish the rest of my post, no, the rest is obvious",
            "title_similarity": "0.6348319",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h00t94n",
            "score": 1,
            "text": "All according to keikaku",
            "title_similarity": "-0.021245256",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00tahn",
            "score": 1,
            "text": "Screw our government, they are the most illogical incompetent thing I swear, this is like the logical thing to happen, what will happen when they ban cigarettes, I don’t even want to find out",
            "title_similarity": "0.45248422",
            "sentiment_compound": -0.6983
        },
        {
            "id": "h00theh",
            "score": 1,
            "text": "Makes sense.  If it doesn’t taste good, I’m going to switch to the one that looks cooler.",
            "title_similarity": "0.3623637",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h00tj3b",
            "score": 1,
            "text": "I’m 45 and dammit I miss my mango and cucumber Juul! But now I don’t  use any nicotine so probs better for me.",
            "title_similarity": "0.4775661",
            "sentiment_compound": 0.6439
        },
        {
            "id": "h00tkau",
            "score": 1,
            "text": "Wow, it's almost like the laws were lobbied by tobacco companies to do just that. Who woulda thunk.",
            "title_similarity": "0.60824263",
            "sentiment_compound": 0.719
        },
        {
            "id": "h00tlhp",
            "score": 1,
            "text": "Big Tobacco playing the long con.",
            "title_similarity": "0.35591775",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h00tn6f",
            "score": 1,
            "text": "Teenagers are going to do the thing you don’t want them to do. Forever.",
            "title_similarity": "0.42201072",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h00to9y",
            "score": 2,
            "text": "Probably engineered it to happen, certain politicians were pushing it too hard.",
            "title_similarity": "0.33188483",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h00tqd4",
            "score": 1,
            "text": "This was entirely predictable",
            "title_similarity": "-0.00029022433",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00tzqa",
            "score": 1,
            "text": "Once you're addicted to nicotine from smoking flavored vape juice, taking away flavored vapes doesn't fix it.  Look at heroin and fentanyl.",
            "title_similarity": "0.5832186",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h00u2on",
            "score": 1,
            "text": "Honestly true and helped me get off nicotine ultimately",
            "title_similarity": "0.38865924",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h00u2qr",
            "score": 1,
            "text": "Banning flavored vapes is akin to banning flavored liquor. If I, as an adult, want to choose to consume a flavored product that has negative health consequences, I should be able to. Those products aren't for kids; adults like them too. I hate these kinds of laws so much...",
            "title_similarity": "0.5409083",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h00ul4m",
            "score": 2,
            "text": "Banning stuff doesn't work? 1920s government would like to have a chat :)",
            "title_similarity": "0.41986516",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h00uvdp",
            "score": 1,
            "text": "Vaping is LESS harmful than smoking cigarettes",
            "title_similarity": "0.47189835",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00v6qj",
            "score": 1,
            "text": "At least cigarettes are cool.",
            "title_similarity": "0.3364637",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h00v9ug",
            "score": 1,
            "text": "So the 5 year plan worked as designed.",
            "title_similarity": "0.20753412",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00vc8a",
            "score": 1,
            "text": "We’ve now come full circle",
            "title_similarity": "0.03854551",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00ve37",
            "score": 1,
            "text": "I love how they ban flavors for vaping yet we can go to the liquor store and buy cotton candy flavored vodka...",
            "title_similarity": "0.52605575",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h00vucy",
            "score": 1,
            "text": "Only fair to ban flavored cigarettes too.",
            "title_similarity": "0.5105724",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h00vvbv",
            "score": 1,
            "text": "Is smoking weed (joints, blunts, dabs) as detrimental to your lungs as say a traditional cigarette?",
            "title_similarity": "0.54347557",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00vze2",
            "score": 1,
            "text": "This was the plan all along. Most of the anti-vaping stuff is paid for by big tabaccy.",
            "title_similarity": "0.37394333",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00waf3",
            "score": 1,
            "text": "What did you think was going to happen...?",
            "title_similarity": "0.012606904",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00wdtx",
            "score": 1,
            "text": "Who didn’t see that coming?",
            "title_similarity": "0.0860253",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00wgib",
            "score": 5,
            "text": "The vaping ban shows how deeply out of touch, or uninterested politicians are with this issue. The thing that caused the whole panic about “vaping disease” was vitamin E acetate in THC cartridges. Nothing to do with nicotine. So OBVIOUSLY the solution they came up with was to ban flavors in nicotine?\n\nDo you know what the only flavor of vape juice you can buy is in NY now? Tobacco. \n\nWe have no power, and the people who do don’t care. Enjoy the cigarettes kids.",
            "title_similarity": "0.65106237",
            "sentiment_compound": -0.4397
        },
        {
            "id": "h00wika",
            "score": 1,
            "text": "Eventually we'll ban enough things that everyone will be happy and healthy.",
            "title_similarity": "0.4098298",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h00wmo2",
            "score": 1,
            "text": "The tobacco industry really ran up and robbed the whole e-cig industry.",
            "title_similarity": "0.49607903",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00wmyc",
            "score": 1,
            "text": "Flavored vaping got me to quit smoking and I quit vaping six weeks after switching because I had a plan to ween off nicotine and finally the habit as a whole. It was super difficult but it was also the easiest and fastest way to quit smoking for me. I've been clean for 3 years, no vaping no cigarettes and I have flavored vapes to thank for it. Dumbest thing ever to ban this stuff when cigarettes still exist.",
            "title_similarity": "0.6928513",
            "sentiment_compound": 0.0982
        },
        {
            "id": "h00ws9k",
            "score": 1,
            "text": "There were two purposes to vaping. 1.) to get around antismoker laws and, 2.) to provide a much safer alternative to cigarettes. \n\nThe antismoker crowd couldn’t stand for either, so they got vaping bans enacted, which makes zero sense if you accept at face value their reasons for smoking bans, and then they tried mightily to prove that vaping is bad for you. \n\nThe truth is, the real motivation for all of this is moral, and has nothing to do with health or safety. Else they would’ve welcomed vaping. Well, they did, when only pharmaceutical companies were making it.",
            "title_similarity": "0.6174826",
            "sentiment_compound": 0.9231
        },
        {
            "id": "h00wyvf",
            "score": 1,
            "text": "How do you get paid to do studies like these... \nWhat a shocker",
            "title_similarity": "0.19342303",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h00x18c",
            "score": 1,
            "text": "Hmmm... it’s almost as if you put a limit on something, or if it has some psychotropic effect... people will find a way to get it anyway. Huh. Guess that’s human nature. \n\nNot downplaying the nicotine addiction thing at all but I just look at this through a wider lense I guess.",
            "title_similarity": "0.5132233",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00x1ok",
            "score": 1,
            "text": "Is anyone surprised big tobacco lobbied to make people smoke again?",
            "title_similarity": "0.67286575",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h00xgc4",
            "score": 1,
            "text": "So exactly what was meant to happen, happened",
            "title_similarity": "-0.05694743",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00xmut",
            "score": 1,
            "text": "Kids get addicted to vaping and then start smoking after the vaping is taken away?  Doesn't seem like a pro-vape argument to me.",
            "title_similarity": "0.70575714",
            "sentiment_compound": -0.5588
        },
        {
            "id": "h00xrtx",
            "score": 1,
            "text": "Better get rid of flavored alcohol while we are at it. Get them minors back on moonshine.",
            "title_similarity": "0.45364982",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h00xx0j",
            "score": 1,
            "text": "Good old tabaco business won again",
            "title_similarity": "0.31994063",
            "sentiment_compound": 0.765
        },
        {
            "id": "h00xx7z",
            "score": 1,
            "text": "Guess who lobbied for the ban?",
            "title_similarity": "0.29210958",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h00xzry",
            "score": 1,
            "text": "Politicians always create the problems they worry about.",
            "title_similarity": "0.23474076",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h00yjvm",
            "score": 1,
            "text": "WHOA! You mean human teens reacted the same way human adults would, almost as if they were the same species? How could we have known? 🙄🙄🙄",
            "title_similarity": "0.49968544",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00yli3",
            "score": 1,
            "text": "they have a niccotine addiction, cigs and vapes are interchangable",
            "title_similarity": "0.36945868",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00ymiq",
            "score": 1,
            "text": "I worked at a gas station for a few months last year, a lot of high school kids are trying to switch to dip/cigarettes, it's kinda sad tbh",
            "title_similarity": "0.73467714",
            "sentiment_compound": -0.4228
        },
        {
            "id": "h00yncb",
            "score": 1,
            "text": "Maybe just bring in much harsher fines for selling tobacco products to the underaged?",
            "title_similarity": "0.5855987",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h00yqvw",
            "score": 1,
            "text": "All according to big tobaccos plan....",
            "title_similarity": "0.31281513",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00ys00",
            "score": 1,
            "text": "It's comical how much this reads like a parody. \n\nGet them addicted to nicotine with what amounts to cheap candy, then yank the rug out from beneath them and leave expensive cigarettes as their only alternative.",
            "title_similarity": "0.5988801",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h00ytyy",
            "score": 1,
            "text": "The ban had no logic behind it to begin with.",
            "title_similarity": "0.16022125",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h00yw0p",
            "score": 1,
            "text": "Thing is that before the introduction of flavored vapes, the amount of teen smokers was at an all-time low. \n\nThe headline here is quite misleading",
            "title_similarity": "0.6798761",
            "sentiment_compound": -0.624
        },
        {
            "id": "h00ywof",
            "score": 1,
            "text": "Vaping was always going to lead to cigarettes, let’s be real.",
            "title_similarity": "0.5360116",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00z7hy",
            "score": 1,
            "text": "There are two hard truths that neither side of this debate wants to admit...\n\n1) The flavors and products in modern vaping *are* appealing to kids, and even adults get an extra hit of dopamine in anticipation of trying a new flavor, or picking up their favorite one. This is an extra reward pathway; one that wouldn't exist if there was just one flavor.\n\n2) Vaping is better than smoking, if you have to choose between the two. If a 14-year-old kid desires nicotine, it's better that he gets it from vaping than from cigarettes.\n\nBoth of these truths have to be taken into consideration. Will the flavors turn kids on, who never would have started vaping or smoking? Would the ease of choosing vaping over smoking lead to a reduction in cancer and death rates, when those kids are older?\n\nWe need groups that'll consider the totality of the situation, instead of the lobbyists we have now.",
            "title_similarity": "0.711889",
            "sentiment_compound": 0.9092
        },
        {
            "id": "h00z851",
            "score": 1,
            "text": "did altria sponsor this article",
            "title_similarity": "0.17831455",
            "sentiment_compound": 0.0
        },
        {
            "id": "h00zb9i",
            "score": 1,
            "text": "Now ban fast food chains in America. They're clearly worse than vaping health wise. That would be fun to watch.",
            "title_similarity": "0.48567152",
            "sentiment_compound": 0.34
        },
        {
            "id": "h00zbcy",
            "score": 1,
            "text": "Just ban all vapes and cigarettes. Then we can watch the world slowly descend into chaos as probably half the population go into withdrawal.",
            "title_similarity": "0.5228634",
            "sentiment_compound": -0.802
        },
        {
            "id": "h00zec6",
            "score": 1,
            "text": "Ultimately the ban on flavor vapes got me to quit nicotine altogether. Sad to see its not the same for everyone",
            "title_similarity": "0.53378046",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h00zq6q",
            "score": 1,
            "text": "Yeah of course it did. That was their plan right?",
            "title_similarity": "0.062974736",
            "sentiment_compound": 0.296
        },
        {
            "id": "h00zqr1",
            "score": 1,
            "text": "I wonder who funded the study. Altria makes so much more money on vapes than they do on tobacco.",
            "title_similarity": "0.602052",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01005y",
            "score": 1,
            "text": "The joys of unintended consequences!",
            "title_similarity": "0.078547254",
            "sentiment_compound": 0.5411
        },
        {
            "id": "h0104rz",
            "score": 1,
            "text": "People don’t vape because it’s healthier. The same reasons why people who use some drugs use others more than people who just use one or some. The people who “picked up smoking” we’re going to vape and smoke anyway. No foul done except Tobacco companies making more profits. As long as world wide smoking is on the down that’s good, as that’s the only thing that matters",
            "title_similarity": "0.6936446",
            "sentiment_compound": 0.6115
        },
        {
            "id": "h0105sd",
            "score": 1,
            "text": "I’m pretty sure the UK has been fairly successful at using vapes to reduce smoking and also keep kids off of it. They limited the amount of tobacco a vape could have per mg and prohibit ads aimed at kids. \n\nNo need to ban anything. You regulate the product and make it easy to get the limited version and that’s what most people will get. Sure, some will still go to illicit sources but that’s always the case. Keep the most people safe. \n\nAnd reduced nicotine amounts make it easier for people to quit vaping if they decide to.",
            "title_similarity": "0.6812166",
            "sentiment_compound": 0.8983
        },
        {
            "id": "h010e7b",
            "score": 1,
            "text": "I can't smoke my blue raspberry cotton candy birthday cake vape anymore?\n\nGuess I'll switch to this burnt hobo flavored cancer stick instead",
            "title_similarity": "0.60016155",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h010f5y",
            "score": 1,
            "text": "Who woulda fuckin thunk...",
            "title_similarity": "0.058545828",
            "sentiment_compound": 0.0
        },
        {
            "id": "h010g4r",
            "score": 1,
            "text": "The question is, who paid for this study?",
            "title_similarity": "0.19826208",
            "sentiment_compound": 0.0
        },
        {
            "id": "h010gv6",
            "score": 1,
            "text": "This study is crap all of these kids were vaping before. It didn’t increase new nicotine usage the kids just switch from vaping to smoking cigarettes.",
            "title_similarity": "0.7570094",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h010r17",
            "score": 1,
            "text": "It’s working exactly as the big tobacco companies wanted when they lobbied everything to hell and and back to get vaping “legislated”. Absolutely deplorable and an awful, but true representation of our government.",
            "title_similarity": "0.54209656",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h010xk0",
            "score": 1,
            "text": "I'll take \"Predictable Results\" for $800.",
            "title_similarity": "0.25026217",
            "sentiment_compound": 0.0
        },
        {
            "id": "h010z8y",
            "score": 1,
            "text": "this is what big tobacco wanted all along",
            "title_similarity": "0.3056132",
            "sentiment_compound": 0.0
        },
        {
            "id": "h011fkm",
            "score": 1,
            "text": "Ah, big tobaccos exact goal was accomplished.",
            "title_similarity": "0.27075052",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h011gjn",
            "score": 1,
            "text": "No nicotine addiction led them to cigarettes.",
            "title_similarity": "0.49994564",
            "sentiment_compound": -0.296
        },
        {
            "id": "h011ig1",
            "score": 1,
            "text": "That was the tobacco industry's goal in the first place by lobbying for the bans, wasn't it?",
            "title_similarity": "0.5860463",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h011klf",
            "score": 1,
            "text": "Yeah, the flavor is nice but it's the NICOTINE they want. Whatever is the healthiest version of that we need to embrace or just ban it altogether.",
            "title_similarity": "0.44953743",
            "sentiment_compound": 0.0
        },
        {
            "id": "h011lfj",
            "score": 1,
            "text": "This is true for me personally",
            "title_similarity": "-0.043550238",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h011nod",
            "score": 1,
            "text": "I don't understand why adults are not allowed to enjoy a product meant for adults, but flavored.\n\nI want to vape a blueberry flavor but since a kid might do it, banned? It makes no sense.",
            "title_similarity": "0.5573154",
            "sentiment_compound": -0.8
        },
        {
            "id": "h011of8",
            "score": 1,
            "text": "I'm not sure I understand. Cigarettes are also banned for school age kids.",
            "title_similarity": "0.65374726",
            "sentiment_compound": -0.6075
        },
        {
            "id": "h011tna",
            "score": 1,
            "text": "Its because by that point they were already addicted to nicotine",
            "title_similarity": "0.5160294",
            "sentiment_compound": 0.0
        },
        {
            "id": "h011wnq",
            "score": 1,
            "text": "So, it was a gateway drug? Next marijuana then fentynul",
            "title_similarity": "0.4385172",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0120gd",
            "score": 1,
            "text": "Kill everyone under the age of 21. Problem solved",
            "title_similarity": "0.37298077",
            "sentiment_compound": -0.743
        },
        {
            "id": "h01232e",
            "score": 1,
            "text": "The evidence that this was going to happen was written all over the walls before they went on their banning rampage of the vaping industry. It was brought up multiple times by the vaping groups lobbying against such bans. The federal and state governments do not care about you or your physical health at all. They care about the money big tobacco has and is willing to throw behind their massive lobbying efforts. Unfortunately, the vaping industry has nowhere near as much financial leverage as big tobacco and big pharma.",
            "title_similarity": "0.5945486",
            "sentiment_compound": -0.3459
        },
        {
            "id": "h0127ez",
            "score": 1,
            "text": "I feel like some reddit-person predicted this.",
            "title_similarity": "0.25699338",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0129h0",
            "score": 1,
            "text": "\"Ban on flavouring in addictive substance does nothing\", cites report.  Further, report fails to mention, \"link between addictive substance [and] addiction.\"  Hurk...",
            "title_similarity": "0.40507782",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h012aqp",
            "score": 1,
            "text": "Imagine just banning cigs too because they couldn't be any closer to actual poison",
            "title_similarity": "0.44417986",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h012dc0",
            "score": 1,
            "text": "The prohibition of any substance always backfires. One would think people would learn by now after over 100 years of attempting to control what people put in their bodies or do to their bodies.",
            "title_similarity": "0.59311116",
            "sentiment_compound": 0.0
        },
        {
            "id": "h012i6t",
            "score": 1,
            "text": "Snort the god powder instead",
            "title_similarity": "0.3377989",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h012j2y",
            "score": 1,
            "text": "When are we going to learn that banning things makes it stronger?",
            "title_similarity": "0.3724926",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h012naw",
            "score": 1,
            "text": "That’s called a bait n switch",
            "title_similarity": "0.09329951",
            "sentiment_compound": 0.0
        },
        {
            "id": "h012oz1",
            "score": 2,
            "text": "I mean. Cigarettes taste way better than a tobacco flavored vape and there's always gonna be people who want to start destroying their lungs at a young age. I'm surprised they didn't see that one coming",
            "title_similarity": "0.7500191",
            "sentiment_compound": 0.128
        },
        {
            "id": "h012xo1",
            "score": 1,
            "text": "Tobacco lobby: job well done..",
            "title_similarity": "0.39121735",
            "sentiment_compound": 0.296
        },
        {
            "id": "h012zom",
            "score": 1,
            "text": "Sounds like it all went according to plan.",
            "title_similarity": "0.025388844",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h013aby",
            "score": 1,
            "text": "Maybe regulating what can be out into those flavored vaporizer cartridges is the move to go on?",
            "title_similarity": "0.4137863",
            "sentiment_compound": 0.0
        },
        {
            "id": "h013bdf",
            "score": 1,
            "text": "I think this was obvious with a lot of people who were critical of this. Yes you can vape without flavor but the flavor is part of the experience.",
            "title_similarity": "0.4186457",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h013z8k",
            "score": 1,
            "text": "Nic is kinda like a Grunge song.  I’ll always prefer the MTV Unplugged version.",
            "title_similarity": "0.42386928",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h0140to",
            "score": 1,
            "text": "The anti smoking lobby doesn’t want to end smoking, they want to keep smoking alive just enough to justify donations.\n\nThat is the long and short of why they are against vaping. Their newest thing is heavy metal poisoning but they keep saying “may”, “might”, “could”, cause they know they have no science to back it up",
            "title_similarity": "0.568908",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0144ld",
            "score": 1,
            "text": "Conservatives: ban drugs because it's bad for them \nLiberals: get kids to do lower grade drugs so they don't do the bad stuff \n\nMe: how about teaching kids to not do drugs...",
            "title_similarity": "0.5845587",
            "sentiment_compound": -0.7543
        },
        {
            "id": "h0149j9",
            "score": 1,
            "text": "Well yeah thats why they call it big tobacco not big vape.",
            "title_similarity": "0.43523312",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h014bkd",
            "score": 1,
            "text": "So the ban just made things worse? HOW SURPRISING.",
            "title_similarity": "0.23557767",
            "sentiment_compound": -0.6304
        },
        {
            "id": "h014cv5",
            "score": 1,
            "text": "Doesn't this belong in r/KidsAreFuckingStupid",
            "title_similarity": "0.2141329",
            "sentiment_compound": 0.0
        },
        {
            "id": "h014e7s",
            "score": 1,
            "text": "This is surprising to no one",
            "title_similarity": "0.08229418",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h014ew4",
            "score": 1,
            "text": "Of course it did, that was the plan the whole time. A large chunk of the ‘research’ that led to this ban was funded by Phillip Morris themselves. Can’t be having too many people use alternative products to the ones that make them billions.",
            "title_similarity": "0.5677208",
            "sentiment_compound": -0.6428
        },
        {
            "id": "h014ufb",
            "score": 1,
            "text": "Good, the worst part about vape is the ability to hide it.",
            "title_similarity": "0.17191046",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h014ylq",
            "score": 1,
            "text": "They should have just removed the nicotine. It's a lot easier to quit doing something when you aren't addicted to it.",
            "title_similarity": "0.52975667",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h015kf5",
            "score": 1,
            "text": "So ban Cigs, oh wait.. states care more about tax money",
            "title_similarity": "0.39767277",
            "sentiment_compound": -0.1761
        },
        {
            "id": "h015kkc",
            "score": 1,
            "text": "Imagine someone inventing an alternative to cigarettes that is safer, then they ban the alternative because of 2 people dying from illegal black market cartridges, yet still allowing the sale of cigarettes",
            "title_similarity": "0.6961053",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h015lvv",
            "score": 1,
            "text": "Systems Thinking 101: UNINTENDED CONSEQUENCES.",
            "title_similarity": "0.098021045",
            "sentiment_compound": 0.0
        },
        {
            "id": "h015qdl",
            "score": 1,
            "text": "This concept of \"something dim harmful, lead to \"x\" to choose another harmful l thing\" its such a copout.\n\nThey are the ones making the decisions in their lives, stop excusing ppl for their wrong choices.",
            "title_similarity": "0.41324642",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h015tay",
            "score": 1,
            "text": "Seems like precisely what the vape and cigarette companies intended.",
            "title_similarity": "0.3488711",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h015yfx",
            "score": 1,
            "text": "Ex JUUL employee checking in, and also ex PAX employee too.  I also want to add that the media put JUUL in the negative spotlight so much.  I haven’t worked for them in three years and I still get approached by the media for questions.  New York Times just told me they are coming out with a documentary and wanted to interview me.  F them. I was a member of DARE and teens against tobacco use growing up. I’m very anti smoking and really believed (and still believe) that JUUL is doing the right thing.",
            "title_similarity": "0.6691148",
            "sentiment_compound": -0.6478
        },
        {
            "id": "h0162jl",
            "score": 1,
            "text": "we literally said this was going to happen. this is far far from surprising",
            "title_similarity": "0.12415803",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h01643j",
            "score": 1,
            "text": "Because banning things has never failed....ever....not once.   Certainly not every single time.",
            "title_similarity": "0.26714545",
            "sentiment_compound": -0.2584
        },
        {
            "id": "h0167kw",
            "score": 1,
            "text": "Is be curious to see whether it is a short term effect of vapers switching to cigs but with an accompanying long term decrease without the cape gateway effect, or whether there is a baseline % of youth that want to smoke something and don’t care what.",
            "title_similarity": "0.78849864",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h016f8e",
            "score": 1,
            "text": "Maybe an unpopular opinion but let them. We’ve catered to the safety of idiots for so long they aren’t weeding themselves out anymore. And now we are overrun with people who don’t know how to be part of society in a functional way.  🤷‍♀️",
            "title_similarity": "0.50356007",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h016hf6",
            "score": 2,
            "text": "Never understand how they didn't do flavoured cigarettes except menthol when vapes had 1000 flavours as soon as it got popoular. I would have been on a 100 a day rather than 30. And not just roll ups.\nI've been smoking 19 years, on a curve of 1-30 a day, can a bot work out how much more I have to suffer. They told me I would die.",
            "title_similarity": "0.72257906",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h016mr9",
            "score": 1,
            "text": "Why are cigarettes still legal? We banned asbestos didn't we?",
            "title_similarity": "0.6174053",
            "sentiment_compound": -0.4329
        },
        {
            "id": "h016o4e",
            "score": 1,
            "text": "Round and round and round we go",
            "title_similarity": "-0.0207146",
            "sentiment_compound": 0.0
        },
        {
            "id": "h016pm2",
            "score": 1,
            "text": "Socisl engineering does not always work how you want it to.",
            "title_similarity": "0.16277155",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h016qd7",
            "score": 1,
            "text": "Chewing tobacco helped me quit cigarettes. There’s actually very little evidence of increased cancer risk for users of chewing tobacco. Still plan to quit chew eventually. Probably healthier than vaping though.",
            "title_similarity": "0.6984415",
            "sentiment_compound": -0.6872
        },
        {
            "id": "h016rhq",
            "score": 1,
            "text": "Genuine question, why don’t we just ban cigarettes?",
            "title_similarity": "0.43955883",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h016t90",
            "score": 3,
            "text": "They banned flavoured tobacco in Alberta before vaping was even a thing. Never seen so much dip, snus and snuff use in any other city",
            "title_similarity": "0.5681451",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h0173sl",
            "score": 1,
            "text": "The ole Barbra streisand effect",
            "title_similarity": "0.117147945",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0174zq",
            "score": 1,
            "text": "It's obvious how govt cares about your health when it comes to vaping flavors but not smoking cigarettes.  No ban on cigs, yet they want to ban the tool used for cessation of smoking probably due to lobbying and profit motives.  Clown country.",
            "title_similarity": "0.58145165",
            "sentiment_compound": 0.5908
        },
        {
            "id": "h0176u1",
            "score": 1,
            "text": "Stop trying to control, start trying to regulate.",
            "title_similarity": "0.14914396",
            "sentiment_compound": -0.296
        },
        {
            "id": "h017j8l",
            "score": 1,
            "text": ">\"Think about youth preferences: some kids who vape choose e-cigarettes over combustible tobacco products because of the flavors,” she said. “For these individuals as well as would-be vapers with similar preferences, banning flavors may remove their primary motivation for choosing vaping over smoking, pushing some of them back toward conventional cigarettes.”\n\nCouldn't this just mean that those kids already addicted to nicotine switched to another nicotine source to keep their habit? Flavors attracted kids in the first place. There's nothing to suggest that had vape flavors already been banned they would have picked up cigarettes anyways. When they're gone (after this crop of nicotine addicts has aged out of the demographic of 'teens'), I expect those numbers to drop back down, even further than before the ban.\n\nEdit: corrected a mislabel",
            "title_similarity": "0.8316073",
            "sentiment_compound": -0.34
        },
        {
            "id": "h017nqx",
            "score": 1,
            "text": "Legitimate question which is more expensive smoking or vaping? I don't do either but I am genuinely curious due to a convo with some friends",
            "title_similarity": "0.60030824",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h017ouu",
            "score": 1,
            "text": "I'm sure we can all agree that in high school all the cool people smoked.",
            "title_similarity": "0.6431297",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h017ug0",
            "score": 1,
            "text": "I don’t get the antivaping thing.  Isn’t it good that people can use nicotine without carcinogens?",
            "title_similarity": "0.49011213",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h017zf3",
            "score": 3,
            "text": "And that was the intended result banning flavored vapes. Health issues arose from illegal catridges, not regulated cartridges. However the vapes were removing customers from the cigarette companies.",
            "title_similarity": "0.54698205",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h01802j",
            "score": 1,
            "text": "All that's means is that anti smoking education keeps failing",
            "title_similarity": "0.46045122",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0180zv",
            "score": 1,
            "text": "Vape tax is the reason I still smoke cigs.",
            "title_similarity": "0.52612895",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0181ep",
            "score": 3,
            "text": "It's almost as if prohibition doesn't work.  If only we'd tried some form of prohibition before to have learned that lesson...",
            "title_similarity": "0.50267273",
            "sentiment_compound": 0.0
        },
        {
            "id": "h018409",
            "score": 1,
            "text": "Wow I wonder who coulda guessed this could possibly happen....",
            "title_similarity": "0.118846506",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0185s9",
            "score": 1,
            "text": "Stupid kids do stupid things. Not much more to be said about that.",
            "title_similarity": "0.33838367",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h018ahw",
            "score": 4,
            "text": "Government fucks everything up",
            "title_similarity": "0.166322",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h018dwc",
            "score": 1,
            "text": "It’s almost like they are addicted to nicotine and not fruity flavors.",
            "title_similarity": "0.47069186",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h018g8v",
            "score": 4,
            "text": "That was the entire plan.\n\nThe anti vaping scare tactics were funded by the tobacco industry.",
            "title_similarity": "0.5690248",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h018tpa",
            "score": 1,
            "text": "From my experience in point of view in life trying to ban things is stupid it just pushes those who have been banned to either do it illegally or find another worse subject matter to fill their time with.",
            "title_similarity": "0.43394172",
            "sentiment_compound": -0.9186
        },
        {
            "id": "h018ujy",
            "score": 1,
            "text": "Noooooooooooooo who woulda guessed?",
            "title_similarity": "0.07277179",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01976w",
            "score": 1,
            "text": "Big tobacco CEO on his bed of money reading this headline with his two 13 year old concubines \" All according to plan.\" He takes a puppy and stabs it's belly with a Capri sun straw and sucks out a long draw of blood. \"Good, good.\" He says.",
            "title_similarity": "0.45546022",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h019ked",
            "score": 1,
            "text": "Okay but a far more important question is whether the ban made them more or less likely to pick up any kind of nicotine products.",
            "title_similarity": "0.54391426",
            "sentiment_compound": -0.4235
        },
        {
            "id": "h019trj",
            "score": 4,
            "text": "How the hell does one even justify a ban on flavored vapes?? The WHOLE POINT OF VAPES is to put out a product that steers youths AWAY from smoking. We all know that unflavored vape juice tastes about as good as a dog turd and i personally will take a regular cancer-filled death stick any day over a dog-posterior tasting \"alternative\".\n\nThis type of ban completely defeats the purpose of the product.\n\nFor source: i smoke.",
            "title_similarity": "0.55339944",
            "sentiment_compound": -0.9498
        },
        {
            "id": "h019vu7",
            "score": 1,
            "text": "\"Study\". As in \"one\". I'm not a smoker, vaper or even someone who smokes pot. Not a fan of any of those things. Still, we live in this culture where \"a study\" is often seen as the absolute truth. Be wary.",
            "title_similarity": "0.34359914",
            "sentiment_compound": 0.0869
        },
        {
            "id": "h019y8t",
            "score": 1,
            "text": "I could honestly care less about this. If people wanna smoke then let them smoke.",
            "title_similarity": "0.3601572",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h01a1ob",
            "score": 1,
            "text": "Of course. The moral police literally killing people with their misinformation yet again.",
            "title_similarity": "0.33704",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h01a31w",
            "score": 1,
            "text": "At some\nPoint you just have to let informed people kill themselves.",
            "title_similarity": "0.22843298",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h01a6ka",
            "score": 1,
            "text": "Live by the juul, die by the juul.",
            "title_similarity": "0.109958634",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h01a72v",
            "score": 2,
            "text": "I quit smoking using flavored vapes. only thing that worked. banning or restricting them is straight up stupid",
            "title_similarity": "0.49684167",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h01a8gw",
            "score": 1,
            "text": "So... smoking is back in now?",
            "title_similarity": "0.37960213",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01adk4",
            "score": 2,
            "text": "That was the point, cigarettes were already more heavily taxed at the time and the state wasn't making as much money off people who switched over",
            "title_similarity": "0.692201",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01afgs",
            "score": 1,
            "text": "> In the department of economy, an act, a habit, an institution, a law, gives birth not only to an effect, but to a series of effects. Of these effects, the first only is immediate; it manifests itself simultaneously with its cause — it is seen. The others unfold in succession — they are not seen: it is well for us, if they are foreseen. Between a good and a bad economist this constitutes the whole difference — the one takes account of the visible effect; the other takes account both of the effects which are seen, and also of those which it is necessary to foresee. Now this difference is enormous, for it almost always happens that when the immediate consequence is favourable, the ultimate consequences are fatal, and the converse.\n\nFrederic Bastiat",
            "title_similarity": "0.31268445",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h01amjw",
            "score": 2,
            "text": "maybe the government should just stop regulating things",
            "title_similarity": "0.28841698",
            "sentiment_compound": -0.296
        },
        {
            "id": "h01aojf",
            "score": 1,
            "text": "That backfired rather quickly, who would've thunk?",
            "title_similarity": "0.3219637",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01atup",
            "score": 1,
            "text": "Corporate lobbyists have to keep their body count up *somehow*.",
            "title_similarity": "0.22104156",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01b22y",
            "score": 1,
            "text": "Didn't they just flat out ban consumer shipping of all vape products as well?  USPS/FedEx/UPS no longer allow shipping of any vape products of any kind?  It was made illegal for USPS to ship, and then FedEx and UPS joined in.",
            "title_similarity": "0.4601953",
            "sentiment_compound": -0.7119
        },
        {
            "id": "h01b3js",
            "score": 1,
            "text": "It's almost like government intervention and prohibition never work as intended...",
            "title_similarity": "0.3505212",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h01bas9",
            "score": 1,
            "text": "Well yeah when they have cigarettes that are actually peppermint pretending to be menthol",
            "title_similarity": "0.54857063",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h01bi4k",
            "score": 1,
            "text": "This means they (critics) were right in saying vaping was an easy way to get kids addicted to nicotine. It also just means banning something is not the solution.",
            "title_similarity": "0.5908712",
            "sentiment_compound": -0.0675
        },
        {
            "id": "h01bj3s",
            "score": 1,
            "text": "Come on, we need something to be oral with.",
            "title_similarity": "0.08356444",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01bjw1",
            "score": 1,
            "text": "Oh come on I knew that. As one of the people who was using vapes, at age 19-20 when my legal age got moved to 21, I wound up smoking cigarettes. \n\nI don’t smoke anymore.",
            "title_similarity": "0.6894971",
            "sentiment_compound": 0.128
        },
        {
            "id": "h01cc2a",
            "score": 3,
            "text": "That’s why the cigarette companies proposed the ban. Notice how they fake acquires Vape co. Then cancelled last min",
            "title_similarity": "0.60118306",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h01cguw",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.05619866"
        },
        {
            "id": "h01cnp7",
            "score": 1,
            "text": "And it was never this form of vaping that was the problem, but \"THINK OF THE CHILDREN! (AND, MORE IMPORTANTLY, TOBACCO COMPANY PROFITS!!!!)\"",
            "title_similarity": "0.6258586",
            "sentiment_compound": 0.9162
        },
        {
            "id": "h01cqz1",
            "score": 1,
            "text": "As someone that doesn’t smoke, I find vaping to be much less obnoxious.",
            "title_similarity": "0.2888121",
            "sentiment_compound": -0.4033
        },
        {
            "id": "h01cs5i",
            "score": 1,
            "text": "So as expected, the cigarette companies won out in the long game.",
            "title_similarity": "0.55526257",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h01cuow",
            "score": 1,
            "text": "Take away a thing that people like and they'll find something similar?! If only we had historical examples of this very thing!",
            "title_similarity": "0.3136475",
            "sentiment_compound": 0.4738
        },
        {
            "id": "h01cuqf",
            "score": 1,
            "text": "They got what they wanted as usual.",
            "title_similarity": "0.07765075",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01cyr7",
            "score": 1,
            "text": "If they ban flavoured vaping I'm gonna be incited to commit some hate crimes\n\nCurrently 2 people I love are trying to quit smoking, and flavoured vapes are helping a lot",
            "title_similarity": "0.6267524",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h01cz9i",
            "score": 1,
            "text": "If I had a nickel for every unintended consequence stemming from government policy, I could retire,\nBuy a yacht, mansion, private jet and have money left over.",
            "title_similarity": "0.48736843",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01d2q6",
            "score": 1,
            "text": "Stop the anti-smoking propaganda and let smokers smoke, dammit.",
            "title_similarity": "0.44444126",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h01dhfo",
            "score": 1,
            "text": "*Oops*?\n\n&#x200B;\n\nAt least Barron stopped vaping, I guess?",
            "title_similarity": "0.33339846",
            "sentiment_compound": -0.3094
        },
        {
            "id": "h01ditt",
            "score": 1,
            "text": "It's almost like smoking is enjoyable and teenagers aren't worried about their later life health.",
            "title_similarity": "0.5403865",
            "sentiment_compound": 0.718
        },
        {
            "id": "h01dmmg",
            "score": 1,
            "text": "It would be interesting to see what would happen if all cigarettes had to be flavored to taste the same as unflavored vape juice.",
            "title_similarity": "0.5851487",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h01duyx",
            "score": 1,
            "text": "I'd love to see tobacco banned all over the world.",
            "title_similarity": "0.45605427",
            "sentiment_compound": 0.296
        },
        {
            "id": "h01dw2c",
            "score": 1,
            "text": "Just wait until you find out all the anti-vaping \"studies\" were paid for by the tobacco companies.",
            "title_similarity": "0.59425867",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01ea80",
            "score": 1,
            "text": "So, exactly what the cigarette companies wanted/planned",
            "title_similarity": "0.34821746",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01eiu5",
            "score": 1,
            "text": "Honestly if teens are this dumb and hell bent on killing themselves, is there really any amount of legislation that can stop them? 'Where there's a will, there is a way\" an natural selection will find a way to get the kids that make decisions like this",
            "title_similarity": "0.53440154",
            "sentiment_compound": -0.8432
        },
        {
            "id": "h01eka0",
            "score": 1,
            "text": "Once again \"conspiracy theorists\" were right.",
            "title_similarity": "0.21495819",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h01ekoe",
            "score": 1,
            "text": "Wasn't big Tabasco behind the vape ban in the first place?",
            "title_similarity": "0.44697374",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h01erwq",
            "score": 1,
            "text": "What?  The lobbyists at big tobacco used their paid politician hacks (congress) to addict more children to cancer sticks?  Say it isn't so?",
            "title_similarity": "0.633327",
            "sentiment_compound": -0.7354
        },
        {
            "id": "h01evt8",
            "score": 1,
            "text": "You know what could have avoided this all. Not marketing flavored nicotine products to children in the first place.  \nBut nah we don't hold people accountable for their crimes In America if you have enough money.",
            "title_similarity": "0.5431809",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h01f65l",
            "score": 1,
            "text": "Banned pain killers, or i should say, prevented doctor shopping to prevent easy access to pain killers and the heroin epidemic started immediately after.\n\nShould've known this was coming.",
            "title_similarity": "0.5941597",
            "sentiment_compound": -0.9601
        },
        {
            "id": "h01f93c",
            "score": 1,
            "text": "Once again, **drugs win war on drugs**",
            "title_similarity": "0.42626178",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h01ff6v",
            "score": 1,
            "text": "Just make cigarettes illegal",
            "title_similarity": "0.37294802",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h01fhze",
            "score": 2,
            "text": "That whole era of vape targeted “scare science” was so obviously brought on by the tobacco industry that I was legit shocked by how no one could see.",
            "title_similarity": "0.6039496",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h01g21p",
            "score": 1,
            "text": "I think the whole ban on vaping is aimed at making Big Tobacco alternatives, like the rather expensive (and more dangerous) sheets, more attractive.\n\nMust keep the big donators happy!",
            "title_similarity": "0.62087905",
            "sentiment_compound": 0.4003
        },
        {
            "id": "h01g2jf",
            "score": 1,
            "text": "I’m confused they are saying children are twice as likely to take up cigarettes after the ban. But Is it that bad if 2/10 teens vape. They turn it to 0 kids vaping but they are twice as likely to smoke cigarettes. Kids are twice as likely to smoke cigarettes now, but none vape? It looks like this law protects kids from starting a vape habit, but pushes the people who use it because their addicted to cigarettes",
            "title_similarity": "0.8469283",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h01g4b9",
            "score": 1,
            "text": "Almost like idiots decided adults don't have taste buds so flavor equals child and they almost intentionally killed the less harmful alternative.",
            "title_similarity": "0.57656693",
            "sentiment_compound": -0.4615
        },
        {
            "id": "h01g5z3",
            "score": 1,
            "text": "Wait, when was flavoured vaping banned, and what was the rationele?",
            "title_similarity": "0.36818266",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h01gasx",
            "score": 1,
            "text": "Do better at enforcing the laws",
            "title_similarity": "0.21784252",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h01gbsr",
            "score": 1,
            "text": "None of this should be surprising to anyone",
            "title_similarity": "0.08892694",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h01gczr",
            "score": 1,
            "text": "man, I don't get why kids think it's cool to smoke. so stupid",
            "title_similarity": "0.508858",
            "sentiment_compound": -0.4707
        },
        {
            "id": "h01gdj2",
            "score": 1,
            "text": "So if vaping never happened the same kids would just be smoking cigarettes?",
            "title_similarity": "0.6910161",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01gh4j",
            "score": 1,
            "text": "Good thing they gotta be 21 now.",
            "title_similarity": "0.30062947",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h01gjp3",
            "score": 1,
            "text": "The thing that anti-vaping people don't understand is that you can get nicotine free vape juice. You can't get nicotine free cigarettes. Vaping was always the better alternative.",
            "title_similarity": "0.62077355",
            "sentiment_compound": 0.542
        },
        {
            "id": "h01gp4l",
            "score": 1,
            "text": "It’s almost like teens are stupid and will do whatever they can get their hands on within reason",
            "title_similarity": "0.398341",
            "sentiment_compound": -0.2944
        },
        {
            "id": "h01gpj9",
            "score": 1,
            "text": "As if big tobacco didn't donate a ton of money for that ban to happen.",
            "title_similarity": "0.58759534",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h01gqpd",
            "score": 1,
            "text": "And before there were vapes it was cigarettes. But they didn’t bother to look at that.\n\nTell a kid they can’t do or have something and they will *find a way*",
            "title_similarity": "0.5631697",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h01gs5h",
            "score": 1,
            "text": "Almost as if banning something only makes the problem worse",
            "title_similarity": "0.22635499",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h01guau",
            "score": 1,
            "text": "almost like the cigarette industry planned this all along hmmm",
            "title_similarity": "0.44972792",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h01gvdt",
            "score": 1,
            "text": "Honestly, I would rather my kid sneak around to smoke than vape. Better chance to smell it one them and woop their ass for touching tobacco.",
            "title_similarity": "0.5816992",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h01gwxp",
            "score": 1,
            "text": "Its almost like the better alternative was a better alternative.",
            "title_similarity": "0.22853893",
            "sentiment_compound": 0.7746
        },
        {
            "id": "h01h2es",
            "score": 1,
            "text": "Bring back mint juul pods",
            "title_similarity": "0.31296223",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01h4n5",
            "score": 1,
            "text": "At a skim, this article appears to leave out an important bit about how many fewer students got into any sort of tobacco products in the absence of vaping. Like, sure, some percent went into tobacco cigarettes and doubled the amount (bummer), but how many just stopped vaping and moved on?\n\nTo illustrate the point (and noting I have no idea what the actual numbers/percentages are), let’s say the student population is 100 — 70 who never touch tobacco products, 25 who vape and 5 who smoke cigarettes. Bam, ban goes into effect, and 5 of the 25 vapers start smoking cigarettes, while the other 20 former vapers just quit. The number of cigarette smokers doubled (!!!!) but far fewer teenagers maintained nicotine addictions overall (now 90 without, and only 10 smokers).\n\nThis also leaves out the fact that kids who were already addicted would be more likely to find their fix elsewhere, and future cohorts might just skip out (though to be fair that’s noted in the article).\n\nIn all, this research kinda reminds me of the old school bunk research that supported cigarettes not being a public health risk, but now funded by the vape lobby (gross).",
            "title_similarity": "0.8169775",
            "sentiment_compound": -0.8914
        },
        {
            "id": "h01h5m2",
            "score": 1,
            "text": "Because by that point they were already addicted to nicotine. Wonder how many of those would have tried traditional cigarettes if they hadn’t had access to a flavored alternative first.",
            "title_similarity": "0.7316805",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01h70j",
            "score": 1,
            "text": "Task failed successfully!",
            "title_similarity": "0.1236513",
            "sentiment_compound": -0.1007
        },
        {
            "id": "h01hgai",
            "score": 1,
            "text": "Well well well, this is the first ever science thread I've seen that hasn't been hit by a nuclear bomb.",
            "title_similarity": "0.44287938",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h01hueb",
            "score": 1,
            "text": "From the very start I have believed all the anti vaping stuff was a brilliant case of social engineering by Big Tobacco. Change my mind. I became more convinced after my cardio stress test results were fantastic, after I got off cigarettes and switched to vaping. Cardiologist told me he'd rather have any of his patients vaping rather than them smoking.",
            "title_similarity": "0.6982857",
            "sentiment_compound": 0.7425
        },
        {
            "id": "h01hynt",
            "score": 1,
            "text": "Big tobacco: That worked perfectly",
            "title_similarity": "0.29832494",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h01hzcl",
            "score": 1,
            "text": "I don't get it.. Nicotine is *NOT* a carcinogen.. it merely addicts the person long enough to prolong exposure to actual carcinogens in cigarette smoke (polycyclic aromatic HC, nitroso-amines etc).\n\nAnd yet, when they have a nicotine only variant, the state doesn't want people getting lung cancer anymore?\n\nThis begs the question: how much are the pharma companies paying the state to ensure its people keep getting sick?",
            "title_similarity": "0.68684924",
            "sentiment_compound": -0.7705
        },
        {
            "id": "h01hzny",
            "score": 1,
            "text": "Congratulations Philip Morris! Get money out *cough, cough* of politics.",
            "title_similarity": "0.40153185",
            "sentiment_compound": 0.636
        },
        {
            "id": "h01i24g",
            "score": 1,
            "text": "Wow, you ban a healthier alternative to cigarettes because a few dumb teens bought illegal non-FDA approved THC vape juices that destroyed their lungs and people flock to the less-healthy option you were trying to wane them off in the first place. Who woulda thunk?",
            "title_similarity": "0.73469687",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h01i2bw",
            "score": 1,
            "text": "Oh, so exactly what everyone said would happen? Color me shocked.",
            "title_similarity": "0.15200546",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h01ib65",
            "score": 1,
            "text": "These kids camping commercials are so cringe.",
            "title_similarity": "0.357351",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01ibv2",
            "score": 1,
            "text": "Yep. I started smoking before vape. I switched to vape as a better alternative. Along with the ban on flavors they made it impossible for small companies to produce their own flavors period and limited the options severely. Because of this, high pg went away in my area and I could no longer get the hit I was addicted to. Been smoking cigarettes for 6 months. It's more expensive, it's worse for my health, I smell again. Thanks everybody for looking out for me.",
            "title_similarity": "0.733132",
            "sentiment_compound": -0.7239
        },
        {
            "id": "h01ico5",
            "score": 1,
            "text": "Full circle. I'm not involved any more but in the early 2010's when electronic cigarettes weren't as widely available I was pretty looped in with the grassroots communities.\n\nThe argument has always been that a) flavors are what helped most people successfully make the switch from tobacco and b) if those flavors were banned they would most likely end up back to smoking\n\nI've always been a big fan of harm reduction approaches vs outright bans. We've seen time and time again banning a substance just leads to zero oversight, and just puts the end users in more danger rather than eliminating it entirely.\n\nUnless we have plans to ban all nicotine / tobacco products in general then there's really no benefit to the e-cigarette or flavor bans. Yeah, I don't think kids should be addicted to nicotine, but when we're in a situation where there's a significantly less harmful option, I'd rather that be the one in use.",
            "title_similarity": "0.76059985",
            "sentiment_compound": -0.9076
        },
        {
            "id": "h01ieb3",
            "score": 1,
            "text": "This article and study did not do the initiative justice. My partner did smoking cessation research at UCSF and was heavily involved in this.\n\nThe problem with flavored tobacco is that it was attracting A LOT of NEW tobacco users that WOULD NOT have otherwise used tobacco. 21% of high school students reported vaping in 2018. Up from 7% in 2017. Whereas smoking rates in SF were 6% in 2019, up from 4% in 2017.\n\nI’m all for smoking cessation, but believe this is only shedding light on part of the issue. Vaping (largely Juul) wasn’t primarily being sold as a means of smoking cessation, it was being sold to ATTRACT a new audience to tobacco to form lifelong addictions. It’s the same damn thing that the tobacco industry did with Menthol when they targeted it towards black communities to attract them.\n\nBanning flavored vapes, while inconvenient when it comes to having more options to smoking cessation for smokers, is helping to prevent widespread usage of tobacco for future generations. Also, tobacco companies put HUGE money into fighting the ban in SF, I saw ads left and right by Altria (company that owns Marlboro) every day living in SF.",
            "title_similarity": "0.8242903",
            "sentiment_compound": -0.0003
        },
        {
            "id": "h01izqk",
            "score": 2,
            "text": "They banned flavored vapes here (Nova Scotia, Canada) and flavored tobacco. People still smoke. Smokers are gonna smoke no matter what, it's a chemical addiction. It just inconveniences people like me that might enjoy the occasional flavored cigarillo or pipe tobacco, before the pandemic it was a bit of a ritual to drive to the next province over and buy a years worth of smokes.",
            "title_similarity": "0.7021447",
            "sentiment_compound": 0.5463
        },
        {
            "id": "h01jks1",
            "score": 1,
            "text": "I mean,this is the desired result considered how much big Tabasco lobbied for this. \n\nIt was never about health",
            "title_similarity": "0.37896985",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h01jsll",
            "score": 1,
            "text": "San Francisco has a lot of smokers already.  I think it could be the culture of the town.",
            "title_similarity": "0.54916584",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01k5he",
            "score": 1,
            "text": "Ok? If enrico fermi has taught us anything, we should ask how much total smoking has changed, not how many kids started using cigarettes.",
            "title_similarity": "0.6835052",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01k6fe",
            "score": 1,
            "text": "Wait why go straight to cigarettes and not non flavored vape pens?",
            "title_similarity": "0.46715802",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h01k8qk",
            "score": 1,
            "text": "In my opinion, vaping has always been about hooking a new generation on smoking.",
            "title_similarity": "0.6124228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01kfio",
            "score": 1,
            "text": "Can we please just ban cigarettes at last?",
            "title_similarity": "0.4570366",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h01ksp4",
            "score": 1,
            "text": "After all these years why are people still so stupid about the consequences of prohibition.  You can hate tobacco or Vape all you want. But people are going to use tobacco, same as they use alcohol,  sex workers and gambling. Yadda yadda yadda. The \"big anti-tobacco \" machine is cultish,  racist and classist.",
            "title_similarity": "0.62431365",
            "sentiment_compound": -0.8856
        },
        {
            "id": "h01ktxi",
            "score": 1,
            "text": "As the article mentions, this is only a short-term observation.  Kids who are already addicted to nicotine are now turning to cigarettes.  In a few years, will this decline, when there are less kids who get addicted to nicotine via vaping?",
            "title_similarity": "0.8066575",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01kvow",
            "score": 1,
            "text": "I mean yeah if you crack down on vaping suddenly you have a bunch of nicotine addicted teenagers who will smoke whatever they can get their hands on",
            "title_similarity": "0.64899766",
            "sentiment_compound": 0.296
        },
        {
            "id": "h01kzhw",
            "score": 1,
            "text": "Im prettu sure that one of the major lobbying groups pushing for the flavored nicotine vapes where ... the tobacco industry. Yes, they already knew the outcome, it was planned.",
            "title_similarity": "0.52970386",
            "sentiment_compound": 0.5279
        },
        {
            "id": "h01l023",
            "score": 1,
            "text": "Oh really, who could’ve guessed",
            "title_similarity": "0.034271024",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01l0zl",
            "score": 1,
            "text": "This is literally by design.  The tobacco lobby actively pushed for these bans…",
            "title_similarity": "0.5027622",
            "sentiment_compound": 0.34
        },
        {
            "id": "h01l4g7",
            "score": 1,
            "text": "One advantage to being a minimalist is not developing a habit like this, too costly",
            "title_similarity": "0.31186974",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h01l578",
            "score": 1,
            "text": "certified bruh moment",
            "title_similarity": "0.09115818",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01l8a5",
            "score": 2,
            "text": "who saw this coming? God those “truth” commercials and the whole campaign are awful. We finally have something that helps smokers quit with great success and they vilify it. It’s not about helping people, it’s about virtue signaling. \nI’m gonna go light up a fat cigar and reflect on the fact that I knew it all along.",
            "title_similarity": "0.6614265",
            "sentiment_compound": 0.8863
        },
        {
            "id": "h01laxn",
            "score": 1,
            "text": "Oh no who could have predicted this besides the everyone saying this exact thing would happen and the tobacco companies who lobbied this. Oh nooooooooo",
            "title_similarity": "0.50908875",
            "sentiment_compound": -0.296
        },
        {
            "id": "h01lu7y",
            "score": 1,
            "text": "Dmt in the vape, or it ain’t dmt in the vape.",
            "title_similarity": "0.13394451",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01m3w4",
            "score": 1,
            "text": "If the can ban vapes, why can't ban cigs?",
            "title_similarity": "0.43331885",
            "sentiment_compound": -0.1719
        },
        {
            "id": "h01mb2k",
            "score": 1,
            "text": "Not gonna lie I quit nicotine completely after six years once they banned the good flavors",
            "title_similarity": "0.5732105",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h01md04",
            "score": 1,
            "text": "I thought this was the master plan all along.\n\nAnyway, it’s not like you can’t make your own flavored nicotine vape juice. There are literally websites dedicated to recipes for different flavors.",
            "title_similarity": "0.48436332",
            "sentiment_compound": 0.224
        },
        {
            "id": "h01mmfl",
            "score": 1,
            "text": "I’ll never understand this. I can go to the store and buy birthday cake flavored vodka and no one has a problem with that.",
            "title_similarity": "0.5094025",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h01mqoa",
            "score": 1,
            "text": "Ive gone to a pack a day to one vape costing 15 dollars lasting a week.  My persistent cough has gone too and I feel way better.",
            "title_similarity": "0.5919453",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h01mrg2",
            "score": 1,
            "text": "My question is if this is just a short term boost due to addicted teens switching to cigarettes and if longterm we will see a drop due to less people starting nicotine products at all. It seems the author of this article has a similar thought when discussing limitations:\n\n> The San Francisco study does have limitations. Because there has been only a short time since the ban was implemented, the trend may differ in coming years.\n\nI think it's just way too early to draw any conclusions from this based on how this study was performed. If they looked at number of new smokers then we might be able to draw some stronger conclusions but since it is just total smokers it doesn't account for already addicted teens switching to cigarettes.",
            "title_similarity": "0.82618165",
            "sentiment_compound": -0.0129
        },
        {
            "id": "h01mx5o",
            "score": 1,
            "text": "If people want to smoke let them smoke.. only requirement should be they should know harmful effects of smoking.. there should be smoking house to smoke..",
            "title_similarity": "0.4626544",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h01myje",
            "score": 1,
            "text": "If the issue is that cigarette smokers greatly benefit from switching to vaping but kids get addicted to vaping who would not otherwise use cigarettes--why not make flavored vapes prescription? Have doctors prescribe it as a smoking cessation aid. They can do so with nicotine patches and nicorette.",
            "title_similarity": "0.7661471",
            "sentiment_compound": 0.2838
        },
        {
            "id": "h01n5jz",
            "score": 1,
            "text": "Amazing that the government knows this will obviously be the result and still does it, cigarette companies have done such a great job of convincing people that vaping is somehow worse. Its disgusting.",
            "title_similarity": "0.5224767",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h01n7dj",
            "score": 1,
            "text": "Sounds like their plan worked.",
            "title_similarity": "0.092067085",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h01n8tl",
            "score": 1,
            "text": "Do they make vale’s with no nicotine? Wouldn’t that be a better alternative. Kids are going to do it anyways, they could take the addiction out of the equation?",
            "title_similarity": "0.6362815",
            "sentiment_compound": 0.264
        },
        {
            "id": "h01n9d2",
            "score": 1,
            "text": "I thought that was the whole point. I figured vapes were starting to take a bite out of big tobacco so they lobbied to remove the flavors because it created an unfair advantage. I dunno, that's my head canon anyway.",
            "title_similarity": "0.61051023",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h01ncsv",
            "score": 1,
            "text": "Precisely what we predicted would happen.",
            "title_similarity": "-0.027149756",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01njhe",
            "score": 1,
            "text": "Imagine thinking you can legislate away anything.",
            "title_similarity": "0.10294049",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01nl4a",
            "score": 1,
            "text": "This is unsurprising, taking into account the nicotine in vape products. Obviously, when teens addicted to vape products were forced to quit through government action, they would experience withdrawal and likely seek other, similar vices. \n\nWhat should also be looked it is the number of teens who never vaped prior to the vape ban and look at *those* teens’ rates of cigarette smoking afterwards. If the number stayed the same or did not rise in any meaningful way, then what this study really shows is just how big of a gateway product flavored vaping is to actual cigarette smoking. Don’t get me wrong, for actual smokers, it sucks that they don’t have flavored vape products but vaping is completely banned. They can still purchase vape products to ease themselves out of smoking, but what matters is we reduce as much underage smoking as possible to lower the overall number of smokers in the future.",
            "title_similarity": "0.8199637",
            "sentiment_compound": -0.8171
        },
        {
            "id": "h01nltw",
            "score": 1,
            "text": "Oh look, unintended consequences. It’s almost like humans aren’t drones.",
            "title_similarity": "0.17017853",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h01nnd4",
            "score": 1,
            "text": "This isn't unexpected, and believe it or not it's a great improvement. Previously, people who didn't smoke but vaped were 12x more likely to switch to cigarettes, so a doubling of odds in this case is a shrinking in the risks.",
            "title_similarity": "0.775974",
            "sentiment_compound": -0.4209
        },
        {
            "id": "h01nvs2",
            "score": 1,
            "text": "Ok, but the math on this is lacking. If there were like 1% of students smoking cigs and it went to 2%, that’s doubling, doesn’t matter that there could have been like 50% vaping",
            "title_similarity": "0.77485776",
            "sentiment_compound": 0.7684
        },
        {
            "id": "h01nzdf",
            "score": 1,
            "text": "This is the Gru presentation meme in real life...\n\n1) Flavored vapes attract too many kids to smoking\n\n2) Ban flavored vapes to reduce smoking among teens\n\n3/4) Nictoine-addicted teens switch to regular cigarettes",
            "title_similarity": "0.8203063",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h01nzx3",
            "score": 1,
            "text": "It just made all the teens turn to thc carts where I’m at. Almost no one under 20 or so uses nicotine in my area. But it’s near impossible to find a kid who isn’t a thc user.",
            "title_similarity": "0.6204585",
            "sentiment_compound": -0.1163
        },
        {
            "id": "h01o1ot",
            "score": 2,
            "text": "Vaping is just new age smoking with flavors for a younger audience.",
            "title_similarity": "0.67991644",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01o65z",
            "score": 1,
            "text": "All according to plan. Big tobacco loves it when you ban vaping stuff.",
            "title_similarity": "0.49170816",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h01oda0",
            "score": 1,
            "text": "Literally what I said would happen, happened?\n\nMy word! Who would've ever guessed!",
            "title_similarity": "0.22114165",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01ohu8",
            "score": 1,
            "text": "Wonder who's backing the ban on vapes then",
            "title_similarity": "0.39510402",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h01oow3",
            "score": 2,
            "text": "In the article it says that the odds ratio to smoke at a young age doubled after the ban. But the smoking incidence was low to begin with. The rate went from 3 in 10000 to 6 in 10000. This is really low compared to the amount of people who would have vaped at 18 years (2 in 10). And similar to the incidence from 2013.\n\nSo yes, baning flavored vapimg may increase smoking in young people. But I don't think it is a really noticeable change and will probably decrease again in a couple years anyway.",
            "title_similarity": "0.8267937",
            "sentiment_compound": 0.1649
        },
        {
            "id": "h01ot8b",
            "score": 1,
            "text": "In other words we should have focused on the 'kids' part, not the 'flavored' part of 'kids can get addicted to flavored nicotine products'",
            "title_similarity": "0.57760775",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h01p11c",
            "score": 1,
            "text": "This was the point of the ban the entire time",
            "title_similarity": "0.149148",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h01p6t0",
            "score": 2,
            "text": "I've never smoked in my life and I never understood these bans. They're only going to either buy underground or move to something more dangerous.  It didn't work in prohibition and it's not gonna work now.",
            "title_similarity": "0.47980884",
            "sentiment_compound": -0.5256
        },
        {
            "id": "h01p751",
            "score": 1,
            "text": "Yet the online sale was recently prohibited in the US. Country is a joke.",
            "title_similarity": "0.44670832",
            "sentiment_compound": 0.296
        },
        {
            "id": "h01pgsx",
            "score": 1,
            "text": "In relevant news: Tobacco industry has posted record profitshttps://www.theguardian.com/business/2021/feb/17/british-american-tobacco-profits-rise-despite-drop-in-sales... Coincidence that last year there was a media campaign against vapes, and bans, and here is science supporting the conspiracy that big tobacco is in fact waging a war against vapes.",
            "title_similarity": "0.7112722",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h01pnjc",
            "score": 1,
            "text": "Cant they just ban cigarettes already, we’re stuck in the 1960s nothings changing",
            "title_similarity": "0.4787637",
            "sentiment_compound": 0.2321
        },
        {
            "id": "h01pq2q",
            "score": 1,
            "text": "Exactly what the ban was meant to do. Don't forget about the lobbyists that actually run the govt folks.",
            "title_similarity": "0.3339589",
            "sentiment_compound": -0.4468
        },
        {
            "id": "h01pqdr",
            "score": 1,
            "text": "Not surprising- the anti-vape movement was always driven by big tobacco",
            "title_similarity": "0.481255",
            "sentiment_compound": -0.2057
        },
        {
            "id": "h01pte4",
            "score": 1,
            "text": "Because there were flavored cigarettes?",
            "title_similarity": "0.44670105",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01ptst",
            "score": 1,
            "text": "Push down, pop up\n\nThis is a pretty well know phenomenon",
            "title_similarity": "0.13475196",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h01q7kt",
            "score": 2,
            "text": "It almost sounds like this post and the accompanying comments are funded by Juul...",
            "title_similarity": "0.23759477",
            "sentiment_compound": 0.3008
        },
        {
            "id": "h01q9ix",
            "score": 2,
            "text": "I don't get why people would vape or smoke to begin with. To me its just a waste of money",
            "title_similarity": "0.37340435",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h01qero",
            "score": 1,
            "text": "I hate California so much. Use to be a fun state. So incredibly stupid, that I as a 30 year old adult, can't enjoy fruity flavored smoking devices. Guess it's time to ban Hookah too",
            "title_similarity": "0.6271327",
            "sentiment_compound": -0.891
        },
        {
            "id": "h01qhrn",
            "score": 1,
            "text": "\"it's going exactly as planned\" - Phillip Morris",
            "title_similarity": "0.05548969",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01qk3q",
            "score": 1,
            "text": "Two times zero is still zero",
            "title_similarity": "0.15700087",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01qksk",
            "score": 1,
            "text": "Sooooo..... It went back to what it was before? Shocking.",
            "title_similarity": "0.1579968",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h01qpwd",
            "score": 2,
            "text": "My question is, why are we allowing minors to vape?",
            "title_similarity": "0.3195515",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01qpwv",
            "score": 1,
            "text": "Hslf my friends  in my high school smoked, and I graduated in 2008. You gave kids a bubblegum pop alternative to cigarettes, and then took away their addiction. Of course they're gonna go back to the easier alternative.",
            "title_similarity": "0.81761026",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h01qy3k",
            "score": 1,
            "text": "All according to the tobacco corporations’ plans.",
            "title_similarity": "0.3450855",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01r8w9",
            "score": 1,
            "text": "It's almost like banning things doesn't work...",
            "title_similarity": "0.18986154",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h01rcon",
            "score": 1,
            "text": "The ban of flavored products was a god send for me. I used to buy the mango pods from juul and they were wicked expensive. Now I get my juice from a lab in Canada and its like ten dollars a month.",
            "title_similarity": "0.6075399",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h01rg28",
            "score": 1,
            "text": "As a recently former high school student, i dont know a single person that is dumb enough to move to cigarettes. They would just smoke more weed or something",
            "title_similarity": "0.74166816",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h01rggy",
            "score": 1,
            "text": "Well how bad is vaping as opposed to cigarettes? Im guessing vaping is slightly better overall?",
            "title_similarity": "0.55161464",
            "sentiment_compound": 0.1449
        },
        {
            "id": "h01rm0r",
            "score": 2,
            "text": "I wonder, though, if the total amount of people that either vape or smoke actually changed. Like these numbers look bad, but if the total number of people using either product actually decreased, then it actually ends up looking like a good thing.",
            "title_similarity": "0.6280015",
            "sentiment_compound": 0.8171
        },
        {
            "id": "h01rqsa",
            "score": 1,
            "text": "Almost like prohibitions don’t make people quit. Too bad we never had any data to work off of to come to this conclusion.",
            "title_similarity": "0.39988393",
            "sentiment_compound": -0.3167
        },
        {
            "id": "h01rylo",
            "score": 1,
            "text": "Seems like big tobacco is always one step ahead, huh?",
            "title_similarity": "0.38624364",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h01s403",
            "score": 1,
            "text": "This makes perfect sense from first hand experience. I started vaping in my senior year and ended up moving to cigarettes after flavors were banned because it was a bit cheaper to fill my nicotine addiction with cigs than a $10-$15 dollar disposable vape.",
            "title_similarity": "0.81568754",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h01s53j",
            "score": 1,
            "text": "I used to have a 2 packs/day habit. Quit basically cold turkey, didn’t transition into vaping. So I have no idea what vaping is like. How hard is it to quit when you’re vaping?",
            "title_similarity": "0.57487476",
            "sentiment_compound": -0.0935
        },
        {
            "id": "h01sgpa",
            "score": 1,
            "text": "So... real talk y'all. Ever... you know....get a survey in high school and they told you not to lie because it was an official study? Did anyone else .... maybe....idk... respond with \"highly at risk\" 5 of 5 type statements while snickering with the rest of the class that we were all \"American Indians (we chose it because it was the smallest actual demographic as a choice, just for more fun IG) on Crack and anchol\"  and whatever else was in the survey... \n\nI mean... I know I went to school like *a long time ago* ahem.   But is that a thing people still do?  J/w\n\nAnd if so...think its sizable enough to skew data?\n\nI mean when I was in high school it was like The Plan and we all did it. not just my class. The whole school was in on what to fill out >.>;",
            "title_similarity": "0.6602644",
            "sentiment_compound": 0.8247
        },
        {
            "id": "h01sgyu",
            "score": 1,
            "text": "Waiting for “All Organic, Vegan, Gluten-free, & Keto Friendly” labeling. That will the be the top brand.",
            "title_similarity": "0.36693686",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h01sns9",
            "score": 2,
            "text": "I find it hard to believe that removing vaping made teens smoke cigarettes. I believe vaping led them to it.",
            "title_similarity": "0.70822334",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h01sq3r",
            "score": 1,
            "text": "Just like the oxy ban led them to heroin",
            "title_similarity": "0.4592759",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h01ss4v",
            "score": 1,
            "text": "Create vapes\nSuck kids in\nRemove them\nKids turn to smokes\nProfit",
            "title_similarity": "0.5723652",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h01suvh",
            "score": 1,
            "text": "natural plant based vapes are making a comeback!",
            "title_similarity": "0.20874824",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h01sxki",
            "score": 1,
            "text": "Free market is a myth",
            "title_similarity": "0.22557706",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h01t04b",
            "score": 1,
            "text": "I've always preferred digital cancer. Analogue cancer hits different.",
            "title_similarity": "0.3905573",
            "sentiment_compound": -0.8689
        },
        {
            "id": "h01t4zk",
            "score": 1,
            "text": "Kids gotta smoke something",
            "title_similarity": "0.29013348",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01tb63",
            "score": 1,
            "text": "I know that I, in my 30s can't buy from a company I used to work for 1 state away now. I'm admittedly a little miffed.",
            "title_similarity": "0.5326282",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01tl3p",
            "score": 1,
            "text": "Great, worse-smelling teenagers. Way to go SF.",
            "title_similarity": "0.42980868",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h01tm47",
            "score": 1,
            "text": "Its almost as if banning something doesn't work",
            "title_similarity": "0.14753975",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01tn1s",
            "score": 1,
            "text": "Huh. Teens don’t like being told what they can and can’t do and rebel against authority. Who could have known this?",
            "title_similarity": "0.39216807",
            "sentiment_compound": 0.296
        },
        {
            "id": "h01tnyk",
            "score": 1,
            "text": "What? You mean they got rid of the thing teens had started doing INSTEAD of smoking and they went back to smoking? Go figure...",
            "title_similarity": "0.62791896",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01ttn7",
            "score": 1,
            "text": "Its almost like we saw this happening and tried to warn against it.",
            "title_similarity": "0.24209288",
            "sentiment_compound": 0.204
        },
        {
            "id": "h01u8k2",
            "score": 1,
            "text": "Almost like we should just give people factual information and hope they make good decisions about there health. I wonder if we somehow socialized this process so that kids could talk to a real doctor about the pros (looking cool of course) and the cons of smoking.",
            "title_similarity": "0.5971541",
            "sentiment_compound": 0.8522
        },
        {
            "id": "h01u93v",
            "score": 1,
            "text": "I have a two year supply of eliquid. Hopefully somewhere along the way to 2023, we will get a compromise. Worst case, I shouldn't have issues getting massive amounts of vegetable glycerin and/or propelyne glycol, since it's in so many food products, and I'll find a source of pure nicotine, legal or otherwise. I refuse to go back to cigarettes, but nicotine saves lives. 8 years smoking, 6 years vaping.",
            "title_similarity": "0.6941682",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h01ubr5",
            "score": 1,
            "text": "That was quite literally the point of banning them...",
            "title_similarity": "0.16135241",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01ubx1",
            "score": 1,
            "text": "I’ve heard a lot of older folks say that young people don’t smoke because they think it’s gross. I live in Chicago and I’m gen z and everyone I knew that vaped just switched to cigarettes. It’s just about the nicotine. The city banned all e cigs. Ya might as well ban cigarettes as well and have everyone strung out on zyn.",
            "title_similarity": "0.655429",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h01ucjq",
            "score": 1,
            "text": "I doubt a san franciscan population has any external validity for the US...",
            "title_similarity": "0.24427615",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h01ufje",
            "score": 1,
            "text": "This was inevitable. I said so when they announced the ban. Way to drive the kids back to the cigarettes.",
            "title_similarity": "0.6565371",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h01upem",
            "score": 1,
            "text": "Just like big tobacco wanted them to. Vaping helped me kick the dipping habit, then I dropped vaping right as the campaign against vaping was just starting.  Fukk big tobacco.",
            "title_similarity": "0.6685257",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h01uqsd",
            "score": 1,
            "text": "Let San Francisco's study speak for themselves",
            "title_similarity": "0.18934989",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01uxqc",
            "score": 1,
            "text": "When will society realize that taking drugs is part of the human experience?   Any attempt at prohibition is doomed to fail.  Regulation is the absolute best that can be accomplished because people, deep down, recognize that if you aren't hurting anyone else than they should be left alone.",
            "title_similarity": "0.50259006",
            "sentiment_compound": -0.088
        },
        {
            "id": "h01v73l",
            "score": 3,
            "text": "The data this is based on was gathered before the ban was implemented. Data was was gathered 2017- spring 2019. The ban wasn’t implemented until April 2019. So there was only a short overlap.\n\nSource: my wife works in anti-tobacco policy for a well known organization, one that was heavily involved in creating this specific policy in San Francisco. So yes, I am biased, but with that said the research that went into this policy and implementation was significant.",
            "title_similarity": "0.6226126",
            "sentiment_compound": 0.1143
        },
        {
            "id": "h01vgei",
            "score": 1,
            "text": "I preemptively invested in Altria stock with this in mind. These digital cigarettes have locked in a new generation of smokers.",
            "title_similarity": "0.66355586",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01vi9m",
            "score": 1,
            "text": "My humble opinion is that if they really wanted to stunt teenage vaping they should have only allowed disgusting liquid flavours, i once tried an absinthe one mixed with a \"passionfruit\" liquid, almost made me puke and i was reticent to vape again for a couple days, only did it again because i'm a huge nicotine junkie",
            "title_similarity": "0.68838227",
            "sentiment_compound": -0.6412
        },
        {
            "id": "h01vr7m",
            "score": 1,
            "text": "I use to work in a vape shop back in 17-18(I don't remember which year exactly) but I do remember all those flavored vape ban waves. The first thing I even told my old boss was that they'll just go to cigs instead since they'll have more flavor than a flavorless vape.",
            "title_similarity": "0.64141315",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h01w13h",
            "score": 1,
            "text": "Considered the ban was lobbied by tobacco corporations who is surprised? This is what they wanted, and clueless/bribed government officials aren’t gonna think twice",
            "title_similarity": "0.5948454",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h01w2n5",
            "score": 1,
            "text": "Doesn’t Marlboro own Juul?",
            "title_similarity": "0.33490598",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01w7zp",
            "score": 1,
            "text": "what is wrong with these kids.. still smoking and vaping\n\neducated fools",
            "title_similarity": "0.49638063",
            "sentiment_compound": -0.743
        },
        {
            "id": "h01wge6",
            "score": 1,
            "text": "Life, Uh… finds a way",
            "title_similarity": "-0.050215147",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01wia1",
            "score": 1,
            "text": "Weird. It's almost as if prohibition never works.",
            "title_similarity": "0.29200217",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h01wnwj",
            "score": 1,
            "text": "Somewhere between hiring a 5 million dollar 'study' that takes 5 years and making an asinine decision without forethought, you would think the city council would counsel with at least someone or a group of \"smart people\" who could present the bad outcome of their crap decisions. Hell, they could have a debate at SF university with students participating for a 50$ starbuck card and likely have a more educated guess about the outcome.",
            "title_similarity": "0.62810296",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h01wqgw",
            "score": 1,
            "text": "Governments are always seduced by power and can't stop making laws.",
            "title_similarity": "0.2894966",
            "sentiment_compound": -0.1561
        },
        {
            "id": "h01wrrx",
            "score": 1,
            "text": "What is with this sub and posting studies resulting in the most obvious conclusions of all time.",
            "title_similarity": "0.21748248",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01wviv",
            "score": 1,
            "text": "It's no surprise. Thus same thing happens everytime there is a crackdown on any substance. People look for a replacement. Sure some will quit, but more will find something worse than the last thing, because it's accessible.",
            "title_similarity": "0.5548227",
            "sentiment_compound": -0.6003
        },
        {
            "id": "h01xcap",
            "score": 2,
            "text": "Well, maybe we should ban cigarette sales to high school aged... Oh.",
            "title_similarity": "0.6984432",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h01xkye",
            "score": 2,
            "text": "Almost like nicotine is addictive",
            "title_similarity": "0.3601723",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h01xsd8",
            "score": 2,
            "text": "Whoooa who would’ve predicted this?",
            "title_similarity": "0.07388537",
            "sentiment_compound": 0.0
        },
        {
            "id": "h01yb6n",
            "score": 1,
            "text": "The only reason flavored e liquids were targeted is because they were hurting big tobacco’s bottom line. It never had anything to do with saving the childrenz and everything to do with saving Harold from having to dip into his offshore handouts to pay for his new private jet.",
            "title_similarity": "0.5237358",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h01z2nc",
            "score": 1,
            "text": "I don't vape but i do support people's right to do so. I smoke pipe tobacco filterless in hand rolled papers. I did vape when it was cheaper but now the things I liked about it are more expensive or outright banned.",
            "title_similarity": "0.66218644",
            "sentiment_compound": 0.8201
        },
        {
            "id": "h01z48d",
            "score": 1,
            "text": "Is anyone genuinely surprised about this?",
            "title_similarity": "0.07229176",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h01zlvs",
            "score": 1,
            "text": "Who paid for this study is the question",
            "title_similarity": "0.1928789",
            "sentiment_compound": 0.0
        },
        {
            "id": "h020fnz",
            "score": 1,
            "text": "Wow who would’ve thunk",
            "title_similarity": "0.07245365",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h020vgs",
            "score": 1,
            "text": "Teenagers are dumb, I can tell you that 'cause I was one. If you stop selling antibiotics, they would probably start using everyday",
            "title_similarity": "0.69602674",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h020xmj",
            "score": 1,
            "text": "October 2nd 2019\nA date I will never forget in my life.\nThat’s the day I smoked my last cigarette and switched to vaping.\nI’m a simpleton. 90+% of the time I buy a mint flavoured juice. I’ll buy another flavour if I’m in a pinch.\n\nHuge mistake for governments to ban flavoured juice. (Any mint juices are also considered “flavours”)\n\nWhat a load of horseshit",
            "title_similarity": "0.6983239",
            "sentiment_compound": -0.465
        },
        {
            "id": "h0211ee",
            "score": 2,
            "text": "But... Teens shouldn't vape...",
            "title_similarity": "0.22346023",
            "sentiment_compound": 0.0
        },
        {
            "id": "h021egw",
            "score": 1,
            "text": "As an SF resident who voted against this and Prop 22... I tried guys. The propaganda is _strong_ especially with conservative \"liberal\" households scared of anything that decreases land value or could _possibly_ cause cancer.\n\nEDIT: or hurt the children! someone think of the children!",
            "title_similarity": "0.6068258",
            "sentiment_compound": -0.8217
        },
        {
            "id": "h022c21",
            "score": 1,
            "text": "That was the point.  People say but the tobacco companies on the cape vapes.  This is true.  But people were using the vapes to decrease their nicotine consumption and eventually quit smoking all together.  This is bad for big tobacco.  Banning vapes forces people back to fixed nicotine cigarettes and life long customers.",
            "title_similarity": "0.68622625",
            "sentiment_compound": -0.2617
        },
        {
            "id": "h022hd1",
            "score": 1,
            "text": "This sounds like the kind of thing you'd want to print if you sold cigarettes or worked for someone who does.",
            "title_similarity": "0.5334101",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h022prm",
            "score": 1,
            "text": "Anecdotal but this is definitely true. I have 3 friends that smoked cigarettes in high school, and managed to quit because of vaping.\n\nRecently my province banned the sale of vape products and subsequently those same friends went back to cigarettes. \n\nAlso my nephew who is still in high school and developed a vaping habit, now smokes cigarettes and I know his friends do too, but I’m unsure if they vaped but probably.\n\nGreat job government! Doing great things as always.",
            "title_similarity": "0.8120048",
            "sentiment_compound": 0.9814
        },
        {
            "id": "h022sxe",
            "score": 1,
            "text": "Isn’t that their whole point behind the ban??",
            "title_similarity": "0.22691019",
            "sentiment_compound": -0.6072
        },
        {
            "id": "h022v3c",
            "score": 4,
            "text": "Pretty sure smoking amongst teens was dropping befor flavoured tobacco...if anything they got hooked on flavoured tobacco and switched to a new source when there old one wasn’t available.",
            "title_similarity": "0.74541914",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h022z4n",
            "score": 2,
            "text": "My cousin went from vaping to cigs in highschool simply because they were cheaper",
            "title_similarity": "0.6799648",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02302u",
            "score": 1,
            "text": "I wish they could somehow turn vaping into something therapeutic - for asthma, anxiety, even strep throat. \n\nVaping seems like a missed opportunity. Like I know about nebulizers and other such things, but vaping is so easy. \n\nMaybe I’m being too liberal. *plz no politics*",
            "title_similarity": "0.5085924",
            "sentiment_compound": 0.7942
        },
        {
            "id": "h0234pd",
            "score": 2,
            "text": "Of course it did. Vaping got a whole new generation addicted to nicotine. Banning vaping doesn't cure them of the addiction, they will seek the drug elsewhere.\n\nIt may, however, lower the vaping and smoking rates in future years. Let's hope.",
            "title_similarity": "0.7381973",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0235kv",
            "score": 1,
            "text": "another W for big tabacoo companies",
            "title_similarity": "0.22775052",
            "sentiment_compound": 0.0
        },
        {
            "id": "h023u6u",
            "score": 2,
            "text": "I've been saying this would happen. This is just one market using legal fuckery and easy propaganda on head firmly in ass marks to kill it's competition.",
            "title_similarity": "0.36557063",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h02498v",
            "score": 2,
            "text": "And there you have it! I’ve been vaping menthol ejuice and cannot stand a cigarette after smoking for over 16 years. Change this stupid policy!",
            "title_similarity": "0.62693846",
            "sentiment_compound": -0.6792
        },
        {
            "id": "h024l3t",
            "score": 2,
            "text": "In what universe are flavored vapes banned but cigarettes aren’t? And I’m not necessarily advocating for banning either but if you’re gonna ban something make it the worse of two evils",
            "title_similarity": "0.5741878",
            "sentiment_compound": -0.9524
        },
        {
            "id": "h024s4f",
            "score": 3,
            "text": "Get the wording right. It's not the \"ban\" that led them to smoking. It's the \"flavoured vape\" that got them addicted to nicotine in the first place.\n\nIt's almost like they were targeting a younger generation by making it taste like sugar because smoking itself was a dying habit and they needed to rejuvenate the market.\n\nBy the time the bans came in, it's already too late.\n\n*Edit: spelling",
            "title_similarity": "0.7264933",
            "sentiment_compound": 0.7671
        },
        {
            "id": "h025dkj",
            "score": 1,
            "text": "Congratulations\n\nYou played yourself",
            "title_similarity": "0.14199972",
            "sentiment_compound": 0.743
        },
        {
            "id": "h025ipi",
            "score": 1,
            "text": "Well, their plan worked",
            "title_similarity": "0.058687136",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h025t2k",
            "score": 1,
            "text": "Are there any reputable studies yet on the long term effects of vaping?  I've heard anecdotes about young adults coming into the ER with severe lung damage, but has there been serious study of this?",
            "title_similarity": "0.59075296",
            "sentiment_compound": -0.5733
        },
        {
            "id": "h025zub",
            "score": 1,
            "text": "Like 12 different conspiracy theories in here, and somehow none of them are \"It didn't work as intended.\"",
            "title_similarity": "0.35362422",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0268ze",
            "score": 1,
            "text": "Banning stuff totally works guys; just look at prohibition and the drug war.",
            "title_similarity": "0.5111318",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h026ega",
            "score": 1,
            "text": "Is there a need for teens to smoke?",
            "title_similarity": "0.443918",
            "sentiment_compound": 0.0
        },
        {
            "id": "h026kl9",
            "score": 1,
            "text": "Apparently they're reading up on Abraham Lincoln and  Dianne Feinstein, too, whereas before the ban, they couldn't have cared less.",
            "title_similarity": "0.6069085",
            "sentiment_compound": -0.7124
        },
        {
            "id": "h026mpq",
            "score": 1,
            "text": "When healthcare is a commercial enterprise, prevention is not profitable.",
            "title_similarity": "0.32419062",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h026t82",
            "score": 1,
            "text": "Flavored vaping ban seemed like such a knee jerk reaction",
            "title_similarity": "0.3006782",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0277yt",
            "score": 1,
            "text": "Ahh San Francisco, the king/queen/kingqueen of unintended consequences.",
            "title_similarity": "0.22276089",
            "sentiment_compound": 0.0
        },
        {
            "id": "h027hlq",
            "score": 1,
            "text": "We should ban all Tabasco products",
            "title_similarity": "0.28585306",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h027s61",
            "score": 2,
            "text": "This government ... We need to give them more control of our lives.",
            "title_similarity": "0.21338426",
            "sentiment_compound": 0.0
        },
        {
            "id": "h027siz",
            "score": 1,
            "text": "Another W for the tobacco industry",
            "title_similarity": "0.4652242",
            "sentiment_compound": 0.0
        },
        {
            "id": "h027tjs",
            "score": 1,
            "text": "either you quit it or you dont. vaping or gum or patches is just dancing around the problem - nicotine addiction.",
            "title_similarity": "0.5439282",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h027y0m",
            "score": 1,
            "text": "What ban on flavors??? I can go down to my local vape shop and get all the candy whatever i can stand..",
            "title_similarity": "0.43623757",
            "sentiment_compound": -0.6298
        },
        {
            "id": "h0281q3",
            "score": 1,
            "text": "Now to ban cigarettes",
            "title_similarity": "0.32108632",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0286lx",
            "score": 2,
            "text": "Hold on…are high school aged kids allowed to vape and smoke in California? I thought it would be legal from 18.",
            "title_similarity": "0.688648",
            "sentiment_compound": 0.128
        },
        {
            "id": "h028vf3",
            "score": 1,
            "text": "Prohibition models never work. Never work. \n\nWhen you have an infrastructure that’s in place of operating legally and one day you ban it, the infrastructure (the availability of the product, the supply chain, the production) is STILL THERE. \n\nWe live in a hyper globalized and hyper connected world. Never believe that a ban is intended to stop anything. It can only be intended to decrease the numbers or those numbers shift elsewhere, ie. vapes to cigs.",
            "title_similarity": "0.4068087",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h02940x",
            "score": 1,
            "text": "That is the plan, isn't it?\nVape companies are big tobacco companies.",
            "title_similarity": "0.46386763",
            "sentiment_compound": 0.0
        },
        {
            "id": "h029894",
            "score": 1,
            "text": "Didn't they ban cigarettes too?",
            "title_similarity": "0.47643787",
            "sentiment_compound": 0.4449
        },
        {
            "id": "h029c2p",
            "score": 1,
            "text": "Me and the Juul devise are in a love hate relationship, I hate it because it was the reason I started vaping at a young age because I was very impressionable and mostly because of its flavors, then when the flavored pods were removed from shelves my friends and I turned to menthol cigarettes. But after a few months I started to feel the effects of smoking and how bad it was harming me so I made the switch back to the Juul, I think it saved my life and I am thankfully for that. \n\nTLDR: I would be killing myself slowly with cigs if the Juul didn’t exist, but I wouldn’t have even started smoking if the Juul didn’t exist.",
            "title_similarity": "0.73698103",
            "sentiment_compound": -0.8794
        },
        {
            "id": "h029py1",
            "score": 1,
            "text": "Not a teen, but they banned vaping altogether in india and I've have multiple friends take up smoking, including me. Most of us used to be occasional smokers or just smoked weed before.",
            "title_similarity": "0.6976853",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h029ryb",
            "score": 1,
            "text": "I was wondering why Trump attacked the vape industry. Makes sense.",
            "title_similarity": "0.382352",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h02a10n",
            "score": 1,
            "text": "I was able to get my sister from 2-3 packs a day to a vape hit every hour or so.",
            "title_similarity": "0.47603065",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02agip",
            "score": 1,
            "text": "Did they ban flavored alcohol yet?",
            "title_similarity": "0.39340568",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h02an7u",
            "score": 1,
            "text": "Like every other vice that harms so many... Don't ban it. Tax the hell out of it. You'll price those you are truly trying to protect out of the habit and kill all the arrogant idiots that can afford it. A social program that not only costs nothing, it makes money.",
            "title_similarity": "0.486795",
            "sentiment_compound": -0.7588
        },
        {
            "id": "h02assu",
            "score": 2,
            "text": "Either this is an improvements and cigarettes are better than flavored vaping, OR cigarettes should be banned as well.",
            "title_similarity": "0.6241652",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h02ax81",
            "score": 1,
            "text": "Nicotine is a hella'va drug",
            "title_similarity": "0.31730968",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02b14s",
            "score": 1,
            "text": "Cigarettes are an organic, plant based alternative to vapes",
            "title_similarity": "0.37447846",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02biu7",
            "score": 1,
            "text": "Banning flavored vape is mostly likely going to lead teens to smoke cannabis or just vape more THC content instead. Teenage cigarette smokers just also happen to make up a large proportion of cannabis smokers, and typically continue to adulthood.  How many of those that are addicted to nicotine from vaping originally became addicted to smoking cigarettes prior? What are the economic demographics for those group of people? I think those results would be more telling.",
            "title_similarity": "0.8300613",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02bnul",
            "score": 1,
            "text": "Dumb kids let them weed them selves out the gene pool",
            "title_similarity": "0.51112926",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h02c6c7",
            "score": 1,
            "text": "Maybe the bans were never about anyone's health but who pocketed the politicians wallets fat enough",
            "title_similarity": "0.57198364",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02cxxe",
            "score": 1,
            "text": "If they’ve fallen for the vaping propaganda they would’ve fallen for the tobacco propaganda as well. These teen smokers are lost causes.",
            "title_similarity": "0.7056769",
            "sentiment_compound": -0.802
        },
        {
            "id": "h02dpka",
            "score": 2,
            "text": "Just don't smoke. Simple.",
            "title_similarity": "0.0757909",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02e2ob",
            "score": 1,
            "text": "I smoke cigs at work and vape at home. I’d be a pack a day smoker without vapes",
            "title_similarity": "0.5789468",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02ejaf",
            "score": 1,
            "text": "ive seen this happen first hand :/ lately theyve just been switching to disposable vapes AND smoking cigarettes because now we have more flavor options but we’re already addicted to cigarettes",
            "title_similarity": "0.7310152",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h02elgc",
            "score": 2,
            "text": "Study ‘suggests’ their ‘odds’ of smoking cigarettes doubled? So it didn’t actually double? This kinda speculation news is bs.",
            "title_similarity": "0.76418805",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02enq2",
            "score": 1,
            "text": "I'm the dumbest person I know and even I said this is what will happen as a result of a ban on vape products. I just don't see how this wasn't obvious.",
            "title_similarity": "0.45415705",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h02esp0",
            "score": 1,
            "text": "Dr.’s favorite choice for cigarettes is Camel",
            "title_similarity": "0.43507826",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h02euza",
            "score": 1,
            "text": "Well well well how the turntables.",
            "title_similarity": "-0.027952544",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h02f1yw",
            "score": 1,
            "text": "that’s what those idiots get after banning flavored vapes when there was the completely unrelated incident with the carts and the vitamin e acetate",
            "title_similarity": "0.5118828",
            "sentiment_compound": 0.296
        },
        {
            "id": "h02fj6j",
            "score": 1,
            "text": "btw try our new Pina Colada Strawberry-Banana infused Corona sparkling seltzer. now back to the Super Bowl.\n\ngimme a fuckin break.",
            "title_similarity": "0.48815593",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h02g2g7",
            "score": 1,
            "text": "Vaping is flavors is being banned,  though marijana has been increasingly been approved for retail sales.  Its all about $$$.   If it nicotine we do not want our kids to have,  sell without nicotine.   Vape shops do create jobs.",
            "title_similarity": "0.7010838",
            "sentiment_compound": 0.1724
        },
        {
            "id": "h02g9co",
            "score": 1,
            "text": "It's been a while since I looked into this but have we come to an actual conclusion weather vape is healthier then smoking tobacco?",
            "title_similarity": "0.6419245",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02gdxe",
            "score": 1,
            "text": "People who can't drink wine more likely to drink beer.\n\nScience at 11.",
            "title_similarity": "0.6175258",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02gh5a",
            "score": 2,
            "text": "bro, just don't vape and smoke, it's that ez",
            "title_similarity": "0.17775321",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h02gqyr",
            "score": 1,
            "text": "Tobacco companies can suck a fat ass butthole.",
            "title_similarity": "0.47625035",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h02gr16",
            "score": 2,
            "text": "What a completely useless article, not mentioning the data at all? Did it increase from 1% to 2% 4 to 8? 16 to 32? It's kind of mandatory information when writing an article like this. What a complete waste of bytes.",
            "title_similarity": "0.4338842",
            "sentiment_compound": -0.3871
        },
        {
            "id": "h02gt51",
            "score": 1,
            "text": "Oh wow. Who would have seen that coming, after they ban the safer alternative to smoking…. How can this obvious move to ban vaping in order to get the tobacco company’s profits back on track, by putting profit above people’s health, not be an illegal act?  Either the government are idiots or they believe the rest of us are ..",
            "title_similarity": "0.6457064",
            "sentiment_compound": 0.7978
        },
        {
            "id": "h02h5xo",
            "score": 1,
            "text": "Let's all remember these kids where already nicotine addicts. The odds where against them quitting in the first place. The better judge of the bans effectiveness are new smokers.",
            "title_similarity": "0.768451",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h02i6kw",
            "score": 1,
            "text": "Congratulations. You played yourself",
            "title_similarity": "0.1339655",
            "sentiment_compound": 0.743
        },
        {
            "id": "h02ib7c",
            "score": 1,
            "text": "Maybe keep vapes and bam cigarettes? Or even better make all drugs legal to help taper people off or at lease keep everyone clean with needles and uncut substances",
            "title_similarity": "0.5855986",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h02j6fq",
            "score": 1,
            "text": "Flavoured vaping should have never been allowed.",
            "title_similarity": "0.29842356",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02j7vj",
            "score": 1,
            "text": "It's a wonder they couldn't see this happening. Or maybe they just didn't care.",
            "title_similarity": "0.26287243",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h02jfer",
            "score": 1,
            "text": "This is apropos. I'm in NY and I occasionally have get togethers with my friend from high school (we're all in our 30s). About half of us don't smoke and the others do. But, at these events, we all end up smoking.\n\nAfter the past year of no get togethers and no smoking, we're having another one. I wanted a flavored vape so that I wasn't tempted to have a cigarette.\n\nAfter searching around online for flavored vapes with 0% nicotine (which are still legal in NY) to be delivered, none delivered.\n\nI texted a guy I know who owns a local vape shop and asked him if he sold flavored vape with no nicotine. He said yes, but it's frowned on and basically a loophole in the law.\n\nIt is easier to buy a pack of cigarettes than a safer alternative. I'm not saying vapes are harmless, but it's unequivocally less harmful than smoking cigarettes.",
            "title_similarity": "0.8126105",
            "sentiment_compound": 0.836
        },
        {
            "id": "h02jjrw",
            "score": 1,
            "text": "Smoking and drug taking is also glorified in tv shows but I got news for you it’s not cool and you stink",
            "title_similarity": "0.50079775",
            "sentiment_compound": -0.5917
        },
        {
            "id": "h02jka5",
            "score": 1,
            "text": "When are we going to learn that prohibition doesn't work?",
            "title_similarity": "0.33935755",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02k3o0",
            "score": 1,
            "text": "You can lead the horse to water but you can’t make it drink.",
            "title_similarity": "0.2140106",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02kgkb",
            "score": 1,
            "text": "As with every single thing in this country where the richest people are involved, “Hi. I’m with the government and I’m here to help”",
            "title_similarity": "0.28111407",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h02krry",
            "score": 1,
            "text": "Prohibition does not work, it did not work, it will never work.",
            "title_similarity": "0.14900802",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02l914",
            "score": 1,
            "text": "Remember the symptoms easily the same symptoms as covid but before they told us about covid",
            "title_similarity": "0.39369467",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h02lg7g",
            "score": 1,
            "text": "It's almost like if you get people addicted to a drug and then take it away they looks for less safe, more harmful, and easier to get alternatives! Who knew!!!",
            "title_similarity": "0.54034173",
            "sentiment_compound": 0.842
        },
        {
            "id": "h02lh5s",
            "score": 1,
            "text": "It's almost like vaping got them hooked on Nicotine.",
            "title_similarity": "0.5290799",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h02mbav",
            "score": 1,
            "text": "Sounds right. They are addicted to nicotine, not vaping.",
            "title_similarity": "0.4662019",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02mv7m",
            "score": 1,
            "text": "How do we attack and repair the addictive human nature? Where the hell did it come from? I was lucky enough to quit smoking 10 years ago, but I still want to sometimes. \n\nHopefully we find a way to snub these predatory companies out like an old cigarette butt.",
            "title_similarity": "0.67561436",
            "sentiment_compound": 0.5803
        },
        {
            "id": "h02n9ca",
            "score": 1,
            "text": "Can you believe it. We got kids hooked on a drug and took it away and they found a other means of getting the drug. That's never even happened!",
            "title_similarity": "0.53851676",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02ng7n",
            "score": 1,
            "text": "Law of Unintended Consequences",
            "title_similarity": "0.015360877",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02o256",
            "score": 1,
            "text": "What if we get rid of cigarettes as well, not only because they are harmful to those smoking them, they are harmful for those around as well.",
            "title_similarity": "0.51771104",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h02o9jj",
            "score": 1,
            "text": "If people start off vaping flavored nicotine and it gets banned, it makes sense they will move to cigarettes. It’s amazing they can ban flavored nicotine but not nicotine in general.",
            "title_similarity": "0.6818149",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h02ongx",
            "score": 1,
            "text": "Who cares? Doesn't that prove that flavored vapes were attracting children to smoke cigarettes. Also logic dictates less teens will be likely to smoke cigarettes in the future or if they do to continue doing so.",
            "title_similarity": "0.7917849",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h02oq7c",
            "score": 1,
            "text": "Oddly enough, flavour isnt enough of a vector to entice kids.",
            "title_similarity": "0.26789743",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02orlw",
            "score": 1,
            "text": "It's like nicotine is addicting or something",
            "title_similarity": "0.38345268",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h02p38f",
            "score": 1,
            "text": "Big tobacco lobbied for it. Are we surprised?",
            "title_similarity": "0.44108358",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h02pfx0",
            "score": 1,
            "text": "Banning a substitute of smoking leads to more people smoking?\n\nOMG WHO COULD HAVE KNOWN?!",
            "title_similarity": "0.6687616",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02pkv9",
            "score": 1,
            "text": "Random moron: We should ban vapping because there are no data about long term consequences.\n\nAlso random moron: HOW DARE YOU NOT GETTING THE PHASE 3 COVID VACCINE?!?!?!!!111!!1!1!",
            "title_similarity": "0.42155632",
            "sentiment_compound": -0.9314
        },
        {
            "id": "h02pr43",
            "score": 1,
            "text": "Well, I’m going to go against the apparent mood here.\n\nTo begin with, the article title is potentially misleading on the magnitude of the ban’s effect. Potentially.\nI don’t know the numbers here, but in general statistics have to be carefully put in context before trying to come to conclusions. A “doubling” in the use of cigarettes sounds like a lot, but in practice it may amount to an increase of 1%->2% of the population, in face of a much more significant reduction in vape use, and more importantly in its future adoption rates (which also means the number of people switching from vaping to smoking will fall over time).\n\nPersonally, I’m a non smoker, non drinker, pro individual choice and drugs legalization, and with a strong antipathy towards both smoking and vaping.\n\nThe latter is because all the industry wants is to give to as many young people possible an useless, expensive and potentially unhealthy addiction, for as long as possible.\n\nThe teenagers who 30 or so years ago picked up smoking got a raw deal. They started for social reasons an habit that was at the onset unpleasant, got addicted, lost money and health on it over time, and in the end they went from being seen cool to outcast for it.\nVaping could well follow the same trajectory, or a similar enough one.\n\nIn general, the problem is people giving themselves an undesirable addiction for social reasons. That’s stupid and not something that should be encouraged.\n\nSure, for a smoker, switching to vaping could be a benefit.\nBut trying to get a whole new generation addicted to nicotine, a generation that would otherwise for the most part not have picked up smoking? That’s a vile business.",
            "title_similarity": "0.7104292",
            "sentiment_compound": 0.1101
        },
        {
            "id": "h02pt3v",
            "score": 1,
            "text": "Vapes in general are leading kids to cigarettes. They’re starting to get more expensive than tobacco so when they find out that their flavored stuff is banned they’re going to the real thing for cheaper",
            "title_similarity": "0.76641",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h02qgb9",
            "score": 1,
            "text": "There are a lot of comments in here talking about how vaping has helped them quit smoking. Congrats son that :) my twin also qjit smoking recently and I know it was very difficult for him.\n\nAs far as the topic at hand; I'm a bit disappointed with the outcome as well. I work for public health and I understand the idea behind it. The issue, I think, is not with the flavours, but the accessibility to teens. My youngest brother has been smoking a vape since he was 17. Him and all his highschool friends would often brag about the nicotine content in their product.\n\nI never understood it. One of his friends once said \"one drag of this is the equivalent of a whole cigarette\".",
            "title_similarity": "0.7719004",
            "sentiment_compound": 0.8706
        },
        {
            "id": "h02qmh8",
            "score": 1,
            "text": "Brother in law is 18. Vaped first in high school, then started at a factory where all his coworker smoke. He cant get vape juice anymore because its harder than getting a pack of darts from a friend, so he smoles now",
            "title_similarity": "0.6487593",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h02vfta",
            "score": 1,
            "text": "prohibition doesn't work\n\n*Shocked Pikachu*",
            "title_similarity": "0.27559376",
            "sentiment_compound": 0.2411
        },
        {
            "id": "h02w2hc",
            "score": 1,
            "text": "The next time someone tells you that something is dangerous, without a study to back it up, question it. It’s the only defense we have against people, who are trying to be good people and reality, which they hate.",
            "title_similarity": "0.37708586",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h02w3qx",
            "score": 1,
            "text": "So... smoking is a gateway drug to smoking.\n\n[I see.](https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse3.mm.bing.net%2Fth%3Fid%3DOIP.5BzXrpgadHtcmKWCTLORmwHaEK%26pid%3DApi&f=1)",
            "title_similarity": "0.5287639",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02x6jx",
            "score": 1,
            "text": "Woah, this is truly insane and completely unexpected!",
            "title_similarity": "0.0008139834",
            "sentiment_compound": 0.126
        },
        {
            "id": "h02xzpg",
            "score": 1,
            "text": "So they’re addicted to the nicotine then?",
            "title_similarity": "0.4592551",
            "sentiment_compound": 0.0
        },
        {
            "id": "h02y0sh",
            "score": 2,
            "text": "Gee. Who could have possibly seen that coming?\n\nCertainly not the huge industry that was fanatically pushing the anti-vaping lobby...",
            "title_similarity": "0.37164992",
            "sentiment_compound": 0.1376
        },
        {
            "id": "h032aab",
            "score": 1,
            "text": "This is why we need to follow the *science*. Listen to the experts, not reactionary politicians.",
            "title_similarity": "0.20451042",
            "sentiment_compound": 0.0
        },
        {
            "id": "h03317b",
            "score": 1,
            "text": "Just as oxy pushed people into heroin when they no longer could get it.",
            "title_similarity": "0.526443",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h0354d6",
            "score": 2,
            "text": "This is all according to plan for tobacco lobbyists. How could this be any more transparent? How on earth does removing the ability to make a less damaging choice \"protect\" people?",
            "title_similarity": "0.5443508",
            "sentiment_compound": 0.2475
        },
        {
            "id": "h03am92",
            "score": 1,
            "text": "Knew this would come, should have let progress happen as it was happening, with a drop in teen smoking \n\nNow it will reverse, and children will start smoking tobacco again",
            "title_similarity": "0.71348435",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h03u1ml",
            "score": 1,
            "text": "We just need a ban on cigarettes. There’s no reason for them. Zero reason.",
            "title_similarity": "0.3211727",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h03uskq",
            "score": 1,
            "text": "maybe in the short term, but I’d bet they do better numbers in a few years. Flavored vapes were always intended to get kids hooked on nicotine.",
            "title_similarity": "0.7317885",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h03wxcz",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.011691518"
        },
        {
            "id": "h040yae",
            "score": 1,
            "text": "Its almost as if banning things doesn't stop people from doing it, and people are probably going to smoke for eternity?",
            "title_similarity": "0.5428804",
            "sentiment_compound": 0.2235
        },
        {
            "id": "h043loq",
            "score": 1,
            "text": "They should've just left it the hell alone and stop this witch hunt on anything smoking related.",
            "title_similarity": "0.39527857",
            "sentiment_compound": -0.8928
        },
        {
            "id": "h04721y",
            "score": 1,
            "text": "In other words, kids are going to experiment and rebel  no matter how hard society tries to put dangerous vices out of reach.",
            "title_similarity": "0.3925233",
            "sentiment_compound": -0.6217
        },
        {
            "id": "h048ogd",
            "score": 1,
            "text": "I’m glad I quit smoking as a college student 13 years ago before all this vaping nonsense.",
            "title_similarity": "0.66516936",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0496f4",
            "score": 1,
            "text": "Just like the war on drugs, outlaw one thing and it creates a even bigger problem down the road. Way to go government!",
            "title_similarity": "0.4256693",
            "sentiment_compound": -0.5093
        },
        {
            "id": "h04hxog",
            "score": 1,
            "text": "Its almost like we should ban nicotine all together",
            "title_similarity": "0.38188046",
            "sentiment_compound": -0.3384
        },
        {
            "id": "h04ihe8",
            "score": 1,
            "text": "Who could have possibly ever seen it coming that banning the tool which has done more to reduce smoking than anything else in history would lead to more smoking?",
            "title_similarity": "0.6754544",
            "sentiment_compound": 0.0
        },
        {
            "id": "h054b32",
            "score": 1,
            "text": "Like we didn’t see this happening.",
            "title_similarity": "0.08164036",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h055s2b",
            "score": 1,
            "text": "Which is more destructive to one’s health?",
            "title_similarity": "0.1709052",
            "sentiment_compound": -0.6478
        },
        {
            "id": "h06d3bm",
            "score": 1,
            "text": "Where is this ban? There's no sign of it in the UK and I quit smoking and got down to 0% nicoteen on vaping. I think vaping is a really useful option.",
            "title_similarity": "0.6020037",
            "sentiment_compound": -0.5035
        },
        {
            "id": "h06vltn",
            "score": 1,
            "text": "So I’m other words everything’s going according to plan",
            "title_similarity": "0.024903353",
            "sentiment_compound": 0.0
        },
        {
            "id": "h077ua4",
            "score": 1,
            "text": "Yeah, so banning menthols is not going to make smokers quit. \n\nIt's just going to make smokers pissed off. \n\nI have to drive 10 miles to buy menthols. I hate driving. But I still go. Or I walk to the market and buy regular cigarettes and get cranky. \n\nI'll quit when I want. I know it's bad, but it's stubbornness and refusal to go on pharmaceutical meth for adhd. Yeah, dexadrene and Adderall. You crazy.",
            "title_similarity": "0.6280889",
            "sentiment_compound": -0.891
        },
        {
            "id": "h07bsa5",
            "score": 1,
            "text": "Has Noone learned from prohibition?",
            "title_similarity": "0.42182618",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3dkqq2",
            "score": 1,
            "text": "Why can't the government just forbid vaping and cigarette companies from using nicotine in their products?",
            "title_similarity": "0.48333097",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hhoogzd",
            "score": 1,
            "text": "Who would have guessed big tobacco would lobby against something that reduces the use of cigarettes.",
            "title_similarity": "0.6124825",
            "sentiment_compound": 0.0258
        }
    ]
}