{
    "Conservatives more susceptible than liberals to believing political falsehoods, a new U.S. study finds. A main driver is the glut of right-leaning misinformation in the media and information environment, results showed.\n": [
        {
            "id": "h0ca8w6",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.6037462",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h0cooah",
            "score": 4,
            "text": "This I can believe.  Right wing media is thoroughly compromised by grifters and foreign agents.  It’s not that this couldn’t or doesn’t happen on the left, but the right has a real problem with it and I think it’s a major problem for them long term.  The worse the misinformation gets, the less capable they becoming of doing things competently.",
            "title_similarity": "0.8019538",
            "sentiment_compound": -0.9132
        },
        {
            "id": "h0cqgi9",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0ciphh",
            "score": -3,
            "text": "And in other studies, rain causes wet roads.",
            "title_similarity": "0.32919434",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0cvaxm",
            "score": -5,
            "text": "I want a study that shows how much of online arguments that argue about \"both sides\" or \"nuance\" are done so in defense of the right.\n\nFor example, these comments.",
            "title_similarity": "0.5628902",
            "sentiment_compound": -0.4627
        },
        {
            "id": "h0cq1zd",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0cqkjb",
            "score": -27,
            "text": "[deleted]",
            "title_similarity": "0.11788292"
        },
        {
            "id": "h0cf59a",
            "score": 15,
            "text": "This isn't a new discovery. Back in the early days of clickbait and ad warfare, people figured out they could make alot more money with pizzagate than with any fabrication about cons.",
            "title_similarity": "0.608677",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0cm5f2",
            "score": -13,
            "text": "Not scientific. There's just as much left leaning misinformation if not more.",
            "title_similarity": "0.50709796",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0crqc1",
            "score": -49,
            "text": "Most of the people in this thread are so dumb they don't realize they just were suspectable to a political falsehood. Statistically speaking both sides would probably fall around the same area of suspectablity",
            "title_similarity": "0.6946249",
            "sentiment_compound": -0.6418
        },
        {
            "id": "h0cmp5b",
            "score": 38,
            "text": "Of course all of us are susceptible to misinformation (many of the pre-pandemic anti-vaxxers were liberals, for example.) \n\nThe big difference is that there is a *massive*, organized machine delivering a steady and overwhelming amount of right-wing propaganda to people who are both scared and armed to the teeth. \n\nWe desperately need to teach thinking skills and rational thought in schools (such as how to identify logical fallacies) if western-style democracy is to survive.",
            "title_similarity": "0.7480401",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h0d6ghu",
            "score": -2,
            "text": "Conservatives are also more supportive of less-education and anti-critical thinking skills.",
            "title_similarity": "0.6864575",
            "sentiment_compound": 0.3597
        },
        {
            "id": "h0ctkjp",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0d29di",
            "score": -10,
            "text": "somebody please show me the liberal equivalent of q anon.",
            "title_similarity": "0.41989744",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0cngk0",
            "score": 12,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0d3mct",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0d7e9z",
            "score": -5,
            "text": "Amazing what a good education  will.do to critical thinking  and the ability  to research a topic properly.",
            "title_similarity": "0.4182346",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h0crs3t",
            "score": -12,
            "text": "Is this headline just a trap to ensnare liberals? Does that give me political leanings away\n\nEdit..... because I don’t believe things I read right away....",
            "title_similarity": "0.77679086",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0cv5oi",
            "score": 47,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dc2fz",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0cxc95",
            "score": -13,
            "text": "\\*Looks at last 4 years, specifically the latter half of last year*\n\nGeeeee!  Ya think?!",
            "title_similarity": "0.27443594",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d8mq9",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0cbp77",
            "score": 18,
            "text": "Full article in Science Advances: https://advances.sciencemag.org/content/7/23/eabf1234",
            "title_similarity": "0.30637267",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d8fjm",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.11788292"
        },
        {
            "id": "h0cuv7d",
            "score": 67,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0d3fpf",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dc5mt",
            "score": 2,
            "text": "Conservatives have Q on their side so this makes sense.",
            "title_similarity": "0.5604508",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0cej8f",
            "score": 25,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dcoxe",
            "score": 3,
            "text": "Well this goes along with the study that extremely conservative people have lower IQs and are less educated.",
            "title_similarity": "0.6356513",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0crhqz",
            "score": -14,
            "text": "Let’s not discount the dumb as dogshit factor that leads one to believe in conservative scams past the age of 12.",
            "title_similarity": "0.64263916",
            "sentiment_compound": -0.2728
        },
        {
            "id": "h0ctquj",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0cfmqf",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0cv757",
            "score": 8,
            "text": "This is an example of how to waste resources for a study. This is truly useless information, and it only exacerbates the divisions between both parties. It’s the equivalent of an eight yr old child pointing at someone else on the playground and saying they’re dumb. It’s truly nothing more than bullying. Man, stuff like this just upsets me. Both sides are guilty of it too. I saw another study the other day that said conservatives were more likely to be open to opposing ideas, implying liberals were indoctrinated. \n\nJust dumb. Let’s solve real problems, not make them worse.",
            "title_similarity": "0.68722934",
            "sentiment_compound": -0.4393
        },
        {
            "id": "h0d6gvv",
            "score": 1,
            "text": "The main driver is hate.",
            "title_similarity": "0.4566376",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0d7bfy",
            "score": 1,
            "text": "In similarly shocking news, new study finds water to be wet.",
            "title_similarity": "0.45636067",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0d0vym",
            "score": 2,
            "text": "The media takes advantage of the high anxiety the left has and the low tolerance of the right to dictate them",
            "title_similarity": "0.734362",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h0cv8cd",
            "score": 10,
            "text": "These studies are nonsense. They amount to \"people with different ideologies are hyperbolic about different things.\" And semantics nit picking about the language people use.",
            "title_similarity": "0.5695696",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0dbziv",
            "score": 6,
            "text": "This is a failure to identify the crux of the problem and writing an article to try and explain the effects.\n\n\nI would argue that the media isn't the cause of the higher levels of conservative manipulation, but a symptom. At the heart of it is early and constant religious indoctrination, which just so happens is greater on the conservative side. \n\n\n\n\nOne universal thing common to all organized religions is the forced compliance to never challenge, question, and to believe ridiculous BS having to do with their dogma. \n\n\n\n\nWith most religions, being a baby killer isn't a blocker for spiritual advancement. The true ultimate unforgivable sin is simply not believing.\n\n\n\n\nThis forced acceptance manifests to motivate people to believe what they are told and not to question, especially if they are being told by their religious leaders.\n\n\n\n\nThe media just capitalizes on this human characteristic and more manipulation is pushed to the conservative side of the political spectrum because they won't be as likely to challenge.\n\n\n\nOnly real way of battling this is to have mandatory critical thinking classes throughout all levels of education and to remove all influences of cults from school and government.",
            "title_similarity": "0.6673291",
            "sentiment_compound": -0.9421
        },
        {
            "id": "h0cw3h0",
            "score": 50,
            "text": "Hahahaha conservative news was right about lockdowns being bad for people, pcr testing causing false positives, sunlight being good, ivermectin having good results, surfaces being constantly wiped with chemicals being unnecessary, even just entertaining the thought of the virus being man made and possibly coming from Wuhan lab. Kudos to CBS for questioning gates and pushing back on blindly pro vaccine agendas but....this sub has always been pure propaganda and it's hilarious how these peer reviewed studies continue to show how wrong the majority of the media has been and you guys are still regurgitating medical information fed to you from news corporations owned by white old men in the bildeberg group...look outside your algorithm that is reinforcing your terrible opinion.",
            "title_similarity": "0.7053292",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h0cbvwe",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dgstf",
            "score": 3,
            "text": "So how come we have Millions of hard left indoctrinated snowflakes out there, running around like angry, blind chickens?",
            "title_similarity": "0.42029393",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h0dhtmd",
            "score": -4,
            "text": "I believe a \"main\"  driver is that liberals have something called empathy and can see things from the other side.",
            "title_similarity": "0.63670814",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d97i4",
            "score": 2,
            "text": "And no one was shocked. Studies like this come out over and over again. Conservatism would probably be considered a mental pathology if it weren't near half of people.",
            "title_similarity": "0.5615901",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0csdp8",
            "score": -15,
            "text": "Been saying it for years, hell, maybe over a decade. The claim liberals get the same misleading info as conservatives is objectively wrong. The problem for that claim is that liberals have thousands of outlets to get their info. Because according to a conservative, anything outside of right wing news is compromised. Which basically amounts to the entirety of worldwide journalism outside the bubble. Liberals don't have limits on where they can get info. They get a variety of sources, voices, and topics. \n\nConservative news on the otherhand is a truly bizarre reinforced bubble of information. Repetitious and periodically tells those who follow it to not check any other source and that they are the only place reporting on this topic. If you go between conservative outlets you will find the information as damn near word for word between 2 conservative sites, they have no variation in voices, and that's purposeful. On top of that, they also actively discourage their viewers from thinking of differing viewpoints or to think deeper about the topic than what they tell them. This is not the case when you look at the rest of news outside the right wing bubble.",
            "title_similarity": "0.80384773",
            "sentiment_compound": -0.9442
        },
        {
            "id": "h0dfisp",
            "score": 0,
            "text": "It’s because most of them believe in a sky man who watches everything we do.",
            "title_similarity": "0.40629834",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0djmf5",
            "score": 1,
            "text": "And this was in no way a study paid for by entities wanting to create a specific confirmation bias.....",
            "title_similarity": "0.3902102",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0eds6c",
            "score": 0,
            "text": "It took a scientific study to identify the obvious?",
            "title_similarity": "0.41774678",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0cungg",
            "score": -10,
            "text": "There needs to be a \"noshitsherlock\" sub. So many of these study outcomes are not even remotely surprising.",
            "title_similarity": "0.39507812",
            "sentiment_compound": -0.2057
        },
        {
            "id": "h0d9clk",
            "score": 8,
            "text": "I’m going to be too lazy to read the actual paper but I doubt this was a fair study. It’s very likely personal bias caused the researchers to fail to ask appropriate questions. \n\nExample did covid escape from a lab? Obviously a conservative talking point as we all know… until recently when it’s being reinvestigated. \n\nDo transgender athletes have an advantage? Another conservative talking point where “the science is settled” except MtF still have a 12% speed advantage when they qualify for sports \n\nSo like I said I doubt this paper passes muster. Science might side with liberals but that means liberals are inadvertently introducing their own biases on occasion",
            "title_similarity": "0.7463474",
            "sentiment_compound": -0.2485
        },
        {
            "id": "h0d4gz3",
            "score": 29,
            "text": "Wow...such sample size. What unbiased science.",
            "title_similarity": "0.33154297",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0cj4bc",
            "score": 93,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0cwqkx",
            "score": 19,
            "text": "So ironic that this was posted to a left-leaning misinformation sub",
            "title_similarity": "0.44819525",
            "sentiment_compound": -0.4754
        },
        {
            "id": "h0cxqkb",
            "score": 7,
            "text": "New study that assume all left wing news is truth.",
            "title_similarity": "0.5057109",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0cw08w",
            "score": 1,
            "text": "Then why does this sub exist - because it’s full of leftys sniffin their own farts. Is this not media?",
            "title_similarity": "0.48714426",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0cw5gh",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0edsup",
            "score": -2,
            "text": "¯\\\\_(ツ)_/¯ Tell us something we didn’t know.",
            "title_similarity": "0.39568353",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0czmlt",
            "score": 2,
            "text": "My sense is that the sample of stories used in the research will shift in political tone over time.  For example, after 9/11 there was a movement of truthers who were often left/liberal.  During the Obama administration white supremacists began formulating the Q nonsense via the birther narrative. \n\nIt might be more fair to say conservatives tend to believe falsehoods now.  To be retested in 4 years.",
            "title_similarity": "0.7532313",
            "sentiment_compound": -0.2748
        },
        {
            "id": "h0dgkng",
            "score": 1,
            "text": "In other unrelated news, liberals still think Hunters laptop is Russian disinformation.",
            "title_similarity": "0.679041",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d0v37",
            "score": 1,
            "text": "\n\"Misinformation\".\n\nYeah what kind of misinformation would that be.  Its usually very specific.",
            "title_similarity": "0.4291353",
            "sentiment_compound": -0.4005
        },
        {
            "id": "h0cjhun",
            "score": 26,
            "text": "[deleted]",
            "title_similarity": "0.11788292"
        },
        {
            "id": "h0cuk2e",
            "score": -3,
            "text": "This is an ironic article.",
            "title_similarity": "0.34699672",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0dp0er",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0cuauh",
            "score": 6,
            "text": ">We’re sorry about suppressing facts and calling people who believed COVID came from China racists. Let’s make it better by poking fun of the people you don’t like so you conveniently forget about what we did as more than five million died.",
            "title_similarity": "0.68087757",
            "sentiment_compound": -0.2177
        },
        {
            "id": "h0d7f48",
            "score": 7,
            "text": "I'd love to know the political affiliation of the \"researchers.\" The two examples given seem pretty controversial.",
            "title_similarity": "0.72889745",
            "sentiment_compound": 0.765
        },
        {
            "id": "h0d2b7a",
            "score": -1,
            "text": "While they scream \"can't trust the media\" they're shoveling the right propaganda down their throats.",
            "title_similarity": "0.65733814",
            "sentiment_compound": -0.7508
        },
        {
            "id": "h0d64g2",
            "score": 0,
            "text": "Your telling me that there aren't Jewish space lasers starting forest fires?!",
            "title_similarity": "0.36127412",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ddsy1",
            "score": 1,
            "text": "That's plainly obvious but nice to have data on it.\n\nI mean if trump/qanon wasn't proof enough you're in denial",
            "title_similarity": "0.5920966",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h0dhpab",
            "score": 1,
            "text": "If only conservatives believed in scientific studies over Facebook posts we could've used this.",
            "title_similarity": "0.68712884",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dlg2o",
            "score": 32,
            "text": "Hey this is a science sub not a jerk of a certain party sub please leave and take politics with you",
            "title_similarity": "0.46089122",
            "sentiment_compound": 0.7867
        },
        {
            "id": "h0dcrk5",
            "score": 0,
            "text": "Wasn’t there a thing about people with a conservative mindset being more likely to have a low  intelligence anyway?",
            "title_similarity": "0.62813514",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0dingx",
            "score": -3,
            "text": "Man the irony of this is conservatives won't believe this one bit.",
            "title_similarity": "0.622013",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0d79p6",
            "score": -5,
            "text": "Knew that already but glad to have more proof to shove in their faces",
            "title_similarity": "0.4271589",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0d8n5f",
            "score": 5,
            "text": "And the study based whats true or not based on left-leaning fact check sites... ya im gona pass on this",
            "title_similarity": "0.4684915",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0chfme",
            "score": 41,
            "text": "[removed]",
            "title_similarity": "0.0965688"
        },
        {
            "id": "h0d4u2p",
            "score": 71,
            "text": "I don't vote.\n\nThat said, this subreddit bashes conservatives constantly.",
            "title_similarity": "0.60025156",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0e3o5p",
            "score": 0,
            "text": "Wasn’t there just a Bill Maher episode talking exactly about how the left is so out of touch with the scientific reality of COVID?  Hmmmmm.",
            "title_similarity": "0.5605421",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0cv9b3",
            "score": 27,
            "text": "I move that r/science  be renamed r/propaganda  since 90% of its stories are political propaganda masquerading as science",
            "title_similarity": "0.56040573",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0cve00",
            "score": -6,
            "text": "Literally unbelievable",
            "title_similarity": "0.16986832",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0ebfyz",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.11788294"
        },
        {
            "id": "h0dkkv1",
            "score": 4,
            "text": "I mean these are the same people who think you can cut, cut, cut taxes and then wonder why their country never does anything remarkable anymore.",
            "title_similarity": "0.572724",
            "sentiment_compound": -0.8033
        },
        {
            "id": "h0dejmt",
            "score": 6,
            "text": "Why do people keep posting politics in r/science?",
            "title_similarity": "0.5398601",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d2az3",
            "score": 41,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0cp2yq",
            "score": -26,
            "text": "I'm going to post a link to this article every time I interact with a conservative online for the rest of my life.",
            "title_similarity": "0.30934322",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ceaqw",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0cvtg5",
            "score": 8,
            "text": "If you think ignorant conservatives are a PITA, hang with an insufferable liberal sometime...",
            "title_similarity": "0.7455528",
            "sentiment_compound": -0.7378
        },
        {
            "id": "h0d03rr",
            "score": 3,
            "text": "At some point something has to snap with these people. I realize we’re all susceptible, but the Conservative party spent decades denying climate change. It was all lies. How are they not losing people over this? When someone realizes that climate change is real they shrug and just keep believing the rest of the lies.",
            "title_similarity": "0.7362877",
            "sentiment_compound": -0.6339
        },
        {
            "id": "h0dfglw",
            "score": 2,
            "text": "Also, they are stupid, almost by definition.  Conservatism doesn't accept new ideas.",
            "title_similarity": "0.51736975",
            "sentiment_compound": -0.6792
        },
        {
            "id": "h0d0rcj",
            "score": 21,
            "text": "If you lean heavy on either side you are susceptible to believing political falsehoods. We need a little bit of both to receive all the attributes we look to achieve",
            "title_similarity": "0.7272478",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0cqcuc",
            "score": 38,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0eguth",
            "score": 0,
            "text": "I’d wager that conservatives also believe in religion more than liberals on average and that stuff is all falsehoods and misinformation.",
            "title_similarity": "0.8337529",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0eufxa",
            "score": 0,
            "text": "The answer is simple the type of person that tends to lean conservative is also more stupid than the average person",
            "title_similarity": "0.6827785",
            "sentiment_compound": -0.5709
        },
        {
            "id": "h0ftawy",
            "score": 0,
            "text": "Part of the problem is that rightwingers tend to trust anecdotal evidence (even if its made up).",
            "title_similarity": "0.5512066",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h0g14qa",
            "score": 0,
            "text": "Shocked to hear such a thing about a party that vilifies education and science.",
            "title_similarity": "0.55277133",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h0eao4n",
            "score": 17,
            "text": "This is just the straight up propaganda subreddit now.",
            "title_similarity": "0.3181551",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0cz221",
            "score": 2,
            "text": "Main drivers are motivated by hate and their worshiping power hierarchies.",
            "title_similarity": "0.57050633",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0dd92e",
            "score": -3,
            "text": "Conservative are easily fooled, you can say it it's okay truth hurts.",
            "title_similarity": "0.64174557",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0d47v4",
            "score": 0,
            "text": "Don’t forget that the right tends to be more religious overall, so story and falsehoods can easily become gray.",
            "title_similarity": "0.6772467",
            "sentiment_compound": 0.128
        },
        {
            "id": "h0d6erv",
            "score": -1,
            "text": "Tell us something we didn’t know.",
            "title_similarity": "0.22487576",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d6sq2",
            "score": -1,
            "text": "It would be interesting to see all of the questions and how they were asked.  The Uranium One example shows how easily it is to slightly change the wording to make a statement “false”.",
            "title_similarity": "0.53186584",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0d8653",
            "score": -1,
            "text": "I don't think a study was necessary for this deduction.",
            "title_similarity": "0.23986581",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0e70q2",
            "score": 1,
            "text": "The two greatest political right/left conspiracy theories of the 21st century were believed by liberals and not conservatives. These studies are a joke.",
            "title_similarity": "0.77505016",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0eu5hz",
            "score": 1,
            "text": "You have to be stupid to vote for Donald trump",
            "title_similarity": "0.63687557",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0d006b",
            "score": 11,
            "text": "Has a study ever been performed on whether or not religious indoctrination predisposes people to believing other claims without evidence?  Considering the propensity for conservatives to also be religious, I've always wondered if there's an actual connection.\n\nI can 100% say, anecdotally, that that was the case for me.  When I went to college and learned about empirical evidence, I started to question things I'd always believed, including the big one: Christianity.\n\nEdit: There were other factors that led there too, such as moving away from my conservative home town, and being surrounded by people from other cultures (I joined the military).",
            "title_similarity": "0.64570826",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0e9l8b",
            "score": 8,
            "text": "Source: liberal scientists.",
            "title_similarity": "0.46905956",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d14lv",
            "score": -8,
            "text": "Also, all available evidence suggests that they are just plain less intelligent.",
            "title_similarity": "0.41837344",
            "sentiment_compound": 0.4033
        },
        {
            "id": "h0cmpf0",
            "score": 5,
            "text": "On the whole I don’t think it’s an issue of gullibility. The issue is when your world view doesn’t align with the reality around you then you’re going to be far more likely to “believe” the falsehoods that DO align with your worldview.",
            "title_similarity": "0.6654439",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h0d31f8",
            "score": 4,
            "text": "Sounds like something a liberal would write.",
            "title_similarity": "0.4807878",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0d8ada",
            "score": 4,
            "text": "I dunno. I'm inclined to believe the sites that show all their sources and don't have to take down every second article they write due to misreporting something. And that sure isn't CNN or the New York times.",
            "title_similarity": "0.5248575",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0d04hb",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0e3mv8",
            "score": 7,
            "text": "See politicized junk science on the front page of this sub is getting really boring.",
            "title_similarity": "0.54394823",
            "sentiment_compound": -0.3804
        },
        {
            "id": "h0dffkd",
            "score": 3,
            "text": "This is laughable....a “glut of right-leaning misinformation in the media and information environment”?\n\nBoth mainstream and social media are clearly and inarguably left-leaning. To pretend that right-leaning information outlets are more misinforming than left-leaning sources is naive.",
            "title_similarity": "0.778976",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0di2pz",
            "score": 8,
            "text": "Ah yes, liberals smart conservatives dumb. Easy karma OP \n\nAnd I say this as a soc dem",
            "title_similarity": "0.563178",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0cruwd",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0d36yi",
            "score": 17,
            "text": "What about “false” narratives that turn out to be true? Is this also the case? Or only those that are truly false?",
            "title_similarity": "0.5172921",
            "sentiment_compound": 0.7383
        },
        {
            "id": "h0d64nc",
            "score": 5,
            "text": "Well I don’t know any left leaning people who believe Trump won the election.",
            "title_similarity": "0.4769393",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0d89py",
            "score": -2,
            "text": "So we should believe in-\n\nHydroxychloroquine,  \nCovid19 is Democratic Hoax, \nRussia has no cyber interference in the U.S,  \"Dont know why they would.\"\nBelieved Mexico will pay for border security.\n The election was fraud, they know because they lost.\nAhhhhhhhhhhhh yep!",
            "title_similarity": "0.6095786",
            "sentiment_compound": -0.7574
        },
        {
            "id": "h0dalcs",
            "score": 2,
            "text": "It could also have something to do with the right’s decades long attacks on education and intelligence.",
            "title_similarity": "0.57711816",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0dh2ge",
            "score": 3,
            "text": "Does anyone take this sub seriously at this point? The deep irony of this article in light of the propaganda perpetuated here.",
            "title_similarity": "0.5702028",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0e9z97",
            "score": 2,
            "text": "Lol what a fucking circle jerk.",
            "title_similarity": "0.33201522",
            "sentiment_compound": 0.0314
        },
        {
            "id": "h0dveoe",
            "score": 5,
            "text": "Every single thing we have found out about people with conservative mindsets adds up to make this more or less inevitable.",
            "title_similarity": "0.49066395",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ef17w",
            "score": 4,
            "text": "Okay which party dismissed the Wuhan Lab theory because the other side proposed it?",
            "title_similarity": "0.59150255",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0d1xhe",
            "score": 0,
            "text": "I'm watching this unfold on Facebook. This dude I was friends with was always republican big white dude fits the mold. But ever since the election he's gone so far down the rabbit hole it's crazy. His posts are getting more and more attack like.\n\nThen their is my mother. She is falling that way too. She doesn't think vaccines work and she's randomly turned anti gay despite her being ok with my being bi. It's sad really",
            "title_similarity": "0.658263",
            "sentiment_compound": -0.9287
        },
        {
            "id": "h0d2ort",
            "score": -2,
            "text": "so i notice of recent on conservative sub. a flood of fake new sites being posted at a decent rate.\n\ni simple did a whois search and wow.",
            "title_similarity": "0.6453496",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0d3az4",
            "score": 0,
            "text": "This is a pile of poop honestly, why is it on here?",
            "title_similarity": "0.286502",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0d5r48",
            "score": 0,
            "text": "Please don't think for a second that democrats aren't equally susceptible and capable of group think, gullibility, and taken by falsehoods, astroturfing, and being directed to turn on people. There are more lower intelligence republicans, overall. But most democrats are just as stupid.",
            "title_similarity": "0.7328999",
            "sentiment_compound": -0.5434
        },
        {
            "id": "h0d6mw5",
            "score": -1,
            "text": "I’ll be ding dang darned",
            "title_similarity": "0.22679028",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d7wq1",
            "score": -1,
            "text": "It's not just that the right-wing media gives false information,  it's also that right wingers refuse to even consider information from other sources.  Like, there is no way CNN or any left leaning media could ever give an ounce if truth.  They believe what they saw on FOX or OAN is the only truth because it fits there small minded narrative.  It's truly insane if you ask me.",
            "title_similarity": "0.641449",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0dh68c",
            "score": 1,
            "text": "This is my surprised face. Conservatives have been telling their people for years that scientists cant be trusted, because their beliefs dont hold up to any scientific scrutiny. So instead of admitting theyre wrong, they just substitute their own reality.",
            "title_similarity": "0.6700446",
            "sentiment_compound": -0.5795
        },
        {
            "id": "h0dhnyv",
            "score": 2,
            "text": "I'd like to see the specific \"misinformation\" articles.  I wonder how much \"untrue\" info is proven true on a long enough timeframe.  There's so much quick labeling and division that it kind of waters down a study like this.  \n\nThe fact that experts have done a hard pivot on the Lab Leak \"conspiracy theory\" is just one example.",
            "title_similarity": "0.72102296",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0dhsgk",
            "score": 0,
            "text": "My sister is a hardcore trumpet while I’m a left leaning progressive although I’m definitely very near the middle.   I tell her the difference between her and I is I know the limits of my understanding of government and macro economics and am prepared to change my opinion given strong enough data or logic while she has no possibility of being wrong in her mind.  Her response was “that’s because I know I’m absolutely right”… sigh, she’s convinced there is only one solution to everything and it’s whatever trump or newsmax says despite me pointing out she knows far less about politics and economics than I do.  This is pretty much nearly 100% of the people on the right these days.",
            "title_similarity": "0.6585792",
            "sentiment_compound": 0.8801
        },
        {
            "id": "h0djpxg",
            "score": 1,
            "text": "We’ve known this for years. It’s literally been studied multiple times and the results are consistent.",
            "title_similarity": "0.20942102",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dk4zf",
            "score": 0,
            "text": "Interesting how this came out today, the day when emails revealed fauci lied through his teeth multiple times. Liberals who shouted \"trust the science\" believed the biggest political falsehoods of 2020 and 2021.",
            "title_similarity": "0.75214326",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0dn5e5",
            "score": 0,
            "text": "I mean it’s annoying that a study had to say the obvious but yeah",
            "title_similarity": "0.55550754",
            "sentiment_compound": 0.2382
        },
        {
            "id": "h0dnpmr",
            "score": -1,
            "text": "And lots of inbreeding...",
            "title_similarity": "0.27234453",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0e2lsi",
            "score": 1,
            "text": "Conservatives typically buy into religion so you know they aren’t too bright, just from that.",
            "title_similarity": "0.7114449",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0eh52j",
            "score": 2,
            "text": "Libertarian here who tends to lean conservative.  Conservatives do not trust media because media lies to support the liberal narrative.  The chasm has only widened with this latest election and Facebook and Twitter bans.  Conservatives can't trust news sources to report the truth so the truth gets lost between real news and zealots.  Ask yourself how well you would trust the media if they suppressed news that was negative to a conservative candidate?  Both sides are susceptible to propaganda (anyone still think that Dan Rather didn't fake that document on GHW Bush or that the teen Covington student antagonized the Native American Philips?).  The problem is that we are all fed biased news which confirms our view.  CNN is liberal while Fox is conservative.  Each tell truths, half truths and propaganda for ratings and money. This B.S. narrative that conservatives are not educated, stupid or easy susceptible to falsehood is PART OF THE PROPAGANDA!  Just take the time to have a healthy discussion with all types of people and form your own damn opinion. The truth always lies somewhere in the middle.",
            "title_similarity": "0.8284944",
            "sentiment_compound": -0.3358
        },
        {
            "id": "h0eopoq",
            "score": -2,
            "text": "I find this hard to believe when it was liberals screaming about the conspiracy theory of Russians interfering in the US election.",
            "title_similarity": "0.73540354",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h0esl0c",
            "score": 1,
            "text": "Didn’t need an article headline to tell me the obvious.",
            "title_similarity": "0.26091123",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eunkl",
            "score": 0,
            "text": "Science? Please! This is pure politics. Many liberals repeat that Donald Trump said that all Mexicans are rapists and murders. The media regularly stated that Donald Trump praised the White Supremacists in Charlottesville. These are questions that would go the other way if posed in the study, but they were intentionally left out to manufacture a political point. Go to any of the fact check sites and you will find ambiguity in most of these issues when looked at in their full context.\n\nSome are more susceptible to believing falsehoods. I just don't think it has anything to do with liberal or conservative and this study proves nothing.",
            "title_similarity": "0.6938337",
            "sentiment_compound": -0.4926
        },
        {
            "id": "h0dc7ae",
            "score": 11,
            "text": "[deleted]",
            "title_similarity": "0.117882945"
        },
        {
            "id": "h0egb7h",
            "score": 6,
            "text": "\"Science\" sub. Alright.",
            "title_similarity": "0.14933151",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0dg5h8",
            "score": 7,
            "text": "At this point I think OPs are just karma farming. This sub is utter garbage now.",
            "title_similarity": "0.39443296",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eato6",
            "score": 9,
            "text": "conservatives dumb here's science to prove it\n\nno we're not an echo chamber",
            "title_similarity": "0.4878548",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h0ctihk",
            "score": 111,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0cnos6",
            "score": 19,
            "text": "There's a lot of factors that are likely going into this where the title is slightly clickbaity.\n\nBeing conservative is likely just another trait that these people have. There's a multitude of other factors that come into play such as education, religion, age, location, etc.",
            "title_similarity": "0.55375755",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0e9svj",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0cc1vt",
            "score": 74,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0czsdo",
            "score": 0,
            "text": "If you identify with either one of these parties then you are susceptible to believing falsehoods told by your party.",
            "title_similarity": "0.66370976",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h0d5wyt",
            "score": 0,
            "text": "If I gather up all the studies about conservatives that have popped up on this subreddit over the past few years, that’s not a good look for them.",
            "title_similarity": "0.6431046",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h0d5yl7",
            "score": 0,
            "text": "I’m conservative and I believe this therefore it must be false?",
            "title_similarity": "0.55631316",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d8ux7",
            "score": 0,
            "text": "Beware...article is clearly part of a scientific study to see who reacts to this article agreeing or disagreeing.",
            "title_similarity": "0.53123605",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0d9ouz",
            "score": 0,
            "text": "If I paraphrase the second paragraph, it basically implies that the conservative platform contains more falsehoods than the liberal platform.",
            "title_similarity": "0.8456715",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dala2",
            "score": 0,
            "text": "Now study if conservatives believe non-political falsehoods more as well.",
            "title_similarity": "0.77280974",
            "sentiment_compound": 0.3353
        },
        {
            "id": "h0daobk",
            "score": 0,
            "text": "Stupidity, religion, and misinformation, I wouldn't be surprised if this cocktail delivers an actual civil war.",
            "title_similarity": "0.6379382",
            "sentiment_compound": -0.8679
        },
        {
            "id": "h0ddjuz",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dex2d",
            "score": 0,
            "text": "How's about one of the main reason being they self-identify as \"christian\" which means they're quite literally able to believe any crock of horseshit that comes their way.",
            "title_similarity": "0.55919623",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0df5yh",
            "score": 0,
            "text": "Trunk did say it the best, he loves the poorly educated, which the GQP loves to defund education. Keep them stupid, keep them voting against their own interests.",
            "title_similarity": "0.63062847",
            "sentiment_compound": 0.8807
        },
        {
            "id": "h0di6ss",
            "score": 0,
            "text": "AKA Fauci’s “incriminating” emails.",
            "title_similarity": "0.5188586",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dii9d",
            "score": 0,
            "text": "If you like donnie then you’re probably not the brightest, he lied so much, how could you roll with this worthless pos",
            "title_similarity": "0.59052694",
            "sentiment_compound": -0.7714
        },
        {
            "id": "h0dk6x5",
            "score": 0,
            "text": "Well they are mostly religious. Those people will believe almost anything.\n\nAs a wise man once said, \"superstition ain't the way!\".",
            "title_similarity": "0.57261777",
            "sentiment_compound": 0.6696
        },
        {
            "id": "h0dljkk",
            "score": 0,
            "text": "I just love how there's a study about how conservatives believe in falsehoods and not truth because it's beneficial for them and they're like:\n\n\"Nah, the science is wrong!\"\n\nNo further questions, your honor.",
            "title_similarity": "0.725247",
            "sentiment_compound": 0.7529
        },
        {
            "id": "h0dm45x",
            "score": 0,
            "text": "Dan rather. Stephen glass. Jayson Blair. Sabrina erdely. Brian Williams.",
            "title_similarity": "0.27335578",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dm9h3",
            "score": 0,
            "text": "Welcome back to \"Things We Already Knew Were True But Now We Have Proof\"",
            "title_similarity": "0.3866344",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0dpgl2",
            "score": 0,
            "text": "Conservative people needing false data to reaffirm their biased beliefs? Are you shitting me?",
            "title_similarity": "0.7617432",
            "sentiment_compound": -0.644
        },
        {
            "id": "h0dr1y2",
            "score": 0,
            "text": "Conservatives: \"science isn't real and this study is fake, you gotta think critically which is why I only trust tucker and facebook.\"\n\n&#x200B;\n\nsorry for the rudeness all, misinformation is a fascinating subject, and it's probably partially because many of the party's higher-ups are encouraging these falsehoods. It is unfortunate we are so resistant to finding ideas outside our own perspective. People need to make sure to question their own beliefs, taking into account we want ourselves to be right.",
            "title_similarity": "0.8090614",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0dr7wz",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dr8b7",
            "score": 0,
            "text": "do we need any more studies that prove conservatives are unable to think or understand anything? I'm pretty sure the first million was enough.",
            "title_similarity": "0.6903213",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h0dx79z",
            "score": 0,
            "text": "Well…the right typically believes the bible is the spoken word of god…so they are susceptible to believe pretty much anything.",
            "title_similarity": "0.54491675",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0dxvw0",
            "score": 0,
            "text": "People in general aren't really taught to think critically anymore, it affects both sides, but in my experience it's mostly more conservative people who won't change their minds based on new verifiable evidence.",
            "title_similarity": "0.6744795",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dzd4n",
            "score": 0,
            "text": "yeah conservatives aren't inclined to be smart, which means sum total, they're not as smart on average. obviously. \\*shrug\\*",
            "title_similarity": "0.6678471",
            "sentiment_compound": 0.3903
        },
        {
            "id": "h0dzjks",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0e3123",
            "score": 0,
            "text": "It's not because they're conservatives, it's because they're Evangelicals. Being raised in the church makes you gullible, less likely to fact check or believe in any kind of science.  It's how you end up with anti-vaxxers, climate deniers and Trump supporters.",
            "title_similarity": "0.6927756",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0e5jwj",
            "score": 0,
            "text": "Obviously... conservatives are significantly less educated on average. Fact.",
            "title_similarity": "0.5898166",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0e8lbm",
            "score": 0,
            "text": "Conservatives are conditioned to learn socially through their parents, pastors, teachers, and other authority figures. They trust those people and when confronted with conflicting information they’re defensive not because the information is truly wrong, but because they can’t bring themselves to believe that they cant trust what the people they respect tell them is true. It’s an existential issue. \n\nLiberals tend to shame conservatives instead of getting them to trust what they’re saying.",
            "title_similarity": "0.727073",
            "sentiment_compound": 0.6805
        },
        {
            "id": "h0e96yl",
            "score": 0,
            "text": "That and a predisposition to believing in talking snakes.  They don’t have the necessary vocal chords for human speech people.",
            "title_similarity": "0.39913",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ecdbh",
            "score": 0,
            "text": "The difference is EDUCATION. Tired to death of seeing folks disregard the fact that most conservatives are lower in education level and applied IQ than their liberal peers",
            "title_similarity": "0.73472804",
            "sentiment_compound": -0.885
        },
        {
            "id": "h0eckhr",
            "score": 0,
            "text": "This was obvious before the study and now",
            "title_similarity": "0.23537634",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ecmz7",
            "score": 0,
            "text": "Makes sense because the whole idea of being conservative is “DONT CHANGE ANYTHING UNLESS YOURE PUTTING IT BACK TO HOW I LIKED IT BEFORE” That’s a very closed mindset. If you like everything how it is (for you) and you don’t want to be bothered with reality you’ll accept whatever explanation you get from the person who wants to leave things the way they are (for you).",
            "title_similarity": "0.4777606",
            "sentiment_compound": 0.7531
        },
        {
            "id": "h0ecu4a",
            "score": 0,
            "text": "Alex Jones doesn't lie",
            "title_similarity": "0.10888818",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ecww3",
            "score": 0,
            "text": "Well, yeah.  The people they trust are shameless liars.",
            "title_similarity": "0.5680069",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0eg02a",
            "score": 0,
            "text": "I mean… is anyone surprised?",
            "title_similarity": "0.1962243",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0elsao",
            "score": 0,
            "text": "And the scariest part is, nothing will change their minds, not the truth, not common sense, sadly, nothing.",
            "title_similarity": "0.3257169",
            "sentiment_compound": 0.0951
        },
        {
            "id": "h0em2rj",
            "score": 0,
            "text": "Don't we have a political sub? Ever since Trump there's all this political garbage in r/science\n\nAll of you political fanatics are stupid just like the religious fanatics and it gets old seeing politics here.",
            "title_similarity": "0.6740674",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0eq5nl",
            "score": 0,
            "text": "Yeah whatever @ r/Science. So much for your unbiased opinion. \n\nHere on the other hand is Fauci's leaked emails.\n\nLet's see who reads it and then want to still say its just a \"certain side\" who reads and LOVES lies.\n\nhttps://www.documentcloud.org/documents/20793561-leopold-nih-foia-anthony-fauci-emails?fbclid=IwAR2aZUmNotVdU\\_RuTrXaXH2jqSOOkQP7Mi-pf8C6K87nU\\_jD2eyXeKjzARU",
            "title_similarity": "0.64399827",
            "sentiment_compound": 0.7925
        },
        {
            "id": "h0exce4",
            "score": 0,
            "text": "Someone post this to the conservative sub, see how they react. I'd do it but I got banned from a hilarious moment already",
            "title_similarity": "0.6124471",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h0d2wq8",
            "score": 3,
            "text": "“Overall, both liberals and conservatives were more likely to believe stories that favored their side – whether they were true or not.”\n\nIt truly sounds like both sides just marked the articles that were pro their stance true and anti their stance false. The conclusion this author makes is seems to be disingenuous. One could say that conservatives are more likely to suffer from confirmation bias.",
            "title_similarity": "0.88778305",
            "sentiment_compound": 0.7458
        },
        {
            "id": "h0den5z",
            "score": 4,
            "text": "Soo... who decided what the falsehoods are? Not taking sides but I've seen and heard alot of bs from both left and right",
            "title_similarity": "0.5853927",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dqihn",
            "score": 3,
            "text": "This is why Cons hate the 'media'. They'd rather believe out right lies from fringe far right propaganda outlets than be exposed to the truth",
            "title_similarity": "0.694771",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h0d3ezz",
            "score": 52,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0cdiaf",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0czd75",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0d3yww",
            "score": -2,
            "text": "Let’s see how many liberals believe this one.",
            "title_similarity": "0.60986614",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d913r",
            "score": 3,
            "text": "Violation of Rule 1: Not a real study (not linked), not peer reviewed. Just a synopsis of a study (which violates rule 2).",
            "title_similarity": "0.4345659",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h0d9lcp",
            "score": 0,
            "text": "It’s not surprising, they’re older, we already know this stuff has a greater effect on old people",
            "title_similarity": "0.47806925",
            "sentiment_compound": 0.1744
        },
        {
            "id": "h0djxlm",
            "score": -2,
            "text": "Have liberals ever been wrong about anything? It's hard to be wrong when you have complete trust in scientific consensus. And if you are wrong it means the scientific consensus was wrong, which historically almost never happens.",
            "title_similarity": "0.6834276",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h0dqbg7",
            "score": 3,
            "text": "Conservatives are proving to be some pretty stupid people.  Evangelists and political beggars are salivating with these idiots, can’t give their money away to con men fast enough",
            "title_similarity": "0.7315731",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0dqvc0",
            "score": 2,
            "text": "I think it’s more about church folks and non church folks. Believing in something fantastical without any evidence isn’t tolerated in Christian circles, it’s celebrated. I used to be part of an ultra right wing fundamentalist church and I was taught that believing in god would be far less satisfying an experience if we had evidence of existence. God *could* reveal himself more but that would take away from the joy in our experience of faith. \nBonkers stuff.",
            "title_similarity": "0.6542914",
            "sentiment_compound": 0.9451
        },
        {
            "id": "h0duxav",
            "score": 1,
            "text": "Is it because they’re uneducated or religious? Both lead to lack of critical thinking because you’ve believed in fiction as truth for most of your life or just believe what you want to.",
            "title_similarity": "0.63551754",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0e36qi",
            "score": 2,
            "text": "Yep liberals don’t believe any falsehoods at all. They always speak the truth and never exaggerate anything",
            "title_similarity": "0.33072835",
            "sentiment_compound": 0.6052
        },
        {
            "id": "h0e731h",
            "score": 2,
            "text": "Look let’s just say it and call it like it is\n\nConservatives are generally less educated and just not as smart people. That’s not an absolute but basically the more educated you are the more liberal you lean, on average.\n\nThat’s the unspoken truth in the US, two halves of society at odds with each other. Some educated and some not. Only strange thing is, the rich and uber rich then lean on the conservative side cause they want to protect their money. So you have a bunch of sheep led by a few cut throat supreme robots. And there are not enough cut throats on the liberal side cause that’s just not how they role.\n\nHow do you fix America and other societies - more education and more books. Books books books and audiobooks. Everyone needs to read a lot more.",
            "title_similarity": "0.8079097",
            "sentiment_compound": 0.9764
        },
        {
            "id": "h0eder9",
            "score": 2,
            "text": "Lemme guess, a study done by liberals? \n\nThere are lies, damned lies and statistics.",
            "title_similarity": "0.72648764",
            "sentiment_compound": -0.802
        },
        {
            "id": "h0efkg2",
            "score": 2,
            "text": "Study funded by liberals to conclude exactly what the study was funded to find. Again.",
            "title_similarity": "0.63747686",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ektro",
            "score": 2,
            "text": "This study seems entirely free of bias and entirely objective. *fart noises*",
            "title_similarity": "0.2477152",
            "sentiment_compound": 0.4459
        },
        {
            "id": "h0fz85z",
            "score": -2,
            "text": "We know - they really are a special kind of stupid animal.",
            "title_similarity": "0.37882608",
            "sentiment_compound": -0.1119
        },
        {
            "id": "h0d8jcz",
            "score": 41,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0d02pi",
            "score": 5,
            "text": "It is possible to imagine a version of conservatism that isn't so fundamentally anti-science and anti-knowledge, but mostly that's not what we have. The glut of right-leaning misinformation exists because there is a demand for it. People like hearing their intuitions, their biases, etc. confirmed. The left isn't exactly immune to that either, but it takes a different form, and you just don't see that same degree of epistemic closure stemming from either paranoia or faith-based thinking. Religion is probably a big part of the difference, because it tends to demand that one accepts its narratives unconditionally.",
            "title_similarity": "0.7196587",
            "sentiment_compound": -0.4735
        },
        {
            "id": "h0d3uom",
            "score": -5,
            "text": "They are narcissistic in their views. Ignorant people can learn. These people are beyond helping.",
            "title_similarity": "0.5193473",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h0efw8n",
            "score": 29,
            "text": "*Looks around at all the left leaning people on reddit who believe conspiracies while calling the opposition conspiracy theorists*",
            "title_similarity": "0.60233676",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0cwfcz",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0d56f7",
            "score": 20,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dmw5g",
            "score": 18,
            "text": "Why are prosperity theologians more popular with Republicans than Democrats? Why are Talk Radio more popular with Republicans than Democrats? Why do [Multi Level market scams target conservative evangelical Christians?](https://www.vox.com/2015/10/23/9603028/conservative-marketing-scam)",
            "title_similarity": "0.79073966",
            "sentiment_compound": 0.4453
        },
        {
            "id": "h0cf7in",
            "score": 2554,
            "text": ">Overall, both liberals and conservatives were more likely to believe stories that favored their sides - whether they were true or not.   \n>  \n>\\-the actual article itself\n\nThe comments down here are infuriatingly smug and exactly what the problem is; the study literally showed that the people snarkily commenting on here are still *more likely to believe falsehoods if it fits their beliefs.* \n\nThis is bad, full stop. This is nothing to celebrate, this is something to fix.",
            "title_similarity": "0.87710994",
            "sentiment_compound": -0.6121
        },
        {
            "id": "h0chs9p",
            "score": 153,
            "text": "Would love to read what stories they portrayed as “true” and which stories as “false” in the study for the “viral political stories”. If there’s anything I’ve learned in the last year is that often the truth is actually in a gray area for anything to do with political stories. Tough to determine what is “true” and “false” anymore unless it was a verifiable outrageous claim (Biden is a lizard man or something).",
            "title_similarity": "0.7399602",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0d3fkx",
            "score": 55,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0d01zn",
            "score": 330,
            "text": "[deleted]",
            "title_similarity": "0.11788292"
        },
        {
            "id": "h0e2djp",
            "score": 6,
            "text": "This kinda sounds like propaganda",
            "title_similarity": "0.34192592",
            "sentiment_compound": 0.1243
        },
        {
            "id": "h0cs679",
            "score": -3,
            "text": "Do they really believe the lie, or are they just selfish people who don’t care anout anything but themselves...",
            "title_similarity": "0.569312",
            "sentiment_compound": 0.0129
        },
        {
            "id": "h0d4z96",
            "score": -1,
            "text": "All those right wing dingdong’s think the news is far left when it’s maybe centrist at best",
            "title_similarity": "0.6316838",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0dm007",
            "score": -3,
            "text": "Hmmm, then why do most registered Democrats still believe that Trump colluded with the Russian government to steal the 2016 election.",
            "title_similarity": "0.68693143",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0eawrv",
            "score": 5,
            "text": "“Studies show the right bad and the left good.”",
            "title_similarity": "0.51154095",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0cwiis",
            "score": 1,
            "text": "My advice for those too gullible to separate truth from lies: trust half of what you see, none of what you read.",
            "title_similarity": "0.53975284",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0d0k1q",
            "score": 1,
            "text": "Great. Good job Russia.",
            "title_similarity": "0.27951908",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h0d0p45",
            "score": 1,
            "text": "Perhaps conservatism is a political falsehood and the rest is self-fulfilling?",
            "title_similarity": "0.64071476",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d10su",
            "score": 1,
            "text": "Lack of intelligence and critical thinking might also have something to do with it.",
            "title_similarity": "0.41854772",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0d1xhb",
            "score": 1,
            "text": "I wonder how closely willingness to believe political falsehoods correlates to religious fundamentalism. Once you’ve been indoctrinated to believe that faith alone matters, all incentive to think things through disappears. Conservative politics has courted evangelicals, and turned them into unquestioning political and financial assets.",
            "title_similarity": "0.75870323",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0d29he",
            "score": -1,
            "text": "Both left and right have confirmation bias.",
            "title_similarity": "0.54190946",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0d3a8s",
            "score": 1,
            "text": "I still see this as conservatives being more trusting than liberals. Hate me all you want but it’s basically written in the title. They are just being taken advantage of by the same media that’s also putting out falsehoods from the other side",
            "title_similarity": "0.8686645",
            "sentiment_compound": 0.3174
        },
        {
            "id": "h0d5wpr",
            "score": -1,
            "text": "I love science. “Idiots believe idiocy more than the educated.”\n\nEdit: haha, butthurt conservturds.",
            "title_similarity": "0.7113166",
            "sentiment_compound": 0.802
        },
        {
            "id": "h0d65mf",
            "score": -1,
            "text": "I’m pretty sure we already knew this, did we really need a new study on it?",
            "title_similarity": "0.38466328",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h0d69iw",
            "score": -1,
            "text": "An unrelated study from the same firm shows “water is likely accurately described as ‘wet’.”",
            "title_similarity": "0.36096275",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d78q0",
            "score": 1,
            "text": "Just in case the last 2 years hadn’t convinced anyone",
            "title_similarity": "0.32514128",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0d85kf",
            "score": -1,
            "text": "conservatives dumb, ha ha! \n\nscience",
            "title_similarity": "0.52023494",
            "sentiment_compound": -0.2942
        },
        {
            "id": "h0d8jou",
            "score": 1,
            "text": "As Gomer Pyle use to say “surprise, surprise”",
            "title_similarity": "0.34017992",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d8ssf",
            "score": -1,
            "text": "Reddit used to be awesome...",
            "title_similarity": "0.4302535",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h0db7h7",
            "score": 1,
            "text": "Makes sense. It's why the GOP over-indexes in con men. Because that's where the best opportunities are.",
            "title_similarity": "0.66642976",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h0ddojf",
            "score": -1,
            "text": "Because they’re dumbasses",
            "title_similarity": "0.35505968",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0de0pg",
            "score": 1,
            "text": "Breaking: conservatives believe 100% of political falsehoods, while liberals believe only 99.9%.",
            "title_similarity": "0.7304052",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0den67",
            "score": -1,
            "text": "Wait, so ignorant people are more easily fooled? But how?!?",
            "title_similarity": "0.5764109",
            "sentiment_compound": -0.3861
        },
        {
            "id": "h0dg8oj",
            "score": -1,
            "text": "Nah. Main driver is that they’re idiots.",
            "title_similarity": "0.47343504",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0dib9u",
            "score": -1,
            "text": "Unsurprising to anyone, conservatives are idiots. Who’d have thought.",
            "title_similarity": "0.65827847",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dihlo",
            "score": -1,
            "text": "Wow, so many comment threads critical of this post have been getting deleted. Including one that said the mods are pushing this politicized garbage. r/science is being taken over by wokesters",
            "title_similarity": "0.61637574",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0dikbs",
            "score": 1,
            "text": "Another study that will be ultimately be ignored. Confirms what we already know.",
            "title_similarity": "0.4195876",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0dj1ym",
            "score": -1,
            "text": "Which of the conservatives or liberals have given up believing the USA is anything but a modern iteration an imperial state stealing resources around the world while calling it “democracy”? This lie is pushed by both Democratic & Republican parties. If you don’t know that, everything you believe is a political falsehood.",
            "title_similarity": "0.7756765",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0dl30j",
            "score": 1,
            "text": "Its because we have this \"challenger/defender\", \"old vs new\", \"rural vs urban\" dichotomy that in all reality is just the difference between those that accept new information and integrate it and those that live in denial and want to promote cognitive dissonance and rejection of established truths because it provides them an alternative to confronting the destructiveness of their own belief structures and the other people that hold them",
            "title_similarity": "0.64206636",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0dl7g9",
            "score": 1,
            "text": "Falsehoods like the Wuhan leak? Maybe liberals are just more susceptible to blind belief?",
            "title_similarity": "0.7724394",
            "sentiment_compound": -0.4979
        },
        {
            "id": "h0dlt4g",
            "score": 1,
            "text": "Common sense kind of already proved this",
            "title_similarity": "0.25169137",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dmf7i",
            "score": 1,
            "text": "How do I know this isn’t more political falsehood?",
            "title_similarity": "0.47491232",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dokcw",
            "score": 1,
            "text": "I can certainly see this trend!  Step-brother and his wife but into it all because “if it’s print, it must be true”.",
            "title_similarity": "0.47552583",
            "sentiment_compound": 0.2481
        },
        {
            "id": "h0dor52",
            "score": 1,
            "text": "They had to do a study for this? Just literally turn on anything with a screen",
            "title_similarity": "0.33794445",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dw0i1",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dyjfz",
            "score": -1,
            "text": "No, the \"main driver\" is that Conservatives are stupid, spiteful and hateful people. If there was no \"misinformation\" in the media they would create it. Hell, that is precisely what has happened.",
            "title_similarity": "0.794134",
            "sentiment_compound": -0.9009
        },
        {
            "id": "h0e2gqv",
            "score": -1,
            "text": "Like no collusion? Wuhan lab leaks? Hunter’s laptop? Those? Joe’s a rapist? Is this a joke?",
            "title_similarity": "0.48215437",
            "sentiment_compound": -0.6553
        },
        {
            "id": "h0e5mao",
            "score": -1,
            "text": "To the surprise of absolutely nobody who isn't right leaning.  Left wing propaganda or conspiracy theory is virtually nonexistent, it's almost exclusively a right-wing tactic.  This is because learning the truth tends to steer people toward more left-wing (socialist/egalitarian) views, so the right literally needs to lie to people to trick them.  This is not the first study done that demonstrates this, and the ruse has been going on for decades.  Nobody who knows the truth would ever support a system that exploits them for the gain of the few wealthy, it's just not rational.",
            "title_similarity": "0.70307446",
            "sentiment_compound": 0.743
        },
        {
            "id": "h0e6d4n",
            "score": -1,
            "text": "Bullshit. You’re both equally retarded and mislead. Where do you think this has come from? Who do you think spreads it and for what reason? It’s pretty simple.",
            "title_similarity": "0.5346046",
            "sentiment_compound": -0.6868
        },
        {
            "id": "h0ec76w",
            "score": -1,
            "text": "Wait, what was their baseline?  Right wing conspiracy theories seem to be rolling down the truth hill lately",
            "title_similarity": "0.70975584",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0eca95",
            "score": 1,
            "text": "A quality \"Science\" post.  Post \"Science\" backing a conservative political view and get banned.",
            "title_similarity": "0.6261004",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0ed9ce",
            "score": 1,
            "text": "Here's a tough one for all you liberals to swallow while trying to explain the above study: conservatives understand liberals better than liberals understand conservatives:\n\nhttps://theindependentwhig.com/haidt-passages/haidt/conservatives-understand-liberals-better-than-liberals-understand-conservatives/",
            "title_similarity": "0.81785727",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0eecph",
            "score": 1,
            "text": "as opposed to the glut of left leaning misinformation? \n\nbias much?",
            "title_similarity": "0.5652479",
            "sentiment_compound": -0.4696
        },
        {
            "id": "h0eep82",
            "score": 1,
            "text": "Reddit is becoming a parody of itself",
            "title_similarity": "0.5380076",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0efxur",
            "score": 1,
            "text": "Frankly, I doubt much of the \"science\" posted here.",
            "title_similarity": "0.38611048",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0eg646",
            "score": 1,
            "text": "Isn’t this a science subreddit? Was kind of hoping for chemistry, botany or something not just US politics",
            "title_similarity": "0.42436427",
            "sentiment_compound": 0.3626
        },
        {
            "id": "h0emif0",
            "score": 1,
            "text": "Also helps that conservativism is false: vote against your own interests to spite your neighbour, to suck up to people who have contempt for you.",
            "title_similarity": "0.6431199",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h0eq6cs",
            "score": -1,
            "text": "Not a surprise - many conservatives are also against the idea of skepticism and checking information against other voices",
            "title_similarity": "0.7125617",
            "sentiment_compound": -0.4242
        },
        {
            "id": "h0eujmj",
            "score": 1,
            "text": "there is a very strong trend that the more educated someone is, the more liberal they are. coincidence?",
            "title_similarity": "0.672106",
            "sentiment_compound": 0.5563
        },
        {
            "id": "h0ew3yy",
            "score": -1,
            "text": "Yep they are all dumbasses",
            "title_similarity": "0.30553538",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0ezr7y",
            "score": 1,
            "text": "Is this supposed to be a surprise??",
            "title_similarity": "0.24883536",
            "sentiment_compound": 0.3527
        },
        {
            "id": "h0f9giy",
            "score": 1,
            "text": "I’m gonna press X to doubt on this one chief",
            "title_similarity": "0.43787688",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0finze",
            "score": 1,
            "text": "They are also more likely to believe a fairy godfather is going to kill everyone in the land unless we make sure gay sex is not happening. Seriously.",
            "title_similarity": "0.6062833",
            "sentiment_compound": -0.4371
        },
        {
            "id": "h0elnbj",
            "score": 6,
            "text": "The methodology and amount of people in this study are not a good sample size.",
            "title_similarity": "0.4530239",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h0cuter",
            "score": -16,
            "text": "Oh you mean like how COVID came from a lab. And the liberals not only plugged their ears and shouted \"la la la\" but they censored anyone who dared to contradict their delusional fantasies. Yes, it's conservatives who believe the falsehoods.",
            "title_similarity": "0.731386",
            "sentiment_compound": 0.1154
        },
        {
            "id": "h0ctlnm",
            "score": -16,
            "text": "Liberals more susceptible than conservatives to believing political falsehoods, a new U.S. study finds. A main driver is the glut of left-leaning misinformation in the media and information environment, results showed.",
            "title_similarity": "0.959755",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0cz3l9",
            "score": 41,
            "text": "[removed]",
            "title_similarity": "0.09656878"
        },
        {
            "id": "h0cw4st",
            "score": 108,
            "text": "[removed]",
            "title_similarity": "0.09656878"
        },
        {
            "id": "h0cy2dm",
            "score": 47,
            "text": "[removed]",
            "title_similarity": "0.09656878"
        },
        {
            "id": "h0ed6ss",
            "score": 4,
            "text": "Dividing everyone into two camps is a fallacy. I like guns. I also support abortion without question, gay rights, equity reform, fiscal conservativism, smaller government/or democratic socialism (either way works), legalizing Marijuana... the seemingly conflicting ideas go on. The point is... a thinking person is not part of any political \"group\". Thats not how free thinking works...",
            "title_similarity": "0.57105815",
            "sentiment_compound": -0.0521
        },
        {
            "id": "h0d08iq",
            "score": 2,
            "text": "Alternate title *uneducated people* are more likely to believe what they see without even googling if it's true or not",
            "title_similarity": "0.6087376",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0d0t8b",
            "score": -3,
            "text": "Wow, who woulda thought.",
            "title_similarity": "0.15823343",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0d25f3",
            "score": 2,
            "text": "While I believe this article on the whole, probably because it's what I assumed was the case anyway, it's still quote mining very specific parts of the research to prove it's point. Seems a bit poor practice for me.\n\n\nFor example, it says:\n\nResults showed that 54% of Democrats correctly said that the statement was “definitely true” – compared to only 18% of Republicans.\n\n\nBut what about the rest of the results for that case? Did 80% of republicans state probably true and 44% democrats, making them overall similar? It seems that by omitting the rest of the details this is likely they case, otherwise they would have shown them.\n\nThey just chose the numbers to prove the point they wanted to make. Pretty ironic when the study was about believing things based on false or misleading articles.",
            "title_similarity": "0.72249264",
            "sentiment_compound": 0.4606
        },
        {
            "id": "h0d3vhn",
            "score": -1,
            "text": "Most conservatives just want to piss everyone off because of posts like this one",
            "title_similarity": "0.6765061",
            "sentiment_compound": 0.0935
        },
        {
            "id": "h0d4eei",
            "score": 2,
            "text": "The funny thing about this study is the source material is news articles......which many comments here suggest should not be trusted to begin with. Who's fact checking the fact checkers? Who's opinion decides what the truth is?",
            "title_similarity": "0.7029231",
            "sentiment_compound": 0.4599
        },
        {
            "id": "h0d5esf",
            "score": -3,
            "text": "So, Science proves that conservatives are idiots. What a shocker.",
            "title_similarity": "0.7052337",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0d8ijx",
            "score": -3,
            "text": "Nah, dems voted in Biden. They’re both equally as bad",
            "title_similarity": "0.5521776",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0ddfae",
            "score": 2,
            "text": "Man Reddit is nice, you can just put labels on people and place hem in neat little boxes all dandy and organized without having to account for the nuances of reality. \n\n... Actually that's unfair towards reddit, it's just social media in general.",
            "title_similarity": "0.55658436",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0de3mr",
            "score": -2,
            "text": "This study MUST be accurate, because we all know that no studies are EVER affected by political biases.",
            "title_similarity": "0.37535647",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0dff87",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.11788292"
        },
        {
            "id": "h0dgl0b",
            "score": -1,
            "text": "R/science has lost its way :(",
            "title_similarity": "0.32406822",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h0dh6my",
            "score": 0,
            "text": "“Conservatives more likely to believe misinformation”, claims piece of misinformation",
            "title_similarity": "0.8277895",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0dicy8",
            "score": -2,
            "text": "“Left wing social study professor thinks conservatives are dumb as stupid and dumb” \n\nYeah you called right wingers conspiracy theorist for saying covid came from a lab and look where we are now",
            "title_similarity": "0.7075542",
            "sentiment_compound": -0.836
        },
        {
            "id": "h0dkz58",
            "score": 2,
            "text": "I always feel that reddit post this propaganda when something actually bad happens to the left. Dr Fauci's emails have been leaked containing info about the pandemic and him knowing the origin of covid.",
            "title_similarity": "0.66377926",
            "sentiment_compound": -0.7935
        },
        {
            "id": "h0dqwai",
            "score": 2,
            "text": "Well we’ve known that for a long time. If only the people who have been susceptible to misinformation would believe it.",
            "title_similarity": "0.50644964",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0dr65u",
            "score": 2,
            "text": "The least surprising thing I've read in months.",
            "title_similarity": "0.2827502",
            "sentiment_compound": -0.2057
        },
        {
            "id": "h0dstiu",
            "score": 2,
            "text": "\"Conservatism\" over the past few decades has done an excellent job in getting people to abhor education and discard critical thinking, favoring belief over evidence. This is part of why they cultivate the evangelicals so hard, they are primed to join any cult of belief over fact.",
            "title_similarity": "0.71904194",
            "sentiment_compound": 0.1365
        },
        {
            "id": "h0dt52g",
            "score": 2,
            "text": "Maybe it’s just the right is weak minded?",
            "title_similarity": "0.41621655",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0dvs8w",
            "score": 1,
            "text": "Conservatives are morons? Shocking..",
            "title_similarity": "0.6532848",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h0dx3lg",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.11788292"
        },
        {
            "id": "h0dxxtb",
            "score": 3,
            "text": "And this surprised...no one.",
            "title_similarity": "0.116031945",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0e0tpo",
            "score": 2,
            "text": "Considering most conservatives I know think the Bible is actually about a man that could walk on water and could summon bears, take the book literally, this isn't a surprise. They've been conditioned their whole life to take things at face value, to not be a skeptic or question, and to trust their leaders as a leap of faith. Why wouldn't this apply to other aspects of their life?",
            "title_similarity": "0.5332781",
            "sentiment_compound": 0.8101
        },
        {
            "id": "h0eaglf",
            "score": 2,
            "text": "CNN isn’t right winged media?",
            "title_similarity": "0.44638547",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eaozr",
            "score": 3,
            "text": "This is one of the times I laugh at the fact a study is even done given it is so obvious. There are literally millions of people who voted for a blatant conman due to the garbage they consume. And it doesn’t help that they are conditioned not to question anything by there religion.",
            "title_similarity": "0.6056316",
            "sentiment_compound": 0.743
        },
        {
            "id": "h0ed4kb",
            "score": 2,
            "text": "How ironic that all of the liberals are reading this and believing it instantly because it agrees with their narrative. More ironic that a conservative is calling this BS. After all, we are on social media talking about this.",
            "title_similarity": "0.6522854",
            "sentiment_compound": -0.1263
        },
        {
            "id": "h0emqsz",
            "score": -2,
            "text": "BS.\n\nPeople were eating up the media BS for the last two years only two find out they were lying about almost everything. \n\nI wonder who wrote this article. \n\nI’ve never voted. I hate politics but c’mon. \n\nTrump could say 2+2=4 and they would call him a liar. \n\n* The main issue is buying too hard into anything and blinding yourself from the truth. \n\nI personally try to stay as balanced as possible but I get it. Its difficult for some people on certain issues. \n\nSomeone definitely wants us divided though......and its not the average American. Most of us like each other.",
            "title_similarity": "0.7136158",
            "sentiment_compound": 0.5097
        },
        {
            "id": "h0eud9k",
            "score": 2,
            "text": "*Pretends to be shocked*",
            "title_similarity": "0.3233229",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0ezfp7",
            "score": 2,
            "text": "Well, yeah... Otherwise, they wouldn't conservatives.",
            "title_similarity": "0.4850722",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0fp7aj",
            "score": -2,
            "text": "In other words, Conservatives are gullible idiots.",
            "title_similarity": "0.67468345",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0cxync",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0ctayx",
            "score": -10,
            "text": "Both sides say the same exact thing about each other...",
            "title_similarity": "0.08840236",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dj29e",
            "score": 16,
            "text": "The Jewish Space Laser people? Hard to believe.....",
            "title_similarity": "0.37834907",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0d6571",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0d0hzv",
            "score": 2,
            "text": "Ah yes, I remember [something similar](https://www.reddit.com/r/science/comments/ede1j4/liberals_are_more_accepting_of_scientific_facts/?utm_medium=android_app&utm_source=share) posted here about liberals awhile back. People will believe whatever reinforces their beliefs",
            "title_similarity": "0.56485885",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0deqwz",
            "score": 2,
            "text": "Take a trip through /r/Qult_headquarters and it's pretty clear.",
            "title_similarity": "0.23999512",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0diyts",
            "score": -4,
            "text": "I can’t possibly think of a more ridiculous statement especially after the lab leak theory and all the fauci info released. The information is free for you all to see with your own eyes and yet you call the kettle black.",
            "title_similarity": "0.54987586",
            "sentiment_compound": -0.2247
        },
        {
            "id": "h0dr5pt",
            "score": 3,
            "text": "When your core base still go to mega churches and send money to televangelists, it’s not surprising it’s easy to make them believe whatever you want. \n\nThey already do and are willing to kill to prove it.",
            "title_similarity": "0.56189185",
            "sentiment_compound": -0.8234
        },
        {
            "id": "h0epeue",
            "score": -2,
            "text": "In other not news: right wingers are dumb ass mfs.",
            "title_similarity": "0.5479211",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h0d1tji",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0efx67",
            "score": 9,
            "text": "Not sure how a political study finds itself in a \"science\" sub.",
            "title_similarity": "0.49855644",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h0cu7ky",
            "score": 0,
            "text": "What is the solution to this problem?",
            "title_similarity": "0.20782435",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0d0avp",
            "score": 0,
            "text": "The fact that *anyone accepts media posts without double checking with associated press and government news* is beyond me.",
            "title_similarity": "0.4910409",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0d2mqw",
            "score": 0,
            "text": "BS. The believe this stuff cause they want to.\nSimple.",
            "title_similarity": "0.3133015",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0d40yb",
            "score": 0,
            "text": "Is there any study that tries to elucidate the confounding variables?",
            "title_similarity": "0.40187082",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d4wbs",
            "score": 3,
            "text": "Funded by FaceBook. hmmm",
            "title_similarity": "0.31497657",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d5mg0",
            "score": 0,
            "text": "So what is being done to combat the misinformation.",
            "title_similarity": "0.42644545",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h0d625s",
            "score": 0,
            "text": "It's hard to succumb to left-leaning misinformation when there's so much LESS left-leaning misinformation out there. It's just the law of large numbers at this point.",
            "title_similarity": "0.6328893",
            "sentiment_compound": -0.6617
        },
        {
            "id": "h0d67qs",
            "score": 0,
            "text": "The question is... if a Conservative believes this, does that mean the study is right, or wrong?!",
            "title_similarity": "0.6818647",
            "sentiment_compound": -0.5255
        },
        {
            "id": "h0d6ggh",
            "score": 0,
            "text": "I wonder if they really believe it or they just saying it so it makes them feel better about being on the losing side.",
            "title_similarity": "0.6280643",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0d72ku",
            "score": 0,
            "text": "*sorts by controversial*",
            "title_similarity": "0.36922365",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h0d793o",
            "score": 0,
            "text": "I am shocked and don't believe this! I need to see the evidence!",
            "title_similarity": "0.39868623",
            "sentiment_compound": -0.4374
        },
        {
            "id": "h0d8ekh",
            "score": 0,
            "text": "It's called a common factor. The common factor is intelligence.",
            "title_similarity": "0.32142472",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h0d8o4l",
            "score": 0,
            "text": "They will never believe it",
            "title_similarity": "0.15517333",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d97y4",
            "score": 0,
            "text": "Yeah, but conservatives don't believe in science, so I think they get check mate on this article.",
            "title_similarity": "0.7083993",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h0da9f0",
            "score": 0,
            "text": "It's also a quirk of the established reality versus the political ideal.\n\nSince more left-leaning parties' beliefs fall more in line with reality, they are generally more grounded politically.",
            "title_similarity": "0.7182618",
            "sentiment_compound": 0.749
        },
        {
            "id": "h0dad8p",
            "score": 0,
            "text": "~~right-leaning misinformation~~    Russian propaganda.",
            "title_similarity": "0.501531",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0daosh",
            "score": 0,
            "text": "I think we need more regulation on cable news in  the US.",
            "title_similarity": "0.5775112",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0daslg",
            "score": 0,
            "text": "Conservative use Research! \\*Conservative has hurt itself in confusion\\*",
            "title_similarity": "0.7299699",
            "sentiment_compound": -0.7088
        },
        {
            "id": "h0db8wi",
            "score": 0,
            "text": "“We show that the media environment is shaping people’s ability to do this very basic, fundamental task. Democracy depends on people being able to tell the difference between what is true and false and it falters when people have difficulty agreeing on what’s real,” --Kelly Garrett\n\nThose damn conservatives! How dare they falsly believe the lies the media is spreading, at a higher rate than liberals. It's like they want to trust the government or something.",
            "title_similarity": "0.87166345",
            "sentiment_compound": 0.7177
        },
        {
            "id": "h0dcg3j",
            "score": 0,
            "text": "so this would be political science",
            "title_similarity": "0.40364388",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0diagw",
            "score": 0,
            "text": "See, them stupider than I.",
            "title_similarity": "0.42379493",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0dic1i",
            "score": 0,
            "text": "This story is certainly proof that everyone (except me naturally) needs to have a greater emphasis on critical thinking and introspection as well a willingness to examine deeply held beliefs for internal inconsistencies.  Naturally we hear at the Earth is Actually Shaped like a Klein Bottle Society are above such petty mistakes",
            "title_similarity": "0.5725232",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0dis5s",
            "score": 0,
            "text": "Remember the article claiming that lockdowns effected conservative majority areas more? I remember a fair few high profile comments expressing a level of 'skepticism' that I don't see here today ... I honestly wish Reddit would challenge its own hive mind thinking sometimes.",
            "title_similarity": "0.8441204",
            "sentiment_compound": 0.743
        },
        {
            "id": "h0djgnf",
            "score": 0,
            "text": "Is this because of the amount of misinformation that is right leaning or because of something else?",
            "title_similarity": "0.59235716",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0djmad",
            "score": 0,
            "text": "“Right leaning misinformation in the media” that is laughable.",
            "title_similarity": "0.66145784",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0djn17",
            "score": 0,
            "text": "I tried to find the true and false statements used in the test but its not available. Can someone post them if they have them.  Thanks.",
            "title_similarity": "0.5072363",
            "sentiment_compound": 0.6956
        },
        {
            "id": "h0djrsj",
            "score": 0,
            "text": "So the country should just divide and separate from its current state of union then. The conclusion of the article is that this is a permanent issue and there is nothing that can be done. Why go through a civil war when we can just separate beforehand? Or maybe the conclusion is that everyday citizens should feel burdened with the job of fixing an army or weaponized assholes just because \n'unity'. Yes?",
            "title_similarity": "0.5725407",
            "sentiment_compound": -0.8426
        },
        {
            "id": "h0dk63z",
            "score": 0,
            "text": "That’s why conservative talk radio is massive and there isn’t really a competing counter to that.",
            "title_similarity": "0.61152315",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dl9v6",
            "score": 0,
            "text": "For the americans here, do you consider osu to be apolitical or does it has a political bias?\n\nHow does osu define conservatives and 'right-leaning misinformation'?\n\nI am wondering whether the political biasness of osu influence the study.\n\nNon-americans here.",
            "title_similarity": "0.7836631",
            "sentiment_compound": -0.4696
        },
        {
            "id": "h0dlxnn",
            "score": 0,
            "text": "Lolol a bunch of corporate slaves mad about religion.",
            "title_similarity": "0.6022035",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0do04l",
            "score": 0,
            "text": "Might also have something to do with reality based news-sources like Newsweek and The Washington Post being paywalled, while right wing fringe sites like beforeitsnews.com are free for all...",
            "title_similarity": "0.6608052",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h0doneg",
            "score": 0,
            "text": "So conservatives are more likely to believe lies because they are lied to most often?",
            "title_similarity": "0.85652065",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h0dpjeg",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dq0dq",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dwjv0",
            "score": 0,
            "text": "A main driver is being lower intelligence, willfully ignorant, low on empathy, focused on belief over knowledge, order over justice, and trust authority too much, no matter how badly they are abused by them.",
            "title_similarity": "0.61534166",
            "sentiment_compound": 0.2086
        },
        {
            "id": "h0dxp91",
            "score": 0,
            "text": "\"Conservatives more likely to be a bunch of morons who deny science and believe 'their truth' based on Facebook memes and the opinions of the like-minded idiots to whom they listen.\"",
            "title_similarity": "0.7973534",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0dxslc",
            "score": 0,
            "text": "The real divide in society is not 'left' or 'right' but *how we absorb and process* the glut of news, opinion and information saturating us. Everyone has a megaphone these days. \n\n*Emotion* is automatic, it reacts immediately. Most people pre-disposed to absorb and process news with their *emotion* will develop a right-leaning, conservative persona. They're easily triggered by hot button phrases so republican politicians campaign using words like 'freedom' and 'socialism' to fire up their base. (People *act* on emotion too - advertisers know this.)  This type of thinking reinforces itself the longer its held too - it leads to long held traditions, because no one wants to admit they've been wrong.\n\n\n*Reason* takes a little longer to process. You have to get over the initial emotion, weigh up pros-and-cons, consider all perspectives and internally debate ideas. This type of person generally identifies as 'left' or 'progressive', because 5 minutes of actual thought about healthcare, guns, wealth, debt, or pretty much any hot-button political issue shows how right Bernie Sanders is about everything.\n\nSo yeah, left and right 'identities' are really just a matter of emotion vs reason.\n\nStay skeptical folks, not cynical.",
            "title_similarity": "0.77127373",
            "sentiment_compound": 0.9415
        },
        {
            "id": "h0e0cs7",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.11788292"
        },
        {
            "id": "h0e12id",
            "score": 0,
            "text": "I don't think media and misinformation is to blame. At least not directly. I think the misinformation that's more circulated to right wing people is due to algorithms knowing that right wing people will click those things more often. Why? Because somewhere along the line science was politicized and is more left than right so the right attack it. Possibly due to religion being more right wing and being anti science and then being used in elections and PR campaigns by the right. To the extreme of people like Trump using anti science to feed into the right wing base and now it's a thing. Now online algorithms just feed into those echo chambers and in turn more and more of the right wing base is fed misinformation and it's a vicious cycle.",
            "title_similarity": "0.84721494",
            "sentiment_compound": -0.9325
        },
        {
            "id": "h0e1x4j",
            "score": 0,
            "text": "The least surprising thing I've ever read",
            "title_similarity": "0.25001496",
            "sentiment_compound": -0.2057
        },
        {
            "id": "h0e2i2t",
            "score": 0,
            "text": "Ya don’t say?!? And what exactly gave it away?",
            "title_similarity": "0.16304861",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0e36kr",
            "score": 0,
            "text": "I choose to believe... that I don't have the proper data from any reliable sources to formulate a valid opinion. If I did have sources, an informed decision would have been made.",
            "title_similarity": "0.5564649",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0e4g8m",
            "score": 0,
            "text": "Probably because they only get their political news in little digestible bits from right wing radio, highlight reels from fox, memes on social media and poorly summed up, telephone esq exaggerations in their right wing forums. \n\nAnd the entire semblance at the middle of all those things is \"you should be angry that people want change\" and in these days, after the year we just had. It takes ALOT of spin to the point of lunacy to justify that anger.",
            "title_similarity": "0.75120646",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h0e98if",
            "score": 0,
            "text": "Perhaps, but even truth is subjective to the media now.",
            "title_similarity": "0.5940373",
            "sentiment_compound": 0.4497
        },
        {
            "id": "h0e9g44",
            "score": 0,
            "text": "Also, conservatives are stupid",
            "title_similarity": "0.57961774",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0ea88x",
            "score": 0,
            "text": "Wouldn’t a better study be that conservative news outlets are more likely to spread misinformation and falsehoods?  I think the problem lies (get it?) lies here and would be much less insulting to conservatives as a whole.",
            "title_similarity": "0.8457906",
            "sentiment_compound": -0.874
        },
        {
            "id": "h0eb731",
            "score": 0,
            "text": "May be someone should harness the power of deep fake to spread real information e.g. a deep fake video of Trump telling his supporter to get vaccinated as an act of patriotism.",
            "title_similarity": "0.6503215",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h0ecylv",
            "score": 0,
            "text": "You mean this has all been a Republican Projection Project? Shocker.",
            "title_similarity": "0.5544493",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0ed3w8",
            "score": 0,
            "text": "I am Jack’s complete lack of surprise.",
            "title_similarity": "0.15410657",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0edfax",
            "score": 0,
            "text": "It's funny that most of the time i see these kind of post in science subreddit that are more inclined to politics than to science and its more funny that these post get more updates than the ones that really count",
            "title_similarity": "0.68003106",
            "sentiment_compound": 0.7264
        },
        {
            "id": "h0edjfi",
            "score": 0,
            "text": "I’m just here for the popcorn",
            "title_similarity": "0.17805144",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eehjb",
            "score": 0,
            "text": "Sounds like, in other words, conservatives LIE A LOT",
            "title_similarity": "0.7494526",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0eehrh",
            "score": 0,
            "text": "Good thing conservatives won’t see anything in this sub.",
            "title_similarity": "0.37949306",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0eelw9",
            "score": 0,
            "text": "I'd be interested in seeing age breakdowns of the conservatives and liberals assessed in this study. Anecdotally, conservatives may be older and liberals may be younger and due to growing up with a greater emphasis on assessing truthfulness, it may be that younger people are better able to determine truthfulness in reporting and they happen to be more liberal.",
            "title_similarity": "0.6965165",
            "sentiment_compound": 0.9217
        },
        {
            "id": "h0eepl9",
            "score": 0,
            "text": "Liberals and Conservatives need to all go one on one, naked in a cage match with garbage can lids and bicycle chains duct taped to their hands, the 'pro's' have over analyzed the situation to the point that the home audience might all either crush their heads in a vise, or simply yank their eyes out from boredom otherwise....how could any thinking mind believe any of the 'falsehoods', We're floating in a giant sea of 'falsehoods' ....readily devoured by the willing on both sides of the imaginary aisle. Carry on.",
            "title_similarity": "0.5017241",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0eewl9",
            "score": 0,
            "text": "When does science start making suggestions on how we might unravel these conundrums?",
            "title_similarity": "0.39748234",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eex75",
            "score": 0,
            "text": "New study shows republican dumb liberal smart",
            "title_similarity": "0.64622194",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0efsa1",
            "score": 0,
            "text": "this game s surprising to no one.",
            "title_similarity": "0.2256005",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0egle5",
            "score": 0,
            "text": "My father is an educated boomer conservative. The stuff he believes I’d probably have gotten a smack for as a child.",
            "title_similarity": "0.65391827",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eh3qk",
            "score": 0,
            "text": "Does it account for age? Old people will believe many things, with or without proof.",
            "title_similarity": "0.5507553",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ehzp1",
            "score": 0,
            "text": "I watched conservatism die on the vine. It’s sad. There are some valid precepts to the philosophy. Watching it getting eaten by a populist monster is poetically weird and unique to American racism and classism. A long story, but entirely predictable…",
            "title_similarity": "0.5828574",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h0eif6c",
            "score": 0,
            "text": "Right. Like believing this “study.”  The irony is reAl.",
            "title_similarity": "0.45679379",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0ejeag",
            "score": 0,
            "text": "Cool, another interesting sub that I have to filter because Americans are spamming their political propaganda.",
            "title_similarity": "0.7397316",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0ek085",
            "score": 0,
            "text": "This is a great study, and one that I will share with friends on both sides. Oh, and GO BUCKS!",
            "title_similarity": "0.36505142",
            "sentiment_compound": 0.8655
        },
        {
            "id": "h0emlqw",
            "score": 0,
            "text": "Ya f*cking think?! Problem is these people don’t believe in science. So someone needs to please come up with solutions to the problem.",
            "title_similarity": "0.55343735",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h0emzts",
            "score": 0,
            "text": "There was literally a study published recently that showed the opposite being true. \n\nEdit: Actually, it might have been that liberals are inclined to believe whatever the news says as true, not political falsehoods per se. I'll try to find it and link later.",
            "title_similarity": "0.785418",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h0en87f",
            "score": 0,
            "text": "The title of the article rubs me wrong. It seems to read that the differentiating causal force between believing political falsehoods or not is the political bent of the individual. That's just not right. The title (and the article) goes on to explain that the actual differentiating factor is that, of all misinformation out there, there is more in conservative political circles than liberal, but a later clarification can't make up for the first clause of the title being, perhaps ironically, dangerously close to a red herring. \n\nNot that I disagree with the article; I just have a personal vendetta against statements that confidently identify the wrong causal factors, especially if they appear in titles.\n\nA more neutrally descriptive title would be something like, \"Political information environment susceptibility to misinformation shown to be deeper in current conservative circles.\" But a more neutrally descriptive title wouldn't get as many clicks.",
            "title_similarity": "0.8335",
            "sentiment_compound": -0.5609
        },
        {
            "id": "h0ene67",
            "score": 0,
            "text": "Fear is an awful thing which usefulness has gone haywire",
            "title_similarity": "0.46574742",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h0eojb9",
            "score": 0,
            "text": "Hahahahaha.......yeah.\nO.k.",
            "title_similarity": "0.050508372",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eon5i",
            "score": 0,
            "text": "Science says my side right, your side wrong",
            "title_similarity": "0.4913114",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0er9k1",
            "score": 0,
            "text": "To be the essential difference is knowing you don’t know everything. Conservatives tend to overestimate their intelligence. A mind that inherently realizes they could be mistaken, even entertain the idea means they will be more likely to question what they know.",
            "title_similarity": "0.8099836",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0fgby4",
            "score": 0,
            "text": "im sure 5 minutes in varying FB groups would prove this to anyone.",
            "title_similarity": "0.22051461",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0cs68u",
            "score": -10,
            "text": "“Oh yeah will according to my own research it’s liberals who are more likely to believe falsehoods, remember guys you should always do your own research.”\n\nEdit: I’m trying to make a point that you can’t reason with conservatives. Your using scientific data against guys who do not believe in scientific data.",
            "title_similarity": "0.7909598",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0cukdx",
            "score": -10,
            "text": "Sorry... they are stupid.\n\nThey are too mentally lazy to vet information for accuracy.  They are too locked into ideology to think objectively.  They are too unwilling to learn about things they fear to break their biases.\n\nIt’s 10 different varieties of stupidity. Take your pick.",
            "title_similarity": "0.5782521",
            "sentiment_compound": -0.9062
        },
        {
            "id": "h0cx8yq",
            "score": 32,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0crckj",
            "score": 36,
            "text": "Full Study: [https://advances.sciencemag.org/content/7/23/eabf1234](https://advances.sciencemag.org/content/7/23/eabf1234)\n\nAbstract:\n\n>The idea that U.S. conservatives are uniquely likely to hold misperceptions is widespread but has not been systematically assessed. Research has focused on beliefs about narrow sets of claims never intended to capture the richness of the political information environment. Furthermore, factors contributing to this performance gap remain unclear. We generated an unique longitudinal dataset combining social media engagement data and a 12-wave panel study of Americans’ political knowledge about high-profile news over 6 months. Results confirm that conservatives have lower sensitivity than liberals, performing worse at distinguishing truths and falsehoods. This is partially explained by the fact that the most widely shared falsehoods tend to promote conservative positions, while corresponding truths typically favor liberals. The problem is exacerbated by liberals’ tendency to experience bigger improvements in sensitivity than conservatives as the proportion of partisan news increases. These results underscore the importance of reducing the supply of right-leaning misinformation.",
            "title_similarity": "0.73538256",
            "sentiment_compound": 0.9675
        },
        {
            "id": "h0eemc1",
            "score": 102,
            "text": "Why is it that this is the only kind of post I see from this sub?",
            "title_similarity": "0.18009755",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0chhmn",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0ct3kq",
            "score": 1,
            "text": "Well like we didn't know that.  Wait, should i believe this?",
            "title_similarity": "0.3005668",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0cwio6",
            "score": -1,
            "text": "Saving this for righteous indignation.",
            "title_similarity": "0.33685333",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0cyhsh",
            "score": 1,
            "text": "However, to suggest that “liberals”(or anyone else)  are less susceptible to misinformation is still a reach.\n\nHowever, I can see the facts that most “religious” types are more readily adept to believe false information etc.",
            "title_similarity": "0.6978731",
            "sentiment_compound": -0.235
        },
        {
            "id": "h0cz53r",
            "score": -1,
            "text": "Yea we know, but how do we get THEM to see this?",
            "title_similarity": "0.23952234",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0czyt1",
            "score": -1,
            "text": "They’re not falsehoods though, because they disagree that they’re false.  So that makes them true! And more importantly it then makes them right! And everyone else is then wrong and liars!  And so unfair.",
            "title_similarity": "0.6218424",
            "sentiment_compound": -0.8392
        },
        {
            "id": "h0d14j7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0d1m76",
            "score": -1,
            "text": "Might be because the \"higher quality\" news is behind a paywall most of the time now.",
            "title_similarity": "0.7196716",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d2c0e",
            "score": 1,
            "text": "How much more though?? 1% doesn’t mean anythimg.",
            "title_similarity": "0.36899525",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d2q2g",
            "score": -1,
            "text": "Fear is the mind killer",
            "title_similarity": "0.4810455",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h0d3yzr",
            "score": -1,
            "text": "Most replies in this comment thread are just so sad to see. Instead of judging please try to be a little more open minded towards one another guys and girls, please.",
            "title_similarity": "0.5721716",
            "sentiment_compound": -0.1005
        },
        {
            "id": "h0d5dwa",
            "score": -1,
            "text": "Wait, is this true or false information??",
            "title_similarity": "0.3710073",
            "sentiment_compound": 0.5588
        },
        {
            "id": "h0d5mkl",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0d6gaf",
            "score": -1,
            "text": "All the facts are behind paywalls.",
            "title_similarity": "0.33505464",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d7kvh",
            "score": -1,
            "text": "I love the smug or salty knee-jerk reactions to this study.",
            "title_similarity": "0.48684862",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h0d9qlz",
            "score": -1,
            "text": "Who does political science help?",
            "title_similarity": "0.4714852",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0dccka",
            "score": 1,
            "text": "Not a single mention of the controls. For instance, did they adjust for educational attainment and *age*?",
            "title_similarity": "0.2619294",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0de45t",
            "score": -1,
            "text": "This is the most ironic thing I’ve ever seen. Not even kidding.",
            "title_similarity": "0.3452293",
            "sentiment_compound": -0.2707
        },
        {
            "id": "h0degj2",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.0965688"
        },
        {
            "id": "h0df8hh",
            "score": 1,
            "text": "A feather.\n\nYou could have knocked me over with a feather.",
            "title_similarity": "0.362383",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dg0gh",
            "score": -1,
            "text": "Ah such science much yes",
            "title_similarity": "0.1992404",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0dgkf3",
            "score": -1,
            "text": "1. And yet you're buying into this hook, line and sinker.\n\n\n2. The problem is \"political falsehoods\". Try focusing on the problem.",
            "title_similarity": "0.6781075",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h0di03j",
            "score": 1,
            "text": "Hahaha reading the source then coming to read the comments is glorious. You could make an r/Facepalm compilation out of this with how clear it is who read only the headline.",
            "title_similarity": "0.45419294",
            "sentiment_compound": 0.886
        },
        {
            "id": "h0di9ba",
            "score": -1,
            "text": "If Conservatives are 10x more likely to be wrong, they are 100x more likely to get called out on it.",
            "title_similarity": "0.70806175",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0dibhr",
            "score": -1,
            "text": "Uh...huh huh.  Uh...I believe this post is correct cause I is Conservative.  Uh...huh huh, he said glut...",
            "title_similarity": "0.5054115",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dibpy",
            "score": -1,
            "text": "The problem with this \"science\", which undermines the validity of the entire experiment, is labeling people as *Liberal* or *Conservative*. The bias, divisiveness, and cognitive dissonance in the response to this \"study\" is brilliant satire and an interesting study in itself.",
            "title_similarity": "0.77944255",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0dip8n",
            "score": -1,
            "text": "Yeah, I always suspected CNN of being ultra conservative.",
            "title_similarity": "0.53267115",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0dk6oz",
            "score": -1,
            "text": "Right?  I remember when they fell for that 'created in a lab' bs...",
            "title_similarity": "0.38844007",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0dk6rv",
            "score": -1,
            "text": "Who determines what's politically false?",
            "title_similarity": "0.4575447",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dlgk3",
            "score": -1,
            "text": "It's amazing to see that r/science has become a partially political propaganda sub.  Great job posting peer review analysis that don't include left or right leaning biases.",
            "title_similarity": "0.65661955",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h0dm7zb",
            "score": -1,
            "text": "Liberals: “Listen to the science”\n\nThe science: “CoNsErVaTiVeS r DuMB”",
            "title_similarity": "0.67342347",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dmc7w",
            "score": -1,
            "text": "Clinton Foundation got 145 million from people benefitting from Uranium One deal. No direct evidence of quid quo pro.",
            "title_similarity": "0.47857788",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0dped8",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0965688"
        },
        {
            "id": "h0dq2kr",
            "score": 1,
            "text": "Not political just science",
            "title_similarity": "0.22355622",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dq8f9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09656878"
        },
        {
            "id": "h0dqbtg",
            "score": 1,
            "text": "ybh i think this article is more accurate if you say, \"The elderly is more susceptible to political falsehoods.\"",
            "title_similarity": "0.79823005",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0drhhy",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.0965688"
        },
        {
            "id": "h0du8ic",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dyujo",
            "score": 1,
            "text": "I feel like the older we get the more conservative we become towards what was our norm even as far back as since we were children. As the world progresses and the times change into something we’re unfamiliar with, we’ll feel hesitant and uncertain leading us to return to our comfort zone, gravitating around what life was like for us.\n\nPerhaps in the far future, there might be medically beneficial uses for crack and heroin. Perhaps socioeconomic issues will shift to eugenics with the advances in gene editing such as CRISPR. Perhaps cryptocurrency will become the universal form of currency and everything else is abolished — Things we can’t wrap out minds around but future generations will have to deal with.",
            "title_similarity": "0.70281947",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0e5j1i",
            "score": 1,
            "text": "No wonder meme culture hates Ohio",
            "title_similarity": "0.4261211",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h0e63i0",
            "score": -1,
            "text": "This is not a surprise",
            "title_similarity": "0.038092386",
            "sentiment_compound": -0.2057
        },
        {
            "id": "h0ed1x8",
            "score": 1,
            "text": "What if this is a lie? Just to fan the flame's.",
            "title_similarity": "0.42117518",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0eeida",
            "score": 1,
            "text": "Hahahaha! This is ironic!!",
            "title_similarity": "0.24638529",
            "sentiment_compound": -0.3348
        },
        {
            "id": "h0ejp2i",
            "score": -1,
            "text": "Well...this is obvious to anyone who isn’t a conservative",
            "title_similarity": "0.2537167",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ekcet",
            "score": -1,
            "text": "I'm assuming everyone came here to say: \"Umm yeah, there needed to be a study for that?\"",
            "title_similarity": "0.34912294",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0el1ws",
            "score": 1,
            "text": "True as this is from my perspective, what is the point of these studies if only one group of people is going to be inclined to believe them?",
            "title_similarity": "0.5557937",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0elk02",
            "score": 1,
            "text": "I was curious to see if conservatives had a character trait that made them more susceptible to misinformation. It seems it's mainly the media:\n>Conservatives and liberals were equally good at detecting truths and falsehoods when most true stories were labeled politically neutral.",
            "title_similarity": "0.86658037",
            "sentiment_compound": 0.8191
        },
        {
            "id": "h0enevj",
            "score": 1,
            "text": "Does anyone know of the site that reports which studies did not replicate in subsequent research? I thought it had a straightforward domain like DidNotReplicate.com but cannot find it. \n\nI also highly recommend people check this from time to time as so much research with \"blockbuster\" findings get retracted.\n\nhttps://retractionwatch.com/",
            "title_similarity": "0.6208785",
            "sentiment_compound": 0.8954
        },
        {
            "id": "h0enh27",
            "score": 1,
            "text": "I would be very interested to note how many conservative are NPD, low functioning sociopaths, and psychopaths.",
            "title_similarity": "0.5998101",
            "sentiment_compound": 0.2247
        },
        {
            "id": "h0eowhg",
            "score": 1,
            "text": "Or perhaps this is just more misinformation created to justify their own bias",
            "title_similarity": "0.60249645",
            "sentiment_compound": -0.1815
        },
        {
            "id": "h0eqfrv",
            "score": -1,
            "text": "In my experience, conservatives are susceptible to all kinds of falsehoods, not just political ones.",
            "title_similarity": "0.76314056",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eu3k5",
            "score": 1,
            "text": "the right has always been based in misinformation \ntheir schtick is to exacerbate social tensions and pit people against one another for the sake of a manipulative few who use these sufferings to amass petty wealth at the expense of peace and the future.",
            "title_similarity": "0.6650295",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0euk6v",
            "score": 1,
            "text": "Now be honest... how many of you checked the sources on this?",
            "title_similarity": "0.35772794",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0ew3j9",
            "score": -1,
            "text": "Liberals spent the last year believing that the lab-leak hypothesis was a nut job conspiracy theory, so I dunno.",
            "title_similarity": "0.6958183",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0ewnsw",
            "score": 1,
            "text": "Seems like everyone is pro science until it's perceived to attack what they believe.",
            "title_similarity": "0.61482024",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h0exgro",
            "score": 1,
            "text": "I mean, doesn’t that make sense? Most popular conspiracy theories tend to shift right on one issue or another, and by right I mean conserve or regress.",
            "title_similarity": "0.71009845",
            "sentiment_compound": -0.1494
        },
        {
            "id": "h0f57iu",
            "score": 1,
            "text": "How does this study know what is an actual fact and what is false? Remember when all the conservatives were saying that the virus was made in a lab and liberals scoffed at the idea. Well now.... something about leaked emails... Conservatives generally think critically whereas liberals are told what to think.\n\nI think this study is complete nonsense and maybe it's a falsified study to catch out conservatives,",
            "title_similarity": "0.7786487",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h0fsefa",
            "score": 1,
            "text": "It's the same on both sides. Just look at the damage done by the me too movement. People are idiots regardless of their political affiliate",
            "title_similarity": "0.5903049",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0ft4zl",
            "score": -1,
            "text": "Is anyone even liberal these days?",
            "title_similarity": "0.45750597",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0g0orm",
            "score": 1,
            "text": "\"Conservatives more susceptible than liberals to believing political falsehoods,\" It's called reaching, and conservatives do it best.",
            "title_similarity": "0.87837857",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h0g1d5x",
            "score": 1,
            "text": "PragerU on YouTube ads to classrooms. Full of right wing nationalist propaganda and not so subtle hate speech.\n\nhttps://prospect.org/education/right-curriculum-how-prageru-infiltrates-schools/\n\n\nhttps://gizmodo.com/a-school-in-ohio-assigned-youtube-videos-from-fake-righ-1845428756\n\n\nhttps://www.rawstory.com/prager-university-in-public-schools/",
            "title_similarity": "0.589706",
            "sentiment_compound": 0.2969
        },
        {
            "id": "h0gtxfo",
            "score": 1,
            "text": "Hey r/science. Get out of politics. People who actually love science are tired everything being political. Qanon accepts that  they’re idiot outcast. Blueanon is in denial and just as dangerous.",
            "title_similarity": "0.6601027",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0gvie7",
            "score": 1,
            "text": "This is one of those studies where smart, informed people say “well, duhhhh” and no one else sees it. Literally the biggest waste of freaking time.",
            "title_similarity": "0.5456102",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h29d7on",
            "score": -1,
            "text": "Liberals are more susceptible to believing political falsehoods, a clear majority of the U.S. finds. The main driver is the glut of propaganda being paid for by Goerge Soros as well as big pharma paying off the government to kill everyone with opioids and get richer. Although pharmaceutical companies make up 20 of the 30 richest companies in the world, It was also discovered that since Joe Biden was unable to defeat anyone in 2016, therefore it is ultimately unlikely he defeated anyone in 2020, results showed.",
            "title_similarity": "0.7825335",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h0cfnc7",
            "score": 876,
            "text": "Nowadays all news should be researched.  So much bias, cannot believe most at face value.",
            "title_similarity": "0.6084459",
            "sentiment_compound": 0.2466
        },
        {
            "id": "h0df6go",
            "score": 6,
            "text": "I ran across this quote in a book I'm reading and it really brought some clarity to this phenomenon to me.  \"Myth has its own furious, inherent reason-to-be because it is tied to desire.  Prove it false a hundred times, and it will still endure because it is true as an expression of feeling.\" -Elizabeth Janeway",
            "title_similarity": "0.6011061",
            "sentiment_compound": 0.6444
        },
        {
            "id": "h0ee0pi",
            "score": 75,
            "text": "Hmmm....another one for the mythical r/politicalscience sub",
            "title_similarity": "0.45136064",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eb079",
            "score": 8,
            "text": "I think this is a political falsehood",
            "title_similarity": "0.57999146",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0cmgft",
            "score": 3473,
            "text": ">Conservatives also showed a stronger “truth bias,” meaning that they were more likely to say that all the claims they were asked about were true. “That’s a problem because some of the claims were outlandish – there should have been no ambiguity about whether they were true or not,” he said.\n\nI find that part interesting. Basically, \"I saw it on TV / social media - it must be true\".",
            "title_similarity": "0.7925643",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h0d57zq",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0cvz8c",
            "score": -2,
            "text": "They had to do a *study* to find this out?",
            "title_similarity": "0.3547808",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0cw161",
            "score": 2,
            "text": "I find American politics to be very strange \nFrom what I know about conservative principle where I live and from what I see from conservatives I know the opposite seems to be true where I live\nLots of researching a topic and considering different variables \n\nThan again we didn’t have an election like you guys Did a few months ago",
            "title_similarity": "0.7422044",
            "sentiment_compound": 0.4951
        },
        {
            "id": "h0cwidj",
            "score": -2,
            "text": "Could it also be that conservatives tend to be close-minded individuals?\n\nThat's not an insult, either. Conservatives do have a higher tendency towards a smaller world view and are less likely to push boundaries. It's really hard to learn and employ critical thinking when you do both of those things.\n\nSo I think it's less that there just happens to be more misinformation in the conservative spheres and more that because conservatives are less likely to actually think critically, there's by nature more misinformation in their sphere.\n\nIt's a one-two punch.",
            "title_similarity": "0.80053663",
            "sentiment_compound": -0.668
        },
        {
            "id": "h0d4bj0",
            "score": -2,
            "text": "Using ‘Glut’ in a scientific article huh",
            "title_similarity": "0.40565264",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d8thm",
            "score": -2,
            "text": "I'm pretty sure this is a trick...",
            "title_similarity": "0.27498218",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h0d8wes",
            "score": -2,
            "text": "As a lefty, I am inclined to believe believe this. Shall I read the article and think on it? ... No.",
            "title_similarity": "0.44571954",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d94pp",
            "score": -2,
            "text": "Wonderful irony here with the amount of Liberal people blindly believing in the click bait title AND saying a bog standard smart ass comment about how superior they are... \n\nI mean the articles says both sides are equally likely to be fooled, and even if it did say Conservatives are more likely to be swayed- why would u believe the article immediately? If it said Liberals are more easily fooled then you would challenge the message and research it right?\n\nNot going to do any research on your own and instead just regurgitate anything you read randomly from a site?",
            "title_similarity": "0.8188226",
            "sentiment_compound": 0.6433
        },
        {
            "id": "h0d97de",
            "score": -2,
            "text": "The basis of the entire study starts with a selection bias.\n\n>Over a 6-month period, spanning January through June 2019, we used a social media monitoring service to identify 20 of the most viral political news stories, 10 true and 10 false, every 2 weeks. This provided a systematic method for selecting high-profile claims, balanced by veracity, and ensuring that our belief accuracy measures are not unduly swayed by idiosyncratic judgments about topic importance. At the same time, we fielded a 12-wave political beliefs panel with a large representative sample of Americans (see table S1 for sample demographics). Each survey was conducted in the week following the observation of the viral news stories, allowing us to assess participants’ beliefs in a series of short statements about the selected high-profile topics (hereafter, belief statements).\n\nThe results will simply reflect whatever the social media monitoring service deems to be more true or more false and with an arbitrary cut off of \"20 most viral\"\n\nWork of this low quality shouldn't be published.",
            "title_similarity": "0.55978316",
            "sentiment_compound": 0.6826
        },
        {
            "id": "h0d9ewk",
            "score": -2,
            "text": "This has been debunked",
            "title_similarity": "0.25162005",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d9q7f",
            "score": -2,
            "text": ">Another statement – a false one – was “While serving as Sec. of State, Hillary Clinton colluded with Russia, selling 20% of the U.S. uranium supply to that country in exchange for donations to the Clinton Foundation.”\n\n>Here, only 2% of Democrats said this was “definitely true,” but 41% of Republicans did.\n\nWhy dont these researchers understand that people are answering according to their political bias? If you asked this group if the statement \"Donald Trump was proven to have colluded with Russians to impact the 2016 election\" I *guarantee* those numbers would flip parties.",
            "title_similarity": "0.72069633",
            "sentiment_compound": 0.6652
        },
        {
            "id": "h0da4ub",
            "score": -2,
            "text": "Yeah right. https://independentchronicle.com/survey-shows-biden-voters-less-informed-than-trump-voters/",
            "title_similarity": "0.60509753",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0daevg",
            "score": -2,
            "text": "Fox and CNN should not be able to put ‘news’ anywhere in their names, show listings, or on the screen during broadcasts.",
            "title_similarity": "0.33274788",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dbfck",
            "score": -2,
            "text": "Reddit moment for sure",
            "title_similarity": "0.27385652",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0dbgd4",
            "score": -2,
            "text": "The irony of this is palpable",
            "title_similarity": "0.2901221",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0dbnnv",
            "score": -2,
            "text": "The irony in this article and in these comments is laughable...",
            "title_similarity": "0.5140799",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dbyfh",
            "score": -2,
            "text": "That study is quite flawed. Looking over table S1 it’s clear that there are some way out there lies and then there are truths mixed with a detail that makes it false",
            "title_similarity": "0.6452408",
            "sentiment_compound": -0.2006
        },
        {
            "id": "h0dgl7x",
            "score": -2,
            "text": "This article could be made up and everyone here got trolled. Just to play devil’s (and humor’s) advocate.",
            "title_similarity": "0.4976514",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0dgwg5",
            "score": -2,
            "text": "If you guys want to see something interesting about politics and propaganda, check out the beautiful “meme” sharing app known as iFunny. It’s hard to tell wich papaya are trolling and wich ones are posted with serious intent. It’s nuts",
            "title_similarity": "0.6036223",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h0dhkjp",
            "score": -2,
            "text": "CNN the only truth is this world",
            "title_similarity": "0.2835148",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0dhoeq",
            "score": -2,
            "text": "From my experience this isn’t true.  Im more left leaning but I’m finding both sides being more extreme, believing only the bubble they live in, and only believing what fits their agenda.  The extremes on both sides is only causing this gap to widen.  The biggest issue Is neither side is willing to meet in the middle and have dialogue.\n\nI’d say the right maybe slightly believe political\nFalsehoods more, but the left liberals without a doubt do the same.",
            "title_similarity": "0.79743767",
            "sentiment_compound": 0.5522
        },
        {
            "id": "h0dkj46",
            "score": -2,
            "text": "Do you mean false information like lab leaks?",
            "title_similarity": "0.48144192",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0doach",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dolwe",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dx2cv",
            "score": 2,
            "text": "If you can be convinced that trickle down economics works, you can be convinced of anything.",
            "title_similarity": "0.37574506",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h0e025x",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0e2x0u",
            "score": -2,
            "text": "You have got to be kidding me. All of the media is left leaning. All of it except for Fox. All of social media is left leaning. And all of it is misinformation and lying. Maybe conservatives are more susceptible but I’ll never believe that there’s more lying right wing media than there is lying left wing media",
            "title_similarity": "0.7294777",
            "sentiment_compound": -0.923
        },
        {
            "id": "h0e535u",
            "score": 2,
            "text": "This is categorized in the /Science subreddit, so it can’t be true.  Going back to learning on my Facebook.",
            "title_similarity": "0.48937058",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0e6cvk",
            "score": -2,
            "text": "Bullshit. You’re both equally retarded and mislead. Where do you think this has come from? Who do you think spreads it and for what reason? It’s pretty simple.",
            "title_similarity": "0.5346046",
            "sentiment_compound": -0.6868
        },
        {
            "id": "h0efajp",
            "score": -2,
            "text": "Garbage in, liberal B.S. out.",
            "title_similarity": "0.439457",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ekkus",
            "score": -2,
            "text": "A main driver is most of them being blindingly stupid morons, just like their orange buffoon godfather.",
            "title_similarity": "0.58876884",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0es0q2",
            "score": 2,
            "text": "Who defines what the political falsehood is?",
            "title_similarity": "0.53354955",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ew4at",
            "score": 2,
            "text": "I live in Sweden. I don't want to see American politics all the god damn time, especially not on a \"science\" sub of all places. Just stop it :(",
            "title_similarity": "0.4949743",
            "sentiment_compound": -0.7115
        },
        {
            "id": "h0ex44j",
            "score": 2,
            "text": "The [podcast](https://www.stitcher.com/show/youre-wrong-about)\"You're Wrong About\" did a whole episode on this. In summary they said the conservative media ecosystem is clustered around almost pure misinformation. Liberals tend to get news from CNN and NYT which do have biases (thank you Chomsky and Hermann) but can't hold a candle to the conservative spin.",
            "title_similarity": "0.7994213",
            "sentiment_compound": -0.2049
        },
        {
            "id": "h0ezjc5",
            "score": 2,
            "text": "Hmmm. Funny, I dont see conservatives walking around with 2 masks outside after getting an experimental gene therapy concoction for a fake virus ....because the government told them the vaccine was safe and to still wear 2 masks after getting it to protect them from a deadly virus that doesn't exist",
            "title_similarity": "0.5630831",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h0f6x17",
            "score": 2,
            "text": "I think it all depends on your biases and what you WANT to believe. We see it with both the left and the right. \n\nJust look at how the left totally dismissed the lab leak cause because it was Trump who said it. Even the media is saying they dismissed it because it was Trumps idea. \n\nBoth sides believe their political falsehoods because it’s what they want. It’s confirmation bias.",
            "title_similarity": "0.7311102",
            "sentiment_compound": -0.1197
        },
        {
            "id": "h0fepb7",
            "score": 2,
            "text": "what if this is left leaning confirmation bias!??",
            "title_similarity": "0.44688284",
            "sentiment_compound": -0.2621
        },
        {
            "id": "h0fqfie",
            "score": 2,
            "text": "I’m all for holding conservative type ideologies accountable for misinformation. \n\nBut are we all ready to hold ourselves accountable for dismissing the lab leak hypothesis? Regardless of ideology?",
            "title_similarity": "0.68587494",
            "sentiment_compound": -0.2168
        },
        {
            "id": "h0gitp5",
            "score": 2,
            "text": "Well yeah...\n\n53% of Republicans still think Trump is president.\n\nhttps://www.reuters.com/world/us/53-republicans-view-trump-true-us-president-reutersipsos-2021-05-24/\n\nI'd be embarrassed to call myself a republican.",
            "title_similarity": "0.6918343",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0cx5yd",
            "score": -2,
            "text": "This is because Conservatism is a political falsehood.",
            "title_similarity": "0.6876524",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0d4xwk",
            "score": 4,
            "text": "That’s why I don’t believe this article!",
            "title_similarity": "0.41455355",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0dc4ow",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dfa9x",
            "score": -3,
            "text": "What happened to this sub. It's nothing but politics now. Are there any science subs that are actually good?",
            "title_similarity": "0.51350844",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h0dxmsm",
            "score": 2,
            "text": "Also, maybe it is because they are just plain stupid and ignorant.",
            "title_similarity": "0.45678937",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h0e3kee",
            "score": -3,
            "text": "Liberals suppress every conservative news outlet and people who even look at conservative media are portrayed as a joke.\n\nEven conservative politicians are portrayed as a joke. The way Trump has been treated is a clear example of how conservatives are treated.\n\nSorry for the rant, but this is a fact. The only way to solve this problem is to have a media policy institution that oversees the media and managed by the government. this institution should provide a voice for people of all beliefs of political spectrum represented in that policy institution.",
            "title_similarity": "0.7988781",
            "sentiment_compound": -0.3894
        },
        {
            "id": "h0e5xj1",
            "score": 4,
            "text": "I can just hear the feral screeching of yokels reading this headline.",
            "title_similarity": "0.35814106",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eeo7g",
            "score": 2,
            "text": "Wouldn't it be funny if the study itself was a political falsehood?",
            "title_similarity": "0.654099",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h0efrqi",
            "score": 3,
            "text": "It’s obvious, no? And what’s even the point of this study? The left knows it and the right won’t believe it because it’s science.",
            "title_similarity": "0.5767524",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ejr0e",
            "score": 3,
            "text": "According to a new study, people will believe anything that is reported as \"a new study\"",
            "title_similarity": "0.48386225",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ek5bj",
            "score": 2,
            "text": "How many liberals believed that biden would be pushed left? M4A? Student loan relief? $15 minimum wage? How many voters believed those falsehoods?",
            "title_similarity": "0.6770294",
            "sentiment_compound": 0.6199
        },
        {
            "id": "h0enmzb",
            "score": 3,
            "text": "I'm guessing this study will not generate the level of introspection that it maybe should.",
            "title_similarity": "0.4451552",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0f08n2",
            "score": 3,
            "text": "Here's the science. CONSERVITARDS BAD LIBERALS GOOD.\n\nUgh get this political garbage out of my face before I vomit.",
            "title_similarity": "0.6781204",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0f0esh",
            "score": 4,
            "text": "I think this is highly dubious claim considering the vast number, likely a majority, of liberals who believed the RussiaGate story for years while seeing no evidence at all.",
            "title_similarity": "0.6142873",
            "sentiment_compound": -0.5709
        },
        {
            "id": "h0f3umt",
            "score": -2,
            "text": "I really hope someone tries posting this on the conservative sub.",
            "title_similarity": "0.545163",
            "sentiment_compound": 0.4927
        },
        {
            "id": "h0f74me",
            "score": 3,
            "text": "Doesn’t anyone find the amount of “scientific studies” of political bias kind of odd? Maybe it’s legit, maybe it’s not. Either way, isn’t it more important to put efforts towards climate change, disease research and the like? \n\nHow many actual scientists are there to perform these “scientific studies”? \n\nAlso, out of curiosity, does anybody even know an individual who has been “studied” or anyone who is conducting these studies?",
            "title_similarity": "0.70357394",
            "sentiment_compound": 0.4316
        },
        {
            "id": "h0fqyue",
            "score": 2,
            "text": "Right leaning misinformation in the media? Uh where? All I see is left leaning media when I turn on the tv.",
            "title_similarity": "0.51306367",
            "sentiment_compound": -0.3939
        },
        {
            "id": "h0ev1ek",
            "score": 4,
            "text": "Truth has a liberal bias.",
            "title_similarity": "0.6244228",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0ezjgi",
            "score": 5,
            "text": "I thought this was r/science? Do the mods here just not care how political the sub gets?",
            "title_similarity": "0.6187193",
            "sentiment_compound": -0.4567
        },
        {
            "id": "h0f2xvs",
            "score": -5,
            "text": "Another main driver is that conservatives tend to be dumber.",
            "title_similarity": "0.71799856",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0fv4d5",
            "score": 4,
            "text": "yeah, no. this is dumb, liberals are just as delusional as conservatives (if not more)",
            "title_similarity": "0.7156812",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0cpu4g",
            "score": 73,
            "text": ">“But the deck is stacked against conservatives because there is so much more misinformation that supports conservative positions. As a result, conservatives are more often led astray.”\n\nSeems like a great way to gaslight people. Create a bunch of fake bs, circulate it, then point at people who share it.",
            "title_similarity": "0.88035464",
            "sentiment_compound": 0.7722
        },
        {
            "id": "h0cp484",
            "score": 47,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0f2u6z",
            "score": 16,
            "text": "r/politicalscience pls rename it finally",
            "title_similarity": "0.3467795",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0fbkxn",
            "score": 6,
            "text": "And there you go, more divisiveness to keep people fighting. Sad very very sad.",
            "title_similarity": "0.4983909",
            "sentiment_compound": -0.8508
        },
        {
            "id": "h0ch2ce",
            "score": 2041,
            "text": ">One of the major issues identified in the study was that these widely shared truths and falsehoods have different implications for liberals and conservatives.\nTwo-thirds (65%) of the high-engagement true statements were characterized as benefiting liberals, while only 10% of accurate claims were considered beneficial to conservatives. On the other side, 46% of falsehoods were rated as advantageous to conservatives, compared to 23% of false claims benefiting liberals.\n\nThis \"Falsehoods were rated advantageous\" may played a significant role in the results since they're twice likely to give advantage to Conservatives than liberals",
            "title_similarity": "0.8275004",
            "sentiment_compound": 0.959
        },
        {
            "id": "h0fz2o7",
            "score": 5,
            "text": "And yet, conservatives are painted as spreading conspiracies and misinformation, but those same conspiracies are come out as true later. Case in point, COVID-19 coming from a lab, Fauci and the CDC actually not following the science, etc. \nThis study is a farce.",
            "title_similarity": "0.76764417",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0g3ev3",
            "score": 21,
            "text": "Right bad left good, it’s science!",
            "title_similarity": "0.37616235",
            "sentiment_compound": -0.2244
        },
        {
            "id": "h0dp6k9",
            "score": 1403,
            "text": "I really hate how hard and time consuming it is to find truthful/factual information. Like why is it even a thing to spread lies? Messed up.\n\nEdit: I know why the lies are spread (agendas, greed, money, etc. etc) I’m just baffled that people choose that over a clean conscience.",
            "title_similarity": "0.66407007",
            "sentiment_compound": -0.8795
        },
        {
            "id": "h0czavy",
            "score": 325,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0fx8n5",
            "score": 16,
            "text": "Yay politics in science...",
            "title_similarity": "0.48018065",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h0filem",
            "score": 31,
            "text": "This seems to have turned into a politically sub instead of a science one.",
            "title_similarity": "0.5368933",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0cvzpq",
            "score": 1,
            "text": "\"main driver\" seems to imply some sort of causation, while I'm not sure that this relationship is causal.",
            "title_similarity": "0.43558037",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h0cwy5z",
            "score": 1,
            "text": "The urge to believe is strong",
            "title_similarity": "0.29770258",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0d2983",
            "score": 1,
            "text": "Ooooooo this going to be a fun comment section. Why don't I jump right in",
            "title_similarity": "0.32871574",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h0dea9l",
            "score": 1,
            "text": "What would be really interesting would be to correlate this with brain imaging differences between conservatives and liberals. The main findings to far have been in the amygdala and anterior cingulate, last time I checked.",
            "title_similarity": "0.7622541",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h0dgpnc",
            "score": 1,
            "text": "\"How we gonna keep 'em on the farm once they've seen the bright lights?\" people have said since the Pharaohs.",
            "title_similarity": "0.31256583",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0dmj43",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09656878"
        },
        {
            "id": "h0drv79",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dt6qi",
            "score": 1,
            "text": "I saw an interesting comment from an opinion writer (I think) that said that a lot of the \"news\" on the Right is by opinion/commentary/\"entertainment\" people, and there's a dearth of actual honest journalists. \n\nThat might lead to more of the \"information\" from the Right is actually biased instead of neutral(ish) because there are fewer journalists digging for and presenting information. \n\nI wonder if there's a tally somewhere on how many actual journalists there are working for each \"left\" and \"right\" outlets?",
            "title_similarity": "0.77117205",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h0dt6sy",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dtyqu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0du3qc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.096568726"
        },
        {
            "id": "h0dubh3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09656878"
        },
        {
            "id": "h0e0ws7",
            "score": 1,
            "text": "It's right there in the name.",
            "title_similarity": "0.009161515",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0e2pcj",
            "score": 1,
            "text": "Just stop your whining. You know man cannot fly.",
            "title_similarity": "0.2879477",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0e75un",
            "score": 1,
            "text": "Liberals and Conservatives must have a different meaning here in Australia. They are basically one and the same.",
            "title_similarity": "0.52173734",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0e7tmq",
            "score": 1,
            "text": "Takes a full study to know that people who watch a news source that ADMITS to not being news source are more likely to believe political falsehoods?",
            "title_similarity": "0.83003294",
            "sentiment_compound": 0.4466
        },
        {
            "id": "h0ebizx",
            "score": 1,
            "text": "What's a political falsehood?",
            "title_similarity": "0.5151922",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ec4zd",
            "score": 1,
            "text": "Shout out to everyone sharing this on social media without opening the article.",
            "title_similarity": "0.30732524",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0ec6xp",
            "score": 1,
            "text": "I took a short look at the study. At first glance it seems that the questions were politically charged, in that the questions themselves  seem designed to provoke a response depending on which \"side\" the respondents are on. I would place more stock in the results if the question had been more rooted in the psychology rather than in the current political environment. As someone who is skeptical in general of these kind of studies it concerns me as to why it was done, to what end the data is intended to be used for, and how initially biased the methodology is. I'll keep reading through it, but if a researcher or scientist is really looking to determine who is more susceptible to being misled, and whom is merely skeptical, there may have been a better way of accomplishing it.",
            "title_similarity": "0.7704015",
            "sentiment_compound": -0.3716
        },
        {
            "id": "h0eeuyi",
            "score": 1,
            "text": "Mmm! Just the confirmation bias I needed.",
            "title_similarity": "0.43489623",
            "sentiment_compound": -0.1759
        },
        {
            "id": "h0egu10",
            "score": 1,
            "text": "I thought glut meant less?",
            "title_similarity": "0.3157729",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eh16t",
            "score": 1,
            "text": "Study of 1200 is useless",
            "title_similarity": "0.3045186",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0ehr66",
            "score": 1,
            "text": "The biggest issue is there is NO repurcussion of falsehoods in media and thats on left and right. Put out any article backed with no evidence that is later proved false and nothing happens. Remember covid-19 cause kawasaki disease in kids? Yea..... no one ever got even a slap on the wrist for that nonsense.",
            "title_similarity": "0.403943",
            "sentiment_compound": -0.8091
        },
        {
            "id": "h0ejufz",
            "score": 1,
            "text": ">I really hate how hard and time consuming it is to find truthful/factual information.\n\nso much info yet so much crap to wade through",
            "title_similarity": "0.5104111",
            "sentiment_compound": -0.8193
        },
        {
            "id": "h0ekc8m",
            "score": 1,
            "text": "@r/science there is Science then there is $cience. Both exist today.",
            "title_similarity": "0.30440885",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0elj7g",
            "score": 1,
            "text": "I'm curious as to how this would comport with this Rasmussen Poll. [https://www.rasmussenreports.com/public\\_content/politics/partner\\_surveys/conservative\\_viewers\\_are\\_better\\_informed\\_about\\_important\\_topics](https://www.rasmussenreports.com/public_content/politics/partner_surveys/conservative_viewers_are_better_informed_about_important_topics)",
            "title_similarity": "0.75974655",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0em8ho",
            "score": 1,
            "text": "While there may be an extremely large amount of right leaning misinformation die to people intentionally spreading it for money, remember there is still misinformation on the left due to extremists and the uneducated spreading their ignorance. Always remain vigilant.",
            "title_similarity": "0.71404594",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h0emdku",
            "score": 1,
            "text": "I love the saltiness here hah",
            "title_similarity": "0.24209681",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0enyko",
            "score": 1,
            "text": "That's what happens when one has a history of lying to get votes. They're decades of lies deep with no education to help the get real answers and enough instilled hate to not care",
            "title_similarity": "0.6416271",
            "sentiment_compound": -0.9007
        },
        {
            "id": "h0eo6ds",
            "score": 1,
            "text": "But they won’t believe the finding of this study... go figure 🤦🏻‍♀️",
            "title_similarity": "0.46443027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0epyzw",
            "score": 1,
            "text": "Glut of disinformation...and there just greedy, self serving stupid people....",
            "title_similarity": "0.4861777",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0eqmol",
            "score": 15,
            "text": "I’m a conservative and I believe this therefore it must be false?",
            "title_similarity": "0.58892524",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eqnvd",
            "score": 1,
            "text": "The sample size is only 1204 people....",
            "title_similarity": "0.1903565",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0erat1",
            "score": 3,
            "text": "I think this study may have a bit of a bias to it. According to the article, the researchers themselves identified the statements and whether or not they were true. Their data then showed that both liberals and conservatives have confirmation bias. But it also demonstrated that much of the conservative/liberal difference is due to a difference in how often statements that supported the subjects position were true/false. Even though they had a separate sample group identify the political leaning of the statement, they may have selected statements in a biased manner. They said themselves that the true statements they selected trended towards liberal viewpoints, and the false ones towards conservative viewpoints.\nThey should have had artificial non-political statements to mitigate their own bias and to remove confirmation bias. Alternatively, they could have presented an equal number of right/left leaning statements, with equal compositions of true statements, to measure a more objective comparison of the strength of confirmation bias on both sides.\nThis study seems to have tried to get the results from both options at once. This caused them to fail to get proper results from either.",
            "title_similarity": "0.83046865",
            "sentiment_compound": 0.5905
        },
        {
            "id": "h0eskpn",
            "score": 1,
            "text": "Ya'll should just primarily be looking at Associated Press, Reuters, and CSPAN. You don't need people to tell you how you should feel on any given topic.",
            "title_similarity": "0.36537713",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0esw57",
            "score": 1,
            "text": "“The study involved 1,204 American adults who participated online between January and June 2019.”\n\nSo 1204 participants in a 6 month time frame. \n\n1204 divided by 2 (because there are both Conservatives and Liberal participants) = 601. \n\n601 Liberal and 601 Conservative test participants. \n\nSo the results of the study from 601 participants over a 6 month study are emblematic of Conservatives in America. \n\nMmm-kay.",
            "title_similarity": "0.5304551",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0et8r0",
            "score": 1,
            "text": "\"You're propaganda!\" Said the badly burned Albanian boy.\n\n\"No you're propaganda!\" Exclaimed Oliver Closeoff\n\nThen they realized that war...\n.\n.\n.\nWar never changes.",
            "title_similarity": "0.5137317",
            "sentiment_compound": -0.938
        },
        {
            "id": "h0etteq",
            "score": 2,
            "text": "The \"main driver\" is equally as much 'something else that I'm not allowed to say on here' because it's unfair to the fact that they are still *technically* human beings.",
            "title_similarity": "0.5703298",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0etxtn",
            "score": 1,
            "text": "Maybe they have trouble believing in govt because how often the media and govt straight up lies...",
            "title_similarity": "0.75786185",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0eu5si",
            "score": 2,
            "text": "1200 people is a sample size of nothing, this needs to be repeated several times for legitimacy.",
            "title_similarity": "0.37935808",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eurn8",
            "score": 4,
            "text": "The less you know the more you believe.",
            "title_similarity": "0.48751074",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0eyeq5",
            "score": 1,
            "text": "Politics and science are a hard gamble",
            "title_similarity": "0.5974776",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0f0l7o",
            "score": 72,
            "text": "I like listening to both left and right leaning media. That way I get all the misinformation.",
            "title_similarity": "0.5660316",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0f0o2e",
            "score": 3,
            "text": "Just remember. 80%(thats being generous) of studies are wrong. Even higher number than that are never peer reviewed. One study a fact does not make.",
            "title_similarity": "0.5045226",
            "sentiment_compound": 0.128
        },
        {
            "id": "h0f1d3k",
            "score": 9,
            "text": "I feel like this could be easily construed to illustrate the opposite. Depends on which newspaper I want to run the article on.",
            "title_similarity": "0.5085645",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0f3ash",
            "score": 2,
            "text": "Wow. Who would've thought?",
            "title_similarity": "0.18819112",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0f3dpu",
            "score": 1,
            "text": "I don't know if \"susceptible\" is the correct word here, since that implies characterization of the individuals, when it seems to be a characteristic of their environment thats behind the trend.",
            "title_similarity": "0.5050366",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0f4ton",
            "score": 1,
            "text": "America voted in a dementia ridden child molester, and you want to tell me the left are less prone to propaganda?",
            "title_similarity": "0.706051",
            "sentiment_compound": -0.577
        },
        {
            "id": "h0ffcuk",
            "score": 1,
            "text": "fauxi says this is the pot calling the kettle black. how racist is that?",
            "title_similarity": "0.45931572",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h0fi3b0",
            "score": 3,
            "text": "But who decides what are \"political falsehoods\"?\n\nIs it not possible that this study simply exposes the researchers biases?",
            "title_similarity": "0.67328846",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h0fj6ab",
            "score": 1,
            "text": "Alpaka bot where are you?",
            "title_similarity": "0.04161972",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0fjh7f",
            "score": 2,
            "text": "\\> Think they're superior because some bogus study confirm their cognitive bias\n\nWhy am I not surprised by Redditors lack of self awareness. This is peak of reddit.",
            "title_similarity": "0.7497814",
            "sentiment_compound": 0.0346
        },
        {
            "id": "h0g0xcc",
            "score": 2,
            "text": "We're all human beings and on a scale of millions, our instincts aren't different enough to warrant the major difference the study reports. That in itself is a major red flag. \n\nSo basically, we've proved here in the comment section anyone will believe a benefiting lie at face value, despite immediate evidence it should not be taken at face value",
            "title_similarity": "0.6772249",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0g8t1v",
            "score": 4,
            "text": "How feasible is it to replicate this study or similar studies on propensity for a certain political group to display a certain behavior? My spidey sense is telling me this study is inherently subjective.",
            "title_similarity": "0.69339454",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0gs6y6",
            "score": 1,
            "text": "Bro I heckin love The Science™️",
            "title_similarity": "0.2899284",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h0gtsyo",
            "score": 2,
            "text": "Hmmm...another report confirming that the confirmation bias is confirmed.",
            "title_similarity": "0.49093252",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0hfx2j",
            "score": 2,
            "text": "wow this sub has gone downhill",
            "title_similarity": "0.2628621",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0hgr1o",
            "score": 1,
            "text": "I'm curious if the 3 year narrative of Russian collusion is accounted for misinformation, and whether things like the \"Wuhan conspiracy theory\" are adjusted after more information confirms the theory as reality.",
            "title_similarity": "0.6228998",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0hhg8j",
            "score": 2,
            "text": "And it's proven that mods remove comments that they don't agree with",
            "title_similarity": "0.5166582",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h0hlv36",
            "score": 2,
            "text": "In that liberals daily believed and promoted the made-up Trump Russia collusion for 4 years I think you have your answer.",
            "title_similarity": "0.5459624",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0hrb7u",
            "score": 1,
            "text": "Damn those conservatives at it again!",
            "title_similarity": "0.58715886",
            "sentiment_compound": -0.4574
        },
        {
            "id": "h0ht4gg",
            "score": 1,
            "text": "Man people gotta be a special kind of stupid to believe these posts.",
            "title_similarity": "0.5735455",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0ikvy0",
            "score": 1,
            "text": "It's difficult to take seriously the idea of studying people's acceptance of true or false claims. The basis of truth for any such study surely rests in some institutional belief system. The very idea of declaring high profile claims to be true or false at in institutional level - such that reaction to it could be considered a legitimately quantifiable data point - sounds much like dystopian fiction or the output of a statist society.\n\nDo most professional scientists on this board find studies like this to be legitimate?",
            "title_similarity": "0.7521286",
            "sentiment_compound": 0.9274
        },
        {
            "id": "h0j277j",
            "score": 2,
            "text": "I pretty much live in the middle of miles of corn fields, in a college town. Just this morning I heard a couple of locals calling in to the town radio station talk show still adamant about hydroxychloroquine and how Dr. Fauci is behind COVID. They were sure the people are being lied to. This is the first week of June 2021. To say these people are gullible and toxic is too kind.",
            "title_similarity": "0.5102105",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0jwye6",
            "score": 2,
            "text": "can we go one day without some new article saying look conservatives have the big dumb and big evil and without some bullcrap cancer cure that is gonna be forgotten about in 3 hours by everyone in the world.",
            "title_similarity": "0.6268742",
            "sentiment_compound": -0.7256
        },
        {
            "id": "h0k6ar4",
            "score": 1,
            "text": "Y'all just now figuring this out?  I figured this out when \"Don The Con\" got voted in as president of the US.",
            "title_similarity": "0.45174783",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0k8dh7",
            "score": 1,
            "text": "It's so exhausting listening to people making statements and subsequent extrapolations. \"People tell me....\". What a moron.",
            "title_similarity": "0.501986",
            "sentiment_compound": -0.7178
        },
        {
            "id": "h0mqtg4",
            "score": 1,
            "text": "Then why does news need ratings and satire for play screen wrights live on all my children at Fn noon buddy.",
            "title_similarity": "0.42823714",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0q3885",
            "score": 2,
            "text": "Conservatives more gullible than liberals got it, anything new?",
            "title_similarity": "0.8093109",
            "sentiment_compound": -0.4201
        },
        {
            "id": "h0qcrss",
            "score": 1,
            "text": "Even the way they did their research is skewed.....",
            "title_similarity": "0.4841463",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0qzhpe",
            "score": 1,
            "text": "Thing is though a lot of these so called truths in that study are partisan. There is no independent objective truth to some of them.  Like on the Hillary thing.  It does appear she did have some part in the uranium sales.  some try and deny it but that doesn't make it untrue.  It might be untrue but its not for sure untrue.  Just because some fact checker says its untrue doesn't make it so.  Fact checkers can be wrong.  They can be bias.  Everyone is bias whether we realize it or not we are.",
            "title_similarity": "0.7259238",
            "sentiment_compound": -0.7686
        },
        {
            "id": "h15jmb4",
            "score": 1,
            "text": "What is an accurate claim and who decides? It's clear today that fact checkers on covid may have been wrong...so who has fact claiming authority? Scientists can't even agree whats fact in peer reviewed journals...",
            "title_similarity": "0.62934446",
            "sentiment_compound": 0.2846
        },
        {
            "id": "h1iudg7",
            "score": 1,
            "text": "Is fire still hot too? And I seriously need to check status on water to see if it's still wet (yes I know it's not technically wet, STFU).",
            "title_similarity": "0.38164175",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h1ohyrx",
            "score": 1,
            "text": "Maybe now. But not even 15 years ago that was vastly different. For example, Conservatives used to buy into 9/11 while Democrats generally seemed to see it for what it really was. Now, it's likely to be the opposite.",
            "title_similarity": "0.6844969",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ru3ck",
            "score": 1,
            "text": "Does any one have a full link to the actual questions and methodology. I didn’t see it in my first read.\n\nI did see they used You/gov which is many unusual polls emerge from, but also some legitimate polls. Participation is paid and self selected, participants described their beliefs from an on line questionnaire and assigned to belief groups. Then random samples are taken from each group as weighted by what ever percentage the methodology calls for. \n\nThis study reports paying $0.15 per question answered.\n\nLooked again for questions: I have  to believe they had to link the questions somewhere because that is essential to evaluating the paper. I am sure others will find it, please post link if you do.\n\nThank you",
            "title_similarity": "0.6520733",
            "sentiment_compound": 0.8462
        },
        {
            "id": "h20i4bi",
            "score": 1,
            "text": "Republicans are just outright shills for their own prejudice. They can never navigate the complexities that it takes to navigate the culture of the current world parading unless they assimilate there is nothing anyone can do for them. It would literally take a moderate to reach them at this point due to the fact that progressive values are lost on them",
            "title_similarity": "0.63262695",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h29xn14",
            "score": 2,
            "text": "Here in Brazil we don't have time for searching  for a new violence, because we are still trying to understand the last ones.",
            "title_similarity": "0.414295",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h2c53ae",
            "score": 1,
            "text": "Unfortunately this is all too true and they need to wake up and acknowledge this problem.\n\nThough part of it is some conservative stances are based on falsehoods such as defense of the war on drugs and the for profit healthcare system which created a camel's nose situation.",
            "title_similarity": "0.6850891",
            "sentiment_compound": -0.3016
        },
        {
            "id": "h2s6h8k",
            "score": 1,
            "text": "Better to listen to both sides, right and left of the media so that we can be able to get all the information and understand everything better. It may be hard and time consuming, but it's best to base on facts.",
            "title_similarity": "0.56912786",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h2w1s65",
            "score": 1,
            "text": "A Communications professor? Sheesh - are we really supposed to pretend this is 'science'.",
            "title_similarity": "0.4977032",
            "sentiment_compound": -0.1689
        },
        {
            "id": "h5n1yuc",
            "score": 1,
            "text": "If journalists and newspapers did their jobs right we would all have reliable sources to come to our own conclusions.",
            "title_similarity": "0.5037525",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6vcg26",
            "score": 1,
            "text": "This is so misleading but, not surprising at all in 2021. Wouldn’t even know where to begin to break down everything wrong with this claim and study.",
            "title_similarity": "0.46243173",
            "sentiment_compound": -0.8233
        }
    ]
}