{
    "Study: One in twenty workers are in useless jobs or 'bullshit jobs' — far fewer than previously thought. However, David Graeber was right to link people’s attitudes towards their jobs to their psychological wellbeing, and this is something that employers—and society as a whole—should take seriously.\n": [
        {
            "id": "h0jv33i",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.6138123",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h0kdj77",
            "score": 3,
            "text": "I'll take the heat.\n\nIf you think your job is useless...get to work at getting a skill that isn't, or stfu and just take the paycheck.",
            "title_similarity": "0.5917737",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0k7sci",
            "score": -5,
            "text": "So basically every manager and supervisor",
            "title_similarity": "0.3269758",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0kacz9",
            "score": 3,
            "text": "1:20 is a laughable and bizarre figure.  Who were they speaking to, Disneyland employees?  Any walk through any city centre in the western world gives you more than enough information to know that virtually everyone working around you is at best ambivalent and resigned to their job but probably more commonly will utterly despise it, and the set of circumstances which led them to it.  One can convince oneself that any burden is not too heavy as long as long as you haver something to work towards (promotion, better life for your family etc), but if you are working just to pay the bills to live then you're either in the depths of despair or if it's all new to you, wading in the shallow end.   Maybe they should have asked the bloke who just shat in a Tupperware box in order to make a delivery deadline, or the teacher who was once enthused with the idea of enriching young minds but now just rigidly implements a dead curriculum, or maybe just anyone who has ever worked for a minimum wage for 3 months or more.   Hey, I'm no statistician but 50 years of 'coal-face' experience tells me, nay screams at me, that this figure is unmitigated shite.  So much so in fact that we should expect a string of politicians to be vigourously trumpeting it on  our TV screens shortly, thus proving beyond doubt it's faecal authenticity.",
            "title_similarity": "0.75388587",
            "sentiment_compound": -0.9519
        },
        {
            "id": "h0kbhhi",
            "score": -3,
            "text": "Most people suffer from the illusion that they're a temporarily inconvenienced millionaire, undiscovered talent, or misunderstood genius.",
            "title_similarity": "0.5716008",
            "sentiment_compound": -0.5233
        },
        {
            "id": "h0kc4hj",
            "score": 2,
            "text": "Karl Marx wrote about alienation too.",
            "title_similarity": "0.40752375",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h0kgvet",
            "score": -3,
            "text": "Let’s be honest. Do we really need, all these office workers? Really? Do they make food? Make electricity? Build things?",
            "title_similarity": "0.504707",
            "sentiment_compound": 0.644
        },
        {
            "id": "h0k710l",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.078491814"
        },
        {
            "id": "h0k4ul2",
            "score": -14,
            "text": "I wager that people's pyschological well-being is more closely related to how much they pocket rather than what it is they do. We should start by reducing the burden of taxation rather than increase the wages as that redistributes the pressure onto the employer rather than alleviate the pressure on everyone earning an income.",
            "title_similarity": "0.6888592",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h0k7yic",
            "score": 2,
            "text": "But they won't, because caring about your employees is expensive. They're all just whiny and lazy anyways, always asking for more time off and doesn't want to work more than 40. \n\nAt least in the US, the majority of employers expect their employees to place them above their health and family.",
            "title_similarity": "0.7559277",
            "sentiment_compound": -0.792
        },
        {
            "id": "h0kk8mg",
            "score": -4,
            "text": ">Study: One in twenty workers are in useless jobs or 'bullshit jobs'\n\nYeah, like the ones who produce all the psychology studies this subreddit uses in place of reporting science.\n\n\"Study finds political group we don't like very much have smaller genitals and lower IQs, psychologists at Stanford discover\"",
            "title_similarity": "0.7891183",
            "sentiment_compound": -0.7359
        },
        {
            "id": "h0kea33",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.040417507"
        },
        {
            "id": "h0k6dti",
            "score": 14,
            "text": "How are they defining \"useless job\" though.",
            "title_similarity": "0.38187656",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0ka5xy",
            "score": 12,
            "text": "A 25 hour work might help.",
            "title_similarity": "0.38481522",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0kjmzd",
            "score": 5,
            "text": "What percent of people have an IQ below 85?\n\nIs it only around, or lower than 5%? \n\nEven the military doesn't have a job for those people, since there's nothing they can touch without taking more value than they add, and if that's the case, it's great others can find something for them to do.",
            "title_similarity": "0.7357466",
            "sentiment_compound": 0.2517
        },
        {
            "id": "h0keewl",
            "score": 1,
            "text": "The funny part is   the real useless jobs are actually middle management.",
            "title_similarity": "0.6102946",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h0kf4mz",
            "score": -1,
            "text": "I know for a fact that every other job is useless",
            "title_similarity": "0.4731211",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0l2s93",
            "score": 1,
            "text": "Oh wow mfs are just learning what alienation from labour is wow",
            "title_similarity": "0.47005188",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h0l4vll",
            "score": -1,
            "text": "At least they’re employed…\n\nSo much damn complaining.",
            "title_similarity": "0.47261423",
            "sentiment_compound": -0.6177
        },
        {
            "id": "h0k8aoq",
            "score": 6,
            "text": "The sad truth is, no one cares about your mental health as much as you should. It’s on your own shoulders to own it and improve it.",
            "title_similarity": "0.65055907",
            "sentiment_compound": -0.3777
        },
        {
            "id": "h0k7qzn",
            "score": 9,
            "text": "That's without counting the numerous jobs that could easily be automated...",
            "title_similarity": "0.3923573",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0kagua",
            "score": 32,
            "text": "My jobs have all been *useful,* but they're sorta BS in that everything I've done SHOULD have been done by proper experts well paid by government rather than just leaving it to ol' jfl_cmmnts to hack away.  Sure all my clients get value and I do good for them, but if society got its act together I'd be looking for something else to do.  Way of the world though",
            "title_similarity": "0.78850365",
            "sentiment_compound": 0.926
        },
        {
            "id": "h0keroj",
            "score": 2,
            "text": "I’m doing an internship in a company, it’s my first proper office job (though it’s all working from home) and they did a big department call a few weeks ago, and one guy, in front of the 90 people in the call, made a big deal to the boss about how he wasn’t getting anything to do, and he seemed really agitated by that. \n\nPersonally I’d love to have a job where I don’t have to work, but this guy was being snarky and everything, which confused me. I guess he was psychologically suffering",
            "title_similarity": "0.67818815",
            "sentiment_compound": -0.7681
        },
        {
            "id": "h0kaqoe",
            "score": 7,
            "text": "I always told my employers that a mental health day is just a valid as a flu day.",
            "title_similarity": "0.6396595",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h0k8yxd",
            "score": 42,
            "text": "I've worked in a couple of companies of varying sizes. And I maintain that half of the people working there wasted their time with their degrees in economics, BA, HR, etc. for none of them did anything that had something to do with the field. Or never really emplored skills of the field. Most peoples' jobs that weren't deeply specialized jobs like software architechts, lawyers, accountants or computer systems engineers could have been done by a high school graduate with a month of training. \n\nSo my hypothesis is, that half the jobs and the required degrees are merely buffed up paper pushing jobs. Project managers spent their entire day running from office to office gathering information on the state of the project, calling meetings that two thirds were obsolete in, to share information and ideas that could have fit into a series of emails.\n\nAnd I can imagine that there's lots of people wondering if that made any difference, if they are making a unique difference at all and in  the countries where education is ridiculously expensive: 250k in student loan debt to be a human bullhorn must feel like a punch in the gut.",
            "title_similarity": "0.69033575",
            "sentiment_compound": -0.0865
        },
        {
            "id": "h0krwpd",
            "score": 2,
            "text": "Which libertarian think tank paid for this study?",
            "title_similarity": "0.42221123",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h0k8ee9",
            "score": 53,
            "text": "The definition of “bullsh-t jobs” is given in the headline, so comments telling us which jobs you think are bullsh-t are superfluous as well as being anecdotal. \n\n>\tThe so-called ‘bullsh-t jobs theory’ – which argues that a large and rapidly increasing number of workers are undertaking jobs that they themselves recognise as being useless and of no social value – contains several major flaws\n\n(Ironically it looks like comments with *that* word may not be visible to all readers.)",
            "title_similarity": "0.7141611",
            "sentiment_compound": -0.577
        },
        {
            "id": "h0k9lcg",
            "score": 53,
            "text": "[removed]",
            "title_similarity": "0.040417507"
        },
        {
            "id": "h0kddy1",
            "score": 4,
            "text": "Do the people who post these articles in here pay for them to be featured? This science subreddit has really gone down the drain lately. Literally useless articles that don’t contribute mentally stimulating. Mod will probably come and take this comment down as well.",
            "title_similarity": "0.684791",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0ki0wh",
            "score": 0,
            "text": "Probably a lot higher in Japan.",
            "title_similarity": "0.18260504",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0k3g4z",
            "score": -32,
            "text": "Government employees make up the majority.",
            "title_similarity": "0.3327421",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0kptxj",
            "score": 6,
            "text": "I worked at a solar company getting $22/hr plus overtime, and 20-something  year olds were working “until positions opened up at the elevator Union.” That was eye opening as we were working 70-80hrs/per pay period. This was their “in between” job.",
            "title_similarity": "0.5651629",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0kbbl4",
            "score": 1,
            "text": "Join me in getting in education in IO psychology!",
            "title_similarity": "0.31477582",
            "sentiment_compound": 0.3595
        },
        {
            "id": "h0kdm6o",
            "score": 1,
            "text": "Thank you for sharing this!",
            "title_similarity": "0.19233336",
            "sentiment_compound": 0.68
        },
        {
            "id": "h0kfpfv",
            "score": 1,
            "text": "Everyone wants a sense of belonging so asking someone to rank themselves as a job is going to be high. Sorry this study is way too vague and innacurate.",
            "title_similarity": "0.65085006",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0kg1i7",
            "score": 1,
            "text": "I'm not entirely convinced that the people who put together this study really understood the point the book was trying to make",
            "title_similarity": "0.4893778",
            "sentiment_compound": -0.3559
        },
        {
            "id": "h0khnwa",
            "score": 1,
            "text": "I've worked in tech for many years for both startup type companies and banks that have been around for 100+ years. At the startup jobs, one person would be doing the job of at least 2-3 people at the bank and productivity was higher.",
            "title_similarity": "0.49585754",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0khw18",
            "score": -1,
            "text": "I think it's important to note that we all have to work these jobs at one point. The real people we should hold up as icons, are people who worked these types of jobs before gaining fame or fortune.",
            "title_similarity": "0.61920726",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h0kqwj0",
            "score": -1,
            "text": "Another “Con” for the Social Media pros and cons chart",
            "title_similarity": "0.327402",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0kr4b6",
            "score": 1,
            "text": ">Even so, writing in Work, Employment and Society, the academics applaud its proponent, American anthropologist David Graeber, who died in September 2020, for highlighting the link between a sense of purpose in one’s job and psychological wellbeing.\n\nHow about using 3 sentences instead of one mega-nested sentence?",
            "title_similarity": "0.66664135",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h0kt5a9",
            "score": 1,
            "text": "People should be a lot more worried about the potential for  the automation of jobs than just the futility factor. Looking up the automation possibility of a job is eye-opening on something like [“Will Robots Take My Job?”](https://willrobotstakemyjob.com)",
            "title_similarity": "0.59887534",
            "sentiment_compound": 0.0018
        },
        {
            "id": "h0kvaq7",
            "score": 1,
            "text": "Like they would spend a single dime on your mental wellbeing. \n\nOn the other hand they will spend millions trying to appear like they care about your wellbeing.",
            "title_similarity": "0.68432933",
            "sentiment_compound": 0.886
        },
        {
            "id": "h0l8dt8",
            "score": 1,
            "text": "We either need universal healthcare and basic income, or about half of everyone to walk into the ocean. Maybe more.",
            "title_similarity": "0.4578414",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mdhbm",
            "score": -1,
            "text": "F*** that guy and his theories. A receptionist of a dental office is not a BS job. It might be because of ignorant f**** like himself, that positions, such as receptionists, don't get the respect and pay that they deserve, given the hard work and excessive skill that it takes to do such a job. Especially at a dental office or medical practice. \n\nNow, if I'm the ignorant one, and he excluded medical practice receptionists, then I'm sorry. But I couldn't read anymore, after a couple minutes in. \n\nWow. I think that guy hit a nerve. I've managed dental practices for more than 15 years, and a few other businesses before that. We tend to rely on the receptionist for an elaborate list of tasks. They're basically the hub of communication between patients/clients and business associates. To call that a BS position, I just really don't understand where his perspective.",
            "title_similarity": "0.6664423",
            "sentiment_compound": 0.4259
        },
        {
            "id": "h0msbd1",
            "score": -1,
            "text": "So cleaners and helpers are essential but lawyers and finance are BS jobs. \n\nThis study is an absolute disaster.",
            "title_similarity": "0.6207085",
            "sentiment_compound": -0.7156
        },
        {
            "id": "h0kjtq0",
            "score": 7,
            "text": "David Graeber? This sounds as what [Marx defined as alienation](https://en.m.wikipedia.org/wiki/Marx%27s_theory_of_alienation) more than a century ago.",
            "title_similarity": "0.45485735",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0k7q39",
            "score": 77,
            "text": "[removed]",
            "title_similarity": "0.040417507"
        },
        {
            "id": "h0k8yz6",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.078491814"
        },
        {
            "id": "h0kj1b5",
            "score": 8,
            "text": "Credit should probably be given to Karl Marx and Friedrich Engles who first covered this concept in their [Theory of Human Nature](https://www.jstor.org/stable/40970148). The particular trait in question in this article - how psyche is effected by working conditions - is directly related to what they called: Gattungswesen - a term roughly translating to ‘species essence’ or essence of the species.\n\nDavid Graeber rest in peace. Thank you for bringing to light again this topic.",
            "title_similarity": "0.6307591",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h0kdrnh",
            "score": 2,
            "text": "There's a lot of fat at most companies tbh. When there's a backlog of work the first response is to hire more people, but that's not always smart. Work fluctuates, and then you have to find \"jobs\" for those people. \n\nInstead the reaction should be to question if you can remove non-important tasks from the queue. Can somethings be outsourced to a company that specializes in that. Can some things be automated. That's how you keep a company lean.",
            "title_similarity": "0.6730957",
            "sentiment_compound": -0.438
        },
        {
            "id": "h0ke1sq",
            "score": 2,
            "text": "You can’t self report this, there’s a LOT of people who won’t admit it to themselves.",
            "title_similarity": "0.38707304",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h0kf3wk",
            "score": -2,
            "text": "There is a difference between not being useless and not being at peak production per person. Useless workers are more likely to get fired and replaced so most people aren't going to be useless but they will not put in maximum effort.",
            "title_similarity": "0.7502922",
            "sentiment_compound": -0.5321
        },
        {
            "id": "h0kj6i1",
            "score": -2,
            "text": "i couldnt care less how anyone else feels about working",
            "title_similarity": "0.39034504",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h0kouvq",
            "score": 2,
            "text": "Outside of the US most companies build in redundancies so when a colleague goes on mat. leave or pat. leave for a year or becomes sick for extended durations the company isn't screwed.\n\nWhile the person in the redundant role still has normal work practices designed to support the person leaving it could be easy to see how 60% of that persons job \"could\" be handled by 1 person.\n\nBut, by remembering that employees are humans & the point of life isn't maximum total efficiency that 'cost' or 'efficiency loss' is perfectly fine & overall a marked improvement.\n\n\"BS\" jobs or semi-BS jobs are important. They allow people to be people instead of efficiency robots.",
            "title_similarity": "0.77637935",
            "sentiment_compound": 0.9605
        },
        {
            "id": "h0krib5",
            "score": 2,
            "text": "How much of this is supply elasticity?\n\nTake lawyers for example (as I am one). It is basically impossible for us to know when a case some in, and when it will settle. This means we have to maintain a staffing level everyone working crazy busy hours where when we have major cases overlapping, but some people are basically useless paper pushers during slow times. We have some control over it, but not the point of perfecting staffing levels such that everyone is medium busy all the time. Generally the bigger the firm, the better they can do this. But in the market there is still a place for smaller firms, so staffing is an issue.\n\nI think this is supply elasticity (or lack thereof). The work comes and goes at an unpredictable schedule, where staffing cannot be adjusted in real time. Instead, we have to maintain a staffing level capable of doing all the work when flat-out, but not overstaffed such that we're bleeding money during slow times. This creates some pockets of people feeling like their job is useless.",
            "title_similarity": "0.714469",
            "sentiment_compound": 0.8277
        },
        {
            "id": "h0kecig",
            "score": 28,
            "text": "Maybe if the jobs weren't so mind numbing and thankless we did that it more seriously. No I'm not talking a pat on the back give me a bonus if I do a great job.",
            "title_similarity": "0.67813826",
            "sentiment_compound": 0.731
        },
        {
            "id": "h0jxtq2",
            "score": 147,
            "text": "David Graeber is sadly very underrated",
            "title_similarity": "0.38245443",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0k7btz",
            "score": -9,
            "text": "It's more like 9/10 including the researchers involved in this useless study.",
            "title_similarity": "0.5653312",
            "sentiment_compound": -0.1172
        },
        {
            "id": "h0kkop4",
            "score": 21,
            "text": "Turns out that in order to run an economy based on endless consumption, consumers need to have disposable income, so you make up jobs to give them a paycheck.",
            "title_similarity": "0.5879631",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0kp9kv",
            "score": 2,
            "text": "Money has never taken any human seriously. It's not capable. And those sociopaths that are addicted to money, they don't see people, they see useful objects. Sociopaths are not capable of change when they have been rewarded so much for their behavior by money.",
            "title_similarity": "0.6025151",
            "sentiment_compound": 0.2575
        },
        {
            "id": "h0kx4ka",
            "score": 3,
            "text": "They should make a study if having a trash job is still better then unemployed.",
            "title_similarity": "0.7088891",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0l8ohe",
            "score": 4,
            "text": "My job takes the worker well being seriously. They recognize that mental health is an issue, so they send out emails saying \"Come to work every day - don't call out sick. Work your ass off, work late. Make sure you take care of your mental health during your time off.\"\n\nThe next email says, \"if you have mental health issues, it's \\*your\\* fault because we sent out an email saying take care of yourself because we care.\"",
            "title_similarity": "0.73848575",
            "sentiment_compound": 0.8317
        },
        {
            "id": "h0kp8f8",
            "score": 47,
            "text": "I’ve been depressed for a while and I think a big part of it has been how I feel about the jobs I’ve worked.\n\nI worked at a liquor store for three years. As far as retail jobs I’ve worked it was probably my favorite, it was a ma and pa store that did good business. The customers were generally pretty nice and appreciative though it did get a bit rough on the holidays. But I still felt stifled and like I could/should be doing more.\n\nNext I worked for a construction geo-engineering and quality assurance company doing soil, asphalt, and concrete testing. I liked the job at first and felt like it was maybe an “in” to the sciences or engineering. But I got into a situation at a site that just kept getting worse and everytime I asked a project manager or assistant project manager to come out they said it looked fine. It started to weigh on me and giving me anxiety, and I every time I tried to stand up to the site super I wouldn’t get the back up I needed and in retaliation they’d get their project manager to come berate me. The project kept falling behind schedule for reasons unrelated to my work but when the project failed a proof roll when they were trying to rush in asphalt before the winter got bad I knew it was my fault and I probably wouldn’t be coming back. I got laid off due to the lack of winter work and was told I could come back but don’t believe they were sincere. And I don’t think I’d want to go back, the anxiety was making me miserable. \n\nNow I work as an overnighter at a pet’s hotel. I oscillate between hating it and being okay with it. I still have anxiety problems, though not as bad, and issues with...self-acceptance? Self-love? Self-hate? \n\nThere are other issues as well, and it kind of creates a cycle. I feel bad here, which makes me feel bad there, and because I feel bad there, I feel bad here etc.\n\nJust ranting and venting I guess.",
            "title_similarity": "0.67442125",
            "sentiment_compound": -0.9745
        },
        {
            "id": "h0kgrci",
            "score": 17,
            "text": ">'bullshit jobs'\n\nIs that the scientific term?",
            "title_similarity": "0.3939829",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0k8d7q",
            "score": -5,
            "text": "Wonder if those who created the study included themselves. Haven’t they heard of the Pareto principle? 20% of people do 80% of the work. So the useless jobs are closer to 80% in organizations.",
            "title_similarity": "0.64867043",
            "sentiment_compound": -0.2682
        },
        {
            "id": "h0k4glo",
            "score": 270,
            "text": "[removed]",
            "title_similarity": "0.040417507"
        },
        {
            "id": "h0k176q",
            "score": 272,
            "text": "[removed]",
            "title_similarity": "0.040417507"
        },
        {
            "id": "h0ljuuy",
            "score": 60,
            "text": "it is way more than one in 20..  your job may be important in the company you're in but what your company does is useless... That's not being taken into account.",
            "title_similarity": "0.7319116",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0kzp7b",
            "score": 12,
            "text": "Sorry, but this study is wrong. 1 in 20 is too low. Anyone who has worked an office job knows for a fact that you could easily cut headcount by half.",
            "title_similarity": "0.7663169",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h0kaclw",
            "score": 471,
            "text": "It's possible to have a valuable and useful job in an industry that is of no net good to the world.",
            "title_similarity": "0.6221758",
            "sentiment_compound": 0.3387
        },
        {
            "id": "h0k541n",
            "score": -14,
            "text": "Politicians come to mind. These are people elected to make decisions on how to spend our money. And yet we elect politicians. You'd think we'd elect accountants.",
            "title_similarity": "0.5320277",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0kzvuj",
            "score": 14,
            "text": "This is stupid. Just because people think that their jobs are not BS doesn't mean that they aren't BS. People ascribe meaning to stuff that isn't meaningful all the time.",
            "title_similarity": "0.6263616",
            "sentiment_compound": -0.6555
        },
        {
            "id": "h0kgf03",
            "score": 286,
            "text": "The change in survey question, **\"How frequently do you have the feeling of doing useful work\"**, is so significantly different from Graeber's, **\"Do you feel your work makes a meaningful contribution to the world?\"**  that I fail to see how this is an adequate defeater.\n\nWhen I was engaged in useless labor I never once felt I was doing useless work. I never felt anything. I was emotionally numbed by that jobs. And despite having no useful work to do I did a lot of useful things. I snuck books into spreadsheets and read them while pretending to look at data. This would prevent me from answering \"Never\" on this survey because I was doing useful work *for me* so I never felt otherwise.\n\nBut I literally never did a single thing in that job. To Graeber's question I would say No.",
            "title_similarity": "0.6875701",
            "sentiment_compound": 0.3859
        },
        {
            "id": "h0k854b",
            "score": 916,
            "text": "This would be a great research article if more data was used and the terms were better defined to the participants.  How would someone determine their job was useless if they arent given context as to why a job may be useless, it's all just based on what...one  or two questions in a survey.  If a BS job was defined and then participants questioned with that definition in mind, this study make have turned out vastly different.  Really Cambridge?",
            "title_similarity": "0.69724846",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0kh6to",
            "score": 1102,
            "text": "I look at all the useless stuff sold in Dollar Stores and think about the entire resource extraction and supply chain that exists to employ people to sell this crap.",
            "title_similarity": "0.5883902",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h0jv5kx",
            "score": 4528,
            "text": "Only 1 in 20? I thought it would be a lot more.",
            "title_similarity": "0.3521276",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0k8lv4",
            "score": 45,
            "text": "[removed]",
            "title_similarity": "0.040417507"
        },
        {
            "id": "h0kgza1",
            "score": 190,
            "text": "I was in a \"useless job\" for like 4 months and I loved it simply because there was so little work for me to do, so I could just screw around on the internet 90% of the day. And it was only 8 minutes from my house, which was also lovely.",
            "title_similarity": "0.6356368",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h0ljin6",
            "score": 87,
            "text": "this is fairly subjective though. i recently quit my architecture job. some folk might might consider that an “important job,” but then the more time you spend in it you realize you’re only making money for rich, frat-bro developers.",
            "title_similarity": "0.7072981",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h0kbp7j",
            "score": 1,
            "text": "What are some jobs that car considered useless?",
            "title_similarity": "0.43779585",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0kbtze",
            "score": 1,
            "text": "Recently been doing some work on Psychological Capital by Fred Luthans. Psychological well-being, whether we like it or not is intrinsically linked to the workplace.",
            "title_similarity": "0.6327719",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0kdtwu",
            "score": 3,
            "text": "This is how I feel everyday",
            "title_similarity": "0.1865678",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0keuch",
            "score": 1,
            "text": "I’m so damn sick that I try to work and fail most days, but barely any money is better then 0",
            "title_similarity": "0.6517619",
            "sentiment_compound": -0.1743
        },
        {
            "id": "h0khjqo",
            "score": 1,
            "text": "Work to live. Live to work.",
            "title_similarity": "0.21726856",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0kisez",
            "score": 1,
            "text": "Yeah, that should probably be the inverse.",
            "title_similarity": "0.15473412",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0kj2c3",
            "score": 1,
            "text": "\"It is difficult to get a man to understand something when his salary depends on his not understanding it.\" - Upton Sincair\n\nSo asking the workers themselves seems to be an exercise in worker satisfaction and societal usefulness.",
            "title_similarity": "0.68338245",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0kj4hp",
            "score": 1,
            "text": "My psychological well being works best when I'm not hungry and have a roof over my head.  Thank you job.",
            "title_similarity": "0.54137874",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h0kjcty",
            "score": 1,
            "text": "I’m sorry I don’t believe this for one minute.",
            "title_similarity": "0.24754396",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0kjf9h",
            "score": 1,
            "text": "People still need money",
            "title_similarity": "0.30647355",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0kjvki",
            "score": 1,
            "text": "Employee: \"So what you're saying is that I should remind my employees that we're not 'coworkers' we're a 'family'? :D\"",
            "title_similarity": "0.6035003",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0kjw8w",
            "score": 1,
            "text": "This is a challenging thing to define. Does gainful employment in and of itself provide enough utility to a consumer to justify calling the job \"useful,\" even if the actual work is not useful to the employer or to society?",
            "title_similarity": "0.61594176",
            "sentiment_compound": 0.2718
        },
        {
            "id": "h0kkw2z",
            "score": 1,
            "text": "For better or for worse \"BS\" jobs will probably be replaced by robots first",
            "title_similarity": "0.47759178",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0kljgq",
            "score": 1,
            "text": "Corporate hires an unnecessary lawyer and then opponents have to hire an unnecessary lawyer to fight that unnecessary lawyer.\n\n\nImagine if people could communicate without confronting lawyers.",
            "title_similarity": "0.60145503",
            "sentiment_compound": -0.286
        },
        {
            "id": "h0klxas",
            "score": 1,
            "text": "if you are easily replaceable, employers don't care for your wellbeing.",
            "title_similarity": "0.6244161",
            "sentiment_compound": -0.0588
        },
        {
            "id": "h0km248",
            "score": 3,
            "text": "The article touched on what many of us feel. Our profession is not useless but our role or many  of our assigned tasks are useless because our time and expertise are not respected. Based on my experience, that is becoming more pronounced, at least in my field.",
            "title_similarity": "0.7283213",
            "sentiment_compound": -0.748
        },
        {
            "id": "h0kmcoo",
            "score": 1,
            "text": "Should take seriously, but never will.",
            "title_similarity": "0.28957647",
            "sentiment_compound": -0.09
        },
        {
            "id": "h0kmoi7",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.078491814"
        },
        {
            "id": "h0kn5jb",
            "score": 2,
            "text": "One in 20 is a politician? I never knew. ;)",
            "title_similarity": "0.31461543",
            "sentiment_compound": -0.1695
        },
        {
            "id": "h0knts1",
            "score": 1,
            "text": "I’d like to know how management affects    this.  I had a job that was fine until management changed and made me want to blow the place up.",
            "title_similarity": "0.5988142",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0ko5c5",
            "score": 1,
            "text": "So the better you feel about yourself the better your attitude towards the job, in turn performing better?",
            "title_similarity": "0.5316486",
            "sentiment_compound": 0.8393
        },
        {
            "id": "h0koxo1",
            "score": 1,
            "text": "A better way would be to analyze the job reqs of positions in companies then survey employees on their job functions to see what matches up. Also look at managers KPIs to see what the perceived value of output is. With this data and some financial data you could then ask the questions. “Which jobs are box ticking, duct taping, etc?” “What jobs are perceived as BS but needed for an actual important reason and which are needed for a legit BS reason” and also “What is the perceived value of output of a company vs the actual value output of a company”.",
            "title_similarity": "0.66589504",
            "sentiment_compound": 0.8765
        },
        {
            "id": "h0kpayu",
            "score": 1,
            "text": "There are also people who are terrible at their jobs but can't be let go because they are civil servants, etc.  My brother-in-law had a worker like this and he moved her office to the basement in an effort to get her to quit.  She was just as happy there and spent the day reading books and talking on the phone!  She did have some simple assignments but took a long time to do them.  Yeah, a total waste.\n\nEventually, she was let go but they had to \"build a case\" against her over time.",
            "title_similarity": "0.70054936",
            "sentiment_compound": 0.7353
        },
        {
            "id": "h0kpble",
            "score": 2,
            "text": "I’m currently in a job that pays half of what I could earn with my Master’s degree and they won’t give me work to do but I haven’t left it because it has great health insurance benefits and my health sucks rn and I’m in the USA.",
            "title_similarity": "0.70500094",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h0kpuo8",
            "score": 1,
            "text": "This title also reads as \"5% of workers...\"  seems to have a lot less impact.",
            "title_similarity": "0.5366104",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0kq3w6",
            "score": 1,
            "text": "Covid has really fucked up my job, working remotely after flying around the us Nd canada every other week sucks",
            "title_similarity": "0.5524653",
            "sentiment_compound": -0.8016
        },
        {
            "id": "h0kqm92",
            "score": 3,
            "text": "Employers taking employees health & well being seriously ?? \nMay be very few but most will suck your soul out.",
            "title_similarity": "0.79499924",
            "sentiment_compound": -0.6627
        },
        {
            "id": "h0kqm9y",
            "score": 2,
            "text": "Ask fast food workers next",
            "title_similarity": "0.33382052",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0kqmds",
            "score": 2,
            "text": "So many hours of doing pointless busy work because someone up the chain thought it sounded like a good idea. \n\nLike the reports I would run weekly. Detailed, multi-paged Excel report. Lovely summary page with colorful graphs laying out the information overview in an easy to read at a glance format exactly as requestedby uppers. Email the report out. \n\nNear weekly call of \"what are the numbers?\". I emailed the reports out sir. \"Just tell me the rundown.\" Sure. You want to pay me for this? Fine. It's eating away at my soul due to the sheer poitlessness of it but sure. Fine. I'm fine.\n\n\nCrossing my fingers that medical coding will be less soul sucking once I get my certification.\n\n(Edited for missing space between words.)",
            "title_similarity": "0.7144271",
            "sentiment_compound": 0.9301
        },
        {
            "id": "h0kruc7",
            "score": 1,
            "text": "oh, you mean the Procurement department.",
            "title_similarity": "0.1374119",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0krwa0",
            "score": 1,
            "text": "What's the statistic for useless people in regular jobs? I feel like that may be much higher.",
            "title_similarity": "0.632889",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0ksg95",
            "score": 3,
            "text": "**Perhaps if they were compensated fairly with a living wage for doing an essential role in society they would not feel distressed by their work**",
            "title_similarity": "0.6442169",
            "sentiment_compound": 0.3252
        },
        {
            "id": "h0ku3fb",
            "score": 1,
            "text": "No offense to doormen but what is the purpose of that job other than making rich people feel important?",
            "title_similarity": "0.5752059",
            "sentiment_compound": 0.8161
        },
        {
            "id": "h0ku7a7",
            "score": 3,
            "text": "I am in a useless job and it sucks",
            "title_similarity": "0.30853933",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h0kubv5",
            "score": 3,
            "text": "Bs from a societal perspective or not being able to move up into higher paying jobs afterwards directly? You could work in a retirement facility or working with kids but those jobs don't really see people making more money due to a low ceiling even if you've got a masters degree.",
            "title_similarity": "0.71087563",
            "sentiment_compound": -0.3919
        },
        {
            "id": "h0kurhn",
            "score": 1,
            "text": "There is no \"society as a whole\"",
            "title_similarity": "0.122124106",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0kve84",
            "score": 1,
            "text": "What percentage of those worthless job are in government?\n\nAnd who decides which jobs are useful and which are useless? If someone wants to pay another person to do  job, why is that job suddenly considered useless?\n\nWork is dignity. Welfare is shame. We should be praising work, not panning it.\n\nRead the study. It's seriously disconnected from reality. If a high end hotel wants to employ a greeter, it's not a BS job.  It's a service the business has decided they need to impress their customers.",
            "title_similarity": "0.7445698",
            "sentiment_compound": -0.3049
        },
        {
            "id": "h0kwkxy",
            "score": 1,
            "text": "We should fire all the politicians. They are useless and overly costly, plus downright dangerous to public safety as war's are never the want of the people. War's are always politically motivated.",
            "title_similarity": "0.56878185",
            "sentiment_compound": -0.4805
        },
        {
            "id": "h0kwpiy",
            "score": 2,
            "text": "I feel this won't happen in the US. Our culture is not about fixing the problem, especially in the work place. If the society puts in \"right to work\" laws which do nothing to protect workers from bad employers, then this is a non starter.",
            "title_similarity": "0.63361037",
            "sentiment_compound": -0.8118
        },
        {
            "id": "h0kwyvq",
            "score": 2,
            "text": "I work for a very large company and I love the WORK, it’s the company and the politics and the corporate bloat and waste that makes me dislike my job.",
            "title_similarity": "0.6528766",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0kxxir",
            "score": 2,
            "text": "I can say that there are certain environments or setups that make it worse. \n\nOutsourcing of work or creating a “two tier” work environment. Where one group is paid significantly less or has less benefits than another and they both do the same work. \n\nFor example, Ford hiring some third party “no name” company to build their cars. While that third party is paid less and receives significantly less benefits.  \n\nAirlines do this too with their “regional airline”\nCodeshares. \n\nTwo different companies operating under one “brand name” where one group is paid significantly less than another.  \n\nThis would result in those feelings from those employee groups I would imagine.",
            "title_similarity": "0.75383675",
            "sentiment_compound": 0.8487
        },
        {
            "id": "h0ky2ua",
            "score": 1,
            "text": "1:20 people are in useless jobs... and they are all pumping gas in Oregon. Seriously what is wrong with that state?",
            "title_similarity": "0.5263225",
            "sentiment_compound": -0.765
        },
        {
            "id": "h0ky4rn",
            "score": 1,
            "text": "So, what this study shows is that one in twenty people work for some form of the government?",
            "title_similarity": "0.51400733",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0kzpco",
            "score": 2,
            "text": "Why can't we just [link to the study](https://journals.sagepub.com/doi/full/10.1177/09500170211015067)?",
            "title_similarity": "0.34129387",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0l0bes",
            "score": 1,
            "text": "Hey, you know what would make me feel better about my job? Being paid more.",
            "title_similarity": "0.55318075",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0l0hkg",
            "score": 2,
            "text": "What does this have to do with science?",
            "title_similarity": "0.16164517",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0l157p",
            "score": 1,
            "text": "I think some corrections need to be made to this article. 1 in 20 employees feel good at work. Thankfully tho I happened to be that 1 cuz I love my current job but I was absolutely miserable at all my other jobs.",
            "title_similarity": "0.79606634",
            "sentiment_compound": -0.0745
        },
        {
            "id": "h0l1cu0",
            "score": 3,
            "text": "No one will take it seriously till there's money to be made \"addressing\" the issue.",
            "title_similarity": "0.3905766",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0l1liy",
            "score": 2,
            "text": "Should say only 1 in 20 think their jobs are useless. Cause trust me its more like one in two in alot of industries. If we are speaking actuality",
            "title_similarity": "0.7598635",
            "sentiment_compound": 0.5095
        },
        {
            "id": "h0l1o5y",
            "score": 2,
            "text": "1 in 20 doesn't tell the whole story. I work on a crew of 6 people. None of us have a useless job but at the same time all 6 of us are under worked. A team of 2 complete all 6 of our jobs. We have to intentionally work at a slow pace so that we don't get written up for standing around. It's brutal but none of us complain openly to management because no one wants to lose their job.",
            "title_similarity": "0.70994616",
            "sentiment_compound": -0.9049
        },
        {
            "id": "h0l1pl5",
            "score": 2,
            "text": "Yep. How many people go to work knowing that what they get paid to do is simply nonsense?  \nI can’t imagine. \nI work in a call center so I know how valuable my job is.",
            "title_similarity": "0.6995925",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0l1vdn",
            "score": 2,
            "text": "What’s useless? I spent 23 years making Point of Purchase advertising. I was a cog in the capitalist consumer society, often making signage about weekly grocery specials. Such a job can be seen as both worthwhile (I raised 4 kids, bought cars & homes) and as a soul sucking empty waste of life & resources (my art ceased to exist, I was depressed, my life was a treadmill that only left me older). \nThe quest for life won out when I divorced after 25 years of marriage, quit my job & moved to the Big Smoke.",
            "title_similarity": "0.6777605",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0l2278",
            "score": 1,
            "text": "Must be talking about Goverment jobs...",
            "title_similarity": "0.36260444",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0l2hpp",
            "score": 1,
            "text": "I think a lot of jobs are useful, but they are not useful for 40 hours out of the week. I used to work 35 hours and I'd say I spent maybe 10 of them doing something when it was *busy*.",
            "title_similarity": "0.638283",
            "sentiment_compound": -0.2867
        },
        {
            "id": "h0l3rzo",
            "score": 2,
            "text": "Ohhh maslow, don't you say it is true :o",
            "title_similarity": "0.14710033",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0l3sf9",
            "score": 2,
            "text": "From the article:\n\n>The team found that those individuals who felt respected and encouraged by management were less likely to report their work as useless. Conversely, when employees experience management that is disrespectful, inefficient or poor at giving feedback, they were less likely to perceive their work as useful.\n\n>Similarly, individuals who saw their job as useful tended to be able to use their own ideas at work – an important element for feeling that your job provides you with the ability to make the most of your skills – was correlated with a perception of usefulness. There was a clear relationship between the extent to which people felt that they had enough time to do their job well and their rating of the usefulness of their job, suggesting that one source of feeling a job to be useless is the pace at which one is working, affecting the ability to realise one’s potential and capabilities. Other factors correlated with feeling that a job was worthwhile included support by managers and colleagues and the ability to influence important decisions and the direction of an organization.\n\nPartly that’s probably psychological: feeling “useless” if you’re treated as “useless” and vice versus—but it’s probably also true that a good manager can enable you to be useful and a bad manager can prevent you from being useful.",
            "title_similarity": "0.7737824",
            "sentiment_compound": 0.9871
        },
        {
            "id": "h0l4c5q",
            "score": 2,
            "text": "My job is to sit and push buttons all day, all day, for 12 hours. Best thing about it? I can eat while on shift so no breaks.",
            "title_similarity": "0.48410115",
            "sentiment_compound": 0.3256
        },
        {
            "id": "h0l4ta8",
            "score": 1,
            "text": "David who?!\nCome on man.",
            "title_similarity": "0.13586476",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0l4wm4",
            "score": 2,
            "text": "There are way more managers than that",
            "title_similarity": "0.26520312",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0l5em1",
            "score": 1,
            "text": "That's probably why so many people think a 4 day work week is a good idea. They aren't aware that others actually work and can't magically do the same amount of work in less time.",
            "title_similarity": "0.70091534",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0l5t1m",
            "score": 3,
            "text": "There's a big issue with this study... they do not use objective metrics. As an example... if you were for an ad firm and you produce a piece of manipulative marketing that tricks people into buying a new product that isn't really what you may have implied it was(or at least what you intended to make the consumer infer it was), are you a BS job? You can generate profit and cause money to move throughout the economy... but is your job *actually* a net positive for society? Things like this, heavily nuanced jobs where the end result of that job would be societal atrophy. Is that not a BS job?\n\nI'm sure if you asked nazis if they \"felt\" like they were doing good in the world during German occupation of Europe, quite a few would say yes... and they would not be correct at all. How people feel isn't always reflective of reality. It shouldn't be ignored, obviously, but there's just more to it than that.",
            "title_similarity": "0.6583965",
            "sentiment_compound": 0.9786
        },
        {
            "id": "h0l61xp",
            "score": 2,
            "text": "The worst jobs are ones where you are not busy regardless of the task. If you have a lot of slack time with nothing happening the hours can drag by excruciatingly.",
            "title_similarity": "0.6400829",
            "sentiment_compound": -0.872
        },
        {
            "id": "h0l63mr",
            "score": 3,
            "text": "If your job only takes about 1 hour for every 8 hours you work to actually do, does it count under this methodology?  Cause I have a feeling that's where most of the slack is.  We have two people to answer the phones where I work.  The phone doesn't ring too often. The second person just exists so the first one can take a lunch break (and I guess vice versa) because nobody else wants to be interrupted.",
            "title_similarity": "0.6688689",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0l6f3p",
            "score": 2,
            "text": "Depends how you look at it. In my opinion a lot more jobs are useless. Every unique home, shoe and clothing item has to be designed and produced in it's own way. How many jobs could be saved if those processes were centralized. I work as a graphic designer and most of the work I do is unnecessary fluff that makes my managers go \"ooh\" and \"aah\". How much food is wasted, how much money and effort on advertising, we should be more efficient than to spend 30 years for a place to live. 7 billion of us with the same need yet we still don't have cost efficient mass production for accomodation figured out.",
            "title_similarity": "0.7557421",
            "sentiment_compound": -0.4025
        },
        {
            "id": "h0l6t6k",
            "score": 1,
            "text": "I immediately dismissed everything he said and wrote when I heard him talking about software development and open source. He had no idea how it works.",
            "title_similarity": "0.46543318",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0l7a6e",
            "score": 3,
            "text": "Thought it would be more. Having worked in minimum wage jobs to pay for books and gas, I never took any of my jobs seriously. I don’t think anyone would take minimum wage seriously",
            "title_similarity": "0.5885694",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0l7sn0",
            "score": 2,
            "text": "Could this also do with self image and self confidence? Could this be accounting for people who believe they are where they are supposed to be? Someone in the same profession or even same employer/office could feel differently about their situation.",
            "title_similarity": "0.6261475",
            "sentiment_compound": 0.5661
        },
        {
            "id": "h0l7vwr",
            "score": 3,
            "text": "One in twenty? It’s wayyyyy more than that",
            "title_similarity": "0.33813885",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0l8aa9",
            "score": 3,
            "text": "Hi it's me, one of those 1 in 20 people.\n\nI feel like such a drone in society. Work, home. Rinse and repeat",
            "title_similarity": "0.50464267",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0l8go8",
            "score": 2,
            "text": "People really don’t think 1 in 20 is that high? That seems pretty high to me. Especially since they only used EU survey data. I have nothing but intuition and personal experience to back this next statement up. But, I feel as though the more socialized nature of existence within most EU countries (compared to the US) would create a stronger overall sense of purpose within jobs. I’d just be very curious to see if American survey data would be skewed higher.",
            "title_similarity": "0.7440727",
            "sentiment_compound": 0.8569
        },
        {
            "id": "h0l8t74",
            "score": 1,
            "text": "I'm not saying I'm gay I'm just saying everytime he walked by I'd be like \"look over there\" and point my invisible spouse in the opposite direction because nothing is worse than your imaginary wife leaving you for a beefcake.",
            "title_similarity": "0.6145042",
            "sentiment_compound": 0.6192
        },
        {
            "id": "h0l99st",
            "score": 1,
            "text": "Over the course of 20 years my job focus changed from doing detail work to more soft skills work. Mostly this was due to a rise in technology taking over most of the record keeping and calculations. My case loads tripled in numbers but my actual time of work dropped, a lot. The thing is, during those few busy days I did much more than a busy day 20 years ago. I was in that weird sweet spot of both overworked and bored depending on the random day's events.",
            "title_similarity": "0.6511223",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0l9drf",
            "score": 1,
            "text": "While my job isn't entirely useless, it really doesn't need to be 40 hours a week as I can get all I need to get done in much less time. It seems like 20 hours is not enough and 40 hours is too much. So I'd say about 1/4th or more of my time is definitely useless and I end up just watching yt or looking at reddit",
            "title_similarity": "0.7008189",
            "sentiment_compound": 0.6058
        },
        {
            "id": "h0lavfg",
            "score": 2,
            "text": ">Similarly, individuals who saw their job as useful tended to be able to use their own ideas at work – an important element for feeling that your job provides you with the ability to make the most of your skills – was correlated with a perception of usefulness. There was a clear relationship between the extent to which people felt that they had enough time to do their job well and their rating of the usefulness of their job, suggesting that one source of feeling a job to be useless is the pace at which one is working, affecting the ability to realise one’s potential and capabilities. Other factors correlated with feeling that a job was worthwhile included support by managers and colleagues and the ability to influence important decisions and the direction of an organization\n\nIsn't this ... not what Graeber is even arguing?  This hones in on the worker's relationship to their workplace and determines if they feel like they're providing value to them; which, if they are still employed, is likely yes.  Graeber's argument looks at the societal impact of what that business is attempting to accomplish (make money, support regressive policies to make more money) and asks workers if they feel that they are making a contribution to *society*.  Correct me if I'm wrong.",
            "title_similarity": "0.7096192",
            "sentiment_compound": 0.9771
        },
        {
            "id": "h0lavyw",
            "score": 1,
            "text": "This is not what the sample size that showed up for when I was being selected for jury duty indicated.",
            "title_similarity": "0.42065138",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0laz0p",
            "score": 2,
            "text": " innovation and human striving/technological advancement, specifically with job automation in several sectors making  jobs redundant.\r  \n\r  \nreconcile that with\r  \n\r  \n:all humans have to work to earn their right to basic survival.:\r  \n\r  \n my take: it cannot be reconciled because it is a fundamental paradox...\r  \n\r  \nyou can have a system that aims to free humans from menial drudgery and aims to provide abundance via its own evolution\r  \n\r  \nOR\r  \n\r  \nyou can have a system that requires human drudgery in order to function, and therefore HAS to create artificial scarcity and therefore HAS to hold back human innovation and striving as they would be antithetical to its core values. it cant evolve. it can only self perpetuate.\r  \n\r  \ntrying to do one while claiming to do the other when they are fundamentally antithetical to each other is Double think. straight out of 1984.",
            "title_similarity": "0.64955354",
            "sentiment_compound": 0.9153
        },
        {
            "id": "h0lb5q0",
            "score": 1,
            "text": "Or most people at Amazon",
            "title_similarity": "0.25478506",
            "sentiment_compound": 0.2415
        },
        {
            "id": "h0lbddw",
            "score": 2,
            "text": "I am not surprised at all. I was one of the folks who went from a BS job at a large multi-national to a smaller firm of a 100 folks. \n\nMy humble opinion on the matter and experience is that there were way too many decision makers at the larger firm and this caused issues for us guppies. We would have meetings with 20+ people to have an agreement so that everyone was aligned and ready. Meanwhile, us guppies were at the mercy of those big cheeses to make a simple decision like the color scheme or wording that would be displayed to customers/clients. \n\nAdditionally the blame game was on a whole new level, micro aggressions, indirect scheming and general laziness was the order of each and every day. You would have to be on friendly terms with most people to get anything done and even then the amount of incompetency among senior managers was bafflingly high. It was amazing when we ever got anything done and the amount of re-shuffling & re-organization would be a constant hindrance. \n\nI recall being on video calls where 200+ were informed of restructures and who reports to who and what is done by who would be hosted by the company every 6-12 months. It became so exhausting to keep track of who did what that ppl actively ignored it and it was a running crude  joke. Ppl left precisely because senior management kept trying to implement these side-ways thinking of Agile and Scrum that really missed the mark on what those processes’s intentions were supposed to promote.\n\nNow within a smaller company, things get done much quicker and even with new ppl joining the group, it is more about the need to continue the service that we provide to all clients without sacrificing the agility at which we deliver. I found that I was much more valued and my opinions/suggestions were taken into consideration to promote the betterment of the company and colleagues. The one thing that is the downside to a smaller firm is that you being absent for an extended period of time does cause issues and may impact timelines.",
            "title_similarity": "0.752416",
            "sentiment_compound": 0.8357
        },
        {
            "id": "h0lbmhd",
            "score": 2,
            "text": "How should we take this seriously? I think a core problem is that there is an increasing percentage of people who simply don't have any value to offer in an increasingly automated modern society.",
            "title_similarity": "0.533625",
            "sentiment_compound": -0.6819
        },
        {
            "id": "h0lboty",
            "score": 2,
            "text": "I assume the military was excluded from this study.",
            "title_similarity": "0.33019418",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0lc7bl",
            "score": 1,
            "text": "Oooookay, I’m an employer of about 20 people.\n\nI have very little control over people’s attitudes towards their jobs. I can make a good environment, I can give training and support, I can pay well, I can offer benefits. That sometimes improves their attitude towards their jobs, but not always. Not even “often.”\n\nThe notion that an employer controls an employee’s attitude is way overblown. I employ them, I can slightly influence them, I do not control them.\n\nI am not responsible for their mental health, only ensuring - so far as these things are possible - that the environment at work is as good as it can be.",
            "title_similarity": "0.8130964",
            "sentiment_compound": 0.8722
        },
        {
            "id": "h0lc9da",
            "score": 1,
            "text": "\"something they shod take seriously.\" They won't.",
            "title_similarity": "0.2507069",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h0lcb61",
            "score": 2,
            "text": "more like 1/20 are in useful jobs",
            "title_similarity": "0.42467725",
            "sentiment_compound": 0.6901
        },
        {
            "id": "h0lcid8",
            "score": 14,
            "text": "5%? What, did every middle manager on Earth get laid off or something?",
            "title_similarity": "0.4197973",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ld516",
            "score": 8,
            "text": "1:20 sounds low based on anecdotal experience of office jobs, but I suppose the grand irony is that under performers on the lower levels of orgs are dealt with much faster than the chaff in the higher levels, clearer KPI’s for success at the operational level maybe?",
            "title_similarity": "0.7787621",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h0ld71c",
            "score": 2,
            "text": "*cries in registered nurse*",
            "title_similarity": "0.22839896",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0le548",
            "score": 3,
            "text": "Study was done by middle management.",
            "title_similarity": "0.23603901",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0lfcz1",
            "score": 1,
            "text": "\"American anthropologist David Graeber, who died in September 2020, for highlighting the link between a sense of purpose in one’s job and psychological wellbeing.\"\n\nMy phone decided to cut the above fragment out of the paragraph due to a sidebar, and I was rather worried about the dangers of academic study for a bit.",
            "title_similarity": "0.65089643",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h0lg4qq",
            "score": 1,
            "text": "Entire human race should have to watch that.",
            "title_similarity": "0.2889586",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0lgc93",
            "score": 2,
            "text": "If anyone has worked at Amazon it's a perfect example. That's a job where your mind has plenty to think so you need to keep busy to be happy. Otherwise you'll have a bad time for 10 hours a day. Find your zen during work even.",
            "title_similarity": "0.6977292",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h0lhyj2",
            "score": 2,
            "text": "I am one of these 1 in 20.",
            "title_similarity": "0.17012517",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0lhzi4",
            "score": 2,
            "text": "It’s way higher than 1 in 20.... 1 in 2 maybe",
            "title_similarity": "0.1882871",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0li9a0",
            "score": 2,
            "text": "A new study that contradicts an old study doesn't mean the new study is more accurate.",
            "title_similarity": "0.46503186",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0linau",
            "score": 3,
            "text": "As someone who doesn't do anything at work, I like to explain to people that's the point. I'm the subject matter expert and only required if things are going poorly. \n\nYou don't pay me for what I do, you pay me for what I know and having me on the job will cover you butts when things go to court. No one ever listens though they all complain about the guy on site who doesn't do anything but slow things down and cause problems.",
            "title_similarity": "0.7266713",
            "sentiment_compound": -0.6312
        },
        {
            "id": "h0liza0",
            "score": 4,
            "text": "I feel like employers are not really going to care about workers psychological well being... it's more \"oh we asked too much and burnt you out?  OK we will just hire someone else. Don't let the door hit you... \"",
            "title_similarity": "0.6841897",
            "sentiment_compound": 0.8749
        },
        {
            "id": "h0ljpzt",
            "score": 1,
            "text": "Most existing jobs are necessary given that way of doing things.  Given a different way of doing things lots of the stuff people are employed to do wouldn't be done at all.",
            "title_similarity": "0.6184452",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0llkiq",
            "score": 2,
            "text": "If there are any Douglas Adams fans here, it feels as though our workforce consists mainly of the Golgafrinchams of Ark B.",
            "title_similarity": "0.5251992",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0llobz",
            "score": 1,
            "text": "I keep telling this to everyone.. nobody believes me... :/. I am glad 30,000 ppl already know this.. \nI’ll keep telling more people. \n\nThat’s it. \n\n\nThank you for this.",
            "title_similarity": "0.5397341",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h0llt8q",
            "score": 1,
            "text": "Makes sense. The pandemic has indeed showed me that my being a bartender is actually something to be revered and upheld. People looove to drink. I’d imagine the bs jobs are more like pencil pushing office work? Which is interesting bc hospitality has previously tended to be looked down upon when talking about “real jobs”.",
            "title_similarity": "0.6842227",
            "sentiment_compound": 0.8313
        },
        {
            "id": "h0lm62u",
            "score": 1,
            "text": "Anything in compliance or risk is generally a good starting point for people who generate nothing but paperwork that no one reads",
            "title_similarity": "0.6263689",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0lmbj1",
            "score": 2,
            "text": "It’s a real thing to not feel valued at your job. It really affects how much you want to partake in said job and makes you resent management when you’re treated like garbage. This shouldn’t be shocking news",
            "title_similarity": "0.6571656",
            "sentiment_compound": -0.4599
        },
        {
            "id": "h0lmns1",
            "score": 1,
            "text": "And 92 out of 100 of those 1 in 20 are redditors.",
            "title_similarity": "0.38058057",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0lmvg2",
            "score": 1,
            "text": "I’m in the Army. A very large organization. Absolutely nothing happens without a bunch of dumb meetings and meaningless forms. I want to work at a microbrewery with like a maximum of ten people after I retire next year. Anybody interested? Hard worker here. Capable of making decisions.",
            "title_similarity": "0.6288391",
            "sentiment_compound": 0.128
        },
        {
            "id": "h0lnbzu",
            "score": 2,
            "text": "My employer has showed us employees time and time again that they do not care about our mental health, they don't even care about productivity, just that we are sitting in the office during work hours. It makes me sick.",
            "title_similarity": "0.61816573",
            "sentiment_compound": -0.8204
        },
        {
            "id": "h0lne9c",
            "score": 3,
            "text": "HR wellness perspective:\n\n\"What if we tell people the jobs are essential\"",
            "title_similarity": "0.5815329",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0lnrn7",
            "score": 3,
            "text": "Coming from academia where we often lack project management training and everything feels seat of the pants, sometimes there's a lot of rework: enough formal structure to stick to our guns and avoid rework would be great, but not too much meetings and such that things are deliberately made turgid and slow",
            "title_similarity": "0.68937826",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h0loh5o",
            "score": 1,
            "text": "There’s no way they didn’t lowball that number",
            "title_similarity": "0.26444525",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h0lp5r4",
            "score": 1,
            "text": "Who determined the metric? On what beliefs? \n\nThis is not an objective thing that can be measured completely accurately. \n\nIt's all subjective, but I bet most would agree it's much higher. I'd say it's more like 1/2.\n\nThere's a big difference between unnecessary and non-essential jobs.",
            "title_similarity": "0.6654622",
            "sentiment_compound": 0.8561
        },
        {
            "id": "h0lpx3h",
            "score": 2,
            "text": "Graeber's numbers sounded absurdly high but these sound unbelievably low...",
            "title_similarity": "0.4443165",
            "sentiment_compound": -0.4748
        },
        {
            "id": "h0lr1jt",
            "score": 1,
            "text": "My jobs useless, at least for the casino I work in. We no longer have table games and only have slots. The Slot supervisor are able to do everything I can. Some stuff is supposed to be if we're gone for an emergency or something. But since covid they've gone entire days as the only managers on duty. The only thing I can do they can't is give out comps. If I didn't know how to work on slots I would literally walk around for 8 hours doing nothing unless a guest won a jackpot of $5000 or more, or one of the guests or slot employees needed my help.",
            "title_similarity": "0.64592135",
            "sentiment_compound": 0.743
        },
        {
            "id": "h0lr9jj",
            "score": 2,
            "text": "Only 1 in 20 doesn’t sound right. Pretty much everyone I know works a crappy customer service-oriented job.",
            "title_similarity": "0.7302604",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h0lrumo",
            "score": 1,
            "text": "Is there any actual science in this sub?",
            "title_similarity": "0.20844746",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0lslo1",
            "score": 2,
            "text": "There’s already been a study on this. It didnt change the question completely, and it found a much higher percentage. This is a repeat of a previous study, but with a completely different question being asked. Its worthless.",
            "title_similarity": "0.64327246",
            "sentiment_compound": -0.5927
        },
        {
            "id": "h0lsn8j",
            "score": 1,
            "text": "My job as a car mechanic is pretty essential I'd say, based on the number of daily emergencies I have to deal with. But overall about half of my time is wasted dealing with redundant paperwork, multiple antique or idiotic computer systems, unnecessary mistakes and so forth. Or in another way, about 50% of my labor is consumed by inefficiency. Which is out of my hands to do anything about. That can wear a person down.",
            "title_similarity": "0.6944585",
            "sentiment_compound": -0.9042
        },
        {
            "id": "h0lt31t",
            "score": 2,
            "text": "\"Science\"\n\nThis kind of thing is laughably not possible to study. Keep the discussion philosophical and it absolutely has merit, but trying to pin a number to these things is absurd.",
            "title_similarity": "0.5262785",
            "sentiment_compound": 0.4748
        },
        {
            "id": "h0lt69w",
            "score": 3,
            "text": "Who defines what constitutes a useful job? \n\nI guess I'll do something I rarely ever do and click on the link...\n\n...okay, I read some of it. Seems like they came to that conclusion by asking people what they felt about their own job.\n\nI would postulate that many people just dont want to admit they're wasting most of their life away.",
            "title_similarity": "0.7172655",
            "sentiment_compound": 0.4188
        },
        {
            "id": "h0ltkpv",
            "score": 2,
            "text": "I mean, \"you get what you pay for\".. so it's not shocking that boring jobs with low pay & low fun factor = low employee morale and engagement.\n\nWhen people look at the [US wage and salary growth](https://tradingeconomics.com/united-states/wage-growth) numbers for the **past 50 years**, they see a steady consistent downward trend coupled with never-ending inflation, and some come to the realization that those trends are very likely to continue until someone else eventually designs a robot their employer would eagerly buy to replace them.\n\nAt this point the question becomes:\"*How disconnected from reality would someone have to be to think that average workers today would feel ANY sense of being valued or appreciated by their employer?*\"\n\nSomeone who hasn't held any \"essential jobs\" for the past 50 years would be my guess.\n\nEdit: added the link, switch look-back to \"MAX\" to see which way the tide is going...",
            "title_similarity": "0.7607955",
            "sentiment_compound": 0.9097
        },
        {
            "id": "h0lud79",
            "score": 2,
            "text": "research like this is tough because the data is subjective based on the people's answers.  \nAfter a concept like \"BS jobs\" is well-known then people will work hard to justify why they don't have a BS job. Before the term was invented people could answer honestly about how they felt, but now that it is a \"thing\" they will adjust their perceptions to what they want the answer to be.   \nIt is like any survey on happiness or have i been oppressed or am i paid enough or whatever. You will see people who live in literal war zones say they are happy and people who live luxurious lives complain about money.  \nI don't think people will want to admit they have a bs job, or someone might be deluded that their job is important because they just got hired or whatever.",
            "title_similarity": "0.763659",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h0luhqa",
            "score": 2,
            "text": "5%??? Get the f\\*ck out of here. 50% of jobs could disappear tomorrow and the world wouldn't miss them at all. Sounds like someone trying to justify late-stage capitalism, if you ask me.",
            "title_similarity": "0.59563446",
            "sentiment_compound": 0.3786
        },
        {
            "id": "h0lv94j",
            "score": 1,
            "text": "luckily for me I don’t take anything seriously in life.  so I just do my job poorly and that alone can really brighten my day",
            "title_similarity": "0.61723626",
            "sentiment_compound": 0.5849
        },
        {
            "id": "h0lvyro",
            "score": 6,
            "text": "Asking people how they feel about their work doesn’t actually gauge whether or not their job is objectively a BS job. Of course almost everyone is motivated to tell themselves that they’re contributing SOMETHING necessary to society when they break their back 40-80+ hours a week... Otherwise how would they continue to force themselves to keep going day after day? Having people self-report about something like this tells you very little about the actual necessity of their job, & in fact this seems so obvious that it makes me question the motives of the people doing the study; using this kind of self-reporting where you just ask someone if all the work they pour their time & energy into is worthless as if that’s not a super loaded question seems like an easy way for someone to try to discredit the whole concept of BS jobs without actually doing any close analysis of the claims Graeber proposed or the nature of the jobs themselves. This study basically sets an arbitrary, subjective bar & then says we can dismiss the theory because it doesn’t reach it, even though it doesn’t need to to be correct. It is true that Graeber did suggest that a lot of workers recognized their jobs were unnecessary BS jobs (& I’ve seen firsthand that there’s a lot of reason to believe that, just interacting with coworkers at various places), but their perception of the situation is completely secondary— he only brought it up as a symptom of the underlying economic reality. Factors can change, whether it’s propaganda/PR campaigns or the lack of labor militancy that would seed people with an understanding of the deeper economic implications of their job or what have you, which could change people’s perceptions & lead people to feel like their jobs are necessary without ever actually making those jobs necessary or changing the broader material conditions people are living in.\n\nGraeber clearly had to mean that the jobs themselves were socially unnecessary (not just that workers felt they were pointless), because the higher figures he gave included jobs which are only made necessary because of other really existing BS jobs (so they may seem necessary as things currently are, there may currently be a demand for them, but if we eliminated a lot of the BS jobs in the economy then that demand would be much less & far more of them would be BS jobs. \n\nFor instance, a lot of demand for fast food drive thrus has grown & exists simply because people are working unnecessarily long hours, because they lack the time & energy outside of work to cook for themselves. In Graeber’s definition, these would be BS jobs, because if we lived in an economy where people weren’t working socially unnecessary jobs for unnecessarily long & brutal hours, we wouldn’t need so many of them (& those who we would need wouldn’t need to work so long— we could just employ more people for shorter hours it they were afforded a wage where they could live decent lives without working often 1.5-2x full-time hours). So if you ask fast food drive thru workers “Is your job necessary,” they might say “Well yeah, people buy the food & if someone wasn’t here they wouldn’t be able to.” But that doesn’t actually have anything to do with the underlying claim of BS job theory. The idea is that we could easily eliminate lots of socially unnecessary jobs (BS jobs), & the jobs which are only necessary because of the existence of these jobs, & because most people are working such insanely long hours, & we would much more efficiently meet people’s needs & wants. \n\nAnd if you consider for a moment how insanely much productivity has skyrocketed with the implementation of all the revolutionary technologies we’ve developed over the last century (& really since the Industrial Revolutions), this seems pretty apparent— whether we’re talking about computers & digitization, or the Internet, or lasers, or automotive machines, or transportation technologies, or what have you... I mean, a single worker today produces astronomically more value in an hour of work than a worker did in 1800, 1900, or even 1950... And yet for the mass of workers, real wages have not only stagnated but been falling since the 1970s (not coincidentally with the rollback or the New Deal & implementation of neoliberal “reforms”). Productivity has risen dramatically, profits have risen right along with it, & yet the individual worker who used to produce $10 an hour, & now produces $20 an hour, or whatever the exact figure is, has seen none of the benefits, because the gains were all extracted as profit for the ruling class. If a worker was able to work 40 hours a week & produce $10 an hour before (& were paid let’s say $7.50 as a wage), & now they produce $15 an hour of value, then why are they still being paid $7.50 & having to work more than 40 hours a week to compensate for rising costs of living?? If they saw the benefits of our rising productivity, they could work 20 hours a week & make the same income, or they could work 40 hours a week for double their old income... And the reality we observe is that the owning class has seen massive rises in profit rates, the richest few people are getting far richer, & the majority of working class people are getting squeezed harder & harder, being made to work longer hours for less, despite that owners could easily afford to pay them more. Well, if you are working 40 or 80 hours a week to make ends meet, but you’re only having to work most of that time because your bosses are extracting most of the value & actually if you received the value of your labor you would be paid enough to work 15 or 20 hours a week, then by Graeber’s definition your job is (at least for a lot of the hours) a BS job. Those additional hours are not socially necessary; they’re only necessary so you can scrape enough money together to continue living & profiting your boss, with the only reason it’s “necessary” being because the longer your boss can get you to have to work to survive, the more money they are able to extract from you. With this understanding, it’s hard to imagine that a solid majority of jobs would not at least have a lot of BS hours, if not being entirely BS (which means if people were able to work only the necessary hours for the full value of their labor we wouldn’t need so many people doing the job, which means a lot of the jobs are BS jobs), because this has been the trend across averages of our whole economy— productivity has risen very generally, & wages have continued falling very broadly. But this study is miles away from understanding the theory, & doesn’t frankly seem interested in doing so, so of course they aren’t going to take any of that into consideration.",
            "title_similarity": "0.7833487",
            "sentiment_compound": 0.9965
        },
        {
            "id": "h0lw2gr",
            "score": 1,
            "text": "public relations specialists. Hhahahahah",
            "title_similarity": "0.14224082",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0lw6uc",
            "score": 3,
            "text": "So why isn’t anyone getting paid ? 40 year old millennials have made 80% of what their parents had made, while being more productive.",
            "title_similarity": "0.65444106",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0lwejy",
            "score": 1,
            "text": "I realize most people aren’t workaholics, but I don’t believe that a significant share of jobs produce little or nothing. This is one of those questions that is often a personality test question of the person answering. Ask someone what percentage of jobs are bs, and the people who answer a very high percentage are the cynical ones with a low opinion of American workers generally (speaking as a U.S. person). But American workers are consistently among the world’s most productive, anyone can just Google it and see the stats that are made yearly about it. They’re good people.",
            "title_similarity": "0.79391026",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0lwssc",
            "score": 1,
            "text": "If it cost employers money and doesn't show profit it's not gonna be taken seriously..",
            "title_similarity": "0.54819787",
            "sentiment_compound": -0.4777
        },
        {
            "id": "h0lx0t4",
            "score": 1,
            "text": "its a good thing we have the capacity to convince ourselves differently or this would have given a contradictory null hypothesis",
            "title_similarity": "0.496602",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0lxupq",
            "score": 1,
            "text": "1/20 is still A LOT for a conservative estimate.",
            "title_similarity": "0.4735899",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0lxzij",
            "score": 1,
            "text": "My company employees about 70 people,\n\nI'd say 45 are useless positions. (Including mine most of the time.)",
            "title_similarity": "0.5307517",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0ly23t",
            "score": 1,
            "text": "Of course it's linked to their wellbeing. 40+ hours out of your awake time, has to be spent at a meaningless, useless job that is more than likely paying garbage, just so you can rent a place that's to overpriced and maybe get the brand name Ramen",
            "title_similarity": "0.67631066",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0ly46a",
            "score": 1,
            "text": "There are way more people working in insurance or advertising than 1 in 20 workers.",
            "title_similarity": "0.4561211",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ly8ii",
            "score": 3,
            "text": "My teens and 20’s I though the American dream was entrepreneurship. \n\nThen I realized it was about wearing all the nooses that corporations will put on you. \n\nBecause corporations are the only people that matter. And we have the Internet, food, and big ass trucks polluting our planet. So there is really nothing wrong. “I gots mine” as the say.",
            "title_similarity": "0.7028463",
            "sentiment_compound": 0.1109
        },
        {
            "id": "h0lyeep",
            "score": 1,
            "text": "If you count all the useless industries this number increases.",
            "title_similarity": "0.4416827",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h0lyga2",
            "score": 1,
            "text": "I am one of the twenty. Who’s with me?!",
            "title_similarity": "0.3476642",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0lz2z0",
            "score": 1,
            "text": "How many jobs are actually useless though? Useless to the individual meaning they don't get paid well or good benefits but not useless to society. Servers and retail workers staff many things that almost all of us do for fun and all the money spent is good for the economy.",
            "title_similarity": "0.8004813",
            "sentiment_compound": 0.8966
        },
        {
            "id": "h0lzrh8",
            "score": 1,
            "text": "Ok but what defines useless? Every job has a use otherwise you would not be paid to do it.",
            "title_similarity": "0.65757954",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0m01w7",
            "score": 1,
            "text": "As someone who works with automation and process optimization, I can safely say that this number is slightly skewed due to process inefficiency. Many jobs can and will eventually be invalidated by advanced process automation and AI. That being said, it’s time for society as a whole to think long and hard about what the goals of humankind should be, and strive to attain these while still possible. Ignoring the problems with late-stage capitalism, even if it were a merit-based system (which it isn’t), as automation replaces jobs, people should start to feel encouraged to strive to do the things they enjoy rather than doing what they need to do to survive. It’s a damn shame that the best and brightest minds of our generation are being funneled into meaningless financial jobs where they spend their days forming algorithms and systems designed to make the ultra-rich that much richer. Think of how much human advancement is being missed because of the unseen impact of capitalism. We can and should do better.",
            "title_similarity": "0.729332",
            "sentiment_compound": 0.9149
        },
        {
            "id": "h0m0h15",
            "score": 1,
            "text": "I can think of a lot more useless jobs than what was listed in the article. Retail workers, Customer Service, Cleaning services or Janitorial, Basically every entry-level position.",
            "title_similarity": "0.62524164",
            "sentiment_compound": -0.4754
        },
        {
            "id": "h0m0sni",
            "score": 2,
            "text": "I am that 1 in 20.  Most of the people in my department fall under that category.  The place could run with like 4-5 people but we have 18.  It's not fun.  Everyone is bored so they just gossip and complain incessantly.  Only 26 more years to go.",
            "title_similarity": "0.6544143",
            "sentiment_compound": -0.8792
        },
        {
            "id": "h0m18tq",
            "score": 1,
            "text": "I can hear it now, “I’ll start taking it seriously once it starts costing ME money. My turnover rate is acceptable at the moment, IDGAF.”",
            "title_similarity": "0.5659696",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h0m290n",
            "score": 3,
            "text": "I’m not in a BS job, but there are a lot of BS tasks that my company currently requires. \n\nI don’t even blame anyone, I think this is simply entropy in action. The bigger a company grows, the more complex and layered it becomes. \n\nIt’s why startups happen, and will always have an edge when it comes to simplicity and efficiency. \n\nThe goal of every large organization should be self-editing business processes.",
            "title_similarity": "0.72240084",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h0m3kag",
            "score": 3,
            "text": "I have a feeling the definition is off. There are lots of jobs that are necessary but only for short bursts, leaving people filling time to make their pay the rest of the year.",
            "title_similarity": "0.63045526",
            "sentiment_compound": -0.09
        },
        {
            "id": "h0m4cmp",
            "score": 2,
            "text": "It is interesting that in Japan, employees who are underperforming but still cannot be fired because of social constraints are given BS jobs for the rest of their lives: they become members of the *madogiwazoku*, or the \"window seat tribe,\" meaning that they are metaphorically given a seat by the window where they can stare outside all day while performing useless or mind-numbing tasks.",
            "title_similarity": "0.7103085",
            "sentiment_compound": 0.2584
        },
        {
            "id": "h0m5a7v",
            "score": 1,
            "text": "I am that one in twenty. I cannot offer data, but I can offer anecdotal thoughts, if anyone is interested/I am allowed to do so.",
            "title_similarity": "0.58790797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0m6ivo",
            "score": 3,
            "text": "I'd say middle management accounts for close to half of these useless jobs.",
            "title_similarity": "0.5717599",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0m6x3u",
            "score": 2,
            "text": "Hi, I'm that one in 20. Ama. \n\nSeriously I have a job supporting computer software that isn't used at all. It's been completely replaced and I'm just waiting for them to turn it off later this year. I literally spend my day trying to find things to pass the time (and a lot of browsing reddit).",
            "title_similarity": "0.6156963",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0m7g1a",
            "score": 1,
            "text": "1 in 20 is not as much as I thought.",
            "title_similarity": "0.36419111",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0m7kdv",
            "score": 1,
            "text": "so what happens when no one is those jobs?",
            "title_similarity": "0.33968097",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0m96an",
            "score": 1,
            "text": "Well, that depends a lot on what's considered as \"useless\".\n\nWell, that depends a lot on what's considered \"useless\".rofit and doesn't contribute anything to society, culture or the environment is \"useless\". And that would greatly bump up those numbers to probably the 80-90%. \n\nStarting with \"sales\".",
            "title_similarity": "0.6476766",
            "sentiment_compound": -0.34
        },
        {
            "id": "h0m9kly",
            "score": 1,
            "text": "These survey questions arent comparable and are ofc gonna to create vastly different results.",
            "title_similarity": "0.34761137",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0mag1c",
            "score": 3,
            "text": "The problem with the methodology, as I see it, is that they're relying on self-reported feeling of importance. According to the article, others estimate that 20% to 60% of jobs are bs jobs, but they are probably going by their own assessment rather than the job holder's assessment.\n\nPeople are motivated to evaluate their own work as meaningful even when others see it as bs. For example, do we really need a job where someone's secretary takes specifications from the customers and then brings them down to the software engineers? Even if they \"have people skills\"?\n\nAnd yet the person in that job will claim it's important, because it brings them a paycheck, and also because they have time invested into it. Not that many people in useless jobs want to face up to the inherent uselessness of the work they do.",
            "title_similarity": "0.7981484",
            "sentiment_compound": 0.4606
        },
        {
            "id": "h0maqft",
            "score": 1,
            "text": "But who decides what is useless? Therein lies the crux of it all no?",
            "title_similarity": "0.20567706",
            "sentiment_compound": -0.8299
        },
        {
            "id": "h0mbwvo",
            "score": 1,
            "text": "$AMC is making my terrible job a lot less stressful.",
            "title_similarity": "0.67524",
            "sentiment_compound": -0.7275
        },
        {
            "id": "h0mbz9i",
            "score": 2,
            "text": "Lincoln called wage slavery dehumanizing, only permissible when temporary and as a means to the end of liberation/self-sustainance",
            "title_similarity": "0.5307169",
            "sentiment_compound": -0.8481
        },
        {
            "id": "h0mcn8w",
            "score": 2,
            "text": "I’m one of 20 my job is and has been a joke and boring as hell but it pays ok and the benefits are outstanding.  25 years picking my nose",
            "title_similarity": "0.71834284",
            "sentiment_compound": 0.8705
        },
        {
            "id": "h0me5lp",
            "score": 1,
            "text": "Hive mind, play to your strengths to better yourself and others around you.",
            "title_similarity": "0.45969304",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h0mf0ql",
            "score": 1,
            "text": "I’m sure most bs jobs aren’t even on paper",
            "title_similarity": "0.44788134",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0mfalo",
            "score": 1,
            "text": "Who would have guessed.",
            "title_similarity": "0.067110315",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mg6u5",
            "score": 1,
            "text": "Working in a game store that has 8 employees that could run with just 3 makes me feel that my job is pointless not to mention our products and services are online also and 70% of the time I’m on my phone",
            "title_similarity": "0.58260167",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mgpb0",
            "score": 1,
            "text": "Its why I question when people rage against the concept of a UBI saying people won't want to work - they fucken don't anyway mate even if you pay them.",
            "title_similarity": "0.52477574",
            "sentiment_compound": -0.6395
        },
        {
            "id": "h0mixqb",
            "score": 1,
            "text": "one out of one, which equals 100% says this is hogwash!",
            "title_similarity": "0.38255566",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mjppo",
            "score": 3,
            "text": "One in twenty? \n\nLooks like I've massively defied the odds over the course of my career then!  I've had at least 4 \"BS\" jobs and it sure didn't take me 80 attempts to find them.",
            "title_similarity": "0.63700205",
            "sentiment_compound": 0.6239
        },
        {
            "id": "h0mlagg",
            "score": 1,
            "text": "I stand all day and get paid for it. In fact I'm doing it right now! I literally have zero responsibilities. I'm admittedly poor, but I'm also lazy so I can't see myself fighting for a career change.",
            "title_similarity": "0.6961993",
            "sentiment_compound": -0.4455
        },
        {
            "id": "h0mlb19",
            "score": 1,
            "text": "If only I could receive trucks from home.",
            "title_similarity": "0.34096384",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mmcao",
            "score": 1,
            "text": "This may say more about the employee than the job.",
            "title_similarity": "0.5299407",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mn4ec",
            "score": 2,
            "text": "My job provides so much stress and so much harassment that I not only have the expected depression, I have PTSD and just developed diabetes type two, strongly linked to PTSD.",
            "title_similarity": "0.57855123",
            "sentiment_compound": -0.8576
        },
        {
            "id": "h0mo0mt",
            "score": 1,
            "text": "Huh, guess I'm part of that 5%...",
            "title_similarity": "0.13672051",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mo2q2",
            "score": 1,
            "text": "I doubt it's that low.",
            "title_similarity": "0.11302552",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0mo9l0",
            "score": 1,
            "text": "I'm in a useless job. I'm used to manufacturing gigs but here I find myself at a gas station.. FML",
            "title_similarity": "0.517515",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h0mohyo",
            "score": 1,
            "text": "Who really knows?  There will be those who believe they’re doing “BS work” and aren’t, and those who *are* doing “BS work” while thinking they’re productive. \n\nIt’s pretty difficult to objectively quantify it.",
            "title_similarity": "0.5771341",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0mor1n",
            "score": 1,
            "text": "I work at a juice bar that serves rich tech bros. I definitely have a useless job",
            "title_similarity": "0.46132642",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h0mp8jo",
            "score": 1,
            "text": "The guy who wrote this is a 1 in 20 guy.",
            "title_similarity": "0.4182258",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mpmyz",
            "score": 1,
            "text": "So this is self reported, I have to wonder how many of those people were in something like MLM, or people making cold calls selling nonsense.  \n  \nWhat I'd love to see is a study on which jobs and companies could completely disappear, and their absence would not impact the functioning of the world in any way (beyond the obvious GDP/taxes impact).  \n  \n I'm pretty sure we get rid of like 20% of companies, reduce what counts as \"full time\", and we'd end up with everyone working less and having more time to themselves.",
            "title_similarity": "0.7688671",
            "sentiment_compound": 0.77
        },
        {
            "id": "h0mq6xn",
            "score": 2,
            "text": "I've worked as a telephone survey agent, a medical records auditing agent, a travel sales rep, a closed captioning agent, a credit card customer service rep, a cell phone customer service rep, a supplemental water line insurance rep, a B2B IP phone technical support rep, a farmhand at a Mormon's vanity ranch, a security guard, a car manufacturing factory worker, and a slot machine factory worker.\n\nLiterally the only ones that I felt were useful to society were the closed captioning job and the IP phone tech support. Captioning isn't automated enough to not require a human factor (we had to dictate the unclear dialogue for speech-to-text to understand it at the rate of accuracy required for true ADA accomodation), and all kinds of businesses need phones.\n\nI *enjoyed* the slot machine factory work... for the couple days I got to be there before COVID caused shutdowns everywhere. That doesn't mean it's useful to society. I'd much rather be putting the exact same manufacturing processes into creating arcade cabinets than slot machines.",
            "title_similarity": "0.6243893",
            "sentiment_compound": 0.9359
        },
        {
            "id": "h0mql0q",
            "score": 2,
            "text": "Had a mental breakdown a few weeks ago after losing my job because of a year of stress from working in Texas with assholes customers that would wear masks. Fun times.",
            "title_similarity": "0.5855087",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h0mqnem",
            "score": 1,
            "text": "If you don’t like your job, and you won’t do anything about it, that’s on you.",
            "title_similarity": "0.5358007",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0mquqb",
            "score": 1,
            "text": "People in general have a bad attitude towards their jobs, especially in retail. I always thought I would hate it too, but it’s really not bad if you lose your ego and accept the fact that people are going to do silly things.",
            "title_similarity": "0.67993873",
            "sentiment_compound": 0.1512
        },
        {
            "id": "h0mr9ct",
            "score": 1,
            "text": "I think they left off a 0, should be 1 out of 2 people in useless jobs",
            "title_similarity": "0.5824558",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0mrgmg",
            "score": 1,
            "text": "But what's the operational definition of a BS job?",
            "title_similarity": "0.2707957",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mrhe3",
            "score": 1,
            "text": "I personally like having a useless job. No stress! Listen to podcasts all day while reading emails, scheduling meetings and doing power points.",
            "title_similarity": "0.6132071",
            "sentiment_compound": 0.3235
        },
        {
            "id": "h0msb9a",
            "score": 2,
            "text": "Well yeah. People that don’t think they are important probably don’t think their job is important. Having a sense of purpose helps.",
            "title_similarity": "0.53725123",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h0msisa",
            "score": 2,
            "text": "Another weird grey area with unnecessary jobs would be jobs like doorman and valets. Sure it’s nice to have but we could definitely park are own cars and open our own doors. They are actually decent paying jobs and people are glad to have them but how essential or necessary is that really? It’s about making rich people feel served and like they are better than people. Maybe that’s a smidge too cynical but some servicey stuff seems like it exists because people need a job to survive and people like to have people under them.",
            "title_similarity": "0.7174169",
            "sentiment_compound": 0.9792
        },
        {
            "id": "h0msjjx",
            "score": 1,
            "text": "X for doubt more like 19/20 are bs jobs. No one wants to work at McDonald's",
            "title_similarity": "0.516781",
            "sentiment_compound": -0.228
        },
        {
            "id": "h0mt9ys",
            "score": 1,
            "text": "TIL that one in twenty workers work for the government.",
            "title_similarity": "0.476397",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mtc3n",
            "score": 2,
            "text": "yea no way this is true. name a job and ill tell you why its bs.",
            "title_similarity": "0.433333",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0mto69",
            "score": 1,
            "text": "As a veteran, I can say that the rates of bs jobs are higher in the military.",
            "title_similarity": "0.50997925",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0muo0d",
            "score": 1,
            "text": "I would be cool with staying at my job if they paid me 10-15k more per year.",
            "title_similarity": "0.5985863",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0mvj8k",
            "score": 1,
            "text": "I know for electrical engineering defense contractors are by far the largest source of employment. This means we benefit from being perpetually at war to create those jobs.",
            "title_similarity": "0.5975279",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h0mvp1z",
            "score": 1,
            "text": "I work in gov affairs for banking ... golden child of this book.",
            "title_similarity": "0.30712926",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mvsws",
            "score": 1,
            "text": "Everyone who works as a game journalist and \"gender studies\".",
            "title_similarity": "0.3418045",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mvvsr",
            "score": 1,
            "text": "Underemployed. I just left a job i had for 7.5 years because I couldnt take it anymore. Dont have anything lined up, but some savings. It changed how I interacted with people, even my family, because I was developing coping mechanisms for 8 hrs a day and it would carry over.",
            "title_similarity": "0.62327087",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mw7sb",
            "score": 1,
            "text": "Oh man you mean someone’s mental well-being is linked to their relationship (or lack thereof) to the actual value of their labor? Man if only someone had written about this exact thing 154 years ago.",
            "title_similarity": "0.6951663",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h0mxm8p",
            "score": 1,
            "text": "I think they mean \"menial labor\".",
            "title_similarity": "0.4410608",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0mylx1",
            "score": 2,
            "text": "I dont believe these numbers\n\nThere are so many holes to unpack here...",
            "title_similarity": "0.42166466",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0myou5",
            "score": 1,
            "text": "Tbf I only read the headline but TRUTH. Experiencing this in this moment (r/synchronicity) perspective is everything",
            "title_similarity": "0.46634388",
            "sentiment_compound": 0.6186
        },
        {
            "id": "h0mzxcm",
            "score": 1,
            "text": "I’m happy at my job. I get paid well. I have great benefits. I work at my own pace. I don’t have managers breathing down my back.",
            "title_similarity": "0.5786215",
            "sentiment_compound": 0.91
        },
        {
            "id": "h0n02wl",
            "score": 2,
            "text": "I think half of all jobs could be totally eliminated and nothing would change (apart from economically).",
            "title_similarity": "0.6850086",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n1f1j",
            "score": 1,
            "text": "I wonder if he could link me to my perfect job since I keep getting fired for many psych issues causing my behaviors! And I'm a nurse! I do not like being a nurse! The medical field is nothing but corruption and abuse towards the clients/patients /residents...one thing you can't do is advocate for your patients! It gets you in trouble half the time! Anyways...",
            "title_similarity": "0.64905125",
            "sentiment_compound": -0.9189
        },
        {
            "id": "h0n1pye",
            "score": 1,
            "text": "Can attest Have no Job makes every day suicide day",
            "title_similarity": "0.5080953",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h0n1wq2",
            "score": 2,
            "text": "The 1 in 20 depends entirely on the metric used in the survey. Sociology isn't an exact science. Different metrology would have produced entirely different results.",
            "title_similarity": "0.5429895",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n4cu9",
            "score": 1,
            "text": "Wait a minute, it has to be way more than that considering all the jobs in HR and safety personnel.",
            "title_similarity": "0.5326165",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0n5ptx",
            "score": 2,
            "text": "Not counting Fortune 500 CEOs",
            "title_similarity": "0.43601358",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0n5ru4",
            "score": 2,
            "text": "This just reminds me of Office Space and filling out useless tps reports. And I think if you ask anyone in the military, they'll say 60% of their time is waiting for something to happen.",
            "title_similarity": "0.55235016",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h0n653y",
            "score": 1,
            "text": "Looks like their data ends in 2015? Would be really interesting to see how that ratio changes when the pandemic hits.\n\nI've always wondered if there's substantial overlap between people who state they only work 2-3 hours a day but have to be there for 8 hours and people that get laid off when the economy tanks.",
            "title_similarity": "0.66130614",
            "sentiment_compound": 0.4848
        },
        {
            "id": "h0n6f5l",
            "score": 1,
            "text": "Always make your self useful. Even if it means doing another person Job.",
            "title_similarity": "0.45676678",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0n6hr7",
            "score": 1,
            "text": "Really depends what they're definition of \"useless job\" is. As soon as you include any job that could be done by a machine it's probably like 5 in 20.",
            "title_similarity": "0.53880596",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h0n72pz",
            "score": 5,
            "text": "\nI once saw a man of about 55 working at a Japanese fast food place (a soba noodle shop) late at night.  He was supremely dignified and respectful. His every movement was refined by clear experience from dedication to being good at what he was doing. \n\nTo put it differently, the deep dissatisfaction in so many people in the west today is not because their dreams seem impossible in today’s economy (which is itself true, in the US anyway) but rather,\nTheir dreams of being famous are delusional and they do not respect that every task that anyone is willing to pay for is itself worth doing well. Do it with pride and dedication or just don’t do it at all.\n\n We need a revolution in respect for and celebration of trades, labor, effort. \n\nApproach work with pride and try to do your best and stop seeking Nirvana in your job. Your job is something you do, so do it well",
            "title_similarity": "0.7144846",
            "sentiment_compound": 0.9761
        },
        {
            "id": "h0neu0l",
            "score": 2,
            "text": "I read that entire article one line at a time in the very limited space left under the giant cookies/personalization choice pop up. I won.",
            "title_similarity": "0.49394757",
            "sentiment_compound": 0.3626
        },
        {
            "id": "h0nsule",
            "score": 1,
            "text": "People finally starting to realize the problem with the world, and what is to be done about that one problem.",
            "title_similarity": "0.4790315",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h0o1fks",
            "score": 1,
            "text": "What a dumb study. Who did they get to answer this?",
            "title_similarity": "0.3703821",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0o5qxz",
            "score": 1,
            "text": "We’ve done two episodes of The Busyness Paradox on this topic!\n\n[BS Jobs](https://busynessparadox.com/2021/05/18/podcast-we-put-the-cult-in-culture/)\n\n[Show Crap Jobs Some Love](https://busynessparadox.com/2021/05/28/podcast-show-crap-jobs-some-love/)",
            "title_similarity": "0.57417846",
            "sentiment_compound": -0.5093
        },
        {
            "id": "h0qhrg5",
            "score": 1,
            "text": "It seems like it is something workers should take seriously too, since their own subjective perception of how important their job is, that's something that is under their own control.  The world doesn't choose for you whether you think your job is useless, you learn to appreciate it yourself.",
            "title_similarity": "0.6678679",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0rdava",
            "score": 1,
            "text": "I'm a computer programmer at a non-profit which does not need a programmer. I spend my entire day learning advanced computer science. I am currently studying artificial intelligence which is well beyond anything this non-profit should be into. They were still using a MS-DOS application until a few years ago! The only project I've been asked to do is modernize a few SharePoint sites. To be fair, SharePoint is quite a rabbit hole.",
            "title_similarity": "0.5615194",
            "sentiment_compound": 0.8313
        },
        {
            "id": "h0tpo5o",
            "score": 1,
            "text": "Yeah. Sorry about that guys. They must all be concentrated in my company and if we were missed during the study the numbers would be way off. \n\nI've literally just stopped showing up to work for like a month before and it made no difference. One time I just went to Florida and phoned into my only meeting for two weeks from Disney land. Last week I just didn't feel like getting up in the morning...",
            "title_similarity": "0.5998796",
            "sentiment_compound": -0.4606
        },
        {
            "id": "h0uhx9m",
            "score": 1,
            "text": "I can’t contemplate a job actually caring about my well-being",
            "title_similarity": "0.38938668",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0vrezf",
            "score": 1,
            "text": "David Graeber's other point was that this was impossible to make better under capitalism, so needed to be abolished.",
            "title_similarity": "0.5797874",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2fbimw",
            "score": 1,
            "text": "Why do \\~15% of mine workers think their jobs are useless??",
            "title_similarity": "0.65019965",
            "sentiment_compound": -0.4871
        },
        {
            "id": "h2zxd5a",
            "score": 1,
            "text": "Me!! Completely useless.Wish i could resign.",
            "title_similarity": "0.35737795",
            "sentiment_compound": -0.4559
        },
        {
            "id": "h3hlxcz",
            "score": 1,
            "text": "A commie is full of it? My god stop the presses",
            "title_similarity": "0.2718962",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h3n216p",
            "score": 1,
            "text": "Bull - i wager 1 in 4 are in useless jobs.",
            "title_similarity": "0.522658",
            "sentiment_compound": -0.4215
        }
    ]
}