{
    "Psilocybin therapy appears to be at least as effective as a leading conventional antidepressant\n": [
        {
            "id": "h0uwd8c",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.27886873",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h0v8ldp",
            "score": -6,
            "text": "No history of problems with this drug in the past?",
            "title_similarity": "0.4854619",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h0ve7cm",
            "score": 1,
            "text": "I am entering my third week of \"on 5, off 2\" after a five-month break (procuring is a dark art and my grows have all failed)  and holyshit this therapy is VERY effective for me.",
            "title_similarity": "0.42233062",
            "sentiment_compound": 0.2086
        },
        {
            "id": "h0v3834",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "0.22232391"
        },
        {
            "id": "h0v9vlu",
            "score": 14,
            "text": "This and lsd. Thanks for telling the world the obvious, what any hippy could of told you in the 60s-70s. I was born in 83, 37 years old and know better",
            "title_similarity": "0.41500288",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0vnudk",
            "score": -1,
            "text": "First off I'm a fan of psychedelics. \n\nin general but modern antidepressants have a ridiculously low effectiveness this isn't saying much with the bar set so low.",
            "title_similarity": "0.73397577",
            "sentiment_compound": -0.8277
        },
        {
            "id": "h0vskts",
            "score": 6,
            "text": "r/science and drug propaganda name more iconic duo.",
            "title_similarity": "0.54524803",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0vgir3",
            "score": 3,
            "text": "Is it ill advised at this early stage in research to self-administer micro-doses to achieve this end? I have full-on tripped a couple dozen times and have always felt emotionally cleansed in the days and sometimes weeks following. My concern is that I may overdo it with a self-medicated dose and get my mind in a difficult space. In the 20 odd some times I’ve tripped I’ve had only one bad experience that stands out, but I’m not keen on repeating it.",
            "title_similarity": "0.48866904",
            "sentiment_compound": -0.8028
        },
        {
            "id": "h0vn28p",
            "score": 2,
            "text": "Please let’s not pull a 70’s and completely stop researching this. This could revolutionize humanity",
            "title_similarity": "0.34117657",
            "sentiment_compound": -0.0498
        },
        {
            "id": "h0vh4y2",
            "score": -14,
            "text": "So about as effective as placebo.",
            "title_similarity": "0.6808392",
            "sentiment_compound": 0.5209
        },
        {
            "id": "h0v9p36",
            "score": 5,
            "text": "If it was only equal in efficacy to SSRIs that would be terrible news.",
            "title_similarity": "0.6191943",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h0vhvyb",
            "score": -5,
            "text": "25mg is less than a standard micro dose. I can’t imagine these people would “feel” anything.",
            "title_similarity": "0.45116955",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vod05",
            "score": -4,
            "text": ">at least as effective\n\nThats a pretty low bar considering most conventional antidepressants are essentially placebos to see if you just start feeling better on your own after a few weeks.",
            "title_similarity": "0.7459173",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h0vfp95",
            "score": -3,
            "text": "I think that’s amazing and great news for those fir whom traditional medicine is worthless. Bravo, science.",
            "title_similarity": "0.53723216",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h0vmwq0",
            "score": -5,
            "text": "But do shrooms cause Suicidal/mass murder tendencies like big pharma anti depressants?",
            "title_similarity": "0.40230724",
            "sentiment_compound": -0.8922
        },
        {
            "id": "h0vr4lw",
            "score": 5,
            "text": "I was extremely depressed in my early 20s and took some shrooms with friends.\n\nI laughed for the first time in years and stopped taking myself so seriously. It genuinely changed my life for the better and I never felt that morbidly depressed again. \n\nI went from being a shy introvert with a fear of ridicule to a confident extrovert happy to poke fun at myself.",
            "title_similarity": "0.42549938",
            "sentiment_compound": 0.2419
        },
        {
            "id": "h0ves5u",
            "score": 14,
            "text": "We NEED  to get politicians out of the business ofbtelling Doctors what they can or can not do.",
            "title_similarity": "0.22742303",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vj1ag",
            "score": -6,
            "text": "1969: man on moon\n1970: all drugs illegal\n\nThey want to keep you from the inner-space and trade it for the \"outerspace\"",
            "title_similarity": "0.17187941",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0vi1e4",
            "score": 7,
            "text": "MNMD   Mind med is a company that specializes in this style of medicine. I've been doing some research and it looks promising in the near future",
            "title_similarity": "0.54280347",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0v1zpf",
            "score": 57,
            "text": "New experiences help relieve depression. I wonder how much of this is the new adventure they just had.",
            "title_similarity": "0.6372671",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0uzksj",
            "score": -51,
            "text": "[removed]",
            "title_similarity": "0.22232391"
        },
        {
            "id": "h0vluv5",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "0.22232391"
        },
        {
            "id": "h0vekds",
            "score": 3,
            "text": "Plus the visuals are better (unless they're using a non-psychoactive dose, of course)",
            "title_similarity": "0.76520526",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0vka9b",
            "score": 27,
            "text": "This, this is good news for my mushroom stocks",
            "title_similarity": "0.502473",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0vcu9h",
            "score": 57,
            "text": "highly recommend this book.\n\n&#x200B;\n\n[https://michaelpollan.com/books/how-to-change-your-mind/](https://michaelpollan.com/books/how-to-change-your-mind/)",
            "title_similarity": "0.54820347",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h0vse5o",
            "score": 119,
            "text": "[deleted]",
            "title_similarity": "0.21985696"
        },
        {
            "id": "h0vglwl",
            "score": 0,
            "text": "Is this something that is available to everyone as therapy? or not yet?",
            "title_similarity": "0.43544292",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vj365",
            "score": 0,
            "text": "better actually! You just feel normal provided you micro dose.",
            "title_similarity": "0.6786947",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h0vk1ib",
            "score": 0,
            "text": "Best drug in the world! My personal favorite.",
            "title_similarity": "0.6416711",
            "sentiment_compound": 0.8172
        },
        {
            "id": "h0vk4l0",
            "score": 0,
            "text": "Have been on medication half my life and I’m intrigued to try this",
            "title_similarity": "0.40213832",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vldr8",
            "score": 0,
            "text": "Thank you for sharing this!",
            "title_similarity": "0.38136244",
            "sentiment_compound": 0.68
        },
        {
            "id": "h0x41zy",
            "score": 0,
            "text": "So not at all hahahaha",
            "title_similarity": "0.22331558",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0x42vf",
            "score": 0,
            "text": "This sub is such a joke.",
            "title_similarity": "0.36098504",
            "sentiment_compound": 0.296
        },
        {
            "id": "h0x4pr9",
            "score": 0,
            "text": "ANTI-DEPRESSANT DRUGS ARE A LIE. Recreational therapies/meditation is the answer, change the way you think, get some perspective. Speaking from life long depression here, I'm happily married with twin baby girls and on track for what I want out of life. Set your goals!",
            "title_similarity": "0.53416395",
            "sentiment_compound": 0.126
        },
        {
            "id": "h0vu7az",
            "score": 31,
            "text": "This will no doubt turn into another \"oh ma gawd, psychedelics are so cool guyz\" post ***sigh***\n\n\nPeople should be careful with Psilocybin and other such drugs. I see its use being endorsed by those that have had a positive experiences following DIY use, who are encouraging others, whose tolerance and history they don't understand, to do it. \n\nPeople should be aware that for some individuals,  it may not have any therapeutic efficacy, and infact may trigger a host of dormant issues (for example, if you have a predisposition towards psychosis, that may be triggered by a trip, especially if you're in your developmental stage). So the cost to benefit ratio deosn't stack.\n\nIt's important to clarify then that in a clinical setting, Psilocybin is being used to treat treatment resistant depression (depression that's resistant to SSRI treatment) within these experiments. When this depression is melancholic, meaning that its not anxiety driven, where a patient may be on edge or paranoid, rather when a patient doesnt see a reason to live and feels generally Anhedonic, in that instance, it MAY benefit that person to give them a single subjective experience where their sense of colour is more vivid, they see beauty and their neurotransmitters shift etc.\n\nThis experience, under a clinical setting, can be powerful enough to give patients a reason to live and treat symptoms of Anhedonia, it can also shift how individuals think (people may become less ego driven, more empathetic etc)\n\nTL;DR there is a risk of debilitating mental disorders in some individuals following use, and that's why in clinical trials a selection process is used to identify subjects best suited for positive benefits and filter out others using cost to benefit analysis. For DIY use outside of a clinical setting, take at your own risk! - I know from anecdotal experience people who were never the same after taking these drugs.",
            "title_similarity": "0.6979322",
            "sentiment_compound": 0.9853
        },
        {
            "id": "h0vssm4",
            "score": -5,
            "text": "yeah, let's create a generation of junkies, absolutely splendid idea!",
            "title_similarity": "0.34336567",
            "sentiment_compound": 0.8264
        },
        {
            "id": "h0uz0mc",
            "score": -17,
            "text": "Don't get high, expand.",
            "title_similarity": "0.3130086",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h0vqmbw",
            "score": 8,
            "text": "Psilocybin did not cure my depression, but it made me realise how bad it was.\n\nI'd heard of the benefits, and had previously had 3 or 4 good experiences in the past, of relatively low doses. Nothing out of this world though.\n\nI'd read some trip reports of heroic doses, and decided it was time to dive in.\n\nI procured 12g, discussed it with my partner (who is thankfully a registered nurse with previous experience in mental health), and had the trip that night (in a comfortable space, with earplugs and a blindfold), with my partner in the next room and sober. Brewed a 7g tea and chugged it all.\n\nI can't remember anything specific from the trip. It definitely wasn't a bad or scary trip. There were a few crazy moments at the start, travelling to other worlds / dimensions, conversing with... things? I mostly remember after that, possibly at their suggestion or because of that journey, that the trip changed to going through a lot of past moments of my life, and those of my friends and family. And slowly coming to the realisation that I wasn't \"normal\". Not everybody felt the way that I did. That, at the end of the day... I was ill.\n\nWhen I sobered up and came too, I think I cried in my partners arms for 6 hours, questioning everything.\n\nThe next morning I presented to ED, and spent a week on the psych ward. Not the most fun experience, but necessary. I thought I was depressed and anxious all my life. I was diagnosed with bipolar type 2 and ADHD, both pretty surprising, but also not in retrospect. I'm now on meds that work for me and finally making strides with therapy for the first time ever. The mood stabiliser has brought down the frequency of my severe depressive episodes a lot, and the ADHD stimulants make my brain work properly, pretty much eliminating anxiety and are probably the most life changing of the two.\n\nPsychedelics are not for everybody. I would not suggest to anyone to do what I did. Not at least without some serious research and support from someone qualified to help. \n\nBut if you get the opportunity to try it (safely), then it might change your life as much as it did mine.",
            "title_similarity": "0.5954838",
            "sentiment_compound": 0.9651
        },
        {
            "id": "h0vbzdf",
            "score": -1,
            "text": "Didn’t this come out a couple months ago??",
            "title_similarity": "0.25547987",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vosw4",
            "score": -1,
            "text": "So $MMND is back on the menu?",
            "title_similarity": "0.3150831",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vprep",
            "score": -1,
            "text": "Yes.  It can also cause depression too.  First time I took it my babysitter did nothing as my \"friend\" told me horrifying stories about a man alone in various places, and beset by enemies on all sides.\n\nSo I sat there, tripping balls, as my friends left me to the wolves so to speak.\n\nWas NOT a good 6 months after that,  and some of that is on me.  Some of it isn't though. \n\nTrip wisely my friends.",
            "title_similarity": "0.2746904",
            "sentiment_compound": -0.8769
        },
        {
            "id": "h0w3r0o",
            "score": -1,
            "text": "What is the cause of this 'I told you so mentality'? Seems like hippy quackery. \"I fucked up and made terrible life choices, I'm now a scum bag with a terrible job. But drugs aren't bad. Umm kaaay\".",
            "title_similarity": "0.48399073",
            "sentiment_compound": -0.0369
        },
        {
            "id": "h0wuia1",
            "score": -1,
            "text": "Why does Reddit talk about mushrooms like it’s some magic bullet to treat depression?  Should there be accepted uses? Of course - But it should be distributed and monitored by a doctor.\n\nThere’s going to be people who take Reddit’s advice and seriously mess themselves up.",
            "title_similarity": "0.44263837",
            "sentiment_compound": -0.594
        },
        {
            "id": "h0x0nl3",
            "score": -1,
            "text": "I'm really, really torn by this stuff because my depression and anxiety are absolutely crippling and I want them gone as much as I want anything and my fluoxetine feels like it does basically nothing, however I've always been really against street/party drugs (weed, lsd, ecstasy etc.) and drug culture, I hate people getting high around me and it makes me severly uncomfortable.\n\nThis sort of news really rips me up because to me it's like telling someone who's been paralysed for years they can start walking again if they smoke crack or molest kids. I'm having a really bad moral quandary about treating the thing that ruins me with something I hate.",
            "title_similarity": "0.32730412",
            "sentiment_compound": -0.9536
        },
        {
            "id": "h0x3xky",
            "score": -1,
            "text": "Sure, how are the side effects, contraindications, and drug interactions compared to the leading antidepressant?\n\nPeople all too often see illegal drugs as some miracle panacea without considering the downsides, the lack of testing, and the dangers.\n\nI'm all for new ways to treat diseases, but those ways shouldn't amount to a home remedy of whatever amount someone feels like, without regard for their health or other meds they're on.  But the legalization crowd all too often would sacrifice these people on their quest to get high without fear of consequence.  And it's really unpopular with them to suggest that the helpful bits be extracted and made into a carefully prescribed pill, rather than simply eating shrooms, because their goal isn't better healthcare, but getting high legally.",
            "title_similarity": "0.4905957",
            "sentiment_compound": 0.8585
        },
        {
            "id": "h0w39cv",
            "score": 6,
            "text": "Do you guys post anything else on this sub?",
            "title_similarity": "0.19735846",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0uyi4q",
            "score": -97,
            "text": "[removed]",
            "title_similarity": "0.22232391"
        },
        {
            "id": "h0vd7zn",
            "score": 221,
            "text": "[removed]",
            "title_similarity": "0.22232391"
        },
        {
            "id": "h0vg1gu",
            "score": 548,
            "text": "[removed]",
            "title_similarity": "0.22232391"
        },
        {
            "id": "h0xeesd",
            "score": -2,
            "text": "Wait but the mushies were still less effective than psych meds. It says right there in the article. I’m all for it - but people here are celebrating without reading because they love drugs",
            "title_similarity": "0.59395504",
            "sentiment_compound": 0.9482
        },
        {
            "id": "h0ve4ym",
            "score": 66,
            "text": "I have extremely persistent anxiety/panic and I've always wanted to join a study like this.  I don't take any meds and I don't use any \"street\" drugs, but I would love to get involved with a professional who could administer psilocybin in a controlled environment.  \n\nDoes anyone know how to find these studies and get in on it?",
            "title_similarity": "0.33488938",
            "sentiment_compound": 0.8462
        },
        {
            "id": "h0vhyrw",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.21985696"
        },
        {
            "id": "h0xal88",
            "score": -4,
            "text": "Here come the anecdotes.",
            "title_similarity": "0.41624343",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vyd83",
            "score": 3,
            "text": "Why do they give the other group 1mg psilocybin instead of a placebo or 0.01mg so it doesn't have any psychoactive effect?\n\nWe need a proper study with a placebo grup",
            "title_similarity": "0.59662014",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vwvkm",
            "score": 16,
            "text": "[deleted]",
            "title_similarity": "0.21985696"
        },
        {
            "id": "h0vk4yg",
            "score": 17,
            "text": "\"At least\" notwithstanding, \"as effective as [SSRI's]\" is damning with faint praise.",
            "title_similarity": "0.74439156",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h0uxz53",
            "score": 160,
            "text": "Here’s an amazing podcast overviewing all the evidence for psilocybin.\n\nhttps://psychiatrypodcast.libsyn.com/psilocybin-therapy-part-2-clinical-trials-secondary-effects-brain-imaging-and-the-future-of-psilocybin-therapy",
            "title_similarity": "0.43666667",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h0vnc3g",
            "score": 8,
            "text": "If you click through you can find [a handy chart summarizing the study](https://i.imgur.com/W765K5D.jpg)",
            "title_similarity": "0.3781637",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vhu0k",
            "score": 404,
            "text": "This study did not evaluate if participants were *aware of what condition they were in. This makes it unclear if blinding actually occurred. If it did not, participants could have been swayed by the fact that they are likely to know what condition they are in.\n\nThis problem has plagued research into psychedelics from the beginning. Large part of the reason that psychedelic research disappeared is that when the 'promising' earlier studies were repeated using an RCT design the benefits disappeared.\n\nThis trial is very small and the evidence is too early to establish the effectiveness of psilocybin. Longer trials, with more participants, and varying doses of psilocybin are required. Varying the dose will help to get around the issue of blinding somewhat.\n\n*Edit: a word.",
            "title_similarity": "0.57332385",
            "sentiment_compound": 0.0194
        },
        {
            "id": "h0vyour",
            "score": 42,
            "text": "I'd also like to see a study when they have a control group that takes no antidepressant at all, and takes 100% placebo, so they can account for what therapy does in if itself to lower depression.",
            "title_similarity": "0.4840746",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h0vh2hq",
            "score": 904,
            "text": "[removed]",
            "title_similarity": "0.22232391"
        },
        {
            "id": "h0vejvi",
            "score": 1376,
            "text": "I really hope that psilocybin with guided therapy sessions will become legal soon. I’ve heard people say that taking psychedelics or similar really helps clear up the fog that mental illness causes you, like depression or PTSD, in ways that current medication can’t hold a candle to. While in some states in the US (iirc) these substances are legal, it is probably rarer to find therapists who are licensed to work alongside these substances which is probably an important factor in really nailing down the root of the problem.\n\nI had read an interesting comment regarding the effects of psilocybin: Imagine that your brain is a ski slope, and your negative thoughts are the trails that you frequent which causes you to go down them more often than you would a different trail. Psilocybin adds a new layer of snow on top of your ski slope, which will make it easier for you to develop different mentality and perspective to yourself than before.\n\nThe only problem I can see happening is that big pharma will try their hardest to lobby against the legalization of psilocybin therapy, as some psilocybin substances that come from shrooms are easily cultivated by yourself, therefore putting a plug in one of pharma’s biggest cash cow. \n\nRegardless, I believe there is a group that are currently recruiting testers for psilocybin therapy in the states. Hopefully somewhere in the next decade or so (sooner? who knows) it will become more accessible for the sake of mental wellness.",
            "title_similarity": "0.7219955",
            "sentiment_compound": 0.9035
        },
        {
            "id": "h0v14x5",
            "score": 7491,
            "text": "It's taken us over 40 years to get back to the same point we were when scientists first started studying psychedelics. Psilocybin, LSD, and the like will revolutionize therapy.",
            "title_similarity": "0.39986634",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0vkdkw",
            "score": 3,
            "text": "What is the risk of a bad trip? I’ve never taken illegal drugs, but I’ve been on multiple SSRIs for years. I am in regular therapy, exercise, do yoga, etc. I need more. I’m excited for the possibility, but I was telling someone about this the other day and they said you could have a bad trip. That scares me.",
            "title_similarity": "0.38187575",
            "sentiment_compound": -0.7328
        },
        {
            "id": "h0vl25w",
            "score": 11,
            "text": "Keep in mind this is through therapy, not dosing mushrooms with your friends on a camping trip once and hoping it cures everything.",
            "title_similarity": "0.3718794",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h0vlds4",
            "score": 1,
            "text": "I used to take non-stimulant ADD medication, now I microdose",
            "title_similarity": "0.6065547",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vlyye",
            "score": 1,
            "text": "Give it 8-12 years, caffeine gets classed a WMD.",
            "title_similarity": "0.3529335",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vm7h4",
            "score": 1,
            "text": "“At least as effective”\n\nMy n=1 anecdote is my first session with mushrooms did more for my mental well being than the almost decade I was medicated for my mental health.\n\nWay more effective (for me).",
            "title_similarity": "0.63600904",
            "sentiment_compound": 0.6697
        },
        {
            "id": "h0vmca5",
            "score": 3,
            "text": "America needs to be like Oregon and just decriminalize all drugs",
            "title_similarity": "0.24449617",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0vmvw0",
            "score": 1,
            "text": "you know, this is all good and well. but i'm still thinking the best antidepressant is to not have a mode of production that make people sick.",
            "title_similarity": "0.713869",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h0vmw3d",
            "score": 1,
            "text": "What was the dose of escitalopram?",
            "title_similarity": "0.53746086",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vnejl",
            "score": 1,
            "text": "So, for a very uncool 24 year old who has no friends and has never done anything other than weed but has always wanted to, how would I go about getting access to said substance? In california btw",
            "title_similarity": "0.253675",
            "sentiment_compound": -0.1967
        },
        {
            "id": "h0vnhux",
            "score": 7,
            "text": "Has anybody here experienced HPPD due to hallucinogens?",
            "title_similarity": "0.52363485",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vnila",
            "score": 1,
            "text": "Whole lot more fun though",
            "title_similarity": "0.40219313",
            "sentiment_compound": 0.5563
        },
        {
            "id": "h0vnk22",
            "score": 1,
            "text": "how do you try them?  How do you get them, figure out a dose, use it safely without freaking out?",
            "title_similarity": "0.58340913",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h0vo377",
            "score": 1,
            "text": "Promising news, yet to be meaningful applicable science  it needs to be more than a single study. A sample size  of 59 certainly could be expanded and the trial period of six weeks in my opinion doesn’t fully address the issue of long term treatment effects. .Note the study concludes that there is no significant difference between the two treatments, so it’s simply suggesting that psilocybin might be as good. Hopefully there will be more studies, with larger samples and conducted over a longer period of time.",
            "title_similarity": "0.52994955",
            "sentiment_compound": 0.8862
        },
        {
            "id": "h0vo95s",
            "score": 1,
            "text": "What does it mean to have a  guided therapy session with psychedelics?",
            "title_similarity": "0.4789952",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vobee",
            "score": 2,
            "text": "And for cluster migraines.",
            "title_similarity": "0.3547862",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vosdx",
            "score": 1,
            "text": "So... Not very effective?\n\nAfter six weeks, scores reduced by an average of 8.0 points for those in the psilocybin group and 6.0 points for those in the escitalopram group — a difference that was not statistically significant.\n\nAlso, it is a pointless study, as shown by:\n\nA bigger trial with a straight placebo condition would have further helped to clarify results and our interpretation of them,” Carhart-Harris explained.",
            "title_similarity": "0.59979707",
            "sentiment_compound": -0.3533
        },
        {
            "id": "h0vova7",
            "score": 1,
            "text": "this is interesting because as someone with anxiety and depression, psilocybin has only ever given me worse anxiety. So it really doesn't work for me.",
            "title_similarity": "0.54971457",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h0voyc5",
            "score": 3,
            "text": "But will these magic mushrooms give you the flat affect that the prescription SSRI's do",
            "title_similarity": "0.64418536",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vp8mt",
            "score": 2,
            "text": "So I’ve had depression and anxiety all my life, I’m now in my 30s. Ive been cycled through loads of medications all with a dumbing down affect. I didn’t even feel human on SSRI’s. A friend of mine asked if i wanted to try a low dose of magic mushrooms because he takes them when he feels depressed and they always helped. I didn’t really expect much, I took a low enough dose that I felt a slight sense of euphoria and everything was funny. Colours looked more vivid and my thoughts seemed more positive and less erratic. My speech also improved, almost like a block had been lifted. The up lifting affects lasted 3 weeks until I started to feel depression creeping back in. For me it was a total game changer, it made me not think about suicide for a whole 3 weeks, the longest I can remember going and from one small dose. I can’t believe it’s illegal, and I’m willing to take the risk to feel hopeful again.",
            "title_similarity": "0.47779122",
            "sentiment_compound": 0.3666
        },
        {
            "id": "h0vpbm5",
            "score": 1,
            "text": "\"at least as effective as a leading conventional antidepressant\". well no new psycopharmaca really came out since the 70s since its nearly impossible to prove their effectiveness against a placebo controllgroup so this line really says nothing, no? still hyped to see some form of progress in using hallucinogenics in therapy, seems to be a good direction",
            "title_similarity": "0.6679903",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h0vpgld",
            "score": 1,
            "text": "I was literally prescribed an antidepressant and Im not against taking them. I just wish we had more options. I know my history of side effects with certain medications. And that has made me weary of Rx. Just wish the average person could get a fair chance to look at our options for treatment regardless if they come from psychedelic shrooms.",
            "title_similarity": "0.5850129",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h0vphvr",
            "score": 1,
            "text": "Sertraline works decent for me but it makes you gain weight, gave me stomach problems in general, and made hangovers worse. Plus it loses effectiveness over time and you have to up the dosage which increases negative side effects.\n\nDidnt have too much trouble coming off it. Was just a little more emotional than normal for a few weeks. \n\nTherapy was the most effective treatment i have done though and these drugs would undoubtedly be a revolutionary tool for therapy practices.",
            "title_similarity": "0.64352983",
            "sentiment_compound": -0.8457
        },
        {
            "id": "h0vpkwz",
            "score": 1,
            "text": "MNMD stock looking mighty tasty.",
            "title_similarity": "0.5056904",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vpvgt",
            "score": 1,
            "text": "Simple as that. But we can all know that when the media is ready. They need the money from selling antidepressants.",
            "title_similarity": "0.46588844",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h0vqavk",
            "score": 1,
            "text": "It would be hard to be less effective.",
            "title_similarity": "0.41605228",
            "sentiment_compound": 0.3415
        },
        {
            "id": "h0vqege",
            "score": 1,
            "text": "I don't know what to think of this header considering that the effectiveness of conventional antidepressants is debatable these days.",
            "title_similarity": "0.5597174",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vqo3f",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.21985696"
        },
        {
            "id": "h0vqu53",
            "score": 1,
            "text": "> Patients in the psilocybin group received 25 mg of psilocybin during two sessions. Those in the escitalopram group, on the other hand, only received 1 mg of psilocybin during their sessions — a dose with negligible effects.\n\nWouldn't that have made it obvious to those in the escitalopram group?",
            "title_similarity": "0.63226044",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0vrabf",
            "score": 1,
            "text": "I'm 31 now. I could have told you that at 16. I was forced on zoloft for my depression. I could not stand the inability to control my thoughts or happiness. It was my my experience taking those meds that I could not stop feeling happy. Until I crashed and went into an even worse state. I stopped taking them and faked taking them until they let me stop. I was not perfect the next couple years. Everyone has their ups and downs. I will tell you what though. Shrooms and acid made me appreciate my life and the people around me so much more and made me question existence as a whole. Psychedelics did more for me then a pharmaceutical ever could. I actually enjoy life now. Yeah not happy all the time but I see the silver linings and know there is a purpose.",
            "title_similarity": "0.38793144",
            "sentiment_compound": -0.5732
        },
        {
            "id": "h0vri4s",
            "score": 1,
            "text": "Why did they give psilocybin in the escitalopram placebo group?",
            "title_similarity": "0.5061419",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vsdou",
            "score": 1,
            "text": "I have tried all the antidepressants. The only thing that has worked is shrooms. I do one big hit a year and then microdose if needed.",
            "title_similarity": "0.4219875",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vsiik",
            "score": 1,
            "text": "How does the placebo actually work in case of psychedelics though? If I were given the negligible effects dose of psilocybin, I'd very much know this, from the fact that I wasn't tripping?",
            "title_similarity": "0.7372527",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vswfq",
            "score": 1,
            "text": "Shrooms just made me have a bunch of dumb realizations that I thought were profound but didn't actually help me at all",
            "title_similarity": "0.47039542",
            "sentiment_compound": -0.6171
        },
        {
            "id": "h0vsynj",
            "score": 1,
            "text": "Didn't I read something recently about it being a placebo effect?",
            "title_similarity": "0.5345738",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vsyvh",
            "score": 1,
            "text": "Far more in my awe. Ahh been a decade though.",
            "title_similarity": "0.32072788",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vt0jg",
            "score": 1,
            "text": "Thanks for the advice guys. I'm a little wary of growing shrooms because I literally live next door to a former cop. But if I ever get a chance to get some to try, I'll definitely keep your advice in mind. :)",
            "title_similarity": "0.42672172",
            "sentiment_compound": 0.9046
        },
        {
            "id": "h0vt4ev",
            "score": 1,
            "text": "Will still take years to legalize it.",
            "title_similarity": "0.22325811",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vt4o5",
            "score": 1,
            "text": "microdosing.  highly recommend.",
            "title_similarity": "0.51541275",
            "sentiment_compound": 0.4201
        },
        {
            "id": "h0vt5fm",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.21985696"
        },
        {
            "id": "h0vt8wh",
            "score": 1,
            "text": "I can feel the momentum building these days:)",
            "title_similarity": "0.34190953",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vte89",
            "score": 1,
            "text": "I'd much rather take shrooms than the chemical cocktail I am on now",
            "title_similarity": "0.49728924",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vtva4",
            "score": 1,
            "text": "that's nice to hear but what about sanitary wise?",
            "title_similarity": "0.53422433",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h0vu492",
            "score": 1,
            "text": "I need some shrooms ASAP.",
            "title_similarity": "0.22215278",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vuc3l",
            "score": 1,
            "text": "And that means thay psilocybin is better at treating depression than sugar cubes.",
            "title_similarity": "0.78441656",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h0vugk6",
            "score": 1,
            "text": "I hope to god this becomes an option for treatment in the U.K.",
            "title_similarity": "0.46168053",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h0vv1sw",
            "score": 1,
            "text": "It seems progress is now going back where we were several decades ago, good because policy from the 70s onwards has only been worse and worse.",
            "title_similarity": "0.48359692",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0vv414",
            "score": 1,
            "text": "So when do we stop talking about what we've known for ages and actually start getting people help?",
            "title_similarity": "0.23829374",
            "sentiment_compound": 0.128
        },
        {
            "id": "h0vv9yn",
            "score": 1,
            "text": "I'm looking forward to new advancements made in psychotherapy with the usage of psilocybin! I'm convinced that it will revolutionise anything we know about mental health",
            "title_similarity": "0.4629764",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h0vvrud",
            "score": 1,
            "text": "Show your support. Invest in Mindmed.",
            "title_similarity": "0.4004404",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0vvs3f",
            "score": 1,
            "text": "I saw a documentary on BBC Iplayer yesterday called 'The Psychedelic Drug Trial'. A group of people suffering from depression was split into two. One group received psilocybin with a placebo packaged as antidepressants, the other group received a placebo and real antidepressants. The participants and the researchers did not know who got what. The results were incredible. I can highly recommend this documentary. The documentary can be watched via a VPN for people outside the UK.",
            "title_similarity": "0.53281903",
            "sentiment_compound": -0.6133
        },
        {
            "id": "h0vvvfo",
            "score": 1,
            "text": "The persons running this experiment are going to Hell!!!'",
            "title_similarity": "0.14480138",
            "sentiment_compound": -0.7562
        },
        {
            "id": "h0vw2ss",
            "score": 1,
            "text": "The thing these kinds of \"recreational drug helps treat mental illness\" studies *always* leave out is... *if you are predisposed to psychosis or anything similar to it, do not do these*.",
            "title_similarity": "0.6042654",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0vxe0l",
            "score": 1,
            "text": "Electroconvulsive therapy is still far more effective vs drug resistant forms of MDD.",
            "title_similarity": "0.7438427",
            "sentiment_compound": 0.5256
        },
        {
            "id": "h0vxj59",
            "score": 1,
            "text": "I'd think LSD and mdma would be better, especially combined together aka candy flipping. Doing LSD will change your life forever, in a good way too",
            "title_similarity": "0.5486029",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0vxo89",
            "score": 1,
            "text": "The BBC did a documentary on this ‘the psychedelic drug trial’.",
            "title_similarity": "0.3775698",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vy84g",
            "score": 1,
            "text": "Invest in the industry now while it’s young. Psychedelics will completely revolutionize mental health in the next 10 years.",
            "title_similarity": "0.4311452",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vyg5a",
            "score": 1,
            "text": "what if it’s not the psilocybin or antidepressants but our environment",
            "title_similarity": "0.5232743",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vyob4",
            "score": 1,
            "text": "That’s probably because other antidepressants rarely have an effect over placebo. There was a big danish study which showed this.",
            "title_similarity": "0.7109765",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0vyuty",
            "score": 1,
            "text": "How reputable is this Journal? Whenever I see some study done it is pretty small scale and is always about medical properties of drugs.",
            "title_similarity": "0.56412244",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h0vzjt1",
            "score": 1,
            "text": "Certainly more effective, but it’s not for everyone.",
            "title_similarity": "0.62939835",
            "sentiment_compound": 0.4398
        },
        {
            "id": "h0vzsvd",
            "score": 1,
            "text": "When I tripped a few times it left me in a good haze helped confirm the answers to my questions I had in life.I think it’s the way of the future",
            "title_similarity": "0.5454011",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0vzuio",
            "score": 1,
            "text": "aaaaand circle meets the square",
            "title_similarity": "0.148043",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0w0d3i",
            "score": 1,
            "text": "Works way better for me and bonus, I only seem to have to do it every 5 years.",
            "title_similarity": "0.47598115",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h0w0pmx",
            "score": 1,
            "text": "Shits gonna get shut down by big pharma. You can’t patent a plant, so no profit for them.",
            "title_similarity": "0.24685095",
            "sentiment_compound": -0.6617
        },
        {
            "id": "h0w0rry",
            "score": 1,
            "text": "Any chance this also helps with anxiety?",
            "title_similarity": "0.512875",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0w0w8e",
            "score": 1,
            "text": "Tbf, Antidepressants are not much better than placebos",
            "title_similarity": "0.735071",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h0w1wu3",
            "score": 1,
            "text": "There’s clearly a lot of small studies around psychedelics and mental health now, but does anyone have a sensible idea of how far away we are from seeing these treatments actually become available?",
            "title_similarity": "0.5756488",
            "sentiment_compound": 0.2144
        },
        {
            "id": "h0w20ec",
            "score": 1,
            "text": "Comes with the added bonus of ego transcendence and spiritual growth..\n\nWhere as pharmaceuticals come with the added bonus of cancer, suicidal thoughts and a whole host of horrible side effects.\n\nDon't do drugs, kids (pharmaceutical ones I mean)",
            "title_similarity": "0.55894554",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h0w2b1x",
            "score": 1,
            "text": "works quicker too.. or so I have heard..",
            "title_similarity": "0.4538687",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0w2izp",
            "score": 1,
            "text": "Guys, read the actual paper. P-value of 0.17 is hardly proof. It shows some potential, but the article has massively exaggerated the findings and its honestly bad journalism.",
            "title_similarity": "0.4844109",
            "sentiment_compound": -0.3291
        },
        {
            "id": "h0w2o7s",
            "score": 1,
            "text": "As someone interested in trying magic shrooms as a depression treatment how can I get over my anxiety of potentially getting anxious? Most of the time I smoke weed I get paranoid.",
            "title_similarity": "0.4021188",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h0w2q1w",
            "score": 1,
            "text": "I gotta say there is a lot of \"patting themselves on the back\" going on in the comment section. I worry a lot for this idea that \"It worked for me so it will work for all, and have no potentially dangerous side effects ever\" mixed in with the sad fact that anti-depressants aren't an easy field at all etc gives a completely false view of the situation.\n\nI am happy this is moving on, but by gods people, stay as critical to shrooms as you do any drug. Its not a miracle drug.",
            "title_similarity": "0.56145346",
            "sentiment_compound": -0.8494
        },
        {
            "id": "h0w3fg1",
            "score": 1,
            "text": "Does anyone know if this is something that a doctor can prescribe?\n\nI am about to go back on meds again and I really hate that idea. Does \"Right to try\" cover things like this? Is it even legal? I also have really bad anxiety attacks when my mind is altered like with THC or something to I worry about that but this seems very promising and I would like to try it for my depression.",
            "title_similarity": "0.5184819",
            "sentiment_compound": -0.6142
        },
        {
            "id": "h0w3ird",
            "score": 1,
            "text": "\"as effective\" so barely more than a placebo?",
            "title_similarity": "0.7030384",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h0w3j01",
            "score": 1,
            "text": "Who published this - - pharmaceutical companies?  Psilocybin is in an entirely new category for treatment.  It's the category that the medical profession won't use because it's so effective that they'll lose business.",
            "title_similarity": "0.49249822",
            "sentiment_compound": 0.3163
        },
        {
            "id": "h0w3r47",
            "score": 1,
            "text": "The medical associations are already getting behind pharmaceutical companies by trying to establish a protocol where a patient must undergo treatment involving at least two antidepressants prior to psilocybin treatment.  It's a last resort for the professions that profit on illness.",
            "title_similarity": "0.45539558",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0w3xba",
            "score": 1,
            "text": "I just feel so god damn sorry for Stanislav Grof, as he‘s still the only person who did a large-scale, long-time study with LSD, only to be shut down when the drug was condemned and banned.",
            "title_similarity": "0.35356385",
            "sentiment_compound": -0.7718
        },
        {
            "id": "h0w4rr6",
            "score": 1,
            "text": "Republican Religious fanatics always set us back…",
            "title_similarity": "0.2581981",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0w553m",
            "score": 1,
            "text": "Im hopeful but there's no trials near me.",
            "title_similarity": "0.30137843",
            "sentiment_compound": -0.1655
        },
        {
            "id": "h0w57ix",
            "score": 1,
            "text": "This isn't going tripping with your friends. These studies are supervised therapy with the additions of psychedelics.",
            "title_similarity": "0.57843876",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h0w5vp7",
            "score": 1,
            "text": "> The patients completed a standardized scale of depressive symptom severity known as the Quick Inventory of Depressive Symptomatology–Self Report. At the start of the trial, the mean score was 14.5 out of 27 for the psilocybin group and 16.4 for the escitalopram group. After six weeks, scores reduced by an average of 8.0 points for those in the psilocybin group and 6.0 points for those in the escitalopram group — a difference that was not statistically significant.\n\nSo if I'm getting this right, they had people start on an SSRI and had them report on their symptoms after six weeks? Speaking from experience (n=1 in this case, but there are many reports to be found), the side effects set in very quickly (mere days after starting in my experience) but the antidepressant effects can take many weeks as I recall. I wouldn't be surprised if the SSRI hadn't built up any/most of its momentum after six weeks.\n\nStill, I like what I'm reading.",
            "title_similarity": "0.6028052",
            "sentiment_compound": -0.1643
        },
        {
            "id": "h0w66m4",
            "score": 1,
            "text": "r/unclebens\nr/shroomery",
            "title_similarity": "0.33025837",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0w6at3",
            "score": 1,
            "text": "I have micro and macro dosed, highly recommend it for those suffering from depression.",
            "title_similarity": "0.512535",
            "sentiment_compound": -0.6133
        },
        {
            "id": "h0w6drk",
            "score": 1,
            "text": "Can't wait to see this same news being reported in 5 years with zero actual progress",
            "title_similarity": "0.33790237",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0w6nue",
            "score": 1,
            "text": "It's much more effective, actually. And with none of the side effects of conventional antidepressants. \n\nStill schedule 1 though. Because science.",
            "title_similarity": "0.7448652",
            "sentiment_compound": 0.5256
        },
        {
            "id": "h0w8wtn",
            "score": 2,
            "text": "From personal experience, it’s so much more effective..",
            "title_similarity": "0.57309604",
            "sentiment_compound": 0.5657
        },
        {
            "id": "h0w9ruz",
            "score": 1,
            "text": "Added benefit of allowing you to have a long conversation with the rug. Listen to his life story.",
            "title_similarity": "0.24959315",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0wa433",
            "score": 1,
            "text": "Exercise is at least as effective as conventional antidepressants. This is a very low bar to clear.",
            "title_similarity": "0.8575356",
            "sentiment_compound": 0.5118
        },
        {
            "id": "h0wa4h0",
            "score": 1,
            "text": "Forgive me for saying this, but I was under the impression leading conventional antidepressants were not very effective at all. The Kirsch studies from ~15 years ago suggested they were not much more effective than placebo on average.",
            "title_similarity": "0.5640043",
            "sentiment_compound": -0.6611
        },
        {
            "id": "h0waqqy",
            "score": 1,
            "text": "The present study is not a quantum leap: it is under-powered and does not prove that psilocybin is a better treatment than standard treatment with escitalopram for major depression. However, it offers tantalizing clues that it may be.”\n\n\nLet's not get ahead of ourselves now. More testing needed",
            "title_similarity": "0.6655553",
            "sentiment_compound": -0.2716
        },
        {
            "id": "h0wbkec",
            "score": 1,
            "text": "My mushroom trip 3 months after my mother's death was the only way I was able to keep going. I was already on antidepressants (not one that affects seratonin, that stops psychedelics from working) but  I was still too depressed to function. After the trip where I went over some of the hardest parts about my mother's death in my mind, I was able to sort of move on and continue taking care of my responsibilities.",
            "title_similarity": "0.41423416",
            "sentiment_compound": -0.85
        },
        {
            "id": "h0wbwl3",
            "score": 3,
            "text": "Ah cool! I worked on this trial. Good to see it yielded results.",
            "title_similarity": "0.5136118",
            "sentiment_compound": 0.6696
        },
        {
            "id": "h0wcc36",
            "score": 1,
            "text": "That's good to hear. This way, patients can choose between psilocybin and conventional drugs",
            "title_similarity": "0.7086588",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h0wcjfe",
            "score": 1,
            "text": "Amazing when I post this it gets removed from this subreddit???",
            "title_similarity": "0.37160382",
            "sentiment_compound": 0.6531
        },
        {
            "id": "h0wco95",
            "score": 1,
            "text": "That’s amazing because it also doesn’t cause severe withdrawal or  red to be taken every single day.",
            "title_similarity": "0.59109986",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0wd69o",
            "score": 1,
            "text": "I’m a little confused because it says the psilocybin group only received 25mg which isn’t even a “microdose” right? But then they also had like music and a guided experience as if it was enough to be tripping on? I don’t really understand.",
            "title_similarity": "0.499604",
            "sentiment_compound": 0.4778
        },
        {
            "id": "h0wdndf",
            "score": 1,
            "text": "why such a small dose of the ssri? To untrained eyes like mine it looks like they weren't comparing 'effective' doses.",
            "title_similarity": "0.5611452",
            "sentiment_compound": 0.3498
        },
        {
            "id": "h0wdro9",
            "score": 1,
            "text": "Welcome to the party.  There's room for everyone.",
            "title_similarity": "0.19169907",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h0wemiq",
            "score": 1,
            "text": "TLDR: Some depressed people ate psychedelics and were guided through their trips by shamans. They were cured.",
            "title_similarity": "0.5014852",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0wen21",
            "score": 1,
            "text": "Well neither work for me so is there another option?",
            "title_similarity": "0.29894462",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0weo84",
            "score": 1,
            "text": "Person with severe depression here, idk if this comment has been made but I have anxiety too and I know pshycadelics have been known to help but I’d never do it as I’ve heard way too many horror stories with shrooms etc. \nmost ppl with depression usually also have anxiety so I’m interested to see how many ppl are scared to try it as I ask. (Because  of anxiety)",
            "title_similarity": "0.42092615",
            "sentiment_compound": -0.9462
        },
        {
            "id": "h0wesr5",
            "score": 1,
            "text": "i used to be super angry, depressed. couldn't think a thought out. decided to go back to mushrooms after years hearing \"it helps with this stuff\". couple weeks go by with micro dosing. all is good. one day i hero dose by accident (grazing shrooms over a couple hours not weighing.) i had a horrible trip, my whole worlds was like it was consumed by a huge tree and i was in a world of only leafs'. i still don't know what it means. i made it thru. haven't touched mushrooms since. my anger went away i can stop my self. my depressing thoughts went away i can stop my self. i can generally think my thoughts out and not come to rash decision now.  its been a year. its like all my uncontrollable mental issues before became controlled. i would never suggest anyone do what i did (i believe it would of been around 7 grams of golden teachers) but i hope it can be studied now in the right way because i believe its power with all my heart.",
            "title_similarity": "0.32440227",
            "sentiment_compound": 0.8492
        },
        {
            "id": "h0wevgh",
            "score": 1,
            "text": "The only time in my life that I have ever felt my depression and anxiety disappear (albeit temporarily) was after taking lsd. The day after I had taken some tabs, I was no longer hallucinating and I was conscious and normal but I felt NO sadness or worries. I stepped outside and realised how peaceful and normal I felt, and I thought “is this how normal people feel when they’re just walking down the street”? There was no voice inside telling me how everybody was looking at me and no voice telling me dozens of things to worry about. I cried of relief and happiness. After about a week I was back to how I was before, but I’ll never forget that. \n\nI tried lsd again (months later) but didn’t have the same good feeling afterwards because I think the tripping experience I had wasn’t as pleasant (company and location weren’t as good, maybe). \n\nI heavily support the study and application of psychedelics in mental health treatment. Nothing else has ever helped me before. I may be on the autistic spectrum and I have very deep-rooted, treatment-resistant depression and anxiety and it may be the only way.",
            "title_similarity": "0.4676376",
            "sentiment_compound": 0.9289
        },
        {
            "id": "h0wf0gn",
            "score": 1,
            "text": "That's super exciting",
            "title_similarity": "0.36109412",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h0wfx9k",
            "score": 1,
            "text": "Time to buy some $MNMD",
            "title_similarity": "0.36192212",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0wgtel",
            "score": 1,
            "text": "From personal experience, conventional antidepressants only do more harm than good",
            "title_similarity": "0.6907523",
            "sentiment_compound": -0.1604
        },
        {
            "id": "h0wgxhr",
            "score": 1,
            "text": "Pfft I could have told them that.",
            "title_similarity": "0.41349578",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0wh1qt",
            "score": 1,
            "text": "Where do you go for such treatment?",
            "title_similarity": "0.29383415",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0whtzf",
            "score": 1,
            "text": "Was on escitalopram for the longest time and always felt like I was trading off slightly less depressive thoughts for greater, more inconvenient side effects, including the ones they list here. \n\nNew age science is so awesome.",
            "title_similarity": "0.5993034",
            "sentiment_compound": 0.7593
        },
        {
            "id": "h0wias1",
            "score": 1,
            "text": "\"The researchers recruited 59 men and women between the ages of 18 and 80 years who suffered from moderate-to-severe depression for their 6-week trial. Thirty patients were randomly assigned to the psilocybin group, while the remaining 29 patients were assigned to the escitalopram group.\"\n\n\nThe next study needs to make sure they have a group of women, specifically ages 20 to 50 give or take a year, and see what's going on. Women's hormonal cycles tend to be ignored and in mental health that's no different. My depression is always worse right before menstruation and anecdotally I don't seem to be the only one. Havening another avenue for treating that would make a huge difference.",
            "title_similarity": "0.33880597",
            "sentiment_compound": -0.9274
        },
        {
            "id": "h0wiy8y",
            "score": 1,
            "text": "This study absolutely did not indicate what the title suggests. Very misleading.",
            "title_similarity": "0.2930556",
            "sentiment_compound": -0.4576
        },
        {
            "id": "h0wj69h",
            "score": 1,
            "text": "Idk man, i have been depressed for like a decade or so, and the last years have been the worse, now i have taken antidepressants for 2 years. Im still not completely not depressed, but it helped a lot in the hopelessness feeling, but also made me have less energy. I think its better for me if i treated depression in other ways that aren chemicals",
            "title_similarity": "0.58047533",
            "sentiment_compound": -0.8509
        },
        {
            "id": "h0wjam0",
            "score": 1,
            "text": "We already know this! Legalize already!",
            "title_similarity": "0.22396412",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0wjc6n",
            "score": 1,
            "text": "So that's why they're Schedule 1 then?",
            "title_similarity": "0.3352797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0wjeg6",
            "score": 1,
            "text": "Have there been any studies on how it helps panic attacks?",
            "title_similarity": "0.49369633",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h0wjvkr",
            "score": 1,
            "text": "The data isn’t statistically significant. Not saying it’s not promising but you could hardly say it’s as effective. They only tested on 59 patients. Any change in outcome could be random.",
            "title_similarity": "0.5494436",
            "sentiment_compound": 0.6021
        },
        {
            "id": "h0wkawr",
            "score": 1,
            "text": "I didn't see a comparison of side effects between them. Is there anything that looks at that?",
            "title_similarity": "0.33495668",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0wkg73",
            "score": 1,
            "text": "It helps that antidepressants don't actually work. Just saying.",
            "title_similarity": "0.64608514",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h0wky4s",
            "score": 1,
            "text": "Idk if escitalopram is the same as citalopram, but citalopram caused me to clench my teeth which has ruined my jaw (causing nonstop discomfort and pain in my face neck and back) and I had brain zaps for years (and still do sometimes). I ate mushrooms in college and it was an incredible experience with no side effects to my knowledge. Citalopram helped with my panic attacks, but I wish I knew a bit more about the jaw thing and the brain zaps but doctors have a rush to prescribe these things.",
            "title_similarity": "0.38439196",
            "sentiment_compound": -0.97
        },
        {
            "id": "h0wm0rb",
            "score": 1,
            "text": "Pretty low bar considering antidepressants have little to no efficacy",
            "title_similarity": "0.5936302",
            "sentiment_compound": 0.046
        },
        {
            "id": "h0wna4v",
            "score": 1,
            "text": "With zero of the side effects",
            "title_similarity": "0.54088926",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0wntow",
            "score": 1,
            "text": "Nice, only a few decades behind.",
            "title_similarity": "0.5282374",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0wpouu",
            "score": 1,
            "text": "Gonna be interesting when science integrates with the depths of psychedelics, i.e. realizing you're God while tripping and all that. \nThey have long been separated and 'contradictive', in lack of better words, so I'm stoked to see what happens to science and religion when they mix.",
            "title_similarity": "0.4245252",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h0wpp6x",
            "score": 1,
            "text": "Was recently speaking to a psychiatrist who was extremely excited and optimistic about the future of alternative medicines to treat her patients with than conventional anti-depressants. My sister who has been a long time sufferer of severe depression recently tried a mushroom brownie that had a low dose of psilocybin in it. The result was quite honestly shocking. Following the night she took it, my sister was like a whole new person. It was the best parts of my sister and none of the pessimism and heartbreaking defeated attitude and crushing sense of doom. This last for a bout two weeks before depression symptoms presented themselves again. Now obviously, I'm not a doctor, and my sister is a very very small sample size. But my experience makes me extremely hopeful for her and those like her who have struggled with conventional medicines and just want to feel better.",
            "title_similarity": "0.50235915",
            "sentiment_compound": 0.7335
        },
        {
            "id": "h0wr3t4",
            "score": 1,
            "text": "Pharmaceutical companies don't want you to be able to grow treatments at home.  They will bribe, sorry, lobby the politicians to keep it that way.  The drug system needs to be dismantled and re-research from the ground up.  Marijuana is still a class 1 drug for the feds, while fetynal is class 2.",
            "title_similarity": "0.3319276",
            "sentiment_compound": -0.3009
        },
        {
            "id": "h0wrbt3",
            "score": 1,
            "text": "Psilocybin is going to be huge in the therapy industry",
            "title_similarity": "0.45330966",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h0writs",
            "score": 1,
            "text": "I mean, yeah. \n\nAnecdotally, I'm on 4 mental health management medicines I take every day, and still struggle constantly. On or off meds, mushrooms make everything good and comfortable for about 2 weeks and make me feel legitimately better about myself.",
            "title_similarity": "0.3577653",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h0wsnd9",
            "score": 1,
            "text": "It’s about 1000 times more effective as far as I am concerned",
            "title_similarity": "0.42136627",
            "sentiment_compound": 0.5256
        },
        {
            "id": "h0wt7cg",
            "score": 1,
            "text": "All this research is exciting, but really understated the need for this to be developed and controlled. Seeing all this exciting stuff and then just dosing yourself and going for a trip isn’t a smart plan, I discovered while being stuck in a bad trip.",
            "title_similarity": "0.41279218",
            "sentiment_compound": 0.5461
        },
        {
            "id": "h0wtxuo",
            "score": 1,
            "text": "Man if only people cared about human health and not money.",
            "title_similarity": "0.3874947",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0wufsp",
            "score": 1,
            "text": "The FDA will go for it just as soon as a corporation can find a way to patent it, like Coca-Cola/Cargill did with Stevia.",
            "title_similarity": "0.35577092",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0wuqdd",
            "score": 1,
            "text": "The $$$ is in the treatment, not in the cure",
            "title_similarity": "0.4707788",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0wuvn8",
            "score": 1,
            "text": "Microdosing ketamine has also been proven to do better than anti depressants \n\nhttps://www.verywellmind.com/ketamine-and-treatment-resistant-depression-5024849",
            "title_similarity": "0.83975697",
            "sentiment_compound": -0.25
        },
        {
            "id": "h0wvnfm",
            "score": 1,
            "text": "Given that psilocybin appears to work by \"the brain unlearning\" based on a previous study, would that not suggest that depression is a \"learned\" state that is solved via unlearning?",
            "title_similarity": "0.7004031",
            "sentiment_compound": 0.6246
        },
        {
            "id": "h0wwann",
            "score": 1,
            "text": "Conventional antidepressants aren’t effective at all, and this is commonly understood outside of propaganda to drive sales.",
            "title_similarity": "0.4993006",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h0wwv9c",
            "score": 1,
            "text": "As exciting at this is, I'm very nervous about trying any kind of therapies involving hallucinogenic, no matter how mild. I tried medicinal cannabis concentrate and friend accidentally dosed me way too much—caused me really bad hallucination, panic attacks, looping, and pretty much gave me acute PTSD of the experience for about a year.\n\nGranted, this is entirely under a controlled environment by a skilled professional, but I'm afraid my past experiences will put me in a bad line of thought and influence the experience in a very negative way.",
            "title_similarity": "0.4621699",
            "sentiment_compound": -0.926
        },
        {
            "id": "h0wy3yx",
            "score": 1,
            "text": "A six-week trial is nowhere near enough to have the full effect of a new Escitalopram therapy. It takes two to four weeks for the heavy first-onset side effects to cease, and it takes at least six to eight weeks for Escitalopram start to have actual antidepressive effects. (Some effects in a study can be seen earlier since people start getting more active and the questionnaire measures activity as one of the factors of depression). So comparing these two over a six-week period is bound to be inaccurate. \n\nI'm not saying psylocibin doesn't have an antidepressant effect, there are several indicators it does, but this study doesn't prove anything and it's design is questionable from a pharmaceutical point of view.",
            "title_similarity": "0.5428275",
            "sentiment_compound": -0.486
        },
        {
            "id": "h0x3o3o",
            "score": 1,
            "text": "I disagree and correct me if I’m wrong. Psilocybin can be stopped as needed and is not habit forming? On the other hand antidepressants like Venlafaxine require a long period of reduced amounts to avoid very harmful side effects or death and in theory creates habit. \n\nIt’s unfair to psilocybin to be compared to antidepressants",
            "title_similarity": "0.6804211",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h0x3oiu",
            "score": 1,
            "text": "I’m all for psilocybin research, but this really seems like it was meant to be biased towards psilocybin. They could’ve done a much better test to provide more accurate data.",
            "title_similarity": "0.5829973",
            "sentiment_compound": 0.7066
        },
        {
            "id": "h0x4k5l",
            "score": 1,
            "text": "Legalize it then, what are we waiting for? Too many positive news about psychedelics so far. Legalize it then the world will improve immensely.",
            "title_similarity": "0.5827211",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h0x5042",
            "score": 1,
            "text": "A cool company to check out that’s working on this stuff is MindMend!",
            "title_similarity": "0.5337052",
            "sentiment_compound": 0.3802
        },
        {
            "id": "h0x59at",
            "score": 1,
            "text": "I’ve been microdosing here and there for a few weeks and even in that short time I feel so much better",
            "title_similarity": "0.45586264",
            "sentiment_compound": 0.4902
        },
        {
            "id": "h0x5ev2",
            "score": 3,
            "text": "We need to move past this. It is abundantly clear that psilocybin provides massive therapeutic benefit. We get it. Time to get shrooms in mouths.",
            "title_similarity": "0.6197519",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h0x7x8s",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.21985696"
        },
        {
            "id": "h0x8gog",
            "score": 1,
            "text": "I can tell you Micro dosing mushrooms increases deep sleep as per my Oura ring data",
            "title_similarity": "0.36056483",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0x8p6j",
            "score": 1,
            "text": "My dream is to have this medicine afforded to me in a therapeutic setting. \n\nI believe it’s likely the only thing that will work for me.",
            "title_similarity": "0.6109397",
            "sentiment_compound": 0.25
        },
        {
            "id": "h0x9bgy",
            "score": 1,
            "text": "While this is an exciting prospect I would be cautious using this study as a solid argument for the use of psilocybin in treating Major Depressive Disorder. The sample size was tiny, the duration of the study was too short, and the study itself was funded by an institute of psychedelics.\n\nIt is definitely something worth exploring on a bigger scale, but let's not get ahead of ourselves just yet.",
            "title_similarity": "0.68268496",
            "sentiment_compound": 0.1064
        },
        {
            "id": "h0x9s8t",
            "score": 3,
            "text": "I don't even like tripping very hard or often but whenever I take shrooms I feel so much more relaxed and happy with life when the effects wear off. The trip itself mostly is just an overwhelming feeling for me where I feel sort of anxious but as it wears off I become more and more comfortable, more than before I took them. It's really like exercise for your brain and emotions.",
            "title_similarity": "0.564237",
            "sentiment_compound": 0.961
        },
        {
            "id": "h0xalr7",
            "score": 1,
            "text": "In recent years, taking psilocybin has often given me anxiety, an effect I didn’t feel from it for the first decade plus of use. I’m curious to know what kind of guidance is given in these treatment sessions. I’d definitely love to get off the lexapro!",
            "title_similarity": "0.531296",
            "sentiment_compound": 0.8313
        },
        {
            "id": "h0xb2cf",
            "score": 1,
            "text": "I was attacked when I was in sophomore in college. He ran me off the road. He was at my door before I realized what had happened. It was surreal. I tried to get out the passenger door but he broke my window and pulled me out. He was trying to drag me to his van. I saw his side door open. I remember thinking if he gets me in his truck I'm dead. I screamed as loud as I could, not words just primal screaming and kept screaming and fighting. It was winter and I was in a heavy winter coat and boots. He was a foot taller then me and big. He tried to pick me up but I was struggling. Kicking, throwing my arms at him and screaming. Ever try picking up a toddler throwing a tantrum. That was me. A car came up the road and outside lights came on at a house. He dropped me and ran. They caught him, there was court, I was back at college. PTSD became my new normal. I credit psilocybin with helping with my PTSD. Unintentionally, not knowing it's potential I used it for tripping. This was during the LSD, flower power, hippie days of getting high. I was escaping demons remember. Didn't like drinking and hangovers. But smoking and tripping were great. My demons went away. I healed.",
            "title_similarity": "0.070187524",
            "sentiment_compound": -0.9805
        },
        {
            "id": "h0xbozr",
            "score": 1,
            "text": "They say 25 mg of Psilocybin. How many milligrams are in 3 g of mushrooms for example? (About an eighth)",
            "title_similarity": "0.38527897",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0xc01y",
            "score": 1,
            "text": "really? you dont say, who'd have thought something people were taking  for millennia would have actual benefits for humans to take,. shocker. :D",
            "title_similarity": "0.46481934",
            "sentiment_compound": 0.7213
        },
        {
            "id": "h0xcq68",
            "score": 1,
            "text": "Not mushrooms, but if anyone is in a state with legal medical cannabis, try the strain \"Golden Goat\" for depression. I micro dose very small amounts and it has been extremely helpful. Allows me to function well, does not give me munchies or \"stoned\" feeling, just more productive and I get the impression that this is what life may be like for people not dealing with ADD and clinical depression. Not all strains of cannabis are alike; many make me feel paranoid, but this one does not at all. Keep trying, if you tried one before and didn't like the results, it could be that particular type didn't work for you. People looking to get messed up for recreational purposes is different from people looking for pain relief, trouble sleeping, nausea, or depression. Each strain is unique and it may take some work to find one appropriate for you.",
            "title_similarity": "0.6602117",
            "sentiment_compound": -0.928
        },
        {
            "id": "h0xcspa",
            "score": 1,
            "text": "The researchers recruited 59 men and women between the ages of 18 and 80 years who suffered from moderate-to-severe depression for their 6-week trial. Thirty patients were randomly assigned to the psilocybin group, while the remaining 29 patients were assigned to the escitalopram group.",
            "title_similarity": "0.30149707",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h0xdxc2",
            "score": 1,
            "text": "So much better actually.",
            "title_similarity": "0.5489805",
            "sentiment_compound": 0.4902
        },
        {
            "id": "h0xex1c",
            "score": 1,
            "text": "just. stop.  voting up so many republicans everywhere.  stop.",
            "title_similarity": "0.17607184",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h0xex2t",
            "score": 1,
            "text": "And without any of the *horrible* side effects",
            "title_similarity": "0.5916065",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h0xf6n1",
            "score": 1,
            "text": "I felt more cognizant of my anxiety disorders and the causes of my depression but in no way did it solve it completely. I will say it helped to a certain degree though.",
            "title_similarity": "0.62308145",
            "sentiment_compound": -0.1655
        },
        {
            "id": "h0xicg8",
            "score": 2,
            "text": "Been on psilocybin for around five months and the positive affect it's had on my mood, temper, and anxiety is amazing. I'm happier overall, and when thing happen that leach my happiness, I'm much better at taking them in stride and working to resolve without wanting to rip someone's head off or drink a fifth.",
            "title_similarity": "0.58917916",
            "sentiment_compound": 0.9468
        },
        {
            "id": "h0xj1fh",
            "score": 1,
            "text": "Psychedelic drugs as effective treatment solution have been suppressed under the war on drugs.",
            "title_similarity": "0.55714285",
            "sentiment_compound": 0.128
        },
        {
            "id": "h0xjicv",
            "score": 1,
            "text": "My boss (Professor David Nutt) recently interviewed the study lead of this research (Dr Robin Carhart Harris) on his podcast -> [https://www.drugscience.org.uk/podcast/34-psilocybin-vs-antidepressants/](https://www.drugscience.org.uk/podcast/34-psilocybin-vs-antidepressants/) \n\nFor any of you who are genuinely interested in this clinic trial but don't want to read the paper as it is behind a paywall, I thoroughly recommend listening to this podcast.",
            "title_similarity": "0.4355572",
            "sentiment_compound": 0.6377
        },
        {
            "id": "h0xjn7j",
            "score": 1,
            "text": "Psychedelics are what stopped me from offing myself 2 years ago. I don’t do them frequently (I cant find them anymore) and i take psychiatric meds as well, but it was a complete hard reset when i needed one.",
            "title_similarity": "0.45412117",
            "sentiment_compound": -0.128
        },
        {
            "id": "h0xlz95",
            "score": 1,
            "text": "why would drug companies want the public to access antidepressants that grow naturally and help the patients weeks/months/years after a single dosage?",
            "title_similarity": "0.52464545",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h0xmdyo",
            "score": 1,
            "text": "Hell back in the 80 s. I took 70 hits of purple micro dot. At one time And didn’t die or suffer any brain damage and one hit was frying people  in fact it dropped my depression  and to this day I still suffer no ill effects from it but I must admit I liked mushrooms better",
            "title_similarity": "0.5130439",
            "sentiment_compound": -0.1984
        },
        {
            "id": "h0xoqpr",
            "score": 1,
            "text": "When a patent on this exists, only then will the therapy advance into existence.",
            "title_similarity": "0.5318287",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0xq0bo",
            "score": 2,
            "text": "I am not sure whether is a kosher thing to post here, but if you're a supporter of using psilocybin or LSD-25 for medicine, an Exchange Traded Fund has just appeared on the stock exchange under the ticker \"PSY\".\n\nI have nothing to do with the ETF, but just sharing.",
            "title_similarity": "0.4555996",
            "sentiment_compound": 0.7067
        },
        {
            "id": "h0xq8i0",
            "score": 1,
            "text": "I could’ve told them that.",
            "title_similarity": "0.38707983",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0xvc0h",
            "score": 2,
            "text": "Just want to throw a cautionary word out there.\n\nYou must respect psychedelics. If you are gravitating towards them or feel that you’d be a beneficiary, it’s likely that you have the type of pre existing mental illness or disposition whereby psilocybin can worsen or trigger severe mental illness. Do your research, start low and once you get in to trip territory, make sure you are (1) in a relatively good headspace and environment (2) have a trip sitter and (3) have a ‘trip killer’ on hand e.g a benzo, zopiclone, Trazodone.\n\nI had a beautiful experience years ago, one that 100% rid me all of my issues for a few days, it was the best I’ve ever felt, life for those few days was just perfection. I tried to replicate it at the start of this year and had a bad trip. The trip had zero therapeutic value or insight in the end and it was hugely traumatic. I’m now undergoing assessment for a disassociation disorder, bipolar and elements of ptsd. I never had these sort of issues before that experience and they haven’t improved with time, they’ve worsened. I hugely regret it and I’d urge anyone wanting to try it to follow harm reduction practice to the letter.",
            "title_similarity": "0.62567294",
            "sentiment_compound": 0.0294
        },
        {
            "id": "h0xz6ci",
            "score": 1,
            "text": "It's sad how much government is quickly to play with our livelihood and well being without any consideration of the repercussions we all faced by the pathetic war on drugs. \n\nSo much healing has been done by psychedelics, and so many lives have been saved. Anyone who disagrees just doesn't want to look at cold hard facts and is easily manipulated.",
            "title_similarity": "0.42740995",
            "sentiment_compound": -0.7732
        },
        {
            "id": "h0y35k0",
            "score": 1,
            "text": "From the studies I have seen it is vastly more effective with therapy.",
            "title_similarity": "0.6082689",
            "sentiment_compound": 0.5256
        },
        {
            "id": "h0y6cd7",
            "score": 1,
            "text": "OK so I have a question or maybe concern: I’m afraid to trip because of PTSD reasons. I’m afraid of what could come up. There is a clinic about 20 miles away that does microdosing and I have been interested in this for a couple of years but I am hesitant for the above stated reason. Is there literally no chance that I will trip if I am only microdosing??   I used to love to trip about 25 years ago. I probably did it a few too many times. I do not think that I could handle it now. I understand that people say that tripping can help with PTSD but I am way too afraid to go there. Set and setting are always extremely important and I cannot see there ever being a set or setting appropriate for a trip in my life again.   If anyone has any experience with microdosing and PTSD and wouldn’t mind answering my question, that would be great! Thanks.",
            "title_similarity": "0.34974214",
            "sentiment_compound": 0.9731
        },
        {
            "id": "h0y6jqc",
            "score": 1,
            "text": "Psilocybin has a lower toxicity then even marijuana. Meaning its very very close to harmless. No bad side effects have been seen by frequent users except for \"bad trips\" that depend on the person, setting and mindset.\n\nHonestly i support medical and recreational use for psilocybin shrooms but idk how long itll take the US to do that...",
            "title_similarity": "0.7653845",
            "sentiment_compound": 0.2398
        },
        {
            "id": "h0y8fro",
            "score": 1,
            "text": "Hmm not really anything new here. Read about this nearly a decade ago. But great for general awareness! Now if only I could convince my boomer relatives to try it, which is just... ironic on multiple levels.",
            "title_similarity": "0.4413048",
            "sentiment_compound": 0.8268
        },
        {
            "id": "h0yb0ic",
            "score": 1,
            "text": "People are still doing studies with no control group?",
            "title_similarity": "0.2667528",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0ybyfy",
            "score": 1,
            "text": "A few things to consider:\n1) The statistical power of the study is really low. And it’s one study. \n2) The dose used is minuscule compared to what many proponents or users of shrooms use when tripping out (25mg vs 2-3G)\n3) There are serious consequences and potential harms to psychedelics. \n\nI truly believe in the therapeutic and spiritual power of these herbal goddesses. But before we jump to conclusions and commodify these plants to fix all our spiritual problems, we need a ton more research. This is simply one study.",
            "title_similarity": "0.6073968",
            "sentiment_compound": -0.6753
        },
        {
            "id": "h0yck6x",
            "score": 1,
            "text": "this subject  appears every week...",
            "title_similarity": "0.12454356",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0ye8p5",
            "score": 1,
            "text": "Not bad, considering that \"leading conventional antidepressants\" haven't actually been proven to treat depression at all.",
            "title_similarity": "0.6137303",
            "sentiment_compound": 0.2144
        },
        {
            "id": "h0yeohf",
            "score": 1,
            "text": "Without double blind studies, placebo effect is likely the biggest contribution to this effect. \n\nYou can get similar results with sugar pills.",
            "title_similarity": "0.76353085",
            "sentiment_compound": 0.3089
        },
        {
            "id": "h0yfmsa",
            "score": 1,
            "text": "Bought my shares of MNMD today!",
            "title_similarity": "0.21305752",
            "sentiment_compound": 0.3595
        },
        {
            "id": "h0yfndh",
            "score": 1,
            "text": "We need research! I want meds without trips.",
            "title_similarity": "0.38036972",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h0ylfqy",
            "score": 1,
            "text": "How do you get in on this, I'd love to be happy again, and get off the meds I take that don't seem to do much but make you exist",
            "title_similarity": "0.6208923",
            "sentiment_compound": 0.6059
        },
        {
            "id": "h0ysk4e",
            "score": 1,
            "text": "Unless they could somehow be removed, hallucinations would be considered a pretty major side effect that not everyone would want to deal with.",
            "title_similarity": "0.5612561",
            "sentiment_compound": 0.4548
        },
        {
            "id": "h0z5l0b",
            "score": 2,
            "text": "I really needed antidepressants when I started taking them but the time before they started working was hell and they were so hard on my body. I still feel like need them but I can’t keep switching meds hoping I don’t get all the bad side effects.",
            "title_similarity": "0.4636662",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h0zfq3c",
            "score": 2,
            "text": "The data actually shows it does a quite a bit better, they just have to be careful about the claims they are making early on without many other studies out, otherwise the media and big pharma could get upset and try to put a damper on research.",
            "title_similarity": "0.5696902",
            "sentiment_compound": 0.2878
        },
        {
            "id": "h0zguts",
            "score": 2,
            "text": "pagan shamans would guide people through trips as guided meditation . we already had this stuff figured out before we were civilized to forget",
            "title_similarity": "0.28270942",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h10kq1r",
            "score": 1,
            "text": "Two doses of 25mg in 6 weeks?\nWhy don't they just do a micro dosing study side by side with ssris.  \n\n1 gram of mushrooms has 5-25mg of psilocybin. So let's say they took 2g of mushrooms (they used capsules) but for those of us that don't have capsules. 2g is great and you'll have a good time perhaps learn something but it's not enough to help depression.\n\nMicro dosing would be more consistent. Or perhaps have them do two heroic doses. Which again wouldn't be that consistent but may help more.",
            "title_similarity": "0.5610925",
            "sentiment_compound": 0.9003
        },
        {
            "id": "h10ze3j",
            "score": 2,
            "text": "So magic mushrooms make you happy?\n\nGlad to see all the personal research I did in college back in the '80s finally paid off.",
            "title_similarity": "0.4794483",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h1aqkyl",
            "score": 1,
            "text": "So not effective at all, great",
            "title_similarity": "0.3165055",
            "sentiment_compound": 0.3111
        },
        {
            "id": "h1aqlc7",
            "score": 1,
            "text": "So not effective at all, great",
            "title_similarity": "0.3165055",
            "sentiment_compound": 0.3111
        },
        {
            "id": "h1gdvx2",
            "score": 1,
            "text": "I would imagine also that the LSD used in any of these trials would be of pharmacy quality, whereas the “street” stuff could vary quite a bit. \nSomeone also mentioned having a benzo Incase they want to hit the ejection button…this is true! \nAlso I think anecdotally the various strains of mushrooms make a big difference at least for me and likely contain various other compounds yet to be isolated aside from just psilocybin/psilosin that have a synergistic effect. \nThese trials use synthetic psilocybin.\nIt’s also incredibly difficult to conduct a double blind RCT with psychedelics because let’s be honest you’ll know if you got the active compound vs the placebo!",
            "title_similarity": "0.60683393",
            "sentiment_compound": 0.1756
        },
        {
            "id": "h2nprjn",
            "score": 2,
            "text": "15 days late but I think this is still relevant. To me it seems like they were just shy of the “sweet spot” dosage, which seems to be 20mg of psilocybin for a 70kg person. From [this article](https://newatlas.com/johns-hopkins-psilocybin-study-finds-optimum-beneficial-dosage/18981/) on the Johns Hopkins study:\n> Perhaps unsurprisingly, researchers noted that the reported positive effects increased as higher doses were given, but also that there was a sharp increase in the negative aspects at the very highest dose. At the highest dose (30 mg/70 kg, p.o. - meaning \"per oral\" or by mouth), 78 percent of the volunteers were reporting one of the top five most spiritually significant happenings of their lives but those suffering anxiety, stress and fear episodes increased by six times, so that around a third of those participating in the study showed signs of psychological struggle.\n> By contrast, only one of the volunteers receiving the second highest dose (20mg/70 kg, p.o.) reported having negative issues, and all benefited from positive experiences, although with less intensity than at the highest dose.",
            "title_similarity": "0.599025",
            "sentiment_compound": -0.6841
        },
        {
            "id": "h4zydpm",
            "score": 2,
            "text": "It's better. Antidepressants don't have very high success rates.",
            "title_similarity": "0.8048029",
            "sentiment_compound": 0.7832
        }
    ]
}