{
    "The presence of strong labor unions substantially reduces poverty for both unionized households and non-unionized households.\n": [
        {
            "id": "h0yxo4k",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.39816403",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h0zq8l1",
            "score": -9,
            "text": "I'm just going to say I think people should always be wary of scientific research done to support political opinions.",
            "title_similarity": "0.2256223",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0zsw47",
            "score": 1,
            "text": "There are pros and cons to union jobs and non-union jobs. A realistic take IMO is that...\n\n- unions establish a strong floor for all members\n- unions incentivize raises through collective bargaining instead of skill improvement\n- unions wages also often raise surrounding non-union wages\n- unions drastically increase the cost of public works like subways and roadways (US cost/mile of subway is highest in the world by a lot) simply because of additional red tape and silly rules\n- unions protect vulnerable workforces in isolated locations where someone can't just leave for another company\n- unions protect really bad eggs - bad cops and bad teachers can destroy peoples lives\n- unions establish a power balance in industries where labor is under-powered and capital is overpowered, regardless of location\n- unions slow down progress in areas like global trade, education by spending money on lobbying to maintain the status quo instead of skill improvement for members; Similarly, unions insulate members from a lot of economic realities like global competition and outsourcing, which will leave them ok for now but worse off long term\n\nIMO unions have had their day and it's time to replace them with national benefits like UBI and healthcare. At that point everyone has a floor underneath them and some wiggle room to improve their situation without being beholden to another entity.",
            "title_similarity": "0.68621683",
            "sentiment_compound": 0.8787
        },
        {
            "id": "h0zs2e2",
            "score": 11,
            "text": "I would’ve joined a union as a young man had I not worked non-union, side by side with union hands. I saw firsthand how unions will protect inept workers who have been there longer than good workers who just happened to be younger. I appreciate what unions do for us “rats”, but it’s not the path for me.",
            "title_similarity": "0.616969",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h0zj400",
            "score": -3,
            "text": "Where will soldiers come from then?",
            "title_similarity": "0.026644716",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zvjy7",
            "score": 0,
            "text": "No wonder conservatives are science deniers.",
            "title_similarity": "0.31691718",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h0zuw10",
            "score": 0,
            "text": "And then you get places like Australia where the current high wages and working conditions are thanks to strong unions. The same unions that, once everything was set, started to become greedy demanding more then they what was required, started doing irrelevant strikes and protests and disruptions to the point the government, politicians and media started using it against them and getting the greater population on board with the union hating. Now more and more people are ditching unions and wages and working conditions have started to reverse and get worse.",
            "title_similarity": "0.5183001",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h0zhc6r",
            "score": -30,
            "text": "I have been Union and non Union.  I definitely made way more being non Union and way better hours.    Seen good unions and some very corrupt ones.  To each their own.",
            "title_similarity": "0.6575623",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h0zk0sy",
            "score": -7,
            "text": "But how many Freedom Units(tm) do we lose??!!!",
            "title_similarity": "0.3293236",
            "sentiment_compound": 0.669
        },
        {
            "id": "h0ziqtw",
            "score": 0,
            "text": "I have seen this happen with my own eyes.",
            "title_similarity": "0.066388264",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zqb04",
            "score": 1,
            "text": "Except for when they drive the plant into the ground.",
            "title_similarity": "0.17092556",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zqxl7",
            "score": 14,
            "text": "Then Unions become just like the businesses. Greedy and corrupt. Look at UAW, Teamsters, etc.",
            "title_similarity": "0.48434076",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h0zhha9",
            "score": 16,
            "text": "if we based policy on science instead of profit we'd live in a better world",
            "title_similarity": "0.5770895",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h0znhoj",
            "score": -22,
            "text": "I mean this is cool and all but I hate that this sub treats statistics as science",
            "title_similarity": "0.42534956",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h10a799",
            "score": 1,
            "text": "How is this on /science? It should be on /politics.\nUnions are just market inefficiencies at their best, and hotspots for corruption at their worst.",
            "title_similarity": "0.5317714",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h0zgbt3",
            "score": -55,
            "text": "So r/science is just another left wing talking point subreddit now?\n\nEdit:  I guess so!",
            "title_similarity": "0.24881247",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0z8xog",
            "score": 8,
            "text": "wow, and that was worked out how many hundred of years ago ffs",
            "title_similarity": "0.13648151",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zzbfl",
            "score": 2,
            "text": "Unions should own 49.5% of all companies stock through ESOP with the other 49.5% owned by outside or inside directors, management and shareholders. The other 1% either a Trustee or government regulatory agency. Any company over $100 million gross revenue that has public stocks should operate like this or be delisted and become private entities. This would secure workers from looting of pension funds by hedge funds and VCs. It would bring back pride and ownership in having a job plus a healthy secure middle class.",
            "title_similarity": "0.6531169",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h0zvfpl",
            "score": 4,
            "text": "Teachers unions do suck though",
            "title_similarity": "0.4397893",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h0z7tyl",
            "score": 51,
            "text": "Won’t somebody think about the shareholders!",
            "title_similarity": "0.20711797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zuv8t",
            "score": -6,
            "text": "My personal experience with the United Steel Workers Union Local 711 was the exact opposite. The USW was extorting money from Frias Corp. in the form of political contributions to their favorite politicians in exchange for concessions in the collective bargaining agreement. It got so bad that more than half the employees went on a wild cat strike to try to force the USW out and we all got fired without compensation for our troubles. \n\nWith the loss of their most experienced employees going to the competition, the entire business went under in less than 5 years resulting in the loss of over 2000 jobs (they are all better off now).\n\nNot sure about other unions but the USW is the most corrupt union in the state of Nevada.",
            "title_similarity": "0.46004716",
            "sentiment_compound": -0.4813
        },
        {
            "id": "h0ztkeg",
            "score": -7,
            "text": "According to a study funded by labor unions.",
            "title_similarity": "0.43264353",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zuzfz",
            "score": 2,
            "text": "The rule of thumb is that unions should be encouraged in the private sector and discouraged in the public sector",
            "title_similarity": "0.46294907",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0zk0gb",
            "score": 60,
            "text": "Now do teacher's unions and student outcomes",
            "title_similarity": "0.3236137",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zvzdp",
            "score": -4,
            "text": "Welcome to the wonderful world of unions! \n\n*March 1, 2021, US Department of Justice*\n\n*Historically, organized criminal groups such as La Cosa Nostra or the Mafia gained substantial corrupt influence, and even control, over labor unions by creating a climate of fear and intimidation among employers and union members by threats and acts of violence.  Working the United States Attorney’s Offices, the Labor-Management Racketeering Unit in OCGS has assisted criminal prosecution and civil RICO lawsuits to eliminate such corrupt influence and control of labor unions and their affiliated organizations.  As of 2020, the United States had obtained relief in 24 civil RICO cases involving labor organizations affiliated with the International Brotherhood of Teamsters (IBT), the Laborers International Union of North American (LIUNA), the former Hotel Employees and Restaurant Employees International Union (HEREIU), and the International Longshoreman's Association (ILA).*\n\n*During the period from 2017 to 2021, the Labor-Management Racketeering Unit worked with the United States Attorney’s Office in Detroit to charge and obtain guilty pleas from the Fiat-Chrysler Association (FCA), officials of the FCA, and the United Auto Workers (UAW) union involving more than $3.5 million in illegal payments and gifts from the FCA to officials of the UAW.  As a result of those and other guilty pleas involving abuse of union funds, the UAW agreed to be subject to court-approved officers as part of an anti-fraud consent decree directed at the removal of corruption within the UAW.* [SOURCE](https://www.justice.gov/criminal-ocgs/infiltrated-labor-unions)\n\n**Press Release:**\n[FCA US LLC PLEADS GUILTY TO MAKING ILLEGAL PAYMENTS TO UAW OFFICIALS: The American Subsidiary of Stellantis Agrees to Pay a $30 Million Fine and be Subject to Federal Oversight](https://www.justice.gov/usao-edmi/pr/fca-us-llc-pleads-guilty-making-illegal-payments-uaw-officials)",
            "title_similarity": "0.52727485",
            "sentiment_compound": -0.9162
        },
        {
            "id": "h0zpkzn",
            "score": 22,
            "text": "Economic growth through the distribution of wealth leading to higher standards of living. Its been tried before and proven to work, it created the middle class. Not sure why republicans argue against the one thing that created their wealth in the first place.",
            "title_similarity": "0.67357546",
            "sentiment_compound": 0.8243
        },
        {
            "id": "h0zo0fq",
            "score": -12,
            "text": "This study subsidized by your local labor union.",
            "title_similarity": "0.52151823",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zn0ds",
            "score": -2,
            "text": "The free rider problem has been well known since the Dawn of unions...how is this news??",
            "title_similarity": "0.4790695",
            "sentiment_compound": 0.4696
        },
        {
            "id": "h0zobvf",
            "score": -7,
            "text": "Tell that to the Argentinians",
            "title_similarity": "0.10772144",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zvipq",
            "score": -8,
            "text": "As much as I love the positive effect of unions in the article, my personal experience with unions and the people in them are mostly negative. Union workers that I worked around tended to be more lazy, whiney, and bad workers were hard to fire.",
            "title_similarity": "0.6573947",
            "sentiment_compound": -0.763
        },
        {
            "id": "h0zrgto",
            "score": 3,
            "text": "This has been true for decades.  The mob never should've killed Jimmy Hoffa, when he died the labor movement died with him.",
            "title_similarity": "0.44644123",
            "sentiment_compound": -0.2047
        },
        {
            "id": "h10fbgh",
            "score": 4,
            "text": "Gee, its almost like someone with a cool beard wrote a book about this a long time ago...",
            "title_similarity": "0.24564576",
            "sentiment_compound": 0.5434
        },
        {
            "id": "h102pjn",
            "score": 2,
            "text": "This is so obvious its embarrassing to even have to read it. Why did Bezos fight so hard to keep unions out. So he could get richer. Direct relationship between  wages unions and inequality. Regan and Thatcher hoodwinked us with their lying trickle down economy. It was always trickle (read gushed) up. This was the lie that let's Americans and plenty of other places go a whole generation and more with zero to minimum wage rise. Do you think 6 year olds wouldn't be down the coal mines still without reforms by the early unions. Workers absolutely own the right to unionize. That's why lawmakers have made it so hard.",
            "title_similarity": "0.57651395",
            "sentiment_compound": -0.8018
        },
        {
            "id": "h10q5pw",
            "score": 1,
            "text": "Reconcile this with police unions who routinely obstruct, cover up and defend police brutality. Not all unions are good. \n\n#POLICE UNIONS SHOULD BE BANNED",
            "title_similarity": "0.37997258",
            "sentiment_compound": -0.7034
        },
        {
            "id": "h0zg5fx",
            "score": -43,
            "text": "The presence of strong unions also substantially increases the income of organized crime members and union fat cats.",
            "title_similarity": "0.6550144",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0zt5ka",
            "score": 20,
            "text": "People need to realize that unionizing, both the effects of labor unions and unions themselves, extend far beyond the workers. They are community tools",
            "title_similarity": "0.49953172",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h10dmre",
            "score": 0,
            "text": "Since bosses are the ones that usually don't want unions, one would say that they couldn't possibly want the same thing as their employees",
            "title_similarity": "0.55699795",
            "sentiment_compound": -0.1139
        },
        {
            "id": "h0zpln0",
            "score": -22,
            "text": "Unions are outdated and no longer needed. They tend to be political and not representative to all their members by doing so.",
            "title_similarity": "0.4755385",
            "sentiment_compound": -0.296
        },
        {
            "id": "h0zwbh3",
            "score": 4,
            "text": "But the rich and powerful don’t want you to know this.  In fact, they’ve campaigned hard to make you believe just the opposite.",
            "title_similarity": "0.3826368",
            "sentiment_compound": 0.8573
        },
        {
            "id": "h0z878s",
            "score": -40,
            "text": "[deleted]",
            "title_similarity": "0.00902459"
        },
        {
            "id": "h0zn7h7",
            "score": 1,
            "text": "Just go to the /rontario sub right now.  Someone just posted what the govt is doing to nurses- DURING A GLOBAL PANDEMIC!",
            "title_similarity": "0.2336897",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zwuh2",
            "score": 2,
            "text": "See \"The State Against Blacks\" by Walter E. Williams, which discusses how labor unions were a major factor that prevented blacks and others from achieving success.",
            "title_similarity": "0.44937286",
            "sentiment_compound": 0.6204
        },
        {
            "id": "h100hjx",
            "score": 2,
            "text": "Almost like having collective bargaining power to enforce worker’s rights is beneficial to all workers",
            "title_similarity": "0.71188664",
            "sentiment_compound": 0.6258
        },
        {
            "id": "h0yzirn",
            "score": 5,
            "text": "Would have been nice if there was a paywall notification",
            "title_similarity": "0.46932244",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h0zro98",
            "score": 23,
            "text": "People complain about wages stagnating over the past 30 or so years, but union membership has also stagnated so this study verifies what many corporate leaders already knew, and subsequently why unions have been stamped out.",
            "title_similarity": "0.576565",
            "sentiment_compound": -0.1901
        },
        {
            "id": "h0zavvf",
            "score": 172,
            "text": "Which is why governments don't like them and keep violating collective agreements.",
            "title_similarity": "0.39900655",
            "sentiment_compound": -0.5439
        },
        {
            "id": "h0zp4ma",
            "score": 86,
            "text": "I have no trouble believing this at all.\n\nMy dad was a butcher in the 1970s at the supermarket that rhymes with “gruger’s”. At this Union job, he raised a wife and three kids. We weren’t rich but we had a stable life.\n\nRecently, I asked the butcher at the same supermarket about this. Nowadays, The job is so poorly paid that only college kids will do it.\n\nThere’s nothing good about Reaganomics.",
            "title_similarity": "0.502547",
            "sentiment_compound": 0.3859
        },
        {
            "id": "h0zv5hm",
            "score": 1,
            "text": "Next you'll tell me vaccines don't have trackers in them and they're \"safe\". Uh huh, we're onto you now you rotten scientists. Next time you try to get all empirical evidency for something, I advise you to ask yourself the most important question WWJD? If Republicans have taught us anything, JC wouldn't pay a living wage or believe everyone deserves equality.",
            "title_similarity": "0.40145764",
            "sentiment_compound": 0.2474
        },
        {
            "id": "h101ri2",
            "score": 1,
            "text": "I think yall confusing the word study with science",
            "title_similarity": "0.21566062",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h103w8o",
            "score": 1,
            "text": "Oh cool.. now do the unseen workers who don't get hired because of the unions and inflexible labor laws. Ffs.",
            "title_similarity": "0.602707",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h107ita",
            "score": 1,
            "text": "science sub is legit?! ok! bring the pro-union posts some more and maybe i'll join! <3",
            "title_similarity": "0.38596177",
            "sentiment_compound": 0.7163
        },
        {
            "id": "h108wbf",
            "score": 1,
            "text": "I have yet to be see a union that benefits all workers and not just some of its own members. The unions in the US might work differently but in Europe I don’t see unions serving anyone else other than themselves.",
            "title_similarity": "0.48518252",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h109pzv",
            "score": 1,
            "text": "However if there are **too strong** Labour and union laws in a country, it turns investors and companies away. \n\nNobody wants strikes becoming an everyday phenomenon and having their business held hostage.",
            "title_similarity": "0.5146545",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h11876u",
            "score": 1,
            "text": "Obviously. But does it provide a superior product? I think we all know the answer to that. Unions are great for the people who benefit from them, but public sector unions cost a lot and do little with that money.   \n\n\nMore garbage propaganda from r/science",
            "title_similarity": "0.794392",
            "sentiment_compound": 0.9258
        },
        {
            "id": "h118ot8",
            "score": -1,
            "text": "The downside is that CEO will be able to just afford 5 new Ferraris a year instead of 10.",
            "title_similarity": "0.5072567",
            "sentiment_compound": -0.25
        },
        {
            "id": "h11bldz",
            "score": 1,
            "text": "What about when the mob owns it?",
            "title_similarity": "0.19899866",
            "sentiment_compound": 0.0
        },
        {
            "id": "h11gtxc",
            "score": -1,
            "text": "I feel like this is one of those correlation doesn’t equal causation things.",
            "title_similarity": "0.23742935",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h0zu7bb",
            "score": 11,
            "text": "I didn't even understand how they were gathering their numbers and how they were using it. That was a hard read.   \n  \nCan anyone explain how they conducted this study?",
            "title_similarity": "0.22795482",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h10da64",
            "score": 3,
            "text": "The post war economic boom was the fruit of years of socialist struggle.",
            "title_similarity": "0.59877765",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h0zrumh",
            "score": 38,
            "text": "And so we have another report on \\*why\\* they work so hard to kill unionization efforts (and therefore increase poverty).\n\nIt's straight math.  ...You increase poverty, you get more control over labor costs -- and more control in a \"disciplinary effect\" over those unruly workers.  Ya gotta show 'em who's boss, you know.",
            "title_similarity": "0.5556549",
            "sentiment_compound": -0.8372
        },
        {
            "id": "h0zed73",
            "score": -59,
            "text": "When you can't negotiate your own conditions and need a mob to do it for you..",
            "title_similarity": "0.3325562",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zxst0",
            "score": 2,
            "text": "In line with this, I heard on national radio that a group of Danish and British scientists found a strong correlation between the Thatcher/Reagan times where their policies took the power away from the unions, and the start of the obesity issues that started impacting those countries, more so than other similarly wealthy developed countries.",
            "title_similarity": "0.5363815",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h101oh5",
            "score": 2,
            "text": "Next should be a movement to unionize the fast food industry. Clearly they can afford to pay their employees better wages considering mostly all of them are billion dollar franchise's.",
            "title_similarity": "0.705294",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h102el7",
            "score": -2,
            "text": "2 of my locals were filled with women. They drove down wages and value of work.",
            "title_similarity": "0.47271544",
            "sentiment_compound": 0.34
        },
        {
            "id": "h10ad54",
            "score": 3,
            "text": "Is this just correlation or causality?\n\nAren’t we supposed to have more unionized workers in large companies which have more capacities to pay better their employees (and also a lot more ability to try to stop employees from having raises)?",
            "title_similarity": "0.6928477",
            "sentiment_compound": 0.4569
        },
        {
            "id": "h10gfbt",
            "score": 1,
            "text": "I agree that unions are necessary to protect workers’ rights. I’m curious how unions are held in check to prevent them gouging small-time employers.",
            "title_similarity": "0.5629354",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h0zu543",
            "score": 14,
            "text": "God damn commies getting rid of our hard fought poverty!",
            "title_similarity": "0.6483376",
            "sentiment_compound": -0.784
        },
        {
            "id": "h0zw4xq",
            "score": 13,
            "text": "I think you need to study what effects Cosatu ( a powerful labour Union aligned to the AnC ) had on the South African economy between 1992 and 2000. Their actions decimated the clothing industry.",
            "title_similarity": "0.4311765",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h10a822",
            "score": -2,
            "text": "\"Wow, socialists have always, are, and will always be right. And here's even more proof.\"    \n-\"Yeah, I'm gonna ignore that and continue supporting capitalism.\"\n\nThere seems to be overwhelming scientific support for socialist policies whenever an assessment is being done and overwhelming ideological support for socialism amongst scientists who actually know what socialism is. \n\nEven in the US:   \n[Almost 80% of philosophy majors support socialism](https://collegepulse.com/blog/8-in-10-philosophy-majors-favor-socialism)    \n\nAnthropology and sociology students also heavily favour socialism. And that's in the US, one of the most rabidly anti-socialist countries on earth. Support for socialism in countries like China or Vietnam is obviously totally overwhelming.\n\nOnly people who are deeply involved in capitalist system justification and perpetuation, such as US economics students who are bombarded almost exclusively with orthodox theory, seem to heavily support capitalism.\n\nIs there research on why public support for socialism is so low and who is driving anti-socialist narratives? Is there research on how anti-socialist narratives can be fought and what educational approach is most effective at counteracting overreliance on orthodox ideas and encouraging people to educate themselves about heterodox theory?",
            "title_similarity": "0.55262446",
            "sentiment_compound": 0.9824
        },
        {
            "id": "h0zkqzt",
            "score": 23,
            "text": "[deleted]",
            "title_similarity": "0.00902459"
        },
        {
            "id": "h0zxmpk",
            "score": 0,
            "text": "Tell that to my dad who was a miner",
            "title_similarity": "0.32638896",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zzcm4",
            "score": -5,
            "text": "Y'all ever heard of the mafia?  See Italy",
            "title_similarity": "0.20236593",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10592c",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.00926264"
        },
        {
            "id": "h109d47",
            "score": 0,
            "text": "So being anti union is being pro poverty?",
            "title_similarity": "0.5408053",
            "sentiment_compound": -0.7076
        },
        {
            "id": "h109x2h",
            "score": 0,
            "text": "No. Unfortunately many think like this enough to restrict opinions.",
            "title_similarity": "0.29621407",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h10a56r",
            "score": 0,
            "text": "What a good scientifical bit of wordage! I will ponder this further.",
            "title_similarity": "0.31955972",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h10e5m5",
            "score": 0,
            "text": "The operative word here is “strong”. I worked for a “weak” union (UFCW Local 588) that basically screwed me over and left a bad taste in my mouth. Now I’m a vocal opponent.",
            "title_similarity": "0.42382592",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h10h68d",
            "score": 0,
            "text": "I cant believe its 2021. This title looks like 1820, pre Eugene Debs era.",
            "title_similarity": "0.093994275",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h10i6le",
            "score": 5,
            "text": "Come to Brazil and you'll see the difference between theory and reality. This is sheer politics disguised as science.",
            "title_similarity": "0.27363387",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h10ipl7",
            "score": 0,
            "text": "Unions are full of corruption",
            "title_similarity": "0.34899575",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10iwob",
            "score": 0,
            "text": "Wait I thought unions were bad? Like good in concept but bad in practice? Or atleast unions \"arent what they used to be\" and are seen as bad? Maybe I've just been drinking the coolaid and not even know it",
            "title_similarity": "0.47104862",
            "sentiment_compound": -0.8907
        },
        {
            "id": "h10kadq",
            "score": 0,
            "text": "Yeah, you should check out the awesome cities of Detroit and Pittsburgh!!\n\nChina thanks you....",
            "title_similarity": "0.4814525",
            "sentiment_compound": 0.8684
        },
        {
            "id": "h10lerk",
            "score": 0,
            "text": "Hummm... Let's check the argentinian case",
            "title_similarity": "0.11707276",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10s27y",
            "score": 0,
            "text": "A few comments:\n\nIn it's case for skepticism it points out unions may promote discriminatory practices and then doesn't control for race. Union employment skews white and so do the biases examined. \n\nControlling union household vs non-union household isn't entirely fair because job loss often results in loss of union status for low income workers. So the poverty rate delta isn't that surprising. \n\nThere needs to be a measure of union competency. I am willing to bet that you can get vastly different results if you compare individual unions to each other. \n\nTrade sectors have differing rates of unionization. Poverty rates should be specific within one's trade.",
            "title_similarity": "0.6764123",
            "sentiment_compound": -0.9322
        },
        {
            "id": "h10uctz",
            "score": 0,
            "text": "An alternative article:  \nThe presence of worker rights legislation substantially reduces poverty for everyone.",
            "title_similarity": "0.88456124",
            "sentiment_compound": -0.5542
        },
        {
            "id": "h114q1b",
            "score": 0,
            "text": "How does raising the wages of unionized labour effect the pricing for the customer?",
            "title_similarity": "0.5854617",
            "sentiment_compound": 0.0
        },
        {
            "id": "h116101",
            "score": 0,
            "text": "Unions currency-inflate households right \"out of poverty\".",
            "title_similarity": "0.65222186",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h11c62a",
            "score": 0,
            "text": "\"A day in the Life of Sue Republican.\n\nSue gets up at 6 a.m. and fills her coffeepot with water to prepare her morning coffee. The water is clean and good because some tree-hugging liberal fought for minimum water-quality standards.\n\nWith her first swallow of coffee, she takes her daily medication. Her medications are safe to take because some stupid commie liberal fought to insure their safety and that they work as advertised.\n\nAll but $10 of her medications are paid for by her employer's medical plan because some liberal union workers fought their employers for paid medical insurance - now Sue gets it too.\n\nShe prepares her morning breakfast, bacon and eggs. Sue's bacon is safe to eat because some girly-man liberal fought for laws to regulate the meat packing industry.\n\nIn the shower, Sue reaches for her shampoo. Her bottle is properly labeled with each ingredient and its amount in the total contents because some crybaby liberal fought for her right to know what she was putting on her body and how much it contained.\n\nSue dresses, walks outside and takes a deep breath. The air she breathes is clean because some environmentalist wacko liberal fought for laws to stop industries from polluting our air.\n\nShe walks to the subway station for her government-subsidized ride to work. It saves her considerable money in parking and transportation fees because some fancy-pants liberal fought for affordable public transportation, which gives everyone the opportunity to be a contributor.\n\nSue begins her work day. She has a good job with excellent pay, medical benefits, retirement, paid holidays and vacation because some lazy liberal union members fought and died for these working standards. Sue's employer pays these standards because Sue's employer doesn't want his employees to call the union.\n\nIf Sue is hurt on the job or becomes unemployed, she'll get a worker compensation or unemployment check because some stupid liberal didn't think she should lose her home because of her temporary misfortune.\n\nIt's noon and Sue needs to make a bank deposit so she can pay some bills. Sue's deposit is federally insured by the FSLIC because some godless liberal wanted to protect Sue's money from unscrupulous bankers who ruined the banking system before the Great Depression.\n\nSue has to pay her Fannie Mae-underwritten mortgage and her below-market federal student loan because some elitist liberal decided that Sue and the government would be better off if she was educated and earned more money over her lifetime.\n\nSue is home from work. She plans to visit her father this evening at his farm home in the country. She gets in her car for the drive. Her car is among the safest in the world because some America-hating liberal fought for car safety standards.\n\nShe arrives at her childhood home. Her generation was the third to live in the house financed by Farmers' Home Administration because bankers didn't want to make rural loans. The house didn't have electricity until some big-government liberal stuck his nose where it didn't belong and demanded rural electrification.\n\nShe is happy to see her father, who is now retired. Her father lives on Social Security and a union pension because some wine-drinking, cheese-eating liberal made sure he could take care of himself so Sue wouldn't have to.\n\nSue gets back in her car for the ride home, and turns on a radio talk show. The radio host keeps saying that liberals are bad and conservatives are good. He doesn't mention that Republicans have fought against every protection and benefit Sue enjoys throughout her day. Sue agrees: \"We don't need those big-government liberals ruining our lives! After all, I'm self-made and believe everyone should take care of themselves, just like I have.\"",
            "title_similarity": "0.48378268",
            "sentiment_compound": 0.9606
        },
        {
            "id": "h11lggl",
            "score": 0,
            "text": "Wished it were true, but it’s not. Too many conservative, racist, bigot, white supremest, confederate loving, nepotistic, backwards thinkings morons are union members that will vote against their better interests. Olathe, KS UNION SHEETMETAL worker AND disabled VETERAN with six kids and currently jailed for participating in attacking our nations capital while in session to certify a more sane elected leader. \nThese kinds of people are in many Union leadership roles because in the end, all they become are higher wage earners as non lawyer lobbyists. Lastly, every single raise by collective bargaining agreements get immediately swallowed up by grossly increasing healthcare premiums specifically designed as “cost of living adjustments”. Sad but true.",
            "title_similarity": "0.5372415",
            "sentiment_compound": -0.0
        },
        {
            "id": "h11nwzz",
            "score": 0,
            "text": "Workers rights should be enshrined in law and not dictated by organisations within organisations with their own personal agendas that exist separate from the will of the majority.",
            "title_similarity": "0.4103083",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zxdmm",
            "score": 5,
            "text": "Did anyone else try and read that? It was written by a computer I swear",
            "title_similarity": "0.07791892",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h0zmu20",
            "score": 50,
            "text": "shame that US citizens can't get used to this fact.  ALSO, SHARE HOW MUCH YOU MAKE.  \n\n\nIt gives you strong negotiation tool, and helps everyone around get raised, you included.",
            "title_similarity": "0.6239835",
            "sentiment_compound": 0.694
        },
        {
            "id": "h0zjx38",
            "score": 145,
            "text": "This is why groups like ALEC and the US Chamber of Commerce work so hard to cut the power of unions off. Decreasing the power of unions kneecaps them both economically and politically and that's \"good for business\".",
            "title_similarity": "0.6552104",
            "sentiment_compound": 0.2892
        },
        {
            "id": "h0zqenq",
            "score": 1,
            "text": "Thank you for sharing this!",
            "title_similarity": "0.3508553",
            "sentiment_compound": 0.68
        },
        {
            "id": "h0ztjx2",
            "score": 1,
            "text": "That’s great news. Does anyone know if there are significant differences in the prices that consumers will pay for products connected to strong labor unions vs nonexistent or weaker ones?",
            "title_similarity": "0.6949401",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h0zvgz9",
            "score": -1,
            "text": "Containing the rampant corruption is the hardest part of maintaining a union.",
            "title_similarity": "0.5140147",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zvwak",
            "score": 1,
            "text": "... subsequently increases average spending power, subsequently increasing profits of companies... All in all a good thing. Wonder why they are so frowned upon these days.",
            "title_similarity": "0.6859431",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h107k4j",
            "score": -1,
            "text": "Unions and pensions aren't coming back. Ever. Time to build that bridge and get over it.\n\nThe war between capital and labor is long over. Capital won.",
            "title_similarity": "0.40650946",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h10c45z",
            "score": 1,
            "text": "Let me rephrase it: «Presence of common sense benefits everybody».",
            "title_similarity": "0.54051536",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h10dmze",
            "score": 1,
            "text": "Does it reduce inflation too?",
            "title_similarity": "0.50869435",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10dohw",
            "score": 1,
            "text": "Why is this entire comment thread about politics? I’m in the IBEW and I’m conservative, it’s a matter of choice. If people want to join they’re welcome with open arms and if not, best of luck to them but I’d hope they know what they’re doing. I swear some of the comments here aren’t even pro union they’re just straight up syndicalist, and that’s a harrowing ideology to base your work force around.",
            "title_similarity": "0.49662268",
            "sentiment_compound": 0.6981
        },
        {
            "id": "h10jec9",
            "score": 1,
            "text": "try convincing ANYONE in Appalachia of this. \n\n\n\"unions are nothing but greedy, thieving communists that piggy back off of your hard work. besides, no one has to agree to your terms! you do as your employers say, and be thankful to have a damned job!\"",
            "title_similarity": "0.49644378",
            "sentiment_compound": 0.7489
        },
        {
            "id": "h10oxuk",
            "score": 1,
            "text": "I read through the paper, and I can’t understand how the authors derive a causal effect from the association. It doesn’t seem like they use instrumental variables. Can someone explain?",
            "title_similarity": "0.23690094",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h10pw57",
            "score": 1,
            "text": "Surely,let’s take a good long look at the police union and Bob Kroll in particular. A great example of how unions over step their boundaries and are generally slow to act, maybe in the 1900’s when fresh immigrants needed a voice. Old hat, money suckin fools.",
            "title_similarity": "0.53376377",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h10qap5",
            "score": -1,
            "text": "This is absolutely BS. This article should be banished to the mountains of Mordor never to be seen again. \n\nIm in South Africa and the Unions have crippled the labour force. Its pretty much the opposite of what they are stating.",
            "title_similarity": "0.24927086",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h10qc4e",
            "score": -1,
            "text": "If that union isn’t really being run by corporate management plants, as is the case with some of the largest of them.",
            "title_similarity": "0.5999973",
            "sentiment_compound": 0.0
        },
        {
            "id": "h11844p",
            "score": -1,
            "text": "Mafia presence lowers crime rates for both Mafia and non-Mafia households. Doesn't just because one data point looks better doesn't mean the whole situation is.",
            "title_similarity": "0.787053",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h11st5o",
            "score": -1,
            "text": "If unions are so good, why have they steadily decreased in popularity since the 60s? Honestly - how can you make the point that labor unions (who are introduced, and voted on by employees...) are helpful to the employees, yet employees are not using them...\n\nI mean I'm not an economics PhD, but I feel like this is a misleading \"study\"\n\n[https://www.npr.org/sections/money/2015/02/23/385843576/50-years-of-shrinking-union-membership-in-one-map](https://www.npr.org/sections/money/2015/02/23/385843576/50-years-of-shrinking-union-membership-in-one-map)",
            "title_similarity": "0.5927311",
            "sentiment_compound": 0.7202
        },
        {
            "id": "h0zjtlg",
            "score": 27,
            "text": "Is it union density, or is it other policies in place  in states/cities that have higher union density?",
            "title_similarity": "0.51551485",
            "sentiment_compound": 0.0
        },
        {
            "id": "h0zyvzl",
            "score": 9,
            "text": "Lest we forget the bloody history of the Coal Wars in the United States, and all the horrid conditions the average worker faced in the early Industrial Revolution to the late 20th Century.",
            "title_similarity": "0.44018105",
            "sentiment_compound": -0.8442
        },
        {
            "id": "h0zxiw0",
            "score": 2,
            "text": "IBEW member here! Best decision I’ve made for my family!!",
            "title_similarity": "0.45003244",
            "sentiment_compound": 0.7249
        },
        {
            "id": "h0zy63s",
            "score": 2,
            "text": "You don't have to say non-unionized, you can just say ionized.",
            "title_similarity": "0.28018302",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1005i7",
            "score": -2,
            "text": "Union is only good as the men and the women (ugh!) in it.",
            "title_similarity": "0.5950418",
            "sentiment_compound": 0.1007
        },
        {
            "id": "h10klph",
            "score": 2,
            "text": "Strong unions worked really well for General Motors and its employees, eh?",
            "title_similarity": "0.6534096",
            "sentiment_compound": 0.6901
        },
        {
            "id": "h0zsxdi",
            "score": 72,
            "text": "My Dad was a proud member of a trade union.  Thanks to the union he was ensured a safe work environment, we were not needy, later, when he was sick the insurance kept my Mom from having to get a job, helped pay for my tuition, and paid for 30+ years of good health insurance for my Mom.",
            "title_similarity": "0.66907805",
            "sentiment_compound": 0.8456
        },
        {
            "id": "h10fs2m",
            "score": 27,
            "text": "Americans - discovering social support in 2021",
            "title_similarity": "0.28085244",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h0zkw86",
            "score": -22,
            "text": "Presence of strong labour unions leads to bullying people into paying more as well.",
            "title_similarity": "0.6222527",
            "sentiment_compound": 0.197
        },
        {
            "id": "h102ibs",
            "score": 3,
            "text": "This is the real trickle down",
            "title_similarity": "0.22622797",
            "sentiment_compound": 0.0
        },
        {
            "id": "h102qrs",
            "score": 3,
            "text": "What a fuckin' surprise, who ever would have guessed",
            "title_similarity": "0.042801008",
            "sentiment_compound": 0.3384
        },
        {
            "id": "h10cv7f",
            "score": 3,
            "text": "As a proud 786 local union member I will say having worked for both non union and union construction crews Union crews do an order of magnitude more work per worker. I'm talking about 1,000 yards for 10 guys a day. Non union would be luck to hit 100 yards... And it would be a stressful situation. Union works safe and steady and gets it done the right way.",
            "title_similarity": "0.632241",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h10k6kx",
            "score": 3,
            "text": "Detroit seems the opposite",
            "title_similarity": "0.17682159",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10ismt",
            "score": 4,
            "text": "Aaannnnd post 70's they just allow lazy parasites to sit on their ass and not get fired. True story. I have pictures.",
            "title_similarity": "0.4481575",
            "sentiment_compound": -0.5435
        },
        {
            "id": "h1022w3",
            "score": 181,
            "text": ">The presence of strong labor unions substantially reduces poverty for both unionized households and non-unionized households.\n\n... is why there is so much anti-union propaganda.",
            "title_similarity": "0.94639087",
            "sentiment_compound": -0.3699
        },
        {
            "id": "h10mbka",
            "score": 9,
            "text": "Funny employer (a catholic hospital system) is trying to fight off nurse union talks. And all I have heard is union bad.",
            "title_similarity": "0.38625118",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h0zuuuq",
            "score": 70,
            "text": "It also reduces the enrichment of exploitative corporations, which is the main reason why labour unions are so violently opposed by the wealthy. Never forget the Coal Wars.",
            "title_similarity": "0.6535051",
            "sentiment_compound": -0.7431
        },
        {
            "id": "h100vw0",
            "score": 8,
            "text": "[deleted]",
            "title_similarity": "0.00902459"
        },
        {
            "id": "h0z3yly",
            "score": 200,
            "text": "Abstract:\n\n> American poverty research largely neglects labor unions. The authors use individual-level panel data, incorporate both household union membership and state-level union density, and analyze both working poverty and working-aged poverty (among households led by 18- to 64-year-olds). They estimate three-way fixed effects (person, year, and state) and fixed-effects individual slopes models on the Panel Study of Income Dynamics (PSID), 1976–2015. They exploit the higher quality income data in the Cross-National Equivalent File—an extension of the PSID—to measure relative (<50% of median in current year) and anchored (<50% of median in 1976) poverty. Both union membership and state union density have statistically and substantively significant negative relationships with relative and anchored working and working-aged poverty. Household union membership and state union density significantly negatively interact, augmenting the poverty-reducing effects of each. Higher state union density spills over to reduce poverty among non-union households, and there is no evidence that higher state union density worsens poverty for non-union households or undermines employment.\n\n[Ungated version](https://osf.io/preprints/socarxiv/bgcp6/) of the paper.",
            "title_similarity": "0.5302843",
            "sentiment_compound": -0.9874
        },
        {
            "id": "h0zra83",
            "score": 383,
            "text": "# The Haymarket Affair: People fought and bled to give us an 8 hour workday. \n\nhttps://en.m.wikipedia.org/wiki/Haymarket_affair",
            "title_similarity": "0.31530744",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h10apd7",
            "score": 13,
            "text": "One of the biggest crimes against humanity in the 20th century is convincing the working class that unions are no good.",
            "title_similarity": "0.5060308",
            "sentiment_compound": 0.0757
        },
        {
            "id": "h0zdgzd",
            "score": 2684,
            "text": "Rising tide brings up all ships. Collective bargaining creates a baseline expectation of what employers need to pay and provide in order to be competitive in a labor marketplace. Makes sense .",
            "title_similarity": "0.49398625",
            "sentiment_compound": 0.34
        },
        {
            "id": "h0zyv45",
            "score": 271,
            "text": "I’m a proud union member. There’s no way my company would pay electricians and all other trades $55/hour with a secure pension, without collective bargaining going back to the 1950’s.",
            "title_similarity": "0.51692593",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1033ff",
            "score": 33,
            "text": "United we bargain, divided we beg.",
            "title_similarity": "0.32863498",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h10h4x9",
            "score": 35,
            "text": "I work in a car factory in Western Europe. From 2017 up until now, I make around 300-400 euros a month more solely because the unions negotiate industry wide wages every single year. \n\nWhat bastards, right?",
            "title_similarity": "0.415214",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h0yy05t",
            "score": 785,
            "text": "Any way to read the paper without paying $37.50?\n\nEDIT: OP provided a link to read for free: https://osf.io/preprints/socarxiv/bgcp6/",
            "title_similarity": "0.4633912",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h10b5fh",
            "score": 58,
            "text": "A well established economic fact, and precisely why business owners work so hard to break unions.  It is so disappointing to see today’s service and tech workers accepting pauper’s pay and believing their owners’ capitalist rhetoric.",
            "title_similarity": "0.65871155",
            "sentiment_compound": -0.3984
        },
        {
            "id": "h0zys4f",
            "score": 1,
            "text": "It depends. As with everything, there should be a balance of power between employees and employers. Labour unions are a great way to increase collective bargaining power of the employees.\nToo much power to employees and labour unions, would mean to much money spent on wages and not enough on investing in order to keep a company profitable.\n\nAlso, there have been a lot of instances where way too strong labour unions with political backing in the public sector have become too powerful and have dictated terms against the general population. In Romania, a lot of them are forcing teachers or cops to pay a percentage out of their salaries and are refusing any reforms. Some people which represented a metro labour union even blocked trains one day because the new government started demolishing illegally built stores that were contributing money to the labour union.",
            "title_similarity": "0.6554413",
            "sentiment_compound": 0.8834
        },
        {
            "id": "h0zyyyj",
            "score": 1,
            "text": "I read unionized as un-ionized… geesh I need some sleep",
            "title_similarity": "0.19050506",
            "sentiment_compound": 0.0
        },
        {
            "id": "h100g67",
            "score": 4,
            "text": "They speed up automation plans in many industries…. See the print workers Union in the U.K.",
            "title_similarity": "0.4614558",
            "sentiment_compound": 0.0
        },
        {
            "id": "h103k37",
            "score": 3,
            "text": "Wow that's crazy I wonder if anybody has written extensively about this",
            "title_similarity": "0.06912625",
            "sentiment_compound": 0.34
        },
        {
            "id": "h103wu0",
            "score": 1,
            "text": "It’s almost like it increases competition. Wild.",
            "title_similarity": "0.30888292",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h103x1o",
            "score": 15,
            "text": "Shocking. Giving workers a voice is better. Who’d have thunk it. \n\n\n\nWait",
            "title_similarity": "0.4853008",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h1046m9",
            "score": 1,
            "text": "A strong police Union also reduces poverty, by removing population.",
            "title_similarity": "0.79475725",
            "sentiment_compound": 0.0
        },
        {
            "id": "h104d98",
            "score": 1,
            "text": "How do you ionize a household?",
            "title_similarity": "0.11172307",
            "sentiment_compound": 0.0
        },
        {
            "id": "h104qo0",
            "score": 1,
            "text": "So you would think we, as a society, would support this model. A huge part of our economy depends upon our continuing agreement to participate in a capitalist system. But we inevitably listen to the hacks who tell us that we shouldn’t expect fair wages and benefits. An educated and healthy society creates wealth for all, the corporate world included. They still prefer their cash up front and aren’t prepared to work with us to build our society but it will eventually become obvious even to them. By acting strategically about where we spend our money we can make them listen.",
            "title_similarity": "0.70650923",
            "sentiment_compound": 0.967
        },
        {
            "id": "h10504g",
            "score": 1,
            "text": "Darwinism is the thing we have to overturn. That’s the actual piece of the puzzle holding modern society the way it is. It’s going to come down to employees and managers doing the right thing which will directly affect business relations. It has to get really bad before it can get better and we aren’t close to bad",
            "title_similarity": "0.5455221",
            "sentiment_compound": -0.659
        },
        {
            "id": "h1058nh",
            "score": 1,
            "text": "Unions like every organised large group of people that becomes formalised and hierarchical can sadly become self-serving and parasitic just like ‘evil big corporations’. It has been my experience that unions are just as guilty of putting its leadership ahead of the very members they are supposed to protect.",
            "title_similarity": "0.49063694",
            "sentiment_compound": 0.25
        },
        {
            "id": "h105wof",
            "score": 1,
            "text": "As Brazilian, I have conflicting points of views. Left my country hating the huge HIGE amount of corrupt and inflated unions. Moved to US and I can understand how workers needs unions. \n\nI am not sure what is the best middle ground. But I can safely say they are not perfect by any means.",
            "title_similarity": "0.5008059",
            "sentiment_compound": 0.0186
        },
        {
            "id": "h109lei",
            "score": 1,
            "text": "I would be interested to see what the presence of a strong labor union does for the highest earners at a company.",
            "title_similarity": "0.67111826",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h10ahpn",
            "score": 1,
            "text": "I read un-ionized and did not understand how unions have anything to do with that...",
            "title_similarity": "0.19477054",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10ccem",
            "score": 1,
            "text": "Key word being strong",
            "title_similarity": "0.2772414",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h10cn90",
            "score": 1,
            "text": "The unionised families are notable for not being charged.",
            "title_similarity": "0.55224735",
            "sentiment_compound": 0.1511
        },
        {
            "id": "h10dddw",
            "score": 1,
            "text": "Australia was once heavily unionised, workers strikes were commonplace through the 80's and 90s when I entered the workforce (late 80s). Some of it was just plain ridiculous, workers striking over the flavour of ice cream in the canteen (at a mine my parents worked at). Federal legislation changes striped the unions of a lot of power through the 00s, and now as a worker - even a unionised one - there is so little you can do via industrial action to get a fair deal. Currently my union has been in protracted negotiations (coming up on two years now) just to get us a decent pay rise, and the best we can do is wear a T-shirt with our union's logo to work instead of our prescribed uniform. We really are at the mercy of how much our employer would like to give us as a pay raise, which is basically nothing.",
            "title_similarity": "0.48960102",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h10f8lu",
            "score": 1,
            "text": "But that’s not what my boss said.",
            "title_similarity": "0.17184895",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10fszx",
            "score": 1,
            "text": "This is true but they can also become too strong like they did in the 80s in the UK. The binmen protested and there was rubbish pilling up everywhere.",
            "title_similarity": "0.497401",
            "sentiment_compound": 0.8338
        },
        {
            "id": "h10gcs0",
            "score": 1,
            "text": "How did households get ionized in the first place?",
            "title_similarity": "0.17957939",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10glcs",
            "score": 9,
            "text": "we need unions. ones that are powerful enough to protect us, like police unions protect police.",
            "title_similarity": "0.53615284",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h10ip7o",
            "score": 1,
            "text": ">\tunion membership and state union density have statistically and substantively significant negative relationships with relative and anchored working and working-aged poverty. Household union membership and state union density significantly negatively interact, augmenting the poverty-reducing effects of each. Higher state union density spills over to reduce poverty among non-union households, and there is no evidence that higher state union density worsens poverty for non-union households or undermines employment",
            "title_similarity": "0.79079473",
            "sentiment_compound": -0.9612
        },
        {
            "id": "h10kl8n",
            "score": 1,
            "text": "Unions are all about providing all employees a higher base salary so this makes sense as it's really the main intention of unions. The real question is if unions provide on average higher wages (including taking into account people fired for unionizing) than non-unions.",
            "title_similarity": "0.65864277",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h10l27i",
            "score": 3,
            "text": "Can we please have a nursing union down here in Louisiana. Preferably in one with actual stroke and that isn’t absolutely useless.",
            "title_similarity": "0.41038907",
            "sentiment_compound": -0.2006
        },
        {
            "id": "h10l5a5",
            "score": 1,
            "text": "This, this right here is exactly why I’m doing as well as I am. The reason my little family is doing so well. Corporate America wants you to believe unions are evil for the same reason they want you to believe free healthcare is a bad thing. I make 18.44 an hour and work 3 days a week, getting a union job was one of the best things I’ve done for myself",
            "title_similarity": "0.64885235",
            "sentiment_compound": 0.5777
        },
        {
            "id": "h10myhe",
            "score": 1,
            "text": "I know this is true from first hand experience. I work for an organization that essentially treats all employees as if they're union even if they're not. This is because almost all lower-level positions are union and those jobs represent the bulk of the positions in the organization. It's just easier for the organization to implement policy that treats everyone the same versus different policies for different groups.\n\nWhere I take issue with this is that higher-level positions reap the rewards of unionization without contributing to its costs. I get to enjoy the benefits of being in a union without being a member and I don't have to contribute financially even though I make more than most of those contributing... Seems like engineered divisiveness to me. Wish I could pay and be a card carrying member of the union but I don't have that option.",
            "title_similarity": "0.7167119",
            "sentiment_compound": 0.882
        },
        {
            "id": "h10oib9",
            "score": 17,
            "text": "When Union skilled tradespeople get raises non union shops will generally give raises to keep their employees from jumping over . One non Union contractor would check in every year with the Carpenters Union Hall and get a copy if their contract. He would pay his employees $1 per hour less than Union scale. Hence the old adage “ a rising tide raises all boats “ at least in the building trades.",
            "title_similarity": "0.520002",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h10qy59",
            "score": 1,
            "text": "Saving thing to use in internet arguments",
            "title_similarity": "0.26843494",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h10r1if",
            "score": 1,
            "text": "Because existing labor unions implies that there is a big enough industry present... so that is the actual thing that creates wealth (and unions)?\n\nI.e. there are no unions in the middle of some poorer, rural region...",
            "title_similarity": "0.6492858",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h10sb1u",
            "score": 1,
            "text": "Again, look to Norway for the best solution :)",
            "title_similarity": "0.30987704",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h10so68",
            "score": 1,
            "text": "70's UK would like a word.",
            "title_similarity": "0.24831246",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h10t8io",
            "score": 1,
            "text": "Cool, how does it affect maximum earnings, and how does it look across professions and higher-value occupations?",
            "title_similarity": "0.57104325",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h10te14",
            "score": 1,
            "text": "Yep. This is why Australia has such good working conditions, free health care and good wages.",
            "title_similarity": "0.6623639",
            "sentiment_compound": 0.926
        },
        {
            "id": "h10tufh",
            "score": 1,
            "text": "Does it take into account the economic growth and the \"quality of living\" of poverty?  \nAs someone who lives in a country that transitioned from union controlled socialism where the unionized workers mainly in government controlled companies have excessive rights, to free-er market, I have seen it develop in the opposite way.   \nFor example, at first only union workers had universal healthcare. In the 90's the health care transitioned from \"union based\" to several competing non profits, based on a special progressive health tax, and the result is actual universal healthcare.  \nThey also couldn't be fired. Every time there was a lack of budget, they negotiated reduction of pay for \"generation 2\" workers.   \nThey had budget based pension funds (where the current workers pay the pension of those who retired) that were completely unsustainable, and collapsed in the 90s and had to be rescued by the tax payers money. The result of those, some people have huge pension now, while my parents, for example, receive a really minimal \"social security\" pension  \n\n\nNow unions still control several critical areas like ports, airports electricity etc, and they receive completely exorbitant pay and benefits, because they can completely cripple the economy with strikes. My parents, who were immigrants, never got a \"union job\" that only goes based on connections and nepotism, and no union ever tried to improve the benefits of minimum wage workers. For every $ minimum wage gets, strong high paying union workers receive 5$ due to insane salary structures.",
            "title_similarity": "0.61568266",
            "sentiment_compound": 0.9418
        },
        {
            "id": "h10vvq4",
            "score": 2,
            "text": "Wow workers being able to work together to not allow companies to take advantage of them reduces poverty? Shocking xD",
            "title_similarity": "0.7245821",
            "sentiment_compound": 0.4468
        },
        {
            "id": "h10we94",
            "score": 10,
            "text": "This doesn’t surprise me. Despite the fact that you can find examples of corrupt unions, at least in America, their overall benefit to the workforce is undeniable to anyone who ever actually reads a history book.",
            "title_similarity": "0.6990652",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h10whw9",
            "score": 1,
            "text": "If you listen carefully, you can hear the cognitive dissonance causing pain inside the head of neoliberals reading this headline. Poor babies.",
            "title_similarity": "0.41208345",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h10wi9c",
            "score": 1,
            "text": "While draining said company of revenue to feed the ever greedy union pensions. Unions a hundred years ago served a purpose, now they only exist to collect dues from useless and inept workers so they can funnel money to idiot democrats.",
            "title_similarity": "0.49412972",
            "sentiment_compound": -0.7927
        },
        {
            "id": "h10wieh",
            "score": 1,
            "text": "Could you have labor unions like the US has in a communist country like soviet Russia ?",
            "title_similarity": "0.4068581",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h10wxmp",
            "score": 1,
            "text": "This study coincides with Biden + California wanting to eliminate gig work.",
            "title_similarity": "0.30936027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h10xo4w",
            "score": 1,
            "text": "what, having the ability to negotiate with management leads to better pay??\n\nit's amazing how management was able to turn labor away from the unions. throw around words like \"collective.\" \n\nequate *standing up for yourself* and *advocating for better conditions and pay* with *complaining* and *wanting something for nothing.*\n\nmanipulate all the toxic assholes to feel like *less-than-men* for saying anything critical of management. \n\ncreate a culture of silent complicity wherein the very act of saying \"this should be better\" is viewed as non-masculine, non-patriotic, bad work ethic, \"playing the victim.\"",
            "title_similarity": "0.64291966",
            "sentiment_compound": 0.8299
        },
        {
            "id": "h10xpj3",
            "score": 2,
            "text": "And this makes perfect sense.  The labor unions ensure that the workers earn a fair wage.  And those workers then go out and spend their money in the community, which ensures fair wages for the people at the businesses that they patronize.",
            "title_similarity": "0.7371906",
            "sentiment_compound": 0.872
        },
        {
            "id": "h10xzuc",
            "score": 1,
            "text": "Thank *goodness* a century of anti-union propaganda in the US has made certain that neither party is all that fond of unions.",
            "title_similarity": "0.42106062",
            "sentiment_compound": 0.7385
        },
        {
            "id": "h10y09x",
            "score": 1,
            "text": "Yes but the people who control people don't want us not to suffer",
            "title_similarity": "0.44354454",
            "sentiment_compound": 0.6476
        },
        {
            "id": "h10y2za",
            "score": 2,
            "text": "Oh no way who could have thought.",
            "title_similarity": "0.0002162829",
            "sentiment_compound": -0.296
        },
        {
            "id": "h10y4yv",
            "score": 1,
            "text": "Very interesting data",
            "title_similarity": "0.3134602",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h10yjb1",
            "score": 1,
            "text": "I'd say tell that to my coworkers, but they don't care about that when they can suck up to their abusive managers.",
            "title_similarity": "0.5245229",
            "sentiment_compound": -0.9336
        },
        {
            "id": "h10zw67",
            "score": 1,
            "text": "A sawmill mill (employing about 300 people) and a gas plant (1000 jobs) near me permanently closed solely because the union was asking for too much. Now all those people don't have jobs because of the \"strong\" Union.",
            "title_similarity": "0.4031139",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1108y1",
            "score": 2,
            "text": "Which is why the Republicans hate unions. Only poor people will work for poverty - level wages while the managers make so much more.",
            "title_similarity": "0.63013387",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h110wzk",
            "score": 1,
            "text": "Yeah, if I was part of a strong union I wouldn't have made below $400 when I worked for a bit over $10 an hour over 40 hours plus holiday pay.",
            "title_similarity": "0.5935301",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h1111u8",
            "score": 1,
            "text": "Argentina it an example that this is wrong",
            "title_similarity": "0.15757774",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h115ef9",
            "score": 1,
            "text": "Unions failed because selfish people wouldn't stand up for the other guy when they had nothing to gain by standing up for them... A union can only be as strong as the people in the union..",
            "title_similarity": "0.5355114",
            "sentiment_compound": -0.7074
        },
        {
            "id": "h1168al",
            "score": 1,
            "text": "Which is why we can't have them. The bourgeoisie require proles to be desperate and perceieve themselvs as disparate from their peers. Unions create class solidarity which opens the door for collective bargaining; something the ruling class just can't abide.",
            "title_similarity": "0.5426382",
            "sentiment_compound": 0.25
        },
        {
            "id": "h118j4p",
            "score": 7,
            "text": "I have spent so much time explaining this to people. Unions were responsible for giving my 1st generation immigrant grandmother and her family a middle class life. My grandmother and two of my great uncles served in elected positions and unions throughout their lives.  If unions weren’t great for workers, companies like Amazon wouldn’t spend so much money trying to break them up.",
            "title_similarity": "0.59471095",
            "sentiment_compound": 0.9442
        },
        {
            "id": "h119o93",
            "score": 5,
            "text": "When I started security I could only find min wage at 14 an hour, every single company had competitive pay as one of their attributes for offering min wage or 50 cents above min wage which I found to be hilarious.\n\nThe only place that offered well over, it was around 19 or 20 an hour with benefits was the only unionized job.",
            "title_similarity": "0.47525048",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h11bnaw",
            "score": 3,
            "text": "This seems to be an active conversation and open for discussion. \n\nI was wondering the time scale at which this paper operated?\n\nBecause, while labor unions are certainly beneficial to a point, I have always wondered how much their heightened cost of labor led to the financial decline of many industries in highly-unionized environments, eg. Detroit Auto and Pennsylvania Steel.\n\nBoth of those areas associated with the rise and fall of major industry are pure dog-shit for poverty and living conditions now, rampant with crime, drug use, etc associated with high poverty rates. \n\nSo while I am not decrying the benefits of unions 100%, I do wonder if there comes a point, whether it be temporal or monetary, where unions can potentially do more harm than good.",
            "title_similarity": "0.6809353",
            "sentiment_compound": -0.7108
        },
        {
            "id": "h11dahy",
            "score": 4,
            "text": "Even a bad union is a 10% increase in pay.",
            "title_similarity": "0.5080242",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h11h3yf",
            "score": 1,
            "text": "Wow! Its almost as if we provide security and stability to peoples lives who have historically bot had it, it is in fact good for them! And even better, improved working conditions overall, benefits everyone. \n\nThats what i dont understand. If the crew works together they can stop a sinking ship, right?(obviously bot in all cases)",
            "title_similarity": "0.7410038",
            "sentiment_compound": 0.944
        },
        {
            "id": "h11he65",
            "score": 2,
            "text": "This has been true since unions were formed, without question.",
            "title_similarity": "0.3450961",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h11i400",
            "score": 1,
            "text": "Gasp! Shock! Awe! \n\nYou don’t say.",
            "title_similarity": "0.007063415",
            "sentiment_compound": -0.5386
        },
        {
            "id": "h11kjm0",
            "score": 1,
            "text": "Why else would business owners oppose unions so much? That itself is proof they benefit workers.",
            "title_similarity": "0.75460494",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h11lfhm",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.00902459"
        },
        {
            "id": "h11p6zy",
            "score": 1,
            "text": "Talk to all the out of work car wash workers in New York or the out of work auto workers in Detroit. The reduction in poverty is a short term win.  \n\nEventually the load of over compensation and pensions breaks the system.",
            "title_similarity": "0.58865255",
            "sentiment_compound": 0.128
        },
        {
            "id": "h11pciv",
            "score": 2,
            "text": "Someone, somewhere will refute this evidence and the thousands more by simply saying “Unions steal your money”",
            "title_similarity": "0.38875914",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h11qknm",
            "score": 1,
            "text": "Correlation and causation.",
            "title_similarity": "0.08848405",
            "sentiment_compound": 0.0
        },
        {
            "id": "h11qqfn",
            "score": 1,
            "text": "It also substantially reduces the quality of work provided and stifles any innovation.\n\nLet me know when your labor union invents any new tools, methods, or materials. Let me know when their quality of work improves. Let me know when they actually fire someone for not being good at their job.\n\nThere's a reason the US and China are leaders in innovation and the EU is treading water.",
            "title_similarity": "0.6554513",
            "sentiment_compound": 0.4929
        },
        {
            "id": "h11s2u5",
            "score": 1,
            "text": "...unions in my area are rich and well fortified. They actively send people in businesses to ask about joining or have them work internally for the same reason. The workers there after become near untouchable and wonder why bonuses become less.",
            "title_similarity": "0.660843",
            "sentiment_compound": 0.891
        },
        {
            "id": "h11sfzl",
            "score": 1,
            "text": "Egotistic altruism. \n\nTurns out that the best way to be selfish is being selfless, it comes around to benefit you in the end, even if you re rich.   \nThe better each person does, the better everyone does.  \n\nAny criticisms I've seen against that argument are just flawed wishful thinking disguising old fashioned counter-productive selfishness born from fear and ignorance.",
            "title_similarity": "0.67499703",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h11so71",
            "score": 1,
            "text": "Stop using actually researched information. Stupid people don’t like it!",
            "title_similarity": "0.28427202",
            "sentiment_compound": -0.5255
        },
        {
            "id": "h1220tn",
            "score": 1,
            "text": "Economists call the increase in non-union job salaries a \"spillover effect\".",
            "title_similarity": "0.5756006",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h123a67",
            "score": 1,
            "text": "Yeah for those that keep their job. What about the people who the lose their job because of impossible union demands on industries.",
            "title_similarity": "0.5834849",
            "sentiment_compound": -0.128
        },
        {
            "id": "h123k3o",
            "score": 2,
            "text": "Just in here to say not every union is a power house of awesome. One Ive dealt with in the past was more of an anchor holding the employees back in 3 year increments. The union is ran by old employees who have pension which they allowed to be discontinued by the company (except theirs they were grandfathered in) and all they fight for in contracts is their pension multipliers leaving the rest of us without pension out to dry. Besides that they are virtually complicit to the company nickel and diming all of our benefits away one at a time. No more per diem. No more additional annual PTO. No more bonuss. At this point its just a question of what will they take next.also the pay sucks when compared to other similar work in the area so now theyre hemorrhaging employees and theyre acting like its a surprise",
            "title_similarity": "0.4710105",
            "sentiment_compound": -0.0164
        },
        {
            "id": "h12fyu8",
            "score": 1,
            "text": "Absolute shocker... Too bad we're going the other way.",
            "title_similarity": "0.15118167",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h12vcg2",
            "score": 1,
            "text": "So what’s the reason non union Chine has seen average pay climb 20,000% while we’ve seen no real wage growth and heavily unionized E.U. has seen negative wage growth?",
            "title_similarity": "0.5664157",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h131dfs",
            "score": 1,
            "text": "Is diversity our strenght? \n\nWill all this love and rainbow permeating our lives and the market place we never stopped to think why companies love diversity.\n\nThe more diverse a company is the less likely it is for employees to organize and unionize.",
            "title_similarity": "0.67539734",
            "sentiment_compound": 0.8971
        },
        {
            "id": "h1325je",
            "score": 1,
            "text": "The fact that this title could be *news* to some people is depressing.",
            "title_similarity": "0.37977037",
            "sentiment_compound": -0.3818
        }
    ]
}