{
    "Vitamin D deficiency strongly exaggerates the craving for and effects of opioids, potentially increasing the risk for dependence and addiction, according to a new study led by researchers at Massachusetts General Hospital (MGH).\n": [
        {
            "id": "h1hzziq",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.5922484",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h1ifu6b",
            "score": 0,
            "text": "The lesson here is simple, kids. Inject heroin in the park, not indoors.",
            "title_similarity": "0.38091862",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h1ih6jv",
            "score": 0,
            "text": "Put the junkies in the sun?",
            "title_similarity": "0.2899512",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1i814i",
            "score": 35,
            "text": "I believe that Vitamin D deficiency and all other ailments might just be the symptoms of the same cause: people just sitting at home all day and not going outside to get some necessary exercise for a healthier overall condition.",
            "title_similarity": "0.5671813",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1i60dg",
            "score": 21,
            "text": "I have a vitamin D deficiency and have never once craved opioids, but now you’ve got me curious and it’s all I can think about. This post had made me crave opioids so thanks I guess",
            "title_similarity": "0.68714297",
            "sentiment_compound": 0.8645
        },
        {
            "id": "h1ibkrr",
            "score": 1,
            "text": "This explains so much! Since correcting my Vitamin D deficiency I am happier and any cravings I once had for opioids are gone.\n\nWhen I first started Vitamin D supplements I swear I felt high.",
            "title_similarity": "0.64801514",
            "sentiment_compound": 0.784
        },
        {
            "id": "h1if8e0",
            "score": 0,
            "text": "Have been talking about this for years for the topic to just fall on deaf ears. Funny how people need studies these days as a substitute for common sense",
            "title_similarity": "0.57572913",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1ifqy9",
            "score": 0,
            "text": "Claims that vitamin D does X based on non-RCTs fail to account for confounding variables. Vitamin D deficiency is incredibly common and often a result of not spending time outdoors, a poor diet, lack of access to healthcare, and darker pigmentation. What do you think is a bigger driver of addiction? Poverty or sunlight?",
            "title_similarity": "0.78410745",
            "sentiment_compound": -0.8466
        },
        {
            "id": "h1ipstz",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.16257642"
        },
        {
            "id": "h1i76zn",
            "score": 13,
            "text": "My vitamin D levels are fine but I will forever crave opioids. Not much beats that warm fuzzy blanket feel!",
            "title_similarity": "0.5866161",
            "sentiment_compound": 0.5635
        },
        {
            "id": "h1j128r",
            "score": 1,
            "text": "It also greatly increases your symptoms of covid, but hey let’s not ever talk about that.",
            "title_similarity": "0.6809389",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1igui5",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.18686053"
        },
        {
            "id": "h1ijs63",
            "score": 54,
            "text": "Careful with vitamin D claims, many have been made in the past ranging from Covid protection to mood to cancer prevention, and they are very controversial and lack evidence. In fact, the USPSTF still hasn’t found enough evidence to recommend routine vitamin D screening outside of osteoporosis or osteomalacia type disorders. The non controversial effects of vitamin D are on bone health. Besides that there are weak studies and limited, conflicting evidence.\n\nThis study was done on mice, and then by comparing human health records. They saw more opioid use in people deficient in vitamin d, but you have the correlation and causation issue and chicken or egg. Is it that patients who suffer from chronic pain and use opioids tend to live more sedentary lives and get less vitamin D via UV? The patient with chronic debilitating back or knee pain is likely not hiking or mountain biking every weekend. Is it that people who spend more time being active outdoors are less likely to have chronic pain and thus less likely to use narcotic pain meds? I would wait to draw the conclusion that vitamin D somehow reduces opioid cravings in humans.",
            "title_similarity": "0.77650356",
            "sentiment_compound": -0.964
        },
        {
            "id": "h1i0sro",
            "score": 29,
            "text": "Well that explains my critically low vitamin D levels. I’m really struggling not going a vitamin D rant right now.",
            "title_similarity": "0.6835278",
            "sentiment_compound": -0.6347
        },
        {
            "id": "h1igsqz",
            "score": 0,
            "text": "go outside and play = less drug use..Got it",
            "title_similarity": "0.23421356",
            "sentiment_compound": 0.34
        },
        {
            "id": "h1ivzb7",
            "score": 0,
            "text": "Humans are basically giant plants. Sunlight everyday, water and the right nutrients will go the distance.",
            "title_similarity": "0.26553848",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ktcli",
            "score": 0,
            "text": "I disagree. I think it’s introversion and obesity which leads to less outdoor time, reducing overall Vitamin D levels.",
            "title_similarity": "0.7077724",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h1kwdwr",
            "score": 0,
            "text": "Gotta love Seattle. Portland. Basically the whole PNW gets ~38% days that have sun (not overcast) annually. And that’s not including winter days where vitamin D is insignificant. Growing up and having lived my whole life here, take supplements people. Don’t turn out like these massive homeless drug addict populations we have.",
            "title_similarity": "0.55607975",
            "sentiment_compound": 0.802
        },
        {
            "id": "h1i48zr",
            "score": 48,
            "text": "the question comes up to me, wether the deficiency is caused by the opioids or it is because those ppl tend to stay indoors, because of other reasons.\n\nedit: well nevermind, the question just got answered below. they used mice to test it. i guess they all didn't have alot of exposure to sunlight.",
            "title_similarity": "0.6545199",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1ifalx",
            "score": 11,
            "text": "It exaggerates the effects? Like if I was still using, I could get more bang for my buck by staying indoors out of the sun and just playing video games all day?\n\nNow I'm slightly less ashamed of how I spent my \"lost years\" since apparently I was doing legitimate research. I just didn't know it.",
            "title_similarity": "0.6146593",
            "sentiment_compound": -0.3588
        },
        {
            "id": "h1ibp57",
            "score": -1,
            "text": "Anybody know how do I give myself a vitamin D deficiency?",
            "title_similarity": "0.6157799",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1ien8u",
            "score": 1,
            "text": "As someone with a severe vitamin D deficiency (I've been proscribed 15000 (microgram?) once a week pill twice now), I'm going to need more information on this because I have zero interest or dependency on opioids or anything else.\n\nI don't notice any difference in my body or mood between being on the pill or not. I don't notice any difference in body or mood when I make an effort to sit outside to get some vit d from the sun.\n\nI feel like this might be a chicken and egg question. Which came first, the addiction or the deficiency?",
            "title_similarity": "0.63892883",
            "sentiment_compound": 0.6662
        },
        {
            "id": "h1ifv7z",
            "score": 1,
            "text": "I don't understand how and why has vitamin D become so relevant these day?",
            "title_similarity": "0.54108924",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1iv6pv",
            "score": -1,
            "text": "Yes but too much Vitamin D is also bad so dont just go 10000mg like some ppl.",
            "title_similarity": "0.777907",
            "sentiment_compound": 0.2846
        },
        {
            "id": "h1j5r30",
            "score": 1,
            "text": "So if I want my opioids to hit harder stop taking my vitamin d supplements, got it",
            "title_similarity": "0.77356064",
            "sentiment_compound": 0.144
        },
        {
            "id": "h1ie8au",
            "score": 2,
            "text": "I kept seeing Vitamin D pop up for a vast array of health issues both physical and mental. I also remembered the last time I had blood work done it said I was low on Vitamin D. So I got a jar of vitamin gummies a few months ago.\n\nGranted, this coincided with a few other changes in my life but I feel... great? Like, I have more energy than ever before and for the first time in many years I don't feel the depression monkey on my back.\n\nI am not a medical professional, and my advice is purely anecdotal, but if you have been struggling with depression and nothing seems to work (exercise, therapy, anti-depressants, etc), try taking Vitamin D or soaking up more sun. The change has been significant and I feel pretty silly that I never tried it before.",
            "title_similarity": "0.7264787",
            "sentiment_compound": 0.9609
        },
        {
            "id": "h1j2u0r",
            "score": -2,
            "text": "So Vitamin D deficiency POTENTIATES opiates?",
            "title_similarity": "0.6629913",
            "sentiment_compound": 0.3597
        },
        {
            "id": "h1ibatw",
            "score": 4,
            "text": "Hmm. Heroin addiction is a disproportionally large problem in otherwise safe and healthy Norway. Can the lack of sunlight be a contributing factor?",
            "title_similarity": "0.6764711",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1ibexk",
            "score": 3,
            "text": "Hi I'm from Scotland, where the sun only shines for 3 weeks of the year, depression is hugely attributed to this.. like a lot of Scandinavian countries. \nAnd... I have already had 8 cocodamol today. Just for the hell of it. \n\nIt's just another day.",
            "title_similarity": "0.5051328",
            "sentiment_compound": -0.7525
        },
        {
            "id": "h1if804",
            "score": -3,
            "text": "Lots of folks who live in Van-East end live homeless, lots of sunshine, lots of Vit-D, and lots of opioids are consumed.\n\n&#x200B;\n\nHmmmm....must be that yankee science again.  Mass?  Checks out.\n\nDisregard the entire study.  Lets hear what the Europeans have to say, especially those Germans.  They dig 'real' science...not politically oriented science.",
            "title_similarity": "0.6798469",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1i9nmo",
            "score": 13,
            "text": "No wonder losing weight in summer is easier. I'm literally happier due to sunshine.",
            "title_similarity": "0.3556609",
            "sentiment_compound": 0.855
        },
        {
            "id": "h1irmtp",
            "score": 4,
            "text": "It also makes covid-19 much less severe and exponentially decreases your chance for hospitalization and increases your chance for survival. Everyone should be on 5000 IU/day barring any medical issues that would contraindicate.",
            "title_similarity": "0.6787081",
            "sentiment_compound": 0.1761
        },
        {
            "id": "h1ic06u",
            "score": 16,
            "text": "Get sunlight people, I work from home and force myself to stop working and read a book outside for 20 minutes, if you have privacy take your shirt off and roll up your shorts. There’s too many health benefits!",
            "title_similarity": "0.5382508",
            "sentiment_compound": 0.1759
        },
        {
            "id": "h1iayty",
            "score": 33,
            "text": "Scandinavian countries and Ireland have the highest addiction rates in Europe, so that might be related",
            "title_similarity": "0.44576576",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iaehw",
            "score": 4,
            "text": "This is exactly true , but not only addiction to drugs but addiction to other things too.",
            "title_similarity": "0.47627002",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1ibm1g",
            "score": -6,
            "text": "Explains why my wife always calms down when i give her an injection of vitamin D",
            "title_similarity": "0.5522549",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h1j86tm",
            "score": 4,
            "text": "There is also a link between low levels of vitamin D and chronic pain. So you could imagine there would be a cycle in which people with a deficiency get pain, take opioid pain killers and then crave more etc",
            "title_similarity": "0.7472942",
            "sentiment_compound": -0.9337
        },
        {
            "id": "h1ic3j6",
            "score": -7,
            "text": "I have to question that because I was deficient at one point and never craved opioids. Thumbs down on this one.",
            "title_similarity": "0.6063768",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1i9j0l",
            "score": 141,
            "text": "Huh. I live in Appalachia, and my doctor is *always* making sure I'm taking vitamin D because we get very little sunlight. As I'm sure most people know, there's also a huge opioid problem. I wonder to what extent they're interlinked.  \n\n\n[https://www.jaacap.org/article/S0890-8567(19)31888-X/fulltext](https://www.jaacap.org/article/S0890-8567(19)31888-X/fulltext)\n\nEdit: People asking about sunlight in Appalachia.\n\nhttps://www.currentresults.com/Weather/West-Virginia/annual-days-of-sunshine.php\n\nWV gets ~100 sunny days per year.\n\nhttps://www.currentresults.com/Weather/Kansas/annual-days-of-sunshine.php\n\nPicking Kansas for Midwest. ~130 sunny days per year\n\nhttps://www.currentresults.com/Weather/New-York/annual-days-of-sunshine.php\n\nNew York gets less sunny days that WV, but way more partly sunny days.\n\nhttps://www.currentresults.com/Weather/California/annual-days-of-sunshine.php\n\nThere are places in California with 200 sunny days per year.",
            "title_similarity": "0.7559527",
            "sentiment_compound": 0.9278
        },
        {
            "id": "h1ijhl0",
            "score": 29,
            "text": "There are so many different studies noting a link between vitamin D deficiency and poor health, such a prevalence of vitamin D deficiency in so many people, and so few downsides to vitamin D supplementation I feel that it may be time for a renewed national or global campaign of vitamin D enrichment in our food and beverages. \n\nAdding vitamin d to milk nearly eliminated rickets in children when fortification began a century ago.",
            "title_similarity": "0.7794428",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h1i1yxd",
            "score": 14,
            "text": "[https://advances.sciencemag.org/content/7/24/eabe4577](https://advances.sciencemag.org/content/7/24/eabe4577)\n\n\"we report an increased prevalence of vitamin D (VitD) deficiency in   \npatients diagnosed with opioid use disorder and an inverse and   \ndose-dependent association of VitD levels with self-reported opioid use.  \n We used multiple pharmacologic approaches and genetic mouse models and   \nfound that deficiencies in VitD signaling amplify exogenous opioid   \nresponses that are normalized upon restoration of VitD signaling.   \nSimilarly, physiologic endogenous opioid analgesia and reward responses   \ntriggered by ultraviolet (UV) radiation are repressed by VitD signaling,  \n suggesting that a feedback loop exists whereby VitD deficiency produces  \n increased UV/endorphin-seeking behavior until VitD levels are restored   \nby cutaneous VitD synthesis. This feedback may carry the evolutionary   \nadvantage of maximizing VitD synthesis. However, unlike UV exposure,   \nexogenous opioid use is not followed by VitD synthesis (and its opioid   \nsuppressive effects), contributing to maladaptive addictive behavior.\"",
            "title_similarity": "0.8156048",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h1icqxs",
            "score": 16,
            "text": "I play tennis and get at least 8 hours per week outdoors in the summer. My vitamin D level was still low when checked this week despite it being very hot and sunny for the last few months. Now supplementing year round.",
            "title_similarity": "0.40725353",
            "sentiment_compound": 0.6771
        },
        {
            "id": "h1idpw6",
            "score": 196,
            "text": "Could this also affect darker-skinned communities at higher latitudes? I do remember reading that vitamin D deficiencies were more prevalent in black folks at higher latitudes — since their skin doesn’t absorb as much from the sun (being calibrated for sunnier climates).\n\nThis is a huge discovery, if true.",
            "title_similarity": "0.6925781",
            "sentiment_compound": 0.8625
        },
        {
            "id": "h1iclk2",
            "score": 56,
            "text": "Vitamin D deficiency also common in those severely affected by Covid-19.",
            "title_similarity": "0.6394384",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1i77g1",
            "score": 219,
            "text": "I always felt like my withdrawals got better after being in the sun",
            "title_similarity": "0.35319185",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h1ihtqj",
            "score": 34,
            "text": "People are spending more time out of the sun than ever nowadays. I remember my doctor telling me everyone should be taking vitamin D supplements because almost everyone is deficient in it. This may not be a causation for that but just that is kind of the norm now.",
            "title_similarity": "0.7182034",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h1ij7xs",
            "score": 381,
            "text": "I think we greatly under estimate the benefits of sun shine and fresh air. \n\nNature can’t cure opioid addiction, but lack of it can make it worse.",
            "title_similarity": "0.74392974",
            "sentiment_compound": -0.6858
        },
        {
            "id": "h1i7rqe",
            "score": 1092,
            "text": "\"In 2007, Fisher and his team found something unexpected: Exposure to ultraviolet (UV) rays (specifically the form called UVB), causes the skin to produce the hormone endorphin....Endorphin is sometimes called a \"feel good\" hormone because it induces a sense of mild euphoria. Studies have suggested that some people develop urges to sunbathe and visit tanning salons that mirror the behaviors of opioid addicts. Fisher and his colleagues speculated that people may seek out UVB because they unknowingly crave the endorphin rush.\"\n\nSo the sun on your skin literally makes you feel happier? At a basic hormonal level? I had never come across this research before, is this well established?\n\nEdit:\n\nI am consciously happier in the sun, but I'd have guessed feeling happy in the sunshine was a result of enjoying light and warmth and then learning to associate sunshine with positive things.\n\nThis sounds like no mental or emotional processing is required, just UVB on skin= endorphins.",
            "title_similarity": "0.788124",
            "sentiment_compound": 0.9905
        },
        {
            "id": "h1i9rcy",
            "score": 192,
            "text": "This explains Scotland",
            "title_similarity": "0.038589995",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1i45dz",
            "score": 365,
            "text": "I wonder if this could be applied for all addictions or if it’s just opioid. I know once I’m locked up in my house a few days it’s harder to get outside of it.",
            "title_similarity": "0.6972587",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iayw9",
            "score": 4087,
            "text": "Seems like vitamin D just does everything.",
            "title_similarity": "0.39361185",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h1ialsd",
            "score": 1,
            "text": "I hope the findings can be replicated by other researchers; this would truly be ground breaking.",
            "title_similarity": "0.46370053",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h1ialyd",
            "score": 15,
            "text": "How does one check if you're deficienct in any vitamin",
            "title_similarity": "0.5819074",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1id4dm",
            "score": 2,
            "text": "Thank you for sharing this!",
            "title_similarity": "0.0628006",
            "sentiment_compound": 0.68
        },
        {
            "id": "h1idb5v",
            "score": 1,
            "text": "Explains why I felt great walking in the sun this morning. Normally an night owl due to work.",
            "title_similarity": "0.35265046",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1ie71l",
            "score": 1,
            "text": "What are the natural sources to get Vitamin D? Except the Sun of course(Monsoon season here). I don't want to rely on supplements if I can get it directly from food.",
            "title_similarity": "0.6159936",
            "sentiment_compound": 0.5389
        },
        {
            "id": "h1iepdi",
            "score": 47,
            "text": "Helloooooooo Washington State!",
            "title_similarity": "0.18062028",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1if1e2",
            "score": 1,
            "text": "That explains a lot about Ohio.",
            "title_similarity": "0.15663123",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1if26l",
            "score": 1,
            "text": "Guess I’m addicted to opioids now",
            "title_similarity": "0.5696884",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1if2k1",
            "score": 1,
            "text": "Is it me or is it that vitamin D deficiency is the root of alot of health issues.",
            "title_similarity": "0.7166761",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1ifato",
            "score": 2,
            "text": "I work with someone in recovery and they love to go tanning",
            "title_similarity": "0.33197182",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1ifdsn",
            "score": 2,
            "text": "Wow. To fight drug addiction prescribe outdoor time?",
            "title_similarity": "0.50874335",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1iflo2",
            "score": 1,
            "text": "Explains Michigan's love for opiates",
            "title_similarity": "0.43606636",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h1igism",
            "score": 1,
            "text": "Vitamin D is the anti cigarette, it makes everything better",
            "title_similarity": "0.6083795",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1ih5py",
            "score": 1,
            "text": "Good thing I generally refuse all narcotics they offer for my chronic pain. That would have been awful.",
            "title_similarity": "0.6925846",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h1ii1bb",
            "score": 1,
            "text": "Well, that explains Trainspotting.",
            "title_similarity": "0.20218375",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1ii9gp",
            "score": 1,
            "text": "Maybe that explains the high opioid use in prisoners.",
            "title_similarity": "0.64631486",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h1iirpn",
            "score": 3,
            "text": "I work in a lab and I would bet that 75% of people walking around are vitamin D deficient. Especially in winter, they are always low when we run them. Take your vitamin D and get some Sun.",
            "title_similarity": "0.6071429",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h1ijtyr",
            "score": 1,
            "text": "Ah, so that's why Florida works so well on New England addicts.",
            "title_similarity": "0.4458157",
            "sentiment_compound": 0.4101
        },
        {
            "id": "h1il2pr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.16257642"
        },
        {
            "id": "h1il8iw",
            "score": 19,
            "text": "As an opiate addict, this is good information to have, and actually makes sense to me.",
            "title_similarity": "0.490681",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1iliea",
            "score": 1,
            "text": "I wonder if it could also be tied to other addictive behavior.",
            "title_similarity": "0.4235885",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iljym",
            "score": 1,
            "text": "They gotta take it out of the milk here. We’re in a opioid epidemic.",
            "title_similarity": "0.74051255",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1im4tr",
            "score": 1,
            "text": "So what you're saying is I should cut back on the D to increase my high? ^/s",
            "title_similarity": "0.589576",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h1im6or",
            "score": 2,
            "text": "So outdoor exercise was a bit of a natural remedy all along. Doubt it does much if you are violently dope sick though",
            "title_similarity": "0.5269018",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h1imjsk",
            "score": 1,
            "text": "Vit D Deficient most of my life. Whatever about recreational opioids, but medicinal opioids do nothing for me",
            "title_similarity": "0.63510406",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1imjy4",
            "score": 1,
            "text": "this contextualizes living in the pnw so much",
            "title_similarity": "0.18412572",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1imwm6",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.18686053"
        },
        {
            "id": "h1in25e",
            "score": 2,
            "text": "Great against Covid too",
            "title_similarity": "0.38703316",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1inxoo",
            "score": 1,
            "text": "Speaking of cravings, when I was a heavy drinker I craved olives..I would sometimes eat 2-3 jars a week.  I quite drinking a year ago on father's day and haven't had an urge to eat them since.  I do take a daily multivitamin and iron tablet for a deficiency so that also may have something to do with it.",
            "title_similarity": "0.5626673",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1io39i",
            "score": 1,
            "text": "wheres the link to the actual study though? cause its not in that article",
            "title_similarity": "0.3304875",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1io3uv",
            "score": 1,
            "text": "Get your sunlight people!",
            "title_similarity": "0.106941745",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iohqt",
            "score": 1,
            "text": "Has a huge effect on mood and testosterone production for men. I remember when I got my vitamin D levels sorted, I experienced a huge boost in progress in the gym. My mood and well being increased dramatically. I was popping wood like I was 16 ffs.\n\nPeople spend all kinds of $$$$ on supplements when they really just need some vitamin D. 5-7000 IU's daily and you are good to go. I do 5 in the summer months, 7 in the winter. Some people go up to 10,000 in the winter.",
            "title_similarity": "0.5367536",
            "sentiment_compound": 0.946
        },
        {
            "id": "h1ioj5n",
            "score": 1,
            "text": "Well the next question would be where do i get vitamin D from? Like reliably?",
            "title_similarity": "0.5318982",
            "sentiment_compound": 0.7319
        },
        {
            "id": "h1ios8z",
            "score": 1,
            "text": "Suddenly, Alaska makes sense now.",
            "title_similarity": "0.13936275",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ioxxp",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.18686053"
        },
        {
            "id": "h1ip248",
            "score": 1,
            "text": "Remember to take your vitamins yall!",
            "title_similarity": "0.42455515",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ipefh",
            "score": 1,
            "text": "Seems that spending a few hours every few days in the sunlight might be beneficial to people recovering from opiate addiction.  So, part of the rehab process could be going to the beach/pool to hang out and catch some rays.",
            "title_similarity": "0.50850224",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h1ipkec",
            "score": 1,
            "text": "So all these pasty white addicts just need some sun?\n\nWhoda thunk it",
            "title_similarity": "0.6070935",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ippd9",
            "score": 1,
            "text": "Calling bs. Alcohol is more dangerous than opioids.\n\nDo some research to demonize alcohol.",
            "title_similarity": "0.7185607",
            "sentiment_compound": -0.5256
        },
        {
            "id": "h1iq4yc",
            "score": 2,
            "text": "So, in other words, get out in the sun once in awhile.",
            "title_similarity": "0.18356185",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iqhyp",
            "score": 1,
            "text": "I am assuming this refers to the negative effects not the positives of pain relief? I take opioids for pain related to my cancer and just deal with the side effects. I do take Vitamin D as prescribed but I’m not great at remembering since it’s once a week. Is the idea here that my pain relief would be the same but I wouldn’t have so much trouble getting going in the morning?",
            "title_similarity": "0.7732611",
            "sentiment_compound": -0.949
        },
        {
            "id": "h1iqwxu",
            "score": 1,
            "text": "So that is why Oslo is the Heroin Capitol of the world.",
            "title_similarity": "0.49497223",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h1irht3",
            "score": 1,
            "text": "They should come to Ireland to test in the summer, junkies are in the sun all day and doesn't stop them wanting more",
            "title_similarity": "0.36598897",
            "sentiment_compound": 0.2235
        },
        {
            "id": "h1irl1m",
            "score": 1,
            "text": "It can also lead to kidney issues later in life from low albumin according to studies anyway. \n\nI have chronic low vit d and now have a kidney infection for the first time. My grandmother is dying of kidney disease currently and her mother also had kidney issues. \n\nI get plenty of sun, etc. But I have a metabolic disorder and low anion gap. With a metabolic disorder you don't make enough of the right things no matter what. \n\nhttps://www.kidney.org/news/newsroom/nr/Low-Vitamin-D-Levels-Linked-to-Early-Signs-of-KD",
            "title_similarity": "0.7181636",
            "sentiment_compound": -0.8992
        },
        {
            "id": "h1irnc7",
            "score": 1,
            "text": "My mom, my shrink and my neurologist all recommended it!",
            "title_similarity": "0.3663154",
            "sentiment_compound": 0.2714
        },
        {
            "id": "h1irqv9",
            "score": 1,
            "text": "Look to be honest I find this correlation rather than causation. Not everyone that had a vitamin d deficiency craves opioids. \n\nI think that a majority of addicted opioid users would remain inside most of the time.",
            "title_similarity": "0.6477667",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h1is0im",
            "score": 1,
            "text": "Is that why opioids are so bad in Ohio?? We're just some random midwestern state with a few moderately big cities, yet Ohio is one of the worst in the country for the opioid crisis. We are also all severely vitamin D deficient, all of us. That's not a joke, ask any medical professional here who's done bloodwork, everyone has a vitamin D deficiency if they're not already being treated for one.",
            "title_similarity": "0.750152",
            "sentiment_compound": -0.9386
        },
        {
            "id": "h1is0iu",
            "score": 1,
            "text": "Good thing there’s plenty of vitamin D in jail where most opioid addicts are...oh wait",
            "title_similarity": "0.5894586",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1isgj9",
            "score": 1,
            "text": "I need some opium to see if I have a vitamin d deficiency doc",
            "title_similarity": "0.6914681",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1isjjw",
            "score": 1,
            "text": "Note to opiod dealers coat your opioids with vitamin D.",
            "title_similarity": "0.63988817",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1isr93",
            "score": 1,
            "text": "Now I see why some pasty white kids in the Midwest want it so bad...",
            "title_similarity": "0.54810613",
            "sentiment_compound": -0.5413
        },
        {
            "id": "h1ist0y",
            "score": 1,
            "text": "We all need a bit of sunshine in life",
            "title_similarity": "0.2451785",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1isuj2",
            "score": 1,
            "text": ">As tribes of humans migrated north during prehistoric times, an evolutionary alteration might have been needed to compel them to step out of caves and into the sunshine on bitterly cold days.\n\nBut then why would they test their hypothesis in mice? And what about humans who lived in areas of the world with an abundance of sunshine (near the equator)? Would there be a need for such an evolutionary alteration?",
            "title_similarity": "0.5118455",
            "sentiment_compound": 0.7131
        },
        {
            "id": "h1isv72",
            "score": 1,
            "text": "I love how when we discover basic fundamentals like not getting enough sunlight which is true and that low vitamin D3 is bad for you, also true in many ways, this is already studied and found to be the case, but more research is needed and not much is being done, but it should be.\n\nRecord numbers of people are staying inside and wearing sunscreeen, it's not hard to work out how this would be bad for health.\n\nYet it gets ridicule and made fun of and not taken seriously by those that should... it's just very very strange to see obvious facts being undermined like this and really it just looks immature and childish.\n\nObviously the non academic non medical can make fun of such things, but to see professional do it and even doubt the lack of vitamin d3 is a problem... I think we need to seriously look at the evidence and do more testing of peoples nutrition levels and take action, there's definitely something there which is effecting human health on mass and costing us allot of money by not addressing this, it's like profits by people being sick is more important, disturbing.",
            "title_similarity": "0.7629554",
            "sentiment_compound": -0.6771
        },
        {
            "id": "h1it153",
            "score": 1,
            "text": "New opioid treatment from Purdue, Vitamin D, $6,000 per pill",
            "title_similarity": "0.534197",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1itm8s",
            "score": 1,
            "text": "no wonder ohio has such a problem, we get no sunlight",
            "title_similarity": "0.39240924",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h1itsxa",
            "score": 1,
            "text": "This explains the whole population of Iceland",
            "title_similarity": "0.10009851",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1itt8k",
            "score": 1,
            "text": "Vitamin D is the new Vitamin C",
            "title_similarity": "0.52918535",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1iu0wj",
            "score": 1,
            "text": "Is this why junkies will Just hang out in the hot sun for hours?",
            "title_similarity": "0.34107503",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iu7mk",
            "score": 1,
            "text": "Does it means I should live in California?",
            "title_similarity": "0.20653957",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iubnj",
            "score": 1,
            "text": "The Midwest Opioid Crises makes more sense every day.  The lack of sunshine in MI and OH, among others, is BRUTAL.",
            "title_similarity": "0.62942",
            "sentiment_compound": -0.6037
        },
        {
            "id": "h1ivj5x",
            "score": 2,
            "text": "Interesting stuff. I was reading a book on opium and opioid addiction years ago. One thing I remember that stuck out was the mention of a study showing large amounts of alcohol had an opioid effect and interaction on the brain. They brought it up in the context of using controlled opioid therapy to ween severe alcoholics. But in this context I would wonder if alcoholism and opioid addiction would have similar interactions with vitamin D.",
            "title_similarity": "0.7418071",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h1ix1li",
            "score": 1,
            "text": "Coming soon to a \"pull that up Jamie\"",
            "title_similarity": "0.1387125",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ixenz",
            "score": 1,
            "text": "Makes sense why the opioid crisis is so much worse in the North",
            "title_similarity": "0.6751777",
            "sentiment_compound": -0.8166
        },
        {
            "id": "h1ixx8i",
            "score": 1,
            "text": "I was in the hospital very recently due to alcoholism. I was kept longer because of several deficiencies...like two days of being pumped with things.\n\n Working from home, not going outside or moving plus alcohol almost killed me.\n\nGet your vitamins... naturally if at all possible. D is a very important one.",
            "title_similarity": "0.6862553",
            "sentiment_compound": -0.4791
        },
        {
            "id": "h1iyhze",
            "score": 1,
            "text": "It's almost like a miserable, unnatural state of living for human beings has detrimental effects on them.",
            "title_similarity": "0.5207427",
            "sentiment_compound": -0.1851
        },
        {
            "id": "h1iyrdz",
            "score": 1,
            "text": "I can see that. I became an addict while working overnights, had been for years before ever touching opiates",
            "title_similarity": "0.49237",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1iyrtl",
            "score": 1,
            "text": "Vit d deficiency is basically bad for everything it seems",
            "title_similarity": "0.54517156",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h1iz3i3",
            "score": 1,
            "text": "High doses of Vitamin C also help with withdrawals. I don’t fully understand why but it can partially bind to the mu-opioid receptor acting almost like a partial antagonist like suboxone does. It won’t make them fully go away like suboxone would but it can help with the restless legs, muscle pains and chronic fatigue.",
            "title_similarity": "0.7472577",
            "sentiment_compound": 0.4599
        },
        {
            "id": "h1j1unt",
            "score": 1,
            "text": "I thought I read some where that actual opiate abuse depletes vit D stores.  So, you're depleting your stores, and craving the opiates even more so.",
            "title_similarity": "0.7484994",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h1j3bf4",
            "score": 1,
            "text": "I take to vitamin D a day. Is this why my heroin doesn’t work?",
            "title_similarity": "0.7266333",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1j3uyt",
            "score": 1,
            "text": "So basically… just go outside",
            "title_similarity": "-0.07591241",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j3xx5",
            "score": 1,
            "text": "Fun fact: Vitamin D is technically not a vitamin, because the body can synthesize it with the help of sunlight (UVB).",
            "title_similarity": "0.5827589",
            "sentiment_compound": 0.744
        },
        {
            "id": "h1j40mt",
            "score": 1,
            "text": "\"strongly exaggerates\"\n\n\"potentially\"\n\nWhen did these words start becoming fact and news worthy. \n\nI can also \"potentially\" grow wings tomorrow, but it \"potentially\" won't.",
            "title_similarity": "0.502031",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1j48tp",
            "score": 1,
            "text": "Wow. Hit up any detox/rehab in the US and they’ll tell you that. “Studies show” is the universal language for “oh, guess what I just learned “",
            "title_similarity": "0.49300933",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h1j4f6w",
            "score": 1,
            "text": "Vitamins and minerals are more important than ever.",
            "title_similarity": "0.4423982",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h1j4h6c",
            "score": 1,
            "text": "I have a rare form of cancer. I'm on 2 different chemos and I have to do wound therapy (hyperbaric) for the massive ulcers on my legs. I have 9 different doctors and their main concern always seems to be my vitamin D levels.",
            "title_similarity": "0.647709",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h1j4lg9",
            "score": 2,
            "text": "Why is this okey to state but not that it helps with severe covid?",
            "title_similarity": "0.593365",
            "sentiment_compound": -0.7332
        },
        {
            "id": "h1j588u",
            "score": 1,
            "text": "That would explain Scotland and heroin.",
            "title_similarity": "0.3198439",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h1j5emf",
            "score": 1,
            "text": "Sweet, between unknown amount of free will and this vitamin d thing nothing is my fault! Thanks Reddit!",
            "title_similarity": "0.5855366",
            "sentiment_compound": 0.9266
        },
        {
            "id": "h1j5mzh",
            "score": 1,
            "text": "So, would people who live in more overcast regions be more susceptible to narcotics?",
            "title_similarity": "0.55612546",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j5prf",
            "score": 1,
            "text": "How is that when crackheads walk the streets and are out in the sun all day?",
            "title_similarity": "0.25012124",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1j5xef",
            "score": 2,
            "text": "When I was addicted to heroin 7 years ago I remember nights when I scored a decent bag and then sat on the couch and would chug whole milk. Always wondered why those moments were so blissful",
            "title_similarity": "0.57274437",
            "sentiment_compound": 0.4198
        },
        {
            "id": "h1j6gos",
            "score": 1,
            "text": "So that's why we have so many mad junkies in Scotland",
            "title_similarity": "0.41831747",
            "sentiment_compound": -0.539
        },
        {
            "id": "h1j7deh",
            "score": 1,
            "text": "Well that explains the Pacific Northwest...",
            "title_similarity": "0.1835662",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1jafeq",
            "score": 1,
            "text": "I wonder if there’s any correlations to redheads and their ability to absorb vitamin D quicker and their resistance to opioids.",
            "title_similarity": "0.7195117",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h1jaydw",
            "score": 1,
            "text": "Sounds interesting. Am not a doctor or anything, but I am convinced vit. D is an essential part of maintaining general health and well being, in addition to a helping immune system be strong. But I wonder, could there also be a correlation and not variation effect along these lines.... You go out to say exercise / socialise / be in nature / etc, at least partly doing this in daytime too. This causes you to absorb more vit. D. Due to these other reasons, your general mental state is also more positive and your chances of dependence on habit forming drugs is lowered. So it's is also (or more), the psychological effects that keep addiction at bay - not simply the vit. D levels per se in one's body?",
            "title_similarity": "0.6943157",
            "sentiment_compound": 0.9747
        },
        {
            "id": "h1jb5ge",
            "score": 1,
            "text": "This makes me wonder about vitamin D levels in post surgical patients with difficult to control pain.   I wonder if normal vitamin D levels make the opioids less effective.",
            "title_similarity": "0.8080101",
            "sentiment_compound": 0.1045
        },
        {
            "id": "h1jbqpo",
            "score": 1,
            "text": "Welp, that would explain Seattle..",
            "title_similarity": "0.1889191",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jbslx",
            "score": 1,
            "text": "yes it does, taking multivitamins reduces the craving when wheening yourself off this stuff",
            "title_similarity": "0.5876864",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h1jc05f",
            "score": 1,
            "text": "Yea this seems to be related to calcium regulation which is a major problem in a lot people today. \n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC5529228",
            "title_similarity": "0.6240077",
            "sentiment_compound": -0.4576
        },
        {
            "id": "h1jceix",
            "score": 1,
            "text": "Effect on craving for sugar?",
            "title_similarity": "0.404519",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jcz5j",
            "score": 2,
            "text": "76% of black people in america are Vitamin D deficient.",
            "title_similarity": "0.51106036",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1jd3l2",
            "score": 1,
            "text": "And vitamin D also reduces the severity of the symptoms of Covid-19. Clearly I should have invested in a vitamin D manufacturer instead of Bitcoins.",
            "title_similarity": "0.7750261",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h1jdbnf",
            "score": 1,
            "text": "Kinda cool. Endorphins also bind to opioid receptors. As someone who is exercise dependant this could maybe explain why I feel better on the days I exercise in the sun",
            "title_similarity": "0.506425",
            "sentiment_compound": 0.6003
        },
        {
            "id": "h1jdouc",
            "score": 1,
            "text": "Too many issues with the lack of the D. Damn",
            "title_similarity": "0.43290997",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h1jdx6i",
            "score": 1,
            "text": "Well that explains Glasgow then, interesting.",
            "title_similarity": "0.0888363",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h1je4rd",
            "score": 1,
            "text": "The real study happens at BMC",
            "title_similarity": "0.2040095",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1je8qo",
            "score": 1,
            "text": "probably bc deficiency in that vitamin contributes to depression. so someone trying to correct that somehow may notice opioids help (although opiates in particular do this badly, temporarily). this pattern is why some people’s substance use can abate after they’re successfully treated for depression and such.",
            "title_similarity": "0.76606524",
            "sentiment_compound": -0.6027
        },
        {
            "id": "h1jekkn",
            "score": 1,
            "text": "Smoke some weed and go for a walk.",
            "title_similarity": "0.13050464",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jelid",
            "score": 1,
            "text": "I'm curious if there really are certain people that simply do not have an addictive personality or physiology. My observation of myself is of course 100% anecdotal, but I've had cigarettes all my life on occasion and never once felt a craving for them. Currently I haven't had one in years, but I could have one tomorrow if I felt like it and not have another for 10 more years. I'm also currently on opioids and also have somewhat of a vitamin D deficiency according to my doctors. I've never really felt addicted to the opioids. I have significant pain that would be much worse without them but I think it I had to ween myself off them I could probably do it without much issue. I would definitely need something like weed to replace it but it would only be because of the pain.",
            "title_similarity": "0.5771339",
            "sentiment_compound": 0.2367
        },
        {
            "id": "h1jgwnu",
            "score": 1,
            "text": "So cut back on the Vitamin D to get the most out of my opioids.  Got it.",
            "title_similarity": "0.74105996",
            "sentiment_compound": -0.0498
        },
        {
            "id": "h1jhn98",
            "score": 1,
            "text": "You hear that? Get outside and get some sun.",
            "title_similarity": "0.057008058",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jhqtt",
            "score": 1,
            "text": "So I guess we just figured why Vancouver has such a large opioid crisis",
            "title_similarity": "0.58189404",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h1ji6n1",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.18686053"
        },
        {
            "id": "h1jijxt",
            "score": 1,
            "text": "That should serve to explain vampires and blood.",
            "title_similarity": "0.3927374",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jisvg",
            "score": 1,
            "text": "oh thats why vampires are addicted to blood",
            "title_similarity": "0.5365433",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jj9ia",
            "score": 1,
            "text": "Don't let the \"just go outside, it will fix all your problems\" crowd see this.",
            "title_similarity": "0.49030325",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h1jjetg",
            "score": 1,
            "text": "Okay r/science, lay it on me. What flaw does this study have?",
            "title_similarity": "0.5351473",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h1jjy38",
            "score": 1,
            "text": "Thanks but now I have a Vitamin D addiction. Can't go longer than 3 weeks without Vitamin D.",
            "title_similarity": "0.55275315",
            "sentiment_compound": 0.3438
        },
        {
            "id": "h1jk6wt",
            "score": 1,
            "text": "Fixing my vitamin D deficiency was an attempt to help my depression and slow my MS. But it ended up also helping me quit drinking. This article is very interesting.",
            "title_similarity": "0.7286967",
            "sentiment_compound": 0.7839
        },
        {
            "id": "h1jkbav",
            "score": 1,
            "text": "Ironically, guess what at one point (and still may be) was a popular cut for heroin? Vitamin D powder. In Philly 11 years ago when I was on dope sometimes it would taste like flintstones vitamins vaguely (when you lick the bags, snort it, or even briefly right after you shoot up you can taste it) and some old junkie told me it's Vitamin D as the cut. We called it \"Vitamin H.\"",
            "title_similarity": "0.708196",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1jkcl3",
            "score": 1,
            "text": "Just went out and got my friend some, he needs it",
            "title_similarity": "0.30037194",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1jlxgq",
            "score": 1,
            "text": "When I worked the 3rd shift I routinely would take sleep aid to knock out around 5 am and sleep well into the afternoon to be ready for the next shift. What I mean by routinely was a heavy amount because while trying to sleep when the sun cracked made it extremely difficult. This went on for a few years and I will say I was dependent on it.",
            "title_similarity": "0.5330017",
            "sentiment_compound": 0.204
        },
        {
            "id": "h1jm2sj",
            "score": 1,
            "text": "I live in Arizona, which used to be referred to as the \"skin cancer capitol of the world\", yet I know many here who were told they're vitamin D deficient.  Weird how that works. Like we went too far the other way.",
            "title_similarity": "0.7202549",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1jmex6",
            "score": 1,
            "text": "Ahhh yes….D, or as I call it “Bone Juice”",
            "title_similarity": "0.28552428",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jpecl",
            "score": 1,
            "text": "Could climate, like cloudy, rainy areas where vitamin D deficiency is more common also have an effect on opioid usage rates?",
            "title_similarity": "0.7358037",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1jqbjd",
            "score": 1,
            "text": "I got your vitamin D right h... What's that? Wrong subreddit? Sorry.",
            "title_similarity": "0.63418794",
            "sentiment_compound": -0.3736
        },
        {
            "id": "h1jqq0k",
            "score": 1,
            "text": "Makes a lot of sense based on my personal situation",
            "title_similarity": "0.23364457",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jqt1y",
            "score": 1,
            "text": "Vitamin D deficiency turns out to be the root of all the evil in every sense",
            "title_similarity": "0.59798664",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h1jrfwa",
            "score": 1,
            "text": "I’m not an addict, but nothing makes me happier than a day off work when it’s bright and sunny. Like, I’m overjoyed when I get to be outside in the sunshine.\n\nMaybe it’s because I’m an OR nurse and never see the light of day at work.",
            "title_similarity": "0.45562983",
            "sentiment_compound": 0.9551
        },
        {
            "id": "h1js1om",
            "score": 1,
            "text": "That boy need some MILK!",
            "title_similarity": "0.4100963",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1js46e",
            "score": 1,
            "text": "Did no one bother to look at the confidence interval of their statistical analysis?? It’s literally not statistically significant so all claims could be due to other factors.",
            "title_similarity": "0.48613957",
            "sentiment_compound": 0.4412
        },
        {
            "id": "h1js5us",
            "score": 1,
            "text": "Interesting. From an evolutionary perspective, it could potentially be related to mother's milk containing both vit D and casomorphins, but that's just my first thought.",
            "title_similarity": "0.5839615",
            "sentiment_compound": 0.2144
        },
        {
            "id": "h1js77t",
            "score": 1,
            "text": "I wonder if this is part why the Pacific north west has a seemingly worse opioid crisis. More overcast skies. Also helps sparkling vampires hide in broad daylight.",
            "title_similarity": "0.67137516",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h1jt7l4",
            "score": 1,
            "text": "I remember when my best friend was trying to get clean for the first time in 2006 his doctor prescribed him vitamin D supplements.",
            "title_similarity": "0.58528066",
            "sentiment_compound": 0.9062
        },
        {
            "id": "h1jtvab",
            "score": 1,
            "text": "“He needs some milk!”",
            "title_similarity": "0.3854437",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ju1pa",
            "score": 2,
            "text": "So… just take vitamin D with your drugs and you’ll be alright?",
            "title_similarity": "0.5805186",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h1juee7",
            "score": 1,
            "text": "I know this is not proof of anything but a little over a year ago I committed to making SURE I had enough vit D and the results have blown my mind (less depression, more energy, great sleep, hair growing back, better skin, etc) but another thing is I no longer crave opiates when I get aches and pains like I used to. As a former addict who also developed a dependency, I assumed I had just \"outgrown\" the cravings over time and namely because I can't get access any longer but it IS coincident with my taking proper, daily levels of D.",
            "title_similarity": "0.73175",
            "sentiment_compound": 0.9001
        },
        {
            "id": "h1jv70y",
            "score": 1,
            "text": "Most people I know are so afraid of skin cancer they avoid being outside as much as possible which I never understood. I always feel way better after being outside a while. Can’t imagine that benefit is less than the skin cancer risk.",
            "title_similarity": "0.62058127",
            "sentiment_compound": -0.802
        },
        {
            "id": "h1jvq14",
            "score": 1,
            "text": "this is actually pretty interesting. I did have a problem with opiates in my early twenties, but I also got a lot of outside time and sun then. That was quite some time ago though. Coincidentally, earlier this year I learned that my body doesn't actually make its own vitamin D. I don't have an opiate addiction anymore (yay!), BUT I *was* having tetanic seizures due to such low (virtually nonexistent) vitamin D levels, meaning my body couldn't process any calcium. Taking a simple supplement has made vast improvements to my health in multiple ways. It's shocking how important vitamin D is!",
            "title_similarity": "0.7086854",
            "sentiment_compound": 0.9278
        },
        {
            "id": "h1jwatb",
            "score": 1,
            "text": "Does it also make me crave chick fil a? \n\nSerious, I take vitamin D pills due to a deficiency and I feel like my cravings are horrible if I’ve been inconsistent in taking my vitamins.",
            "title_similarity": "0.8025664",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h1jwe8t",
            "score": 1,
            "text": "*screaming in scottish*",
            "title_similarity": "0.17089829",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h1jy87k",
            "score": 1,
            "text": "I’m old enough to remember when vitamin C was the cure for everything.",
            "title_similarity": "0.40545315",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1jy8l0",
            "score": 1,
            "text": "This looks to me just like a try to deny the responsibility on opioids addiction that pharma companies create and made profit of.",
            "title_similarity": "0.7708328",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1jyhif",
            "score": 1,
            "text": "Yet another side effect of the last 30 years. We were all told the sun will kill you, now they tell us no sun will kill you.",
            "title_similarity": "0.62925184",
            "sentiment_compound": -0.9118
        },
        {
            "id": "h1jyhqt",
            "score": 1,
            "text": "So make sure when I’m shooting up to drink plenty of milk? Too easy",
            "title_similarity": "0.4789182",
            "sentiment_compound": 0.6682
        },
        {
            "id": "h1jynao",
            "score": 1,
            "text": "Is that why people in the north are so bummed out?",
            "title_similarity": "0.41481835",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jyrx6",
            "score": 1,
            "text": "Seattle and Connecticut: explained.",
            "title_similarity": "0.21373987",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1jyz63",
            "score": 1,
            "text": "(I?)LPT: become Vitamin D deficient to make your heroin last longer",
            "title_similarity": "0.82297444",
            "sentiment_compound": -0.25
        },
        {
            "id": "h1k0gqg",
            "score": 1,
            "text": "Thank god we haven’t been excessively indoors for the last year…",
            "title_similarity": "0.32374573",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h1k0uc0",
            "score": 1,
            "text": "Wait a minute, you mean humans arent supposed to be spending all day every day inside?",
            "title_similarity": "0.34587494",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k1zkl",
            "score": 1,
            "text": "Wow, so many applications, one might even say that vitamin D's nuts!",
            "title_similarity": "0.6022551",
            "sentiment_compound": 0.6114
        },
        {
            "id": "h1k2o4p",
            "score": 1,
            "text": "Been saying for years (as a Floridian), that I have to wonder why so many recovered addicts that I meet are here from the NE and Midwest.  It seems far more recovered alcoholics are from FL (touristy party industry), but the opioid recovered are from cold, darker regions.",
            "title_similarity": "0.5824024",
            "sentiment_compound": 0.2144
        },
        {
            "id": "h1k2vm0",
            "score": 1,
            "text": "Less vitamin d and my percs get stronger?? Cool!! Cya later sun!",
            "title_similarity": "0.57268614",
            "sentiment_compound": 0.7931
        },
        {
            "id": "h1k367t",
            "score": 1,
            "text": "Is this why morphine did nothing for me while I was recovering from surgery?",
            "title_similarity": "0.6281198",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1k52sh",
            "score": 1,
            "text": "Vitamin d nowadays is being called a \"hormone\" rather than a \"vitamin\" because it's made in our skin from sunlight.\n\nThere have been studies lately which show that vitamin d does play a role in improving mood and reducing anxiety and depression. Studies have also shown that vitamin d helps to improve immunity and digestion and thus helps to reduce the chance of getting colon cancer. It seems to be somewhat true from at least my own experience with anxiety and ibs.\n\nWell they say that going out in the sun brightens up your day. I think they are right.",
            "title_similarity": "0.67764235",
            "sentiment_compound": 0.9404
        },
        {
            "id": "h1k6jr3",
            "score": 1,
            "text": "Does this mean high doses of vitamin D can reduce opioid cravings?",
            "title_similarity": "0.73193",
            "sentiment_compound": 0.296
        },
        {
            "id": "h1k739j",
            "score": 1,
            "text": "I remember taking shrooms and sitting in the sun and I accidentally said the John Denver line. I literally thought “sunshine on my shoulder makes me happy” and finally understood the mood of that song",
            "title_similarity": "0.40965953",
            "sentiment_compound": -0.34
        },
        {
            "id": "h1k7fl0",
            "score": 1,
            "text": "Oh just great. First the DEA went after opioids for \npeople dealing with severe pain. Now just wait, the DEA will go after our vitamin D.",
            "title_similarity": "0.7698943",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h1k81tu",
            "score": 1,
            "text": "When I had to go to the pain doctor after a car accident the first thing they did was blood work and a vitamin D prescription alongside my opioid prescription.  I wonder if this has been kind of known in the field but they haven’t been positive until now.",
            "title_similarity": "0.6954223",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h1k918f",
            "score": 1,
            "text": "That makes a whole lot of sense to me personally. It's been years since I stopped using opioids, but I've had a Vitamin D deficiency for some time. I even take a Vitamin D supplement daily with breakfast, still low in my blood tests. \n\nI would never start using again, but that doesn't mean the urge doesn't come randomly. Makes me wonder if my deficiency has anything to with that urge.\n\nInteresting.",
            "title_similarity": "0.6855718",
            "sentiment_compound": 0.7227
        },
        {
            "id": "h1kbudk",
            "score": 1,
            "text": "Well that explains why my Dr. Was super worried about my abnormally low vitamin d lvls",
            "title_similarity": "0.76989615",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h1kbz0n",
            "score": 1,
            "text": "Is this also true for Dopamine?",
            "title_similarity": "0.4294149",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h1kd0yy",
            "score": 1,
            "text": "Actually this explains my experience with opiates when I had a broken leg that couldn't be casted and therefore constantly got jostled slightly. I was only on opioid for a few weeks when I suddenly started tk like, be physically incapable of happiness until I took them. After I got off of them my body seemed to have a really hard time creating dopamine by itself (basically, withdrawal but where I couldn't do things like orgasm, or literally feel happiness, I just felt like, empty when I would normally have felt good, I was really jittery and uncomfortable for a while after).\n\nI eventually ended up having to wean myself off of them because I just could not function without them. \n\nI have chronically low vitamin D for various medical reasons and I also couldn't go anywhere of course while my leg was broken. I couldn't figure out why I seemed to get so addicted so quickly, and now I feel like this might explain it. I don't tend to have an addictive personality, when I quit smoking after smoking for 3 years I did it cold turkey and had little craving, I've never experienced any other form of addiction to my knowledge, so it was a little strange even accounting for the fact that opioid are incredibly addictive.",
            "title_similarity": "0.69794905",
            "sentiment_compound": 0.6445
        },
        {
            "id": "h1kdf8x",
            "score": 1,
            "text": "So as a Baker I can blame society's demand for fresh bread early morning, I'll settle out of court, for a job in a cafe near Holland or maybe in The Netherlands even Amsterdam is acceptable!",
            "title_similarity": "0.5766021",
            "sentiment_compound": 0.2481
        },
        {
            "id": "h1ke7ah",
            "score": 1,
            "text": "Gingers who make the most vitamin D on their own:  \"You have no power here.\"",
            "title_similarity": "0.60444313",
            "sentiment_compound": 0.0754
        },
        {
            "id": "h1keb8d",
            "score": 1,
            "text": "This is truly terrifying news.",
            "title_similarity": "0.3188867",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h1keqh9",
            "score": 2,
            "text": "Congratulations u/thebelsnickle1991 ! Your post was the top post on r/science today! (06/12/21)\n\nTop Post Counts: r/science (1) \n\n*This comment was made by a bot*",
            "title_similarity": "0.47269458",
            "sentiment_compound": 0.7955
        },
        {
            "id": "h1kewwc",
            "score": 1,
            "text": "Then why so many dope heads in the dumb-shine state?",
            "title_similarity": "0.50849605",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1khdvn",
            "score": 1,
            "text": "I had my vitamin D checked 2 weeks ago and it was at 17. That's the equivalent of an old lady in a nursing home who can barely move. I'm 32. \n\nI'm a chronic pain sufferer and that's caused me major depression. I'm on supplements now and I've started walking around the nearby park and I actually do feel like I'm starting to improve.\n\nI was addicted to caffeine, which I recently broke, and am a heavy cannabis smoker. They aren't opioids but I'm an addict.",
            "title_similarity": "0.6497886",
            "sentiment_compound": -0.5017
        },
        {
            "id": "h1kj9bv",
            "score": 1,
            "text": "Having vitamin D deficiency sucks. I have a huge deficiency (cant remember the number, but i had to take a dose of 1600IU a day for a month, and now it's 800IU a day, plus an order to be out in the sun for a while when it's here). It's terrible. Huge cravings, terrible motivation, sweaty hands, huge depressive periods, shortened growth, weight gain, weaker immune system, bad sleeping, etc.\n\nAll of this loops and creates a very bad cycle, and it has lasted for several years. I urge people to check their vitamin d levels with their doctors and make sure they're healthy, because these issues can create bigger issues. It's not fun.",
            "title_similarity": "0.6796483",
            "sentiment_compound": 0.4111
        },
        {
            "id": "h1kkgvb",
            "score": 1,
            "text": "Is there some kind of MLM that sells Vitamin D or something? This is getting out of hand.",
            "title_similarity": "0.675928",
            "sentiment_compound": 0.2439
        },
        {
            "id": "h1klb36",
            "score": 1,
            "text": "This makes trainspotting way more understandable.",
            "title_similarity": "0.24880454",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kmrxo",
            "score": 1,
            "text": "I only started taking it after I got covid, I don't take it daily though. Because I get my fair share of sunshine everyday. But Vitamin D will come in handy for Canadian winter",
            "title_similarity": "0.48945215",
            "sentiment_compound": 0.7311
        },
        {
            "id": "h1kn9jr",
            "score": 1,
            "text": "wait so am i dumb or does vitamin D before opiates make it stronger? someone answer",
            "title_similarity": "0.74236333",
            "sentiment_compound": 0.0609
        },
        {
            "id": "h1knmbn",
            "score": 1,
            "text": "Headline should read: Scientists discover another reason why being a ginger is awesome",
            "title_similarity": "0.5418792",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h1kqmrf",
            "score": 1,
            "text": "Vitamin D(ick) or vitamin D (sun)?",
            "title_similarity": "0.5033809",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h1ksfam",
            "score": 1,
            "text": "Is this for those who are already addicts or are the rest of us going to suddenly start craving percs if we stay inside too long?",
            "title_similarity": "0.6773982",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1ktc34",
            "score": 1,
            "text": "I wonder if there is any tie to alcoholism and Vitamin D???",
            "title_similarity": "0.62499523",
            "sentiment_compound": 0.4098
        },
        {
            "id": "h1ktrok",
            "score": 1,
            "text": "Well this explains Portland.",
            "title_similarity": "0.13656229",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h1kwwz9",
            "score": 1,
            "text": "If you aren’t taking 4000 IU of vitamin D every day then maybe you should be! Talk to your doctor. Or just take the damn thing.",
            "title_similarity": "0.689963",
            "sentiment_compound": -0.2003
        },
        {
            "id": "h1kxwgf",
            "score": 1,
            "text": "That lady was right! He DID need some milk!",
            "title_similarity": "0.43058714",
            "sentiment_compound": 0.0
        },
        {
            "id": "h1kzyj0",
            "score": 1,
            "text": "Whelp. I'm boned. Nothing makes me happier than seeing snow or rain as an 'excuse' to sit inside and play guitar or videogames all day.",
            "title_similarity": "0.42217827",
            "sentiment_compound": -0.0196
        },
        {
            "id": "h1l0d7r",
            "score": 2,
            "text": "In related news, people who sleep all day after doing drugs all night need to get more sunshine.",
            "title_similarity": "0.60815513",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h1l17vg",
            "score": 1,
            "text": "Is this part or why Heroin was such a problem in the Pacific Northwest?",
            "title_similarity": "0.5821473",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h1l27si",
            "score": 1,
            "text": "My blood work taken at rehab had shown a vitamin D deficiency. Interesting.",
            "title_similarity": "0.73124754",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h1l45zp",
            "score": 1,
            "text": "So vampires are screwed.",
            "title_similarity": "0.43232942",
            "sentiment_compound": -0.5367
        },
        {
            "id": "h1l79ya",
            "score": 1,
            "text": "I guess I'm the abnormal one. I've had a bulging disk against my sciatic nerve for a while. Intermittently it's miserable, and my doctor prescribes opioids. The last time it worked very well and I was operating 80-90% in just a day or two. Felt darn good. After they ran out I just switched to ibuprofen and I felt no drop-off or desire to go back to the opioids. \nShortly after, I was walking in Manhattan and the woman in front of me stepped off the curb into a pot hole and broke her ankle (painfully obvious). As her husband took care of her I carefully stepped over the pothole. And where I stepped was slicker than oil and I slid - you guessed it - right into the pothole, and *almost* broke my ankle. I suspect what she also did. Severely sprained; lucky I didn't rip tendons. Also lucky I was already on my way to the doctor. I still had to take the train home, so we agreed I'd keep my boots laced tightly, ice the hell out of it, and see my orthopedist the next day if it got worse. I even limped the mile back to the train, and then home from it. 75% of the foot and ankle were nasty purple, but it was *just* a sprain.\nThe reason for both those tedious reports was that at my annual physical soon after, it turned out my vitamin D was low. Not low like 20ng/ml (barely acceptable). Not very low, like 10 ng/ml. But *5 ng/ml*. Doc had never had a patient that low.\nSo, despite having barely any vitamin D, I had no problem whatsoever with opioid (sample size: 1), and my bones were still strong enough to withstand a mishap better than another person. Again, lacking any other empirical evidence.\nBut I'm also a statistician, and I know anecdotal evidence is really no evidence. Just a noteworthy(?) oddity.",
            "title_similarity": "0.6856066",
            "sentiment_compound": 0.5142
        },
        {
            "id": "h1laqwc",
            "score": 1,
            "text": "Wow, so you're telling me people who are depressed(which happens in anyone with lack of vitamin d as it is almost necessary for happiness) are more likely to acquire a dependence on something that makes them feel good?? Oh my god, absolutely groundbreaking news.  I cant wait to learn more outstanding nee things tommorow",
            "title_similarity": "0.78161967",
            "sentiment_compound": 0.9493
        },
        {
            "id": "h1lfpnh",
            "score": 2,
            "text": "Could this be the same reason why anesthesia is less effective in us red heads? What with the naturally produced Vitamin D?",
            "title_similarity": "0.8093665",
            "sentiment_compound": 0.6561
        },
        {
            "id": "h1pej0i",
            "score": 1,
            "text": "Vita d deficient is a huge problem right now because we’ve all been stuck inside for the past year. On the other hand my doc said I need to take vita d pills because my levels are low…so ya I’m taking the pill. At no point am I sitting there going..”ok I gotta take my daily vita d….let’s take some Valium also.”",
            "title_similarity": "0.73823726",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h1yc9gg",
            "score": 1,
            "text": "Another reason to make sure you're getting enough Vitamin D3 👍",
            "title_similarity": "0.5432135",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h4kqcir",
            "score": 1,
            "text": "So if I were to avoid the sun for a few months and then pop some oxy, it would get me higher than normal? Cool.",
            "title_similarity": "0.5974237",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h4rf0zg",
            "score": 1,
            "text": "I have  a vitamin D deficiency and taking any opiate has never made me sell my mothers refrigerator or any other odd thing this epidemic make white people do. \nOxyContin  just really does something for them, I’m not sure what it is… I’ll admit, morphine was nice when I was in dire pain, but I took it and left it. I have family that was on heroin in the 50s 60s and 70s n I thought that would make me susceptible, but no cigar…",
            "title_similarity": "0.7269337",
            "sentiment_compound": -0.8584
        },
        {
            "id": "h5fk82y",
            "score": 1,
            "text": "Fun fact: the only overdose on vitamin d (to my knowledge) was a pharmacist who was taking around 1 million+ IUs a day. Still monitor what your taking, but chill.",
            "title_similarity": "0.63587236",
            "sentiment_compound": 0.4118
        },
        {
            "id": "hkhp7rh",
            "score": 1,
            "text": "I started taking Vitamin D3 a week ago and my nicotine cravings have gone from intense to mild. I noticed it and wondered if it was the D3 and found this thread.",
            "title_similarity": "0.6394557",
            "sentiment_compound": 0.3612
        }
    ]
}