{
    "Large landlords file evictions at two to three times the rates of small landlords (this disparity is not driven by the characteristics of the tenants they rent to). For small landlords, organizational informality and personal relationships with tenants make eviction a morally fraught decision.\n": [
        {
            "id": "h2f70h9",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.47291327",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h2febq5",
            "score": -24,
            "text": "You mean to tell me, huge corporations who are profiting off of humanities most essential needs are operating without moral regard for their tennants?  Shocking.",
            "title_similarity": "0.6311332",
            "sentiment_compound": 0.296
        },
        {
            "id": "h2fp4p0",
            "score": -5,
            "text": "I have a large landlord. My son bounced a ball and broke a glass light cover on the ceiling so I promptly ordered new one. We had inspections the next day. The house was in perfect condition except the light. I told them it was ordered and j would replace it. I got an email the next day that said if I didn’t replace the light cover in 2 days and take picture and I would 3 days to vacate the property. I can’t say this enough fuuuuuck them.",
            "title_similarity": "0.6126487",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h2fyk0x",
            "score": -6,
            "text": "because eviction IS and SHOULD BE a morally fraught decision.",
            "title_similarity": "0.40059218",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h2f9m6l",
            "score": -37,
            "text": "It is easier to be cruel and inhumane from a skyscraper 2000 miles away. Big banks must go.",
            "title_similarity": "0.6000755",
            "sentiment_compound": -0.25
        },
        {
            "id": "h2fleay",
            "score": -9,
            "text": "ok so i say we ban Corporations from being landlords.",
            "title_similarity": "0.37781858",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2flgpr",
            "score": -6,
            "text": "This is one of many reasons I have supported some type of increased property tax on larger landlords, or just limiting how many properties you can buy in a given area in general. Something to limit the mass accumulation of property in small jurisdictions. I live in a poorer area of a big city, and it’s in the process of being gentrified. Most properties are now owned by a few small groups of large investors because they’re banking off of the cities investments. Some of the houses are fine, others are vacant and rundown asking for trouble. Either way the landlords are just holding them until the city fixes up the area. Would gentrification or eviction be as big of an issue if poor/minorities could own their home to begin with? Of course not. And that issue is exacerbated by the mass accumulation of property by a few individuals.",
            "title_similarity": "0.7896352",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h2ffths",
            "score": -5,
            "text": ">personal relationship\n\nMaybe this makes for better tenants too.",
            "title_similarity": "0.41139412",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2fx20g",
            "score": 8,
            "text": "I have 24 rentals myself. All I would consider lower income. I have good relationships with almost all my tenants. I have worked with some even when they're 2 months behind. I don't want to evict any of them because most have children. I have coached their kids in sports. They're my children's classmates. My kids even play with some of them when I go over to fix things. It can be really hard to have to evict certain ones when you have developed a relationship with them. I probably have some of the nicest low income rentals in my state. Before move in I look at the age of the units and see if it's in bed of updating. In the past two years I have renovated every unit after someone moves out. They get new paint on the ceiling and walls, new lvp flooring, kitchen cabinets, bathroom vanities, toilets, and fixtures. The last one I finished looked better than my personal house. I've learned if you give some people a home and not a run down place to stay they take better care of it, are appreciative, and make rent one of their top priorities. I have tenants that come and show their family and friends what their unit will look like while I'm remodeling. Years ago all I cared about was the money but along the way as I've gotten older I've realized that life isn't about money.",
            "title_similarity": "0.6245703",
            "sentiment_compound": 0.92
        },
        {
            "id": "h2fzohm",
            "score": -2,
            "text": "Bruh I got an eviction notice for not paying a fee ($250) associated with a move-out carpet cleaning that ended up at $264 with the “late” charge. It was assessed on my account 3 months before move-out and supposedly not due until the final months payment. So I decided not to pay it until then, just like they said\n\nBut after 3 years no late payments and 15 days into assessing that on my account I got a literal eviction notice. \n\nIt’s extortion",
            "title_similarity": "0.72339934",
            "sentiment_compound": -0.7847
        },
        {
            "id": "h2frrfv",
            "score": -2,
            "text": "And this is exactly why large institutions like blackrock increasing their real estate holdings should terrify us.",
            "title_similarity": "0.51763344",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h2fq8t9",
            "score": -12,
            "text": "[deleted]",
            "title_similarity": "0.05146031"
        },
        {
            "id": "h2ft9m3",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.051460296"
        },
        {
            "id": "h2fyyoq",
            "score": -3,
            "text": "Housing should not be an investment, and it's profits, if any should be severely limited.",
            "title_similarity": "0.54577434",
            "sentiment_compound": -0.25
        },
        {
            "id": "h2flar2",
            "score": 66,
            "text": "Evictions on the whole are not morally wrong\n\nPay your bills",
            "title_similarity": "0.5075743",
            "sentiment_compound": 0.431
        },
        {
            "id": "h2fqfh9",
            "score": 1,
            "text": "Large land lords puts stainless steel appliances, call it an upgrade increase rent by $300.",
            "title_similarity": "0.5191643",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2fq2i6",
            "score": 3,
            "text": "As a Landlord myself I choose to avoid courts and lawsuits in dealing with evictions.  They are immensely taxing on my mental health.  I often seek to negotiate and I do so in good faith, but once a tenant expends my professional courtesy all bets are off.  Often with me and my other landlord friends we usually find ourselves at our wits end when having to file for eviction.",
            "title_similarity": "0.690464",
            "sentiment_compound": 0.6829
        },
        {
            "id": "h2gd6kk",
            "score": -5,
            "text": "Should be illegal for anyone or any corporation to own more than two houses. Housing should never be a for profit industry as housing is a need, just like water, electricity, internet, medical, or food. \n\nIf someone uses a house as a source of income, it should be heavily taxed. It should also be illegal for someone to own a house in a state or country they dont live in that they rent out.",
            "title_similarity": "0.6329236",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2fhbsm",
            "score": -29,
            "text": "Why is it that every science article is just painful reminders of how awful capitalism is?",
            "title_similarity": "0.5236579",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h2fr28u",
            "score": 5,
            "text": "My gf's mom is trying to get an eviction off her recprd, she got laid off, told her landlord she might have trouble paying for a few months.....aaand he immediately filed eviction paperwork, and instead of talking at all about options at any point he served the eviction.\n\nNow she's trying to get a house and it's a whole problem, because here the landlord doesn't have to report you payed him an overdue amount. Probably going to end up being a lawsuit against the guy to force him to report the debt paid.\n\nIt's not a moral dilemma for *some* people.",
            "title_similarity": "0.69995767",
            "sentiment_compound": -0.9458
        },
        {
            "id": "h2fcims",
            "score": 25,
            "text": "> Drawing on over four million property tax records, business filings, and court-ordered eviction documents over fifteen years in Boston, Massachusetts.... Not only do large landlords file more often, but also over less money owed and more often as a rent collection strategy.\n\nThis \"study\" is paywalled but here is the only thing of importance from the abstract. I've read studies like this and I'd be willing to bet this is the only pertinent data and the rest of it is personal debate/speculation. \n\nI have no doubt that this study absolutely does not measure the morality of small vs large landlords. Dumb title.",
            "title_similarity": "0.77830493",
            "sentiment_compound": 0.4049
        },
        {
            "id": "h2fx12k",
            "score": 12,
            "text": "This is social science, not real science. This crap needs its own subreddit.",
            "title_similarity": "0.41766524",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h2fuuhk",
            "score": 0,
            "text": "My old landlord didn't give af. Basically evicted us because she hated us. It was her dad's company but he died, she took over and put us all through hell. Lied a lot too. Kept thinking of reasons to charge extra that I never paid.",
            "title_similarity": "0.6216258",
            "sentiment_compound": -0.9493
        },
        {
            "id": "h2fx8nw",
            "score": 0,
            "text": "a study done by someone never tried to evict a tenant personally.",
            "title_similarity": "0.41780153",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fxdr9",
            "score": 0,
            "text": "You mean to tell me that large soulless corporations dehumanize the people they serve? *You don’t say!*",
            "title_similarity": "0.6280716",
            "sentiment_compound": -0.4753
        },
        {
            "id": "h2gf7pc",
            "score": -2,
            "text": "Being a landlord is morally fraught to begin with. Useless parasites.\n\nEdit: Rightoids are furious. Mao was right.",
            "title_similarity": "0.6310297",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h2fiq83",
            "score": -35,
            "text": "[removed]",
            "title_similarity": "0.022418927"
        },
        {
            "id": "h2fsirh",
            "score": -12,
            "text": "Housing should be not be profit incentivized. If you're covering your mortgage by renting out your basement, great; but other than that, we need to abolish the landlord class.",
            "title_similarity": "0.605554",
            "sentiment_compound": 0.2136
        },
        {
            "id": "h2h08l0",
            "score": 3,
            "text": "Does comrade bernie let people live in his 3 homes for free? Where can I give him a call?",
            "title_similarity": "0.536638",
            "sentiment_compound": 0.5661
        },
        {
            "id": "h2fp99a",
            "score": 29,
            "text": "If the landlords aren’t being paid their rent then they have every right to evict the person should they see fit. I know a few guys that rent out homes. Took them a lot of time money and effort to build their businesses and one has 2 people that haven’t paid him in over a year. During that time they’re getting $900 week unemployment. They should have been dumped out months ago but could not due to COVID rules. That’s stealing. It’s not right.",
            "title_similarity": "0.7945665",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h2fqaym",
            "score": 4,
            "text": "As a former small landlord ( two units) who got burned for several thousand $ by a deadbeat tenant who I tried to help, I fell sorry for small landlords who are getting burned by people who are not paying their rent.",
            "title_similarity": "0.6716379",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2fkdt3",
            "score": 95,
            "text": "small time landlord checking in. i can agree with the term \"morally fraught\" but evicting gets easier every time you do it. hate to say it but I am starting to understand how some of these landlords can seem heartless. i've been screwed over 4 times already and my current renter is quickly approaching being one month behind on rent. typically you do not catch up when it gets to that point.",
            "title_similarity": "0.7744177",
            "sentiment_compound": -0.8807
        },
        {
            "id": "h2gfdj1",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.022418901"
        },
        {
            "id": "h2fv94p",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.022418909"
        },
        {
            "id": "h2g006r",
            "score": 5,
            "text": "Why not name this sub social science. The content posted here is an insult to science .",
            "title_similarity": "0.41524905",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h2fid3t",
            "score": 3,
            "text": "What happens when corporation X, who owns 40 percent of the housing in the town decides to withhold property tax.? (Remember, Xs contributions put 60 percent of it's contributees on the city council.",
            "title_similarity": "0.6116816",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fr1sw",
            "score": 4,
            "text": "Probably small time landlords just pop over and work something out or get them out before eviction is needed. \n\nHow about you just pay your rent you signed the contract for or leave?",
            "title_similarity": "0.5936357",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h2fuemi",
            "score": 1,
            "text": "When you have a lawyer, you may as well use him.\n\nJust like when you have a hammer, everything is a nail.",
            "title_similarity": "0.43692666",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h2fvgkw",
            "score": -1,
            "text": "The first step to easily treating people badly is to dehumanize them.",
            "title_similarity": "0.46042538",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2g0bli",
            "score": 1,
            "text": "What's interesting is that a lot of people are making more than what they would on unemployment and some still refuse to pay rent.",
            "title_similarity": "0.7473537",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h2g4n5i",
            "score": 1,
            "text": "Serious question - should social science papers be allowed here? It's interesting but not hard science.",
            "title_similarity": "0.4765459",
            "sentiment_compound": 0.2833
        },
        {
            "id": "h2fmncc",
            "score": 46,
            "text": "“Eat all landlords!” - Reddit",
            "title_similarity": "0.31999454",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fso5u",
            "score": -6,
            "text": "It’s almost like the larger a business becomes the more impersonal, rigid and cruel they become.",
            "title_similarity": "0.55557185",
            "sentiment_compound": -0.7153
        },
        {
            "id": "h2fzosm",
            "score": 3,
            "text": "Business should not be emotional.",
            "title_similarity": "0.29517758",
            "sentiment_compound": -0.1139
        },
        {
            "id": "h2gl6e0",
            "score": -3,
            "text": "Here’s an idea: no more landlords.  I hypothesize near 0% eviction rate.",
            "title_similarity": "0.5584967",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h2glofe",
            "score": 2,
            "text": "Some tenants deserve to be evicted.",
            "title_similarity": "0.45183647",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fho2s",
            "score": -7,
            "text": "I feel like, while the subject is different, this saying still applies: One person dying is a tragedy, thousands of people dying is a statistic.",
            "title_similarity": "0.58593816",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h2fs2m3",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.022418901"
        },
        {
            "id": "h2fp8z9",
            "score": 5,
            "text": "where i live it is very tenant friendly\n\ni have just a few rentals and one stopped paying.  I googled what to do in my state when tenant stops paying - the answer was to offer the tenant money to leave.  So in essesnce the tenant by stopping paying rent gets rewarded wtih cash.   (Eviction process here takes months and it is recommended to hire a lawyer)",
            "title_similarity": "0.70023054",
            "sentiment_compound": 0.2911
        },
        {
            "id": "h2fu04w",
            "score": -2,
            "text": "Almost like they should force a personal process so people in distress can't be treated like numbers on a spreadsheet  page.",
            "title_similarity": "0.5760505",
            "sentiment_compound": -0.5524
        },
        {
            "id": "h2fvxhn",
            "score": 1,
            "text": "More like it's always morally fraught but the big ones don't have to see the effects of it so they do it without remorse.",
            "title_similarity": "0.5730111",
            "sentiment_compound": 0.4797
        },
        {
            "id": "h2fwwbp",
            "score": 0,
            "text": "My coworker, who doesn’t have the money to do this but does anyway, doesn’t charge rent in December so his tenants can afford Christmas presents.  It’s possible to put people before money but not with the wrong people who have the money.",
            "title_similarity": "0.6562989",
            "sentiment_compound": 0.5157
        },
        {
            "id": "h2fz4dz",
            "score": 3,
            "text": "Here in Oakland, CA and much of surrounding Alameda County there are so many tenant's rights laws and legal advocacy groups, it's almost impossible to be a small time landlord. So instead, Berkshire Hathaway, Black Rock, and corporate real estate is buying up rental property. Yay! That's what all us lefties wanted, right?",
            "title_similarity": "0.68155354",
            "sentiment_compound": 0.636
        },
        {
            "id": "h2fo1iu",
            "score": 6,
            "text": "I disagree. Every terrible experience ive had has been with small time landlords. Never have I had an issue with corperate or larger owners.",
            "title_similarity": "0.60189956",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h2fkzv9",
            "score": 5,
            "text": "The consolidation of ownership in the housing market is one of the worst things in our economy now. Large corporations own and operate hundreds of thousands of units. This has to stop",
            "title_similarity": "0.69368887",
            "sentiment_compound": -0.743
        },
        {
            "id": "h2ftdrm",
            "score": -5,
            "text": "I'll be honest I have no clue about big landlords and all but I'm of the opinion there should absolutely be a cap on how many properties a person can own. Say maybe like even 4 or 5. Seems reasonable",
            "title_similarity": "0.7029176",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h2gtkh3",
            "score": 7,
            "text": "No one deserves to live in someone’s else’s property for free and there’s nothing wrong with people who don’t pay rent being evicted",
            "title_similarity": "0.556504",
            "sentiment_compound": 0.503
        },
        {
            "id": "h2g5hps",
            "score": 0,
            "text": "OP misspelled *slum lords* once in the title",
            "title_similarity": "0.39307666",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2gep6c",
            "score": 0,
            "text": "This \"research\" is a joke. Fraught emotional relationships probably play a role, but not even considering what it costs small landlords to evict means the researchers are not serious. Every lawyer I know advises cash for keys when dealing with small fry clients.",
            "title_similarity": "0.7471999",
            "sentiment_compound": 0.4466
        },
        {
            "id": "h2gnvd8",
            "score": 0,
            "text": "Maybe someone should do a study like this about firings in corporations versus small businesses. Perhaps that's a flaw in giant capital-driven entities.",
            "title_similarity": "0.70116866",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2h1qy3",
            "score": 0,
            "text": "If you have 100% occupancy your rents are too low. Think about it.",
            "title_similarity": "0.59900576",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h2h1rvp",
            "score": 0,
            "text": "Isn't this sub about science?",
            "title_similarity": "0.09520261",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2i0kpe",
            "score": 0,
            "text": "What I don't get is how mass evictions work in landlords' favor during a major crisis like a pandemic. With so many people out of work I wouldn't think the demand for vacant housing was very high, so won't places just sit empty when people are evicted? An empty place produces no more revenue than one occupied by a non-paying tenant. It's more vulnerable to vandalism, and it means a new tenant has to be found. A tenant in place who was paying rent before will eventually become able to pay it again, and possibly also begin paying back rent. Even if they don't care about the welfare of their tenants, why give up and make the situation worse instead of letting things slowly return to normal?",
            "title_similarity": "0.8662784",
            "sentiment_compound": -0.9006
        },
        {
            "id": "h2i46al",
            "score": 0,
            "text": "This “science” sub has weird definitions of science sometimes.",
            "title_similarity": "0.24214765",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h2ftzlt",
            "score": -7,
            "text": "Only thing China got right in the revolution was beating all the landlords to death as public entertainment",
            "title_similarity": "0.4485383",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h2fnuhm",
            "score": 31,
            "text": "As a \"small\" landlord I can vouch for this.\n\nIt's a more emotional experience front to back.\n\nThe joy of having a tenant that cares about the house and decorates and improves it.\n\nThe sadness when someone you have been giving great rates and service to leaves and destroys what you built on the way out.\n\nThe angst of deciding if a borderline tenant has done enough to deserve a notice...\n\nDecisions that probably are made with no emotion while looking at the bottom line for the company are made with emotion, and it is indeed because I know who the tenants are. If I am objective and honest I know my decision-making would change if I had hundreds of units. I can't know all of them, and can't be attached to all of them when there are so many.",
            "title_similarity": "0.6698147",
            "sentiment_compound": 0.9117
        },
        {
            "id": "h2fvo7k",
            "score": 25,
            "text": "Yeah, and now the housing market is starting to get dominated by massive corporations and investment firms like Black Rock.  Soon huge swaths of homes in neighborhoods could be turned into cheap rentals that are often neglected.  Middle class people won't be able to buy because all of the supply will be hoarded by investment groups who have all cash to pay for homes.  We will become a nation of renters. It'll be modern day feudalism.  Oh, and if you hit any difficulties?  Evicted immediately.",
            "title_similarity": "0.7914705",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h2fdrjo",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.022418927"
        },
        {
            "id": "h2fwrfv",
            "score": -1,
            "text": "You can go ahead and file this under “common sense”",
            "title_similarity": "0.10085766",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fxthq",
            "score": 1,
            "text": "One eviction is a tragedy. 100 is a statistic.",
            "title_similarity": "0.49420664",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h2g2tfh",
            "score": -1,
            "text": "Class warfare, period.",
            "title_similarity": "0.33600003",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2g4iyl",
            "score": -1,
            "text": "Landlords have morals?",
            "title_similarity": "0.3628893",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2geg7j",
            "score": -1,
            "text": "So if you have a fat landlord, they’re more likely to evict you than a skinny landlord. \n\n\nGood to know.",
            "title_similarity": "0.72642136",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2gesnm",
            "score": -1,
            "text": "That is because large landlords are driven by greed. Any one that ever uses the phrase \" It is just business\" knows they are screwing you over.",
            "title_similarity": "0.65871316",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h2gg92c",
            "score": 1,
            "text": "Or, get this, small landlords don't generally have lawyers on retainer, and can't spend thousands to go to court just to get what they are owed, if there is even anything to get.",
            "title_similarity": "0.76246464",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ggako",
            "score": 1,
            "text": "If we consider evictions as “bad practice”, and preventing evictions as good practice, doesn’t this align with other corporate policies versus small company policies, and autonomy of the small?",
            "title_similarity": "0.63021207",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2ggejm",
            "score": 1,
            "text": "I mean if you can’t pay the agreed amount, at the end of the day morality isn’t a factor",
            "title_similarity": "0.43455315",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h2gja0o",
            "score": 1,
            "text": "Social science also says paying rent leads to no eviction.",
            "title_similarity": "0.51995337",
            "sentiment_compound": 0.357
        },
        {
            "id": "h2gldov",
            "score": 1,
            "text": "So always look for short landlords.",
            "title_similarity": "0.37729013",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2goltn",
            "score": -1,
            "text": "This is worrying my landlord weighs 27 stone, that's 378lbs for people in the US. Looks like I will be on the street soon.",
            "title_similarity": "0.69909513",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h2gvv0o",
            "score": -1,
            "text": "This is why people hate big companies. Prime example",
            "title_similarity": "0.54254544",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h2h32of",
            "score": -1,
            "text": "Residential property should only be owned by residents of the property should not be used as investments that should be illegal.",
            "title_similarity": "0.45436782",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h2han0v",
            "score": 1,
            "text": "Obesity really is a problem in the US.",
            "title_similarity": "0.5544507",
            "sentiment_compound": -0.4522
        },
        {
            "id": "h2hkj19",
            "score": 1,
            "text": "Taxes should be progressivley higher for holding additional properties over 3 residential homes and/or over 50 renting/leased units across multiple locations. In otherwords, Corperate ownership and control over multiple land holdings should be fined, excessively and progressively to prevent monopolistic pricing and market pressure.",
            "title_similarity": "0.683709",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h2fx0wb",
            "score": 9,
            "text": "It also makes you a sucker. Large landlords evict right away because it's the right move. Most small landlords learn too late that if you don't evict immediately you'll basically be paying for this person's housing for the foreseeable future.",
            "title_similarity": "0.74997044",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h2fp4xk",
            "score": 22,
            "text": "I've always wondered if things like this partly explain why more expensive or so-called \"gentrified\" cities have higher rates of homelessness. Since studies show a large number of homeless people in these cities are not Greyhound riding migrants seeking \"homeless friendly liberal policies\" but are actually locals, that skewers cynic's arguments.\n\nUndesirable neighborhoods in LCOL areas usually have low-quality housing available to rent at very low prices from small-time landlords who are more tolerant of people who have troubled backgrounds. Someone who has substance abuse problems but pays the rent somehow is allowed to stay even if they are a nuisance. \n\nAlso consider the role of family and friends in housing vulnerable people. If a parent of a mentally disabled adult owns a large home they could allow their indigent child to live with them. If the parent is themselves poor and lives in a rental apartment that might not be as easy. The mentally disabled adult child who behaves threateningly or has a meltdown in a corporate managed luxury apartment community would lead to complaints and lease violations against the parent. But if they lived in a small 2 bedroom wood house on the wrong side of the tracks, that is less likely to happen.\n\nFinally, what is the end game of a treatment and job skills program for a homeless person with drug or mental problems in a city like Los Angeles, exactly? Someone with no education, needs meds to function, and whose brain is fried is not going to be able to suddenly afford a $2,000/mo apartment lease that requires good credit and rental history. The fact they'll never be able to get ahead because of the size of this leap probably contributes to a state of learned helplessness. In a LCOL area, there can be rungs in the ladder - maybe they get a honest simple job and somewhere cheap to live with a roommate first. That is flatly impossible to achieve in California, and to me this explains everything.\n\nThere is historic evidence to demonstrate this - the closure of SRO (single room occupancy) hotels from well known skid rows in Los Angeles and San Francisco in the 1970s and 1980s made vagrancy on the streets so much worse. Previously, those people were doing drugs in private rooms in squalid old buildings, when they were kicked out it didn't clean up the neighborhood.\n\nAlso, anecdotally, I know small time landlords who rent to people with issues. I work in the offices of a manufacturing plant in a cheap city(Houston), in a pretty rough neighborhood. One of our employees inherited a small, kind of run down house just down the street. He rents it out to the hourly factory workers he knows. Our company pays people in those positions very little(like $9 or $10 an hour) and staffs them by hiring people with past criminal records, we also employ a lot of immigrants from South East Asia who speak zero English, etc. These are people who would not have anywhere else to go. The guy who does this says its his Christian duty, and whether or not he's just being a slumlord is besides the point because everyone needs a roof over their head. Houston is actually well known for having a good handle on its homeless problem. There are some hotspots, like around the bus station in midtown, but in raw numbers we actually have very few people on the streets relative our population(7+ million). Some of it is due to local government efforts, but if we are being frank, this is Texas and there's no free handouts here. I think the real answer is that we just have a lot of dumpy poor neighborhoods that play a critical role in giving folks somewhere to live when there's nowhere else to go.\n\nI can't help but worry if well intentioned neighborhood improvement and policing efforts could go awry. A filthy apartment complex that leads to a lot of calls to the police might get raided, shut down, etc, but then what happens to the innocent residents who can't find housing elsewhere?",
            "title_similarity": "0.8251184",
            "sentiment_compound": -0.9886
        },
        {
            "id": "h2fviuj",
            "score": 10,
            "text": "I've managed public housing for almost 10 years now, in rural and urban centers all up and down the west coast. This issue is obviously very different in subsidized housing and can cause all sorts of really serious and destabilizing problems.\n\nIt is absolutely necessary to evict people from time to time in subsidized housing, if for no other reason that to maintain a sense of order and cohesion within the project/complex/building. I've had tenants who were dangerous, violent, anti-social, people who threaten and assault their neighbors, people with serious mental health or substance abuse problems. But due to legal restrictions and the fact that eviction court judges in more liberal cities will bend over backwards to avoid evicting someone from subsidized housing, we're stuck dealing with some wildly unacceptable behavior for long periods of time.\n\nSo the burden of really dealing and combating these issues ends up falling on the shoulders of public housing managers like me and the people who actually live in the building and are the neighbors of people who are simply too crazy to operate in a subsidized housing environment where they have to live in close proximity to other people and obey basic standards of conduct.\n\nI'm not for making anyone homeless, but I'm also the guy that has to ensure that everyone else around these problem tenants are able to enjoy the quiet and peaceful occupation of their premises. Which becomes all but impossible in a lot of these situations",
            "title_similarity": "0.6567966",
            "sentiment_compound": -0.9593
        },
        {
            "id": "h2firm0",
            "score": 44,
            "text": "As a renter I can see why that's a bad thing though, I swear some people have no respect for the house they're living in.",
            "title_similarity": "0.6840849",
            "sentiment_compound": -0.7394
        },
        {
            "id": "h2fubni",
            "score": 2,
            "text": "Good thing blackstone is buying up all that real estate to hoard",
            "title_similarity": "0.48956916",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2g0j41",
            "score": 2,
            "text": "Big corporations act like the worst of humanity? No way.",
            "title_similarity": "0.56994534",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h2gitxp",
            "score": 2,
            "text": "This applies to every business ever.  It's almost like monopolies and mega businesses are a bad idea. If only we had a government to protect us.",
            "title_similarity": "0.65068585",
            "sentiment_compound": 0.079
        },
        {
            "id": "h2glvyt",
            "score": 2,
            "text": "You dont become a large landlord by letting tenants rob you.",
            "title_similarity": "0.72509277",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h2gs46i",
            "score": -2,
            "text": "No one should be able to rent out more than one unit (be it a house/apartment/bedroom/etc) at a time.",
            "title_similarity": "0.47599503",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2h4s1w",
            "score": -2,
            "text": "Hot take: Capitalism is an immoral economic system.",
            "title_similarity": "0.5191721",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h2ffjna",
            "score": 64,
            "text": "The rent moratoriums are up this/next month.  It's going to be a bloodbath for the underemployed living in cheap apartments.  Mass evictions on the way.",
            "title_similarity": "0.68463445",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fxzrl",
            "score": 11,
            "text": "I only rent a place if the landlord is 5’1” or below.",
            "title_similarity": "0.45863408",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fl12q",
            "score": 43,
            "text": "I’ve been a renter for 18 years now and I’ve had many many landlords. Be it a big company or a single individual, they can both be equally awful in their own special ways.",
            "title_similarity": "0.5793917",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h2flbu4",
            "score": -4,
            "text": "Not surprised; personal accountability increases with less corporate environments as well as decreases when they have funds appropriated for lawyers",
            "title_similarity": "0.6924286",
            "sentiment_compound": 0.1114
        },
        {
            "id": "h2fz4ct",
            "score": 4,
            "text": "The abstract [actual paper behind paywall] doesn't mention that smaller landlords tend to be more likely to personally be involved in the interview process - and thus are excersizing character judgement, and more likely to be hesitant about a tenant who may need to be evicted.",
            "title_similarity": "0.7473801",
            "sentiment_compound": -0.25
        },
        {
            "id": "h2gc96f",
            "score": 3,
            "text": "This is somewhat in line with my personal experience.\n\nMy previous large landlord would issue Notices to Quit on the third of the month.  Rent wasn't late until the sixth.  I came home one day and found eviction paperwork on my door (it was only of the few months I didn't get a NTC).  I countersued for the cost of my time and \"attorney's fees\" (I was pro se, so no idea how that would've worked out) as per my lease.  They dismissed immediately, then called me and begged me to dismiss my counterclaim. When that didn't work, their lawyer sent me a threatening letter.  I dismissed the day before the hearing.  Come to find out, they had lost my rent payment and, instead of asking me to get a new cashier's check, they decided to evict me to cover their mistake.  When the next lease renewal came up, they changed the language so that only the apartment could sue for tim and attorney's fees, not the tenant (I'm fairly sure that's considered predatory and unenforceable).  They eventually \"evicted\" me and my husband by refusing to renew the lease.  The property manager was homo- and transphobic.\n\nIn my new apartment, run by a small landlord, I was late with rent for the only time in my life.  100% my fault; I forgot to pay it.  The landlord dropped the NTC on my door, and I paid my rent online right away.  I wasn't able to pay the late fee, so I called him and asked if he was going to take it on to next month's rent or if he'd prefer certified funds.  His response was \"Don't worry about it.  We all make mistakes.\"",
            "title_similarity": "0.74807715",
            "sentiment_compound": -0.9457
        },
        {
            "id": "h2gfh40",
            "score": -3,
            "text": "As a small landlord, this is accurate.",
            "title_similarity": "0.30314475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2gi0th",
            "score": -4,
            "text": "smaller landlords make the mistake of getting comfy with their tenants",
            "title_similarity": "0.66131717",
            "sentiment_compound": -0.34
        },
        {
            "id": "h2glmbg",
            "score": 4,
            "text": "What’s the difference between a small and large landlord?  Is there a height cut-off or just weight alone?",
            "title_similarity": "0.71436715",
            "sentiment_compound": -0.3313
        },
        {
            "id": "h2h5c3c",
            "score": 1,
            "text": "As a small landlord, it upsets me that people assume existing people for not paying is some sort of bad thing. Small landlords can’t afford to give people free housing",
            "title_similarity": "0.7578776",
            "sentiment_compound": -0.4576
        },
        {
            "id": "h2h5dwj",
            "score": 2,
            "text": "Wrong - small landlords can't afford the lawyers required to kick people out. So, they are FORCED to compromise and continue to take abuse from the tenants that are not paying/abusive/disruptive/destructive.\n\nLandlords do not start renting to be kind to strangers - they start renting TO MAKE MONEY. If they lose money, then need to take action - sadly, if they don't have a war chest saved to pay an attorney they have to take it while the tenant whines and files frivolous actions about; too sick to pay, too hot to go out, too cold to look for a job.\n\nYes, I'm sure there must be some starry-eyed landlords that live in the world of socialism that want to fill all their rentable locations with under and unemployed.",
            "title_similarity": "0.7697419",
            "sentiment_compound": -0.8685
        },
        {
            "id": "h2ftds2",
            "score": -4,
            "text": "If eviction is morally fraught for small landlords, it's probably morally fraught for big ones too. Of course, they may not realize it and maybe that's what the study is getting at, but the morality are pretty similar.",
            "title_similarity": "0.72338235",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h2gc2d3",
            "score": 4,
            "text": "\n\nI hate being stuck in a loophole rentting because I don't have enough liquid assets to buy a house. The worst thing is watching the property that I rent slowly get worse over time because the landlord doesn't really care that the paint is peeling or the stairs are creaky but if I actually live there and owned it I would invest into my property because it's a long-term commitment and bc I would enjoy the improvements . \n\nIt burns me up but I see news articles complaining about the dilapidation of buildings around me but at the same time they won't lower housing prices so an average family or person can buy a home . People arent dropping hundreds of thousands of dollars into new countertops and double pane windows for a house that they don't own and at the end of the day someone can kick them out of. But if we let people afford to buy a house would totally fix them up bc it's nice to live somewhere modern. if I owned a house I'd be into solar panels and energy efficient washers. You bet your ass I'd be home Depot regularly.",
            "title_similarity": "0.7678093",
            "sentiment_compound": 0.8426
        },
        {
            "id": "h2gxdft",
            "score": -4,
            "text": "Landlords shouldn’t exist in the first place",
            "title_similarity": "0.44328427",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fggqq",
            "score": 171,
            "text": "I am in property management.  Seeing as how this study solely used data from Boston, MA, I would be very hesitant to reach any conclusions about behaviors outside of Boston based on this study.  Boston has some of the most tenant-friendly housing laws in the country, which clearly makes it a different animal than, say, many parts of Texas.",
            "title_similarity": "0.66561866",
            "sentiment_compound": 0.1952
        },
        {
            "id": "h2fnkwe",
            "score": 49,
            "text": "Small landlords don't evict because they often can't afford to",
            "title_similarity": "0.6810031",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fi20y",
            "score": 35,
            "text": "And we are about to see this in droves once the rent moratoriums lift at the end of the month.",
            "title_similarity": "0.45771977",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2f7lel",
            "score": 365,
            "text": "[deleted]",
            "title_similarity": "0.051460296"
        },
        {
            "id": "h2fjt1i",
            "score": 7,
            "text": "Also large landlords are more likely to have and more likely able to afford legal staff.",
            "title_similarity": "0.5898746",
            "sentiment_compound": 0.128
        },
        {
            "id": "h2fmse9",
            "score": -7,
            "text": "Corporate greed. I have seen this at every large apartment complex I have lived in.",
            "title_similarity": "0.45576102",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2fpmv8",
            "score": 7,
            "text": "Seems like there's more at play than just personal relationships. Large landlords deal with more people. It would make sense that they probably need to turn to eviction more often than someone who rents a single unit. Maybe tenants are also just less likely to pay large landlords. It probably feels worse to stiff Joe, the single dad who owns your duplex apartment, and lives downstairs, than some faceless land-management company.",
            "title_similarity": "0.8424287",
            "sentiment_compound": -0.2635
        },
        {
            "id": "h2frhsx",
            "score": 22,
            "text": "Why doesn't the largest landlord simply eat the smaller landlords?",
            "title_similarity": "0.6341417",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fzon5",
            "score": 9,
            "text": "So many interesting variables. I would bet that small landlords are more picky about who they rent to (and can get away with a lot more discrimination than large landlords can).",
            "title_similarity": "0.7298552",
            "sentiment_compound": 0.4549
        },
        {
            "id": "h2fda4k",
            "score": 1331,
            "text": "They are saying \"filed.\" This is a big distinction. I worked for a third party  property management company (single family homes mostly). They would automatically file on the 10th of the month and charge the tenants for the filing fee (technically illegal in our state until the judge awards the filing fee), so it cost them nothing. It was a horrible practice and I tried to make my office more flexible and ask the landlord what they wanted to do depending on the circumstances. It was one of the reasons I was let go \"without cause.\" Also because I pointed out the filing fee issue and a number of other illegal things they were doing (I had a legal background). Very few of the tenants would actually get evicted since it took a long time, but they would always file as a just in case.\n\nEdit: one of my sentences was unclear",
            "title_similarity": "0.7628587",
            "sentiment_compound": -0.4945
        },
        {
            "id": "h2fh2ft",
            "score": 355,
            "text": "Large Landlords can also absorb the costs of a unit turning over much better then a small one can. They almost certainly have rental agents who will be showing the unit, onstaff workers to clean/fix/ready the unit, contracts in place to do background checks, etc etc\n\n&#x200B;\n\nIn other words, its not a big deal for a large landlord to evict, and flip a unit. They also have policies / procedures in place for this type of an occurrence to ensure they don't get to far behind with a tenant and they know the laws on how to remove someone quickly\n\n&#x200B;\n\nSmall landlords often cannot float the cost of their unit for more then a month or 2, will likely be dealing with a lot of the work either at a job cost or themselves, and showing the unit is challenging as it works around their schedules, there is a very large incentive to not evict for small landlords vs large, even if it may mean future challenges\n\n&#x200B;\n\nmaking this about the social aspect seems like a bit of a stretch as we are not comparing apples to apples. A more accurate survey would be \"Small landlords who live in the area vs small landlords who live in another state\" as that would likely more closely allow evaluation of the social aspect of landlord/tenant vs the financial impacts",
            "title_similarity": "0.7241897",
            "sentiment_compound": 0.9321
        },
        {
            "id": "h2ggjl8",
            "score": 12,
            "text": "Small landlord here who cares about my tenants. I have 8 rentals. A 4 on 1, tri-plex and a sfr. The personal relationship part resonates here. I can tell you a mutual interest with tenant and landlord to want to make things work out goes a LOOONG way. Tenants take care of the mortgages, therefore I have a responsibility to have nice places for them to rent in return. I’m even proud to have multiple tenant move to buy their own multi-units and not afraid to be a landlord of their own. Be cool, be chill, don’t squeeze out dimes, and you’ll have happy tenants who don’t want to move.",
            "title_similarity": "0.6151587",
            "sentiment_compound": 0.967
        },
        {
            "id": "h2fswir",
            "score": 13,
            "text": "Just from my own experience with both small and large landlords I can say small landlords are far easier to talk to and much more willing to work with you. \n\nLike I've seen small landlords work with people on every little thing including not being able to pay the full rent for a time. On the other hand my neighbor argued with the representative of a large company a few times a week for months to get her bathroom fan fixed.",
            "title_similarity": "0.7361926",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h2fkc9x",
            "score": 553,
            "text": "I haven't seen anyone bring up fair housing laws, but I think it's possible this could come into play as well.\n\nLarge landlords, who have over a certain number of units, are legally required to treat residents equally. I.e. you have to have a set, standardized procedure for eviction filings. If you make exceptions because of personal relationships, you're opening yourself to lawsuits from the REAL problem residents.",
            "title_similarity": "0.77588516",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h2fo6v5",
            "score": 6304,
            "text": "Attorney here - I used to do pro bono work on behalf of indigent tenants against their landlords. \n\nA key consideration that seems to go unmentioned in the abstract (the article is behind a paywall), is the rise of a \"cash for keys\" culture among small-time landlords.\n\nLarge, corporate landlords have attorneys on retainer to help with evictions, as well as corporate staff to handle the matter and professional maintenance teams to take care of damaged property. They also have economies of scale that let them weather a few nonpaying tenants.\n\nOn the other hand, many large cities (like Boston), have incredibly strong tenant protections that make the eviction process fraught with risk for small-time landlords. The process can take months, small paperwork mistakes can extend this further, and angry tenants can damage the property. A small time landlord simply doesn't have the resources to deal with this.\n\nSo \"cash for keys\" has become a sort of unofficial standard option - the landlord gives you $500 (or some amount) in cash, and you give him the key and leave immediately. No eviction, no court, no record of eviction for the tenant - but also no huge risk for the small landlord. \n\nThese cash for keys events would clearly skew the result of this paper, as they are functionally evictions, even if they're not showing up in the record.",
            "title_similarity": "0.78829986",
            "sentiment_compound": 0.66
        },
        {
            "id": "h2fcvtm",
            "score": 65,
            "text": "[deleted]",
            "title_similarity": "0.051460296"
        },
        {
            "id": "h2fme8j",
            "score": 14,
            "text": "I'd say it's also that large landlords have people or divisions who solely have responsibility for that.  They know how to do it and can do it quickly.  For a small landlord, it (hopefully) isn't something they're overly familiar with.",
            "title_similarity": "0.7384485",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2fp1gz",
            "score": 1,
            "text": "This only seems like common sense, really. \n\nIt’s not dissimilar to the expected findings if someone ran a study on stores willing to let being a dollar short slide at the register and found that Walmart was more likely to say “sorry come back when you have the money” than the small corner shop owned by Jim Bob. \n\nHuman relationships have value over corporate conformity, though in consideration there is certainly value present in corporate conformity over human relationships as well. I guess it just depends where you look. \n\nAnyway, I’m all for the science and quantitatively understanding the world around us, but some of the things shared here recently border on common sense. \n\nI’m off to perform a triple-blind peer reviewed study on whether someone is healthier drinking water or glucose syrup as primary hydration.",
            "title_similarity": "0.6952292",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h2fps5u",
            "score": 1,
            "text": "My tenant (friend) hasn’t paid me rent for 14 months. Even though he’s taking the piss (to an extent) I can’t bring myself to evict him",
            "title_similarity": "0.637391",
            "sentiment_compound": 0.128
        },
        {
            "id": "h2fq8eu",
            "score": 1,
            "text": "Seems perfectly normal to me. When it’s the big guy, it’s just business, no exceptions. When it’s the small business, it’s different.",
            "title_similarity": "0.5228435",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h2fqnfp",
            "score": 1,
            "text": "Business works best when it is personal in my opinion. You'll make less usually, but you can absolutely make a strong profit and the loyalty your customers have will make downturns easier to handle. You also get to see what benefits your provide.\n\nAnd in some industries, that personal touch has additional benefits. Doctors that are better communicators/have good bedside manners are less likely to be sued https://www.nytimes.com/2015/06/02/upshot/to-be-sued-less-doctors-should-talk-to-patients-more.html",
            "title_similarity": "0.61917686",
            "sentiment_compound": 0.9868
        },
        {
            "id": "h2fqnp5",
            "score": 4,
            "text": "Small landlords are also probably less likely to evict because it's usually a requirement that they show up to court in person.  I usually don't bother until someone is 3 months behind because it costs $400 just to file and then I have to take a day off work just to go to court to hope the other person shows up and it and it doesn't get rescheduled so I have to go again.",
            "title_similarity": "0.78034055",
            "sentiment_compound": 0.6041
        },
        {
            "id": "h2fqxot",
            "score": 1,
            "text": "This makes sense. Large professional businesses will have standard protocols in place, particularly where they make their money. Where someone need adhering to a strict guideline to evict could lose their job. Isn't moral.",
            "title_similarity": "0.6948973",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2fs35x",
            "score": 1,
            "text": "i really wish i could see the article because i'm curious how they distinguished between the moral drivers and the business/financial drivers.",
            "title_similarity": "0.5686822",
            "sentiment_compound": 0.6478
        },
        {
            "id": "h2fsgtx",
            "score": 3,
            "text": "I have small landlords. They are some of the most amazing people I have met in recent years. Super responsive, always checking in, they let me grow cannabis, they gave me a ping-pong table that was left at another property they have, they always insist on paying me when I help them out. They feel close like family, which you will never actually get from a corporatized entity. Some things you can't fake.",
            "title_similarity": "0.5597559",
            "sentiment_compound": 0.9535
        },
        {
            "id": "h2ftin2",
            "score": 1,
            "text": "Make sense in a lot of aspects. Large entities care more about profits, therefore make more money, which is their while purpose.",
            "title_similarity": "0.48742658",
            "sentiment_compound": 0.749
        },
        {
            "id": "h2fu2k2",
            "score": 2,
            "text": "Or more like small landlords don't have the time, expertise or money to fight through eviction proceedings. While large landlords have entire teams dedicated to this.",
            "title_similarity": "0.8066177",
            "sentiment_compound": 0.0498
        },
        {
            "id": "h2fui4p",
            "score": 1,
            "text": "For sure, it’s an exit strategy.",
            "title_similarity": "0.13462722",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2fullr",
            "score": 1,
            "text": "I don’t think these results are surprising to anyone :(",
            "title_similarity": "0.22718936",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h2fuvvo",
            "score": 1,
            "text": "No. It’s frickin expensive to evict people.",
            "title_similarity": "0.5942761",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2fv8zr",
            "score": 1,
            "text": "No wonder those large internet service providers are such dicks!!!",
            "title_similarity": "0.45885447",
            "sentiment_compound": -0.4724
        },
        {
            "id": "h2fw08r",
            "score": 1,
            "text": "We got the property and a management firm and intended it to just be some passive income. We closed in fall of 2019. 2020 threw a wrench into all that and we were very hands on. We got to know our residents and their situations and made every effort to work with them. We’ve never evicted anyone and I really hope we never have to. The stress of knowing that that is a possibility makes me not want to stay in this for very long. But because of the size of the property the only buyer would likely be this corporation based in another state. They bought the complex across the street, started charging for water, initiated a $60 annual rent increase, and issue evictions on an automatic schedule 6 days after due date. So now I feel kind of stuck with this. The income is good but if I knew the emotional toll involved I’d have never become a landlord.",
            "title_similarity": "0.6647245",
            "sentiment_compound": 0.7388
        },
        {
            "id": "h2fwa3e",
            "score": 1,
            "text": "I worked for a while in northern Virginia leasing apartments. I worked for a company that was based in New Jersey but opened properties up and down the eastern seaboard. The worst spot to be in is working for a property company and having to evict someone. You have to do it, it’s literally part of your job but unlike the assholes in corporate you see these people on a daily basis. \n\nThey come in for maintenance requests, to pick up packages and get parking passes. They come in with their kids and dogs for the community events you help put together and then when they fall on hard times you have to be the one to tell them “I’m sorry there’s nothing I can do”.  It’s soul crushing, cause if you don’t do your job and evict them you’ll be out of a job and possibly evicted in the future.",
            "title_similarity": "0.6810192",
            "sentiment_compound": -0.9274
        },
        {
            "id": "h2fwn5a",
            "score": 1,
            "text": "Large landlords will have lawyers on retainer, small landlords will have to pay out of pocket for the whole process. It's not surprising",
            "title_similarity": "0.7591337",
            "sentiment_compound": -0.2991
        },
        {
            "id": "h2fwwvd",
            "score": 1,
            "text": "I wanted to make a fat shaming joke based on how this post is written but I can’t think of a good one.",
            "title_similarity": "0.50776607",
            "sentiment_compound": 0.6652
        },
        {
            "id": "h2fx913",
            "score": 5,
            "text": "We need more housing, like allot of it!",
            "title_similarity": "0.27526224",
            "sentiment_compound": 0.4714
        },
        {
            "id": "h2fxnaa",
            "score": 16,
            "text": "I have a basement apartment and my last tenant said I was the best landlord she'd ever had. Warmed the cockles of my heart",
            "title_similarity": "0.46423483",
            "sentiment_compound": 0.8885
        },
        {
            "id": "h2fy4gq",
            "score": 1,
            "text": "My father was a small time landlord in the 1980s and 90s.  He charged VERY fair rent and even gave people breaks/leeway all the time.  I wish he had been a hardass because so many POS tenants took advantage of him, destroyed property, owed him $$$, were filthy, etc.  For every good tennant, we had 3 that were awful.  It is the biggest reason he decided to sell all his properties and none of his children have become landlords.",
            "title_similarity": "0.7279891",
            "sentiment_compound": 0.4453
        },
        {
            "id": "h2fyete",
            "score": 3,
            "text": "I think it could also be that large landlords also have the resources to go to court while the smaller landlords will avoid going to court unless they have to",
            "title_similarity": "0.6847683",
            "sentiment_compound": -0.296
        },
        {
            "id": "h2fyf6s",
            "score": 3,
            "text": "REIT-owned apartment complexes are the worst.\n\nEvery interaction feels like a legal proceeding, the price of things is likely to change (the rent you're offered at renewal is *seasonal* so if you move in at the wrong time of year you will always pay more than a person who moved in during slack months), the rules that they impose to reduce their liability are onerous and innumerable, and there's zero hope of negotiating any issue or getting a response to a threat of a lawsuit: you have to actually serve papers to get anyone to act like more than a billboard.",
            "title_similarity": "0.7878262",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h2fz1qb",
            "score": 1,
            "text": "Cap the total number of any [thing] any [group/person] can have…",
            "title_similarity": "0.097281806",
            "sentiment_compound": 0.1513
        },
        {
            "id": "h2fz2jb",
            "score": 4,
            "text": "Speaking with some experience in the matter, it isn't a matter of a personal relationship making eviction a morally fraught decision, it's that the large landlords have attorneys who can start the eviction process much easier than an individual landlord.\n\nIt's not easy to evict, depending on the jurisdiction you are renting in it can be \\*extremely\\* difficult. An attorney familiar with evictions can smooth the process over, knowing precisely what to do when to ensure a timely eviction if the tenant doesn't pay up. An individual landlord without that expertise will quickly find themselves having to jump through legal hoops to finally get a bad tenant out.",
            "title_similarity": "0.839416",
            "sentiment_compound": -0.8879
        },
        {
            "id": "h2fz4zd",
            "score": 1,
            "text": "The last apartment I stayed at the day manager was fond of feeling people if they were a couple days late with rent she would put a \"3 day pay or vacate\" on the door. With the grace period this is 7 total days late before eviction, the they pile your stuff up outside uncovered in Washington state.",
            "title_similarity": "0.6810994",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2fzcok",
            "score": 1,
            "text": "I tell my tenants to treat it like it’s theirs and rent will never increase. My tenants stay 5+ years and I take in profits due to no “unrented” time. This is humane and I have empirical evidence this works - and rent is deposited on time every month, every property",
            "title_similarity": "0.5773946",
            "sentiment_compound": 0.6044
        },
        {
            "id": "h2fzsqv",
            "score": 1,
            "text": "So interacting with a human makes you more likely to treat them like a human?",
            "title_similarity": "0.20965102",
            "sentiment_compound": 0.6666
        },
        {
            "id": "h2fztm0",
            "score": 1,
            "text": "What…. Big corporations only care about greed……you must be lying.",
            "title_similarity": "0.5418433",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h2fztup",
            "score": 3,
            "text": "It’s also large landlords use a 3rd party property management company most likely.  They do t get commission if rents aren’t paid.",
            "title_similarity": "0.83544374",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2g0bvt",
            "score": 1,
            "text": "Attorney here. I deal with a decent chunk of landlord tenant issues on the side, mostly on the landlords behalf but I do take tenants. I think a lot of this also has to do with a “face to the victim” mentality- it’s the same reason people feel ok stealing from a giant corporation like Walmart and target but less okay about it when they can put a face to their victim ie smaller businesses and mom and pop shops. \n\nIt’s easier to feel okay about burning a major housing corporation that you put no face to but a lot harder to avoid guilt when your 75 year old LL is texting you that they need that money because social security won’t cut it for the month.",
            "title_similarity": "0.7550125",
            "sentiment_compound": -0.359
        },
        {
            "id": "h2g0knf",
            "score": 1,
            "text": "We need tenant cooperatives: non-profit apartments owned by the tenants or the community/city/state.",
            "title_similarity": "0.5364582",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2g0pw1",
            "score": 1,
            "text": "Also a factor is large-scale rental management companies cross-level vacancy losses, so the overall impact is much less than if an owner has fewer properties.",
            "title_similarity": "0.7950406",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2g0qwj",
            "score": 1,
            "text": "So the moral of the story is. Do not sell your house to corporations like Black Rock.",
            "title_similarity": "0.52862954",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2g1i1j",
            "score": 1,
            "text": "When i had a rented a duplex from a small family landlord I had to ask for a rent extension once over a paycheck spots delay (rent die Thursday, got a pay check late Friday, wouldn’t post until monday) Sure it’s fine, take a few days!”\n\nCorporate landlord middle manager after i had a direct deposit delay at at a new job was like “after 3 calendar days of nonpayment we start the eviction Process per state law”",
            "title_similarity": "0.68112004",
            "sentiment_compound": -0.7644
        },
        {
            "id": "h2g24ww",
            "score": 1,
            "text": "Interesting how unscientific this is. When you disregard major factors in the decision to evict you end up with results you wanted.",
            "title_similarity": "0.4356042",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2g2839",
            "score": 1,
            "text": "What is the control group? What is the hypothesis?",
            "title_similarity": "0.11747138",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2g28k0",
            "score": 1,
            "text": "I bet large landlords got scammed a couple of time and now don't play with emotions no more.",
            "title_similarity": "0.70279133",
            "sentiment_compound": -0.5
        },
        {
            "id": "h2g2aqt",
            "score": 1,
            "text": "I think this is just a subset of “All businesses become shittier the bigger they get.”",
            "title_similarity": "0.56578577",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2g2rmk",
            "score": 1,
            "text": "It also makes screening candidates much easier.  My mom used to meet every renter in person prior to renting to then. My in laws who do it professionally with hundreds of units, just let a management company do it.\n\nMy mom would never rent to a single person. She rented to married couples with little kids. \n\nMy in-laws rent to whoever passes a credit and background check.",
            "title_similarity": "0.61838925",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h2g31mu",
            "score": 1,
            "text": "That’s odd because if you don’t pay you don’t stay. Buddy or not",
            "title_similarity": "0.48223585",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2g3gnf",
            "score": 1,
            "text": "This is why Tenants Right to Counsel laws are so important- these big companies will only think twice about casual eviction if they know they’ll have to expend resources to defend it in court.",
            "title_similarity": "0.719895",
            "sentiment_compound": 0.0429
        },
        {
            "id": "h2g49il",
            "score": 1,
            "text": "Not only that but our entire financial system is a sham ran by criminals who are protected by other criminals.",
            "title_similarity": "0.57419604",
            "sentiment_compound": -0.8047
        },
        {
            "id": "h2g4bud",
            "score": 1,
            "text": "Was this in question? It’s the same with any large organization/business/government. Personal relationships create personal responsibility for the wellbeing of those involved (unless a psycho/sociopath). The greater emotional distance there is, the greater the chance someone will become a “number,” rather than an individual.",
            "title_similarity": "0.68665385",
            "sentiment_compound": 0.8271
        },
        {
            "id": "h2g4y39",
            "score": 1,
            "text": "Also, many small business landlords find eviction filing difficult and hard to enforce.",
            "title_similarity": "0.7255175",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h2g5x5p",
            "score": 1,
            "text": "thats why someday property management companies of the 21st century will be looked like the cigarette companies of the 20th.",
            "title_similarity": "0.28852105",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2g5zmz",
            "score": 1,
            "text": "My anecdotal experience agrees with this. I had a much better time dealing with a person than a company. Now I own and feel even better. I would like to see more people own.",
            "title_similarity": "0.485166",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h2g687m",
            "score": 1,
            "text": "And that’s why they are small landlords. \n\nYou have to disconnect from or lack empathy for individuals in order to have the best shot at business success. Not everyone wants that",
            "title_similarity": "0.7299596",
            "sentiment_compound": 0.765
        },
        {
            "id": "h2g6ddo",
            "score": 1,
            "text": "People who often hate on landlords don’t realize small time landlords aren’t the problem.  Conglomerates are buying up lots of housing and apartments with intent to screw people over.  It’s happening in my small town, now.  A company from a city 200 miles away is buying tons of old house to turn around and rent them out at costs closer to what the rest of us are paying in mortgage.",
            "title_similarity": "0.7922015",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h2g6syh",
            "score": 1,
            "text": "Man here in lower lower Texas they just change the locks on you.....",
            "title_similarity": "0.38038635",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h2g6u3i",
            "score": 1,
            "text": "Noted: don’t rent from overweight landlords",
            "title_similarity": "0.5782255",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h2g7pbj",
            "score": 1,
            "text": "I’ll throw my two cents in as well. I work in a debt collection law firm and we have a number of small landlord clients who prefer to not evict, but let the contract run its course and then go after the tenant with Wage and Bank Garnishments. It’s less direct work for them and reduces the risk of the property being trashed. It’s generally accepted they’ll only recover about 50% (maximum 75%) but they are also able to charge interest on the debt and include repair costs that go beyond simply keeping the deposit.",
            "title_similarity": "0.774403",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h2g7xc6",
            "score": 1,
            "text": "Who would have guessed corporate monoliths driven by greed would do such a thing.....",
            "title_similarity": "0.53317493",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2g81uq",
            "score": 1,
            "text": "I manage a handful of rentals, about 25 or so.  I try to maintain a connection with all the tenants.  I’ve found that doing that is the best way to try and keep disaster away.  Nobody wins during an eviction, and so the best thing to do is resolve it before it gets to that point.  Lots of owners can’t afford an extended period of non payment anyway.  It gets tougher though to keep them close as the  company gets larger.  At some point things have to tighten up.\n\nCash for keys is a pretty wise move regardless of the size though.Yes there is a short term loss, but it’s far less than the loss that would probably be incurred from a nasty eviction process.  Some owners don’t care though because they can afford the hit and would just assume lose money than let people live rent-free.",
            "title_similarity": "0.7946219",
            "sentiment_compound": -0.6014
        },
        {
            "id": "h2g943d",
            "score": 1,
            "text": "Just like anything else, it's easier to dehumanize and detach your self from those human emotions when you hide the other humans behind categorization numbers and bureaucratic constructs. \n\nNo cares about TENANT 265397-25\n\nbut people might be concerned evicting Sarah the single mother that works and manages to bake cookies for the kids on the block, who likes to garden. \n\nEven better (worse?) when you don't even have to see them face to face and just send letter or texts, to avoid all the crying and begging. And the number to call to dispute or address the issue is an automated answering maze. \n\nAutomation and modernization dehumanizes and detaches us from ourselves, and creates buffers to allow more callous unfeeling action.",
            "title_similarity": "0.5916466",
            "sentiment_compound": -0.8999
        },
        {
            "id": "h2g9pgg",
            "score": 1,
            "text": "They also use all types of tactics to make you seem like a bad Tennant. Including moving people into nearby units with the intent of making you look bad. Landlords are Earth's scum.",
            "title_similarity": "0.5768801",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h2g9yad",
            "score": 1,
            "text": "Nothing comes without a cost. People think that strong eviction protections benefit renters and many people want them stronger.  The negative side (there always is one) is that fewer people want to rent as an investment option.  That lowers inventory and definitely raises rent costs.  I would never rent a house here in Seattle.  One irresponsible renter with a lawyer could toast you financially.   There are much easier way to invest in housing (REITs, ETFs, financial equities) without that risk.  And it's actually sad, because providing rental properties is a big benefit to a city.",
            "title_similarity": "0.76200724",
            "sentiment_compound": 0.6822
        },
        {
            "id": "h2ga1dv",
            "score": 1,
            "text": "Yup, as a landlord, I just want my tenants to have a good time. If they are a little late or whatever, it doesn't bother me.",
            "title_similarity": "0.510183",
            "sentiment_compound": 0.6412
        },
        {
            "id": "h2gaarf",
            "score": 1,
            "text": "I've found this to not be true.  My last landlord was about 160lbs and he was very strict and corporate.  My current landlord is closer to 300lbs but he's super nice and lets us do whatever we want within reason.  I'm not sure how size would affect their conduct.",
            "title_similarity": "0.77429473",
            "sentiment_compound": 0.8121
        },
        {
            "id": "h2gadkx",
            "score": 1,
            "text": "Alot of interesting comments here.\n\nJust want to say that what the title implies to me, that small time landlords often delay filing against tenants as they have more of a personal relationship is a thing.  Often then, these tenants take advantage of it (often from the start - professional tenants is a term for a reason).  So the concept of 'cash for keys' as is being discussed is not always a 'win-win' as it is the landlord paying someone who owes them alot to leave.  It may be the best thing for the landlord, but calling it a win when the tenant already owes 1000s can ring hollow in that situation.\n\nYet if those landlords brought rent suit against the tenants when they first fall behind, necessary to protect themselves, reddit would call them a slum lord no question.",
            "title_similarity": "0.7992461",
            "sentiment_compound": 0.8201
        },
        {
            "id": "h2gafwl",
            "score": 1,
            "text": "On the other hand, small landlords might be managing their own money and be willing to be lflexible, while large landlords are managing money for on behalf of others and have a duty to protect that investment",
            "title_similarity": "0.69577277",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h2gayry",
            "score": 1,
            "text": "This common sense \"science\" is getting old.  Of course large/corporate landlords file more evictions and not just because they have more tenants.  It is because they can afford to do so.\n\nThe reason small landlords have a personal relationship is because they don't have a third party to collect the rent.\n\nThis is common sense and quite honestly, it isn't real science.  It is college level qualitative research that might be good for a C or B depending on the teacher.",
            "title_similarity": "0.83005834",
            "sentiment_compound": 0.8357
        },
        {
            "id": "h2gb6t3",
            "score": 1,
            "text": "My landlord is very small -about 5'2 120 so I'm safe.",
            "title_similarity": "0.45549113",
            "sentiment_compound": 0.4902
        },
        {
            "id": "h2gbno5",
            "score": 2,
            "text": "It also probably has something to do with the resources required to formally evict someone",
            "title_similarity": "0.40943468",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2gcao4",
            "score": 1,
            "text": "Yes, landlords get bashed equally but we rent duplex for well below market rate because we like to keep good tenants that live with us. They are appreciative and often will shovel the sidewalk even though it isn’t their duty or give little gifts. I can see how many landlords feel justified kicking out their tenants since they have no relationship with them and don’t even know what they look like.",
            "title_similarity": "0.7420012",
            "sentiment_compound": 0.9661
        },
        {
            "id": "h2gcea3",
            "score": 1,
            "text": "As true as that may be, anecdotally my recent landlord was “small”, originally inheriting the property in a will.\n\nShe did not do anything to improve the house, fought us on every corner and then demanded we pay to fix a bunch of stuff (which didn’t work when we first started our tenancy)with the deposit money.\n\nLandlords can be greedy buggers if left unchecked, there should be more legislation and protection in favour of the tenants.",
            "title_similarity": "0.7397754",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2gcrmh",
            "score": 1,
            "text": "I'm sure similar things can be said regarding environmental damage. People that actually have to work and live in the community that's being destroyed are less inclined to accept this. An owner which may live on the other side of the planet doing zero work and can insolate their family from any foreseeable damage is not going to care.",
            "title_similarity": "0.6898742",
            "sentiment_compound": -0.8221
        },
        {
            "id": "h2gdx5w",
            "score": 1,
            "text": "I can’t wait to see the consequences around the corner for the American dream. I’m watching a group of about 100 local people about to be thrust into homelessness for the sake of capitalism. These people were hit so hard by COVID, tried so hard to keep up on their rent and yet their landlords treated them like subhuman the entire time. Most didn’t even miss a single month’s payment. They were just late and had to split payments across the month. Yet the landlords were extremely vicious. Most of the landlords in the area though Covid wasnt real or are your typical trump die hard that bought into the lunacy of the conspiracy theories he tried pushing.\nYes I am one of these tenants. I reserve a conversation with my landlord where I made a comment “yes we’re in a pandemic, I’m suddenly laid off, and yet you still get all of your money just not all at once.” To which they replied “there’s no pandemic, that’s made up. Get me my money now or you’re out. My uncle is over evictions in this county and I can make anything push through the system regardless of moratoriums.” That’s been pretty much a monthly conversation for 6 months.\nThen my boss is a landlord that owns 6 properties he spends zero money in upkeep because according to him “they’re rentals and will just get torn up anyways.” He tried talking me into renting from him but the house was so run down while being so expensive that I just laughed at him. He’s also involved in a lawsuit to end the moratoriums early so he can evict. According to him there’s also no pandemic and people are just being lazy and buying TVs instead of paying rent……yes this is the Deep South and yes there’s definitely a bias towards minority tenants in these conversations I didn’t expound on.\nSo when all of these people gets their way and people still out of work, or back to work trying to get caught up, or people like me that took a $40k pay cut because my company didn’t reopen, what then? What exactly is the grand plan here? Mass influx of homelessness? They so called programs to help are a joke and people that received unemployment made too much to get any assistance which is absurd. What exactly is the grand plan here? At the end of the day this country’s greed will be its downfall.",
            "title_similarity": "0.7369386",
            "sentiment_compound": 0.8506
        },
        {
            "id": "h2gdyuv",
            "score": 1,
            "text": "I prefer large landlords because it helps keep the riff raft out.",
            "title_similarity": "0.5248528",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h2ge030",
            "score": 1,
            "text": "My landlord is also a teacher.\n\nHe gave me a discount last year when I got into a car accident, and then I came home and my bathroom had flooded while I was in the hospital. Then he also called someone in to fix it that night.",
            "title_similarity": "0.50187385",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2gei5n",
            "score": 1,
            "text": "I've lived in slums of all kinds, still do, private landlord or company run. I prefer company because you're not begging someone to fix things they refuse to pay for, whereas a company run complex just has a process that pushes the on-site employees in the right direction, just to keep everything above board.\n\nUnless a problem has some kind of tenant rights paradox going on, it's just a work order and it gets done. Plus, you get onsite maintenance instead of a \"who tf is this con artist they hired this time to save money\" situations.\n\nThey also don't have to tolerate a problem tenant for too long either, unless the tenant is particularly clever at flying under the radar with whatever they're doing with the unit and paying once the deadline arrives every time, rinse and repeat.",
            "title_similarity": "0.7537173",
            "sentiment_compound": -0.228
        },
        {
            "id": "h2ger6l",
            "score": 1,
            "text": "Land value tax. With each rental property you own your tax rate for all properties should increase. It should be prohibitively expensive to own more than a certain amount of rental properties.",
            "title_similarity": "0.6248319",
            "sentiment_compound": 0.7239
        },
        {
            "id": "h2gfjzg",
            "score": 1,
            "text": "Corporate entities by their very nature, are irresponsible. How can you have any accountability when there are zero consequences for corporate players?\n\nA smaller landlord doesn't want the hassle.\n\nThe large landlord will have the sheriff over to evict you the first chance they get because that's what the legal department told them to do.",
            "title_similarity": "0.7104719",
            "sentiment_compound": -0.2229
        },
        {
            "id": "h2gh4eh",
            "score": 1,
            "text": "This is totally true. As a former landlord of just one rental, I totally never raised rent and if it was late it was totally fine. In the end though, I did 2 evictions because of late payment once it became me paying for someone else's way of living.",
            "title_similarity": "0.6424775",
            "sentiment_compound": 0.6353
        },
        {
            "id": "h2ghpcn",
            "score": 1,
            "text": "A lot of land phobia  in these comments",
            "title_similarity": "0.34088308",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h2giby1",
            "score": 1,
            "text": "small landlords make other peoples problems their problems",
            "title_similarity": "0.62684023",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h2giisr",
            "score": 2,
            "text": "You know, there is a simple reason for this.\n\nEvictions cost money.\n\nSmall time property owners don't have large sums if cash to file mass evictions.",
            "title_similarity": "0.73948145",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2gir3h",
            "score": 2,
            "text": "As a landlord that has worked for large companies and small; this is very true.",
            "title_similarity": "0.4863326",
            "sentiment_compound": 0.4754
        },
        {
            "id": "h2givpq",
            "score": 1,
            "text": "I've been told my area an eviction is 5k to file.  So it's hard for a small time landlord to evict when it's going to cost them 10k.",
            "title_similarity": "0.7162261",
            "sentiment_compound": -0.5688
        },
        {
            "id": "h2gjeu8",
            "score": 1,
            "text": "I think small landlords finish eviction without filing because the tenant disappears. Not because the small landlord is being nicer. The large landlord wants a paper trail even if the tenant disappears.",
            "title_similarity": "0.731419",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h2gkdxk",
            "score": 6,
            "text": "Yes and because large landlords already have law firms all set to file a notice to vacate  as soon as rent is due. The large landlords work with the firms every day on these cases. I used to work for such a firm.",
            "title_similarity": "0.5943117",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2gne7h",
            "score": 1,
            "text": "of course. have you ever tried to do any form of business with a large corporation? they dont have the slightest clue whats going on at the ground level. all they see is a number, and said number didnt go up as expected. so its time to replace said number with another number. to a small private landlord, Im a person they have met, and know. (still a scummy business to get into tho but some are actually decent people)",
            "title_similarity": "0.79503256",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h2gnpt7",
            "score": 2,
            "text": "makes sense, large landlords seem to rent as their sole income. while small land lords often rent for extra cash on the side. it would suck so bad to have all of your tenants not paying rent , and lose your property or not be able to live yourself a normal life.",
            "title_similarity": "0.8159404",
            "sentiment_compound": -0.8776
        },
        {
            "id": "h2gntqw",
            "score": 1,
            "text": "It’s also a matter of practicality.\n\nA landlord is going to follow the path of least resistance. Because of the additional work involved in successfully pursuing an eviction through the courts, it is typically easier to try to work with a tenant.\n\nOn the other hand, a corporate landlord overseeing dozens, hundreds, or thousands of properties is likely to have a department dedicated to pursuing legal evictions. For them it becomes a bureaucratic function much easier than engaging with tenants on a direct, personal level.",
            "title_similarity": "0.71512896",
            "sentiment_compound": 0.9325
        },
        {
            "id": "h2go1w4",
            "score": 1,
            "text": "I don't know what country this is regarding, but here in the UK you're almost always better going with someone who you know personally through family and friends. This way, if you have any issues with the house they're sorted quickly and you have more leeway with changing things like carpets and wallpaper. I've lived in houses owned by housing associations and my god they are ruthless, what's amazing is that when you are disputing rent they can literally sell your debt on no problem and negatively impact your credit score. I had one association take me to court, the court letter was sent to my old address conveniently so I didn't get notice and found out about 2 year later that I owed them over 1500 rent and 2000 in damages (I didn't) and despite me contacting the courts to say I never received notice, they said too much time had passed to dispute it. So here I am, negative credit rating, over 3500 in debt and a county court judgement, I'll never own my own home now, not ever, so landlords who you know are a blessing.",
            "title_similarity": "0.7216265",
            "sentiment_compound": 0.8798
        },
        {
            "id": "h2gocc1",
            "score": 1,
            "text": "Aka large landlords are assholes…",
            "title_similarity": "0.5897937",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2govk9",
            "score": 1,
            "text": "Is it determined by height or weight or is there a formula ?",
            "title_similarity": "0.28529397",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2gox54",
            "score": 1,
            "text": "Apply this psychology, and a very similar \"dilemma\" in care for others, and apply it to the trend of medical offices now becoming part of larger conglomerates and it will reveal an increasingly real and scary dystopian future of medical care.",
            "title_similarity": "0.48022193",
            "sentiment_compound": 0.3008
        },
        {
            "id": "h2gphu5",
            "score": 1,
            "text": "I feel like there can be people throwing off the numbers here by renting to their children or close family/friends who if they kicked out would just move in with them.",
            "title_similarity": "0.6009642",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2gpz99",
            "score": 1,
            "text": "Rented from a property company years ago, and if you were 1 day late on rent there was an eviction notice taped to your door. Obviously this isn’t legal it was designed to scare people, but it was effective.",
            "title_similarity": "0.7373707",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h2gqeqn",
            "score": 1,
            "text": "Wait! Are you telling me that larger companies are less personal than small businesses? This is insane!",
            "title_similarity": "0.6103471",
            "sentiment_compound": -0.508
        },
        {
            "id": "h2gqj23",
            "score": 1,
            "text": "In an alternate headline for the exact same story, “Small landlords lack the political, economic, and legal power to compete successfully against rich competitors!”",
            "title_similarity": "0.7538902",
            "sentiment_compound": 0.7424
        },
        {
            "id": "h2grfrr",
            "score": 1,
            "text": "don't really see what their size has to do with anything",
            "title_similarity": "0.30188718",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2gs0yi",
            "score": 1,
            "text": "This is the most unremarkable possible scientific paper I've ever seen.",
            "title_similarity": "0.3484817",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2gs5xt",
            "score": 1,
            "text": "Small landlord, plz no loud noise late night fren\n\nLarge landord, ExECuTE ORDER 66!",
            "title_similarity": "0.5915689",
            "sentiment_compound": -0.2942
        },
        {
            "id": "h2gswpb",
            "score": 1,
            "text": "The place I lived at was bought out by a large corp.\n\nLess than 3 months later they evicted all the old folks and brought in college kids who partied 24/7.  \n\n\nCrime shot through the roof (it used to have the lowest crime of any apartment complex in the city), both police officers who lived in the apartments left because their neighbors were partying 24/7. \n\nI left soon after.\n\nThey also doubled the rent and took crazy government handouts. Like there's a $ handout for improvements to your apartments if you put in washer/dryer hookups....but if you put in a washer/dryer in most apartments, it wouldn't fit, they put the hookups in anyways. \n\nThey also changed the rental agreement so they could let government inspectors in without your notice. They came in my apartment 3 times.\n\nAll the apartments in the city are now owned by 3 large corps except for 1 (that I know of).",
            "title_similarity": "0.6885987",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h2gtakk",
            "score": 1,
            "text": "It's a whole lot easier to evict \"resident #437\" than it is to evict \"Bob and Shelly and their 3 year old daughter Sarah\" and it's by design.",
            "title_similarity": "0.585525",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2gubqo",
            "score": 1,
            "text": "It's more than that. \n\nSmall landlords also do not have all the resources and services available on tap, and they have to be cautious as to when and how to utilize those services and expend those resources.",
            "title_similarity": "0.67672193",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2guu11",
            "score": 3,
            "text": "did they glaze over the fact that large landlords are especially beholden to fair housing laws? they literally CANNOT make the choice to not evict someone, or to give someone a pass. they LEGALLY have to treat everyone the exact same, and that leads to no-tolerance eviction policies. if they were to give one person a pass, they legally would have to give EVERYONE a pass.\n\ni've long held that this was a bad law when it was written, and that landlords SHOULD have the agency to dictate who lives in their communities, and whether or not to extend courtesies to people based on their relationship with the landlord. E.G. a tenant who respects the property, and has made good faith efforts on rent, is far more desirable than one who doesnt respect the property but pays rent.\n\nthe intent of the law was to curtail race/sex/age based rental discrimination. they overlegislated, and its far worse than the original intent of the law which was good in spirit. E.G. the local politicians here are attempting to buy the poor vote, by making it illegal for a land lord to discriminate against potential renters for ***literally the lack of income***. meaning it would be illegal to deny someone who has zero income. thats how stupid its gotten.",
            "title_similarity": "0.6961362",
            "sentiment_compound": -0.9612
        },
        {
            "id": "h2gw6qw",
            "score": 2,
            "text": "nothing in this title indicates proportionality",
            "title_similarity": "0.23108739",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2gx4qr",
            "score": 1,
            "text": "...and the Harvard business model considers this weakness",
            "title_similarity": "0.42957398",
            "sentiment_compound": -0.5023
        },
        {
            "id": "h2gy244",
            "score": 1,
            "text": "My sis manages properties for a living, and it would seem that her superiors reward those that are strict about evicting people.  Not that some of them don’t deserve it, but in the eyes of the company, there are no excuses and it is the job of people like my sister and others to strictly enforce evictions even during hard times like the pandemic we just all lived through.  Interesting thing to mention, my sisters job was considered “essential” during the pandemic.  It was essential to evict people while we were all shuttered during the worst pandemic many of us have ever seen.  I know most places had a rent pause in effect during the pandemic, but not all were the same or even a fair length, looking at you southern united states.",
            "title_similarity": "0.6724559",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h2gy8c2",
            "score": 1,
            "text": "Large ones like over 250 pounds?",
            "title_similarity": "0.33398002",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2gygxd",
            "score": 1,
            "text": "Large landlords have departments to handle this type of transaction.",
            "title_similarity": "0.529813",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2gzdnl",
            "score": 3,
            "text": "To be fair, if you’re renting a duplex it’s much easier to pick two quality candidates and you can be more selective. If you have 200 units to fill, chances are you’re going to get some bad tenants.",
            "title_similarity": "0.7016882",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2h00df",
            "score": 1,
            "text": "Or more likely small landlords get to be pickier...\n\nStudies like this aren’t scientific in the same way a chemistry or physics study is.",
            "title_similarity": "0.6251636",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2h0mv4",
            "score": 1,
            "text": "As a small landlord I know that relationships with the tenants make a big difference and I have the time to be at least passing friends (people I would happily have a barbecue with) with all 20 of the people who rent from me. If things get tight for someone we have a conversation and figure it out. I'm sure the people with 200 tenants can't make that claim.",
            "title_similarity": "0.6466598",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h2h0u3c",
            "score": 1,
            "text": "Que, Blackrock Capital",
            "title_similarity": "0.2739457",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2h1c7g",
            "score": 1,
            "text": "My landlord gave the entire building an eviction notice because of and accounting problem. They didn't bother to check why the whole building didn't pay rent.",
            "title_similarity": "0.6349721",
            "sentiment_compound": -0.5216
        },
        {
            "id": "h2h1haz",
            "score": 1,
            "text": "So the only way to inflict homelessness on someone is to reduce them to a dehumanized source of revenue? And you're also saying that it benefits large businesses to do so? Well ain't that the darndest thing.",
            "title_similarity": "0.6878021",
            "sentiment_compound": 0.2869
        },
        {
            "id": "h2h23eo",
            "score": 1,
            "text": "It's almost as if large corporations become distanced from their customers.  Relationships between a smaller business and their customers create extra cohesion.  Yes, you lose economies of scale.  But I think we can see what a single minded pursuit of economic productivity has wrought on our world.  This is just another example of why large corporations aren't worth the social cost.\n\nOf course, I don't think we'll see a successful shift in the global or national approach to commerce, but I will support anyone who tries...",
            "title_similarity": "0.7243004",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h2h300q",
            "score": 1,
            "text": "Small landlord here: I can attest that I am willing to accommodate hardships and situations if the tenant is willing to work with me. Need to be late this month because you’re going to night school? Totally fine, just make sure your not late to the deadline you set. Laid off? Try to get a job and ill reduce rent temporarily, I can get paid back over time or make a deal to recoup out of the deposit. \n\nThe only things I won’t abide are people destroying the property, repeat offenses of agreement terms, breaking the law using my property (drugs or prostitution), or if someone is just flat out a jerk. Eviction is a traumatic thing, and should only be done in the worst of circumstances.",
            "title_similarity": "0.67281115",
            "sentiment_compound": -0.942
        },
        {
            "id": "h2h3b9p",
            "score": 1,
            "text": "Here's an idea pay your rent, save stimulus checks for rent, and budget accordingly",
            "title_similarity": "0.39809132",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2h4eo4",
            "score": 1,
            "text": "It's also why small landlords go bankrupt so quick and turnover is high. I've gone 6+ months with tenants not paying because I gave them a benefit of a doubt, then found $10k+ in repairs after they've left. If your landlord isn't large that can totally put you out of business the first time around.",
            "title_similarity": "0.73967296",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2h4n1m",
            "score": 1,
            "text": "No. It’s because small landlords can’t fight the legal battles and take the hit of loss rent when the tenants are okayed by judges not to pay rent for months or up to 2 years.",
            "title_similarity": "0.7901361",
            "sentiment_compound": -0.6912
        },
        {
            "id": "h2h52bs",
            "score": 1,
            "text": "Landlords should be more willing to evict people in my opinion. If you have no land and can’t pay rent why should you have the right to stay? It’s just supply and demand",
            "title_similarity": "0.6411352",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2h5nz9",
            "score": 1,
            "text": "so encourage ny landlord to lose weight?",
            "title_similarity": "0.494798",
            "sentiment_compound": 0.2247
        },
        {
            "id": "h2h5san",
            "score": 1,
            "text": "What makes them say it has anything to do with morals? \n\nMaybe a small landlord just can’t afford to lose a tenant, because they make up like half their income.",
            "title_similarity": "0.7956023",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h2h5w2v",
            "score": 1,
            "text": "Doesn’t seem all that surprising to me",
            "title_similarity": "0.170896",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h2h66qu",
            "score": 1,
            "text": "Don’t have rent, get out. People helping people is great and should be encouraged but the attitude of expecting that is what is dragging this country down",
            "title_similarity": "0.5717504",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h2h684e",
            "score": 1,
            "text": "My neighbors rented their house out since they got stationed elsewhere. The current tenants should’ve been evicted day 1. Lied about having a dog, so didn’t pay the extra(we are dog lovers but they lied). They sell drugs and even had someone shoot you the house in a drive by. They lied about the mom having cancer and being late on payments. They lied about her being in the hospital with pneumonia(we witnessed her changing a tire during said hospital stay).. \n\nThe property manager was trash so they didn’t get kicked out.",
            "title_similarity": "0.6416311",
            "sentiment_compound": -0.9654
        },
        {
            "id": "h2h6db3",
            "score": 1,
            "text": "destroy all landlords",
            "title_similarity": "0.3023558",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2h6u0x",
            "score": 1,
            "text": "I feel like this supports the idea that corporations aren't people, that corporate structure incentivizes sociopathic conduct in the name of short term profit.",
            "title_similarity": "0.59251225",
            "sentiment_compound": 0.8061
        },
        {
            "id": "h2h72ts",
            "score": 1,
            "text": "Now realize that the entire country is operating via enormous conglermate corporations and realize how damaging this is to the people of this country when the individuals managing and working at these companies work for stock holders and not the people of this country such that all of humanity has been removed from interpersonal connections and relationsihps and become faceless anonymous machines with no morality or connection to the people who depend on them for their lives. \n\nIt explains everything about the disatrous turn this country has taken in terms of having the goods and services they need at affordable prices.",
            "title_similarity": "0.6806233",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h2h7qyw",
            "score": 2,
            "text": "I met a landlord through my job one time and would offer tenants $200 for them to move out if they were a few months behind. They always took the money and left.",
            "title_similarity": "0.62031853",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2h8lp9",
            "score": 1,
            "text": "Lots of people about to be in for a ride awakening when the moratorium lifts in a week. \n\nCan't just go 1.5 years without paying rent an expect to still have a place to live. Can't wait to see the real estate market go from a sellers market to a buyers market when they are flooded with all these new vacancies that need to be filled",
            "title_similarity": "0.6147883",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2h92kf",
            "score": 1,
            "text": "As a small landlord i find this statement to be 100% accurate. I have bribed almost every bad tenant I've ever had to leave. Going through the system is not something I have the time or money to do.",
            "title_similarity": "0.6980811",
            "sentiment_compound": -0.5302
        },
        {
            "id": "h2h9o8h",
            "score": 2,
            "text": "I disagree. This behaviour is driven by the characteristics of the tenants. A large landlord will evict a small tenant because it can, because there is and always be an imbalance in power between the two entities. Consider the reason a large landlord will hesitate to evict a large tenant -  because the large tenant (eg a supermarket) can and will push back. Large landlords are able to evict small tenants on a regular basis because there really are a lot of other small tenants lining up to take those evicted tenants place. Either you work in corporate and push the thin cats around, or you get on trying to be a thin cat and maybe get to live in the places the fat cats can only dream about.",
            "title_similarity": "0.7860912",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2harai",
            "score": 1,
            "text": "Since when do they measure the height and weight of landlords",
            "title_similarity": "0.5249771",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hclam",
            "score": 1,
            "text": "Did anyone else picture The Fat Controller from Thomas the Tank Engine when reading this headline?",
            "title_similarity": "0.44992507",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hd3lw",
            "score": 1,
            "text": "how is this \"science\"?\n\nhow reproducible is this, across multiple societies in multiple geographic regions?",
            "title_similarity": "0.28811902",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hd4vd",
            "score": 1,
            "text": "In other words, everyone who will be renting from blackrock in the foreseeable future will have zero Leeway. And that’s probably like 80% of the population in the next 10-20 years given the amount of properties they’re buying.",
            "title_similarity": "0.6360018",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2hdnhq",
            "score": 1,
            "text": "But, I don’t have the tyme for this",
            "title_similarity": "0.22766736",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2he4mv",
            "score": 1,
            "text": "Living in a apartment complex managed by a large landlord: we get a \"Eviction Notice\" for every other communication with the management.\n\nBicycle chained to rails when its raining? Eviction Notice.\n\nAutopay on rent failed when the autopay website broke? Late Fee, Eviction Notice (watched the mgmt guy rubber band these notices on a quarter of all apartment doors)",
            "title_similarity": "0.66131866",
            "sentiment_compound": -0.9378
        },
        {
            "id": "h2hevdd",
            "score": 1,
            "text": "My Landlord is like 5’3” am I good?",
            "title_similarity": "0.43877372",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h2hf4e9",
            "score": 1,
            "text": "Kind of the same with corporations. You work for one of them, you're just a number. Work for a company with 200 or less people, you are part of the family. I work for a smaller company and I'll NEVER go back to a big one.",
            "title_similarity": "0.5993357",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h2hfa97",
            "score": 1,
            "text": "Random who's filling up these nice real estate developments Big skyscrapers, condos?",
            "title_similarity": "0.48204228",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h2hfs1q",
            "score": 1,
            "text": "So like small business vs. corporations but for houses?",
            "title_similarity": "0.57655215",
            "sentiment_compound": 0.2255
        },
        {
            "id": "h2hh0qd",
            "score": 1,
            "text": "That and you have fewer resources to enforce.  I have a tenant right now that wants to break her lease 5 months into her 12 month contract.  She's being nice about it and following what is spelled out in the contract.  But if she just straight up told me she was leaving and that's that I wouldn't have much room to force her to abide by it without it becoming too much of a hassle and expensive.",
            "title_similarity": "0.68575263",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h2hjltd",
            "score": 1,
            "text": "20 dollars says it's the same for big business/small business and layoffs.",
            "title_similarity": "0.45347202",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hjpj6",
            "score": 1,
            "text": "I'm not an expert but I have a 2 house 4 unit front and back and haven't raised the rent I. 4 years and besides a week I've been paid every month. Not friends with the tenants and actually hate goi g over there but take care of stuff. \n\nIt's amazing when I read this stuff and try to figure out why people have issues. \n\nRaise rent the leave and you have to go d another. \n\nSomeone offers cash no job and wonder. \n\nIf they are paying don't raise and be happy.",
            "title_similarity": "0.78660506",
            "sentiment_compound": 0.6211
        },
        {
            "id": "h2hk14a",
            "score": 1,
            "text": "Money doesn’t sleep and doesn’t have feelings",
            "title_similarity": "0.32767296",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hk5rr",
            "score": 1,
            "text": "Let me break it for you: corporations are not people, so they don't have empathy. Clear?",
            "title_similarity": "0.5093328",
            "sentiment_compound": -0.2924
        },
        {
            "id": "h2hk8zy",
            "score": 1,
            "text": "I don't know man... Rented out my basement for like 15 years and in my experience, the people I would have a personal relationship with are typically also responsible about keeping the place in order and paying on time. The 2 times I seriously considered eviction they tenants had appalling behavior like punching a hole through the drywall cuz he lost a cod game, or smoking indoors despite many warnings, bringing friends over and allowing them to break into my storage room.... \n\nIn those cases if I were to try to formally evict, it would be an immensely stressful and resource intensive battle. Not to mention I would be beyond afraid what the tenant would do now he knows eviction proceedings are starting.",
            "title_similarity": "0.68201923",
            "sentiment_compound": -0.7279
        },
        {
            "id": "h2hkq9k",
            "score": 1,
            "text": "Is this really a surprise?",
            "title_similarity": "0.088935055",
            "sentiment_compound": 0.3353
        },
        {
            "id": "h2hl1tz",
            "score": 1,
            "text": "Good business oriented landlords don’t care about your sob story, they have learned that people will just continue to find excuses and then they’re suddenly in the hole for 6 months of rent and won’t ever see it by the time the eviction happens.\n\nSmall landlords try to work with people and get taken advantage of and have to do more work with chasing the money owed to them.\n\nIdeally, your tenants don’t wreck your place and always pay on time or early. Too bad idealism doesn’t work in the real world and the exact opposite is often a million times more common",
            "title_similarity": "0.7653433",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h2hl6xu",
            "score": 1,
            "text": "It's almost like the more removed you are from the consequences of your actions, the less empathy you have. Hmmmm....",
            "title_similarity": "0.45989558",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h2hljb5",
            "score": 1,
            "text": "In America, rather than having government assistance for people who are at risk of becoming homeless, the government will send men armed with guns to a place you currently live and *make* you homeless for failure to pay a private debt.\n\nThat’s insane.",
            "title_similarity": "0.7116302",
            "sentiment_compound": -0.875
        },
        {
            "id": "h2hm1i8",
            "score": 1,
            "text": "If your a small landlord, your the one who has to lose sleep deciding if you have to evict someone...\n\nI let a family with kids stay free for over half a year before I asked if they could find family or friends to help them out because it was gonna cause me financial problems. They moved a month later having made other arrangements and I didn’t have to be the asshole and kick em out. I was out a couple of grand, but at least I sleep at night. Pretty nice present to give someone who isn’t even related to you.. but like I said I prefer to sleep ok.",
            "title_similarity": "0.66801584",
            "sentiment_compound": 0.9393
        },
        {
            "id": "h2hma99",
            "score": 1,
            "text": "Large landlords only care if you pay on time, in full and cause no problems.",
            "title_similarity": "0.5437326",
            "sentiment_compound": 0.6197
        },
        {
            "id": "h2hn3of",
            "score": 1,
            "text": "Basically milgram’s experiment",
            "title_similarity": "0.046631053",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hneji",
            "score": 1,
            "text": "I suppose it’s true that you’re more likely to sue a stranger than your neighbor. This seems a bit like human nature, not a big academic coup.",
            "title_similarity": "0.6418706",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h2ho4n0",
            "score": 1,
            "text": "In my city it’s widely known that property management companies have hearts of stone. You’re less than just a number. Expendable. I found out the hard way once after 9/11 when I was laid off and late with the rent. They wanted to evict me and I had just gotten a new job. No deal. They kicked me out even though I would have been able to pay them. The eviction on my record that lasted seven years but luckily I was able to rent through a private landlord and we have a great relationship. Zero problems since 2002.",
            "title_similarity": "0.69747347",
            "sentiment_compound": 0.81
        },
        {
            "id": "h2hqk1t",
            "score": 1,
            "text": "This study is flawed, as it does not factor in things like the cost of fighting a protracted battle to evict deadbeat tenants, which can be a very large financial hurdle for small landlords to clear.",
            "title_similarity": "0.77276635",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h2hqsqz",
            "score": 1,
            "text": "I have one rental house and I generally am friends with my tenants.  I’ve never had anyone miss rent or trash the place, I’m usually disappointed when they move out.  My last three tenants have all bought houses in the area…can’t blame anyone for that.",
            "title_similarity": "0.63840425",
            "sentiment_compound": -0.2396
        },
        {
            "id": "h2hsokp",
            "score": 1,
            "text": "it couldn't at all be because large landlords have more tenants and that is why they evict more people?",
            "title_similarity": "0.71005744",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2htafl",
            "score": 1,
            "text": "I had a landlord that let me and my girlfriend rack up 2.5k in back rent because her mom worked for him at the laundromat he also owned (none of the trailers he owned had washer/dryer hookups for this specific reason) \n\nonly reason we got so far behind is because we both lost our jobs (worked the same company that just shut down with no notice) and jobs were scarce at the time here.  \n\nhe was probably the coolest landlord I've ever had",
            "title_similarity": "0.6690559",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h2huvsg",
            "score": 1,
            "text": "If there’s one thing people should unite on its property shouldn’t be invested in. To many families and people struggle to pay the insanely high rates set by these people who sleep on $100 bills.",
            "title_similarity": "0.7610198",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2hw888",
            "score": 1,
            "text": "Does this sub not cover science anymore?",
            "title_similarity": "0.21357146",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2hwcr7",
            "score": 1,
            "text": "The biggest factor going unmentioned here is that small landlords are much more picky with their tenants. Large landlords essentially rent to anyone who qualifies and have the infrastructure to handle the rare non-payment cases. Whether or not they’re legally allowed to, small landlords are looking at your whole life and deciding whether or not you are trust worthy. They have to, because one non-payment can be catastrophic for them. \n\nI work for a large landlord and I rent to recent college grads and students all the time if they qualify. My brother is a recent grad with a good job and he literally went 0/25 on rental applications with small suburban landlords because they’d rather rent to people in their 40’s who are established with families. I’ve never had to make that sort of distinction in my job.",
            "title_similarity": "0.8046253",
            "sentiment_compound": -0.1022
        },
        {
            "id": "h2hwji3",
            "score": 1,
            "text": "Does this not breach fair housing laws?",
            "title_similarity": "0.40880662",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h2hxe0u",
            "score": 1,
            "text": "Generally speaking, it sounds like government ownership of properties for rent is the best way possible to both avoid tenant abuse and general bloat. It also means that the government must adequately provide housing for its citizens, which adds pressure and competition to the market as well.",
            "title_similarity": "0.5827629",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h2hxwjg",
            "score": 1,
            "text": "Solution! Outright ban large ownership of rental units and properties.",
            "title_similarity": "0.43630672",
            "sentiment_compound": -0.3802
        },
        {
            "id": "h2hyrjq",
            "score": 1,
            "text": "Well when you have rich saudi princes buying homes across the world so they can make money by doing nothing, it shows you that this country doesn’t care about its population.",
            "title_similarity": "0.6600009",
            "sentiment_compound": 0.836
        },
        {
            "id": "h2hzi2d",
            "score": 1,
            "text": "Nah, the big landlords have a legal/eviction department to handle it. Eviction is a PITA process in most jurisdictions where you have large scale landlords.",
            "title_similarity": "0.653322",
            "sentiment_compound": -0.8192
        },
        {
            "id": "h2hzsm5",
            "score": 1,
            "text": "As someone who has done well over 40 plus evictions at a large apartment company almost all the people who got evicted knew it was coming and did not seek help. The people put them selves in the situation to get evicted. There are too many programs out there that help with rent. I dont have sympathy for people that make no effort to better their lives.",
            "title_similarity": "0.796033",
            "sentiment_compound": 0.2805
        },
        {
            "id": "h2hzxyq",
            "score": 1,
            "text": "It’s true. The larger the corporation the less they want to consider anything but numbers. It’s their job I suppose - to keep a distance from humans.",
            "title_similarity": "0.670578",
            "sentiment_compound": 0.2289
        },
        {
            "id": "h2i0cz3",
            "score": 1,
            "text": "No one should be allowed to become too big. We live in the age of conglomerates and that is one of the reasons why there is so much harm being caused. We are tribal beings. We need personal relationships. A small landlord will needs you more than a large one. It is more likely that there is a mutual relationship there.\n\nI have rented with small and big landlords. The big ones I have never even seen their faces. Even through all the covid struggles, they want to know nothing about their tenants. Just a large company to manage and squeeze.\nWhen landlords have to look you in the eye they are less likely to cut you cold bloodedly because we are a social species.\n\nLarge corporations are alienating. They eliminate human relationship and replace it with processes. Processes must flow, because they are not designed to adapt to human suffering. We need an economy that ensures balance of power. The imbalance is already huge and growing.",
            "title_similarity": "0.75960636",
            "sentiment_compound": -0.8448
        },
        {
            "id": "h2i2ial",
            "score": 1,
            "text": "It's articles like this that makes me wish my dad sell an apartment he inherited from a deceased relative. He's renting it out now but he's never had experience renting property before. If there's a big issue with the tenant, or there's a huge tax bill on the property, i don't think he could handle it. He's using the rental income to live off of. I think he would be much better off if he sold the property and took the lump sum.",
            "title_similarity": "0.7722471",
            "sentiment_compound": 0.8555
        },
        {
            "id": "h2i2lna",
            "score": 1,
            "text": "I believe it, my dad was lucky to purchase 3 additional homes in our city during the recession. Current rental prices for homes in my city start at about 2100 a month. He barely increased their rent from 1500 to 1700. He says he understands. He struggled when he made his way into this country illegally in the 80’s. He knows the struggle and understands that parents are doing their best to keep a roof over their kid’s heads. He’s made relationships with all his tenants and knows their kids names. They always have small talk when they come to bring him the rent so he knows them on a personal level. He even had a heart to heart with one of them that started abusing alcohol and drugs. His wife had come and told my dad (I guess just to vent), I’m glad to say he’s back on the right path. It’s harder to look at them as just an income gained from a rental property when you get to know them on a personal level. My dad is a good man.",
            "title_similarity": "0.7286123",
            "sentiment_compound": 0.9452
        },
        {
            "id": "h2i38hn",
            "score": 1,
            "text": "Yeah having dealt with small landlords vs corporate style ones, this makes sense. Had a corporate management styled apartment complex try to charge me $2,000 for carpets that were professionally steam cleaned and were perfectly fine upon move out. I have never had this problem with small “mom/pop” landlords as I am always respectful of where I live.",
            "title_similarity": "0.6511128",
            "sentiment_compound": 0.795
        },
        {
            "id": "h2i3kwi",
            "score": 1,
            "text": "Sadly I fear I'm of the last generation to own my home, they don't make anymore land and hedge funds and corporations are gobbling it up left and right paying average joe what joe believes to be a huge price for his land, because they know one day, one day soon, joe will start paying it all back in rent because they own all of it... sad day for average joe.",
            "title_similarity": "0.73710847",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h2i3w0a",
            "score": 1,
            "text": "Hello science, welcome to the real world! Corporations pay people 9 dollars an hour, 40 hours a week. Imagine paying a person to work at your house on a project, like cleaning or building something for an hour and paying them 9 dollars! You can't. Corporations can.",
            "title_similarity": "0.6066653",
            "sentiment_compound": 0.6892
        },
        {
            "id": "h2i6s3e",
            "score": 1,
            "text": "Wonder what's gonna happen June 30 when moratorium is over.",
            "title_similarity": "0.29430926",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2i91cg",
            "score": 1,
            "text": "Question, My mom has tenants in our duplex home. We wish to  free the space for my wife and I since we are expecting a child and it would be much cheaper since we are in So cal. Am I a villain?",
            "title_similarity": "0.5736431",
            "sentiment_compound": 0.34
        },
        {
            "id": "h2iax9k",
            "score": 1,
            "text": "This is the opposite of my personal experience.  The (no fault) evictions I've had to deal with were ALL small landlords, one of which was illegal and one of which retroactively violated the law and I received one months rent in compensation - barely a dent in the expenses I incurred thanks to the involuntary move.\n\nI was never in my 20 years of renting ever evicted from a large corporate holding.",
            "title_similarity": "0.66782355",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h2ib0gi",
            "score": 1,
            "text": "Make a Bracketed property tax, price large landlords out of the business",
            "title_similarity": "0.6943668",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ibw00",
            "score": 2,
            "text": "My landlord owns like 3 properties... at the beginning of the pandemic she sent out an email saying if anyone needed help paying rent to reach out and they could work something out... seems like not enough landlords felt the same.",
            "title_similarity": "0.7232871",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h2ie2da",
            "score": 1,
            "text": "This has been my theory of warfare and huge corporations, it’s all become more dehumanized by scale and technology.",
            "title_similarity": "0.52324903",
            "sentiment_compound": -0.4754
        },
        {
            "id": "h2ie8zs",
            "score": 1,
            "text": "I remember my grandparents were landlords for a few small pieces of property, mostly owned by students at the nearby college, and even though many of the tenants would eventually move out, they would always make a personal connection with them.",
            "title_similarity": "0.53540045",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2iehpk",
            "score": 1,
            "text": "But if it were really that bad for landlords, we would see hesitancy in people going into that line of investment.\n\nBut we see the opposite: more and more people are itching to buy property to rent, there’s eagerness to buy and rent out. \nLots of landlords griping in this thread - they could always cash out and get a job/invest elsewhere, but for some reason they keep renting out. Maybe it’s their life’s passion? No, it’s just a good way to make money for relatively little of one’s time. \n\nBeing a landlord is a choice. Being a renter is usually not.",
            "title_similarity": "0.7575179",
            "sentiment_compound": 0.597
        },
        {
            "id": "h2if96d",
            "score": 1,
            "text": "It's easy to find out who the landlords are and where they live.",
            "title_similarity": "0.3077077",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2ifg97",
            "score": 1,
            "text": "Most of the exceptionally rich population are that way because they were repeatedly willing to violate to accomplish their financial goals",
            "title_similarity": "0.6195612",
            "sentiment_compound": 0.5413
        },
        {
            "id": "h2ifneq",
            "score": 2,
            "text": "II had a house with an inlaw suit that I rented out for 20+ years. I was always getting played by the tenants as this headline suggests. One lady was in teaqrs that she could'n't pay the rent so I dropped the price for her. I had \"free electricity and cable\" for the rooms and the first thing the tenant would do is put in 100 watt lightbulbs and burn them 24 hours a day and then put in a window air-conditioner left on full when they were away at work all day.",
            "title_similarity": "0.59871185",
            "sentiment_compound": 0.7181
        },
        {
            "id": "h2ifony",
            "score": 1,
            "text": "Congratulations u/smurfyjenkins ! Your post was the top post on r/science today! (06/21/21)\n\nTop Post Counts: r/science (1) \n\n*This comment was made by a bot*",
            "title_similarity": "0.32498553",
            "sentiment_compound": 0.7955
        },
        {
            "id": "h2ihftf",
            "score": 1,
            "text": "\"Morally\"\n\nSmaller landlords often simply cant afford to evict bad tenants, not knowing how long till the next one comes or if the next one will pay their rent.\n\nOften times a bad tenant is better than the unknown.",
            "title_similarity": "0.81043804",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h2iiozx",
            "score": 1,
            "text": "Maybe if the small landlords went to the gym, they could compete with the large landlords.",
            "title_similarity": "0.60970604",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ikpxg",
            "score": 1,
            "text": "If ya can’t pay. Hit the bricks we are not doing this for our health",
            "title_similarity": "0.5100596",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h2iofzl",
            "score": 1,
            "text": "I seen this in person a customer who was a landlord came into my shop very upset looking and I asked what was up, he said he had to evict a tenant that destroyed the apartment with trash (I think mental illness since the landlord was so distraught).\nIt was easy to tell he felt terrible but was left with no other choice.",
            "title_similarity": "0.62051296",
            "sentiment_compound": -0.8626
        },
        {
            "id": "h2ipizo",
            "score": 1,
            "text": "So big companies don't have souls? How is this news?!",
            "title_similarity": "0.55007464",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2itacm",
            "score": 1,
            "text": "There shouldnt be any large landlords, people should have their own house and not need to rent from vultures renting sardine cans for 2000$/€ a month...",
            "title_similarity": "0.6766676",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h2ivqbs",
            "score": 1,
            "text": "My landlord told me he is going to sell and needs to renovate my apartment prior to. But will not evict me if it puts me in a tight spot. So I called my sister who is the holder of my dad's estate till I turn 25 if there is anyway I can get the money earlier so I can make a down payment on a house. She said I needed to be approved first went for a meeting and the lady said all is good other than my credit. I decided I'd let my landlord know I'd have to stay minimum a year longer and he's kinda okay with it. The reason he didn't do the renovations prior to us moving in is we had cats and we're already on our way to the property location and he said don't worry about the security deposit any damages that occur due to our cats will be piled upon the previous tenant who did not maintain her animals.",
            "title_similarity": "0.6030396",
            "sentiment_compound": 0.9351
        },
        {
            "id": "h2j0o1m",
            "score": 1,
            "text": "90% of the time when money is involved all moral values go right out the window.",
            "title_similarity": "0.46706617",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h2j5zx2",
            "score": 2,
            "text": "A lot of landlords find out the hard way that if you don’t start the eviction process as soon as the first months rent is missed you could have no income on your property for four to six months in many states",
            "title_similarity": "0.7421118",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h2j69pr",
            "score": 1,
            "text": "Corporations have no business owning any land. They are not human!",
            "title_similarity": "0.3569536",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h2jl6i1",
            "score": 1,
            "text": "Victoria Australia has improved thanks to the Andrew’s government. I now know the owner or rental provider has never done a gas or electricity safety check",
            "title_similarity": "0.46139443",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h2ktm0c",
            "score": 1,
            "text": "In order to be moral a social animal like humans need to understand their obligations to the social contract that all humans inherit at birth unless the individual is born into the 1% of psychopaths and sociopaths. Aside from that each society has to determine the direction of their moral compass.",
            "title_similarity": "0.555362",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2u99u3",
            "score": 2,
            "text": "People need to just pay rent. That simple.",
            "title_similarity": "0.4417929",
            "sentiment_compound": -0.1027
        }
    ]
}