{
    "Toxic workplaces increase risk of depression by 300%. The study has found that full time workers employed by organisations that fail to prioritise their employees' mental health have a threefold increased risk of being diagnosed with depression.\n": [
        {
            "id": "h2z6g4v",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.39714992",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h31rrgz",
            "score": 2,
            "text": "Businesses are in business to make money.  Humans are abundant and are replaceable.  It’s not a corporations obligation to care about any employees feelings.  Employees are higher to do a job that they agree to before taking the job.  If a person doesn’t like the way they’re treated or doesn’t like what they agreed to they should quit immediately.  Just walk away.",
            "title_similarity": "0.52572465",
            "sentiment_compound": 0.8957
        },
        {
            "id": "h2zgv52",
            "score": 18,
            "text": "On the Brightside at least working from home has become normalized now.",
            "title_similarity": "0.0724076",
            "sentiment_compound": 0.0
        },
        {
            "id": "h300x2y",
            "score": -24,
            "text": "[deleted]",
            "title_similarity": "0.029345298"
        },
        {
            "id": "h2zxpb8",
            "score": 16,
            "text": "This couldve been titled \"Workplaces that prioritize their employees mental health decrease depression by 300%\" \n\nWould've been a much more uplifting title",
            "title_similarity": "0.75503576",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h304tyy",
            "score": 3,
            "text": "Welcome to America where the National Board of Human Resources has generally agreed that if you miss more than 1.5% of work you are a bad employee and should be fired/punished.",
            "title_similarity": "0.69925416",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3000zv",
            "score": 3,
            "text": "Isn’t an increase of 300% a fourfold increase, not threefold?\n\n300% + 100% = 400%",
            "title_similarity": "0.5382",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h31zuky",
            "score": 0,
            "text": "To introverts, almost all workplaces feel toxic.",
            "title_similarity": "0.7095528",
            "sentiment_compound": 0.0
        },
        {
            "id": "h31lo0z",
            "score": 1,
            "text": "Oh wow, would have thought! You need a ”study” to figure out that?",
            "title_similarity": "0.12136638",
            "sentiment_compound": 0.6239
        },
        {
            "id": "h2zrb27",
            "score": 24,
            "text": "Honestly, the first field I thought of was American teachers when reading this.",
            "title_similarity": "0.21841463",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h2zyo14",
            "score": 9,
            "text": "No wonder why the military has such a high suicide rate...",
            "title_similarity": "0.719139",
            "sentiment_compound": -0.7717
        },
        {
            "id": "h2zbzvw",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.029345298"
        },
        {
            "id": "h319m7t",
            "score": -2,
            "text": "alright, but what happens to the depression when you're unemployed and can't afford biological necessities?",
            "title_similarity": "0.59038323",
            "sentiment_compound": -0.6757
        },
        {
            "id": "h2zgmtn",
            "score": 139,
            "text": "Its sad to me how many people pour their hearts and souls into their careers only to get crushed into the ground.  A career is not a personality trait like so many people make it. So many people envelope all of their self worth into how hard they work or what they do for a living. That cant be healthy. Unless you work on commission or doing something truly impactful (first responders, doctors, nurses ect.) there is zero reason to burn yourself into the ground. Most employment contracts are basically work x amount for y amount of dollars. If your effort level doesnt determine your compensation why push yourself 100%? Those deadlines dont effect youre bottom line. Thats the owners/shareholders/customers problem. The days of seeking a promotion are over. Its way less stressful and easier to just work somewhere else if you want to increase your cost of living.\n\n If management gets on you it shouldnt bring you down, it should be empowering that youre not letting yourself get taken advantage of. Its not like you cant just find a new job in this economy.  They need you way more than you need them.\n\nIm not saying you should slack off or take advantage of your employer. just dont let them take everything from you.",
            "title_similarity": "0.66779006",
            "sentiment_compound": 0.5206
        },
        {
            "id": "h3020ud",
            "score": 5,
            "text": "Ok but can we not use the radioactive symbol for toxic? Pedantic i know but it's not what that symbol is for and probably on some level helps perpetuate the 'nuclear energy will kill you' viewpoint, which is incorrect.",
            "title_similarity": "0.30864766",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h2ztpog",
            "score": 81,
            "text": "It's time that companies can be sued for the metal health problems they cause among their workers.",
            "title_similarity": "0.63894826",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h2zjhyd",
            "score": 25,
            "text": "If a workplace doesn't increase the risk of depression, can it even be toxic?",
            "title_similarity": "0.5201082",
            "sentiment_compound": -0.5924
        },
        {
            "id": "h2zyp6p",
            "score": 8,
            "text": "Yeah Boi! That's me, I've been depressed on and off for a big part of my life. Part of it is trauma. I get bad anxiety at times too. My work was stressing me out, I was tired, grumpy and miserable. No one cared. I burnt myself out and realised I needed to leave.",
            "title_similarity": "0.6143411",
            "sentiment_compound": -0.9671
        },
        {
            "id": "h2zxwev",
            "score": 14,
            "text": "You mean if the place I spend most of my waking hours doesn't respect and value me it's bad?",
            "title_similarity": "0.50570524",
            "sentiment_compound": -0.7958
        },
        {
            "id": "h2z6hwg",
            "score": 216,
            "text": "A year-long Australian population study has found that full time workers employed by organisations that fail to prioritise their employees' mental health have a threefold increased risk of being diagnosed with depression.\n\nAnd while working long hours is a risk factor for dying from cardiovascular disease or having a stroke, poor management practices pose a greater risk for depression, the researchers found.\n\nThe University of South Australia study, published in the British Medical Journal today, is led by UniSA's Psychosocial Safety Climate Observatory, the world's first research platform exploring workplace psychological health and safety.\n\nPsychosocial safety climate (PSC) is the term used to describe management practices and communication and participation systems that protect workers' mental health and safety.\n\nLead author, Dr Amy Zadow, says that poor workplace mental health can be traced back to poor management practices, priorities and values, which then flows through to high job demands and low resources.\n\n\"Evidence shows that companies who fail to reward or acknowledge their employees for hard work, impose unreasonable demands on workers, and do not give them autonomy, are placing their staff at a much greater risk of depression,\" says Dr Zadow\n\nhttps://bmjopen.bmj.com/content/11/6/e044133",
            "title_similarity": "0.87687534",
            "sentiment_compound": -0.9217
        },
        {
            "id": "h303yh3",
            "score": 22,
            "text": "Mental health really should be considered a mandatory element of health and safety risk assessments. If your workplace causes severe stress, anxiety or depression (or any combination) that's going to be doing actual physical harm to you.\n\nCompanies should be accountable for that.",
            "title_similarity": "0.5221994",
            "sentiment_compound": -0.9062
        },
        {
            "id": "h2zygaq",
            "score": 26,
            "text": "I worked at Goldman briefly and the amount of guys in their 20s with receding hair and heart problems was staggering.",
            "title_similarity": "0.71905947",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h2zwzxf",
            "score": 66,
            "text": "The bar I work at recently hired another person to help on Saturdays. I work Thursday/Friday, but because we pool our tips I now make 25% less than I did two weeks ago. I discovered this today after looking at my paycheck, no one ever had a conversation with me\n\nThey may need to fast track the new guys training.\n\nEmployees are people",
            "title_similarity": "0.57470715",
            "sentiment_compound": -0.2382
        },
        {
            "id": "h2zcjcw",
            "score": 644,
            "text": "[removed]",
            "title_similarity": "-0.0175123"
        },
        {
            "id": "h2zouh6",
            "score": 30,
            "text": "Happy people make good workers, it’s basic stuff.",
            "title_similarity": "0.14598432",
            "sentiment_compound": 0.765
        },
        {
            "id": "h2zysc1",
            "score": 29,
            "text": "Imagine being miserable when you spend most of your waking hours with horrible people and you know you’re stuck because you need the paycheck.",
            "title_similarity": "0.64019483",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h2zzxa1",
            "score": 28,
            "text": "If we consider mental health as important as physical, shouldn’t we punish a company for providing an unsafe environment for it’s workers?",
            "title_similarity": "0.5199317",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h2zo0ay",
            "score": 35,
            "text": "I would love to see the statistics for contractors and independent contractors i bet there numbers are doubled.",
            "title_similarity": "0.479575",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h2zvm8h",
            "score": 88,
            "text": "The military is one of the most toxic workplace there is.",
            "title_similarity": "0.6032683",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2zzsto",
            "score": 147,
            "text": "After a super toxic boss was fired (after 10% leaving because of him) the best quote I heard from a survivor was:\n\n\"I can breathe now. I didn't know I couldn't breathe.\"",
            "title_similarity": "0.76949257",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h2zj331",
            "score": 167,
            "text": "[removed]",
            "title_similarity": "-0.0175123"
        },
        {
            "id": "h2zxa3f",
            "score": 159,
            "text": "The last company I worked for management had unofficial policies to make staff as depressed and demoralized as possible...\n\n\nJob security on their end. Management was underqualified, with younger and actually qualified people were being hired. They felt threatened.\n\n\nSo, they made it as depressing as possible. Higher turnaround and whoever was stuck there was brought down mentally. (Stopped seeking higher education, less willing to seek promotions...etc etc)",
            "title_similarity": "0.7007261",
            "sentiment_compound": -0.9001
        },
        {
            "id": "h302ws7",
            "score": 103,
            "text": "Hospitals and corporate medicine in the US have extremely high rates of depression. Physicians in many practices don’t have any flexibility and are treated so poorly by fellow physicians, patients and management. The abuse starts in medical school and continues throughout a physicians career. You would think that doctors would have empathy for each other but they don’t. In some states in the US physicians are fearful of seeking mental health treatment for fear of being investigated by medical boards and jeopardizing their licenses. Some hospitals want to track every second a physician is working to maximize their profits. Healthcare workers are human not machines!!",
            "title_similarity": "0.69346774",
            "sentiment_compound": -0.8456
        },
        {
            "id": "h2znyfu",
            "score": 1007,
            "text": "Even though they don't technically count as workplaces from a legal standpoint, graduate school labs in academia are some of the most toxic workplaces on the planet.  If students had the rights of employees, or a justice system to uphold their human rights for that matter, these toxic hellholes might be lucky enough to reduce the risk of depression down to 300%.",
            "title_similarity": "0.6796083",
            "sentiment_compound": 0.25
        },
        {
            "id": "h2zzs76",
            "score": 456,
            "text": "it's not just while you work there. People take baggage like this with them to their next job.I have trouble trusting my bosses when they tell me I'm doing well because I've had sh!t bosses say that and then just turn around and fire me for things they never brought up in one on ones as issues. I always feel like I have to get explicit instructions on things from my manager just to be sure I'm not going to get blind sided again.\n\nIt's just like leaving an abusive relationship with someone who is manipulative. It changes the way you think. You're always going to have those thoughts. Maybe couples therapy could help, but that isn't an option with my boss.",
            "title_similarity": "0.59546185",
            "sentiment_compound": 0.3489
        },
        {
            "id": "h2zjw20",
            "score": 2257,
            "text": "Makes sense when we spend the majority of our lives at a job.",
            "title_similarity": "0.38571134",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2zpdxr",
            "score": 11,
            "text": "this is why I walked spontaneously walked away from my last two jobs!",
            "title_similarity": "0.44264323",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2ztpnf",
            "score": 2,
            "text": "I thought that was the whole premise about the series ‘corporation’ where everyone just said what they mean and not what they usually say with all the hidden stuff between the lines.",
            "title_similarity": "0.39619064",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2zx85m",
            "score": 1,
            "text": "We’re just little piggies need fix’n in our pens. Maybe they should organize more team happy hours.",
            "title_similarity": "0.31578368",
            "sentiment_compound": 0.6096
        },
        {
            "id": "h2zxz4o",
            "score": 1,
            "text": "Welcome to the restaurant industry....",
            "title_similarity": "0.087196775",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h2zy7fm",
            "score": 7,
            "text": "only 300%? i thought it would be more",
            "title_similarity": "0.38570982",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2zybca",
            "score": 1,
            "text": "Spending a throd of your time somewhere toxic will do that",
            "title_similarity": "0.4140178",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2zyccx",
            "score": 2,
            "text": "Profit > Everything else",
            "title_similarity": "0.17999291",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2zyer5",
            "score": 98,
            "text": "[removed]",
            "title_similarity": "-0.0175123"
        },
        {
            "id": "h2zymzp",
            "score": 30,
            "text": "The American health care system would like to know your location",
            "title_similarity": "0.12794021",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h2zz5k4",
            "score": 3,
            "text": "You should see how therapists are treated in clinics.",
            "title_similarity": "0.14530832",
            "sentiment_compound": 0.0
        },
        {
            "id": "h2zz841",
            "score": 2,
            "text": "Can think of a local council that this appies to. Its laughable what they consider to be appropriate help.",
            "title_similarity": "0.2750523",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h2zziwk",
            "score": 3,
            "text": "You will hate work, and you will LIKE IT!!",
            "title_similarity": "0.3383307",
            "sentiment_compound": -0.2619
        },
        {
            "id": "h30023e",
            "score": 24,
            "text": "I work in one of those places and I got diagnosed depression from it. Funny enough they are very \"we want to help with mental health issues\", I told my union that I need help and it is now 3 months of email circles because no one really knows how to help with mental health.",
            "title_similarity": "0.7453183",
            "sentiment_compound": 0.6887
        },
        {
            "id": "h300esa",
            "score": 7,
            "text": "In times of uncertainty like mergers and what we have going on now it’s worse. Everyone is just trying to get theirs. No one cares about other people.\n\nAlso it’s not any better even with a union. I’ve worked at jobs with unions.",
            "title_similarity": "0.5127902",
            "sentiment_compound": -0.8437
        },
        {
            "id": "h300s5i",
            "score": 3,
            "text": "What qualifies as a work place that prioritizes mental health?",
            "title_similarity": "0.22102484",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3017jb",
            "score": 26,
            "text": "Shout out to my boss working from home with overtime today while I had to drive in. Just lovely.",
            "title_similarity": "0.4330126",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h301pnc",
            "score": 8,
            "text": "[deleted]",
            "title_similarity": "0.029345298"
        },
        {
            "id": "h302em5",
            "score": 19,
            "text": "I quit a job 6 years ago that got me into some really bad depression. Still depressed ever since, wasn't worth it.",
            "title_similarity": "0.62571937",
            "sentiment_compound": -0.9142
        },
        {
            "id": "h302h6v",
            "score": 148,
            "text": "My last job, I had become so horribly depressed and suicidal even on a daily basis. When I left, I immediately started becoming back to my usual self. It has a lot to do with the environment but especially terrible management.",
            "title_similarity": "0.678079",
            "sentiment_compound": -0.9064
        },
        {
            "id": "h3036sd",
            "score": 118,
            "text": "Have there been any studies on people having PTSD after leaving these types of places? I would certainly volunteer for one. Over a year later and I still sometimes wake up in the night seething over how I was treated at my last job.",
            "title_similarity": "0.62718105",
            "sentiment_compound": 0.34
        },
        {
            "id": "h303h6f",
            "score": 2,
            "text": "But do the employers care? Do they care if they feel you are possibly easily replaceable?",
            "title_similarity": "0.35273653",
            "sentiment_compound": 0.9195
        },
        {
            "id": "h303nrz",
            "score": 3,
            "text": "Take for instance working for Marathon Petroleum Corporation (MPC). They are the epitome of stress and toxic work places. Used to be family life work balance. Now it’s a work mostly out of fear of being let go because of lack of foresight management and then maybe you get time with family balance model. Refineries constantly striking because CEOs need their bonus or Holden parachutes when retiring. Young engineers, steer clear of refining. Dying industry. Go green with your degree!",
            "title_similarity": "0.6198397",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h303y08",
            "score": 71,
            "text": "I used to work at a huge tech company with a bad reputation. That whole time if I wasn't suffering from anxiety and just being plain afraid, I was so depressed I'd fantasize about jumping in front of buses as I waited for the light to cross the street.",
            "title_similarity": "0.68497103",
            "sentiment_compound": -0.5218
        },
        {
            "id": "h304b44",
            "score": 30,
            "text": "Wait. There are places that care about their employees mental health? Not that I've ever seen.",
            "title_similarity": "0.36456636",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h304ipz",
            "score": 5,
            "text": "I do hate my job and I am recently depressed",
            "title_similarity": "0.528626",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h304jfq",
            "score": 34,
            "text": "Not only this, but many people spend their after-work hours drinking or doing something to cope with the stress they developed at work.",
            "title_similarity": "0.5265597",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h304ni0",
            "score": 5,
            "text": "My depression tenfold when I worked at a store front that was the most toxic workplace I've ever experienced, and it happened to be a knitting store. The younger employees were the worst.",
            "title_similarity": "0.7325275",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h304xt4",
            "score": 2,
            "text": "Idk why but why do most trades/construction workers  all assholes it’s mostly the older generation",
            "title_similarity": "0.63647234",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h30517b",
            "score": 1,
            "text": "Welcome to the military….",
            "title_similarity": "0.04020178",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h3055lq",
            "score": 3,
            "text": "I used to have a boss who told me i would \"out grow\" my anxiety, and that \"everyone feels like this at my age.\" That's the last full time job I've had since.",
            "title_similarity": "0.6335626",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h305dh2",
            "score": 1,
            "text": "My old boss engaged in corruption with Russian mob. One day they came to visit our office.\n\nBeen depressed ever since but government dont know how to help.\n\nWorking can be dangerous ...",
            "title_similarity": "0.6270741",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h305ijw",
            "score": 1,
            "text": "After 4 consecutive toxic workplaces and a year of unemployment in the middle, I want to leave my consciousness more than I want a good job.",
            "title_similarity": "0.7369132",
            "sentiment_compound": 0.1689
        },
        {
            "id": "h305kwz",
            "score": 1,
            "text": "\"Organizations th as t fail to prioritize their employees mental health\" so you mean literally all of them",
            "title_similarity": "0.50635177",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h305nma",
            "score": 1,
            "text": "Too many CEO's, managers, and supervisors care more about power-tripping than doing what's right for their employees and their companies. I work at UPS and the company is too busy trying to harass the union workers like myself to realize people keep leaving for Amazon due to how hostile of a work environment they keep enforcing.",
            "title_similarity": "0.6200936",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h305rgu",
            "score": 1,
            "text": "Toxic work places are awful! While I was in a toxic work atmosphere one of the things I noticed is my MBTI changed for the first time in near 20yrs of consistent outcomes.",
            "title_similarity": "0.7546428",
            "sentiment_compound": -0.5093
        },
        {
            "id": "h305zp4",
            "score": 5,
            "text": "I wonder if depressed people are more likely to accept unfair conditions as well. whereas someone else may quit.",
            "title_similarity": "0.46122575",
            "sentiment_compound": -0.3477
        },
        {
            "id": "h30657q",
            "score": 1,
            "text": "Check out my last workplace.",
            "title_similarity": "0.28503442",
            "sentiment_compound": 0.0
        },
        {
            "id": "h306beq",
            "score": 1,
            "text": "Ahah, the joke's on them, I'm already depressed.",
            "title_similarity": "0.38495454",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h306qbc",
            "score": 1,
            "text": "I just left an incredibly toxic work environment that I was a part of for the better part of 4 years. After a few weeks of distancing myself from that place I was so surprised to find how greatly my mental and physical health began to recover. I’m happier than I’ve been in a very long time. And I have a new job now that, while it isn’t perfect, it’s certainly not that place. It’s so important to realize when something in your life is not good for you, and to learn to find the courage to walk away from the things that don’t benefit you or drag you down.",
            "title_similarity": "0.6473441",
            "sentiment_compound": 0.9593
        },
        {
            "id": "h306tc4",
            "score": 1,
            "text": "Good thing I was diagnosed with depression before I got to my toxic work environment",
            "title_similarity": "0.6250392",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h306w2g",
            "score": 1,
            "text": "I’m apparently in this article",
            "title_similarity": "0.077169195",
            "sentiment_compound": 0.0
        },
        {
            "id": "h306zov",
            "score": 1,
            "text": "I can vouch for that for the company I work at. Especially when we have to work 11 days straight 10 hour days long for myself anyways. There's other areas where they work 9 hour days. \n\nSure, they have programs for mental health. They need to look at the bigger picture of how hard we work labor wise. The long hours don't work either. \n\nWhen joining that company, I had a goal to become lead. I am that today, but I know what the others are going through because I went through the same while working my way up. \n\nStraight up told a supervisor that I will not have kids due to how little time I have for myself after work.",
            "title_similarity": "0.5810559",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h307q0o",
            "score": 1,
            "text": "why do we keep having these conversations?? the problem is CAPITALISM. do we do anything about it? well...",
            "title_similarity": "0.33060452",
            "sentiment_compound": -0.2824
        },
        {
            "id": "h307xi6",
            "score": 3,
            "text": "I’m on stress leave at the moment due to primarily a toxic workplace. I’m getting better the longer I’m away. The MD knows the reason for this but the person responsible is ‘indispensable’ so the rest of us have to suffer.\nToxic workplaces is one of the great curses of modern society.",
            "title_similarity": "0.67128277",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h307zei",
            "score": 2,
            "text": "Profit by *any* means necessary, as the saying goes.\n\n\n\nMental, physical, and emotional health goes above all, in every scenario. Period.",
            "title_similarity": "0.32070106",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h3083w4",
            "score": 1,
            "text": "Restaurant industry steps to the podium",
            "title_similarity": "0.15347385",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3085av",
            "score": 1,
            "text": "I'd absolutely believe it, having worked in a toxic workplace. I was absolutely ***miserable.***",
            "title_similarity": "0.6016678",
            "sentiment_compound": -0.5413
        },
        {
            "id": "h308cer",
            "score": 1,
            "text": "Another reason why WFH was so popular during covid.",
            "title_similarity": "0.21136966",
            "sentiment_compound": 0.5598
        },
        {
            "id": "h308nja",
            "score": 2,
            "text": "People aren't depressed because of toxic work environments. They are depressed because of the standard of employment they receive! No benefits, ballooning taxes and utter destitute. Plus put in all the woke stuff, plus being way underpaid and depression is literally around the corner. Stop talking about toxic this and that, and start talking about raising people's pay, and their standard of living,  because that's all that really matters. Stop trying to make an issue out of nothing. This is all corporate propaganda trying to divide people. You know what's toxic? People working 10hours aday and not having enough money for basic needs.",
            "title_similarity": "0.6349757",
            "sentiment_compound": -0.9092
        },
        {
            "id": "h3091qk",
            "score": 1,
            "text": "Promoting the toxic people does not help the situation.",
            "title_similarity": "0.2854643",
            "sentiment_compound": 0.0624
        },
        {
            "id": "h309liw",
            "score": 2,
            "text": "I think large companies half ass attempts to act like they care really make it worse. Forcing you to watch content and trainings on how to deal with your problems in their way feels so detached. In my brief experience fresh out of college, I think the best thing for mental health is working with a tight knit group with people who actually know you and care about you (at least a little bit) so you can speak your mind when problems arise.",
            "title_similarity": "0.52614546",
            "sentiment_compound": 0.2835
        },
        {
            "id": "h309ppk",
            "score": 1,
            "text": "I'd love to see something other than social sciences being pushed to the front page of this sub. Yes, pushed...inorganically. It's obvious.",
            "title_similarity": "0.2645128",
            "sentiment_compound": 0.7845
        },
        {
            "id": "h30aeng",
            "score": 1,
            "text": "Corporations purposely hire psychopaths into managemant positions I ~~doubt~~ know they  don't care about this study's findings",
            "title_similarity": "0.38729852",
            "sentiment_compound": -0.6283
        },
        {
            "id": "h30arop",
            "score": 1,
            "text": "Can tell you it’s even worse when it’s a foreign company a US company sells your job to, and you have to train your replacement who isn’t American and works overseas.",
            "title_similarity": "0.5242815",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h30bbq8",
            "score": 1,
            "text": "I agree 100% and lived through it.  I didn’t even realize how toxic my old workplace was until I quit.  My mental health improved drastically to the point where people actually noticed a change in my behaviour.  It can become equal to an emotionally abusive relationship and can be incredibly difficult to pull yourself out.",
            "title_similarity": "0.69263625",
            "sentiment_compound": -0.3384
        },
        {
            "id": "h30behz",
            "score": 1,
            "text": "“If the place you spend a majority of the time is bad for your mental health, then you will have bad mental health.”\n\nAlso workplaces on fire have a 100% chance to result on employees on fire.",
            "title_similarity": "0.7924776",
            "sentiment_compound": -0.8689
        },
        {
            "id": "h30besi",
            "score": 1,
            "text": "I’m leaving a company I’ve been at for a huge chunk of my career because they didn’t take mental health seriously. It got to the point where I was so burned out my therapist put me on sick leave and even though it helped tremendously I didn’t feel like the work environment improved significantly as my boss just pulled me out of the team but nothing was actually done about it.",
            "title_similarity": "0.64388365",
            "sentiment_compound": 0.2144
        },
        {
            "id": "h30bllb",
            "score": 1,
            "text": "I can attest to this. Only just back in work after nearly 2 years out. My last job crippled me mentally. I’m only 30. I can’t move out of my mums yet. I haven’t got a car. It set me back so much more than I realised. I thought I had everything on lock but things got gradually worse until it spiralled out of control and I had to leave the job. I didn’t think it would be 2 years until I got back into work... I’m only just recovering from that toxic hellhole",
            "title_similarity": "0.67635715",
            "sentiment_compound": -0.6652
        },
        {
            "id": "h30blyc",
            "score": 3,
            "text": "Left a toxic work environment when covid started and they wanted to stay open against the ordinance to shut down. We didn't have an option it was come in and serve alcohol to people in the middle of a pandemic or get fired. I noped out as that was my last straw. \n\nFor a couple years I had been getting worse and worse attitude wise and just grumpy all the time, sad while I was home and hating life. Been a year since I left that job and man o man am I so happy with life.\n\nI look back and just think everyone thought I was the problem because I was so unhappy but a year later they are all still fighting over the same stupid things while being paid minimum wage to subject themselves to abusive employers because the tip money is good....\n\nAnd I smile every day I left before I did something stupid to hurt myself.",
            "title_similarity": "0.61441654",
            "sentiment_compound": -0.9766
        },
        {
            "id": "h30bofx",
            "score": 1,
            "text": "A place where we seek validation from others to belong to the group and secure our living. Top the depression bit with clinical depression, alcoholism, chronic shame, suicidal thoughts, insomnia, eating disorder, cardiovascular diseases.",
            "title_similarity": "0.49837053",
            "sentiment_compound": -0.9382
        },
        {
            "id": "h30c26k",
            "score": 1,
            "text": "Was this not already known fact? You get hit, you’ll form a bruise. That’s just the logical order of things.",
            "title_similarity": "0.28824347",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30cao8",
            "score": 1,
            "text": "Staring at you proctor and gamble",
            "title_similarity": "0.17484884",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30cdxx",
            "score": 15,
            "text": "This can apply to toxic management or toxic employees. We had a woman where I work who was super toxic. She was the best machine operator for this specific machine. Nobody could touch her numbers, but she would manipulate people and spread that toxic to everyone around her. Management finally had enough of her toxic attitude and fired her even if she was the best at her job. After she was fired everyone starting coming up and saying how happy they were. There was even one person who was on anxiety medication because of her. Management knew it was bad but they never knew it was that bad until people started coming forward after she was fired. None of them wanted to be a snitch while she was here but it made them miserable.",
            "title_similarity": "0.6416758",
            "sentiment_compound": -0.9489
        },
        {
            "id": "h30ceti",
            "score": 2,
            "text": "My wage increased with 3450000% in 1 year.",
            "title_similarity": "0.61668664",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h30cr26",
            "score": 1,
            "text": "Do these studies ever amount to any real change? Isn’t it just confirming what the average worker already knows?",
            "title_similarity": "0.3540759",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30d3zk",
            "score": 1,
            "text": "I think people forget that an organization or office doesn’t have to be adversarial to be toxic. People can like all their coworkers and bosses and still have a super crappy work experience.",
            "title_similarity": "0.4455338",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h30dkyn",
            "score": 1,
            "text": "\"If youre at a bad job it might make you sad!\"\n\nWow.... Thanks science",
            "title_similarity": "0.39430162",
            "sentiment_compound": 0.1007
        },
        {
            "id": "h30dpaz",
            "score": 1,
            "text": "Just because a job pays good doesn't mean it's a good job, just because it's a good job doesn't mean it pays good.",
            "title_similarity": "0.253317",
            "sentiment_compound": 0.891
        },
        {
            "id": "h30dto5",
            "score": 1,
            "text": "I would love to see the numbers for this study specifically in researchers. The majority of the industry is toxic af.",
            "title_similarity": "0.7141092",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h30duww",
            "score": 1,
            "text": "Explains why the militaries suicide rate is so extreme.",
            "title_similarity": "0.66529614",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h30e484",
            "score": 1,
            "text": "Those kind of workplaces couldnt care less",
            "title_similarity": "0.20258583",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h30e72e",
            "score": 1,
            "text": "No wonder I've wanted to commit toaster bath in the past 6 months of working for *insert major retail store here* more than my 5.5 years of college :)",
            "title_similarity": "0.49459237",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h30ea04",
            "score": 1,
            "text": "Just left a job for this exact reason. It's not worth it better off being broke then stressed out and unhappy.",
            "title_similarity": "0.4548012",
            "sentiment_compound": -0.8771
        },
        {
            "id": "h30emfq",
            "score": 1,
            "text": "So can management get in trouble for perpetuating a toxic environment? Because if not it’ll never change",
            "title_similarity": "0.3863305",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h30ep7c",
            "score": 1,
            "text": "And these same organizations have a 100% risk of not caring.",
            "title_similarity": "0.55364645",
            "sentiment_compound": -0.5759
        },
        {
            "id": "h30euch",
            "score": 1,
            "text": "One person at my old job made the job 100x worse than it actually was because her attitude was that rancid.",
            "title_similarity": "0.7443038",
            "sentiment_compound": -0.765
        },
        {
            "id": "h30f80m",
            "score": 1,
            "text": "As a chef that went through hell over pandemic and ended up burnt out and ravaged mentally. The food industry relies on toxic behavior. No restaurant actually supports kitchen workers mental health. Parents, do not send your children to experience the demeaning abuse that narcissistic restaurant owners/managers are *renowned* for.",
            "title_similarity": "0.6062548",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h30fjfj",
            "score": 1,
            "text": "And a mass shooting in the USA. More disgruntled workers going postal in their work place is prevalent.",
            "title_similarity": "0.66645646",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30fxh7",
            "score": 1,
            "text": "My company is aware and extremely supportive of mental health issues. My depression has slowly improved and stayed level. Thank you to the best company and bosses ever. (No names will be given.)",
            "title_similarity": "0.3865264",
            "sentiment_compound": 0.8221
        },
        {
            "id": "h30gcll",
            "score": 1,
            "text": "I was in a stressful toxic job from 2018-2021 and during that time I was in the worst place mentally and gained over 20 pounds. \n\nI finally decided to take a lower paying job this year and it has the most amazing, positive work environment and I feel so much better. I wish I would have done it sooner. I already lost 5 pounds, feel way more positive and healthier mentally/physically.",
            "title_similarity": "0.7112225",
            "sentiment_compound": 0.8571
        },
        {
            "id": "h30gnpt",
            "score": 1,
            "text": "Thats not good. Workplaces need to work on that if production is going to increase. The spirits of workers matter. Depression happens way to much.",
            "title_similarity": "0.62585217",
            "sentiment_compound": -0.5727
        },
        {
            "id": "h30gs86",
            "score": 1,
            "text": "\"Fail to priorities their employees mental health\" - so every workplace then.. No wonder depression is so prevalent.",
            "title_similarity": "0.6786253",
            "sentiment_compound": -0.4023
        },
        {
            "id": "h30gtks",
            "score": 2,
            "text": "And then the solution is to tell the employee their depression is a chemical imbalance and medicate them?",
            "title_similarity": "0.5403106",
            "sentiment_compound": -0.34
        },
        {
            "id": "h30gwsm",
            "score": 1,
            "text": "> ...companies who fail to reward or acknowledge their employees for hard work, impose unreasonable demands on workers, and do not give them autonomy...\"\n\n> ...working long hours can lead to depression...\"\n\n> \"High levels of burnout and workplace bullying...\"\n\n> \"Lack of consultation with employees and unions over workplace health and safety issues, and little support for stress prevention...\"\n\nThere isn't a single quantifiable criterion mentioned in the article.  Even worse, they acknowledge elevated depression globally regardless of work circumstances.  This is interesting, however:\n\n> \"Sometimes stress is a trigger for bullying and in the worst cases it can set an 'acceptable' level of behaviour for other members of the team. But above all bullying can be predicted from a company's commitment to mental health, so it can be prevented,\"\n\nSo it's a self-perpetuating problem, quite possibly caused by depression from factors *outside* of work?\n\nLinks to any of the referenced studies would be nice to see how they were conducted, because I suspect these are just polls of worker drones.  Who doesn't think they work too hard or too long?  Who doesn't think at least a few of their co-workers are bad people?  This is ridiculous.  No one can address a problem you can't define beyond \"I hate my job.\"",
            "title_similarity": "0.67760396",
            "sentiment_compound": -0.9924
        },
        {
            "id": "h30gzlx",
            "score": 1,
            "text": "believe me they truely dont give a flying f\\*ck money to them is all that matters and going to church every week to look good to the public....",
            "title_similarity": "0.41619813",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h30h15u",
            "score": 1,
            "text": "*cries in Registered nurse *\n\nReally though. Every time I’ve left a job is because management treats us like garbage and put us in unsafe working conditions and when you advocate for yourself and others they gaslight you into thinking that everything is your fault.",
            "title_similarity": "0.65802395",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h30h3gp",
            "score": 1,
            "text": "So, practically every single working place in the United States of America? Yeah that tracks.",
            "title_similarity": "0.39784685",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h30h5vr",
            "score": 2,
            "text": "Looking for finance and public accounting firms to comment on this..",
            "title_similarity": "0.26986644",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30hifj",
            "score": 1,
            "text": "My job is extremely toxic and I can’t find a new one in my area without taking a pay cut unfortunately. Moving to a new department has helped a little bit but not enough.",
            "title_similarity": "0.6578246",
            "sentiment_compound": -0.2737
        },
        {
            "id": "h30hobl",
            "score": 3,
            "text": "I thought depression was a chemical imbalance in our brains, that couldn't be cured with sunshine, fresh air, and positivity? Yet it seems every other study seems to link our home and work enviroment's with a increased risk of depression.",
            "title_similarity": "0.6574653",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h30il6e",
            "score": 1,
            "text": "\"Yes, but how does that effect profitablity?\" - Corporations, probably",
            "title_similarity": "0.34332925",
            "sentiment_compound": 0.2144
        },
        {
            "id": "h30iwgy",
            "score": 1,
            "text": "Quit my job outright on Monday. I was becoming depressed and anxious by the toxic work environment. I feel so so so much better even though I didn’t have a job lined out.",
            "title_similarity": "0.68612194",
            "sentiment_compound": -0.2163
        },
        {
            "id": "h30jbhi",
            "score": 1,
            "text": "Studies show researches studied while studying in preparation of writing a fully researched study so that researching a studification is valuable.",
            "title_similarity": "0.33283228",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h30jxaa",
            "score": 1,
            "text": "\"Workplaces increase risk of depression by 300%\" There I fixed it",
            "title_similarity": "0.86661774",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h30k8lh",
            "score": 1,
            "text": "one person can literally spread a disease",
            "title_similarity": "0.27303308",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30k9s8",
            "score": 1,
            "text": "300% increase = fourfold\n\nThreefold = 200% increase",
            "title_similarity": "0.5583023",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h30kfvb",
            "score": 1,
            "text": "The whole nature of our work culture 100% contributes to depression",
            "title_similarity": "0.6806339",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h30khjw",
            "score": 1,
            "text": "It's too bad they would rather sweep it under",
            "title_similarity": "0.22653313",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h30krzc",
            "score": 1,
            "text": "I completely agree, especially with what the article defines as toxic.\n\nToxic workplaces can be open to interpretation.  I have also seen burnout and depression for people who may not be a traditionally toxic workplace, but they don't like their role, or the hours are rougher than they can typically handle, which varies a lot depending on what you want.  \n\nIf you want to work for a Morgan Stanley as an investment banker what this means may be different than someone working as help desk or a more traditional 9-5 office job.  A bad fit or just misaligned goals or just doing something you don't like can easily make you depressed even if the company isn't toxic for others.  That being said, there are some pretty universally bad companies.",
            "title_similarity": "0.66066694",
            "sentiment_compound": -0.883
        },
        {
            "id": "h30lbdv",
            "score": 5,
            "text": "After working 7 years for a nepotism-ridden corpo job where my dissatisfaction is seen as “the problem,” while the content of my criticisms are swept under the rug,  I’m never working for another large business again. Either I’m going to work with people who are open to compromise or I’ll work alone.",
            "title_similarity": "0.60873413",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h30lcs5",
            "score": 1,
            "text": "Explains a lot about veterans' mental health. A WHOLE lot.",
            "title_similarity": "0.4644563",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30lfhi",
            "score": 1,
            "text": "Hard not to be depressed when your living on toxic garbage island",
            "title_similarity": "0.42295092",
            "sentiment_compound": 0.3187
        },
        {
            "id": "h30maao",
            "score": 1,
            "text": "\"gaslighted employees are more likely to be poisoned and express symptoms identical to depression\" More at 11",
            "title_similarity": "0.7141942",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h30mrxs",
            "score": 1,
            "text": "Someone send this to the US Military ASAP.",
            "title_similarity": "0.18504268",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30obn4",
            "score": 1,
            "text": "Anyone ever work at a school? Epitome of toxic workplaces.",
            "title_similarity": "0.5503105",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30oca1",
            "score": 1,
            "text": "Thank god a scientifically peer reviewed study told me depression can be clinically diagnosed by poor working conditions and a demeaning environment! I pray to science 10 times a day now",
            "title_similarity": "0.70521474",
            "sentiment_compound": -0.2942
        },
        {
            "id": "h30ofp1",
            "score": 1,
            "text": "How about the stats for toxic family?",
            "title_similarity": "0.4626427",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30p17x",
            "score": 1,
            "text": "And that's why I left corporate life",
            "title_similarity": "0.31470728",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30p5xz",
            "score": 1,
            "text": "Ok now do a study that shows how this negatively impacts the employers, or even better, how much more they have to profit, if you actually want to see any sort of change.",
            "title_similarity": "0.5949812",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h30pm4s",
            "score": 1,
            "text": "Who could have thought...",
            "title_similarity": "-0.06298333",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30pq99",
            "score": 1,
            "text": "Send this over to my old workplace, Ladbrokes.\n\nRetail gambling. It's the worst of all worlds!",
            "title_similarity": "0.54030275",
            "sentiment_compound": -0.6588
        },
        {
            "id": "h30q9n8",
            "score": 1,
            "text": "Might I interest you in workplace democracy and worker cooperative-based market?",
            "title_similarity": "0.18782389",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h30q9pc",
            "score": 3,
            "text": "I have no doubt this is true, but I'd be interested to see how often people with depression \"self-select\" working for this type of company because their low self-esteem makes it hard for them to see their own worth and stand up for themselves.",
            "title_similarity": "0.61605996",
            "sentiment_compound": -0.4301
        },
        {
            "id": "h30qutj",
            "score": 1,
            "text": "I feel like the definition of \"toxic\" (which obviously has no scientific basis) is directly derived from if people get angry/depressed working there. So this seems like the only way you could measure it is defining one term by the other so the number 300% really doesn't mean much.",
            "title_similarity": "0.58588934",
            "sentiment_compound": 0.5635
        },
        {
            "id": "h30r31n",
            "score": 5,
            "text": "Everything feels like it's built to run you into the ground.\n\nI have bipolar disorder. In the last couple of months I have hit new emotional lows I never felt before. Struggled very heavily with suicidal ideation and even wrote a suicide note. I never made any attempt, but I was at rock bottom and wanted to die.\n\nI asked for one day off. One day. I told my boss that I needed a day for my mental health. That I had been depressed and needed a day to refocus myself. Huge mistake. \n\nThe next day I had a call where I was told that, basically, my job performance was being affected and it had to stop. My boss proceeded to tell me about all the people in her life who were sick. All the bad things that had happened to her as a young adult. And how she has managed to work through it all and stay happy. It was never said outright, but the message was clear: everyone has problems, but don't look to your workplace for sympathy. Keep it to yourself. \n\nHer ultimate suggestion was that I should throw myself at my work and focus all of my attention there so I don't think about the depression. She also let me know I had one week to get back on track.\n\nIt was brutal. Absolutely destroyed me for a while. I cried a lot. I still work there and every time someone mentions being a family it just hurts again.",
            "title_similarity": "0.6874799",
            "sentiment_compound": -0.9932
        },
        {
            "id": "h30r7a2",
            "score": 1,
            "text": "If it gets that bad, just cut and run. Nothing at a job is worth your health.\n\nAt a very big tech company that I know of, suicides in the engineering department are common enough that there was a hush campaign to suppress news of the suicides.\n\nDon't believe all the happy horseshit in online reviews of tech companies. Some of them have some very dark and deep closets of skeletons.",
            "title_similarity": "0.673576",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30rkxn",
            "score": 1,
            "text": "My old employer: \"Yeah? So?\"",
            "title_similarity": "0.1925804",
            "sentiment_compound": 0.3736
        },
        {
            "id": "h30rrit",
            "score": 9,
            "text": "I'm a doctor and I recently quit a job in the emergency department. Was supposed to be there for a year but dragged myself through to 6 months before finding a healthier opportunity. Extremely toxic bullying environment. I've never been so stressed or burnt out, and now I'm in a job I love where my colleagues treat me like a human being. Feels great.",
            "title_similarity": "0.6351904",
            "sentiment_compound": 0.8981
        },
        {
            "id": "h30rw9y",
            "score": 1,
            "text": "Welcome to retail! Where we make you go crazy",
            "title_similarity": "0.35841697",
            "sentiment_compound": 0.2244
        },
        {
            "id": "h30sip1",
            "score": 1,
            "text": "I said \"You don't-fuckin-say?\" Out loud.",
            "title_similarity": "0.110856175",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30u0nu",
            "score": 1,
            "text": "Isn’t the article title confusing correlation and causation? Isn’t it possible that people with unhealthy working habits gravitate towards places where people work really hard?",
            "title_similarity": "0.49292406",
            "sentiment_compound": -0.7471
        },
        {
            "id": "h30uehy",
            "score": 1,
            "text": "My dealership should look into this",
            "title_similarity": "0.030909423",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30uyb5",
            "score": 13,
            "text": "My last employer was a toxic cesspool (direct manager was The Invisible Man, I had a dotted line to Mr. Micromanager, and a junior reporting to me who was verbally abusive and had anger management issues). HR's standpoint, in agreement with The Invisible Man was that the junior just needed more coaching - I physically couldn't sit in a room with him if he was between me and the door. Mr. Micromanager suggested I just make the guy's life hell until he quit.\n\nI ended up on stress leave, and later found a more relaxed job in a different industry. I took a pay hit, but it was worth it to not want to walk out in front of a streetcar every morning on my way to work. I'm normally a pretty optimistic person, the physical and psychological changes I experienced while working in that environment were extensive: I have very little recollection of my first 2 months on stress leave (I literally don't recall what I did all day while my spouse was at work), yelling (even overheard) sets my heart racing, I have insomnia (medicated), and my self-confidence is shot. I was ambitious, and wanted to improve, move upwards, and take on increased responsibility and authority, now I just hope people will leave me alone until I retire.",
            "title_similarity": "0.6311025",
            "sentiment_compound": 0.9662
        },
        {
            "id": "h30v12n",
            "score": 1,
            "text": "I was dealing with a narcissist boss and one day blurted out to my children that \"I hated my life\". I realized then that things had to change. I changed my work environment to avoid her and things improved dramatically. She tried to destroy my career and my life.",
            "title_similarity": "0.6490125",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h30v4qn",
            "score": 1,
            "text": "So basically, toxic stuff is bad for you?",
            "title_similarity": "0.36476836",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h30v7hn",
            "score": 2,
            "text": "This hits home for me as well. Four years ago I asked my doctor for a prescription for antidepressants because I couldn't stand going to work each day. I've never been diagnosed with depression and never asked for antidepressants before—but I'm considering it again.\n\nMy boss has become increasingly micromanagerial while simultaneously becoming more absent. She won't let me set my own meetings (and told me it's because she doesn't trust that I am competent enough to manage my own meetings—her words, not mine) meanwhile, I literally spent SIX weeks trying to get 10 minutes with her so that she could approve the drafts that she has assigned me to complete. She finally signed off on *one* on June 22nd. The final *six* versions are due on the 28th.\n\nI am at a point that I hate this job and now want nothing to do with the entire career field. I've been in this industry for 10 years.",
            "title_similarity": "0.53478235",
            "sentiment_compound": -0.7508
        },
        {
            "id": "h30vk56",
            "score": 1,
            "text": "Pro Tip: Even if you don’t care about your employees at all, make sure your workplace isn’t toxic and keep your employees happy. \nHappy employees = Productive employees.",
            "title_similarity": "0.31544116",
            "sentiment_compound": 0.9169
        },
        {
            "id": "h30vlbw",
            "score": 1,
            "text": "The post office was the most toxic place ive ever been and i truly had a miserable time working there",
            "title_similarity": "0.6145843",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h30w976",
            "score": 1,
            "text": "I believe it since I've experienced it myself at SRP. Incredibly toxic place to work. Most miserable 2 years of my life",
            "title_similarity": "0.6884785",
            "sentiment_compound": -0.5413
        },
        {
            "id": "h30wix0",
            "score": 1,
            "text": "Well damn toxic workplace + toxic home life explains a whole lot!",
            "title_similarity": "0.5715401",
            "sentiment_compound": -0.2244
        },
        {
            "id": "h30wul5",
            "score": 2,
            "text": "We are all getting fucked by the top 1%. When are we the 99% gonna figure this out and take back what’s ours. Oohhhj thats right the rich control the police, government, and military. Ohhhh I see the problem now. Life will always be terrible if humans are left to manage other humans",
            "title_similarity": "0.67294943",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h30xh0x",
            "score": 1,
            "text": "I have first-hand experience with this issue- I worked for a world leader in metal cutting tools & literally had a mental breakdown at the age of 27- I was doing all I could to make a name for myself, and once my first son was born I just suddenly broke down at work. Crying fits, forgetting where I was, turning to hate my colleagues and employer, all because I pushed the pedal to the metal at my job to become as successful as possible. They let me go 2 months after my son was born, shortly after I was demoted in a room full of my peers. The reason for my demotion? A customer service rep with the company for 20 years complained about the amount of advancement opportunities I was given, so they gave my latest duties and job title to him. I was then instructed to train him up, and that's what triggered my depression. I'm still on meds today.",
            "title_similarity": "0.6954328",
            "sentiment_compound": -0.8779
        },
        {
            "id": "h30yb00",
            "score": 1,
            "text": "At the best paying job I ever had, my supervisor would manipulate me, then convince the manager that I just wasn't working hard enough\n\nIn truth she was piling her responsibilities onto me, which meant I couldn't finish my own work\n\nNot only did I get depressed, but I started having stomach issues I was so stressed out",
            "title_similarity": "0.7070052",
            "sentiment_compound": -0.3456
        },
        {
            "id": "h30yb3u",
            "score": 1,
            "text": "Even if you get out of a toxic workplace, I feel it has lasting impacts on your well-being. I'm in a better place now and feel appreciated, however, I still struggle with motivation, low mood, and irritability at times, despite seeking various mental health supports. It's fucked up.",
            "title_similarity": "0.47314182",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h30yy2d",
            "score": 6,
            "text": "Now we just have to convince companies that depressed workers cost them money and it's more economical to keep them happy than fire them.",
            "title_similarity": "0.49904644",
            "sentiment_compound": 0.0
        },
        {
            "id": "h30z7ne",
            "score": 1,
            "text": "They should make a study about why studies are being made about the most obvious things there are. Here i thought toxic workplaces would improve peopkes moods!!",
            "title_similarity": "0.48919064",
            "sentiment_compound": 0.5399
        },
        {
            "id": "h30zadh",
            "score": 1,
            "text": "My boss (a university professor) doesn't believe in burn out. They say it's \"made up by lazy, unambitous people\".\n\nSo at least in my university, it will be a while until this changes in any meaningful way.",
            "title_similarity": "0.3511407",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h30zdai",
            "score": 1,
            "text": "Wow, I wish I could file a lawsuit.",
            "title_similarity": "0.3439888",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h30zi8n",
            "score": 1,
            "text": "Yeah, but don't expect anything to change for the better about this.  Companies always gotta single-mindedly chase after every last dollar, as per their shareholders' incessant demands for *more*, so the employees will *continue* to be treated as expendable and replaceable cogs in a heartless machine.",
            "title_similarity": "0.49523795",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h30zyj4",
            "score": 1,
            "text": "It was incredible to witness the massive changes in my co-workers when one very toxic manager was fired. After that morale and productivity went through the roof. People even started excersizing and losing weight, smiling, joking and laughing on the job. It was as if a massive weight was lifted from all of our shoulders, and our work suddenly had new meaning, and new hope! And that was ONE person out of a staff of 48!",
            "title_similarity": "0.73267895",
            "sentiment_compound": 0.658
        },
        {
            "id": "h3107ic",
            "score": 1,
            "text": "Taking a 40 hour job at Kroger last year was a very bad idea. Overtime was nice, for a bit.",
            "title_similarity": "0.645421",
            "sentiment_compound": -0.2484
        },
        {
            "id": "h310qi8",
            "score": 1,
            "text": "Looking at you, ***Americor***",
            "title_similarity": "0.0068340003",
            "sentiment_compound": 0.0
        },
        {
            "id": "h310vqm",
            "score": 1,
            "text": "Have you heard of any companies refusing to pay a death benefit because the employee suicided?",
            "title_similarity": "0.62353534",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h310wr0",
            "score": 1,
            "text": "Wait a second.... Breathing poisonous air is poisonous?? WHAT?!?!??\n\nTHIS IS A BREAKTHROUGH",
            "title_similarity": "0.3589334",
            "sentiment_compound": -0.8733
        },
        {
            "id": "h311bw1",
            "score": 1,
            "text": "is that why all highschoolers are depressed",
            "title_similarity": "0.6151482",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h311sbj",
            "score": 6,
            "text": "At some point, it's no longer \"clinical depression\" in the sense of being an inappropriate response by the brain, and is just the brain's normal and expected response to living 40+ hours per week in an abusive and stressful environment.",
            "title_similarity": "0.51265514",
            "sentiment_compound": -0.9246
        },
        {
            "id": "h311wwh",
            "score": 1,
            "text": "My breakdown from 2 years ago says yes!",
            "title_similarity": "0.35803384",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h31259q",
            "score": 1,
            "text": "goodestboiollie on tik tok,  just posted a video of me picking up for some workers at KFC who were being demeaned by their power tripping manager.  \n\n\nWorth the view.",
            "title_similarity": "0.5352875",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h312f65",
            "score": 1,
            "text": "Now do physical health",
            "title_similarity": "-0.024112884",
            "sentiment_compound": 0.0
        },
        {
            "id": "h312ni3",
            "score": 1,
            "text": "\"Nervous sweating in Japanese / Korean\"",
            "title_similarity": "0.38244563",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h3137eo",
            "score": 1,
            "text": "This is very true. I was diagnosed with severe depression and had suicidal thoughts constantly. \n\nGot a new job and I'm a whole new person.\n\nPeople can suck.",
            "title_similarity": "0.7109108",
            "sentiment_compound": -0.8911
        },
        {
            "id": "h3138fs",
            "score": 1,
            "text": "My last day at my depressing company was 1 week ago.  I am already much happier.  This is the 5th company I've worked at and I've never felt so demotivated or uninspired anywhere else.\n\nIt was rough for all of us and since December 2020, half of our division has left.  I was given a substantial raise to keep me around, but I still found a better job at a better company for more money.",
            "title_similarity": "0.6203081",
            "sentiment_compound": 0.8591
        },
        {
            "id": "h313ijh",
            "score": 1,
            "text": "Im proof of this article.",
            "title_similarity": "0.022468474",
            "sentiment_compound": 0.0
        },
        {
            "id": "h314t7i",
            "score": 3,
            "text": "\"People in a toxic and stressful environment for 40+ hours a week that is extremely stressful, time consuming, and risky to leave with no guarantee of improvement aren't very mentally healthy.\" Incredible stuff.\n\nIn another shocking study, people that get hit in the head every day with a hammer have more concussions than other people!",
            "title_similarity": "0.82491636",
            "sentiment_compound": -0.9019
        },
        {
            "id": "h315250",
            "score": 1,
            "text": "“organizations that fail to prioritise their employees’ mental health”\n\nSo every job in existence, then?",
            "title_similarity": "0.5842345",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h315qrq",
            "score": 1,
            "text": "My last workplace was so toxic that I decided to go into an entirely different line of work!",
            "title_similarity": "0.5770892",
            "sentiment_compound": 0.0
        },
        {
            "id": "h3164r0",
            "score": 1,
            "text": "How about the ones that pay lip service to doing something about it but don't actually do anything about it? Does that make it better or worse?",
            "title_similarity": "0.18393525",
            "sentiment_compound": -0.2168
        },
        {
            "id": "h316bm5",
            "score": 1,
            "text": "all advertising agencies I have worked at suffer from this",
            "title_similarity": "0.61520875",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h317vy6",
            "score": 1,
            "text": "Hey fellow call center workers... how are you feeling?",
            "title_similarity": "0.18895566",
            "sentiment_compound": 0.128
        },
        {
            "id": "h318nvj",
            "score": 1,
            "text": "yeah being treated like an replaceable piece of a machinery on a daily basis will do that to you.",
            "title_similarity": "0.40200168",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h318ru3",
            "score": 1,
            "text": "Sounds like the United States Postal Service but you might have to bump the percentage up even higher. The USPS does such a poor management job that their Labor statistics are never included with the rest of the Federal Government.",
            "title_similarity": "0.62688565",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h3195uq",
            "score": 1,
            "text": "I’m always amazed at how underutilized sincere appreciation is as a management tool. It can cost as little as nothing. \n\nNeedless to say, I appreciate appreciation when it’s offered.",
            "title_similarity": "0.26558232",
            "sentiment_compound": 0.9349
        },
        {
            "id": "h31a29q",
            "score": 1,
            "text": "Healthcare has to be at the top of the list. Everyone is burnt out,  the culture is extremely toxic, and most people say they’d “leave if they could” including myself.",
            "title_similarity": "0.7212025",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h31a5f5",
            "score": 1,
            "text": "Mass email to all staff.",
            "title_similarity": "0.4187625",
            "sentiment_compound": 0.0
        },
        {
            "id": "h31aavx",
            "score": 3,
            "text": "God, is any workplace not toxic?  I’ve worked for all kinds of firms large and small, from large corporations like Amazon (corporate) Darigold, and Omnicare, to small 5-25 person manufacturing shops and I’ve yet to find a place that I find any enjoyment in coming to work.  Work is work, it’s commonly expected, from ownership, that you show up to work and work, not socialize. So that’s what I’ve done for the past 25 years.  I’ve become so introverted that my friends from 20 years ago wouldn’t recognize me.  My wife and I chat for about an hour, give or take, every night, but that’s the extent of my socializing.  Who, who’s been in the work force for more than 10 years, actually has a humane workplace that recognizes were social creatures?",
            "title_similarity": "0.6123368",
            "sentiment_compound": 0.7476
        },
        {
            "id": "h31aygc",
            "score": 1,
            "text": "Tell me you worked at Valucentric without telling me you worked at Valucentric.",
            "title_similarity": "0.15939228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h31bmhh",
            "score": 1,
            "text": "Maybe the assholes that intentionally create these places will stop now that there's studies showing they are losing money for it, but I doubt it. Toxic environments aren't born out of necessity or logic.",
            "title_similarity": "0.42675632",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h31bmt8",
            "score": 1,
            "text": "Accurate description of working in United States corporations.",
            "title_similarity": "0.30808622",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h31bqqz",
            "score": 1,
            "text": "My workplace combatted this by changing the definition of what constitutes a \"toxic\" workplace. Regular everyday harassment is fine now, including being singled out for no reason, unless it is specifically due to belonging to a marginalized group. \n\nDon't get me wrong, I support additional protections for people belonging to marginalized groups, but this is so clearly the company just trying to slim down what can be officially considered \"toxic\" workplace behavior.",
            "title_similarity": "0.5070176",
            "sentiment_compound": 0.7108
        },
        {
            "id": "h31byic",
            "score": 1,
            "text": "What’s better is working for one that’s ‘mental health forward’ and being gaslit for then identifying problematic culture. Hell of a ride.",
            "title_similarity": "0.40690953",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h31c57t",
            "score": 1,
            "text": "Just put my two weeks in at a job that has been dragging me into darkness. I don’t even have another job yet. Just not worth my well-being.",
            "title_similarity": "0.53487796",
            "sentiment_compound": -0.3952
        },
        {
            "id": "h31cq8q",
            "score": 1,
            "text": "Anecdotally, people who describe their workplace and coworkers as toxic are usually the most disruptive and ineffective employees in the organization.",
            "title_similarity": "0.69590545",
            "sentiment_compound": -0.5198
        },
        {
            "id": "h31cwc6",
            "score": 1,
            "text": "So that's why so many people like virtual offices. wow who knew",
            "title_similarity": "0.316073",
            "sentiment_compound": 0.7624
        },
        {
            "id": "h31d4x6",
            "score": 1,
            "text": "Yep. I completely agree.",
            "title_similarity": "-0.04211395",
            "sentiment_compound": 0.6115
        },
        {
            "id": "h31d9ul",
            "score": 1,
            "text": "A year past leaving an incredibly toxic workplace and still fundamentally broken.\n\nIf you find your workplace toxic, it's not worth it, get out.\n\nHas cost me my family, home and nearly my life.",
            "title_similarity": "0.73199093",
            "sentiment_compound": -0.5812
        },
        {
            "id": "h31dm8m",
            "score": 1,
            "text": "*cough cough* ...Retail!... *cough cough*",
            "title_similarity": "0.2261613",
            "sentiment_compound": 0.0
        },
        {
            "id": "h31e6pi",
            "score": 1,
            "text": "So they finally looked at why there’s so many depressed people in the military.",
            "title_similarity": "0.71139944",
            "sentiment_compound": -0.5542
        },
        {
            "id": "h31emi4",
            "score": 1,
            "text": "Amazon/Walmart/Wall street: \"Ya we dont care. Boitstraps!\"",
            "title_similarity": "0.1611034",
            "sentiment_compound": -0.4442
        },
        {
            "id": "h31fdkd",
            "score": 1,
            "text": "See all these studies are nice. But companies couldn’t give two shits. It almost like saying “everyone’s sad, and let’s keep being sad.”",
            "title_similarity": "0.5277523",
            "sentiment_compound": -0.6798
        },
        {
            "id": "h31frhj",
            "score": 1,
            "text": "Good thing I'm depressed all the time so it doesn't change a thing. Well, lunch breaks over, time to get back to it.",
            "title_similarity": "0.40025592",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h31g171",
            "score": 1,
            "text": "They also destroy the mental health of employees who are currently dealing with prior issues.",
            "title_similarity": "0.5429024",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h31g591",
            "score": 1,
            "text": "My workplace is overwhelmingly toxic but they do their best to try and use reverse psychology and prove to us all but it’s a terrific place to work for even though it resembles Communist Russia",
            "title_similarity": "0.5301564",
            "sentiment_compound": 0.8934
        },
        {
            "id": "h31gg1p",
            "score": 1,
            "text": "Someone share this with my employer please. \nI think I've tried every antidepressant on the market. \n\nTrying to find a new job after 4 years is also depressing.",
            "title_similarity": "0.6399005",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h31gi4z",
            "score": 2,
            "text": "Could we win a class action against Best Buy for this?",
            "title_similarity": "0.27590263",
            "sentiment_compound": 0.8402
        },
        {
            "id": "h31gpre",
            "score": 1,
            "text": "It's weird bc a toxic workplace can be toxic for just one person. \n\nYOU guys may be fine miring in this muck, but for ME it is toxic AF",
            "title_similarity": "0.5601476",
            "sentiment_compound": 0.0129
        },
        {
            "id": "h31hr3k",
            "score": 1,
            "text": "This is half the reason I just resigned. First time I admitted to myself I was depressed.",
            "title_similarity": "0.5557947",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h31htxj",
            "score": 1,
            "text": "I had this one cry last year where I really need to find a new job in my home country because current job that I had really makes me live alone. Granted there is no support system at that tike because my gf and all my family lived in my home country. Thats the closest thing I ever had with depression related to work and I urge everyone that had the same feeling to take care of yourself regarding mental gealth",
            "title_similarity": "0.5677636",
            "sentiment_compound": -0.6551
        },
        {
            "id": "h31iaj9",
            "score": 1,
            "text": "Why does every post get like a hundred awards?",
            "title_similarity": "0.50107026",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h31it7p",
            "score": 1,
            "text": "I was working at this bs company for about a year and I hate most of what I did there . After just walking out one day and getting another job it felt so weird not to be completely stressed.  I remember just sitting in a bench on the park being happy , not feing hateful or anxious or anything like that.",
            "title_similarity": "0.50366455",
            "sentiment_compound": -0.2038
        },
        {
            "id": "h31ivll",
            "score": 1,
            "text": "Never sacrifice for work, they will not pay.",
            "title_similarity": "0.14857261",
            "sentiment_compound": 0.0762
        },
        {
            "id": "h31jbbg",
            "score": 1,
            "text": "A doctor once said that he had never seen so many people on antidepressants as where I used to work. My least favorite job of my life. I retired early I don’t care what Suze Orman says she isn’t living to be miserable like a lot of people have/are.",
            "title_similarity": "0.5479408",
            "sentiment_compound": 0.0052
        },
        {
            "id": "h31jki7",
            "score": 3,
            "text": "Wait so which is it, 300% more or threefold? The only two numbers given in the article are in the title and they are different things.\n\nAn increase of 300% is four-fold (the base 1-fold plus the increase of 3-fold).\n\nI know it's pedantic but it is a serious problem with media reporting on research.",
            "title_similarity": "0.69394195",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h31kq2f",
            "score": 2,
            "text": "Let me share a little experience for you, being degraded for doing a good job and the whole system you work for geared up to doing a bad job can break a good man, I worked for my local council that activly screwed a local business because the director employed his son to run the department, he then provided his mates with overtime for not working it, call out pay for not working it, was promoted for costing the council tens of thousands for ordering wrong stock, but then is protected by unite the union because it would call into repute the union officials reputation, hey tax payer is guilty of money laundering, who cares",
            "title_similarity": "0.6711308",
            "sentiment_compound": 0.4678
        },
        {
            "id": "h31kx4k",
            "score": 1,
            "text": "One of my job, my boss was spineless and cared only about the profits. The employees were downtrodden by his actions and in retaliation I made the workers question their jobs and broken the trust between the employer and employees. It was a nudge really.",
            "title_similarity": "0.5587864",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h31lb9z",
            "score": 1,
            "text": "Pick a % any % .... one place I worked ... drove that risk up 10,000% or more",
            "title_similarity": "0.61145806",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h31lrgu",
            "score": 1,
            "text": ">organisations that fail to prioritise their employees' mental health\n\nSo every company?",
            "title_similarity": "0.5789517",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h31m6qf",
            "score": 1,
            "text": "Call centers... Just not enough money for the mental strain.",
            "title_similarity": "0.38716018",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h31nhys",
            "score": 1,
            "text": "Even beyond just companies choosing to ignore their work force’s mental health, there is also the natural situation of social hierarchies inherently built into traditional (and even more modernized) management styles (top/down, lateral etc.) that most definitely contribute to an increased risk in toxic work environments and culture.",
            "title_similarity": "0.5950786",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h31nr9v",
            "score": 2,
            "text": "Another reason people want WFH",
            "title_similarity": "0.10491086",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h31o3qz",
            "score": 1,
            "text": "I wonder what organizations could do to alleviate the stress of their jobs? Perhaps they could reduce their hours, increase their wages, or I don’t know treat them like human beings who deserve fair compensation for their labor and not robots from which wealth can be eternally extracted.",
            "title_similarity": "0.5029216",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h31ookj",
            "score": 1,
            "text": "What about toxic relationships? I’m sure that’s much worse for depression.",
            "title_similarity": "0.52977455",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h31powe",
            "score": 1,
            "text": "And I don't think it'll ever change sadly. Corporations couldn't possibly care less if they tried",
            "title_similarity": "0.20348947",
            "sentiment_compound": -0.6628
        },
        {
            "id": "h31ptwf",
            "score": 1,
            "text": "I really wish my old manager had listened to us all, paid attention & made changes. Maybe if he had he wouldn’t of found me on the floor of the toilet mid panic attack mid shift. I never went back.",
            "title_similarity": "0.5121617",
            "sentiment_compound": -0.5279
        },
        {
            "id": "h31qbig",
            "score": 1,
            "text": "whats a toxic workplace?, given this is a science subreddit we should be able to quantifiably define what makes a place \"toxic\"",
            "title_similarity": "0.4405549",
            "sentiment_compound": 0.0
        },
        {
            "id": "h31qffo",
            "score": 1,
            "text": "The article doesn’t even link to the study. There are a ton of confounders that need to be controlled if this relationship is meant to prove causal.",
            "title_similarity": "0.34077913",
            "sentiment_compound": 0.0
        },
        {
            "id": "h31qi7a",
            "score": 1,
            "text": "This is very true.\nI loved my job but my boss was immensely toxic. My colleagues saw how he treated me and never said anything to him or anyone else. I had only had mild anxiety before but it increased to such a level that I quit my job just to get away from him. \nI work in the arts. I was fortune to have a job, but I’d rather have my health than the money.",
            "title_similarity": "0.56897074",
            "sentiment_compound": 0.6403
        },
        {
            "id": "h31re4z",
            "score": 1,
            "text": "well that explains a lot! Back to back toxic employers from 2008-2011 and I'm still struggling...",
            "title_similarity": "0.6756149",
            "sentiment_compound": -0.2481
        },
        {
            "id": "h31sqc5",
            "score": 1,
            "text": "Welcome to the United States Postal Service!",
            "title_similarity": "0.14680073",
            "sentiment_compound": 0.7263
        },
        {
            "id": "h31x310",
            "score": 1,
            "text": "Spec’s liquor stores in Texas. the most disorganized, outdated and poorly run company ive ever worked for",
            "title_similarity": "0.5064533",
            "sentiment_compound": -0.3597
        },
        {
            "id": "h31z5mg",
            "score": 1,
            "text": "Feeling this right now.",
            "title_similarity": "-0.028898938",
            "sentiment_compound": 0.128
        },
        {
            "id": "h322trv",
            "score": 1,
            "text": "Bonadent dental laboratories cough cough",
            "title_similarity": "0.35251468",
            "sentiment_compound": 0.0
        },
        {
            "id": "h325yx0",
            "score": 1,
            "text": "But will they be more productive?  I'm not trying to be a contrarian but companies are build to attempt to effectively allocate a service or materials into a profitable revenue stream. Full stop. \n\nIf we want to argue in favor of businesses treating their employees better than they have in the past, we need to argue more intelligently. Don't stop at depression. Demonstrate that those are not functional depressed people but rather that their productivity and creativity decrease and that should be the headlines. It's not because business leaders are these greedy emotionless jerks (most people are good people).  It's because they're under pressure to maximize profits and pity doesn't translate well during performance reviews at any level.",
            "title_similarity": "0.5431691",
            "sentiment_compound": 0.973
        },
        {
            "id": "h326qs6",
            "score": 1,
            "text": "This is very cool. Opens the door for a valid lawsuit over work conditions.",
            "title_similarity": "0.28324974",
            "sentiment_compound": 0.1761
        },
        {
            "id": "h327ann",
            "score": 1,
            "text": "And when your company constantly says they care...they don't.\n\nIf you like your job then they care without telling you all the time.\nKeep that job.",
            "title_similarity": "0.2786133",
            "sentiment_compound": 0.2709
        },
        {
            "id": "h3282zg",
            "score": 1,
            "text": "The US military denies this science and claims everything is fine",
            "title_similarity": "0.13217595",
            "sentiment_compound": -0.25
        },
        {
            "id": "h328q3x",
            "score": 5,
            "text": "My previous bosses mentality was \"If we don't have enough staff, you guys can just stay late and do it\".  I talked to her about it, got nowhere.  Talked to her boss about it, got corporate fake talk as a response, so I put my 2 weeks in.  I have no idea why she was surprised...",
            "title_similarity": "0.6096709",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h32b4i7",
            "score": 1,
            "text": "And depression reduces productivity so businesses better start being more employee friendly.",
            "title_similarity": "0.48603866",
            "sentiment_compound": 0.4509
        },
        {
            "id": "h32cph4",
            "score": 1,
            "text": "And that's why I re-upped my prozac prescription. I should try for a different job.",
            "title_similarity": "0.25106895",
            "sentiment_compound": 0.0
        },
        {
            "id": "h32f9nh",
            "score": 2,
            "text": "These places are also usually revolving doors for employees also. Disgusting overhead management, disgusting work conditions (I'm looking at you, Noosa yogurt)",
            "title_similarity": "0.46676025",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h32gyq6",
            "score": 1,
            "text": "I feel that number is likely DRASTICALLY undervalue. How do you account for the people with undiagnosed depression due to the inability to even afford the doctor’s visit?The people without the time to go? The people who are too stubborn?",
            "title_similarity": "0.63589066",
            "sentiment_compound": -0.8534
        },
        {
            "id": "h32k4u3",
            "score": 1,
            "text": "And people wonder why work from home has been the best thing coming out of this pandemic.",
            "title_similarity": "0.46496776",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h32kar2",
            "score": 1,
            "text": "I filled out a confidential survey and said every time I came to work I wanna shoot myself in the face, and it wasn’t hyperbole.\n\nThey gave me a number to call, and released the results of the survey to my boss, who then wrote me up for having a bad work environment, because I was depressed because of my bosses bad work environment.",
            "title_similarity": "0.6332375",
            "sentiment_compound": -0.9081
        },
        {
            "id": "h32lhaw",
            "score": 1,
            "text": "Ahh if only dog grooming paid 120k a year",
            "title_similarity": "0.48016733",
            "sentiment_compound": 0.0
        },
        {
            "id": "h32n4o8",
            "score": 1,
            "text": "You don’t know until you leave one but by God working in a healthy environment after a toxic one feels like literally losing 50 pounds and a knife between your shoulder blades. Life changing.",
            "title_similarity": "0.6046927",
            "sentiment_compound": 0.714
        },
        {
            "id": "h32q8yp",
            "score": 1,
            "text": "Well if that isn't my former workplace",
            "title_similarity": "0.22260627",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h32qjdy",
            "score": 1,
            "text": "\"workers employed by organisations that fail to prioritise their employees' mental health\" HAHAHAHAHAHAHAHA",
            "title_similarity": "0.5028567",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h32stbd",
            "score": 1,
            "text": "So insurance should be provided at these jobs... Oh wait, this is now all of a sudden a quack job study that has no merit or basis on reality and fact.",
            "title_similarity": "0.38359824",
            "sentiment_compound": -0.3252
        },
        {
            "id": "h32tdzb",
            "score": 1,
            "text": "The us is much like my mental health we know what causes the issues we just can be bothered to fix them",
            "title_similarity": "0.26358873",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h32utl7",
            "score": 1,
            "text": "Did we really need a full study for this?",
            "title_similarity": "0.2787271",
            "sentiment_compound": 0.0
        },
        {
            "id": "h32v64n",
            "score": 1,
            "text": "Well, Of Course I Know Him. He's Me.",
            "title_similarity": "-0.035711184",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h32v9kj",
            "score": 1,
            "text": "Left a toxic workplace 2 months ago and I've never felt better.",
            "title_similarity": "0.6393317",
            "sentiment_compound": -0.3412
        },
        {
            "id": "h32wzfc",
            "score": 1,
            "text": "Universal mental health care is just as important as physical health care. Everyone needs both.",
            "title_similarity": "0.26953882",
            "sentiment_compound": 0.802
        },
        {
            "id": "h32z4x9",
            "score": 1,
            "text": "Congratulations u/Wagamaga ! Your post was the top post on r/science today! (06/26/21)\n\nTop Post Counts: r/science (3) \n\n*This comment was made by a bot*",
            "title_similarity": "0.45813674",
            "sentiment_compound": 0.7955
        },
        {
            "id": "h330zsv",
            "score": 1,
            "text": "Who'd have thought a negative place you're forced to spend the majority of your life or risk being homeless and starving would end up making you depressed. TIL",
            "title_similarity": "0.6275252",
            "sentiment_compound": -0.9313
        },
        {
            "id": "h331tps",
            "score": 1,
            "text": "And it’s like the frog being boiled, you don’t realize it when it’s happening.  I got a job out of law school I considered myself extremely lucky to get... woke up one day six years later, realized *every* single person in the department I’d started with had either quit or been fired, was in the worst physical shape of my life, nerves beyond frayed, a serious relationship that was gutted because of what a burn out I was after work.. etc. etc\n\nQuit that week.  Making a lot less money and happy as hell about it",
            "title_similarity": "0.64854157",
            "sentiment_compound": -0.7159
        },
        {
            "id": "h33278o",
            "score": 1,
            "text": "My problem with the study is how vague \"workplace toxicity\" is to begin with.\n\nDifferent types of jobs give you different levels of stress, naturally. There will be differences in outcomes inevitably.",
            "title_similarity": "0.54308856",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h334ud2",
            "score": 1,
            "text": "#*Amazon has left the chat*",
            "title_similarity": "0.103520386",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h336f4s",
            "score": 1,
            "text": "Ya cool we discover this amazing concept like twice a month, fix it, stop telling me about it",
            "title_similarity": "0.4583863",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h337zrj",
            "score": 1,
            "text": "Looking at you Shitibank",
            "title_similarity": "0.09828517",
            "sentiment_compound": 0.0
        },
        {
            "id": "h339brr",
            "score": 1,
            "text": "And as a surprise to no one those same toxic workplaces will suprisingly not give a damn when given this info.\n\nMuch more likely to just get the next lot of workers in and get rid of the old stock.",
            "title_similarity": "0.5380586",
            "sentiment_compound": 0.2865
        },
        {
            "id": "h33b0ks",
            "score": 1,
            "text": "I worked for 3.5 years in a toxic workplace, it wasn’t my coworkers it was management that were toxic. I hated going to work every day, and I was depressed off and on, thankfully I another job and it is a complete joy to go there. Don’t get me wrong I have my bad days at work, but that due to things that happen during the shift, and not due to management or my coworkers. I have much less stress in my life, I am much happier in general, and my health has improved as well, physically and mentally I am in a much better place.\n\nMy advice is get out of a toxic environment ASAP, stay just long enough to get another job lined up and quit. If you stay you risk your physical and mental health.",
            "title_similarity": "0.6667582",
            "sentiment_compound": 0.7642
        },
        {
            "id": "h35a86s",
            "score": 1,
            "text": "How could you not be depressed working 40 hours a week?",
            "title_similarity": "0.58873975",
            "sentiment_compound": 0.4023
        },
        {
            "id": "h38zeqa",
            "score": 1,
            "text": "Just need to show  to businesses end-end that toxic workplaces -> depression -> worse performance/profit.  \n\n\nShould help a lot.",
            "title_similarity": "0.55200875",
            "sentiment_compound": -0.6249
        }
    ]
}