{
    "Alarming climate change: Earth heads for its tipping point as it could reach +1.5 °C over the next 5 years, WMO finds in the latest study\n": [
        {
            "id": "h60c1km",
            "score": 1,
            "text": "Here's a direct link to the report issued by the World Meteorological Organization: [WMO Global Annual to Decadal Climate Update for 2021–2025](https://hadleyserver.metoffice.gov.uk/wmolc/WMO_GADCU_2020.pdf) (**Warning! PDF**)\n\nAnd associated press releases from the WMO and the UK's Met Office, who produced the report:\n\n* WMO: [New climate predictions increase likelihood of temporarily reaching 1.5 °C in next 5 years](https://public.wmo.int/en/media/press-release/new-climate-predictions-increase-likelihood-of-temporarily-reaching-15-%C2%B0c-next-5)\n* Met Office: [Temporary exceedance of 1.5°C increasingly likely](https://www.metoffice.gov.uk/about-us/press-office/news/weather-and-climate/2021/chance-of-temporarily-reaching-1.5-c-in-next-five-years-is-increasing)",
            "title_similarity": "0.8221966",
            "sentiment_compound": 0.2481
        },
        {
            "id": "h5zn8pr",
            "score": 7,
            "text": "Thanks conservatives. We could have prevented this or at least mitigated it. But your love of money and unfounded blind faith in invisible sky-daddies have screwed US all.",
            "title_similarity": "0.38107404",
            "sentiment_compound": 0.5647
        },
        {
            "id": "h5zf5zd",
            "score": 27,
            "text": "They're saying the same since the 70's. I don't deny climate change, I deny climate tabloid press.",
            "title_similarity": "0.5416708",
            "sentiment_compound": -0.0936
        },
        {
            "id": "h5zk3br",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "0.095397405"
        },
        {
            "id": "h5zjf54",
            "score": 11,
            "text": "Hmmm maybe we should stop having offspring for awhile.  Just saying",
            "title_similarity": "0.28198177",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5z2f3b",
            "score": -15,
            "text": "Time to start learning Russian or applying for a Canadian visa because they will be the only habitable places by 2050",
            "title_similarity": "0.5993755",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zwrzd",
            "score": -6,
            "text": "Oh wow, another \" tipping point\"",
            "title_similarity": "0.21432233",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h5zhpz3",
            "score": -16,
            "text": "Remember to keep making lots of kids, so that they can suffer. It should be considered cruel to get kids at this point. Unless you like the though of them suffering.",
            "title_similarity": "0.28260314",
            "sentiment_compound": -0.836
        },
        {
            "id": "h5zi8ok",
            "score": -66,
            "text": "I really don't believe these studies, they're always funded by Governments with a specific agenda, and the funding is always given to the same companies to deliver the same narrative that the government wants.\n\nFor literally decades it's always doom and gloom and scare tactics, it used to be acid rain, or great freezes, now it's oh the planet is heating up and the ice caps will melt.\n\nIs the climate changing, yes it is, is it a natural phenomenon, yes, are humans responsible for some of it, yes, is it going to kill all of us, no.\n\nAll it does is give governments more means to control us, they're already discussing \"climate lockdowns\" similar to covid lockdowns, they're saying they're going to restrict and tax red meat. \n\nStop buying into the hysteria because there is an agenda at play here people, and it isn't a conspiracy theory it is out there in the open, these nutjobs are telling us what their intentions are, it's control control control and they're using fear and their media assets to drive this narrative.",
            "title_similarity": "0.5735855",
            "sentiment_compound": -0.5145
        },
        {
            "id": "h5z81z3",
            "score": -40,
            "text": "TAnd humans everywhere: 'aWw LeT's hAvE a bAbY! LEt'S hAvE a BuNcH oF bAbIeS!'\n\n****sigh**** \n\nI'm sorry. It's been a rough week of discovering that people I thought were smart actually believe that essential oils are better than vaccines. \nI just....I can't be positibe about humans right now. Maybe I need to go to r/aww for awhile. \n\nThank you for sharing this. And thanks for believing in science ♡",
            "title_similarity": "0.4960366",
            "sentiment_compound": 0.9214
        },
        {
            "id": "h5zsqr5",
            "score": 11,
            "text": "Can we stop with the individual responsibility and start pointing fingers. China and India produce more CO2 than all of Europe and Africa...",
            "title_similarity": "0.44617295",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5zc0rg",
            "score": -9,
            "text": "To have children at this point is basically madness.",
            "title_similarity": "0.26115137",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h5zthgv",
            "score": 1,
            "text": "…and still, ppl decide to have kids…",
            "title_similarity": "0.24187174",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zbmgz",
            "score": 0,
            "text": "Nothing to do now except give up. Oh well, it was a good run everyone.",
            "title_similarity": "0.11298757",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h5zncfy",
            "score": -6,
            "text": "This is the last generation. Let's all enjoy ourselves before we go extinct",
            "title_similarity": "0.30968022",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h5z3qxf",
            "score": -5,
            "text": "Imagine Jeff the dragon would actually use the shitload of money he hoards to do something for the greater good!",
            "title_similarity": "0.34799838",
            "sentiment_compound": 0.69
        },
        {
            "id": "h5zdwjo",
            "score": 20,
            "text": "Rename this thread to science LARPing",
            "title_similarity": "0.3050142",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zl9v8",
            "score": 3,
            "text": "If you can’t stand the heat, don’t eat meat.",
            "title_similarity": "0.15239775",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zqc71",
            "score": 0,
            "text": "No one is fixing this... Don't have kids people, the world will not be a good place soon... well.. a worse place",
            "title_similarity": "0.26754355",
            "sentiment_compound": -0.6814
        },
        {
            "id": "h5zq19f",
            "score": -35,
            "text": "These people are just as accurate at predicting climate change as Q Anon was at predicting new inauguration dates",
            "title_similarity": "0.48395482",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zxsbl",
            "score": -4,
            "text": "The solution is to stop making new humans for like 20 years.",
            "title_similarity": "0.6196971",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h5z7m14",
            "score": -8,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h5zoge6",
            "score": 7,
            "text": "Why do you think these asshole billionaires are so anxious to get off this planet?",
            "title_similarity": "0.34727386",
            "sentiment_compound": -0.3851
        },
        {
            "id": "h5zkz1u",
            "score": 24,
            "text": "Why is that that literally over night it feels, Reddit is slam full of post making it seem like the world is ending next week?",
            "title_similarity": "0.6064986",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h5zp5ec",
            "score": 0,
            "text": "20 thousand years of this, and seven more to go",
            "title_similarity": "0.5302774",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6076yv",
            "score": 0,
            "text": "I'm Sorry , but the same studies were not able to predict what we are experiencing now. I'm not a climate scientist, but I have serious problems believing these studies. My perception is that we're not as able to analyse the climate data as we think we can , i truly believe the tipping point is far behind us.\n\nBut I look forward to see any more informations presented, i do not own the truth, so i'm ready to change my beliefs.",
            "title_similarity": "0.42260745",
            "sentiment_compound": 0.2322
        },
        {
            "id": "h5z0emu",
            "score": 43,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h5z3ogt",
            "score": -10,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h5zwljs",
            "score": 4,
            "text": "I've been seeing Earth heads for its tipping point for like 20 years now",
            "title_similarity": "0.7087043",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5zgtwm",
            "score": 3,
            "text": "This is the great filter and something tells me we’re not going to pass it",
            "title_similarity": "0.2143397",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5zyts5",
            "score": -6,
            "text": "How many tipping points are there? I have a feeling it's not as impactful as the first tipping point being announced.",
            "title_similarity": "0.33109844",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5z0cfm",
            "score": 11,
            "text": "Time for some terra forming on a massive scale?",
            "title_similarity": "0.35119906",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5z92e4",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h5zazt6",
            "score": -1,
            "text": "They stuck it to the libs tho",
            "title_similarity": "0.10740944",
            "sentiment_compound": -0.25
        },
        {
            "id": "h5zb0e1",
            "score": -2,
            "text": "They stuck it to the libs tho",
            "title_similarity": "0.10740944",
            "sentiment_compound": -0.25
        },
        {
            "id": "h5zonap",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h5zusqa",
            "score": -5,
            "text": "Wow kinda a fear based headline.. I kinda doubt it's that fast.",
            "title_similarity": "0.33391708",
            "sentiment_compound": -0.0846
        },
        {
            "id": "h5zuzcy",
            "score": 8,
            "text": "They’ve said this for the past like 40 years",
            "title_similarity": "0.4093394",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5zlz8a",
            "score": -17,
            "text": "I’m gonna keep eating meat to save the climate. Come on meat eaters, rise up! We can solve this crisis together",
            "title_similarity": "0.37573195",
            "sentiment_compound": -0.2885
        },
        {
            "id": "h61e8x0",
            "score": 0,
            "text": "At this point aren't we completely past the point of no return? I'm too tired to even give a damn at this point. Best I can do for all of us is just not have kids. Too bad there's so many foreigners and welfare queens popping out 10 who can't even afford one.",
            "title_similarity": "0.37478477",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h61jqif",
            "score": 0,
            "text": "I would bet money the next 5 years will be colder.",
            "title_similarity": "0.7762897",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5znp84",
            "score": -3,
            "text": "People should have more kids now definitely, it's a blessing.",
            "title_similarity": "0.1962525",
            "sentiment_compound": 0.7322
        },
        {
            "id": "h5z7oqo",
            "score": -54,
            "text": "They're saying the same since the 70's. I don't deny climate change, I deny climate tabloid press.",
            "title_similarity": "0.5416708",
            "sentiment_compound": -0.0936
        },
        {
            "id": "h5zvjsi",
            "score": -2,
            "text": "I feel like this would be more impactful if we didn’t have an article every week saying we’re getting near or have already passed the tipping point.",
            "title_similarity": "0.504905",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5zldfd",
            "score": -30,
            "text": "Yet more globalist fear based bs.\n\nWe are all gonna die unless we hand them complete control of humanity. We get it. Zzzzzzzz",
            "title_similarity": "0.4688133",
            "sentiment_compound": -0.6344
        },
        {
            "id": "h5zmpt2",
            "score": 3,
            "text": "I think we should send some billionaires to space about it. Seems like a good use of time and resources.",
            "title_similarity": "0.3811997",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h5zqwgi",
            "score": -17,
            "text": "Literally every climate change alarmist forecast has been woefully wrong since they started making them as this will no doubt be as well. Its just weather.",
            "title_similarity": "0.48828316",
            "sentiment_compound": -0.3798
        },
        {
            "id": "h5z5xl9",
            "score": -18,
            "text": "Have we considered doing the lockdown again to combat this? Or even clean the ocean and elimate going to the ocean ever?",
            "title_similarity": "0.43610257",
            "sentiment_compound": 0.168
        },
        {
            "id": "h5zk9f8",
            "score": -22,
            "text": "Alarmist nonsense… “tipping point” - as if we are in the Goldilocks zone at this very moment, and the earth is going to suddenly blow up with a 1.5 degree change on average. Hint (it’s not) and not all of the resulting change will be bad. Some will- and some won’t. To say otherwise is just intellectually dishonest to try to get your prescribed solutions implemented.",
            "title_similarity": "0.61753076",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h5zuzmj",
            "score": 24,
            "text": "So I'm not trying to sound dramatic or doom scrolling or beg for attention or anything.\n\nBut like what's the point of going on? Nothing is changing and by the time we decide we want to change things to mitigate things it will be far beyond to late. Like what reason is there to even wake up anymore?",
            "title_similarity": "0.2762817",
            "sentiment_compound": 0.755
        },
        {
            "id": "h5zrq2u",
            "score": -7,
            "text": "This article makes no sense the title is click bait. Convince me climate change is cause by man. Show me how any recourse of \"clean\" energy will have effects on the future we need clear hard data on how our choices will have any effect before we devastate our economic system.",
            "title_similarity": "0.48072016",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h5zfeif",
            "score": 62,
            "text": "[removed]",
            "title_similarity": "0.09539736"
        },
        {
            "id": "h5zeqm9",
            "score": -5,
            "text": "I’ve been feeling really warm for a few months now",
            "title_similarity": "0.367556",
            "sentiment_compound": 0.4005
        },
        {
            "id": "h5zyepv",
            "score": -7,
            "text": "If environmentalists killed themselves their lifetime carbon footprint would be reduced by 100%",
            "title_similarity": "0.5832367",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h5z3o7k",
            "score": 57,
            "text": "Planets getting hotter, air quality is ass in the US to the point where I can’t go outside without risking my health. What’s not to hate about the outside?! Its totally not like my father is slowly dying and practically suffocating due to his sensitive breathing problems! HAHA NO NOT AT ALL ITS ALL FINE AND DANDY HERE FOLKS. \n\nFr tho this world sucks I don’t want to live on it anymore.",
            "title_similarity": "0.4386105",
            "sentiment_compound": -0.473
        },
        {
            "id": "h5znjdc",
            "score": -3,
            "text": "If you have children, they will inherit a world from us that is extremely difficult to farm on. Where water is a precious commodity. The world is already fucked, the runaway greenhouse effect is already well and truely gone.",
            "title_similarity": "0.49006814",
            "sentiment_compound": -0.3384
        },
        {
            "id": "h5zx4d0",
            "score": 3,
            "text": "The planet is fucked. It’s hard to give a damn when the nail is already in the coffin.",
            "title_similarity": "0.3265097",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h5zb9xo",
            "score": -27,
            "text": "Time to be afraid, as is always the case. We want you to think and feel a certain way in order for you to perform a certain action. Now act!",
            "title_similarity": "0.23932049",
            "sentiment_compound": 0.5848
        },
        {
            "id": "h5zeryb",
            "score": 1,
            "text": "No one, and I mean no one, saw this coming.",
            "title_similarity": "0.060506605",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5zf586",
            "score": 1,
            "text": "I hope at least before the end they string up all the oil executives and people responsible for this mess.  It won't change anything, but they deserve the worst",
            "title_similarity": "0.38788334",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h5zhbu3",
            "score": 1,
            "text": "I don't wanna be too hyperbolic but we're pretty fucked.",
            "title_similarity": "0.13474618",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h5zhkyp",
            "score": 1,
            "text": "We're going to scorch ourselves off the planet one day.\n\nThat's what we get for being dumb humans. We shouldn't be allowed to leave our home planet. If there's some galactic federation of societies out there watching us, I'm sure they feel the same.\n\nI mean, half of us can't even put our shopping carts away. We litter without thinking. We destroy our own home planet.",
            "title_similarity": "0.4258784",
            "sentiment_compound": 0.1655
        },
        {
            "id": "h5zlgvf",
            "score": -1,
            "text": "That's insane. For people who can't put it into perspective, Imagine if this was your body instead of the earth. You now have a fever at about 38.6 °C",
            "title_similarity": "0.5189251",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h5znqfr",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h5zzkrw",
            "score": 1,
            "text": "I mean, no one really expected humans to do anything about this, right?",
            "title_similarity": "0.10775311",
            "sentiment_compound": -0.296
        },
        {
            "id": "h606ugw",
            "score": 1,
            "text": "Thought we had already passed it?  Hard to keep up with the doomsday timelines.",
            "title_similarity": "0.3652257",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h5zqbj2",
            "score": -20,
            "text": "You guys need to chill with the earth is ending crap. Yes climate change is real but we will adapt. Populations will migrate and we will learn from our mistakes. \n\nPeople may die but ultimately the human race will be fine. Always remember everything humans have overcome since our inception. Many said humans wouldn't survive the great flood but Noah made it out just fine.",
            "title_similarity": "0.50818074",
            "sentiment_compound": -0.8908
        },
        {
            "id": "h5zm4f9",
            "score": -9,
            "text": "Reddit continues to celebrate China anyway.",
            "title_similarity": "0.2224046",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h5ynm3h",
            "score": 17,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.33710927",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h5zimfe",
            "score": -13,
            "text": "Well, \"could\". I don't know how reliable these studies are. Acording to older studies it should have been so warm now we would all be dead.",
            "title_similarity": "0.39633462",
            "sentiment_compound": -0.18
        },
        {
            "id": "h5zcdzh",
            "score": -35,
            "text": "I don't know how many of you were around for it back in the 80s when Time magazine had a cover story crying we were heading into a new ice age.\n\nI'm no scientist, but I see just as much crying foul from either side of the climate change issue; not to dismiss it out-of-hand, because mankind surely has an impact, but the fact that the earth's climate seems to be cyclical coupled with a shifting of the magnetic poles has got to account for no small measure of change, in and of itself.\n\nThat said, those in charge of destroying the amazon should be hunted down and eviscerated, because they are absolutely clearcutting despite knowing full well the damage it's doing.",
            "title_similarity": "0.57923925",
            "sentiment_compound": -0.9444
        },
        {
            "id": "h5z45k1",
            "score": 3,
            "text": "Imagine Jeff the dragon would actually use the shitload of money he hoards to do something for the greater good!",
            "title_similarity": "0.34799838",
            "sentiment_compound": 0.69
        },
        {
            "id": "h5z7yzk",
            "score": -3,
            "text": "TAnd humans everywhere: 'aWw LeT's hAvE a bAbY! LEt'S hAvE a BuNcH oF bAbIeS!'\n\n****sigh**** \n\nI'm sorry. It's been a rough week of discovering that people I thought were smart actually believe that essential oils are better than vaccines. \nI just....I can't be positibe about humans right now. Maybe I need to go to r/aww for awhile. \n\nThank you for sharing this. And thanks for believing in science ♡",
            "title_similarity": "0.4960366",
            "sentiment_compound": 0.9214
        },
        {
            "id": "h5znajp",
            "score": -4,
            "text": "1.5 c is 34.7 in freedom units… Oh no! we ded.",
            "title_similarity": "0.46406382",
            "sentiment_compound": 0.6696
        },
        {
            "id": "h5z7rhb",
            "score": 48,
            "text": "Animal agriculture contributes to around 20% of global emissions. Maybe consider getting on the plant based wagon.",
            "title_similarity": "0.56173843",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5z35zy",
            "score": -30,
            "text": "You people need to chill. Yeah it’s a problem. But if China isn’t willing to do anything about cutting their emissions who gives a damn what we do. Look, we’re already talking about terraforming Mars. If we can turn geoengineering into a thing there’s no reason we can do it to the earth at some point in the future.",
            "title_similarity": "0.41348234",
            "sentiment_compound": -0.81
        },
        {
            "id": "h5z7fj6",
            "score": -28,
            "text": "But all the major surface temperature indices have been in decline since February 2020.  That includes: **HadCRUT5, GISSlo, NOAAlo, BESTlo, C&Wkrig, TempLSmesh, UAH6.LT, RSS TLT V4**.\n\nIf only that information was easily accessible to the public so they could look themselves.\n\nOh look!\n\nhttps://imgur.com/sFTarrH\n\nSourced from: https://moyhu.blogspot.com/p/latest-ice-and-temperature-data.html",
            "title_similarity": "0.661239",
            "sentiment_compound": 0.5255
        },
        {
            "id": "h5z1dk6",
            "score": -11,
            "text": "Can someone comment on what would happen if a antimatter black hole became caught in an \"ordinary matters\" black hole gravitional field?",
            "title_similarity": "0.4141257",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h5z78il",
            "score": -2,
            "text": "If you weren't aware, we as a society have determined the way this all ends. No power to the truth and everything goes with it like as if we were never here in the first place.",
            "title_similarity": "0.3205726",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h5z7asr",
            "score": -2,
            "text": "If you weren't aware, we as a society have determined the way this all ends. No power to the truth and everything goes with it like as if we were never here in the first place",
            "title_similarity": "0.3192066",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h5zblwm",
            "score": 1,
            "text": "So we’re fucked basically. We all know it. Question is how much mitigation do we do for the next generation? What a time to be alive! The small slice of time on earth when intelligence rose and destroyed the very environment which produced it.",
            "title_similarity": "0.51796305",
            "sentiment_compound": -0.5378
        },
        {
            "id": "h5ze36q",
            "score": 2,
            "text": "Its been game over for a long time already. The fix to this was that the rich gave up some of their wealth, when I was old enough to understand such things I knew this world was doomed.",
            "title_similarity": "0.4771169",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h5ze409",
            "score": 3,
            "text": "Man i Wish someone had warned us 50,40, 30, 20, 10, 5 years ago.",
            "title_similarity": "0.5729885",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h5zfdrw",
            "score": 2,
            "text": "\"We're circling the drain\" - George Carlin",
            "title_similarity": "0.29292768",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zg6jm",
            "score": 0,
            "text": "You think the world is ending, buddy it already did.",
            "title_similarity": "0.33412203",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zm1w9",
            "score": 1,
            "text": "We don't care, right? As it will mainly effect our children and grandchildren? I feel science has never been so disrespected as the last years, mainly since Trump.",
            "title_similarity": "0.45433277",
            "sentiment_compound": -0.7817
        },
        {
            "id": "h5zn9ga",
            "score": 2,
            "text": "We are like the crabs boiling alive",
            "title_similarity": "0.2566268",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5znmex",
            "score": 1,
            "text": "I’m glad I decided not to bring a family into this world. I couldn’t imagine the next generation dealing with this. It’s already a struggle for my own.",
            "title_similarity": "0.31306237",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h5zo6e0",
            "score": 2,
            "text": "When it snows and gets cold somewhere, some idiot will scream “where is climate change when you need it!” and other anti-science idiot followers will cheer.",
            "title_similarity": "0.48260012",
            "sentiment_compound": -0.7424
        },
        {
            "id": "h5zo9o3",
            "score": -1,
            "text": "It’s a wrap. It’s been a fun time but it’s over. I wish I wasn’t so certain. Ignorance is bliss.",
            "title_similarity": "0.2371042",
            "sentiment_compound": 0.8932
        },
        {
            "id": "h5zpeci",
            "score": 1,
            "text": "This summer is the coldest summer I'll experience for the rest of my life!",
            "title_similarity": "0.5903248",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zrsu6",
            "score": 2,
            "text": "Hey, what can you say. We were overdue.",
            "title_similarity": "0.19256215",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zsqwh",
            "score": 2,
            "text": "The quiet comprehending of the ending of it all.",
            "title_similarity": "0.1513116",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zucc1",
            "score": 1,
            "text": "Don't have kids. Please don't bring innocent lives into a dying world.",
            "title_similarity": "0.18323413",
            "sentiment_compound": -0.4585
        },
        {
            "id": "h5zwnft",
            "score": 2,
            "text": "Whether you ever wanted it or not, either willfully or ignorantly, you are watching the world burn.",
            "title_similarity": "0.2844204",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h5zyx12",
            "score": 0,
            "text": "Forcibly remove all climate change deniers from any leading position. Fast track all climate related projects.",
            "title_similarity": "0.42765394",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h603b12",
            "score": 2,
            "text": "Going vegan is one of the best things you as an individual can do for climate change",
            "title_similarity": "0.37582764",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h60gyq6",
            "score": -2,
            "text": "We are entering a grand solar minimum that will last 30 years. Very unlikely  we will see any increase in temperature.",
            "title_similarity": "0.6504641",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h60un6m",
            "score": -2,
            "text": "This is what happens when science is your religion, you become a doomer and fearful. Go outside, get some sun on your skin, go into nature",
            "title_similarity": "0.32797807",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h5z1foj",
            "score": -25,
            "text": "Why are we still talking about tipping points.\nIt’s an arbitrary made up term that has 0 scientific basis. \n\nTalk about climate change yes, hypothesise at what temperature things get bad go for it. But talk of topping points is just setting up for failure.",
            "title_similarity": "0.55806005",
            "sentiment_compound": -0.705
        },
        {
            "id": "h603b5i",
            "score": 23,
            "text": "How can people continue to have children after reading stuff like this? Im guilty too, don't get me wrong; I have one child, a 19yr old son, and I tell him all the time to really consider remaining childfree.",
            "title_similarity": "0.3970669",
            "sentiment_compound": 0.308
        },
        {
            "id": "h5zo0o8",
            "score": -12,
            "text": "It's amazing how every major prediction of sea level change, Arctic ice melts and polar bears disappearing haven't come to fruition yet - though supposedly 2013 was to be the year.",
            "title_similarity": "0.6439577",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h5yqqpm",
            "score": 145,
            "text": "[removed]",
            "title_similarity": "0.095397405"
        },
        {
            "id": "h5z80ku",
            "score": -13,
            "text": "TAnd humans everywhere: 'aWw LeT's hAvE a bAbY! LEt'S hAvE a BuNcH oF bAbIeS!'\n\n****sigh**** \n\nI'm sorry. It's been a rough week of discovering that people I thought were smart actually believe that essential oils are better than vaccines. \nI just....I can't be positibe about humans right now. Maybe I need to go to r/aww for awhile. \n\nThank you for sharing this. And thanks for believing in science ♡",
            "title_similarity": "0.4960366",
            "sentiment_compound": 0.9214
        },
        {
            "id": "h5z4n63",
            "score": -11,
            "text": "Watch the Great Global Warming Swndle on YouTube. The Warmists and Alarmists have been making the same claims for thirty years. We're still in an ice age on a very cold planet.",
            "title_similarity": "0.63239837",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h5zdhsp",
            "score": 4,
            "text": "One degree is the difference between ice and water.",
            "title_similarity": "0.25719583",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5z3ri3",
            "score": -7,
            "text": "Planets getting hotter, air quality is ass in the US to the point where I can’t go outside without health risks. What’s not to hate about the outside?! Its totally not like my father is slowly dying and practically suffocating due to his sensitive breathing problems! HAHA NO NOT AT ALL ITS ALL FINE AND DANDY HERE FOLKS. \n\nFr tho this world sucks I don’t want to live on it anymore.",
            "title_similarity": "0.4425959",
            "sentiment_compound": -0.4985
        },
        {
            "id": "h5zdp2d",
            "score": 7,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h5zactv",
            "score": -13,
            "text": "diseases and global warming. Sounds like China needs a good carpet bombing",
            "title_similarity": "0.47232717",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h5zbix6",
            "score": 13,
            "text": "And don’t forget 1.5 is a global average. Over land (which is where everyone lives) it will be at least a full 1 - 2 degrees above that. Yeeha!",
            "title_similarity": "0.57848907",
            "sentiment_compound": -0.2942
        },
        {
            "id": "h5zrl1q",
            "score": -11,
            "text": "They said this back in the 80s. It’s now 40 years later and 4 apocalypses and we are still here.",
            "title_similarity": "0.5308113",
            "sentiment_compound": 0.0
        },
        {
            "id": "h601iph",
            "score": 9,
            "text": "Enjoy this world while it lasts folks, Capitalism's desire for de-regulation is throwing away our environment for a bit more money right now. They don't seem to understand that you can't have an economy without an environment.",
            "title_similarity": "0.38460308",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h5zmm75",
            "score": 0,
            "text": "Still a lot of speculation when it comes to climate change. We humans certainly have an effect on global warming but I hope it's not turning into another moral panic.",
            "title_similarity": "0.51677275",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h5znzgp",
            "score": 5,
            "text": "can’t solve climate change under capitalism.",
            "title_similarity": "0.4388158",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h5ztzbo",
            "score": 4,
            "text": "Just like our bodies heat up to try kill virus'. \n\nThe earths heatin up to kill us",
            "title_similarity": "0.42871812",
            "sentiment_compound": -0.836
        },
        {
            "id": "h5zw3si",
            "score": -3,
            "text": "Every year irs the beginning of the end.  Fear is how they control.",
            "title_similarity": "0.5950352",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h5zzl9z",
            "score": 0,
            "text": "I gave up driving years ago because of this very reason.",
            "title_similarity": "0.44186258",
            "sentiment_compound": 0.0
        },
        {
            "id": "h601dfe",
            "score": 0,
            "text": "Well, I'm done. Throwing in the towel. 5 years? Let it tip imo.",
            "title_similarity": "0.60619825",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h609gk8",
            "score": 0,
            "text": "China now produces more greenhouse gas than the US and India combined. They ensure us that it’ll be fine by 2032. I don’t doubt that they mean that... but 10 years seems like too long a time to waste.",
            "title_similarity": "0.5958518",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60cpe0",
            "score": 0,
            "text": "Might as well enjoy the world now. Take that trip you’ve been putting off, travel as much as you can, because things are gonna be very different by 2030.\n\n\nI wish I had hope, but I don’t. A global pandemic couldn’t open our eyes here in the United States, and there are still tens of millions of people claiming and BELIEVING that Trump won the election.\n\n\nIf all we had to do to save the climate was wear a mask when outdoors, we wouldn’t be able to do it because of MAH FREEDOM.\n\n\nWe have no one to blame but ourselves, and we’ll burn in the hot world we created. :(",
            "title_similarity": "0.50743276",
            "sentiment_compound": 0.9645
        },
        {
            "id": "h60if0j",
            "score": 0,
            "text": "Scientists - \"Climate change is a complicated issue and the solution will be even more complicated.\"\n\nReddit - \"Hold my beer\"",
            "title_similarity": "0.5272901",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h60luah",
            "score": 0,
            "text": "At the risk of being banned- the Earth's been on track to increase 1 - 4 degrees C in the next 5 years... for the last 20 years.",
            "title_similarity": "0.8381934",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h60ymp3",
            "score": 0,
            "text": "Fun facts:\n\nThe first reliable thermometer was invented about 400 years ago.  It's only been the past 100 years where, in random parts of the world, took the temperature every day to tell people about it.  Most of the time, no one wrote it down. They are called weathermen.\n\n\nSome plants, such as some species of pine trees, are serotinous/pyriscence.  These plants won't open to reveal their seeds unless there is extreme heat, such as in the conditions of a wildfire.",
            "title_similarity": "0.5707612",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h60zpp6",
            "score": 0,
            "text": "50 years of being 5/10/12 years until we reach the tipping point. I'm sure this time they really mean it.",
            "title_similarity": "0.6525089",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6118vo",
            "score": 0,
            "text": "Yes I believe in climate change, but the doom, gloom and hysterics here is astounding. For the people saying you're not going to have kids, chill out, everything will be fine.",
            "title_similarity": "0.47844562",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h612hfm",
            "score": 0,
            "text": "I'm living it up right now because time is running out. I very well might not make it to 60 so I'm going to just live my life as much as I can.",
            "title_similarity": "0.4187382",
            "sentiment_compound": 0.3384
        },
        {
            "id": "h613cih",
            "score": 0,
            "text": "Its like no one wants to google \"Earth Climate history\" past 100 years ago. \n\nhere - https://en.wikipedia.org/wiki/Geologic_temperature_record\n\nYou can clearly see that even in the last 100,000 years, the earth has been much much hotter and somehow our primitive ancestors were able to develop sustainable systems of living. Hell, look up the little ice age and you can see that the Earth's climate dropped significantly enough for the glaciers to grow.\n\nI understand that a stable climate is the ideal scenario, but I really am at a loss for how people think they can control the climate. For all we know, the current warming trend could be the only thing keeping us out of another Ice Age",
            "title_similarity": "0.61333054",
            "sentiment_compound": -0.1655
        },
        {
            "id": "h61f7cd",
            "score": 0,
            "text": "Let it burn. Humanity is doomed. Hopefully AI will continue on",
            "title_similarity": "0.30911618",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h61gloo",
            "score": 0,
            "text": "Time to get the sun lounger out. It is becoming common knowledge these days that harp is real and the weather can be controlled!",
            "title_similarity": "0.28687972",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61hgro",
            "score": 0,
            "text": "Who cares, warmth and CO2 = life and greenery, stop trying to scare people.",
            "title_similarity": "0.1703387",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h61jxy2",
            "score": 0,
            "text": "Global warming is caused by the hot air that comes out of the mouths of people thar believe in global warming.",
            "title_similarity": "0.38188517",
            "sentiment_compound": 0.296
        },
        {
            "id": "h61nkro",
            "score": 0,
            "text": "They’ve been wrong about all their predictions before so I’m sure they’ll get it tight this time.",
            "title_similarity": "0.32215294",
            "sentiment_compound": -0.1335
        },
        {
            "id": "h61ntvh",
            "score": 0,
            "text": "How exactly do you study what could maybe happen? There is no way we have an accurate enough model yo draw such conclusions.",
            "title_similarity": "0.24112399",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6227m5",
            "score": 0,
            "text": "And China continues to increase CO2 output as the rest of the developed world decreased or stays flat",
            "title_similarity": "0.44786167",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h62jdan",
            "score": 0,
            "text": "Funny because where I live (Fresno, CA) it got pretty hot at around 114F the other day but we didn’t bear the record of 115F which happened back in 1905. Over 100 years ago",
            "title_similarity": "0.5391742",
            "sentiment_compound": 0.4678
        },
        {
            "id": "h64kbkp",
            "score": 0,
            "text": "Nice. A few degrees more would be perfect.",
            "title_similarity": "0.2693129",
            "sentiment_compound": 0.7759
        },
        {
            "id": "h603fov",
            "score": 21,
            "text": "Choice 1: fix it\n\nChoice 2: remember that Pacific island with Moai?\n\nThey got civilized, then consumed all resources, then disappear. When the explorers found it, the few people left were living in caves, living on cannibalism, killing each other.\n\nThat’s us soon.",
            "title_similarity": "0.42425245",
            "sentiment_compound": -0.743
        },
        {
            "id": "h5z4l4t",
            "score": -44,
            "text": "Watch the Great Global Warming Swindle on YouTube. The Warmists and Alarmists have been making the same claims for thirty years. We're still in an ice age on a very cold planet.",
            "title_similarity": "0.6339551",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h5zd6cd",
            "score": 5,
            "text": "For all the climate deniers that purposefully misled the rest of the world, can they be sued?",
            "title_similarity": "0.44289833",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h5zw4s3",
            "score": -6,
            "text": "Ahh yes, the 5 years tipping point I've been hearing about for the past 30 years. See you in 5 years with a new 5 year tipping point of no return prediction",
            "title_similarity": "0.81035733",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5zyfiz",
            "score": 5,
            "text": "\"If I recycle enough cans I can change this!\"\n\n\\> Coca-Cola still polluting plastic. \n\n\\> Nestlé still draining Lakes and bottling it up.\n\n\\> Big Oil still lobbying against alternative fuels",
            "title_similarity": "0.43904153",
            "sentiment_compound": -0.1511
        },
        {
            "id": "h5yuvgu",
            "score": 219,
            "text": "[removed]",
            "title_similarity": "0.09539736"
        },
        {
            "id": "h5zhjj8",
            "score": 11,
            "text": "I'm just tired man. Why do we have to fight for something that should be god damn common sense.",
            "title_similarity": "0.22113054",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h5zydls",
            "score": 12,
            "text": "Bring on the extinction of the human race, it's well deserved. Just wish we weren't taking everybody else with us.",
            "title_similarity": "0.36012828",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h5z4030",
            "score": -5,
            "text": "Imagine Jeff the dragon would actually use the shitload of money he hoards to do something for the greater good!",
            "title_similarity": "0.34799838",
            "sentiment_compound": 0.69
        },
        {
            "id": "h5zq1m4",
            "score": 6,
            "text": "It's like.. yeah, that's bad, but what the hell can be done?\n\nNo matter how much you recycle or reduce your \"carbon footprint\" (made up by oil companies to shift the blame, btw) it won't make an iota of difference as long as we have countries like India, China, Russia, hell probably the US of A doing what they do. Every country in the world needs to get on board with this to have any effect. If that doesn't happen, which seems like the most likely scenario, none of this can be stopped.",
            "title_similarity": "0.45503008",
            "sentiment_compound": -0.9295
        },
        {
            "id": "h608dr7",
            "score": 6,
            "text": "Ain't it about time that the big corporations and certain countries should be held responsible for global warming then? During the lockdowns global warming still increased despite less vehicles being used, people commuting less and staying at home in general. \n\nIdk these are just my thoughts, but it is undeniable that the average person is not at fault for global warming.",
            "title_similarity": "0.4846666",
            "sentiment_compound": 0.7868
        },
        {
            "id": "h5yyuoo",
            "score": 1,
            "text": "Maybe we should blacktop some more of it",
            "title_similarity": "0.26834363",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5z60er",
            "score": -1,
            "text": "Have we considered doing the lockdown again to combat this? Or even clean the ocean and elimate going to the ocean ever?",
            "title_similarity": "0.43610257",
            "sentiment_compound": 0.168
        },
        {
            "id": "h5z711u",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h5z7999",
            "score": -1,
            "text": "If you weren't aware, we as a society have determined the way this all ends. No power to the truth and everything goes with it like as if we were never here in the first place.",
            "title_similarity": "0.3205726",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h5z94pa",
            "score": 1,
            "text": "This is fine.",
            "title_similarity": "-0.07329225",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h5z9hhb",
            "score": -1,
            "text": "Great.",
            "title_similarity": "-0.014492933",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5z9hv6",
            "score": -1,
            "text": "That will melt the ice on the antarctis more and let the super vulcanos under its surface free. \nSudden death.",
            "title_similarity": "0.44302428",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h5z9hz1",
            "score": -1,
            "text": "Great.",
            "title_similarity": "-0.014492933",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5z9i5j",
            "score": -1,
            "text": "That will melt the ice on the antarctis more and let the super vulcanos under its surface free. \nSudden death.",
            "title_similarity": "0.44302428",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h5z9ije",
            "score": -1,
            "text": "Great.",
            "title_similarity": "-0.014492933",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5z9jm7",
            "score": -1,
            "text": "That will melt the ice on the antarctis more and let the super vulcanos under its surface free. \nSudden death.",
            "title_similarity": "0.44302428",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h5ziqhd",
            "score": 1,
            "text": "At least the richest people will be safe in space.",
            "title_similarity": "0.30622518",
            "sentiment_compound": 0.743
        },
        {
            "id": "h5zlj1h",
            "score": 1,
            "text": "\"and here's why that's a good thing\"",
            "title_similarity": "0.02749298",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5zlt31",
            "score": 1,
            "text": "So are we all gonna burn up eventually or something or it's just gonna be a little hotter outside",
            "title_similarity": "0.34998658",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zmrzt",
            "score": 1,
            "text": "I know a lot of people on here will be too young to remember but 30 years ago if we didn't act right then Florida was going to disappear. Now the same people that said that 30 years ago say in 30 to 50 years Florida will be gone again. Sure you can say that in that time we have done things to slow it down but China has increased dramatically in that time so worldwide there's not a decrease. Do we need to pump harmful gases into the atmosphere and be as wasteful as possible? No. Should we listen to a bunch of people flying around on private jets making millions talking about climate change? Absolutely not. The worst part is the answer is right in front of us but the problem is there's no way for anybody to control it which means there's no way to make money which means nobody wants to talk about it. I'll give you a hint what's the one thing that protects the Earth from just about everything? And once you know what that is you'll realize that it's changing.",
            "title_similarity": "0.588061",
            "sentiment_compound": 0.5309
        },
        {
            "id": "h5ztjpa",
            "score": 1,
            "text": "Sounds like we’re done. \n\nSo the question becomes can we survive it?",
            "title_similarity": "0.24269219",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5zuglm",
            "score": 1,
            "text": "This is exactly why we need to support the billionares that are spending massive amounts of wealth on spaceflight.\n\nIn a thousand years, the only people left alive will the martian descendents of the super rich. Those who could afford tickets to elysium.  And the rest will  sweat and starve upon the dying earth, a  grim reminder of our intellectually complacent, Perpetual progress. Something the next humans will not forget. \n\nMaybe we do have a chance to make it. But in the short term (<1000 years), we can't look a gift horse in the mouth. Innovation in the private space sector is our best hope.",
            "title_similarity": "0.51896656",
            "sentiment_compound": 0.9608
        },
        {
            "id": "h5zuw1j",
            "score": 1,
            "text": "This train is not stopping. \n\nBuy some guns. Apologize to your children. Things will be rough in 20 years.",
            "title_similarity": "0.562965",
            "sentiment_compound": 0.2129
        },
        {
            "id": "h5zyenn",
            "score": 1,
            "text": "We should do climate lockdowns ! Right?!",
            "title_similarity": "0.49957702",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zz07m",
            "score": 1,
            "text": "So when will the world end? We keep being told that climate change will kill us all, but when will that happen? I'd much rather know when I'm going to die so I can enjoy the time I have.",
            "title_similarity": "0.55141723",
            "sentiment_compound": -0.5946
        },
        {
            "id": "h5zz21u",
            "score": 1,
            "text": "So realistically whats going to happen to humans, can we survive this with todays tech",
            "title_similarity": "0.37224144",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zzcyo",
            "score": -1,
            "text": "If this problem gets solved and people are convinced not to have kids now because of something that hasn’t happened yet, there are really going to be some depressed people out there.\n\nI know climate change is a danger, I know bringing kids into the world to face this global issue can be seen as selfish… I get all of that. But it’s a two way street and you only get one life. \n\nAlso, would the people in our past who faced wars or disasters only to fight through it or have their life cut short wished they never been born? Or would they have been grateful for whatever time they had in existence to have a fighting chance? Personally, if given a choice, I’d rather fight in extreme circumstance than not exist.",
            "title_similarity": "0.45040065",
            "sentiment_compound": -0.9646
        },
        {
            "id": "h600wsg",
            "score": 1,
            "text": "All past climate catastrophic predictions also based on past data fed into projection models of the past 25 years have proved wrong. Nothing can predict the future!!!!!- Extrapolations of past data projected  forward are just that, past data projected forward.",
            "title_similarity": "0.567407",
            "sentiment_compound": -0.816
        },
        {
            "id": "h600ycl",
            "score": 1,
            "text": "If you care about this at all, stop eating beef and dairy. Sadly most people getting all upset in here and wondering what to do will still refuse to give up their steak and their cheese",
            "title_similarity": "0.24869777",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h606caz",
            "score": 1,
            "text": "People have been panicking about this for decades already, not so many issues so far, and is weather people, it is supposed to change as you change the environment",
            "title_similarity": "0.5765126",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h60759v",
            "score": -1,
            "text": "Globalists are pushing this nonsense to scare first world people into not having babies so they can replace us with cheaper third world workers",
            "title_similarity": "0.3760416",
            "sentiment_compound": -0.745
        },
        {
            "id": "h607m83",
            "score": 1,
            "text": "I'm not doing a damn thing about it til these big boys stop building pleasure rockets",
            "title_similarity": "0.26573586",
            "sentiment_compound": 0.5801
        },
        {
            "id": "h608db3",
            "score": -1,
            "text": ">The chance of temporarily reaching 1.5°C has roughly doubled compared to last year’s predictions. This is mainly due to using an improved temperature dataset to estimate the baseline rather than sudden changes in climate indicators. It is very unlikely (10%) that the 5 year mean annual global temperature for the entire 2021-2025 period will be 1.5°C warmer than preindustrial levels, according to the climate update.\n\nThe actual study, just for context. \n\nI'm not a climate change denier, but twisting the truth is not the right way either.",
            "title_similarity": "0.64481837",
            "sentiment_compound": 0.6956
        },
        {
            "id": "h60db3n",
            "score": -1,
            "text": "The 2C \"tipping point\" is an arbitrary number that was pulled from thin air.  It means nothing and has no scientific basis.",
            "title_similarity": "0.20046292",
            "sentiment_compound": 0.2933
        },
        {
            "id": "h60h1kt",
            "score": 1,
            "text": "Suicidal people, our time has come",
            "title_similarity": "0.34456283",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h60m36e",
            "score": -1,
            "text": "OOOOH NO!  \nIn a billion years the earth will be toast anyway",
            "title_similarity": "0.5080129",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60o8zs",
            "score": -1,
            "text": "The “tipping point” is junk science sold as fear porn from the media\n\nJust look at the earth on a macro scale and how things changed in the past\n\nhttps://www.climate.gov/news-features/climate-qa/whats-hottest-earths-ever-been",
            "title_similarity": "0.56383824",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h60op72",
            "score": -1,
            "text": "you people worship science as if it is theological truth and that’s the scary thing. I’m not denying our earths capacity for change, but sheeeesh, some of you guys are worse than the religious people",
            "title_similarity": "0.3103057",
            "sentiment_compound": -0.5396
        },
        {
            "id": "h60ougy",
            "score": -1,
            "text": "People do realize that the earth has been around for 4.5 billion + years right? The earth does what it wants. Less than 50 years of accurate data, and we’re basing the entire global policy on conjecture? Bravo to Al Gore for convincing people of this theory.",
            "title_similarity": "0.74999595",
            "sentiment_compound": 0.4696
        },
        {
            "id": "h60pe84",
            "score": -1,
            "text": "You said 5 years 8 years ago Turkish",
            "title_similarity": "0.5635315",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60t7lt",
            "score": -1,
            "text": "I remember this article from 1978, 1979, 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, and 2020",
            "title_similarity": "0.4050491",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60tguq",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h60uthy",
            "score": -1,
            "text": "Considering China and India will do and have done nothing to combat climate change, it is irreversible at this point. China’s emissions have increased 200% since Y2K, India’s 150%.\nWhy worry, just accept it",
            "title_similarity": "0.5215743",
            "sentiment_compound": 0.2584
        },
        {
            "id": "h60uyyr",
            "score": -1,
            "text": "And why should we care anymore.?. Let it all burn baby.",
            "title_similarity": "0.28053772",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h60v8t9",
            "score": -1,
            "text": "\"Rising seas levels when?' - Barack Obama from his seaside mansion in Martha's vineyard",
            "title_similarity": "0.54494095",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60x1ye",
            "score": -1,
            "text": "Were going to kill the kids because we can't impress the woman with out doing so.\nWe going to kill them because men are nothing with out stuff.\nScience has empowered fools\nOur big brains go save the old so we can visit the grandkids on a big emiter for a cluck cluck hit.\nEvan after getting all sorts of impressive things like vaccines tvs etc we act like animals.im old I'm disscusted science doesn't apologies for the entropy it's caused.",
            "title_similarity": "0.38914326",
            "sentiment_compound": -0.6711
        },
        {
            "id": "h60z9ik",
            "score": -1,
            "text": "Yes something should be done. More for clean air than for carbon but we can disagree on why. \n\nThe problem is doing something without killing billions of people. \n\nThe IPCC numbers when added up show a net disruption from climate change of 2.5% GDP by 2080. \n\nSo our response is to ameliorate that disruption through reductions in energy waste. \n\nIf instead you were to mandate maximum energy allowances, or mandate expensive renewables that arent ready for widespread adoption, or lie about how ready a renewable is, or use regulations to make the alternatives more expensive than the renewable......You'll kill people. \n\n&#x200B;\n\nNot just little groups of people you imagine deserve it, but millions of people in far off countries who will then decide it is far easier to kill you than to live by your rules. \n\nSo by all means call it an emergency, just understand that your solution is not going to work for the next guy down the street and if you try to force him, eventually you'll wind up literally at war.",
            "title_similarity": "0.64189035",
            "sentiment_compound": -0.9714
        },
        {
            "id": "h610by8",
            "score": -1,
            "text": "Wait so you people are saying a change in 1.5ºC will destroy the worlds ecosystem? You believe the world is that fragile that it cannot adapt to such a small increase in temperature? This is absolute nonsense.",
            "title_similarity": "0.6191236",
            "sentiment_compound": -0.644
        },
        {
            "id": "h61b9im",
            "score": -1,
            "text": "Well to be honest we have just made everything go faster but it’s also natural so in the end we cannot stop global warming. In another words we’re doomed no matter what we do. The Earth has been through several ice ages, mass extinctions and being hit by asteroids etc. So this will be nothing and I certainly believe that we as human race will somehow handle it too. Or otherwise we all die which we we will do anyway. \n\nSo in the end nothing matter.",
            "title_similarity": "0.49013618",
            "sentiment_compound": -0.8523
        },
        {
            "id": "h61hwcl",
            "score": 1,
            "text": "I don’t see humankind changing this future unless we invent a short-term incentive. We are way too selfish, too short-term minded and too oblivious to even start solving this problem unless people get money or something in return which favors them.",
            "title_similarity": "0.192568",
            "sentiment_compound": -0.0836
        },
        {
            "id": "h61sgdw",
            "score": 1,
            "text": "We need to stop how factories are polluting in China",
            "title_similarity": "0.3072348",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5z3thz",
            "score": -6,
            "text": "Imagine Jeff the dragon would actually use the shitload of money he hoards to do something for the greater good!",
            "title_similarity": "0.34799838",
            "sentiment_compound": 0.69
        },
        {
            "id": "h5z3yjm",
            "score": -8,
            "text": "Imagine Jeff the dragon would actually use the shitload of money he hoards to do something for the greater good!",
            "title_similarity": "0.34799838",
            "sentiment_compound": 0.69
        },
        {
            "id": "h5zzgbn",
            "score": 7,
            "text": "Ah yes, the continued idea that we're still heading towards the cliff when it's far more likely we're *past* the tipping point already.",
            "title_similarity": "0.40953174",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h5zxh98",
            "score": 202,
            "text": "Meanwhile Billionaires are spending billions in recreational space trips. Saving our planet should be our priority.",
            "title_similarity": "0.5009241",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5znuwn",
            "score": -7,
            "text": "Yall do know the sun is expanding at a rate of like 8m per year\n\nIts naturally going to get hotter EVERY SINGLE YEAR no ifs, ands or buts.\n\nThere's almost nothing sensible we can do to stop this it is the natural order of things.\n\nMicroplastics are the real problem",
            "title_similarity": "0.6333568",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h5z592a",
            "score": -2,
            "text": "Tipping point! Here we come!",
            "title_similarity": "0.21091984",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5z59r9",
            "score": -2,
            "text": "Tipping point! Here we come!",
            "title_similarity": "0.21091984",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5z5x0w",
            "score": -2,
            "text": "In response to this I believe we should increase pollution, deny that its happening at all and double down on mindless consumption of shit you dont need or use! lets go people!",
            "title_similarity": "0.2647478",
            "sentiment_compound": -0.8011
        },
        {
            "id": "h5z5z4z",
            "score": -2,
            "text": "Have we considered doing the lockdown again to combat this? Or even clean the ocean and elimate going to the ocean ever?",
            "title_similarity": "0.43610257",
            "sentiment_compound": 0.168
        },
        {
            "id": "h5z5zog",
            "score": -2,
            "text": "Have we considered doing the lockdown again to combat this? Or even clean the ocean and elimate going to the ocean ever?",
            "title_similarity": "0.43610257",
            "sentiment_compound": 0.168
        },
        {
            "id": "h5z7ouh",
            "score": -2,
            "text": "Panic mode",
            "title_similarity": "0.18648282",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h5z90xj",
            "score": -2,
            "text": "And Bezos get to go boom boom rocket fuel yay",
            "title_similarity": "0.38787925",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h5z9l1j",
            "score": -2,
            "text": "But we are living like nothing is going to happen...",
            "title_similarity": "0.09627638",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h5z9lzl",
            "score": -2,
            "text": "But we are living like nothing is going to happen...",
            "title_similarity": "0.09627638",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h5z9wpw",
            "score": -2,
            "text": ".",
            "title_similarity": "-0.024281565",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5ziykc",
            "score": 2,
            "text": "This makes me wonder why the hell people continue to have kids.",
            "title_similarity": "0.25909925",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h5zt3i3",
            "score": 2,
            "text": "Love how people are just living like the Earth is gonna be human habitable in 2026",
            "title_similarity": "0.31842473",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h5zt43w",
            "score": -2,
            "text": "So a 1.5 deg C change in the average temp is equivalent to the ave difference in temperature between Chicago and Indianapolis.  You don’t see mass migration of people from Indianapolis to Chicago to escape the change.  There is no tipping point either, it is a mythical beast like a unicorn.  Where is the fire people? Certainly not 1.5 deg.",
            "title_similarity": "0.5315435",
            "sentiment_compound": 0.25
        },
        {
            "id": "h5zw0wr",
            "score": 2,
            "text": "We’re done for people.",
            "title_similarity": "0.059041496",
            "sentiment_compound": 0.0
        },
        {
            "id": "h605pgs",
            "score": 2,
            "text": "Capitalism destroys the economy through reckless wealth seeking for the few, ensuring wars over water and arable land for our children. Next on the news....",
            "title_similarity": "0.43158698",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h60fner",
            "score": -2,
            "text": "Oh, it's in 5 yrs now?\n\nEvery few years we only have X to change, yet we dont change and a few years later it's the only x years left again...",
            "title_similarity": "0.6985903",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60l1ul",
            "score": -2,
            "text": "I have been reading these types of articles for the last 40 years.",
            "title_similarity": "0.40787712",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60mffy",
            "score": -2,
            "text": "repost from 2008, 2012 ,2014 ,2017,and 2019",
            "title_similarity": "0.44188657",
            "sentiment_compound": 0.0
        },
        {
            "id": "h615yt0",
            "score": -2,
            "text": "Yawn. Another one? Haven't we past the \"tipping point\" a hundred times or so?\n\nMaybe they should fake another hocky-stick graph.",
            "title_similarity": "0.55920935",
            "sentiment_compound": -0.5362
        },
        {
            "id": "h61c9we",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h5zv78q",
            "score": 29,
            "text": "Good, its time to wrap this party up.",
            "title_similarity": "0.22247708",
            "sentiment_compound": 0.7206
        },
        {
            "id": "h6082b9",
            "score": 18,
            "text": "The people who denied global warming and voted against reform should be held responsible.  Their wealth and positions in government should be stripped from them and used to combat future climate change.\n\nThis is what happens when you have uneducated morons (or conmen watching their bottom line profits) who think they know better than experts. Off with their heads imo.\n\nOur kids have to deal with a ruined climate and possibly mass food shortages, lands lost to sea level, and all the other catastrophes.",
            "title_similarity": "0.48555237",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h5yynds",
            "score": 205,
            "text": "[removed]",
            "title_similarity": "0.09539736"
        },
        {
            "id": "h5z3njx",
            "score": -9,
            "text": "Russia ice gonna melt and they gonna be the worlds super power",
            "title_similarity": "0.53105974",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h5z3nv9",
            "score": -10,
            "text": "Russia ice gonna melt and they gonna be the worlds super power",
            "title_similarity": "0.53105974",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h5z3o6b",
            "score": -10,
            "text": "Russia ice gonna melt and they gonna be the worlds super power",
            "title_similarity": "0.53105974",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h5zv45v",
            "score": 22,
            "text": "Better install those AC units then.",
            "title_similarity": "0.2086969",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5z3pd0",
            "score": 108,
            "text": "[removed]",
            "title_similarity": "0.095397405"
        },
        {
            "id": "h5zygpt",
            "score": 11,
            "text": "I don’t think we’ll ever fix climate change. Our society is not built to handle this, and we are stuck since societies don’t change; they die. If you’re not super rich, no one is going to help you when it comes to societal collapse. I’m just going to keep my revolver nearby, because I’d rather blow my brains out than die to starvation because the grocery stores don’t have food and you live in a concrete jungle.",
            "title_similarity": "0.3727945",
            "sentiment_compound": -0.938
        },
        {
            "id": "h5zoaoq",
            "score": 34,
            "text": "The science is clear, every expert out there have announced that we passed a point of no return, everyone have been taught about greenhouse effect since early age.\n\nWe’ve seen the effects, bleaching of coral reefs, increased ocean acidity, species migration, melting glacier, melting permafrost, erratic weather pattern, extreme weather, etc. But as we seen with this COVID pandemic, even when the threat is real, people are just so stubborn, refuse to act and cooperate if the threat hasn’t hit them yet.\n\nAt this point humanity will only collaborate when aliens attack our cities one by one",
            "title_similarity": "0.53239655",
            "sentiment_compound": -0.9704
        },
        {
            "id": "h5z3s7m",
            "score": -3,
            "text": "The ice covering most of Russia and the Arctic gonna melt and Russia gonna be the worlds super power.",
            "title_similarity": "0.5349092",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h5z4kqo",
            "score": -3,
            "text": "My dad says it isn’t real.\n\nNothing to see here folks",
            "title_similarity": "0.16585863",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5z4lj0",
            "score": -4,
            "text": "My dad says it isn’t real.\n\nNothing to see here folks no",
            "title_similarity": "0.16487962",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5z61c4",
            "score": -3,
            "text": "Have we considered doing the lockdown again to combat this? Or even clean the ocean and elimate going to the ocean ever?",
            "title_similarity": "0.43610257",
            "sentiment_compound": 0.168
        },
        {
            "id": "h5z867o",
            "score": -3,
            "text": "The world is doomed, the rich are leaving on a spaceship and leaving us plebs behind.",
            "title_similarity": "0.37407428",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h5z8zys",
            "score": -3,
            "text": "And Bezos get to go boom boom rocket fuel yay",
            "title_similarity": "0.38787925",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h5zc7l6",
            "score": -3,
            "text": "Well even in the bible they said at the end of time earth will be a ball of fire. I guess we are on our way to the final chapter.",
            "title_similarity": "0.5101161",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h5zd787",
            "score": -3,
            "text": "What was the average temperature and CO2 levels during the dinosaur era? IIRC it was much higher than now.",
            "title_similarity": "0.55733883",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zivxk",
            "score": 2,
            "text": "Its already done. I dont know what would change in the next 5 years. Forget it.",
            "title_similarity": "0.6372749",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h5zjaoy",
            "score": 2,
            "text": "Markets are fucked, billionaires are fleeing to space, and the planet is turning into an oven. \n\nBest generation ever.",
            "title_similarity": "0.5093078",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h5zlb0d",
            "score": 2,
            "text": "Honestly, we deserve it.",
            "title_similarity": "0.0038836151",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h5zq2yv",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h5zrp35",
            "score": 2,
            "text": "i vote for the right folks, not much i can do especially when solving the issue requires corporations to change their behavior.",
            "title_similarity": "0.30141097",
            "sentiment_compound": 0.3976
        },
        {
            "id": "h5zs1z6",
            "score": 4,
            "text": "It's great that people invented a game that they refuse to change and will destroy the planet. Corporations and late stage capitalism will kill it all off if we don't do something different.",
            "title_similarity": "0.39647537",
            "sentiment_compound": -0.743
        },
        {
            "id": "h5zsjmv",
            "score": 3,
            "text": "It literally seems hopeless at this point",
            "title_similarity": "0.12596482",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h5zt0zd",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h5ztgms",
            "score": -2,
            "text": "Stop eating meat for fucks sake",
            "title_similarity": "0.18258962",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h60525q",
            "score": 3,
            "text": "And billionaires flying to space. Wonder why?",
            "title_similarity": "0.3401011",
            "sentiment_compound": 0.0
        },
        {
            "id": "h606yp0",
            "score": 3,
            "text": "we need a coordinated and global direct action movement for destroying the energy systems that are destroying the human ecosystem.",
            "title_similarity": "0.35445267",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h607n97",
            "score": 2,
            "text": "Run amok Capitalism is the problem. This economic system is not equipped to tackle climate change at all.",
            "title_similarity": "0.28315246",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h5zh8v2",
            "score": 54,
            "text": "[removed]",
            "title_similarity": "0.095397405"
        },
        {
            "id": "h5z7o7j",
            "score": 11,
            "text": "I watched a video of, I think it was RealLifeLore, saying that if it were 5 degrees warmer, a majority of the land surface would be covered in desert, with the arctic circle being the only refuge. A comment says that by 2065, it would be 5.5 degrees warmer on average. Does this mean what I think it means?",
            "title_similarity": "0.651302",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h5zltvx",
            "score": 115,
            "text": "[removed]",
            "title_similarity": "0.095397405"
        },
        {
            "id": "h5ziqn5",
            "score": 29,
            "text": "Oh well, might as well stop thinking about stopping climate change and start thinking about how we survive in such a world, if that’s possible.",
            "title_similarity": "0.40209562",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h5z578j",
            "score": 108,
            "text": "What’s crazy is that we predicted this, and we were too conservative",
            "title_similarity": "0.3034255",
            "sentiment_compound": -0.34
        },
        {
            "id": "h5z6wdo",
            "score": -5,
            "text": "Let it tip, let it tip, let it tip!\n\nWho cares anymore? Societies are all fucked and to afraid to stand up to the elite controlling them and making this happen. Fuck it, if no one cares, we all burn. \n\nLET IT TIP",
            "title_similarity": "0.32593358",
            "sentiment_compound": -0.8712
        },
        {
            "id": "h5zk445",
            "score": -5,
            "text": "All frozen countries benefit from global warming. Especially Russia",
            "title_similarity": "0.44017565",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h5zr6zv",
            "score": -4,
            "text": "Too many people worrying. We will eventually create the technology needed to survive. We always do.",
            "title_similarity": "0.2658298",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h5zvsxw",
            "score": -3,
            "text": "This is what that producer on CNN said would be the next big thing. Right on time.",
            "title_similarity": "0.47248533",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zw4zi",
            "score": -4,
            "text": "and yet more people die from cold every year than from heat.  If the planet is warming and we are past the tipping point, you’d think more people would be dying from heat than exposure to cold.  Please post some facts people.",
            "title_similarity": "0.5995473",
            "sentiment_compound": -0.3134
        },
        {
            "id": "h60mmuo",
            "score": 4,
            "text": "DOWN WITH CAPITALISM! Its the ENTIRE reason we are in this situation",
            "title_similarity": "0.32576182",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zeair",
            "score": 56,
            "text": "Seriously, I am doing everything realistic which I can. What else is missing?",
            "title_similarity": "0.08472429",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h5z2w62",
            "score": 89,
            "text": "I feel like I need a career change to something to help against climate change",
            "title_similarity": "0.45424756",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h5ypm1o",
            "score": -111,
            "text": "Just like the ice age we were supposed to have in the 70’s & 80’s",
            "title_similarity": "0.45829052",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5z3qni",
            "score": -5,
            "text": "The ice covering most of Russia and the Arctic gonna melt and Russia gonna be the worlds super power.",
            "title_similarity": "0.5349092",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h5z3wje",
            "score": -4,
            "text": "The ice covering most of Russia and the surrounding Arctic Ocean is gonna melt and Russia gonna be the worlds super power",
            "title_similarity": "0.55704033",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h5z3zod",
            "score": -3,
            "text": "The ice covering most of Russia and the surrounding Arctic Ocean is gonna melt and Russia gonna be the worlds super power.",
            "title_similarity": "0.5578809",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h5z6wza",
            "score": -5,
            "text": "Let it tip, let it tip, let it tip!\n\nWho cares anymore? Societies are all fucked and to afraid to stand up to the elite controlling them and making this happen. Fuck it, if no one cares, we all burn. \n\nLET IT TIP",
            "title_similarity": "0.32593358",
            "sentiment_compound": -0.8712
        },
        {
            "id": "h5zagyn",
            "score": -6,
            "text": "Wow global pandemics and global warming. Sounds like China needs a good carpet bombing /s",
            "title_similarity": "0.48726016",
            "sentiment_compound": 0.8689
        },
        {
            "id": "h5zh1co",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.09539736"
        },
        {
            "id": "h5zn0lg",
            "score": 6,
            "text": "We’ll die around topics like Taco Bell and gender before this is solved.",
            "title_similarity": "0.422193",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h5zqm7x",
            "score": 4,
            "text": "VROOOOOOM!!!! \n\nOff I go!!\n\nZOOOOOOOM!!!\n\nOn my rocket!!!\n\nWHOOOOOOOOSH!!!!!\n\nI’m a spaceman!!!!!",
            "title_similarity": "0.33304733",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zrpy2",
            "score": 5,
            "text": "We’re gonna end up like Venus aren’t we.",
            "title_similarity": "0.32448092",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h607j55",
            "score": 6,
            "text": "it’s because it’s accelerating. More and more every year. mass poverty, mass migrations the rich of this world preying on the weak and vulnerable. Earth will survive and regenerate but humans may not. Nature has survived horrible events in history the question is can humans survive a cataclysmic event",
            "title_similarity": "0.6010723",
            "sentiment_compound": -0.8898
        },
        {
            "id": "h608418",
            "score": 4,
            "text": "I don't believe there is hope for any of us, and its time to stop pretending there is any chance to do anything about it. You can talk about what should be done all day and night, but face reality, Nothing is going to change. make the best out of what you can before it's over. It's as optimistic as i can be,",
            "title_similarity": "0.29229844",
            "sentiment_compound": 0.8957
        },
        {
            "id": "h60c5fu",
            "score": 6,
            "text": "First it was 2050, but we continued like we don't know nothing.\n\nThen became 2030, but still we did little to change thing.\n\nNow here we almost are. 2025. \n\nI'm betting in 2 years we will discover we are already fucked up. At that point I don't think we will ever find a way to fix things up and in 10-15 years also the top 1% will see how they reduced the world and have gazillion of dollars wouldn't save your ass.\n\nSad to live in this period, I see no future for me and guys younger than me.",
            "title_similarity": "0.5762279",
            "sentiment_compound": -0.8507
        },
        {
            "id": "h5zv7e2",
            "score": 47,
            "text": "Don’t think of it as the hottest summer on record, think of it as the coolest summer for the rest of your life.",
            "title_similarity": "0.41263777",
            "sentiment_compound": 0.0
        },
        {
            "id": "h605q6d",
            "score": 19,
            "text": "If people were so mad for having to quarantine.  Wait until they will have to do it all over again due to air pollution and more. People fighting over toilet paper. They will be fighting for food next. While farmer workers will be the ones keeping the rest alive. Just because major corporations are addicted to Mass production.  Yes it is an Addiction. And It is madness.",
            "title_similarity": "0.39825642",
            "sentiment_compound": -0.7902
        },
        {
            "id": "h5yr1lg",
            "score": 807,
            "text": "This just highlights the need for an co2 scrubber. There is no way companies and the world can decrease to the levels necessary so we need to be proactive and get to scrubbing. Paid for by fossil fuel companies",
            "title_similarity": "0.42847598",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h5zedsx",
            "score": 36,
            "text": "In my opinion, governments across the globe should focus on making green jobs available to people. Instead of saying we don't have enough or making wasteful investements, how about paying people to do something meaningful like afforestation and maintenance projects, teaching them about ecology, and fast fashion should be banned, just banned! The more that I read on AI, the more I understand about the ecological consequences of large data processes. For example, the language models in NMT space do generate a lot of CO2. This tech obsession with AI also needs to stop. A lot of changes are needed, today, else we are so doomed!",
            "title_similarity": "0.41003773",
            "sentiment_compound": -0.9144
        },
        {
            "id": "h5z7c1s",
            "score": -5,
            "text": "But all the major surface temperature indices have been in decline since February 2020.  That includes: **HadCRUT5, GISSlo, NOAAlo, BESTlo, C&Wkrig, TempLSmesh, UAH6.LT, RSS TLT V4**.\n\nIf only that information was easily accessible to the public so they could look themselves.\n\nOh look!\n\nhttps://imgur.com/sFTarrH\n\n\nSourced from: https://moyhu.blogspot.com/p/latest-ice-and-temperature-data.html",
            "title_similarity": "0.661239",
            "sentiment_compound": 0.5255
        },
        {
            "id": "h5z7de6",
            "score": -6,
            "text": "But all the major surface temperature indices have been in decline since February 2020.  That includes: **HadCRUT5, GISSlo, NOAAlo, BESTlo, C&Wkrig, TempLSmesh, UAH6.LT, RSS TLT V4**.\n\nIf only that information was easily accessible to the public so they could look themselves.\n\nOh look!\n\nhttps://imgur.com/sFTarrH\n\n\nSourced from: https://moyhu.blogspot.com/p/latest-ice-and-temperature-data.html",
            "title_similarity": "0.661239",
            "sentiment_compound": 0.5255
        },
        {
            "id": "h60w1yb",
            "score": -6,
            "text": "Earth does not work like that. Expect >0.3C cooling.\n\nThe headline grabbing and conspiratorial nature of catastrophic anthropogenic global warming is deceitful and anti-science at it's very roots.\n\nCherry picking climate data is the lowest form of narrative building.\n\nPlate tectonic movement and subsequent ocean circulation yield oceanic temperature change. Solar cycles yield temperature change and climate change. Both of which are infinitely and quantifiably more impactful than anthropogenic carbon emissions. The tin-foil hat conspiracy of apocalyptic anthropogenic warming by 2000...I mean 2010... I mean 2012... I mean. 2020... I mean 2030... I mean 2050... I mean 2100 AD, this time I'm serious guys! etc.? Needs. to. end.",
            "title_similarity": "0.6011197",
            "sentiment_compound": -0.9517
        },
        {
            "id": "h5z70w7",
            "score": 219,
            "text": "Remember the fucks who tell us this isn't happening.",
            "title_similarity": "0.12120088",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h5zn4lx",
            "score": 23,
            "text": "Does anyone else walk around with an overwhelming feeling like we've already hit a point that we're not coming back from and we're a bunch of dead men walking now?",
            "title_similarity": "0.28227758",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h5z6zvf",
            "score": -7,
            "text": "What? We have warmed 1.02°C since the dawn of industrial revolution, how can we warm 1.5°C over next five years?",
            "title_similarity": "0.76142573",
            "sentiment_compound": 0.5204
        },
        {
            "id": "h5zadn7",
            "score": -6,
            "text": "diseases and global warming. Sounds like China needs a good carpet bombing /s",
            "title_similarity": "0.48101434",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h5zhvtq",
            "score": -8,
            "text": "Remember when they said Florida would be underwater by 2012 and then it didn't happen?",
            "title_similarity": "0.47368288",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zi902",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h5zn8bf",
            "score": -7,
            "text": "Human activity does not cause climate change. Human activity can not stop climate change.",
            "title_similarity": "0.13055703",
            "sentiment_compound": 0.2235
        },
        {
            "id": "h5zw2is",
            "score": 7,
            "text": "Yet, governments around the World keep talking about 2030+ for their environmental targets/ambitions/efforts.\n\nHilarious.\n\nEnjoy life while it lasts boys and girls!",
            "title_similarity": "0.4926116",
            "sentiment_compound": 0.7345
        },
        {
            "id": "h5z444j",
            "score": 354,
            "text": "[removed]",
            "title_similarity": "0.09539736"
        },
        {
            "id": "h60mysf",
            "score": -8,
            "text": "This is all fear mongering to raise taxes. They’ll never solve the problem. Just recreate it or rename it and raise our taxes so they can “fix” it. It’s an endless cycle to keep us willing and obedient. The earth goes through natural heating and cooling periods and humans hardly have an effect on any of it.",
            "title_similarity": "0.34235668",
            "sentiment_compound": -0.2105
        },
        {
            "id": "h5zz6jd",
            "score": 88,
            "text": "The Earth has literally been giving the human race every single warning sign it possibly can that we are destroying this planet and everyone with real power and influence who can make a real difference and stop us from reaching the point of no return has never cared.\n\nThis planet over the next 50 years is going to shake humanity off of it like fleas.",
            "title_similarity": "0.50825167",
            "sentiment_compound": -0.7738
        },
        {
            "id": "h5zhr6s",
            "score": 246,
            "text": "How long til things really hit the fan, do we reckon? I think 2030 is going to look very different to 2021.",
            "title_similarity": "0.5721458",
            "sentiment_compound": 0.3744
        },
        {
            "id": "h603fd6",
            "score": 10,
            "text": "It’s weird to me that we all know that disaster is coming but there’s nothing individually we can do, so we’re all kind of just accepting the end of our society as we know it",
            "title_similarity": "0.28792655",
            "sentiment_compound": 0.128
        },
        {
            "id": "h608bav",
            "score": 9,
            "text": "Let the rich bastards focus all their money and engineering on space tourism. Good idea.",
            "title_similarity": "0.35369825",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5zd2ae",
            "score": 295,
            "text": "[removed]",
            "title_similarity": "0.09539736"
        },
        {
            "id": "h5yspsu",
            "score": 635,
            "text": "> \"This study is yet another wake-up call that the world needs to fast-track commitments to slash greenhouse gas emissions and achieve carbon neutrality,\" said Prof. Taalas.\n\nYes, please don't wait. [Lobby lawmakers](https://citizensclimatelobby.org/join-citizens-climate-lobby/?tfa_3590416195188=online-002&utm_source=online&utm_medium=referral&utm_campaign=002) to do the right thing and put a price on carbon. Pricing carbon is [widely regarded](https://www.nature.com/articles/s41558-019-0474-0.epdf?author_access_token=tst1A-oZnQ8zUO18wGGPQdRgN0jAjWel9jnR3ZoTv0Nfy3PIgvrwnNXQzIbXH8z1Wkqhm6g5NiMnxMk__ebsKxGQNB0hMf1Vpo-ZiNplSt5LeLyks-Q3sdrpBdfxxHvAfQylqqwqHxgEml7GEGOxaQ%3D%3D) to be the single most impactful climate mitigation policy, and for [good reason](https://en-roads.climateinteractive.org/scenario.html?v=2.7.11).\n\n[It's already passed in Canada](https://www.theguardian.com/environment/climate-consensus-97-per-cent/2018/oct/26/canada-passed-a-carbon-tax-that-will-give-most-canadians-more-money), and [the U.S. is getting closer](https://citizensclimatelobby.org/senate/). \n\n/r/CitizensClimateLobby\n\nEDIT: typo",
            "title_similarity": "0.5133101",
            "sentiment_compound": 0.7761
        },
        {
            "id": "h604vxs",
            "score": 188,
            "text": "Why is anybody worrying? Pretty soon any city that can't stand up against the rising tide of disaster will be rooted out by its destruction, and then the cities that are left are the ones we can live in more confidently. After the inevitable regional nuclear conflict that introduces enough dust into our atmosphere to cool the Earth a bit and hobble agricultural production, the mass starvation and altered food situation will essentially cure the world of obesity, type 2 diabetes, high cholesterol and hypertension, and everybody will be lean and hungry! On top of that, we won't have to worry about the stress of commuting anymore, as our vehicles won't move and the jobs won't exist anyway as all of our social institutions are shattered in the chaos.   \n\n\nOh, what a great future this is gonna be!!!",
            "title_similarity": "0.49294668",
            "sentiment_compound": -0.7946
        },
        {
            "id": "h5z4m64",
            "score": -12,
            "text": "Watch the Great Global Warming Swindle on YouTube. The Warmists and Alarmists have been making the same claims for thirty years. We're still in an ice age on a very cold planet.",
            "title_similarity": "0.6339551",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h60go6t",
            "score": 13,
            "text": "Wow! Seems like the earth could use a new AMD ryzen 5 series that comes with a cpu cooler! Only for 355 dollar! Get yours at your nearest micro center or Best Buy!",
            "title_similarity": "0.61437595",
            "sentiment_compound": 0.913
        },
        {
            "id": "h5ys0od",
            "score": 3305,
            "text": "This is just laughable. By 2065 it will 5.5 degrees Celsius higher on average. \n\nWe are and have been living genocidally. Its not just a warming climate its vast habitat destruction. Monoculture farming. Poisoning our entire world. Wiping the sea empty. \n\nThe very systems that keep us alive are being actively destroyed by how we live.",
            "title_similarity": "0.6589227",
            "sentiment_compound": -0.8336
        },
        {
            "id": "h60433t",
            "score": 12,
            "text": "We need more renewables for a start. Anything that can’t be repaired easily needs to be stopped, planned obsolescence banned, one use plastics banned and even a move from plastics and fossil fuels altogether. Recycling needs to get better and we need to do a lot more of it. Planting as many trees as we can should be our top priority as well as halting habitat loss and species decline. Can I see any of this happening successfully in the next few years/decades? No, there are just too many of us and no one wants to do without, everyone wants their ‘best life’. It’s something that would need to apply to all regardless of wealth, status or nationality. Corporations and governments have a large part to play but when capitalism is on the table no one is going to knock that off unless there is some major disaster or change to society in general. By that time it will be too late.",
            "title_similarity": "0.4221034",
            "sentiment_compound": -0.7958
        },
        {
            "id": "h5zk4qk",
            "score": 351,
            "text": "[removed]",
            "title_similarity": "0.09539736"
        },
        {
            "id": "h5zhtja",
            "score": 15,
            "text": "How does eveyone else cope knowing climate armageddon is on our horizon?\n\nI have hope we can enviromentally engineer a workable solution, however due to the geopolitical crap and government interference by the rich that goes on. I don't see how it can be achieved. What is the solution?\n\ne:spelling",
            "title_similarity": "0.49006498",
            "sentiment_compound": 0.8343
        },
        {
            "id": "h5z3ul5",
            "score": 341,
            "text": "[removed]",
            "title_similarity": "0.095397405"
        },
        {
            "id": "h5zs29z",
            "score": 15,
            "text": "We’re fucked. Why I’m not having kids.",
            "title_similarity": "0.22642827",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h5z21b8",
            "score": 2229,
            "text": "[removed]",
            "title_similarity": "0.095397405"
        },
        {
            "id": "h5zqv7z",
            "score": 733,
            "text": "The day when the vast majority of people really wake up will be in our lifetimes when one of these summers, a heatwave sweeps through and kills literally millions to tens of millions of people in the span of a few days.\n\nIt might not be anytime soon, but I don't imagine it will be that long in the future. \n\nI don't know if even that will help at this point.",
            "title_similarity": "0.6332631",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h5zvos6",
            "score": 391,
            "text": "We've tried nothing and we're all out of ideas!",
            "title_similarity": "0.11587994",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zwduv",
            "score": 257,
            "text": "At this point it would take drastic action, the likes of which we haven't seen since WWII, to actually fix this. And where we are currently right now, it doesn't look like we can accomplish that in 5 years. Maybe once things really get bad consistently but whatever happens will be like alot of disasters in humanity's history: totally avoidable and a byproduct of laziness and lack of foresight.",
            "title_similarity": "0.6421758",
            "sentiment_compound": -0.6951
        },
        {
            "id": "h5zpjdz",
            "score": 1285,
            "text": "What's really cemented it for me that we're fucked is Covid.   Not the virus itself but the sheer number of people that can deny something is happening right in front of their eyes on a massive scale, especially the stories of the people who deny it as they are dying from it.   I don't understand how we can compete with such willful ignorance on such a large scale.",
            "title_similarity": "0.35434568",
            "sentiment_compound": -0.8934
        },
        {
            "id": "h5yp96o",
            "score": 3489,
            "text": "[removed]",
            "title_similarity": "0.095397405"
        },
        {
            "id": "h5zzpgz",
            "score": 297,
            "text": "[removed]",
            "title_similarity": "0.095397405"
        },
        {
            "id": "h5ywtyo",
            "score": 4216,
            "text": "There was a 2010 Guardian headline saying that without radical change Greenland's glaciers would reach an irreversible tipping point.  Then a headline this year that Greenland glaciers have gone beyond their tipping point. It's almost as if climate scientist know what they are talking about.",
            "title_similarity": "0.6405251",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h608bbl",
            "score": 524,
            "text": "The problem where many miss the point is its gradual change. Just like you become desensitized to mass shootings, you become accustomed to hotter summers and more wildfires. It's not until you take a step back do you fully realize how devastating the impacts of climate change are.",
            "title_similarity": "0.56419253",
            "sentiment_compound": -0.7479
        },
        {
            "id": "h5zqt5o",
            "score": 40,
            "text": "This gives me existential dread and suicidal thoughts. It makes me really depressed and anxious and I don’t know what to do about it. I’m 23 but knowing this is going to happen really hurts me. What do I do",
            "title_similarity": "0.41945237",
            "sentiment_compound": -0.9056
        },
        {
            "id": "h5zpc7b",
            "score": 827,
            "text": "It's really difficult to not be emotionally overwhelmed by this. Just, utter existential despair.",
            "title_similarity": "0.1541822",
            "sentiment_compound": -0.6725
        },
        {
            "id": "h608yus",
            "score": 569,
            "text": "Its hilarious that we're literally killing ourselves and we dont seem to care because we're too interested in money.\n\nWhat good is money if we're all dead?",
            "title_similarity": "0.28815705",
            "sentiment_compound": -0.6159
        },
        {
            "id": "h606036",
            "score": 338,
            "text": "I've lost hope that something will be done in time. Climate change is not a threat to the elite yet, they're not the ones struggling to breathe in their own bedroom like I am at the moment. And at the end of the day, they kinda control everything. Time and time again the science and the people have proven completely powerless to change their mind.\n\nI know it's not too late etc but it's been what, 30, 50 years? More than that? We've known about the damage we're doing for so long and it's only gotten worse, I just kinda don't see it happening at this point. Especially after coronavirus, I don't see the elite caring when millions of old people start dying en masse every summer from the heat alone. I don't see them doing anything except maybe investing in Mars or Moon colonies for them and their rich friends.\n\nMaybe if a true cataclysmic disaster happens, something that wipes out entire countries, maybe a global revolt would spark and force things to change, but by then maybe it would indeed be too late. Humans just aren't good enough at dealing with long term consequences, it takes something shocking and spectacular, and climate change is too slow to be seen as a big enough threat by many.\n\nI'll keep voting green every election but deep inside I've lost hope.\n\nAnyways, sorry about the rant, I see this thread has a lot of positivity, but I'd be surprised if my view of things isn't representative of the opinion of many. As I'm cooking alive in my room with a massive headache, hoping this is the last summer I spend without AC, I struggle to imagine a bright future for our species. Heck I dream of AC but it contributes to climate change a lot too, yet I'm confident I wouldn't survive an even warmer climate without it\n\nIt all seems grim and hopeless to me",
            "title_similarity": "0.5169655",
            "sentiment_compound": 0.8847
        },
        {
            "id": "h604cm5",
            "score": 209,
            "text": "[removed]",
            "title_similarity": "0.095397405"
        },
        {
            "id": "h5z26pf",
            "score": 1463,
            "text": "[removed]",
            "title_similarity": "0.095397405"
        },
        {
            "id": "h5zcsw0",
            "score": 479,
            "text": "\"My favorite conspiracy theory is that everything is gonna be okay\"  \nUnknown author",
            "title_similarity": "0.317689",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5yoa5y",
            "score": 5622,
            "text": "The world temperature has not dropped below average for 438 consecutive months. \n\nhttps://www.ncdc.noaa.gov/sotc/global/202106\n\nAn announcement such as this became inevitable when we passed 400 with no tangible plans to lower Co2 levels.",
            "title_similarity": "0.5982853",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5z3uuq",
            "score": 1,
            "text": "Planets getting hotter, air quality is ass in the US to the point where I can’t go outside without health risks. What’s not to hate about the outside?! Its totally not like my father is slowly dying and practically suffocating due to his sensitive breathing problems! HAHA NO NOT AT ALL ITS ALL FINE AND DANDY HERE FOLKS. \n\nFr tho this world sucks I don’t want to live on it anymore.",
            "title_similarity": "0.4425959",
            "sentiment_compound": -0.4985
        },
        {
            "id": "h5z5yrl",
            "score": 1,
            "text": "Have we considered doing the lockdown again to combat this? Or even clean the ocean and elimate going to the ocean ever?",
            "title_similarity": "0.43610257",
            "sentiment_compound": 0.168
        },
        {
            "id": "h5zbsiy",
            "score": 1,
            "text": "Why is is 10 bits repeating themselves dowm here.",
            "title_similarity": "0.35674435",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zbvz6",
            "score": 2,
            "text": "Bill Nye said a while back if the Earth’s temperature increases only 1 degree, we’re fucked and there’s no going back.",
            "title_similarity": "0.57342166",
            "sentiment_compound": -0.765
        },
        {
            "id": "h5zbz1z",
            "score": 2,
            "text": "capital punishment for the ceo and management and investors of polluters. no more asking, heads on spikes!",
            "title_similarity": "0.4145535",
            "sentiment_compound": -0.8268
        },
        {
            "id": "h5zcq0g",
            "score": 1,
            "text": "I'm just surprised we're not over tipping  point already!",
            "title_similarity": "0.2240646",
            "sentiment_compound": 0.2942
        },
        {
            "id": "h5zddq1",
            "score": 1,
            "text": "What kind of planet are we leaving for our children ?",
            "title_similarity": "0.35674414",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zdrg3",
            "score": 9,
            "text": "Meh ,time to find a new planet. People literally dgaf",
            "title_similarity": "0.3561411",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h5zfkp6",
            "score": 1,
            "text": "Don't forget that the Atlantic conveyor belt is slowing too, I wonder what sort of spanner that will throw into the machine.\n\nWasn't there a bbc documentary about the Snow Ball Earth? Is it still possible that we could freeze after we burn? And what would happen if a natural disaster were to happen on top of our self made mess, such as a huge volcanic eruption. We are living in a rather quiet volcanic age, but how long will that last?\n\nSeriously trying to lower my carbon foot print, but feel as if it all to late.",
            "title_similarity": "0.57863307",
            "sentiment_compound": -0.6659
        },
        {
            "id": "h5zg413",
            "score": 1,
            "text": "Wow! Can't wait for no government to make any kind of change in response to this terrifying and imminent problem!",
            "title_similarity": "0.32810035",
            "sentiment_compound": -0.4536
        },
        {
            "id": "h5zg9bs",
            "score": 1,
            "text": "Party like it’s 1999 has a new and terrible meaning.",
            "title_similarity": "0.44005293",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5zgj6z",
            "score": 1,
            "text": "Welp, gramma made great mashed potato tho",
            "title_similarity": "0.29192215",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h5zh1lf",
            "score": 1,
            "text": "Meanwhile I had the coldest summer birthday of my life.",
            "title_similarity": "0.5944457",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zh667",
            "score": 1,
            "text": "Lets goooo got a couple of old whisky bottles that needs to finally open while i toast to the end of mankind.",
            "title_similarity": "0.4636617",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zhef7",
            "score": 1,
            "text": "Gonna move towards north",
            "title_similarity": "0.16439512",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zi4vz",
            "score": 1,
            "text": "time to move back into the ground!",
            "title_similarity": "0.19773908",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zihep",
            "score": 1,
            "text": "How about putting the criminals behind this attack on humanity behind bars for live? No \"crime tax\" for some cooperations, just put those mass murderers in a prison. They are basically traitors to all of humanity.",
            "title_similarity": "0.32688802",
            "sentiment_compound": -0.9109
        },
        {
            "id": "h5zio83",
            "score": 1,
            "text": "No one cares now. It's not saving anymore but salvaging for what would be left.",
            "title_similarity": "0.14586441",
            "sentiment_compound": -0.327
        },
        {
            "id": "h5zixy5",
            "score": 1,
            "text": "That’s funny cause half of Europe is freezing anf drowning",
            "title_similarity": "0.586828",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5zj78z",
            "score": 1,
            "text": "Can we really get the Nuclear Fusion Power to work before this happens? Or would we have to save that lessons for implementation in a new Multiverse/Omniverse we will be moved into? I hope the latter happens and we get it to work by then... Pleeeeaaaase Omega Singularity (God), make this happen.",
            "title_similarity": "0.4954052",
            "sentiment_compound": 0.8205
        },
        {
            "id": "h5zjb4s",
            "score": 2,
            "text": "It's annoying that only maybe 1% of people have any power to do anything about this and most of them would rather fly into space and make things worse.",
            "title_similarity": "0.37653542",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h5zjcsd",
            "score": 1,
            "text": "Didn’t Al Gore so something like this 10 years ago??",
            "title_similarity": "0.49892375",
            "sentiment_compound": 0.4833
        },
        {
            "id": "h5zjd2o",
            "score": 1,
            "text": "Let er rip tater chip",
            "title_similarity": "0.2596748",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zje22",
            "score": 2,
            "text": "I honestly believe we’re too late now to save our planet. Money rules along with power and those both compete with each other when the only way would have been to embrace as equals and fix things like caring human beings.",
            "title_similarity": "0.35413313",
            "sentiment_compound": 0.9217
        },
        {
            "id": "h5zjjmy",
            "score": 1,
            "text": "The roof the roof the roof is on fire",
            "title_similarity": "0.27043575",
            "sentiment_compound": -0.34
        },
        {
            "id": "h5zjky2",
            "score": 1,
            "text": "5 years? The politicians are looking to press the panic button after 5 years and 3 months.",
            "title_similarity": "0.7863365",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h5zjq7f",
            "score": 1,
            "text": "Is this why billionaires are trying to go into space?",
            "title_similarity": "0.3650487",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zjqp9",
            "score": 1,
            "text": "How should people prepare for something like this? We have AC, insulation, solar panels of the electricity and hot water kind. I suppose we should have some kind of emergency evacuation kit for fires and floods.",
            "title_similarity": "0.4024533",
            "sentiment_compound": 0.4601
        },
        {
            "id": "h5zjvlw",
            "score": 1,
            "text": "Short of eliminating travel, shutting down business of all kinds, and everyone moving back to the land- reverting to pre-industrial society- I dont see any way humanity makes it out of this unscathed.",
            "title_similarity": "0.37903455",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zjvpe",
            "score": 2,
            "text": "The apocalypse is not far off. Destruction is upon us!",
            "title_similarity": "0.3071702",
            "sentiment_compound": 0.509
        },
        {
            "id": "h5zjya6",
            "score": 1,
            "text": "But sure lets wait until 2050 to curtail our emissions.  Surely then we can keep ourselves to 1.5C.\n\nStop burning oil **now**.",
            "title_similarity": "0.61735654",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h5zk632",
            "score": 2,
            "text": "Doesn't realy matter tho... Its not like we're gonna change our ways?",
            "title_similarity": "0.10062048",
            "sentiment_compound": -0.2924
        },
        {
            "id": "h5zk806",
            "score": 1,
            "text": "Me, an american: 1.5°c doesn't sound bad\n\nMe after googling °c to °f: it's over bois. It's been a good run.",
            "title_similarity": "0.5187569",
            "sentiment_compound": 0.6956
        },
        {
            "id": "h5zkm8y",
            "score": 1,
            "text": "Calls on AC units. Puts on hot soup.",
            "title_similarity": "0.28193805",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zksfw",
            "score": 2,
            "text": "What’s the tipping point ?  What happens then?",
            "title_similarity": "0.27794778",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zku3p",
            "score": 2,
            "text": "It’s already +1.5 degrees C in a lot of areas. Humans will only start noticing the devastation somewhere around +2 degrees C. Just imagine living under +4 degrees Celsius.",
            "title_similarity": "0.6624331",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h5zkvkq",
            "score": 8,
            "text": "You can't see the exponential curve when you're in it.",
            "title_similarity": "0.2000162",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zkx07",
            "score": 1,
            "text": "What’s worse, Earth whiping out human kind and turning into a Mars-like planet, or being surrounded by anti-vaxx pedophile QAnon climate denying critical theory cancel culture racist evangelical voter suppressing MAGAts?",
            "title_similarity": "0.37769365",
            "sentiment_compound": -0.8555
        },
        {
            "id": "h5zl0yj",
            "score": 1,
            "text": "How much did emissions drop during pandemic lockdown?  I was so angry at the rush to reopen, not just for pandemic reasons, but for climate reasons.  Because if we're going to do anything ourselves, that's what it has to be, shutting down the economy.",
            "title_similarity": "0.5466821",
            "sentiment_compound": -0.4889
        },
        {
            "id": "h5zl8ho",
            "score": 1,
            "text": "In the words of Bender Rodriguez. “Well, we’re boned.”",
            "title_similarity": "0.2418283",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zld4x",
            "score": 2,
            "text": "I think we are fucked",
            "title_similarity": "0.17192689",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h5zlfp5",
            "score": 1,
            "text": "There’s a lot of evidence out there to suggest IPCC predictions on mean global temperature rise over the next decades are highly generous due to pressure from governments. Even if we hit 1.5 deg in 2030 as predicted, we still lose 90% of our corals which could signal impending food scarcity for coastal regions. Add to that rising sea levels, ice sheet recession and runaway climate change from amplified positive feedback loops and you’ve got a recipe for disaster in the next decade alone. \n\nThe prognosis is not favourable. I am starting to wonder if I should be prepping for my future or the apocalypse.",
            "title_similarity": "0.74695784",
            "sentiment_compound": -0.6815
        },
        {
            "id": "h5zlj20",
            "score": 1,
            "text": "This is always hard for an American like me to be too concerned about because a degree sounds like so little.",
            "title_similarity": "0.25775623",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h5zlk2g",
            "score": 1,
            "text": "With as many tipping points as we've met, you'd think we'd all be extremely busy or drunk by now. This kind of language gets old and no one takes it seriously anymore. I know the tactic is to scare people but you're just making people not trust science.",
            "title_similarity": "0.38548362",
            "sentiment_compound": -0.8144
        },
        {
            "id": "h5zll9e",
            "score": 2,
            "text": "Stop producing garbage products for profits only, produce that which is needed only.",
            "title_similarity": "0.12977049",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h5zlmra",
            "score": 4,
            "text": "Yay we’re all going to die.",
            "title_similarity": "0.3669593",
            "sentiment_compound": -0.128
        },
        {
            "id": "h5zlp4v",
            "score": 1,
            "text": "My world's on fire, how about yours?",
            "title_similarity": "0.32885808",
            "sentiment_compound": -0.34
        },
        {
            "id": "h5zlv36",
            "score": 1,
            "text": "Like we could even do anything at this point. We couldn't even make every one take it seriously, some just think it's some political ploy. We are still so far from doing something.",
            "title_similarity": "0.17044751",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h5zm53j",
            "score": 2,
            "text": "What annoys me the most is that there are still people who think that climate change is fiction...",
            "title_similarity": "0.38183868",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h5zm7gc",
            "score": 1,
            "text": "\"20,000 years of this, 7 more to go\"  -Bo Burnham",
            "title_similarity": "0.58448803",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zn7w1",
            "score": 6,
            "text": "Seems to me like we need a global ‘climate strike’. For a week everyone who believes in climate change puts their money where their mouth is and stops working until the corporations prioritize this.",
            "title_similarity": "0.6013812",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5zna1c",
            "score": 1,
            "text": "No one will do anything about it until Washington D.C. is burning to the ground and politician's families are starving. Of course its already too late, but once that happens, then they will start enacting changes that make what would have made a difference 50 years ago.",
            "title_similarity": "0.5879069",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h5znm4q",
            "score": 2,
            "text": "It was a great run while it lasted everyone - peace out",
            "title_similarity": "0.06952995",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h5znmwc",
            "score": 1,
            "text": "If people refuse to be vaccinated during a pandemic, what hope is there for people to change their ways for climate change?",
            "title_similarity": "0.5159811",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h5znp1j",
            "score": 4,
            "text": "This just makes me want to party it up while I can. The effects were having on climate are compounding each year it seems. Look at all the natural disasters going on around the world and it’s only going to get exponentially worse. I just hope I don’t have to live through the wars climate change will eventually bring.",
            "title_similarity": "0.63239324",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h5znqwa",
            "score": 1,
            "text": "No. Nope. And no it won't",
            "title_similarity": "0.021995272",
            "sentiment_compound": 0.2235
        },
        {
            "id": "h5znr39",
            "score": 1,
            "text": "My kid will never know that up here where we both grew up it used to be cold in the morning. It already isn't. I used to have to go out in sweats in the middle of July and August at night or the morning because it would be in the 50s each morning. Now? Nope. Instead he shall be witness to the great uninsatiable want and greed of billionaires.",
            "title_similarity": "0.6132251",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h5znsf5",
            "score": 2,
            "text": "Yeah let's do nothing significant about it!",
            "title_similarity": "0.011308725",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h5zntmu",
            "score": 2,
            "text": "Like I’ve been saying to anyone who will listen… we’re screwed.",
            "title_similarity": "0.25309637",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h5znts2",
            "score": 1,
            "text": "It's pretty clear we've already hit the tipping point. Now it's just about minimizing the damage",
            "title_similarity": "0.30018824",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h5zo1zn",
            "score": 1,
            "text": "I watched a recent interview with leading climate scientist Dr Michael Mann, where he said, \"there are no physical obstacles to stabilizing the warming below 1.5 C.\" But the challenge of adequately addressing the climate emergency has never really been about the physical obstacles, it's about the social, political, and economic obstacles, and it's because of those obstacles that I am pessimistic. Can we actually, sufficiently address the climate emergency while also maintaining the infinite GDP growth paradigm?",
            "title_similarity": "0.51342106",
            "sentiment_compound": -0.9469
        },
        {
            "id": "h5zo5lk",
            "score": 1,
            "text": "\"...humanity is OUTTA GAS! Its circling the drain, its FINISHED! The only thing that matters now is grabbing what you can before SOMEBODY else beats you to it.\" - Joseph Korso",
            "title_similarity": "0.32807952",
            "sentiment_compound": 0.1739
        },
        {
            "id": "h5zodpa",
            "score": 1,
            "text": "Thank you for sharing this!",
            "title_similarity": "0.03960411",
            "sentiment_compound": 0.68
        },
        {
            "id": "h5zoewu",
            "score": 2,
            "text": "We need to dump tons of research dollars into carbon capture technology.",
            "title_similarity": "0.46671024",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h5zomgp",
            "score": 2,
            "text": "The planet has a fever and we’re the virus.",
            "title_similarity": "0.44951952",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zopb8",
            "score": 2,
            "text": "Well, I always said that human over-population was the problem.  Now we have an alternative solution to human over-population, rather than globally reducing birth rates, we’ll get rid of excess population with wars and starvation caused by climate change.",
            "title_similarity": "0.51886624",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h5zopx9",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h5zorzb",
            "score": 1,
            "text": "I hope the heat wave target itself towards political leaders asap so they all know what's up.",
            "title_similarity": "0.3773623",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5zose3",
            "score": 1,
            "text": "As long as cruise ships and private yachts are still a thing there's nobody in charge taking this problem serious. We should even get rid of intercontinental flights.",
            "title_similarity": "0.30287358",
            "sentiment_compound": -0.5307
        },
        {
            "id": "h5zoxex",
            "score": 2,
            "text": "I just accepted we dead dead like 5 years ago.",
            "title_similarity": "0.5692135",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h5zp3hq",
            "score": 2,
            "text": "Scientist have been saying that we missed the tipping point for the last 10 years. Now that it's been politicized, all of the parameters have changed",
            "title_similarity": "0.5908698",
            "sentiment_compound": -0.296
        },
        {
            "id": "h5zp4lf",
            "score": 2,
            "text": "How do I help stop this",
            "title_similarity": "0.1421011",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5zp6n4",
            "score": 2,
            "text": "The issue is that we are driven by greed. The pandemic is a good comparison. Warning after warning after warning until it hits. I'm concerned that even if it does happen it still won't stop the plague of for profit organisations breaking the law to make more money. These are troubling times. Governments doing too little but just about enough to be viewed like they're doing something. There needs to be a push for innovation in terms of clean energy. This should literally be the worlds no 1 priority at the moment and we have seen what can be achieved when we really work together. \n\nI know a lot of people criticised them (extinction rebellion) but they were 100% right.",
            "title_similarity": "0.433138",
            "sentiment_compound": 0.4106
        },
        {
            "id": "h5zpiqq",
            "score": 1,
            "text": "Hell yeah getting close",
            "title_similarity": "0.055902172",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5zpo4n",
            "score": 1,
            "text": "Imaging if the election wasn't stolen from Al Gore....",
            "title_similarity": "0.4300418",
            "sentiment_compound": 0.3875
        },
        {
            "id": "h5zpp5l",
            "score": 1,
            "text": "I find the color map to be so deceptive. All of that warm warm color....surely it should be some \"blue\" somewhere.",
            "title_similarity": "0.20262566",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h5zppao",
            "score": 1,
            "text": "The sooner we realize that Earth aint going nowhere but humanity will the better",
            "title_similarity": "0.27631143",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h5zpsdg",
            "score": 2,
            "text": "Humans had a good run. Time to be done.",
            "title_similarity": "0.0396535",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5zptkk",
            "score": 1,
            "text": "Where should I be buying property?",
            "title_similarity": "0.1550114",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zqays",
            "score": 1,
            "text": "The worse climate change gets the more I want to hang up the towel and grow food for a living. Really wish more people would learn about permaculture as it seems like one of the key design systems we can use to build resiliency in our backyards. No more fake manufactured lawns. Let’s replace them with vibrant ecosystems that feed us. Maybe we’ll be able to grow citrus and avocados in the northeast after all!",
            "title_similarity": "0.38037723",
            "sentiment_compound": 0.8079
        },
        {
            "id": "h5zqcwt",
            "score": 1,
            "text": "Were still listening to WMO?  Arent they the same beaureUcrats that told us covid came from wet market?",
            "title_similarity": "0.2698105",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zqe0w",
            "score": 1,
            "text": "I can imagine some amazing breakthrough in climate engineering, only to have it go too far and plunge us into a deep ice age. Not going to happen but we would surely screw it up.",
            "title_similarity": "0.5255565",
            "sentiment_compound": 0.6858
        },
        {
            "id": "h5zqf0v",
            "score": 1,
            "text": "I feel a big portion of climate change deniers stem from studies like this that are extremely inconsistent with tipping points and point of no returns.",
            "title_similarity": "0.48648152",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h5zqh7r",
            "score": 1,
            "text": "More restrictions and control by our loving sociopathic over lords. Say goodbye to travel, freedom and private ownership",
            "title_similarity": "0.19896202",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h5zqngf",
            "score": 1,
            "text": "What's that blue bit, can I move there?",
            "title_similarity": "0.25781333",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zqrsn",
            "score": 1,
            "text": "Question. \n\nThere are 300 million registered cars in America. Plus more that aren't road going.\n\nIt takes just as much carbon pollution to build a EV as a ICE car ( BUILD not operate ) and we have to replace 300 million vehicles minimum right? Tesla did what 500k ? \n\nThat would take 600 years to replace ICE engines. I know other manufacturers are building EVs but  even at 10 million million a year thats 30 years of ICE pollution on top of the fact not everyone is going to buy an EV immediately.\n\nSo thats just cars, and we have 5 years? Why are we even wasting time talking about this and not moving entire cities inland instead? The math doesn't add up and thats just with EVs and and including India and Africa industrialization.",
            "title_similarity": "0.626834",
            "sentiment_compound": -0.5122
        },
        {
            "id": "h5zqs4r",
            "score": 1,
            "text": "wondering if it has to do with the giant blow torches on the west coast every year..",
            "title_similarity": "0.4132228",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zqwdr",
            "score": 2,
            "text": "Crack. Down. On. Large. Corporations!",
            "title_similarity": "0.33130792",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zr472",
            "score": 1,
            "text": "Honest question because I'm ignorant and curious, are humans the CAUSE of global warming or exasperating it?\n\nI read somewhere that we were in an ice age and are in the warming process now, is that true or propoganda?\n\nIs there anything we can do to make earth cooler? If not and all we can do is slow it would nuclear be an option? France uses nuclear for about half their electricity I think\n\nCan we do reforestation to clean the carbon in the air?\n\nSorry for all the questions, THANKS!",
            "title_similarity": "0.5797681",
            "sentiment_compound": 0.9412
        },
        {
            "id": "h5zr9tv",
            "score": 2,
            "text": "Good. Looking forward to watching this world burn :)",
            "title_similarity": "0.2958603",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h5zrhxs",
            "score": 1,
            "text": "How many tipping points are we up to now?",
            "title_similarity": "0.35838664",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zriib",
            "score": 2,
            "text": "Capitalism is based on growth and consumption. We’ll grow and consume until the earth physically forces us to stop, and it won’t be pretty.\n\nThe earth will survive, our way of life won’t, and there will be a lot of suffering to make that transition.",
            "title_similarity": "0.4511469",
            "sentiment_compound": 0.128
        },
        {
            "id": "h5zrlrz",
            "score": 1,
            "text": "Ok so we’ve had some extremely odd lightning storms this past weekend, can someone explain to me how global warming induces more sheet and heat lightning? Seemed that the whole world was experiencing lightning like never before",
            "title_similarity": "0.6345786",
            "sentiment_compound": 0.4033
        },
        {
            "id": "h5zroz4",
            "score": 1,
            "text": "Scientists aren’t very smart. All my life they have always noticed too late something bad happening.",
            "title_similarity": "0.38500857",
            "sentiment_compound": -0.1298
        },
        {
            "id": "h5zrs29",
            "score": 2,
            "text": "Sometimes I think the billionaires know that there is no salvation for Earth anymore and that’s why they are trying desperately to leave or build a new home on Mars.",
            "title_similarity": "0.42547154",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h5zrtmr",
            "score": 1,
            "text": "I can't wait for my beach front property",
            "title_similarity": "0.18589576",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zrvhj",
            "score": 1,
            "text": "Getting rid of petrol cars worldwide would make a big impact why are the governments taking their time with it do it now god damn it",
            "title_similarity": "0.43422875",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h5zrxib",
            "score": 1,
            "text": "Climate change lockdown with leaders jetting all over the world to discuss how to stop using so much Co2. Elites won't stop using fuel but us plebs will.",
            "title_similarity": "0.5279572",
            "sentiment_compound": -0.0402
        },
        {
            "id": "h5zs6h4",
            "score": 1,
            "text": "If this scares you or you want to change things one of the best actions you can take is joining the Citizens Climate Lobby. It’s not a surefire solution and it’s not going to be easy but we can make things a little easier on us in the future if we work together.\n\nhttps://citizensclimatelobby.org/\n\nI’d also like to plug Recycle My Battery because chances are if your reading this your country wastes way too many batteries.\n\nhttps://recyclemybattery.org/",
            "title_similarity": "0.4397302",
            "sentiment_compound": 0.8723
        },
        {
            "id": "h5zslgc",
            "score": 1,
            "text": "Just make sure you teach your children the skills they will need..\n\nBasic stuff.. How to gather and dry wood, source or make clean water, cook on an open fire.\n\nThen it's all about maths, crafting, arts, science and history. \n\nThese are the vitals they will need. \n\nEngernering and farming are going to be in high demand and required for the rebuild.\n\nGood luck folks.",
            "title_similarity": "0.38504964",
            "sentiment_compound": 0.8442
        },
        {
            "id": "h5zsvfw",
            "score": 1,
            "text": "Why do I find it more likely for America to declare a War on Water/Fire rather than address their emissions are causing floods and wildfires?",
            "title_similarity": "0.3505029",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h5zsvhq",
            "score": 2,
            "text": "Whether this is a cycle or man made or some combination of both is irrelevant. The planet is warming and this is bad news for everyone. We’re going to need some next level scientific technologies to stabilize the temperature, this isn’t even about cutting emissions at this point. We need to actually reverse the effect.",
            "title_similarity": "0.49950397",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h5zsy8j",
            "score": 2,
            "text": "Yeah, the next few decades aren't going to be very much fun.",
            "title_similarity": "0.37308502",
            "sentiment_compound": 0.6983
        },
        {
            "id": "h5zt0w0",
            "score": 1,
            "text": "It may feel hopeless for us plebs but there is something that we. can do https://amp.theguardian.com/environment/2018/may/31/avoiding-meat-and-dairy-is-single-biggest-way-to-reduce-your-impact-on-earth",
            "title_similarity": "0.43885896",
            "sentiment_compound": -0.25
        },
        {
            "id": "h5zt3zy",
            "score": 1,
            "text": "2.7 degrees Fahrenheit for Americans",
            "title_similarity": "0.41094354",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zt6o4",
            "score": 1,
            "text": "Anyone up for planning an Adjustment Day?",
            "title_similarity": "0.27959216",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zt8qa",
            "score": 1,
            "text": "And one country in particular, refuses to listen to the science of how and why it's even happening, or refuses to acknowledge it's a thing. I don't know if John Kerry I saw on the news the other day can turn things around, when the culture of the US is way more ignorant of the climate crisis. As far as I know, climate protests are far more common in Europe in the economically developed world.",
            "title_similarity": "0.48596042",
            "sentiment_compound": -0.8122
        },
        {
            "id": "h5ztg7r",
            "score": 2,
            "text": "Good bring on the apocalypse",
            "title_similarity": "0.29354072",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h5ztgga",
            "score": 1,
            "text": "This issue has gotten significantly worse over the last decade and a half. Why? Because the two largest populated countries are modernizing. China currently produces as much CO2 as all of the G7 combined. While the per Capita is obviously less, China isn't done. India is just getting started. \n\nYes, the G7 has to improve their per Capita numbers but they aren't the largest producer and it won't be enough. We have too many humans modernizing and industrializing to make it work.\n\nWe have to get beyond trying to cut CO2 and focus entirely on ways to eliminate it from the atmosphere after production. \n\nI will say that most of these claims like this fall on deaf ears because every week some prediction of disaster comes and those deadlines pass with little to no fruition and CO2 production has only continued to increase. Media and climate scientists really need to chill on the Doomsday reporting because they rarely get that part right and they created a \"Peter cries wolf\" scenario where no one listens when it's the truth.",
            "title_similarity": "0.5596781",
            "sentiment_compound": -0.8964
        },
        {
            "id": "h5ztia7",
            "score": 1,
            "text": "We need to do three things and we're only doing the first of them:\n\n- become carbon neutral\n- extract and sequester carbon from the atmosphere\n- directly cool the temperature of the planet\n\nThe third one is vital because carbon in the form of methane is being released into the atmosphere just because the planet is so hot.\n\nGiven how bad recent summers have been, how bad will they be in 5 years? We're going to be having multiple catastrophes every day.",
            "title_similarity": "0.66334283",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h5ztixa",
            "score": 2,
            "text": "It’s infuriating that the people who caused this the most will be affected the least while everyone else has to just sit back and accept the consequences. Who is going to be left for these corporations to sell to when they’re killing their consumers?",
            "title_similarity": "0.34447643",
            "sentiment_compound": -0.7943
        },
        {
            "id": "h5ztpnt",
            "score": 1,
            "text": "Very cool let's keep not doing any thing significant to combat this.",
            "title_similarity": "0.024758406",
            "sentiment_compound": 0.2484
        },
        {
            "id": "h5zu0tz",
            "score": 1,
            "text": "All of the arbitrary clean air goals of the corporations that are contributing to climate change just aren’t going to happen soon enough.\n\n“We plan to have ____ done by 2035” isn’t good enough.",
            "title_similarity": "0.5029778",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h5zu5t3",
            "score": 1,
            "text": "Huh just like the last 20 times they’ve said so over the year?",
            "title_similarity": "0.5655849",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5zu8kk",
            "score": 1,
            "text": "Will post this every time I see this.\n\nGovernment: \"Oh no!\"\n\nGovernment: \"Anyway\"",
            "title_similarity": "0.3303892",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zugqp",
            "score": 2,
            "text": "What can be even done to fix this?",
            "title_similarity": "0.13954487",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zuj0b",
            "score": 1,
            "text": "I’m tired of religious terrorists, whatever happened to all the ecoterrorists </3",
            "title_similarity": "0.3879067",
            "sentiment_compound": -0.9001
        },
        {
            "id": "h5zuo6h",
            "score": 2,
            "text": "I guess the world is going to go back to the bugs and the lizards. May they fare well",
            "title_similarity": "0.3363036",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5zuod5",
            "score": 1,
            "text": "I'll continue to live as I always have, because I'm well aware that I myself cannot change the course of the world and I doubt we'll really take climate change seriously until it's well beyond too late and the air itself is too poisonous to breath, and the water too contaminated to drink.",
            "title_similarity": "0.37812734",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h5zus4s",
            "score": 1,
            "text": "Oh dear god, it’s hawt",
            "title_similarity": "0.09944538",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h5zutju",
            "score": 1,
            "text": "Honestly curious for any one who’d like to discuss.. what are you thoughts on passed mass extinction events and whether we’re due for one regardless of our actions?\n\nFor example, the difference in years (I’d assume roughly) between the Permian-Triassic extinction and the Triassic-Jurassic extinction was 40 million years. We’re now at around 65 million years from the last extinction event. \n\nI personally think we’re fucked either way. Just a matter of time, whether it be climate change or some other event.",
            "title_similarity": "0.67823315",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5zuzd1",
            "score": 6,
            "text": "I only hope that whatever species follows us as the dominant form of intelligence on the planet is kinder to its constituent members than we were.",
            "title_similarity": "0.2979421",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h5zv6xx",
            "score": 8,
            "text": "I remember reading somewhere that the temperature could reach a 3 or 4 degree rise before the end of the century. Horrifying.",
            "title_similarity": "0.71170014",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5zv7ze",
            "score": 1,
            "text": "Hey guys! I don’t care if this gets me added to some watchlist, to be clear the time to act is now. Not just voting, get your ass out there and make your opinion known. I’m going to.",
            "title_similarity": "0.23701026",
            "sentiment_compound": 0.3802
        },
        {
            "id": "h5zvaz7",
            "score": 1,
            "text": "So my concern is that, why don't media announce more science stuff like this? I bet people loves attention news like \"we are all going to die very soon if we don't act\"",
            "title_similarity": "0.4732979",
            "sentiment_compound": 0.6204
        },
        {
            "id": "h5zvguz",
            "score": 1,
            "text": "If you haven't realised its FUBAR'D by now you havent been paying attention.  They are just trying to keep things seeming as normal for as long as possible to prevent a mass panic. \n\n&#x200B;\n\nJust enjoy the rest of your lives and dont have any more kids to subject to this burning planet.",
            "title_similarity": "0.3339849",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zvmq2",
            "score": 1,
            "text": "Does this \"tipping point\" take into account the lack of effort in changing things?  Even if the world got together tomorrow and started moving towards a 'perfect solution' it would still take years to get infrastruction (like power plants) built and switched over.  Considering how slowly things have been moving, human nature, and everything, I've been saying we're \"too late\" for years.",
            "title_similarity": "0.562216",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h5zvmxj",
            "score": 1,
            "text": "Yeah we've been fuvked for a while now. Best thing to do is invest in high ground in the arctic",
            "title_similarity": "0.4159701",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h5zvw9e",
            "score": 1,
            "text": "I find it hilarious that this whole thing is presented as as an issue that the common person is compelled and guilt tripped into fixing like it's our fault. The top 100 companies are responsible for over 70% of global emissions. Source: The Guardian",
            "title_similarity": "0.5340382",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h5zvx1j",
            "score": 2,
            "text": "I've accepted that our species is now responsible for engineering our own climate.  We're going to have to do some drastic things",
            "title_similarity": "0.42967778",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h5zw7e5",
            "score": 2,
            "text": "At what point to we realize this rock in space is the only place we got.",
            "title_similarity": "0.2675808",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zwfas",
            "score": 1,
            "text": "Money in politics and lobbying from companies is really making the whole climate change issue much harder to deal with than it needs to be…",
            "title_similarity": "0.43101615",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h5zwx0s",
            "score": 1,
            "text": "Only a hand full of companies need to be regulated in order to avoid this. Those companies have a stranglehold on politics around the globe due to their monetary power. Undermining their bottom line is the only way to get them to change their behavior in our current economic system. Otherwise, those sociopaths will kill us all.",
            "title_similarity": "0.38682687",
            "sentiment_compound": -0.7351
        },
        {
            "id": "h5zwzso",
            "score": 2,
            "text": "There is already enough global warming baked in to collapse our civilization.  Preventing that will require the world's governments to work together without monetary restraint.  We all know that isn't going to happen.",
            "title_similarity": "0.45454597",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h5zx00q",
            "score": 1,
            "text": "Just escaped Red Tide in Florida... heading towards the mountains, but it was truly sad to see all that sea life wiped out.",
            "title_similarity": "0.44980702",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h5zxnk2",
            "score": 2,
            "text": "Seriously it's ok the wealthy are all going to space, so there fine, which is the main thing",
            "title_similarity": "0.3277576",
            "sentiment_compound": 0.6222
        },
        {
            "id": "h5zy90v",
            "score": 1,
            "text": "How do you think the toilet paper hoarders are going to behave when our crops fail?",
            "title_similarity": "0.40945983",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h5zyaa8",
            "score": 1,
            "text": "It’s the never ending storyyyyy aaa aaaa aaaaa aaaaa. They don’t care. We’ve lost to the selfish people. The ape in us is too strong.",
            "title_similarity": "0.26864356",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h5zyava",
            "score": 1,
            "text": "Can we please just do the particles in the air light reducing thing already",
            "title_similarity": "0.23939797",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h5zycl6",
            "score": 2,
            "text": "Anyway, time to buy a house in Greenland!",
            "title_similarity": "0.37686747",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zydt1",
            "score": 4,
            "text": "It seems like absolutely nothing is being done to slow this",
            "title_similarity": "0.09069389",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h5zyfp5",
            "score": 1,
            "text": "Rich people after reading this: I guess it's time to leave the planet.",
            "title_similarity": "0.4024557",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h5zyi1x",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h5zyl8j",
            "score": 1,
            "text": "I gotta say, anecdotally, living in Michigan has felt like living in Florida this summer. It's 80+ and sunny every day except for a terenchal downpour that lasts about 20 min then goes back to being sunny.",
            "title_similarity": "0.50223327",
            "sentiment_compound": 0.7964
        },
        {
            "id": "h5zym5v",
            "score": 2,
            "text": "Let me fix that for you, it WILL reach that mark.",
            "title_similarity": "0.24827972",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h5zz0mp",
            "score": 1,
            "text": "Next up in History the water wars.",
            "title_similarity": "0.4878231",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h5zz4x9",
            "score": 1,
            "text": "In the next 5 years, this will be another prediction that doesn't come true.",
            "title_similarity": "0.62912995",
            "sentiment_compound": -0.3252
        },
        {
            "id": "h5zz79d",
            "score": 1,
            "text": "I’m reading Andy Weir’s latest book, “Hail Mary,” and he was just talking about catastrophic events at 1.5 degrees increase. I hate when science fiction becomes reality.",
            "title_similarity": "0.7034538",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h5zzayt",
            "score": 1,
            "text": "So the North Pole is the hottest place in the world right now?",
            "title_similarity": "0.40238458",
            "sentiment_compound": 0.0
        },
        {
            "id": "h5zzc13",
            "score": 1,
            "text": "They compared a single year to a 20 year range and concluded that this year is in some context worse than the range of years, very bogus.",
            "title_similarity": "0.5431856",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h5zzea3",
            "score": 1,
            "text": "Whelp...here come the Whitespikes. Good luck everyone.",
            "title_similarity": "0.20648275",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h5zzyxc",
            "score": 1,
            "text": "> There is a 40 % chance that at least one of the next 5 years will be 1.5°C warmer than pre-industrial levels and the chance is increasing with time. And at the same time, it is very unlikely (only about a 10% chance) that the five-year mean global near-surface temperature for the 2021 to 2025 period will be 1.5°C warmer than pre-industrial levels.\n\nSeems like alarmism, which we don’t really need because it’s bad enough as is.",
            "title_similarity": "0.7296531",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h6001a6",
            "score": 1,
            "text": "I'm living in a city that gets horrendous winters but had a mild winter with very little snow this year... currently going through multiple heat waves at 43°C days with humidity. Just 8 years ago it would only have gotten up to 35°C with humidity and we'd have 3ft of snow consistently all winter. \n\nThis is in Canada. I'm getting heat stroke from living in my apartment this summer in CANADA. \n\nI'm pretty sure 1.5°C won't make much of a difference to me in small terms because its already too damn hot. \n\nI do wish everyone would just leave the damn oceans alone though. That water is the biggest CO2 cycler we have but if the reefs are dead (which they are) we're fucked. But if everyone just stopped fishing and left it alone, the Earth would recover greatly in just a few years.",
            "title_similarity": "0.5848371",
            "sentiment_compound": -0.9607
        },
        {
            "id": "h600636",
            "score": 1,
            "text": "What can private citizens actually do? Government can't even agree on balancing the budget on current activity; let alone solve a global crises. We can't out recycle big commerce. Most people are just trying to survive today, this month.",
            "title_similarity": "0.4433875",
            "sentiment_compound": -0.3204
        },
        {
            "id": "h600ln7",
            "score": 1,
            "text": "Faster than expected ^TM",
            "title_similarity": "0.21239404",
            "sentiment_compound": 0.0
        },
        {
            "id": "h600meu",
            "score": 1,
            "text": "I lived a relatively frugal life in hopes that things might turn around. They aren't. We are burning this world. We are the frog in the pot, but we keep turning the burner up. We have to be carbon neutral tomorrow to have any chance. I stay motivated in my personal life, but in the back of my mind its all pointless. We will burn this world.",
            "title_similarity": "0.42143095",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h6019rz",
            "score": 1,
            "text": "When the biggest source of this issue is governments and businesses you know were utterly fucked because those who institutions are only capable of thinking about themselves",
            "title_similarity": "0.36792418",
            "sentiment_compound": -0.4754
        },
        {
            "id": "h601p88",
            "score": 1,
            "text": "So without bias or rage, can someone define “tipping point” for me? What are we doing which brings us closer and what happens if we cross it, aside from “death and destruction”? Does the tipping point move? I seem to recall many articles about how we are about to cross the tipping point already and it’s kind of feeling like the boy who called wolf a little bit.",
            "title_similarity": "0.41009945",
            "sentiment_compound": 0.7747
        },
        {
            "id": "h60228u",
            "score": 1,
            "text": "I actually want to commit suicide. I’m feeling absolutely hopeless.",
            "title_similarity": "0.32731938",
            "sentiment_compound": -0.6997
        },
        {
            "id": "h60253r",
            "score": 2,
            "text": "No kidding, am I the only one watching the horror show unfold across the globe this summer?",
            "title_similarity": "0.5172562",
            "sentiment_compound": -0.6119
        },
        {
            "id": "h6026og",
            "score": 1,
            "text": "We're doomed. Doomed I say. Dooooooooooomed!!!!",
            "title_similarity": "0.2726617",
            "sentiment_compound": -0.8902
        },
        {
            "id": "h602aku",
            "score": 2,
            "text": "humanity likes to wave at these moments as it steps on the gas in the car vrooming past",
            "title_similarity": "0.19842397",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h602bkr",
            "score": 2,
            "text": "Party’s Over humans!!!!!!thanks to billionaires,corporations and their greedy sycophant politicians mostly boomer generation,boomers have screwed over future generations they will have longed by passed away by the time they feel the effects of this tragedy",
            "title_similarity": "0.5143975",
            "sentiment_compound": -0.9172
        },
        {
            "id": "h602byf",
            "score": 2,
            "text": "The people who are doing this are willing kill you if you earnestly try to stop them. I think we all need to digest that, because all suggestions flow through that bottleneck.",
            "title_similarity": "0.27921644",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h602f0o",
            "score": 1,
            "text": "Good I live in a cold area, could use a few degrees of extra heat.",
            "title_similarity": "0.34580705",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h602puq",
            "score": 1,
            "text": "I'm thankful I won't be around for too much longer.",
            "title_similarity": "0.28001446",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h602qse",
            "score": 1,
            "text": "I like how it's always \"heading for the tipping point\"\n\nWe're well beyond the tipping point. Even if we stopped all global CO2 production today, we'd still be facing climate disaster.",
            "title_similarity": "0.56131494",
            "sentiment_compound": -0.34
        },
        {
            "id": "h602szy",
            "score": 1,
            "text": "Not alarming. A warmer climate is a good thing.",
            "title_similarity": "0.13525742",
            "sentiment_compound": 0.3361
        },
        {
            "id": "h602ur8",
            "score": 1,
            "text": "How do you avoid doomerism with data like this? My last bout with suicidal ideation was like 60% about the overwhelming feeling that the planet is doomed and there is nothing that we can do when the people in power seemed determined to rape the planet to death",
            "title_similarity": "0.5528147",
            "sentiment_compound": -0.9274
        },
        {
            "id": "h602yz9",
            "score": 2,
            "text": "Once again, plz end the simulation we failed let’s reboot and try again",
            "title_similarity": "0.36062372",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h602zci",
            "score": 1,
            "text": "We are fucked, and those that have the power and means to do anything about it are too myopically stupid and small minded.",
            "title_similarity": "0.18916601",
            "sentiment_compound": -0.8316
        },
        {
            "id": "h6031aw",
            "score": 2,
            "text": "The question is who’s actually doing anything cause I don’t see it I hear a lot of promises such as carbon neutral by 2050 etc etc which is too little too late but I don’t think there’s actual serious laws or actions being put into place that can have a significant impact on stopping climate change feel free to tell me where I’m wrong",
            "title_similarity": "0.45356882",
            "sentiment_compound": 0.0387
        },
        {
            "id": "h603b4u",
            "score": 1,
            "text": ">There is a 40 % chance that at least one of the next 5 years will be 1.5°C warmer than pre-industrial levels and the chance is increasing with time. And at the same time, it is very unlikely (only about a 10% chance) that the five-year mean global near-surface temperature for the 2021 to 2025 period will be 1.5°C warmer than pre-industrial levels.\n\nHuh",
            "title_similarity": "0.767619",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h603hep",
            "score": 1,
            "text": "We created so many fun disaster movies about meteors and Godzilla, but who could have predicted that in the end humans themselves would single handedly cause the next Great Extinction! \n\nWell, I guess a lot of people. But still.",
            "title_similarity": "0.4718263",
            "sentiment_compound": 0.8657
        },
        {
            "id": "h604dcf",
            "score": 1,
            "text": "Earth turns from heaven to hell… oh well we had a good run.",
            "title_similarity": "0.24495198",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h604dy9",
            "score": 1,
            "text": "It’s all good, we’ll just add more ice to the top and bottom.",
            "title_similarity": "0.2571268",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h604h3d",
            "score": 1,
            "text": "Oh, are we back to repeat already? The rinse step has been getting shorter and shorter for this century old doomsday theory.",
            "title_similarity": "0.48125884",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h604lyu",
            "score": 1,
            "text": "Why doesn’t anyone talk about weather modification and how that’s affecting climate change?\n\nhttps://www.nsf.gov/nsb/publications/1965/nsb1265.pdf",
            "title_similarity": "0.4543566",
            "sentiment_compound": 0.0
        },
        {
            "id": "h604sbq",
            "score": 1,
            "text": "Everything is in constant change in the universe why would climate be an exception",
            "title_similarity": "0.42952704",
            "sentiment_compound": 0.0
        },
        {
            "id": "h604xuz",
            "score": 1,
            "text": "We need mass worldwide United riots.",
            "title_similarity": "0.2911492",
            "sentiment_compound": -0.128
        },
        {
            "id": "h6055hs",
            "score": 1,
            "text": "Regardless what my government does, this is a global problem and if the worst offenders (China/us/India etc) are not working together for a common goal, what is the point of me making drastic changes to my lifestyle?",
            "title_similarity": "0.48458773",
            "sentiment_compound": -0.8519
        },
        {
            "id": "h60598k",
            "score": 1,
            "text": "But but but the Paris accords!",
            "title_similarity": "0.3086388",
            "sentiment_compound": 0.0
        },
        {
            "id": "h605c11",
            "score": 1,
            "text": "Part of the reason I moved from the south of England to the north of England is because it's usually a couple of degrees cooler and we've been told for decades now that everything will be getting warmer in the near future.\n\nThe fact that most people in richer countries are yet to do something like this suggests that most people really haven't been paying attention.",
            "title_similarity": "0.5274458",
            "sentiment_compound": 0.8107
        },
        {
            "id": "h605cxi",
            "score": 2,
            "text": "Ah well earth it has been a good run.",
            "title_similarity": "0.05429422",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h605dw8",
            "score": 1,
            "text": "Everyone’s seemingly looking for one solution. We need to implement everything we can now. There are things that can be done and not make more trouble for the disabled.",
            "title_similarity": "0.18869975",
            "sentiment_compound": 0.5824
        },
        {
            "id": "h605fyw",
            "score": 2,
            "text": "Anyone else feel hopelessly depressed? Any tips to enjoy my life anymore are appreciated. Thanks.",
            "title_similarity": "0.18894386",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h605thj",
            "score": 1,
            "text": "They keep saying this is probably the last decade to make a real difference before there’s no real going back.",
            "title_similarity": "0.5437223",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6069fq",
            "score": 2,
            "text": "but my friends and family just continue saying iT'S a CyCLe",
            "title_similarity": "0.19990006",
            "sentiment_compound": 0.631
        },
        {
            "id": "h6069r2",
            "score": 2,
            "text": "The mid 21st Century is gonna be bad if we're being realistic. Let's hope it doesn't get worse.",
            "title_similarity": "0.51051193",
            "sentiment_compound": 0.2392
        },
        {
            "id": "h606d2o",
            "score": 1,
            "text": "um, but several places on earth have already far surpassed 1.5.  Is a simple average really what we should be looking at.\n\nConsidering that the places that have risen far above 1.5 hold things like greenhouse gases and ice, I should think not.",
            "title_similarity": "0.5679945",
            "sentiment_compound": 0.5023
        },
        {
            "id": "h606ekx",
            "score": 1,
            "text": "One of the biggest way you can help is by going vegan, people don't like to hear it but it's true \n\nhttps://www.independent.co.uk/life-style/health-and-families/veganism-environmental-impact-planet-reduced-plant-based-diet-humans-study-a8378631.html\n\nRelated, the meat industry is the leading cause of deforestation in the Amazon, and other forests worldwide\n\nhttps://www.greenpeace.org/usa/forests/issues/agribusiness/",
            "title_similarity": "0.4151346",
            "sentiment_compound": 0.7223
        },
        {
            "id": "h606hrh",
            "score": 1,
            "text": "Press X to doubt. Man made climate change is real but it’s never as extreme as these shocking reports say",
            "title_similarity": "0.4404409",
            "sentiment_compound": -0.6903
        },
        {
            "id": "h606iii",
            "score": 2,
            "text": "We are heading towards societal collapse, the very future of our species is at risk.",
            "title_similarity": "0.4906593",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h606tih",
            "score": 1,
            "text": "When they write \"by 2050\" I want to cry. That is way too late.",
            "title_similarity": "0.5086605",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h607bq5",
            "score": 1,
            "text": "Please just stop allowing people over age 65 or something to vote or be leaders. Like why are people who won't even see the long term consequences the ones with the most voting power...",
            "title_similarity": "0.36032394",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h607d3e",
            "score": 1,
            "text": "Unless you are in the US in the Republican party, then it's all lies and liberal agenda.",
            "title_similarity": "0.39040637",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h607koo",
            "score": 1,
            "text": "Good. I want to wqtch all the republicans in southern us states suffer.  Bye bye florida! Get fucked!",
            "title_similarity": "0.40455365",
            "sentiment_compound": -0.7418
        },
        {
            "id": "h608cbr",
            "score": 1,
            "text": "And no amount of CO2 we eliminate will change that.  Decrease pollution and better garbage management. Help more people out of poverty.  \nListen to Bjorn Lomberg",
            "title_similarity": "0.3118312",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h608rst",
            "score": 1,
            "text": "Well if the world collectively cracked down on super polluters and adopted more nuclear energy to flatten this curve until renewables reach a sustainable margin, maybe we could not all roast to death on this rock we inhabit.",
            "title_similarity": "0.5109133",
            "sentiment_compound": 0.1477
        },
        {
            "id": "h608szg",
            "score": 1,
            "text": "can someone smarter than me draw this out in an Analogy using a Significant other?",
            "title_similarity": "0.21334523",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h608xr5",
            "score": 1,
            "text": "2012 is releasing in 2023 after a delay due to unforeseen circumstances\n\nWatch it unfold at a beach / mountain / river / forest near you",
            "title_similarity": "0.5322339",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h609709",
            "score": 1,
            "text": "So how does this factor in with the last 20 years of fantasizing about reducing overpopulation on the earth?",
            "title_similarity": "0.6954199",
            "sentiment_compound": 0.0
        },
        {
            "id": "h609m3m",
            "score": 1,
            "text": "Wasnt New York supposed to be under water by now?",
            "title_similarity": "0.37466663",
            "sentiment_compound": 0.0
        },
        {
            "id": "h609mer",
            "score": 1,
            "text": "How much did the temp drop last year from everyone being in lockdown ? If climate change is from humans it had to drop",
            "title_similarity": "0.6645523",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h609rvh",
            "score": 1,
            "text": "Lets stop consuming animal products. Animal agriculture is a major contributor to global warming.",
            "title_similarity": "0.47828788",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h609wol",
            "score": 3,
            "text": "If we pass the tipping point we’re fucked no matter what we do right?",
            "title_similarity": "0.3285492",
            "sentiment_compound": -0.6677
        },
        {
            "id": "h60a54o",
            "score": 1,
            "text": "Can we stop using the phrase **Climate Change**? It doesn’t hold the gravitas the term needs.  \n  \n**Climate Collapse** sounds closer to the societal devastation I’ll see in my lifetime.",
            "title_similarity": "0.56319696",
            "sentiment_compound": -0.802
        },
        {
            "id": "h60aa4o",
            "score": 1,
            "text": "Frankly I think we need nuclear. SMRs solve much of the hurdles of nuclear we just need a bit of money and political will to switch. Nuclear far outperforms renewables but is still carbon neutral.",
            "title_similarity": "0.43734455",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h60adq5",
            "score": 2,
            "text": "It's going to be hard to do.  We need to slow our consumption.",
            "title_similarity": "0.30329618",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h60akuk",
            "score": 1,
            "text": "I'm excited to see my uncles opinion on this via facebook.",
            "title_similarity": "0.3441553",
            "sentiment_compound": 0.34
        },
        {
            "id": "h60am4c",
            "score": 1,
            "text": "Imagine having the world literally burn...and meanwhile...billionaires are concerned for who can reach space first for 5 flicking minutes. \n\nNot even a science expedition. Just absolute flex.",
            "title_similarity": "0.6905393",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h60apk4",
            "score": 1,
            "text": "What is frustrating is how there are still a lot of (a certain type of) people that say that it is a hoax.. a scam. Apparently renewable energy is a huge money making scheme and no, you are not going to take their giant tailpipe trucks any time soon! And proof is that hundreds of thousands of years ago CO2 rose.. and there were heat variances and it's just mother nature and there is no way mankind can have an impact on an entire planet, and blahblahblah etc.\n\nBetween ignorant humans and gas and oil companies and bought politicians, it's tough to get anything done. Part of the problem is that it is not a 4 or an 8 year fix, and so the political landscape keeps scrapping efforts when a new President moves into the office (in the U.S.) - while in other countries, some have no interest in being part of the solution. And many others are just hitting their CO2 emission stride progress-wise.\n\nUphill battle.. and not even droughts, massive wildfires, crazy weather and towns burning down seem to be doing a thing. After all, your oil CEOs are sitting comfy in their homes, they couldn't care less what the impact is on those who actually don't have the means to deal with the fall out. I don't understand why so many humans are still so willingly ignorant on this topic.",
            "title_similarity": "0.4937536",
            "sentiment_compound": -0.9594
        },
        {
            "id": "h60aqsm",
            "score": 1,
            "text": "1.5⁰C that's a lot, or not that much.... I'm American, I have no idea.",
            "title_similarity": "0.36222684",
            "sentiment_compound": -0.296
        },
        {
            "id": "h60au62",
            "score": 1,
            "text": "It’s no longer global warming or climate change. It’s a climate emergency. We are screwed. A large habitable area of the planet won’t be that way soon. We got maybe like 50-100 years before a massive collapse.  Sorry children.",
            "title_similarity": "0.68484306",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h60b2r7",
            "score": 1,
            "text": "Boy am I glad I don't have kids.  I sure feel terrible for the ones who are around.  I just do not have hope that humanity as a whole will do anything significant.",
            "title_similarity": "0.23478733",
            "sentiment_compound": 0.1516
        },
        {
            "id": "h60b2wj",
            "score": 1,
            "text": "I dont care until John Kerry, Obama and al gore sell their third homes that are directly on the coast.",
            "title_similarity": "0.45871174",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h60b5w8",
            "score": 1,
            "text": "Hmm maybe we should try to design a device or material that can absorb then reconvert ambient heat to chemical or electrical energy",
            "title_similarity": "0.25101858",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h60bb1i",
            "score": 1,
            "text": "Don't have kids folks",
            "title_similarity": "0.05704886",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60bbm6",
            "score": 1,
            "text": "Adult people still try to find any excuse to hate on a child dare to speak out to the world's leaders, ask them to listen scientists and do something about it so next generation like her don't have to fight & suffer when they grow up, so i don't have much hope really.\n\nThe way they speak badly about her is really disturbing.",
            "title_similarity": "0.36314318",
            "sentiment_compound": -0.9012
        },
        {
            "id": "h60bcgc",
            "score": 1,
            "text": "I think you should all be more concerned about the dwindling  potable drinking water situation",
            "title_similarity": "0.33268586",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60bkbc",
            "score": 1,
            "text": "Fearmongering or not, the world is getting harsher every year in both extremes, and we aren’t doing anything to help it. Soon it will be too hot for us and people will start dying as a direct result",
            "title_similarity": "0.52777135",
            "sentiment_compound": -0.128
        },
        {
            "id": "h60br3l",
            "score": 1,
            "text": "As you may know many, many towns in Western Germany suffered catastrophic flooding last week, with 160+ dead so far. \nWe also have an election in two months‘ time. The likely replacement for chancellor (because my fellow countrymen are idiots) said „Just because something like this happens, you don‘t go changing your policies in a whim.“\n\nWe‘re doomed, basically.",
            "title_similarity": "0.5892549",
            "sentiment_compound": -0.9246
        },
        {
            "id": "h60bs7u",
            "score": 1,
            "text": "The language needs to change, people keep using terms like 'heading toward' or projected rise.\n\nIt Has Happened, but as long as we deny it and pretend it's not a problem YET then we will continue on with the destruction full tilt",
            "title_similarity": "0.28069085",
            "sentiment_compound": -0.728
        },
        {
            "id": "h60bwvv",
            "score": 1,
            "text": "Nope game over deal with the heat",
            "title_similarity": "0.22328404",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60byf6",
            "score": 1,
            "text": "Food industry is just as bad… nobody wants to stop eating meet though and no politician will take it on.",
            "title_similarity": "0.26514095",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h60c213",
            "score": 1,
            "text": "Not like anything is gonna be done about it. The world moves a snails pace politically and since we still have a monetary system dictating how we live we are never going to do anything that forces us to give up our precious profits.\n\nMoney has ruined us as a people.",
            "title_similarity": "0.35259286",
            "sentiment_compound": 0.3378
        },
        {
            "id": "h60c4lx",
            "score": 1,
            "text": "Since this isn't r/collapse I'll suggest something other than nuking the 3rd world...why hasn't someone brought up the idea of building a huge smokestack to vent greenhouse gasses into space?",
            "title_similarity": "0.42456785",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h60c80y",
            "score": 1,
            "text": "Well it was good knowing you all",
            "title_similarity": "-0.03768374",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h60c983",
            "score": 1,
            "text": " Most of the people on the internet and Reddit etc work for companies that destroy the planet on daily basis.",
            "title_similarity": "0.45948967",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h60cg3i",
            "score": 1,
            "text": "They say this every 5 years",
            "title_similarity": "0.60962427",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60cp37",
            "score": 1,
            "text": "I'd prefer the earth just burns up",
            "title_similarity": "0.23511995",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60cpva",
            "score": 1,
            "text": "Until the billionaires don't lose power and have water in their living room nothing will change.\n\nWhen the greedy suck the Earth and it's people dry they will whine for someone to fix the problem.",
            "title_similarity": "0.4203061",
            "sentiment_compound": -0.7988
        },
        {
            "id": "h60d7n0",
            "score": 1,
            "text": "Nice, I’m not even going to make it to 30",
            "title_similarity": "0.36779025",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h60e36j",
            "score": 1,
            "text": "- Ralph Wiggum\n“I’m in danger.”",
            "title_similarity": "0.19279893",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60ea1r",
            "score": 1,
            "text": "Nobody really mentions that the climate crisis is caused historically, by human desire. We humans have so much desire. Always wanting more. We exchange our time and freedom for money to buy more things and those with most money are the least satisfied. The global economy is run on desire. We call it the economics of demand but really it’s desire. \n\nThings will never improve until we are able to limit or change the nature of our desire. We can desire other more interesting things than useless objects that fill our lives and homes and pollute our planet.",
            "title_similarity": "0.35748148",
            "sentiment_compound": 0.7664
        },
        {
            "id": "h60eam1",
            "score": 2,
            "text": "Sacrifice the oil companies to the gods like the Mayans",
            "title_similarity": "0.3821261",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h60efd5",
            "score": 1,
            "text": "What can I do about this myself?",
            "title_similarity": "0.10098864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60ey8z",
            "score": 2,
            "text": "We knew about this 30 years ago. No one did anything. Hi ho. So it goes.",
            "title_similarity": "0.32229668",
            "sentiment_compound": -0.296
        },
        {
            "id": "h60eyfr",
            "score": 1,
            "text": "Now would be a great time for those Aliens to come out and tell us if we're either fucked or if they have some possible solutions for us. \n\nPeople: What should we do? \n\nAlien: Leave your planet, that's what we did. Hence the reason we're here. \n\nPeople: Can we go live on your planet? \n\nAlien: What planet?",
            "title_similarity": "0.37936586",
            "sentiment_compound": 0.1877
        },
        {
            "id": "h60f2jt",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.1334734"
        },
        {
            "id": "h60fo7e",
            "score": 1,
            "text": "To those wondering, that’s an extra 34.7 degree Fahrenheit",
            "title_similarity": "0.5520859",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60fvn5",
            "score": 5,
            "text": "We need to make this a top priority in elections. No other issue matters as much as this now.",
            "title_similarity": "0.23032242",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h60g5bz",
            "score": 1,
            "text": "How does one prepare for something like this",
            "title_similarity": "0.13345756",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h60g5go",
            "score": 2,
            "text": "We passed the tipping point 5 years ago.  If we went carbon neutral today global warming would continue for the next 500 years.  We needed to go carbon negative a year ago.",
            "title_similarity": "0.82254463",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h60gfd6",
            "score": 1,
            "text": "Sooll were gonna be fucked in the next 5 years basically? \nSorry just skimmed the article.",
            "title_similarity": "0.76688063",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h60gkjd",
            "score": 2,
            "text": "*Proceeds to sort by controversial",
            "title_similarity": "0.19985995",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h60grqx",
            "score": 1,
            "text": "My whole life has been punctuated by these increasingly catastrophic warnings :(",
            "title_similarity": "0.37482584",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h60gynt",
            "score": 1,
            "text": "We're all going to die, aren't we?",
            "title_similarity": "0.3901595",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h60h8lp",
            "score": 1,
            "text": "It has gotten to the point where we will need drastic action to force politicians to take climate change seriously.  We need to organize protests that block fossil fuel business entrances (offices, coal mines, gas stations, etc).  Politicians will never take this seriously unless we put massive amounts of pressure on them by forcing their rich donors to lose money.",
            "title_similarity": "0.47990412",
            "sentiment_compound": -0.7701
        },
        {
            "id": "h60h8v7",
            "score": 1,
            "text": "Well so what? Its not like it's the only planet we got",
            "title_similarity": "0.22486934",
            "sentiment_compound": -0.0026
        },
        {
            "id": "h60hhsp",
            "score": 1,
            "text": "The future will not look at us kindly",
            "title_similarity": "0.20703259",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h60hjjj",
            "score": 1,
            "text": "There's that funny feeling.",
            "title_similarity": "0.09290989",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h60hqrs",
            "score": 1,
            "text": "We are properly fucked.",
            "title_similarity": "0.0921351",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h60hr5o",
            "score": 1,
            "text": "But I bet all of you here will still drive this weekend to party.",
            "title_similarity": "0.3529855",
            "sentiment_compound": 0.5499
        },
        {
            "id": "h60hs89",
            "score": 1,
            "text": "My problem is everyone is quick to point their fingers at external forces (companies, governments, other nations and other peoples).\nThis is each and every one of our faults from every conscious and subconscious action we make every single day. \nEvery single choice we do through out our day is moving us further and further into oblivion. Stop looking to blame anyone but your self for the choices and actions you take every single day and start doing something to stop what we are all doing.",
            "title_similarity": "0.3703454",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h60hy4g",
            "score": 1,
            "text": "There is a pretty good documentary about tipping points on Netflix called Breaking Boundaries: the science of our plant that outlines a plan, at least at a high level.",
            "title_similarity": "0.38839155",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h60i1wz",
            "score": 1,
            "text": "The permafrost in Russia is melting. People live very convienent lives and we all know we have to take a backwards step to help combat climate change. Convincing people to do that will be almost impossible.",
            "title_similarity": "0.55200887",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h60ibur",
            "score": 1,
            "text": "Honestly at this point I've just given up. It's happening, there's no stopping it by this stage.",
            "title_similarity": "0.2470441",
            "sentiment_compound": 0.5337
        },
        {
            "id": "h60ierr",
            "score": 1,
            "text": "No one will care until parts of the middle east, become utterly uninhabitable and a great migration occurs.\n\nOnce people who aren't white are breaking down the borders, people will suddenly wonder why no one took climate change seriously in the first place.",
            "title_similarity": "0.45429754",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h60il3t",
            "score": 1,
            "text": "Do you think the lower birth rate will help?",
            "title_similarity": "0.33786917",
            "sentiment_compound": 0.128
        },
        {
            "id": "h60iocf",
            "score": 1,
            "text": "I bet nothing changes in the next 5 years in favor of fixing this, I would be an adult by that time with job and I'm thinking of offing myself if it really gets worse. No use living on a planet with lots of responsibilities whilst it is burning and everything around my collapsing. All the while people with the power of issuing change are still in it for economy. What a life.",
            "title_similarity": "0.65258944",
            "sentiment_compound": -0.6533
        },
        {
            "id": "h60iqzt",
            "score": 1,
            "text": "From Ohio and it sure seems like we're having one of the coolest summers we've had in a long time.  Just saying.",
            "title_similarity": "0.43099362",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h60ir6l",
            "score": 1,
            "text": "Make a study on how to get anti-science believers to actually care or listen to a study. How is that not the most important type of studies right now? Yeah everything is being destroyed including peoples minds, you have to fix the minds first to get anything done.",
            "title_similarity": "0.38352168",
            "sentiment_compound": 0.1005
        },
        {
            "id": "h60itmw",
            "score": 1,
            "text": "Remember at 2 degrees we lose.",
            "title_similarity": "0.3672974",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h60iykv",
            "score": 1,
            "text": "People might believe them if they stop saying that every year is a tipping point.",
            "title_similarity": "0.5286262",
            "sentiment_compound": -0.296
        },
        {
            "id": "h60j0yo",
            "score": 1,
            "text": "Great. Human arrogance and stupidity comes to kill us all.",
            "title_similarity": "0.30649158",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h60j41o",
            "score": 1,
            "text": "We are at war with stupid people.",
            "title_similarity": "0.20468819",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h60jfuz",
            "score": 1,
            "text": "We've been tipped for a while, why is this news?",
            "title_similarity": "0.31348443",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60jx36",
            "score": 1,
            "text": "It’s like your alarm clock going off in the morning and we keep hitting snooze.",
            "title_similarity": "0.46041906",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h60jxqq",
            "score": 1,
            "text": "Bruh, we're already at the tipping point. This article is 10 years too late.",
            "title_similarity": "0.58369744",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60jzw8",
            "score": 1,
            "text": "It is depressing, to say the least, that we have let things get so bad. I've read the, \"There's Hope\" articles but I believe that too many people have and will keep their head buried. It really makes me sad",
            "title_similarity": "0.32439512",
            "sentiment_compound": -0.7987
        },
        {
            "id": "h60k5up",
            "score": 3,
            "text": "We need to embrace nuclear energy on a massive scale. At this point, I honestly think that anyone who claims they are \"green\" or an \"environmentalist\" and is anti-nuclear is either disingenuous or delusional. Especially since, fossil fuels aside, nuclear power seems a lot more environmentally benign than damming up rivers or covering vast swathes of land with wind turbines or solar panels/mirrors. Just to give you an idea of how inefficient and land hungry renewables are: the largest solar farm- the Noor Power Station in Morocco- has an area of *25 square kilometres* and only generates about 500 Megawatts of electricity. The average nuclear power plant needs about 2.5 square kilometres of land and generates about one gigawatt of electricity. That's just how bad solar is—wind power is much, much worse in terms of energy density.",
            "title_similarity": "0.4463212",
            "sentiment_compound": 0.539
        },
        {
            "id": "h60k6rf",
            "score": 1,
            "text": "Let this be a friendly reminder to NOT CREATE NEW HUMAN LIFE. At this point anyone born will live a terrible live of depression and anxiety and will die before they even hit 40 due to malnutrition or environmental disasters. \n\nNo one with the ability to stop this cares a single ounce about saving the planet. Most of the uber wealthy are looking into just leaving the planet entirely at this point.",
            "title_similarity": "0.4783994",
            "sentiment_compound": -0.8739
        },
        {
            "id": "h60kb1x",
            "score": 1,
            "text": "So we are all just going to die of climate change then?",
            "title_similarity": "0.57024",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h60kp6m",
            "score": 1,
            "text": "It’s almost like this is our destiny though. Ever since man discovered and harnessed fire we have been on the fast track to our demise.",
            "title_similarity": "0.46373218",
            "sentiment_compound": -0.0498
        },
        {
            "id": "h60kqpa",
            "score": 1,
            "text": "At this point I stopped worrying. Its us against the world. Enjoy life as long as we can and thats all.",
            "title_similarity": "0.12504433",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h60kuus",
            "score": 1,
            "text": "Anyone notice all the floods happening all over the world?\n\nShits crazy.",
            "title_similarity": "0.38336802",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h60kxwd",
            "score": 1,
            "text": "It was like yay restrictions are over then noooo back inside it’s to hot!",
            "title_similarity": "0.35663778",
            "sentiment_compound": 0.7345
        },
        {
            "id": "h60l1m2",
            "score": 1,
            "text": "It sucks that it seemingly doesn't matter how many times they tell everyone this.",
            "title_similarity": "0.22386469",
            "sentiment_compound": -0.3765
        },
        {
            "id": "h60lahk",
            "score": 1,
            "text": "We should all just go lay in the garden.",
            "title_similarity": "0.08260907",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60lgby",
            "score": 1,
            "text": "As long as our governments and major influencers - billionaires - (and therefore we) think money and power is more important than a sustainable earth…..then things don’t look so good",
            "title_similarity": "0.41718945",
            "sentiment_compound": 0.7035
        },
        {
            "id": "h60lkgo",
            "score": 1,
            "text": "Can we make it mandatory for anyone applying to be a politician have background knowledge in different fields outside of law? Particularly science backgrounds so none of this back and forth ego flinging conflict.",
            "title_similarity": "0.2540891",
            "sentiment_compound": -0.25
        },
        {
            "id": "h60ly36",
            "score": 2,
            "text": "Might be time to move away from the coast.",
            "title_similarity": "0.19192165",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60lywz",
            "score": 1,
            "text": "We're fucked. Take drugs do crime.",
            "title_similarity": "0.21991538",
            "sentiment_compound": -0.836
        },
        {
            "id": "h60m442",
            "score": 1,
            "text": "\"Drastic measures\" will be impossible to implement without shutting down the society, and even those will not solve climate change, just slow it down by a bit. Governments need to ensure industrial agriculture is safe from temperature change and collapsing ecology. Millions dying from heatwave and storms is a tragedy, but a tragedy that we move on from. Collapse of agriculture spells out extinction.",
            "title_similarity": "0.52619976",
            "sentiment_compound": -0.9223
        },
        {
            "id": "h60m84o",
            "score": 1,
            "text": "So we should have more billionaires go to space?",
            "title_similarity": "0.38558424",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60manc",
            "score": 1,
            "text": "Huh? My local Republican told me climate change isn’t real cause it snowed one time. I’m confused.",
            "title_similarity": "0.50739217",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h60mewc",
            "score": 1,
            "text": "hell yea turn up the heat\n\nwe're fucked hahaha",
            "title_similarity": "0.2970277",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h60mgr1",
            "score": 1,
            "text": "That's around 35 degrees for the Fahrenheit users. No, I will not covert to Rankines or Kelvin.",
            "title_similarity": "0.5040835",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60mjci",
            "score": 1,
            "text": "given this summer and last summer, you'd be crazy to deny that there's massive human driven damage on the environment. Like, we've had wildfires on unprecedented scales. How often does the sky turn red? Our hurricane season has been starting earlier than ever and happening in places that don't really get a hurricane season. I live in Ontario and we get about 12 tornadoes a year on average.  We've already had 5 this week. Obviously that's anecdotal but it really bothers me how the \"climate change isn't real/important\" crowed can still keep singing that tune when the effects are happening right in front of us in huge ways. \n\nI know some of this can be explained by el nino and la nina, but we've had record breaking years, year after year. As a reminder, +1.5c is an average. Temperature fluctuation are going to be more intense as you get further north/south.",
            "title_similarity": "0.6281173",
            "sentiment_compound": -0.1406
        },
        {
            "id": "h60mkhf",
            "score": 1,
            "text": "Ok correct me if i am wrong, with 1 degree increase of temperature, there 20% more vapor the atmosphere, that'll bring more floods. but doesnt the vapour also would stop some solar radiation?",
            "title_similarity": "0.64679086",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h60mryi",
            "score": 1,
            "text": "The title is misrepresenting the information stated in the climate update.\n\nThe 1.5 °C  is compared to the average temperature during 1850 to 1900, not the current year.\n\n*\"It is very unlikely (10% chance) that the five-year mean global near-surface temperature for 2021-2025 will be 1.5°C warmer than* ***pre-industrial*** levels\"\n\n\"***Pre-industrial*** *conditions are defined as the average over the period 1850 to 1900,\" pg. 2*\n\nI find it necessary that we need to spread awareness and dramatize what the consequences would be if we do not take action soon. But I do not stand with lying to the public in order to convince them.\n\nTo an outsider, this only makes us look like a religious person who says that god will destroy the earth soon, unless we start believing in him.",
            "title_similarity": "0.7522604",
            "sentiment_compound": 0.8199
        },
        {
            "id": "h60mtcn",
            "score": 1,
            "text": "Germany, the US and China have all had flashfloods in the last 7-10 days. California, Australia and Cape Town get annual devastating fires. IMO, the weather has been changing and deteriorating since the Thailand tsunami of 2006.",
            "title_similarity": "0.6586794",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h60mxah",
            "score": 2,
            "text": "The truly bad news is that we’ve entered an era where right-wing ideologies, populism, click bait journalism, and a general sentiment of anti-intellectualism is making any form of progressive and scientifically based changes tremendously difficult. Like ffs, just look at how people react when they’re being told to wear a mask during a pandemic. Now imagine the societal shitstorm if we would see severe restrictions for meat consumption or the purchase of fashion.",
            "title_similarity": "0.4379788",
            "sentiment_compound": -0.8062
        },
        {
            "id": "h60ndh4",
            "score": 1,
            "text": "People like to think that Global Warming and Climate Change are these problems that are on there way if we don't act that.  That in 20 years from now we'll have consequences if we don't reign in our recklessness.  The fact is that we are living it.  We are in climate change.  These wild fires.  These droughts.  These summer snow storms.  Blizzards in Texas.  Stronger hurricanes.  Emergent diseases.\n\nWe are the frog slowly boiling as everyone just gets used to the new normals.",
            "title_similarity": "0.6710204",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h60nlz3",
            "score": 1,
            "text": "Planets blow up all the time. We’re just a tiny spec. It’s been real, y’all. Love you.",
            "title_similarity": "0.30403262",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h60ntpp",
            "score": 1,
            "text": "Suicide in slow motion",
            "title_similarity": "0.26543105",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h60nyd0",
            "score": 1,
            "text": "Working at sunlight everyday \nIt's very bad. I think I'm losing my mind",
            "title_similarity": "0.35479003",
            "sentiment_compound": -0.7501
        },
        {
            "id": "h60oavv",
            "score": 1,
            "text": "We’re in the endgame now",
            "title_similarity": "0.29684538",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60obs1",
            "score": 1,
            "text": "The sky is falling the sky is falling",
            "title_similarity": "0.2593742",
            "sentiment_compound": -0.296
        },
        {
            "id": "h60ogzn",
            "score": 1,
            "text": "Why are the top comments being removed",
            "title_similarity": "0.19370112",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h60ohio",
            "score": 1,
            "text": "It will.\n\nAmerica's corporate greed and culture are left unchecked in terms of negatively impacting the environment. It's just not a priority. Legislation is so insanely controlled by private corporate interest through lobbying. \n\nCapitalism is unbridled greed at the expense of the public good.",
            "title_similarity": "0.30173957",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h60okob",
            "score": 1,
            "text": "They Said that 5 years ago",
            "title_similarity": "0.55170035",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60olxn",
            "score": 1,
            "text": "Getting children at this point is kinda bad for them.",
            "title_similarity": "0.22200078",
            "sentiment_compound": -0.4951
        },
        {
            "id": "h60op5o",
            "score": 1,
            "text": "Listen to my plan. We are done for folks humanity's time has passed.\n\nWe must pool every resource and every currency so that we can party hard for 15-20 years. After that? Shows over, every human for themselves.\n\nLet's go out with a bang rather than the inevitable mass migrations and resource wars.",
            "title_similarity": "0.53880477",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h60owlr",
            "score": 1,
            "text": "See y’all in hell. I always that that was metaphorical but I guess not",
            "title_similarity": "0.26852077",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h60p365",
            "score": 1,
            "text": "What’s something an individual can do to help?",
            "title_similarity": "0.0054715388",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h60paec",
            "score": 1,
            "text": "We didn't start the fire! It was always burning since the world's been turning!",
            "title_similarity": "0.34555095",
            "sentiment_compound": 0.3859
        },
        {
            "id": "h60pby8",
            "score": 1,
            "text": "I think we can get over 1.5c it in less than 5 years if we try, lets all work together!",
            "title_similarity": "0.7265457",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60pci6",
            "score": 2,
            "text": "People won't listen to scientists when they tell them to go get a shot so they won't die, how are the scientist supposed to get big corporations to stop polluting the air with CO2?",
            "title_similarity": "0.39176333",
            "sentiment_compound": 0.2981
        },
        {
            "id": "h60pggw",
            "score": 1,
            "text": "Time to smoke a j and try to get your kicks before the whole thing goes up in the flame",
            "title_similarity": "0.2314677",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60pm66",
            "score": 1,
            "text": "For a bit of nuance, it's worth pointing out that this is about a TEMPORARY rise for maybe a year or so (for now...) rather than the oft-spoken of \"1.5 target\" which is the average over 30 years^(\\[1\\]) ^((my understanding is it includes the past 15 years, and the next 15 year estimates based on current trends))\n\nIt says in the main posted article as much too:\n\n>The head of seasonal to decadal prediction at the Met Office, professor Adam Scaife, has commented on the update: “***Assessing the increase in global temperature in the context of climate change refers to the long-term global average temperature, not to the averages for individual years or months.*** Nevertheless, a temporary exceedance of the 1.5-degree level may already be seen in the next few years.”\n\nThis was also published at the end of May so I'm not sure why it's suddenly here today but meh.\n\nIt's alarming news, no doubt about that, but this is an important caveat that seems to be glossed over by the headline.\n\n^(\\[1\\]:) [^(Global warming: The estimated increase in GMST averaged over a 30-year period, or the 30-year period centred on a particular year or decade, expressed relative to pre-industrial levels unless otherwise specified. For 30-year periods that span past and future years, the current multi-decadal warming trend is assumed to continue. {1.2.1)](https://www.ipcc.ch/sr15/chapter/spm/)^(})",
            "title_similarity": "0.7406709",
            "sentiment_compound": 0.8361
        },
        {
            "id": "h60pnhq",
            "score": 1,
            "text": "The desire for profit created pollution...and we are the customers. We paid for this situation. It’s ours now.",
            "title_similarity": "0.26275143",
            "sentiment_compound": 0.765
        },
        {
            "id": "h60pslh",
            "score": 1,
            "text": "Unrestrained capitalism does NOT work",
            "title_similarity": "0.19844681",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60pzj3",
            "score": 2,
            "text": "If temps are rising can we all walk around in the nude?",
            "title_similarity": "0.2967512",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60q4fd",
            "score": 1,
            "text": "How many tipping points till Bazos leaves for good?",
            "title_similarity": "0.4691793",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h60q4pw",
            "score": 1,
            "text": "Good thing this only affects countries that use the metric system.",
            "title_similarity": "0.2399256",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h60q7g1",
            "score": 1,
            "text": "Let's go capitalism! Hey but at least billionaires are going to space.",
            "title_similarity": "0.4382962",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60qaw4",
            "score": 1,
            "text": "If only someone had told us this would happen! Oh wait...",
            "title_similarity": "0.19482535",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60qh9o",
            "score": 1,
            "text": "I live in New York City and we’ve had heavy thunderstorms and rain multiple times a week. I have never seen so much rain in July.\n\nYesterday when I was riding my bike my throat started to hurt from the smoke - smoke from wildfires out West.",
            "title_similarity": "0.5270163",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h60qr72",
            "score": 1,
            "text": "The first end of the world for me was 2000. Every few years a researcher is awarded for a new date.",
            "title_similarity": "0.65771127",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h60qukf",
            "score": 1,
            "text": "So this is how it ends huh?",
            "title_similarity": "0.14029376",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60qv8t",
            "score": 1,
            "text": "Most humans don't care, don't believe, too busy surviving. We are hooped.",
            "title_similarity": "0.14158759",
            "sentiment_compound": -0.1758
        },
        {
            "id": "h60qvqo",
            "score": 1,
            "text": "Guys it’s all good, just go to Costco and buy some carbon credits.",
            "title_similarity": "0.31417882",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h60rgs3",
            "score": 1,
            "text": "Well if Covid-19 show us something is that people will deny something bad even if they caught it",
            "title_similarity": "0.22893423",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h60ri5t",
            "score": 1,
            "text": "I was thinking what I could do about this and have decided that blaming corporations on Reddit is probably the best. That way I can keep my truck.",
            "title_similarity": "0.34088686",
            "sentiment_compound": 0.25
        },
        {
            "id": "h60rkjt",
            "score": 1,
            "text": "It's already too hot. Haven't had a snowy winter in England for like 10 years. Not to mention how stupidly hot its been in summer.",
            "title_similarity": "0.53795373",
            "sentiment_compound": -0.128
        },
        {
            "id": "h60rnzv",
            "score": 1,
            "text": "The COVID economy is here to stay.  Our way of life is rapidly changing and it needs too for both COVID and Climate Change.  I have no idea why WFH and cuts on excessive business travel didn't happen sooner.  People are living in the past.",
            "title_similarity": "0.5483679",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h60rpa9",
            "score": 1,
            "text": "“Earth heads for its tipping point…”\nOMG that’s it\n\nNormalize calling environmentalists EarthHeads so we can have more credibility in hypebeast circles",
            "title_similarity": "0.4686708",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60s6xx",
            "score": 1,
            "text": "I was thinking to myslef yesterday how  we are heading for eco-fascism. The people of the poor south will try to go to the rich north and as always we will shut our borders. Millions will die while the most responsible for it won't even notice. As with the previous migrant wave, we will see the rise of the far-right and hate hate against foreigners.",
            "title_similarity": "0.5077772",
            "sentiment_compound": -0.8484
        },
        {
            "id": "h60skim",
            "score": 1,
            "text": "When I said we should just burn it all down and start over I wasn't being literal",
            "title_similarity": "0.22503115",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60soob",
            "score": 1,
            "text": "Earth is going to turn into Roblox Survive The Disasters",
            "title_similarity": "0.5034057",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h60souc",
            "score": 1,
            "text": "Thinking about this future really scares me to live on earth. Like I’m actually scared. But I don’t know what I can do other than get an electric car and try to be an activist on this issue.",
            "title_similarity": "0.39325804",
            "sentiment_compound": -0.2609
        },
        {
            "id": "h60sxhc",
            "score": 1,
            "text": "The people popping out kids left and right should really consider this.",
            "title_similarity": "0.14071353",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60syxp",
            "score": 1,
            "text": "But you know, 2 billionaires just went to space.  So that’s cool",
            "title_similarity": "0.381129",
            "sentiment_compound": 0.5216
        },
        {
            "id": "h60syzh",
            "score": 2,
            "text": "The way I see it is there inevitably be great destruction, global chaos and social collapse. Then some population of humans if we are not complete wiped out will emerge, living in harmony with the planet and either  technologically very advanced able to heal ecological damage restore ecosystems or very primitive! Alternatively everything will die and earth may gradually restore its balance but without humans!",
            "title_similarity": "0.52511275",
            "sentiment_compound": -0.5701
        },
        {
            "id": "h60szxe",
            "score": 1,
            "text": "Remember when they were looking at this as like 20+ years out?",
            "title_similarity": "0.5392033",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h60t8gc",
            "score": 2,
            "text": "I can not fathom anyone who can openly deny climate change at this point\n\nI mean it literally is happening in real time....like hell the PNW had its hottest summer in recorded history \n\nlast year we had the biggest wild fire....in recorded history \n\nthe floods in China and Europe are devastating \n\nhell clams were boiled alive in pugent sound ...",
            "title_similarity": "0.6260667",
            "sentiment_compound": -0.936
        },
        {
            "id": "h60tjli",
            "score": 1,
            "text": "It was too late 10+ years ago.  \n\nI'm making plans for my family 20 years from now.",
            "title_similarity": "0.63290954",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60tu8g",
            "score": 2,
            "text": "How we all used to laugh at Dr Guy McPherson.\n\nHorrific that the doomers may have been entirely correct.",
            "title_similarity": "0.28700936",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h60tvix",
            "score": 1,
            "text": "quite exciting news.  I always wanted to be part of the generation that sees the world end, go ahead and lie and say you aren't selfish too.",
            "title_similarity": "0.3277266",
            "sentiment_compound": 0.7225
        },
        {
            "id": "h60ubg8",
            "score": 1,
            "text": "The beach is going to be very popular over the next decade especially since we will have a lot more waterfront properties.",
            "title_similarity": "0.42574358",
            "sentiment_compound": 0.4754
        },
        {
            "id": "h60up2t",
            "score": 1,
            "text": "Nobody alarmed , like frogs boiling slowly literally",
            "title_similarity": "0.15014566",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h60upey",
            "score": 1,
            "text": "I think people need to understand that we as consumers give these large companies the power to pollut our planet. Cut the money to these corporations and watch how fast things change.",
            "title_similarity": "0.44095528",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h60uugx",
            "score": 1,
            "text": "Very well. I will take this into my own hands",
            "title_similarity": "0.051091027",
            "sentiment_compound": 0.3384
        },
        {
            "id": "h60vfmd",
            "score": 1,
            "text": "Feedback loops baby. I don't think we are smart enough to know just how vast the consequences of climate change will be. Entire ecosystems will be completely destroyed. Mass migration. Ocean expansion. Those are just the obvious ones.",
            "title_similarity": "0.5128795",
            "sentiment_compound": -0.2006
        },
        {
            "id": "h60w6s6",
            "score": 1,
            "text": "People reading this: oh my god, we need to do something!\n\nSame people: has multiple children",
            "title_similarity": "0.17169657",
            "sentiment_compound": 0.3382
        },
        {
            "id": "h60x9yf",
            "score": 1,
            "text": "good. i hope it/we burn.",
            "title_similarity": "0.27240226",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h60xkre",
            "score": 1,
            "text": "I wonder how long until the climate can't support human life.",
            "title_similarity": "0.48054883",
            "sentiment_compound": -0.3089
        },
        {
            "id": "h60xm03",
            "score": 1,
            "text": "All I can do is make sure I don't have any children so they don't have to suffer the world humanity has destroyed.",
            "title_similarity": "0.21448702",
            "sentiment_compound": 0.2382
        },
        {
            "id": "h60xnnp",
            "score": 1,
            "text": "as i type this my neighbors mom is cutting down a 30 year old healthy tree.....:(",
            "title_similarity": "0.42213124",
            "sentiment_compound": 0.296
        },
        {
            "id": "h60y8xb",
            "score": 1,
            "text": "There’s too many people. It’s inevitable.",
            "title_similarity": "0.11118105",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60ydcs",
            "score": 1,
            "text": "Does telecommuting solve anything? It seemed like there were news articles about improved temperatures, air quality, and so forth at the start of the pandemic.",
            "title_similarity": "0.5059416",
            "sentiment_compound": 0.7506
        },
        {
            "id": "h60ydo3",
            "score": 1,
            "text": "Oh boy another thing that I can't change to worry about today, thanks reddit.",
            "title_similarity": "0.208568",
            "sentiment_compound": 0.6492
        },
        {
            "id": "h60z31q",
            "score": 1,
            "text": "Why do you think the rich are trying to leave the planet?",
            "title_similarity": "0.3523028",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h60z3c5",
            "score": 1,
            "text": "I’m 36 years old.  I thought I would be really old or dead before it got this bad but it is something I care deeply about, for the future of people and the planet and life here in general.  I remember my elders say “I’ll be long dead, so who cares” and that is exactly why it has gotten this bad this quick.  We haven’t even begun to try and curb our destruction as a species, we’ve known about it and we have done nothing, if anything, we’ve made it even worse.  It is so sad as such an “intelligent” species that we can’t get it together.  I know now that I will definitely see the downfall of the world as we currently know it.  Obviously the earth will survive and in time will heal and I’m sure people will survive, but this cycle on earth is coming to an end.  I do hope if humans can survive that we learn from our mistakes, we have the potential to really be incredible.",
            "title_similarity": "0.469543",
            "sentiment_compound": -0.9728
        },
        {
            "id": "h60zcfi",
            "score": 1,
            "text": "OP is a 2 day old account trying to karma farm.",
            "title_similarity": "0.5101515",
            "sentiment_compound": 0.0
        },
        {
            "id": "h60zd5l",
            "score": 2,
            "text": "Humans are a juggernaut of destruction.",
            "title_similarity": "0.17592138",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h60zgsq",
            "score": 1,
            "text": "Well, it’s been good to know ya",
            "title_similarity": "0.020169366",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h60zuhg",
            "score": 1,
            "text": "Our goal is to not reach 1.5 C. \n\nOk, ok, touching it *one time* shouldn't count, right?... we mean touching it a lot.\n\nOk, ok, seriously. Touching it a few times doesn't really count... we mean being *over* 1.5 and never going under it again... that would be the crossing the line for real.",
            "title_similarity": "0.43467656",
            "sentiment_compound": -0.196
        },
        {
            "id": "h60zwzs",
            "score": 1,
            "text": "Not alarming in the least... Have been expecting this all along... We haven't changed our ways. We can't expect the outcome to change either...",
            "title_similarity": "0.08323392",
            "sentiment_compound": 0.0951
        },
        {
            "id": "h610655",
            "score": 1,
            "text": "What a beautifully formatted article, I must say.",
            "title_similarity": "0.07534448",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h6108nu",
            "score": 1,
            "text": "I'm not a climate change denier by any means but I've been hearing that Earth is heading for it's tipping point for 15 years and I don't care anymore.",
            "title_similarity": "0.5462565",
            "sentiment_compound": -0.636
        },
        {
            "id": "h610k6a",
            "score": 1,
            "text": "I appreciate this article but just look around. Anyone with any semblance of awareness can feel it.",
            "title_similarity": "0.0606618",
            "sentiment_compound": 0.2144
        },
        {
            "id": "h610qwl",
            "score": 1,
            "text": "Welp this further cements my opinion that geoengineering is our only hope.",
            "title_similarity": "0.27838284",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h611a73",
            "score": 1,
            "text": "I was just about to use the boiling frog analogy but it turns out its BS.... Oh well, we are fucked either way",
            "title_similarity": "0.37207162",
            "sentiment_compound": -0.6652
        },
        {
            "id": "h611ci9",
            "score": 1,
            "text": "Anybody interested in getting solar DM me!",
            "title_similarity": "0.30791152",
            "sentiment_compound": 0.4574
        },
        {
            "id": "h6128h6",
            "score": 1,
            "text": "Republicans be like: no its not",
            "title_similarity": "0.19574457",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h612abi",
            "score": 1,
            "text": "If the scientific community wants to change minds they need to come outright and say what's going to happen to the biosphere in clear language if we don't stop this. Will planet earth become inhospitable to life and if so by when?",
            "title_similarity": "0.45100227",
            "sentiment_compound": 0.5405
        },
        {
            "id": "h612gck",
            "score": 1,
            "text": "Is this happening faster than all scientists predicted?",
            "title_similarity": "0.36881864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h612ozj",
            "score": 1,
            "text": "We’ve actually fucked it. I knew it was bad but I always thought we’d fix it, we are legit in the time that destroys the earth as it should be.",
            "title_similarity": "0.3890594",
            "sentiment_compound": -0.8705
        },
        {
            "id": "h6139ns",
            "score": 1,
            "text": "**‘Terrifying’ New Research Shows Amazon Flipped From Carbon Sink to Carbon Source**\n\nhttps://childrenshealthdefense.org/defender/amazon-co2-greenhouse-gases-carbon-source-deforestation/",
            "title_similarity": "0.57521963",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h613llp",
            "score": 1,
            "text": "The great filter here we come",
            "title_similarity": "0.09376879",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h613n07",
            "score": 2,
            "text": "We are not killing mother earth, we are killing ourselves. Mother earth has been here for billions of years, when we are gone she will heal and something new will replace us",
            "title_similarity": "0.488971",
            "sentiment_compound": -0.2225
        },
        {
            "id": "h6140ch",
            "score": 1,
            "text": "\"Could\"\n\nI \"could\" have sex this year but I don't see that happening either.",
            "title_similarity": "0.38937956",
            "sentiment_compound": 0.0
        },
        {
            "id": "h614dgj",
            "score": 1,
            "text": "This is why we need scientifically competent leaders in our world. We- NEED - to - STOP - electing - “personalities” - into - office… Let’s get engineers, scientists, doctors - you know - Problem Solvers elected…",
            "title_similarity": "0.42463022",
            "sentiment_compound": -0.516
        },
        {
            "id": "h614g24",
            "score": 2,
            "text": "The worst part of this is that the average person can do very little to combat this.  Sure, there are lifestyle changes that could be made, but unless the majority of the planet makes those changes, it won't make a bit of difference. \n\nThe world governments need to get their heads out of their asses (or realistically the corporations out of their pockets).  Nothing is going to change unless it starts from the top. \n\nStarting from the bottom would probably be the most effective option, but as we have seen over the past year with covid, good luck getting anyone to see the big picture or think of anyone but themselves.",
            "title_similarity": "0.4665649",
            "sentiment_compound": 0.9218
        },
        {
            "id": "h614qt8",
            "score": 1,
            "text": "Couldn’t someone have warned us?",
            "title_similarity": "0.09321114",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h615e5q",
            "score": 1,
            "text": "I never know what to do when I read these posts. Like l, I vote for parties that opt for climate change policy. I try to save energy. Don’t drive around too much. But it’s such a collective effort that I feel like no matter what I do, nothing changes",
            "title_similarity": "0.40196848",
            "sentiment_compound": 0.812
        },
        {
            "id": "h615hvy",
            "score": 2,
            "text": "Yeah... umm\n\nI think we already are there roflmao\n\n3.0 the ones to beat guys!",
            "title_similarity": "0.26749665",
            "sentiment_compound": 0.7177
        },
        {
            "id": "h6162gd",
            "score": 2,
            "text": "1.5c was supposed to be the worst case scenario. We're almost there and we have barely started fixing the problem. What is it going to be when/if we finally level out? Two? Four? We're getting into apocalypse territory here.",
            "title_similarity": "0.6117049",
            "sentiment_compound": -0.8095
        },
        {
            "id": "h61662i",
            "score": 2,
            "text": "But all the \"leaders of the world\" are too cowardly and greedy to do anything",
            "title_similarity": "0.20868757",
            "sentiment_compound": -0.7469
        },
        {
            "id": "h616ore",
            "score": 1,
            "text": "I realize these tragedies around the world are sad, but perhaps this will open the eyes of climate changes deniers (US Republicans, Chinese, Russians, etc). We need to stop this now for us and our children.",
            "title_similarity": "0.49163353",
            "sentiment_compound": -0.8151
        },
        {
            "id": "h616rq1",
            "score": 2,
            "text": "so like burning in hell? 😂🥲😐",
            "title_similarity": "0.2813927",
            "sentiment_compound": -0.5729
        },
        {
            "id": "h616svg",
            "score": 2,
            "text": "I've become so cynical and hopeless that my reaction was to laugh.",
            "title_similarity": "0.22952196",
            "sentiment_compound": -0.4642
        },
        {
            "id": "h6176fv",
            "score": 1,
            "text": "I don't know if anyone else has mentioned this here, but here's an idea. You want to speed up radical, societal change? LEGALIZE PSYCHEDELICS.\n\nIt's literally impossible to not care about the natural world if you consume natural DMT and psilocybin in a safe manner. Fight me.",
            "title_similarity": "0.34051275",
            "sentiment_compound": 0.607
        },
        {
            "id": "h617jdh",
            "score": 1,
            "text": "Make China stop using coal and curb it's emissions then.",
            "title_similarity": "0.38496536",
            "sentiment_compound": -0.296
        },
        {
            "id": "h617lxa",
            "score": 1,
            "text": "Tell a friend why you think government needs to finally represent your/the people’s interest and thus regulate industry. \n\nSpread the awareness; as long as its beneficial to pollute, companies arent incentivized to stop or change.",
            "title_similarity": "0.35901216",
            "sentiment_compound": 0.7709
        },
        {
            "id": "h617ue5",
            "score": 2,
            "text": "The earth is over populated and science is what is causing this. As 3rd world countries modernize, more pollution is created. Many 3rd world countries still use lead based gasoline. As long as humans continue to reproduce and apply technology, pollution will be created and some irreversible like micro-plastic in the oceans.\nThere are almost 8 billion people(7.7+) on earth now, when I was born there was 3.68 billion people.\n\nCan this really be fixed?",
            "title_similarity": "0.6126394",
            "sentiment_compound": 0.6077
        },
        {
            "id": "h6182bp",
            "score": 2,
            "text": "I’m so excited to raise my future children in a desert hellscape!",
            "title_similarity": "0.34694606",
            "sentiment_compound": 0.4561
        },
        {
            "id": "h6184o6",
            "score": 2,
            "text": "And the United States is currently contemplating putting the Republican death cult back in power in 2022. \n\nThis world makes me so angry and sad.",
            "title_similarity": "0.5495605",
            "sentiment_compound": -0.8659
        },
        {
            "id": "h6187eh",
            "score": 2,
            "text": "At that point industry will be contracted by governments to remove green house gasses from the atmosphere. Needless to say this will be payed for using tax cuts for the rich and tax increases for everyone else,",
            "title_similarity": "0.47191215",
            "sentiment_compound": 0.34
        },
        {
            "id": "h618cs7",
            "score": 2,
            "text": "I wish there was something I could do. \n\nI have tried to reduce my waste, stopped shopping on amazon/line and try to buy products that are made to last. Recycling seems pointless in my country as half the time it just ends up in the landfill. I do it anyway but it feels like you're just fighting against the inevitable.",
            "title_similarity": "0.38330838",
            "sentiment_compound": -0.128
        },
        {
            "id": "h618tc0",
            "score": 4,
            "text": "We need to destroy the fossil fuel industry immediately. We have alternative technologies readily available. We just need the political will for reforms",
            "title_similarity": "0.37160164",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h61926w",
            "score": 8,
            "text": "Man, nothing like hearing stories like this and getting that wave of existential dead knowing there's literally nothing I can do to change this",
            "title_similarity": "0.21688613",
            "sentiment_compound": -0.6007
        },
        {
            "id": "h6196pe",
            "score": 2,
            "text": "Why didn't anyone tell us this would happen???\n\nOn the Influence of Carbonic Acid in the Air upon the Temperature of the Ground Svante Arrhenius Philosophical Magazine and Journal of Science Series 5, Volume 41, April 1896, pages 237-276.\n\nMarch 1912 issue of Popular Mechanics, in an article titled “Remarkable Weather of 1911: The Effect of the Combustion of Coal on the Climate — What Scientists Predict for the Future”:",
            "title_similarity": "0.63958085",
            "sentiment_compound": 0.5171
        },
        {
            "id": "h6198ha",
            "score": 5,
            "text": "I thought I would reach my 50 before the world collapse...",
            "title_similarity": "0.6163647",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h619g4m",
            "score": 1,
            "text": "If we had people who cared enough to act and the rest were people who didn't care enough to act it would be fine.\n\nUnfortunately we have people who care enough to act and just as many people who care enough to act in opposition, so rather than it being a gradual movement towards more people acting its at best a stalemate.\n\nCovid showed this on a global scale, I would rather people were neutral and dgaf rather than actively trying to sabotage the world further.",
            "title_similarity": "0.233145",
            "sentiment_compound": 0.8431
        },
        {
            "id": "h619o1c",
            "score": 1,
            "text": "I thought we already passed the tipping point. That we just haven't admitted it because we don't want people to think, \"Why bother trying then?\"",
            "title_similarity": "0.2126621",
            "sentiment_compound": -0.4438
        },
        {
            "id": "h619vo6",
            "score": 1,
            "text": "What gets me is that I do my damdest to keep my impact to a minimum. Limit my heating in the winter, no cooling in summer, limit driving to my 320 mile return commute to my job every week (I work away from home) in as economical a car as I can afford, recycle as much as I can, keep frivoulous journeys to minium etc etc but it STILL isn't enough. It's got to the point that I am guilty to even exist on this planet. That is fucked up.",
            "title_similarity": "0.48501682",
            "sentiment_compound": -0.9081
        },
        {
            "id": "h61a3b3",
            "score": 1,
            "text": "Were doomed. Oh well. It was a fun run while it lasted. Damn you all, may God have mercy on all of us.",
            "title_similarity": "0.17897768",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h61ad6e",
            "score": 1,
            "text": "We've already passed the tipping point we have no Interest in stopping it as a specie's so whatever",
            "title_similarity": "0.19424747",
            "sentiment_compound": -0.4731
        },
        {
            "id": "h61aoea",
            "score": 1,
            "text": "Which nations are most responsible for GHG that cause climate change. If its an existential threat, how do we stop them?",
            "title_similarity": "0.5352788",
            "sentiment_compound": -0.4601
        },
        {
            "id": "h61b1s8",
            "score": 1,
            "text": "So there is hope for a Fallout world after all?",
            "title_similarity": "0.2969615",
            "sentiment_compound": 0.4877
        },
        {
            "id": "h61bkvv",
            "score": 1,
            "text": "People still deny there's a human element in climate change. I want to slam my face into a table when I think of how fucked everything is.",
            "title_similarity": "0.4107271",
            "sentiment_compound": -0.8442
        },
        {
            "id": "h61bqdo",
            "score": 1,
            "text": "In Germany in my state and town we just had massiv rainfalls followed by floods and earth slides. 100 people dead and 5 billion or so damage. The news \"Tagesschau\" put out a Instagram post from their daily of 1995 where they reported that Angela Merkel minister of environment said that with the current output of Co2 we would reach a tipping point in 25 years and that we need to reduce it by 1% every year. 26 years later she is cancelor and the tipping point is reached.",
            "title_similarity": "0.7478558",
            "sentiment_compound": -0.8367
        },
        {
            "id": "h61by5b",
            "score": 2,
            "text": "Someone get me the hell out of this timeline already",
            "title_similarity": "0.23278724",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h61byby",
            "score": 1,
            "text": "These articles and stories keep getting posts but it’s obvious no one important enough to do anything cares. Such a heat warming feeling. “We’re doing all we can.” Sure… then just stop posting about it and let’s stop pretending its preventable at this point.",
            "title_similarity": "0.20310193",
            "sentiment_compound": -0.2589
        },
        {
            "id": "h61cctn",
            "score": 1,
            "text": "The governments are reactive not proactive, look at covid and how much devastation could’ve been avoided.",
            "title_similarity": "0.31732345",
            "sentiment_compound": -0.7602
        },
        {
            "id": "h61ce7i",
            "score": 1,
            "text": "What can be done about it?",
            "title_similarity": "0.07363659",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61chfc",
            "score": 1,
            "text": "Get this to the front page pls",
            "title_similarity": "0.28005865",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h61ck5s",
            "score": 1,
            "text": "We're fucked and those who fucked us either won't be around to face the consequences or will be laughing their asses off in their billion dollar mansions.",
            "title_similarity": "0.39721027",
            "sentiment_compound": -0.765
        },
        {
            "id": "h61csyz",
            "score": 1,
            "text": "Once the permafrost melts, methane will be released which I am sure would cause a cascading effect.",
            "title_similarity": "0.52112067",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h61ct6l",
            "score": 1,
            "text": "I remember the news reporting on that, now im 18 and it's to late",
            "title_similarity": "0.49022916",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61d4o3",
            "score": 1,
            "text": "In every single parking lot I go into there is at least one person if not more sitting in a car with the engine running so they can have AC and looking at their phone. #idlers. We are doomed.",
            "title_similarity": "0.28510192",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h61dhk2",
            "score": 1,
            "text": "Also Australia was already on fire a long time ago.",
            "title_similarity": "0.4209281",
            "sentiment_compound": -0.34
        },
        {
            "id": "h61dlce",
            "score": 1,
            "text": "That means that some small islands in some countries in the world will become uninhabitable soonish, thereafter. Some will be gone, from a practical sense.",
            "title_similarity": "0.40386465",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61dsg0",
            "score": 1,
            "text": "Yeh bois we fucked. It’s almost like rich/powerful people suppressed the science for the last 50 years to live a lavish lifestyle and now we are left with an impossible task of fixing our whole effing planet",
            "title_similarity": "0.5678388",
            "sentiment_compound": -0.4927
        },
        {
            "id": "h61e2pq",
            "score": 2,
            "text": "Greed is one of the 7 deadly sins, and it's going to wind up killing us all because of a few greedy trillionaires unwilling to give up their wealth even a tiny bit. The only thing that could really stop it now would be a worldwide shutdown (covid almost worked) of all polluters.",
            "title_similarity": "0.46286058",
            "sentiment_compound": -0.9286
        },
        {
            "id": "h61e4ca",
            "score": 3,
            "text": "*Part* of the reason for this is predatory misinformation all over the internet. More and more people getting sucked into conspiracy theories so easily is quite literally killing us. We need everyone to be better informed so that we have an actual chance to do something about it, but this is seeming like it's astronomically unlikely to happen.\n\n\nCall me cynical, but I do believe that the gas and oil industry are the ones responsible for the poor state of the education system, not just in the US or any one country but in the *entire world*. They are perfectly fine sacrificing everyone and everything for some short-term materialistic gain.",
            "title_similarity": "0.4213869",
            "sentiment_compound": 0.8283
        },
        {
            "id": "h61eszn",
            "score": 1,
            "text": "+7 is when the crops in the majority of the planet can no longer grow",
            "title_similarity": "0.46568966",
            "sentiment_compound": -0.296
        },
        {
            "id": "h61eusq",
            "score": 1,
            "text": "Could someone please ELI5 how small incremental changes in global temperature have such drastic impacts?",
            "title_similarity": "0.55145174",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h61fcy0",
            "score": 1,
            "text": "A long-time favorite of mine from the late John Trudell, Lakota activist/poet/singer-songwriter:   \n\n\nWe see your technological society devour you before your very eyes.  \nWe hear your anguished cries exalting greed through progress.  \nWhile you seek material advances,  \nthe sound of flowers dying,  \ncarry messages through the wind,  \ntrying to tell you about balance  \nand your safety.  \nBut your minds are chained to your machines  \nand the strings dangling from your puppeteers' hands.  \nTurning you, twisting you into forms and confusions  \nbeyond your control.  \nYour mind for a job,  \nyour mind for a TV,  \nyour mind for a hairdryer,  \nyou mind for consumption.  \nWith your atom bombs,  \nyour material bombs,  \nyour drug bombs,  \nyour racial bombs,  \nyour class bombs,  \nyour sexist bombs,  \nyour ageist bombs  \ndevastating,  \nyour natural shelters.  \nMaking you homeless on Earth.  \nChasing you into illusions.  \nFooling you.  \nMaking you pretend  \nyou can run away  \nfrom the ravishing of your spirit.  \nWhile the sound of flowers dying,  \ncarry messages through the wind,  \ntrying to tell you about balance  \nand your safety.",
            "title_similarity": "0.36342138",
            "sentiment_compound": -0.5187
        },
        {
            "id": "h61fhdm",
            "score": 1,
            "text": "We can still save Earth , we humans always find a way to adapt",
            "title_similarity": "0.1735824",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h61fprw",
            "score": 1,
            "text": "Bet it comes faster than 5 years.",
            "title_similarity": "0.60716534",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61freu",
            "score": 1,
            "text": "How many tipping points are there in total?",
            "title_similarity": "0.2907967",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61g552",
            "score": 1,
            "text": "Last two years or so it really feels like we've turned some sort of corner where these events are happening all the time now.",
            "title_similarity": "0.53698444",
            "sentiment_compound": 0.4173
        },
        {
            "id": "h61gblo",
            "score": 1,
            "text": "It is ecosocialism or barbarism \nand your ignorance to realize this fast enough will cost us everything",
            "title_similarity": "0.37455902",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h61gh4s",
            "score": 1,
            "text": "we’re already the the 2C tipping point, our only goal right now is to limit the damage.",
            "title_similarity": "0.3109354",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h61gof9",
            "score": 1,
            "text": "We needed nuclear 30 years ago",
            "title_similarity": "0.50328475",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61gwsz",
            "score": 1,
            "text": "I have the solution. Solar powered air-conditioning.",
            "title_similarity": "0.26851898",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h61gy0v",
            "score": 1,
            "text": "ive said it before and i'll say it again:\n\nif you want Americans to care about climate change u have to say the difference in fahrenheit. i stg celsius is downplaying the severity.",
            "title_similarity": "0.50791395",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h61hda7",
            "score": 1,
            "text": "I live in Newfoundland, Canada. I hear stories told by my mother about how they used to go skating on the pond in october back when she was younger (1950s-60s). Or i remember my uncle talking about the times he used to drive his car across sandy cove bay on the frozen sea ice in winter. I was born in 1979 and i have never ever seen the bay freeze over...and in my memory growing up, the pond wouldnt freeze over until December or January most years. The general consensus around these parts is that over the last decades our usually harsh winters have become noticeably milder. Im 41 now and i believe i am living in the last times of what we knew as a normal climate.. i do pity babies born in to this..",
            "title_similarity": "0.5686588",
            "sentiment_compound": -0.5184
        },
        {
            "id": "h61hn06",
            "score": 1,
            "text": "can not wait to hear how giving the government and the WMO more money will fix climate.",
            "title_similarity": "0.48196837",
            "sentiment_compound": 0.34
        },
        {
            "id": "h61huwd",
            "score": 2,
            "text": "What a day. After learning of the 1400 billion tonnes of Co2 that is estimated to be released from thawing permafrost in Russia over the next 20 years or so, I now see this. Not to mention the floods in Europe and China, and the raging wildfires in the Northern hemisphere. It's the first time I have genuinely become scared of where this is heading",
            "title_similarity": "0.74499273",
            "sentiment_compound": -0.743
        },
        {
            "id": "h61i3mf",
            "score": 2,
            "text": "I think we are beyond  the tipping point. We need to be working on ways to cope with the changing climate.",
            "title_similarity": "0.3948591",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61i5bg",
            "score": 2,
            "text": "I like to add that using Celsius instead of Fahrenheit kind of adds to a HUGE chunk of the US population not taking it seriously. 1.5+ C looks like no impending apocalypse, compared to using 34 F to to show how much the climate will change, to the average American.",
            "title_similarity": "0.6146545",
            "sentiment_compound": 0.7469
        },
        {
            "id": "h61ip46",
            "score": 1,
            "text": "Blame it on the Boomers! Oh wait I’m a boomer !",
            "title_similarity": "0.25078028",
            "sentiment_compound": -0.4559
        },
        {
            "id": "h61ir9o",
            "score": 1,
            "text": "Fingers crossed the conservatives are right at this point and it will just go back down.",
            "title_similarity": "0.40086687",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61itbr",
            "score": 1,
            "text": "copenhagen is actively planning sea walls, dykes and a huge artificial peninsula to close its natural habour to the sea. the project is too big for the city alone and has already been approved by parliament. we are way passed preventing this.",
            "title_similarity": "0.3837269",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h61izht",
            "score": 2,
            "text": "We are so fucked 😪",
            "title_similarity": "0.19333531",
            "sentiment_compound": -0.7661
        },
        {
            "id": "h61j2j3",
            "score": 1,
            "text": "I feel like the word tipping point is outdated by like 10 years in this context.",
            "title_similarity": "0.5514342",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h61jf1r",
            "score": 4,
            "text": "I don’t know how to express myself about this anymore. I just want to cry.",
            "title_similarity": "0.19674934",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h61jiu2",
            "score": 2,
            "text": "5 years ago they were like, we got like 10 years before we're completely fucked. And a bunch a people were just like \n\nI'm not sure science is real\n\nAnd then vroomed off in their hummers to dump chemicals in the river.",
            "title_similarity": "0.59621924",
            "sentiment_compound": -0.4127
        },
        {
            "id": "h61jl9u",
            "score": 2,
            "text": "It’s over. No way we can go back",
            "title_similarity": "0.20338225",
            "sentiment_compound": -0.296
        },
        {
            "id": "h61ju33",
            "score": 1,
            "text": "Can we all just go collectively go vegan for a few months and voice our concerns for animal agriculture and the affects of it on the earth",
            "title_similarity": "0.5275286",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61k3oo",
            "score": 1,
            "text": "GOP criminal cartel : We need more oil",
            "title_similarity": "0.35243833",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h61k92n",
            "score": 2,
            "text": "Aaaand aaaaawaaaaay weeeeeee goooooo",
            "title_similarity": "0.121765226",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61ksus",
            "score": 4,
            "text": "Too bad gop doesn’t believe in science.",
            "title_similarity": "0.16786104",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h61l0hb",
            "score": 1,
            "text": "\"The annual mean global (both the land and sea) mean near-surface temperature is likely to be at least 1°C warmer than pre-industrial levels in each of the coming 5 years and is very likely to be within the range 0.9 – 1.8°C. The pre-industrial levels are defined as the average over the years from 1850 to 1900.\"\n\n1850-1900 as a baseline means that it's higher in reality. Pre-industrial would be 1750-1800 at the latest.",
            "title_similarity": "0.7110894",
            "sentiment_compound": 0.296
        },
        {
            "id": "h61l1rb",
            "score": 1,
            "text": "Meanwhile Canada building a huge fuckin oil pipeline",
            "title_similarity": "0.4238135",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h61lmf9",
            "score": 1,
            "text": "I mean it already hits 120F in southwest Arizona regularly. I’m presuming in the next 10 years, it’ll be too hot for people to live in my city",
            "title_similarity": "0.5980224",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61lp9q",
            "score": 2,
            "text": "Let's keep arguing about parking, everyone.",
            "title_similarity": "0.13089111",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h61lr1j",
            "score": 1,
            "text": "What happened to the comment with the Oompa Loompa Global Warming song-comment chain?\n\nI was dyn laughn this morning at that. First redditor said\n\n\"What do you get when you gobble down coal?\"",
            "title_similarity": "0.55869997",
            "sentiment_compound": 0.2406
        },
        {
            "id": "h61m6sl",
            "score": 2,
            "text": "Maybe that's why our politicians are grabbing what they can, not listening to the people anymore.",
            "title_similarity": "0.25691918",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61m8pv",
            "score": 2,
            "text": "So is anybody going to actually fix the problem?  Or do I just tell my kids they get to starve on a burning planet?",
            "title_similarity": "0.45100456",
            "sentiment_compound": -0.7149
        },
        {
            "id": "h61mrqd",
            "score": 1,
            "text": "Not sure why we have not implemented more nuclear power plants. They are clean and safe alternative to fossil fuel... Gotta push that agenda, though. Battery technology is so far off, but we could eliminate all the power needs for our homes and factories by just building more nuclear plants.",
            "title_similarity": "0.41738725",
            "sentiment_compound": 0.3224
        },
        {
            "id": "h61nthv",
            "score": 1,
            "text": "I heard a lady on a news report the other day call this 'The Age of Consequences'.",
            "title_similarity": "0.4843867",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61ocu4",
            "score": 2,
            "text": "I honestly thought I was on r/collapse ….",
            "title_similarity": "0.31244725",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h61pkye",
            "score": 1,
            "text": "Stuff like this isn't great for my anxiety",
            "title_similarity": "0.13050185",
            "sentiment_compound": -0.3599
        },
        {
            "id": "h61pz7l",
            "score": 1,
            "text": "the climate and environment are beyond saving at this point. best we can do is doing what you enjoy as much as you can, while it all still lasts",
            "title_similarity": "0.2444301",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h61rpn9",
            "score": 1,
            "text": "We need to target the big companies",
            "title_similarity": "0.31867027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61scea",
            "score": 1,
            "text": "Someone posted this in the comments for Americans wanting to take action:\n\nCitizens Climate Lobby \ncitzensclimatelobby.org",
            "title_similarity": "0.42409796",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h61umvu",
            "score": 1,
            "text": "We have tipped. We will go extinct",
            "title_similarity": "0.39291972",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61uwmw",
            "score": 1,
            "text": "The human population has grown way too big for us to suddenly go carbon neutral, we literally cannot support ourselves any other way than what we are doing now. There is going to be no easy way out of this, that ship has long sailed, hard brutal change is going to be forced upon the human race, we will survive, we are very adaptive afterall, but our consumerist lives will come to an abrupt end. The majority of the human story is a story of suffering, adapting and surviving, the reality is things are going back to the true normal.",
            "title_similarity": "0.49116236",
            "sentiment_compound": -0.5764
        },
        {
            "id": "h61vj0h",
            "score": 1,
            "text": "The thing that depresses me the most is that even though I am a scientist who works with lots of engineers and I work on climate change mitigation technology, I'm the only person out of my undergraduate friends and grad school class who is actually spending more than eight hours a day trying to fix this. Everyone else I know makes drugs or works in finance. Of the few people I know who do work in the climate change field, almost all of them just study what is happening or work on politics which I see as a lost cause because deniers are vocal and vote. They are in no way actively working to fix this. No one is fixing this for you save a handful of people. Even companies that say they are doing something green are often greenwashing. I have seen this way too many times first hand to be anything but extremely pessimistic about our survivability on this rock.\n\nI guess what I'm saying is, if you really think this is a problem, change jobs. Change your lifestyle. Start a business. Don't act like someone is going to solve this for you because I can count the number of people working on this without thinking hard at all.",
            "title_similarity": "0.5167405",
            "sentiment_compound": -0.8356
        },
        {
            "id": "h61w1hm",
            "score": 1,
            "text": "I remember when I was much younger there would be a major forest fire where I live maybe once every 5 years and I live in a hot place surrounded my forests. Now for the past 3 years during the summer I can't even see the end of my street because of the smoke.",
            "title_similarity": "0.6726807",
            "sentiment_compound": -0.3976
        },
        {
            "id": "h61wch1",
            "score": 1,
            "text": "We as civilization have never been self sufficient since we started farming. Because we had more food we could have more kids. More kids means we need more food, we need more land to grow the food. And the cycle repeats itself getting worse every generation.",
            "title_similarity": "0.41046253",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h61wffg",
            "score": 1,
            "text": " \"You say the whole world's ending, honey it already did\"",
            "title_similarity": "0.3540664",
            "sentiment_compound": 0.0
        },
        {
            "id": "h61wk2y",
            "score": 1,
            "text": "Feels like we already there I swear",
            "title_similarity": "0.07384431",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h61wnzd",
            "score": 1,
            "text": "Weapon of mass destruction!/s",
            "title_similarity": "0.2786315",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h61zlrr",
            "score": 1,
            "text": "I have legitimately lost all hope. The only joy I get out of this is the satisfaction of, in 50 years, knowing that the conservatives in power now will be seen as the bad guys. And I guess the younger ones who will still be alive and who are denying climate change/refusing to try and save the planet, I can insult them or something, Idk.",
            "title_similarity": "0.56062627",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h6219ar",
            "score": 1,
            "text": "Does that mean we can stop talking about this? It'd be nice",
            "title_similarity": "0.13187551",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h622azk",
            "score": 2,
            "text": "Remember guys 7,800,000,000 people is *totally* sustainable, don't listen to those icky population scientists, it's all imperialist propaganda.",
            "title_similarity": "0.44336635",
            "sentiment_compound": -0.25
        },
        {
            "id": "h624jk4",
            "score": 1,
            "text": "Ugh, I don't wanna be the 40 year old in the end of the world orgy",
            "title_similarity": "0.3966747",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h62aswl",
            "score": 1,
            "text": "Meanwhile bezos plans an escape route",
            "title_similarity": "0.2192412",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h62b0g5",
            "score": 1,
            "text": "I saw this and immediately thought of the song \"I'm Burn'n for You, by Blue Oyster Cult\"",
            "title_similarity": "0.42399555",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62fz51",
            "score": 1,
            "text": "Tipping point?  I think we passed tipping point when population centers started experiencing 130 degree heat waves and about half of the ice caps have melted in 60 years.\n\nTipping point was a ways back.",
            "title_similarity": "0.7144505",
            "sentiment_compound": 0.0
        },
        {
            "id": "h62hkgx",
            "score": 1,
            "text": "In old tales, arrogant magicians would summon a demon and destroy himself. In reality, science summoned the industrial revolution and destroyed the world.",
            "title_similarity": "0.4431128",
            "sentiment_compound": -0.872
        },
        {
            "id": "h62iiky",
            "score": 1,
            "text": "I thought we were doing alot better to combat climate change compared to industrial revolution times.  Why is it worse?",
            "title_similarity": "0.47954628",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h62j8gy",
            "score": 1,
            "text": "It's been a good run human kind. Catch you on the flip side",
            "title_similarity": "0.15717073",
            "sentiment_compound": 0.743
        },
        {
            "id": "h62ro9r",
            "score": 3,
            "text": "How about we go nuclear power? Like... Why are we still burning coal for electricity. Bruh.",
            "title_similarity": "0.4221587",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h62zmvz",
            "score": 2,
            "text": "Yeah. We are screwed. Nobody is going to do anything in time and the billionaires are literally prepping to leave the planet.",
            "title_similarity": "0.41480786",
            "sentiment_compound": -0.296
        },
        {
            "id": "h64j5u0",
            "score": 1,
            "text": "This is why I not going to own car or do air travels.",
            "title_similarity": "0.17066216",
            "sentiment_compound": 0.0
        },
        {
            "id": "h65ahtx",
            "score": 1,
            "text": "Call me when we will stop patching the side effect and actually trying to fix the issue.\n\nI mean, let add AC, have more green space near home (ok that one may help?) instead of redo the economy, our daily routine to be more earth friendly without keeping the current system. (Fu you i won't do 6h of daily commute if you force me to use public transport)",
            "title_similarity": "0.3943892",
            "sentiment_compound": 0.6096
        },
        {
            "id": "h65fj3v",
            "score": 2,
            "text": "And this is how we are treated when we try to save what little we have left. Fairy Creek is one of the last intact watersheds on Vancouver island in BC, which is on fire at the moment. It’s scientific fact that old growth forests are needed. And here we get arrested on the daily. There are tons of rcmp and paramilitary officers there. Helicopters and drones and well as other government officials. All trying to make sure those old growth trees get cut down for profit. I’ve been up to fairy creek a few times and up those logging roads you can see the destruction clear cut logging has caused. The island now looks like a bad haircut. Buzzed all over. \nWe deal with rcmp brutality up there and until recently they blocked media from capturing it. \n\nhttps://fb.watch/v/1iFqHf8k6/\n\nAnyone on Reddit who can help. Please do.",
            "title_similarity": "0.4735204",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h67o5hm",
            "score": 1,
            "text": "Reaching the tipping point? I think we’re already there, if not past it.",
            "title_similarity": "0.33221182",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h69i7os",
            "score": 1,
            "text": "Just a forgone conclusion. Those on the right deny, those on the left thinks we can have 100% renewables in a couple of decades. Somewhere it the middle takes planning, money, and action in a logical sequence. I have super insulated my house, have an electric car, made an electric motorcycle 15 years ago, and 4kw of solar. lead follow or get the heck out of the way.",
            "title_similarity": "0.6199638",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6p4gb1",
            "score": 1,
            "text": "I would be more worried right now about methane even now we with the temp now we are melting the permafrost which stores trillions of tons of it and not only is it highly flammable it’s also way worse for climate change than co2 think it’s time to face facts we are screwed",
            "title_similarity": "0.56143993",
            "sentiment_compound": -0.8313
        },
        {
            "id": "h78g2c8",
            "score": 1,
            "text": "Very true!! Climate change is the defining challenge of our time!",
            "title_similarity": "0.5198636",
            "sentiment_compound": 0.645
        },
        {
            "id": "h7ajtkv",
            "score": 1,
            "text": "People are still pushing the fake human-made climate change myth? When will people stop being so arrogant that we can change the climate of the earth?",
            "title_similarity": "0.51017",
            "sentiment_compound": -0.8463
        },
        {
            "id": "h7r09r3",
            "score": 1,
            "text": "So should we be preparing for water world or mad max. I just want to know what skill to sharpen",
            "title_similarity": "0.3115961",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h9co631",
            "score": 1,
            "text": "The report has come out mother earth is ill What’s needed to heal her is political will,\n\nWe have trashed her oceans, her reefs are most gone, The bees barely bumble, We have done her so wrong\n\nWe sit in our tanks, These beastly dumb cars, “It aint my fault, they said were going to mars!”\n\nBut mars doesnt have trees that grow from a sprout, that give us the breath that life dies without\n\nMars doesnt have lush oceans or serene mountain lakes, no life giving rainforests with slithery snakes,\n\nFor forty years now we have passed the buck, and said to our kids yeah its bad but good luck\n\nAll of the lobbyists in on the take, not a care for the damage their riches will make\n\ncall up your congressmen tell “em your pissed, oh he cant come to the phone Exxon sent him a gift\n\nWe could have saved you while there was still time, but the getting was easy and it was too hard a climb\n\nthe oil train was a barrelin how could we stop it? afterall whats more sacred then corporate profits?\n\noh and we had to amass our powerful guns, to ensure all our earthly tribal wars were won\n\nThe earth barely grumbled as we set off our bombs, as we pillaged her innards she has remained mostly calm\n\nBut it seems as of late her patience’s run out, what once was her whisper is now a desperate shout\n\nwe should have listened to what the ancients foretold, It is us who die young mother earth always grows old\n\nshe will shake us off like a flea ridden rat,\n\nshes grown tired of us spoiled brats\n\nperhaps bezos and bill will call mars their new home, but for the rest of us schmucks the future’s unknown\n\nif we make ammends and learn a new way, perhaps she will feel generous and let our children stay\n\nBut penance is upon us we must immediatly act, and show her we are up to making a new pact\n\nwhere we understand we are one and not just a parsing of nations, and finally respect her abudant creations",
            "title_similarity": "0.49296182",
            "sentiment_compound": 0.9472
        },
        {
            "id": "hdpzupl",
            "score": 1,
            "text": "We can do it in 3 years, take it or leave it. \n\nWe have managed to reach every tipping point earlier than estimated.",
            "title_similarity": "0.49603578",
            "sentiment_compound": -0.0258
        }
    ]
}