{
    "Just 5% of the world’s power plants account for almost three-quarters of carbon emissions from electricity generation. A crackdown on a limited number of ‘hyper-emitting’ power plants could yield outsize cuts in the carbon emissions resulting from global electricity generation.\n": [
        {
            "id": "h6igcxz",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.3378822",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h6in4r5",
            "score": 0,
            "text": "Despite making up only 5% of power plants, these plants emit nearly 75% of the electricity generating pollution in the world.",
            "title_similarity": "0.8704161",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ivvro",
            "score": -2,
            "text": "Given the gravity of the crisis, if negotiations fail, military options or sabotage should be considered. It's no different than a rogue nation building a nuclear weapon - too much at stake for us to wait on the whims of sociopaths or dickheads.",
            "title_similarity": "0.38049462",
            "sentiment_compound": -0.9371
        },
        {
            "id": "h6j7yyu",
            "score": 6,
            "text": "China burns as much coal as the rest of the world combined. Over half their RR rolling stock is for moving coal. They still employ coal burning steam locomotives in revenue service, to move coal. They use hundreds(if not more) of small antiquated soviet designed coal power plants.",
            "title_similarity": "0.6955216",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6iqiqp",
            "score": 3,
            "text": "They are called coal plants",
            "title_similarity": "0.2763795",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6j31gs",
            "score": 3,
            "text": "Not a helpful metric if it’s percent of power plants. Should be percent of power produced. For all we know these 5% of plants could be producing 80% of the power with 75% emissions. I’m sure it isn’t this extreme, but as this hypothetical is consistent with this metric, it shows how unhelpful the metric is.",
            "title_similarity": "0.77186954",
            "sentiment_compound": -0.0041
        },
        {
            "id": "h6j4pc9",
            "score": 3,
            "text": "Yet we, individuals, are the ones told to curb our ways to save the planet.",
            "title_similarity": "0.2583352",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h6jbdmq",
            "score": 2,
            "text": "Another reason to use nuclear. I’ll debate this point to my grave",
            "title_similarity": "0.21270427",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h6jmcp8",
            "score": 1,
            "text": "Replace them with nuclear",
            "title_similarity": "0.2623065",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6j3p9w",
            "score": 6,
            "text": "Long winded way of saying we should build nuclear",
            "title_similarity": "0.30508408",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6j02b3",
            "score": 11,
            "text": "We need nuclear power now more than ever, very clean and renewable power source.",
            "title_similarity": "0.35995847",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h6j17je",
            "score": 42,
            "text": "So go nuclear. Those against it are just as much science deniers as acti vax and climate deniers.",
            "title_similarity": "0.53701335",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h6je290",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.036665227"
        },
        {
            "id": "h6j3tdg",
            "score": 1,
            "text": "It seems to me that targeting plants like these as a priority to be replaced with nuclear plant would be massive progress for very little financial cost (in the grand scheme).",
            "title_similarity": "0.4559674",
            "sentiment_compound": 0.8074
        },
        {
            "id": "h6l5s56",
            "score": 1,
            "text": "Maybe do that instead of force us into electric cars.",
            "title_similarity": "0.36051863",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6irs28",
            "score": 69,
            "text": "Another great advocation for nuclear power.",
            "title_similarity": "0.2752189",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h6iiyz7",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.036665227"
        },
        {
            "id": "h6j7vjt",
            "score": 6,
            "text": "Time for nuclear. The waste gets recycled. France, China, and America all have nuclear power plants and a lot of them.",
            "title_similarity": "0.6069791",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h6j8ozs",
            "score": -2,
            "text": "So why are they pushing electric cars so hard if producing electricity isn't environmentally friendly?",
            "title_similarity": "0.42904073",
            "sentiment_compound": -0.5414
        },
        {
            "id": "h6jn7xa",
            "score": 6,
            "text": "Every breath an animal takes is a carbon emission.  What helps balance that?  Trees that release oxygen.  It's a pretty simple solution ... bring back all the forests we've cut down.  Every other country is doing it, and it looks beautiful.  All the US is doing is throwing money at the problem, and asking the public to make changes.",
            "title_similarity": "0.56039256",
            "sentiment_compound": 0.802
        },
        {
            "id": "h6io277",
            "score": 461,
            "text": "If only there was a very safe, very efficient form of power we could temporarily use until our renewable sources are more efficient.  Oh yeah. Nuclear.",
            "title_similarity": "0.45480365",
            "sentiment_compound": 0.9023
        },
        {
            "id": "h6j3mpi",
            "score": 2,
            "text": "More reasons to go nuclear",
            "title_similarity": "0.21473579",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jq2gm",
            "score": -3,
            "text": "Haven't read the article, but im going to take a wild guess...China. Perhaps Russia as well. And maybe one in India.\n\nBut we'd rather stop coal and oil extraction in the US, and import it from them, so we can lie to ourselves about our good deeds.\n\nEdit: And guess what, if there was a list? It would be far from accurate. You think China, Russia, and the Saudis are accurately tracking their emissions, and displaying them transparently? Not a chance.",
            "title_similarity": "0.511156",
            "sentiment_compound": 0.4497
        },
        {
            "id": "h6k8iga",
            "score": -3,
            "text": "we should probably tax Americans for this.",
            "title_similarity": "0.31707716",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6j3t4c",
            "score": 0,
            "text": "What’s to even consider shut them down. I offer up Canadian energy to those who need it for shutting it off.",
            "title_similarity": "0.29322404",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h6j4jwi",
            "score": 0,
            "text": "In a couple months it’ll be crypto mining but you know….. profits",
            "title_similarity": "0.57696056",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h6j73ey",
            "score": 0,
            "text": "The 80-20 rule. 80% of all results come from 20% of all efforts.",
            "title_similarity": "0.49632257",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jk19h",
            "score": 0,
            "text": "> Targeting the world’s super polluters could yield disproportionate national and global benefits, the researchers argue.\n\nOh so you mean by addressing the actual problem causers would solve the problem?  You don't say....",
            "title_similarity": "0.5328038",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h6jo9h7",
            "score": 0,
            "text": "5% of the power plants emit 75% of the carbon...\n\nand the rest of us are beating each other up over plastic straws.",
            "title_similarity": "0.7635082",
            "sentiment_compound": -0.4588
        },
        {
            "id": "h6jp1dn",
            "score": 0,
            "text": "Nah.  Easier to just let the world die, because West Virginia, amirite?",
            "title_similarity": "0.2957266",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h6jpzbh",
            "score": 0,
            "text": "So we find a way to de carbonize 5% of our power and 3/4 of global CO2 emissions stop?",
            "title_similarity": "0.8714576",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6jqkyu",
            "score": 0,
            "text": "So why are our taxes going up to “combat climate change” then?",
            "title_similarity": "0.48911756",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jsyo9",
            "score": 0,
            "text": "And 90% of vehicle emissions comes from the top 10 dirties vehicles. Targeted improvements are way better then forcing avg people to drive Lithium battery cars. Just deal with that bad 10%",
            "title_similarity": "0.68081856",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6jtbkd",
            "score": 0,
            "text": "Would that not in theory reduce our electricity capacity by 3/4 if they were taken offline? Also sounds like BS.",
            "title_similarity": "0.755008",
            "sentiment_compound": 0.25
        },
        {
            "id": "h6jv58t",
            "score": 0,
            "text": "it's almost as if rules and laws and government have a role to play here ...",
            "title_similarity": "0.118574575",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6jzqi5",
            "score": 0,
            "text": "I imagine that 5% is still a lot, and that these plants are probably also large capacity so won't be simple to replace.",
            "title_similarity": "0.65585136",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6kjzxg",
            "score": 0,
            "text": "But here come the carbon tax on us regular working class folks. See the problem yet ?",
            "title_similarity": "0.6005969",
            "sentiment_compound": -0.5499
        },
        {
            "id": "h6kkl4a",
            "score": 0,
            "text": "the solution is simple, spent less money on stuff that you don t really need. produce less garbage. eat less. but this idea is not compatible with capitalism. \"less is more\"",
            "title_similarity": "0.4355644",
            "sentiment_compound": 0.1655
        },
        {
            "id": "h6ku6pp",
            "score": 0,
            "text": "why do you still post those nefarious looking smoke (water vapor) filled pictures while dicussing CO2? I guess it still works. Suggestion: If you're going to post those pics, I think the starving polar bear will give it a one-two punch with greater scare value. go for it!",
            "title_similarity": "0.415444",
            "sentiment_compound": -0.3382
        },
        {
            "id": "h6kuijj",
            "score": 0,
            "text": "The Americans are to blame for this.",
            "title_similarity": "0.26260605",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6lgyw9",
            "score": 0,
            "text": "Now we just have to get China to agree to it...",
            "title_similarity": "0.2517035",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6j6yn1",
            "score": 34,
            "text": "Change them to modern Nuclear and you’ll have baseload power covered as well as no CO2",
            "title_similarity": "0.39400262",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h6ipwcd",
            "score": 12,
            "text": "[deleted]",
            "title_similarity": "0.08551386"
        },
        {
            "id": "h6j52qu",
            "score": 1,
            "text": "Notice that they don't tell us where they are?  Probably to keep people from delivering the remedies that would most effectively solve the problem.",
            "title_similarity": "0.27297637",
            "sentiment_compound": 0.376
        },
        {
            "id": "h6j7w1q",
            "score": 1,
            "text": "The international community has failed to devise an effective system to curtail the sexual exploitation of young children and you are hoping for a carbon emissions fix?",
            "title_similarity": "0.53636646",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h6j8ap4",
            "score": -1,
            "text": "Can you imagine winters being winters again, and not cool springs, no mass floods, or fires, or freezing? But some people gotta eat too. And by eat I mean, not paying taxes, and use their profits to bribe politicians, to block any change. Humanity sucks.",
            "title_similarity": "0.48583776",
            "sentiment_compound": -0.6895
        },
        {
            "id": "h6j9in6",
            "score": 1,
            "text": "Moar nuclear energy pls",
            "title_similarity": "0.29013845",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6ja3j0",
            "score": 1,
            "text": "Why don’t we just build nuclear power plants.",
            "title_similarity": "0.4090352",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jb6kv",
            "score": 1,
            "text": "The problem is the title in the article is slightly deceiving. This is 75% of electricity based carbon not total based carbon. Cow farts still more carbon intense than all these plants combined.",
            "title_similarity": "0.7328419",
            "sentiment_compound": -0.4988
        },
        {
            "id": "h6k031z",
            "score": 1,
            "text": "Stats like this make me wonder why we would focus on anything else. Like straws.",
            "title_similarity": "0.23268218",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h6k0o9s",
            "score": 1,
            "text": "Gee, I wonder if the output of these power plants could be related to the number of people they serve? This post is extremely disingenuous at best.\n\nThis is coming from someone who supports practical alternatives, namely nuclear and hydroelectric power.\n\nSolar and wind power are inefficient, toxic scams dominated by massive lobbyists who cover-up the dangers they pose to people and the environment they claim to care so much about.",
            "title_similarity": "0.55090684",
            "sentiment_compound": 0.3102
        },
        {
            "id": "h6kkdii",
            "score": 1,
            "text": "I've always wondered why the US doesn't just identify the big polluters and force them to stop. I know money but still, weird.",
            "title_similarity": "0.44962963",
            "sentiment_compound": -0.5647
        },
        {
            "id": "h6kko4v",
            "score": 1,
            "text": "Man environmentalists really fucked up going after nuclear power",
            "title_similarity": "0.4465124",
            "sentiment_compound": -0.6901
        },
        {
            "id": "h6l5mm0",
            "score": 1,
            "text": "Nah, as should just ban plastic straws. That will fix it.",
            "title_similarity": "0.23323551",
            "sentiment_compound": -0.6124
        },
        {
            "id": "h6jicgm",
            "score": 8,
            "text": "Ohh!!! Next do NATO, and US Military for Highest Carbon Emissions",
            "title_similarity": "0.54085547",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6je6if",
            "score": 2,
            "text": "U.S military is the biggest pollution causing entity that exists.\n\nIf we stopped every nations war machine or put them on hold for a few years we could curb carbon emissions enormously.",
            "title_similarity": "0.64764535",
            "sentiment_compound": -0.7003
        },
        {
            "id": "h6jiyda",
            "score": 2,
            "text": "We should probably also scale up nuclear power to meet the energy demand as well.",
            "title_similarity": "0.39629805",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h6jdjln",
            "score": -2,
            "text": "If you think this is important you’re a dumb ass",
            "title_similarity": "0.12621745",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h6jih2t",
            "score": 3,
            "text": "21st century Fission technology is the only thing that will realistically reduce carbon emissions.",
            "title_similarity": "0.6022022",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6k5v40",
            "score": 3,
            "text": "Honestly, I wish mankind would embrace nuclear power a little more...",
            "title_similarity": "0.36475766",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h6kpuqh",
            "score": 2,
            "text": "And nuclear accounts for 0% of carbon emissions. But yknow...",
            "title_similarity": "0.75914365",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6iu5c3",
            "score": 70,
            "text": "Is everyone unaware that this is a link to a lay summary? Ie. This is a very short summary aimed at non experts. The link is there at the bottom to the research itself which is free to read for everyone (pdf format). \n\n\nAll this jabber about efficiencies etc is confusing me greatly. It's all in the bloody paper.",
            "title_similarity": "0.415633",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h6ilusw",
            "score": 66,
            "text": "[removed]",
            "title_similarity": "0.036665227"
        },
        {
            "id": "h6khi9y",
            "score": 3,
            "text": "Nuclear power is the way",
            "title_similarity": "0.28838912",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6izgkc",
            "score": 399,
            "text": "After seeing that Bill gates documentary, India is going to be an uphill battle to use clean energy. From what I remember, because the rest of the developed world got to have an industrial age why can't we. We will have coal plants as well. I was like oof.",
            "title_similarity": "0.5330325",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h6ihwrq",
            "score": 303,
            "text": "And what percent of electricity generated by fossil fuels do they make?",
            "title_similarity": "0.6106977",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ixreh",
            "score": -6,
            "text": "So much for powering electric cars",
            "title_similarity": "0.33978856",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6iwtxs",
            "score": 6,
            "text": "Unless you subsidize a cleaner alternative for that region. It will just make it harder on that local population.",
            "title_similarity": "0.3635676",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h6iugyp",
            "score": -8,
            "text": "If you close power plants, how will we charge electric vehicles?",
            "title_similarity": "0.5197788",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jcnb0",
            "score": 61,
            "text": "5% of power plants, not 5% of power generation.\n\nMakes a huge difference.\n\nThe article says they could cut emissions by 20% by making those power plants have average efficiency. That implies that these power plants are slightly more polluting than average per unit of energy produced, but nothing crazy like the headline tries to make it seem.",
            "title_similarity": "0.85959685",
            "sentiment_compound": 0.3158
        },
        {
            "id": "h6izj79",
            "score": 12,
            "text": "So, we know where carbon emitting sources are, we know how much they produce, we know its unlikely they're getting shut down any time soon, how hard would it be to create carbon sequestering products and retrofit them to capture the vast majority of carbon emissions? What are the limitations? Are there workarounds? Can wheels be greased?\n\nI mean, hell, if the free market won't do it alone, why not slap some tasty tax breaks on the requirement for emitters to also sequester the carbon they produce? Is there a way to create a market opportunity for this kind of solution? \n\nIMO, the only way we get at this problem is full spectrum, so that means approaching it from every perspective possible. Capitalists are only interested in one thing, so that makes harnessing that expertise fairly straightforward. We know money will chase down every opportunity there is like a dog after a rabbit, so is there a way to make a market here that can address the problem that isn't carbon pricing? Obv that has to be a long term solution, but it's also struggling to get off the ground.",
            "title_similarity": "0.610982",
            "sentiment_compound": 0.6248
        },
        {
            "id": "h6jlkew",
            "score": 191,
            "text": "The Pareto distribution strikes again!\n\nYou could solve most of the world's problems by targeting the top 5% of problem contributors.",
            "title_similarity": "0.6929452",
            "sentiment_compound": -0.68
        },
        {
            "id": "h6j6zdy",
            "score": 109,
            "text": "This is how you combat emissions - tackle the low hanging fruit first then gradually refine. Regardless of your belief in anthropogenic climate change, we all deserve and want to live where the air is clean.",
            "title_similarity": "0.29738408",
            "sentiment_compound": -0.128
        },
        {
            "id": "h6j2c6v",
            "score": 612,
            "text": "An energy consultant friend of mine (I was in alternate energy in my corporate life) called these the Big Dirties. \n\nThe plants were old, and huge polluters, but they were paid for, thus very profitable. \n\nIn the US, you can get the data from the Dept of Energy or the Energy Information Agency.",
            "title_similarity": "0.55746084",
            "sentiment_compound": 0.8844
        },
        {
            "id": "h6iitri",
            "score": 3917,
            "text": "Article is very sparse on specifics. Like, where are these plants? Let's have a list.",
            "title_similarity": "0.29463273",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6iyy6m",
            "score": 80,
            "text": "I always remember this article popping up at my previous employer. https://hudsonvalleypost.com/report-hudson-valley-incinerator-one-of-top-polluters-in-u-s/\n\nFunny… since I left there, I don’t need a daily inhaler anymore, though I’m convinced I’ve lost time on my life because of it.",
            "title_similarity": "0.4916569",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h6j075h",
            "score": 1,
            "text": "But they levied taxes on the people to solve it first...",
            "title_similarity": "0.41323227",
            "sentiment_compound": 0.296
        },
        {
            "id": "h6j4l87",
            "score": 1,
            "text": "nuclear, wind, solar pls",
            "title_similarity": "0.28649735",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h6j5dtz",
            "score": 1,
            "text": "Why are you just telling us now? Haven’t we known this?",
            "title_similarity": "0.07024543",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6j6i5k",
            "score": 1,
            "text": "So the greatest impact in reducing pollution is felt by targeting the greatest polluters?",
            "title_similarity": "0.44614542",
            "sentiment_compound": 0.7703
        },
        {
            "id": "h6j7hpi",
            "score": 1,
            "text": "That's some low hanging fruit. Get on it planet earth!",
            "title_similarity": "0.26683074",
            "sentiment_compound": -0.3382
        },
        {
            "id": "h6j7s2v",
            "score": 1,
            "text": "I would love to see a pie chart showing the total annual emissions that contribute to global climate change, divided by source.\n\nLike “Power Plants X%”, “Wildfires Y%”, “Cow Farts Z%” etc.\n\nI’ve tried googling it, but end up getting lost between tons-per-year of carbon statistics, percentages that lack context, and ad-filled news articles with one slant or another.\n\nI’m just looking for a stratospheric (pun) view of how much emissions there are total in the whole wide world and what percentage of it comes from where.",
            "title_similarity": "0.66889083",
            "sentiment_compound": -0.3716
        },
        {
            "id": "h6j899c",
            "score": 1,
            "text": "But I’m supposed to turn my AC to 75 during hot days to save the planet. Sure.",
            "title_similarity": "0.48479193",
            "sentiment_compound": 0.8047
        },
        {
            "id": "h6j8am9",
            "score": 1,
            "text": "Well, that's an incredibly frustrating bit of knowledge.",
            "title_similarity": "0.06925889",
            "sentiment_compound": -0.2716
        },
        {
            "id": "h6j8k5c",
            "score": 1,
            "text": "So can the world get together and fund the replacement and decommissioning of these tomorrow? Seems like a stupidly easy way to buy us a decade, for almost free.",
            "title_similarity": "0.4128787",
            "sentiment_compound": 0.6605
        },
        {
            "id": "h6j8tu7",
            "score": 1,
            "text": ">  The team’s calculations suggest that emissions would fall by roughly 25% if those polluters boosted their efficiency to match the global average. Switching their fuel source from coal or oil to natural gas could cut global emissions by almost 30%, and implementing carbon-capture technologies could cut emissions nearly in half.\n\nIf this is accurate, seems like low hanging fruit which could have a tangible impact on carbon emissions. Could someone with subject matter expertise provide some insight?",
            "title_similarity": "0.79734",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h6j9vb4",
            "score": 1,
            "text": "But what percentage of global carbon emissions come from electricity generation? How is that not clearly stated other than to make this seem more significant than it likely is.",
            "title_similarity": "0.57296556",
            "sentiment_compound": -0.0638
        },
        {
            "id": "h6ja76d",
            "score": 1,
            "text": "What percentage of the worlds electricity comes from this particular 5% of power plants?",
            "title_similarity": "0.81919646",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jaej2",
            "score": 1,
            "text": "Are they actually outlier emitters if you normalize by energy produced? Looking only at total emissions would be biased towards the largest plants.",
            "title_similarity": "0.6135622",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jat1v",
            "score": 1,
            "text": "A crackdown on these plant could yield outrageous levels of pandemonium and suffering!",
            "title_similarity": "0.35145107",
            "sentiment_compound": -0.75
        },
        {
            "id": "h6jbv7v",
            "score": 1,
            "text": "“Global electricity generation” is a synonym for “large amounts of money to psychopaths”. So it won’t happen, won’t reduce, won’t be reported on, and won’t be stopped. But a nice dream.",
            "title_similarity": "0.44284183",
            "sentiment_compound": 0.6956
        },
        {
            "id": "h6jc73v",
            "score": 1,
            "text": "I say we take Bikini Bottom and push it somewhere else.",
            "title_similarity": "0.1928027",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jcfkw",
            "score": 1,
            "text": "But my Tesla is clean!",
            "title_similarity": "0.098317176",
            "sentiment_compound": 0.5916
        },
        {
            "id": "h6jchpm",
            "score": 1,
            "text": "At what point do we just destroy these places with non nuclear ICBMs?",
            "title_similarity": "0.37988615",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h6jcj4s",
            "score": 1,
            "text": "See the (power) plants are too blame!",
            "title_similarity": "0.3563624",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h6jcyt0",
            "score": 1,
            "text": "Just do it then already! So sick of reading about solutions and then governments don’t change anything. I cannot shut down a plant as an individual. Just do it.",
            "title_similarity": "0.29961488",
            "sentiment_compound": -0.5904
        },
        {
            "id": "h6jd6xh",
            "score": 1,
            "text": "We should have done this already.",
            "title_similarity": "0.03027564",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jd9i2",
            "score": 1,
            "text": "I think if I recall correctly 5 of the super polluters of the us [world?] 4 are in indiana...yay indiana.",
            "title_similarity": "0.7258021",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h6jeabn",
            "score": 1,
            "text": "One in twenty power plants, but what portion of energy production do they account for?",
            "title_similarity": "0.64150167",
            "sentiment_compound": 0.3919
        },
        {
            "id": "h6jf28j",
            "score": 1,
            "text": "Is the freaking world going to ever wake the hell up????",
            "title_similarity": "0.14592776",
            "sentiment_compound": -0.8541
        },
        {
            "id": "h6jf3vm",
            "score": 1,
            "text": "I think every nation should assist to help them along to close the bad ones down and get them something decent. Otherwise so many people will suffer in the small communities",
            "title_similarity": "0.41513303",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h6jf8db",
            "score": 1,
            "text": "We need more nuclear power.",
            "title_similarity": "0.31632805",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jfa1g",
            "score": 1,
            "text": "Bezos: pay for just 10 new power plants and we’ll quit hating you!",
            "title_similarity": "0.5655179",
            "sentiment_compound": -0.6114
        },
        {
            "id": "h6jfcgw",
            "score": 1,
            "text": "Probably depends on what country they’re from though",
            "title_similarity": "0.17432311",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jfdwg",
            "score": 1,
            "text": "But try convincing people to go nuclear instead let’s see how that goes. Which would have to be approved, built, then infrastructure built/transferred for it.",
            "title_similarity": "0.33503583",
            "sentiment_compound": 0.8047
        },
        {
            "id": "h6jfjzm",
            "score": 1,
            "text": "The real thing missing is amount of pollution per electricity produced. Are these high polluters simply the world’s largest power plants?",
            "title_similarity": "0.6901118",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h6jfsyl",
            "score": 1,
            "text": "should probably.alao include what % of the world's power comes from these plants as well. big difference between a massive plant and an inefficient one in terms of what you can do about it.",
            "title_similarity": "0.60810626",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h6jfuwh",
            "score": 1,
            "text": "What percentage of carbon emissions does electricity generation account for?",
            "title_similarity": "0.5269655",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jgo05",
            "score": 1,
            "text": "This is what the UN should be focusing on.",
            "title_similarity": "0.0025574341",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jgqj4",
            "score": 1,
            "text": "My god. The 1% really don’t care if we all die.",
            "title_similarity": "0.4110498",
            "sentiment_compound": 0.1725
        },
        {
            "id": "h6jhimd",
            "score": 1,
            "text": "If humans cannot responsibility nurture the planet back to health by now, then chances are they probably won’t survive. ( don’t count on an Ark this time either).",
            "title_similarity": "0.44264996",
            "sentiment_compound": -0.0608
        },
        {
            "id": "h6jhnlu",
            "score": 1,
            "text": "Sounds like a no-brainer. What's the hold up?",
            "title_similarity": "0.09491986",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6jhv8r",
            "score": 1,
            "text": "words words words just end globalization",
            "title_similarity": "0.18050814",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jhxyy",
            "score": 1,
            "text": "And what is the % contribution of power plants in total to total carbon emissions?",
            "title_similarity": "0.6753041",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jhzcx",
            "score": 1,
            "text": "Shame on these countries. They should be banned from all international events and associations along with sanctions on the products they sell.",
            "title_similarity": "0.3380934",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h6ji3oq",
            "score": 1,
            "text": "A better question is how much power do those powerplants make.\n\nBecause 5% in number could be providing 20-30% of the power",
            "title_similarity": "0.7779341",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h6jjguj",
            "score": 1,
            "text": "Wait so we are not to blame?  The small red led in my tv isn’t causing as much as Cruise shops and coal stations?! Shocker",
            "title_similarity": "0.5272906",
            "sentiment_compound": 0.2705
        },
        {
            "id": "h6jjwmf",
            "score": 1,
            "text": "Fusion power will revolutionize the world. It’s truly a shame for what humanity has done to this planet.",
            "title_similarity": "0.41955602",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h6jk4vr",
            "score": 1,
            "text": "These green peace groups need to start forming special ops units.",
            "title_similarity": "0.29864407",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h6jk6lj",
            "score": 1,
            "text": "So... Replace that competitively small list of power plants with nuclear, and basically save the world?\n\nThis seems like an easy problem... Identify the worst contributors, replace with the most comparable energy source that's non-carbon.\n\nProblem solved in 10 years for a couple trillion dollars globally.",
            "title_similarity": "0.6605005",
            "sentiment_compound": 0.3774
        },
        {
            "id": "h6jkqax",
            "score": 1,
            "text": "Carbon capture has many potential problems as well. Get off fossil fuels and bio-fuels completely.",
            "title_similarity": "0.4810893",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h6jl930",
            "score": 1,
            "text": "South Korea is a rich country. Germany you guys too? Japan? Come on. America does a lot of bad stuff but I'm glad we're not on this top 10 list.",
            "title_similarity": "0.50004536",
            "sentiment_compound": 0.7851
        },
        {
            "id": "h6jlnw1",
            "score": 1,
            "text": "Let's do it. This sounds like the right direction to start heading in.",
            "title_similarity": "-0.10076712",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6jltzq",
            "score": 1,
            "text": "As a society we need to get used to the concept of limited use utilities. Allow each household and business a certain number of hours of power during the day, after which it's shut off until the next day.",
            "title_similarity": "0.4792833",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6jmhg5",
            "score": 1,
            "text": "'Earth First' needs to get on this... uh, ya know. with a letter writing campaign ;)",
            "title_similarity": "0.058973487",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h6jo67m",
            "score": 1,
            "text": "Don’t forget the biggest pollution producer in the US is a major brand of chlorine for your clothes washer. The lobbying they do keeps it all quiet.",
            "title_similarity": "0.51450396",
            "sentiment_compound": -0.296
        },
        {
            "id": "h6joaor",
            "score": 1,
            "text": "I'm sure we would all be tragically surprised at how easy it actually would be to do much better.",
            "title_similarity": "0.29741636",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h6jodz3",
            "score": 1,
            "text": "Meanwhile, so many Central Illinois residents threw such a fuss about the once proposed, now in place, wind farms.",
            "title_similarity": "0.3790497",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jphgb",
            "score": 1,
            "text": "I like how the title uses 5% and then a fraction. Why not 5% and 75% or 1 twentyth and three quarters",
            "title_similarity": "0.534037",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6jq7hg",
            "score": 1,
            "text": "If only we could use logic to solve things like this.",
            "title_similarity": "0.12836497",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h6jqfzb",
            "score": 1,
            "text": "Ahhh the old Pareto Effect.",
            "title_similarity": "0.11148484",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jqr6k",
            "score": 1,
            "text": "Yet America bows down for climate change rules.\nMeanwhile in other place's they laugh at the foolish American people.\nMake rules only they follow.\nWe continue to grow and they continue to shrink.",
            "title_similarity": "0.4586158",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6jqzwc",
            "score": 1,
            "text": "Wow.\n\nYou think they’ll actually achieve it?  Or will they have to be forced like lazy entities?",
            "title_similarity": "0.20055819",
            "sentiment_compound": 0.2869
        },
        {
            "id": "h6jrqok",
            "score": 1,
            "text": "Belchatow … name checks out \nif this is true a little effort can have a big impact on emissions",
            "title_similarity": "0.42436665",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h6js5w7",
            "score": 1,
            "text": "This is so misleading. Who cares about the fraction of power plants? We should care about the fraction of energy. Of course big power plants emit more, that’s something everyone knows.",
            "title_similarity": "0.51592183",
            "sentiment_compound": 0.6215
        },
        {
            "id": "h6jsqij",
            "score": 1,
            "text": "Or, its reasonably easy and quick to change coal fired plants to natural gas.  Natural gas produces 57% as much CO2 as coal.  If we reduce 75% of the CO2 emissions by 43% we would get a 32% reduction in CO2 emissions.  Ten years building solar fields and we now produce 2% of electric energy with solar.  At that rate we'll get a 32% reduction in another 150 years. \n\nIf I may quote an old business saying, they're not picking the low hanging fruit.",
            "title_similarity": "0.8192546",
            "sentiment_compound": 0.7363
        },
        {
            "id": "h6jsrra",
            "score": 1,
            "text": "Might be a bit more useful if it rated plants on emissions per mwh generated.  A more efficient and cleaner burning plant can put out more emissions total if it's putting out massively more power.",
            "title_similarity": "0.52769613",
            "sentiment_compound": 0.8047
        },
        {
            "id": "h6jt2zi",
            "score": 1,
            "text": "these are probably the most efficient plants too. replacing them by many smaller less efficient plants will save the earth?",
            "title_similarity": "0.41067606",
            "sentiment_compound": 0.8316
        },
        {
            "id": "h6jupfu",
            "score": 1,
            "text": "Nooooo, we must tax plastic bags it’s the only way",
            "title_similarity": "0.26714742",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jurgi",
            "score": 1,
            "text": "“Switching their fuel source from coal or oil to natural gas could cut global emissions by almost 30%”",
            "title_similarity": "0.78581595",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h6jvscv",
            "score": 1,
            "text": "If this stat is true and the countries of the world can’t or won’t help remedy this, then there’s little hope for us.",
            "title_similarity": "0.32582903",
            "sentiment_compound": 0.7968
        },
        {
            "id": "h6jwakw",
            "score": 1,
            "text": "But yes, the 7-eleven plastic bag you threw in the trash is what's killing the world. Shame on you",
            "title_similarity": "0.43187067",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h6jwh37",
            "score": 1,
            "text": "Wait, 5% by number or by generating capacity? 'cause even though these plants aren't they most efficient or use dirtier fuels, they might be built to put out a lot of electricity, compared to smaller, cleaner plants.\n(Not trying to be an apologist, just looking for clarity in the stats)",
            "title_similarity": "0.71600556",
            "sentiment_compound": -0.0641
        },
        {
            "id": "h6jww40",
            "score": 1,
            "text": "I love seeing these articles.  while it's important for the average consumer to be efficient and save energy where possible - no amout of LED light bulbs will ever come close to 1 day's impact from these power plants.",
            "title_similarity": "0.50401807",
            "sentiment_compound": 0.8979
        },
        {
            "id": "h6jx3aq",
            "score": 1,
            "text": ">The Niederaussem facility near Bergheim, Germany, ranked among the top ten power plants for carbon emissions in 2018\n\nOh, you mean the Germany that's been shutting down their nuclear plants and picking up the slack with coal? That Germany?",
            "title_similarity": "0.6726483",
            "sentiment_compound": 0.2869
        },
        {
            "id": "h6jxhwi",
            "score": 1,
            "text": "Thorium nuke power plants should be discussed in the conversation.",
            "title_similarity": "0.2962072",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jyvql",
            "score": 1,
            "text": ">A crackdown on a limited number of ‘hyper-emitting’ power plants could yield outsize cuts in the carbon emissions resulting from global electricity generation.\n\nIt could also reduce the global electricity generation. Without an alternative *ready*, all this is just talk, since no government will ever decide that global warming is more important than electricity.",
            "title_similarity": "0.74295545",
            "sentiment_compound": -0.5294
        },
        {
            "id": "h6jzmki",
            "score": 1,
            "text": "What percentage of the global electricity do they produce?",
            "title_similarity": "0.48471284",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6jzrdu",
            "score": 1,
            "text": "There really needs to be an X-Prize style competition between countries, accounting for per capita points to do things to reduce greenhouse emmissions. Every country puts into a pot, 1% of their GDP for a year. Then they can compete to create the highest reduction in greenhouse emmissions in let's say 5 years. It could be the World Eco Olympics.",
            "title_similarity": "0.7270874",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h6k1cog",
            "score": 1,
            "text": "5% of power plants or 5% of power? Those 5% of plants could be the biggest in the world and generate 75% of power. premise is good but not worded well",
            "title_similarity": "0.79579425",
            "sentiment_compound": -0.0698
        },
        {
            "id": "h6k1en1",
            "score": 1,
            "text": "Instead of a war on drugs.. terrorism.. or \"for oil\"... I really wish the US would start a war on climate crisis... I'd be super happy to let my taxes go to a war I believed in for once.",
            "title_similarity": "0.4139582",
            "sentiment_compound": -0.8958
        },
        {
            "id": "h6k4631",
            "score": 1,
            "text": "Meat consumption would also make a significant impact",
            "title_similarity": "0.1714865",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h6k4kd3",
            "score": 1,
            "text": "How much does this 5% of three-quarters represent of the overall contribution of carbon emissions in total?",
            "title_similarity": "0.7975265",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6k4phc",
            "score": 1,
            "text": "Until China wants to not give us 2/3s of our pollution we're screwed",
            "title_similarity": "0.5629556",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h6k68et",
            "score": 1,
            "text": "5% of plants is nice and all, but wouldn't top 5% of energy production be more relevant? Not all plants output the same amount of energy.",
            "title_similarity": "0.73275214",
            "sentiment_compound": 0.6499
        },
        {
            "id": "h6k7ean",
            "score": 1,
            "text": "Also is it cool if we feed the CEO's to sharks?",
            "title_similarity": "0.34475642",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h6k7f78",
            "score": 1,
            "text": "Wow surprised SK is such a huge contributor vs China... Although not like we can get very reliable data from China anyway.",
            "title_similarity": "0.5027535",
            "sentiment_compound": 0.7087
        },
        {
            "id": "h6k7k69",
            "score": 1,
            "text": "Ban coal fired power plants would be a good start",
            "title_similarity": "0.40204564",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h6k8j5v",
            "score": 1,
            "text": "How do they count the plants? Is it really just five percent of electric power that comes from these super emitting plants? Or do the authors just count plants and ignore their power?",
            "title_similarity": "0.82644945",
            "sentiment_compound": 0.4479
        },
        {
            "id": "h6k9jp3",
            "score": 2,
            "text": "What kind of power plant are we talking about ? Because i thought nuclear powerplants didnt produce any carbon emmisions",
            "title_similarity": "0.48216727",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6kahva",
            "score": 2,
            "text": "are those perhaps coal burning power plants or something? is nuclear perhaps safer and more cleaner? hmmmm",
            "title_similarity": "0.48487318",
            "sentiment_compound": 0.6313
        },
        {
            "id": "h6kbl9k",
            "score": 1,
            "text": "5% by actual generated MWs, or by plant count?",
            "title_similarity": "0.6924815",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6kby37",
            "score": 1,
            "text": "Does this have to do with these power plants being massive or just in efficient?",
            "title_similarity": "0.43635988",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h6kc0j4",
            "score": 1,
            "text": "please tell me more about how i should recycle to save the planet.\n\ncorporate greed is ruining the planet. plastic is just a by-product of this corporate greed. to kill the snake, find its head and remove it.",
            "title_similarity": "0.43048006",
            "sentiment_compound": -0.765
        },
        {
            "id": "h6kc0wa",
            "score": 1,
            "text": "And how does anyone propose to replace these with lower emission plants? If people want their EV cars and \"save the planet\" they need to understand this much about the power plants that supply their electric as well as their added demand to the grid.",
            "title_similarity": "0.5079243",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6kc1m2",
            "score": 1,
            "text": "Things like this is why individual climate-change efforts are a scam (for the most part) pushed by those who actually COULD make a difference. The world doesn't live or die based on how well I recycle, save water, or compost. I dies because people and places like this are allowed to persist! \n\nStop telling everyone to help pull the cart, and start telling corporations and the rich to to hop off it!",
            "title_similarity": "0.50315297",
            "sentiment_compound": 0.925
        },
        {
            "id": "h6kcbo3",
            "score": 1,
            "text": "But nooooo, we are all responsible for global warming. What a joke.",
            "title_similarity": "0.41193348",
            "sentiment_compound": 0.7684
        },
        {
            "id": "h6kcnfy",
            "score": 1,
            "text": "Why are they still a thing anymore, like holy hell humans",
            "title_similarity": "0.06742174",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6kcrpa",
            "score": 1,
            "text": "How much of that fake ass picture is steam from the cooling towers in the picture. Just be honest.",
            "title_similarity": "0.34861392",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h6kd7mi",
            "score": 1,
            "text": "Too little too late. Needs to be done none the less.",
            "title_similarity": "0.06887862",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6kdecn",
            "score": 1,
            "text": "But try to turn of your lights when they're not in use. What a bad joke",
            "title_similarity": "0.29920012",
            "sentiment_compound": -0.4497
        },
        {
            "id": "h6kehnl",
            "score": 1,
            "text": "Just shutdown the capitalism ! It leads us toward death… that’s obvious",
            "title_similarity": "0.33441097",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6kfhfo",
            "score": 1,
            "text": "Also worth noting - 16 of the largest tanker ships pollute more than all the cars in the world combined. \n\nJust one of these pollutes as much as 50 million cars would.",
            "title_similarity": "0.70057523",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h6kfv4y",
            "score": 1,
            "text": "Sweet. Now strictly enforce high quality fuel standards for ships and stop with the black tar oil.\n\n\nSource of law: As of January 1, 2020, all ocean-going vessels in international waters must use cleaner marine fuel with lower sulfur content, transitioning from 3.5 percent by weight to 0.5 percent by weight, according to new rules from the International Maritime Organization",
            "title_similarity": "0.5182046",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h6kg0o8",
            "score": 1,
            "text": "According to NASA if CO2 emissions ended tomorrow the temp. would continue to rise for decades if not centuries.",
            "title_similarity": "0.4672425",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6kg5ug",
            "score": 1,
            "text": "so cars are not the issue all of a sudden? i dont have to get rid of my car? cool",
            "title_similarity": "0.25485384",
            "sentiment_compound": 0.3939
        },
        {
            "id": "h6kjj3d",
            "score": 1,
            "text": "Why can't we limit the electricity supply to non-essential things to save our world?\nPeople or companies should not use electricity as they want and as long as they want just because they have lots of money.",
            "title_similarity": "0.5077976",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h6kmb31",
            "score": 3,
            "text": "Cool, let's switch to nuclear",
            "title_similarity": "0.20743808",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h6kmfcn",
            "score": 1,
            "text": "It would like to know the power output of these. Else the number is pointless. If they also produce 2/3rds of energy then so what.",
            "title_similarity": "0.4760747",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h6kmi6x",
            "score": 3,
            "text": "Population demands forces production unfortunately, if they are forced to cut into their production it will probably translate in even more expensive cost of energy putting fragile families/individuals at risk of not benefitting from basic needs, or am I completely mistaken",
            "title_similarity": "0.48607293",
            "sentiment_compound": -0.8933
        },
        {
            "id": "h6ko71s",
            "score": 1,
            "text": "Why do we even have to ask at this point.",
            "title_similarity": "1.1528842e-05",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6kopz5",
            "score": 1,
            "text": "That’s a horrible conclusion without taking the amount of power generated into account.",
            "title_similarity": "0.32026607",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h6kp22b",
            "score": 1,
            "text": "Right. Exactly! But my Honda Civic emits too much carbon so we have to electrify it. Stupid.",
            "title_similarity": "0.53029287",
            "sentiment_compound": -0.7088
        },
        {
            "id": "h6kp7n3",
            "score": 1,
            "text": "THESE are the problems we need to solve regarding climate change. Banning the sale of new ICE cars (CA) just increases used car prices and hurts the poor. And its impact is dwarfed by the total co2 from just these 10 plants.",
            "title_similarity": "0.6000626",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h6kqq0w",
            "score": 1,
            "text": "Too little too late, if we were taken seriously years ago then we could have used measures like this.\n\nNow we have to shut down these plants and many more.",
            "title_similarity": "0.42577326",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h6kqvc2",
            "score": 1,
            "text": "Awesome share. Thanks!",
            "title_similarity": "-0.06927265",
            "sentiment_compound": 0.8588
        },
        {
            "id": "h6ktne0",
            "score": 1,
            "text": "So we can start by paying them to convert.",
            "title_similarity": "0.16900073",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6ktti5",
            "score": 1,
            "text": "\"... three quarters of carbon emissions *from electricity generation*.\"\n\nWe should deal with those, yes, but that's only part of a larger problem.",
            "title_similarity": "0.7349191",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h6kuuob",
            "score": 1,
            "text": "I believe this strategy is called \"tax the rich\".",
            "title_similarity": "0.32969475",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h6kw046",
            "score": 1,
            "text": "That is not news to most of us tbh, but nobody seems to care",
            "title_similarity": "0.2688733",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h6kw76o",
            "score": 1,
            "text": "Yeah, but if you crack down on that 5%, the next 5% will then be hyper-emitters. Focusing on individual plants without some kind of systemic change won't help us.",
            "title_similarity": "0.6696601",
            "sentiment_compound": -0.3153
        },
        {
            "id": "h6kwaa0",
            "score": 1,
            "text": "It looks like this is a bit misleading, since this is not normalized by the produced power. So if I build a huge natural gas power plant, which would be relatively clean, but 10 times bigger than the biggest power plant out there, it will still be one of the top 10 by emissions.",
            "title_similarity": "0.65901387",
            "sentiment_compound": 0.6542
        },
        {
            "id": "h6kxpjk",
            "score": 1,
            "text": "Try telling that to Australia's Prime Idiot.",
            "title_similarity": "0.23226312",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h6kyhgm",
            "score": 1,
            "text": "How much carbon goes up during one of our hundreds of wild fires in a year? We seem to be fucked.",
            "title_similarity": "0.6952013",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h6kzep9",
            "score": 1,
            "text": "This is why we need more nuclear power, it’s almost 100% zero emissions. Look into thorium reactors though, the chance of a Chernobyl like situation is negligible.",
            "title_similarity": "0.5856006",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h6kzkbx",
            "score": 1,
            "text": "There's too much opposition and regulation for LNG & natural gas that this will be slow.",
            "title_similarity": "0.47977936",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6kzx5x",
            "score": 2,
            "text": "And 16 supertankers account for an outsized proportion of sulfur emissions (more than all cars). Too bad people are scared of nuclear power.",
            "title_similarity": "0.6571913",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h6l082g",
            "score": 1,
            "text": "Good job renewables are getting even cheaper than coal every day then.",
            "title_similarity": "0.51916707",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6l1mar",
            "score": 2,
            "text": "Is the Final Fantasy 7 plot going to come to real life fruition...?",
            "title_similarity": "0.18440193",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6l39xf",
            "score": 2,
            "text": "But picture is a nuclear reactor which has no carbon emissions...",
            "title_similarity": "0.37607178",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h6l3cub",
            "score": 2,
            "text": "What’s the proportion of total carbon emission by electricity generation? The title is a fraction of a fraction of a fraction. Needs to be clearer",
            "title_similarity": "0.57723486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6l5uai",
            "score": 2,
            "text": "How about install a few nuclear and don’t run your air conditioners 24/7",
            "title_similarity": "0.455051",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6l7buj",
            "score": 1,
            "text": "People don't get that as usual a small percentage fucks the rest of us",
            "title_similarity": "0.40649295",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h6l7tdl",
            "score": 1,
            "text": "This is dumb. Those 5% of power plants may produce 90% of the electricity, we can't know unless they tell us, and they don't tell us.",
            "title_similarity": "0.82060266",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h6l8fnp",
            "score": 1,
            "text": "How would they ever convince china to switch from coal to natural gas? Coal would have to run out first",
            "title_similarity": "0.5281505",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h6l9x2m",
            "score": 1,
            "text": "we're in runaway climate change already. the time for change was decades ago.",
            "title_similarity": "0.48293424",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6la3qk",
            "score": 1,
            "text": "They need to get on top of cracking down on these power plants and stop making it seem like cars are emitting all the pollution",
            "title_similarity": "0.40441847",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h6lalpk",
            "score": 1,
            "text": "If you would like to make a direct impact on climate change, please consider donating to the National Forest Foundation to plant trees. $1 for 1 tree. Even $10 a month would really add up. https://www.nationalforests.org/tree-planting-programs",
            "title_similarity": "0.59107906",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h6lba1k",
            "score": 1,
            "text": "Why would we go after big polluters when we can raise taxes enough to increase government income without changing behaviour?",
            "title_similarity": "0.47470036",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h6lbejv",
            "score": 1,
            "text": "But what percentage of world power output do they account for?",
            "title_similarity": "0.39695925",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6lc7wl",
            "score": 1,
            "text": "its called a “pareto chart”",
            "title_similarity": "0.092189744",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6lcsag",
            "score": 1,
            "text": "At some point, possibly now, bombarding these plants would be completely justifiable from a National Security perspective for essentially every nation on Earth.",
            "title_similarity": "0.3916285",
            "sentiment_compound": 0.34
        },
        {
            "id": "h6lczik",
            "score": 1,
            "text": "But electric cars will save the world...",
            "title_similarity": "0.32163978",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h6lehir",
            "score": 1,
            "text": "you know what is a good solution to that ? nuclear power plants. Be like France",
            "title_similarity": "0.3886903",
            "sentiment_compound": 0.7717
        },
        {
            "id": "h6ley7k",
            "score": 1,
            "text": "I am sorry, but, no. That solution contains an insufficient opportunity for graft and corruption, as well as a minimal opportunity for politicians to enrich themselves.",
            "title_similarity": "0.37073827",
            "sentiment_compound": 0.9161
        },
        {
            "id": "h6lf0p0",
            "score": 1,
            "text": "Most likely because if the quality of coal they use because it's cheap. Lignite coal is very dirty. Bituminous coal is much cleaner burning.",
            "title_similarity": "0.4513994",
            "sentiment_compound": -0.3597
        },
        {
            "id": "h6lf7d5",
            "score": 1,
            "text": "I'm confused about where they found 221 countries. There were only 195 last time I checked.",
            "title_similarity": "0.46459165",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h6lg74v",
            "score": 1,
            "text": "Nice, so it's the same issue we see with the top 5% wealthiest people creating 90% of the societal issues.  Sounds like a recurring issue.",
            "title_similarity": "0.6397648",
            "sentiment_compound": 0.8885
        },
        {
            "id": "h6ljr5j",
            "score": 1,
            "text": "Where are those power plants? China? India?",
            "title_similarity": "0.45996928",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6lkksl",
            "score": 1,
            "text": "You know we have this amazing technology called FISSION, and we are on the 4th generation of Nuclear Reactors.\n\nWhat's so special about 4th Generation Nuclear?\n\nThe designs are PASSIVELY SAFE, and some are physically incapable of a meltdown, such as IMSR and LFTR as the fuel is in a melted state. Nuclear power IS the future if you realistically want to knock out the vast majority of carbon emissions.\n\nMotor vehicles are a major contributor to carbon emissions as are power plants, by switching to electric cars/trucks like the Tesla models, and replacing Natural Gas, Coal, and Oil plants over to Nuclear for power production (Oil will still be required for petroleum products, that's just a fact of life), we can knock out at least 65% of carbon emissions from 1st and 2nd world nuclear capable countries (which produce 90%+ of the worlds carbon emissions).\n\nThis means if you plug your Tesla car into the socket that is powered by a NPP you are essentially generating a net 0 carbon footprint (outside of the carbon used to produce things).",
            "title_similarity": "0.6388929",
            "sentiment_compound": 0.9381
        },
        {
            "id": "h6lkpdg",
            "score": 1,
            "text": "But then who's going to feed the plants and I'm talking about the chlorophyll containing plants",
            "title_similarity": "0.30978817",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6lm4g6",
            "score": 1,
            "text": "It’s ok. Room temp superconductors are here. https://www.rochester.edu/newscenter/rochester-sets-new-record-for-room-temperature-superconductor-455722/",
            "title_similarity": "0.3368057",
            "sentiment_compound": 0.0
        },
        {
            "id": "h6lmyga",
            "score": 1,
            "text": "If only there were some kind of eco-terrorist organization that would be willing to sabotage one of these nine reactors. Perhaps they could enlist the help of an ex-military mercenary. \n\nSomeone whose past is Clouded in mystery, and filled with Strife...",
            "title_similarity": "0.4924207",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h6lnhrm",
            "score": 1,
            "text": "Why don’t we bomb them? We’ve bombarded more for less.",
            "title_similarity": "0.3585326",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h6ls9m9",
            "score": 1,
            "text": "Drone strike the plants. Save the planet. That makes it easy to phase them out.",
            "title_similarity": "0.28245544",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h6lulf9",
            "score": 1,
            "text": "Need to repost that in r/de, #7 is in the state of our center right candidate Laschet who is a huge drag to ecological change and now after the floods, trying to greenwash his policies...",
            "title_similarity": "0.458153",
            "sentiment_compound": -0.34
        },
        {
            "id": "h6lvq40",
            "score": 1,
            "text": "Funny how we don’t look at Airliners. One jumbo jet burns 10 to 11 tonnes of fuel per hour at cruise. \n(Look it up) problem it will hit someone’s pocketbook or inconvenience the masses.  We all know we can’t have that.   :-(",
            "title_similarity": "0.5896061",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h6lyktr",
            "score": 1,
            "text": "I’d love for the people who have suddenly taken up the cause of “we have to get rid of workplaces because of transportation emissions” post-COVID.",
            "title_similarity": "0.32607117",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h6m2vo3",
            "score": 1,
            "text": "I wonder what it would cost to pay the owners of these plants to close indefinitely and rehab the buildings for a different use?",
            "title_similarity": "0.4313812",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h6m3jyp",
            "score": 1,
            "text": "And when regulatory crackdowns fail, cruise missiles generally succeed.",
            "title_similarity": "0.3753153",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h6mchln",
            "score": 1,
            "text": "Sounds like a job for nuclear",
            "title_similarity": "0.27402794",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h6mmtjk",
            "score": 1,
            "text": "Oh wow I wouldn't have thought of that. Nah, instead let's just try making people not fly in planes or drive cars or eat meat anymore. They are totally gonna be sold.",
            "title_similarity": "0.36480504",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h6njstt",
            "score": 1,
            "text": "Good. Cracking down on just a few plants could buy us the time we need to shut down the rest",
            "title_similarity": "0.442182",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h6ru7g2",
            "score": 1,
            "text": "like.. would it safe more lifes if we just nuke these plants? we really could need an co2 villian",
            "title_similarity": "0.42254078",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h6wso9s",
            "score": 1,
            "text": "Nuclear BAD has allowed this to get to this point. The population is easy to control through fear and other manipulative tactics.",
            "title_similarity": "0.33271196",
            "sentiment_compound": -0.6739
        },
        {
            "id": "h8mvk7m",
            "score": 1,
            "text": "Carbon engineering does carbon capture, they also are able to use that carbon to make fuel. We can use that technology and inturn use that carbon from these power plants⁷ to make carbon neutral fuel.\n\nThat would be cool!!",
            "title_similarity": "0.4706385",
            "sentiment_compound": 0.4374
        },
        {
            "id": "hdt6su0",
            "score": 1,
            "text": "To cut down carbon emission power plants can make use of element like boron which is a low-carbon emitting replacement for fossil fuel at the same time it is expected to be largest electricity source in the world in coming decades. One can learn more about boron on \"borates today\".",
            "title_similarity": "0.7417268",
            "sentiment_compound": 0.1027
        },
        {
            "id": "heu90be",
            "score": 1,
            "text": "Boron an element is expected to be a large electricity source by 2035. Wind turbines and solar panels are a great source of renewable energy which is carbon negative. Boron is also used in solar panels and wind turbines.",
            "title_similarity": "0.6208556",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfg48tg",
            "score": 1,
            "text": "A new report finds that pursuing an aggressive approach to cutting carbon emissions from the world’s highest-emitting power plants could yield outsized results at little incremental cost.",
            "title_similarity": "0.66590846",
            "sentiment_compound": -0.2732
        }
    ]
}