{
    "A toxic workplace triples your risk of depression, a new study finds. Companies that fail to reward or acknowledge their employees for hard work, impose unreasonable demands on workers, and do not give them autonomy are placing their staff at a much greater risk of depression.\n": [
        {
            "id": "h72qsr8",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.5005332",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h73kh5s",
            "score": 1,
            "text": "I dont know why im thinking about blizzard …. r/wow",
            "title_similarity": "0.36333644",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73jzgt",
            "score": 5,
            "text": "Today in \"World's Most Obvious Conclusions\".",
            "title_similarity": "0.12532593",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73i9jb",
            "score": 0,
            "text": "What if you have a wildly hard time preserving a work place as anything BUT that. That’s the boat I’m in and I can’t tell whats just me, what’s the culture and what’s the workplace",
            "title_similarity": "0.55544686",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h73rhiq",
            "score": 7,
            "text": "New study finds “if you don’t like most of your waking life you will be sad most the time you are awake!” \n\nWho gets paid to do these “studies”",
            "title_similarity": "0.76581264",
            "sentiment_compound": -0.2244
        },
        {
            "id": "h73q9b4",
            "score": 4,
            "text": "Who pays for these studies",
            "title_similarity": "0.25937733",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73sc5h",
            "score": -11,
            "text": "I really hate the way that \"toxic\" is apparently now the internet's official hyperbolic go-to word for anything bad.",
            "title_similarity": "0.6638973",
            "sentiment_compound": -0.8173
        },
        {
            "id": "h731dxc",
            "score": 2,
            "text": "Pretty sure we were all depressed when we got there.",
            "title_similarity": "0.5655948",
            "sentiment_compound": 0.296
        },
        {
            "id": "h7599jn",
            "score": -3,
            "text": "I'm actually getting tired of so many lame studies by supposed \"science\". In today's age always be wary of the phrase, \"studies suggest...\"\n\nLet me give you an example of what I mean. Do people realize that \"marriage is the leading cause of divorce.\"? \n\n\"and birth is the leading cause of death.\" \n\nAnd have you realized, \"meteors  always fall in craters?\"\n\nThink, diet pill. Every single one has always been pushed by a supposed, PhD. Remember? 9 out of 10 doctors recommend...\n\nVirtually every ounce of supposed social science... is perspective.\n\nProof? They can't even agree on a simple thing called Covid-19. \n\nThe only safety anyone has is to follow truth. And nowadays you may have to find that out for yourself.",
            "title_similarity": "0.710163",
            "sentiment_compound": -0.7467
        },
        {
            "id": "h73n8ot",
            "score": 47,
            "text": "Capitalism is the reason we're having a mental health crisis!",
            "title_similarity": "0.64578533",
            "sentiment_compound": -0.6588
        },
        {
            "id": "h739pxt",
            "score": 2,
            "text": "Dont become an amazon DA",
            "title_similarity": "0.26779848",
            "sentiment_compound": -0.1326
        },
        {
            "id": "h73natd",
            "score": 3,
            "text": "I can attest. Started taking antidepressants to get through this job. One month left until I’m out.",
            "title_similarity": "0.47019097",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73ruh1",
            "score": -9,
            "text": "Don't work there then.",
            "title_similarity": "0.19941595",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75dpfg",
            "score": 0,
            "text": "What is worse, a toxic workplace or a dead workplace (no one is there except you, and maybe a few others but you have no interaction with them)?",
            "title_similarity": "0.6278292",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h75tbr3",
            "score": 0,
            "text": "What are the best questions to ask in an interview to try and discover if the workplace is toxic?",
            "title_similarity": "0.598613",
            "sentiment_compound": 0.6369
        },
        {
            "id": "h73mt8v",
            "score": -14,
            "text": "\"Toxic\" has got to be the most unscientific word I've ever heard. And it doesn't surprise me that /r/science would embrace it.",
            "title_similarity": "0.5536462",
            "sentiment_compound": 0.1245
        },
        {
            "id": "h73ac37",
            "score": 10,
            "text": "Last thing I want is attention for doing a good job. I want as little attention as possible at work so I can do my own thing and get the work done my way.",
            "title_similarity": "0.46353412",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h73svid",
            "score": -10,
            "text": "Everything on my feed from this sub has been social science or psychology.\n\nI didn’t follow for this.\n\nIs there anyway to block these topics?",
            "title_similarity": "0.43026653",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h739kq0",
            "score": 5,
            "text": "r/medschool\nr/medicine",
            "title_similarity": "0.13304864",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73phy3",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.10745399"
        },
        {
            "id": "h74rbjj",
            "score": 1,
            "text": "Don't work for Panera Bread, or atleast the OC franchise locations, its all camel operated. #REZAOUT",
            "title_similarity": "0.3566013",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75ub16",
            "score": 1,
            "text": "I’d like to quit my marriage, this work environment is hostile.",
            "title_similarity": "0.67121553",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h73nyoe",
            "score": 8,
            "text": "*Blizzard did not like that*",
            "title_similarity": "0.43134552",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h73oujf",
            "score": 9,
            "text": "Every 60 minutes an hour goes by.",
            "title_similarity": "0.21388364",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73qdpc",
            "score": -2,
            "text": "No wonder amazon workers didn't unionize: they're depressed and oppressed",
            "title_similarity": "0.702649",
            "sentiment_compound": -0.4795
        },
        {
            "id": "h73ri3s",
            "score": -2,
            "text": "must visit the shipping industry with that.",
            "title_similarity": "0.27247703",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73tkno",
            "score": 2,
            "text": "“Companies that fail to reward or acknowledge their employees for hard work, impose unreasonable demands on workers, and do not give them autonomy are placing their staff at a much greater risk of depression.\" \n\nChallenge is that this is such a subjective and relative conclusion. One person’s definition of these qualifiers may vary greatly from another persons definition. \n\nWe—as a society—need to get to what truly defines a “toxic” workplace. That way you can hold employers accountable with objective metrics. And employees know the standard that is expected of them; anything less isn’t toxic, you just didn’t meet the standard. Until this happens we’ll just continue in this unproductive loop of blaming one another.",
            "title_similarity": "0.8515409",
            "sentiment_compound": -0.6908
        },
        {
            "id": "h73kpnb",
            "score": 4,
            "text": "I'm going to put this article on the front of my office door...",
            "title_similarity": "0.19117218",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73cp3e",
            "score": -5,
            "text": "Well. This certainly explains the USPS.",
            "title_similarity": "0.10506248",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h73ksuu",
            "score": 5,
            "text": "Lucky me. I have an asshole boss I’ve had to report to HR twice and I already have depression. Woo hoo.",
            "title_similarity": "0.7588074",
            "sentiment_compound": 0.296
        },
        {
            "id": "h73mry4",
            "score": 5,
            "text": "Wow that's great, they still don't care at all though",
            "title_similarity": "0.11021082",
            "sentiment_compound": 0.7409
        },
        {
            "id": "h73lte0",
            "score": -19,
            "text": "Study shows that not having any liberals in a workplace increases the mental health of everyone else.",
            "title_similarity": "0.74977696",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73psu4",
            "score": 38,
            "text": "I just started at a company that is completely toxic. It’s 30-year old “startup” with a founder who micromanaged everyone, including executives. So they micromanage their teams. The place is understaffed, I’m expected to get the work of 2-3 people done in a day. If I say it’s overwhelming or complain about 12+ hour days 6 days a week? Then I’m told no one is telling me to work that much. Well…no i guess that’s not exactly what they say, but they are telling me I am expected to finish the workload. The boss yells at people and belittles them. She has her pets (thank god I’m one of them) but if you’re not on her good side, you can expect to be ridiculed behind your back. Clients?? Well, we’ve lost many of them because the boss frequently yells at them. \n\nThe article says to leave or take a vacation. Well, I can’t do either. The former requires someone else to want me and the latter leaves me with 5x more work to do when I get back. \n\nThe article doesn’t mention how I imagine most of us in these toxic environments manage it: self medication. I can’t talk to a therapist cause I can’t afford it and my insurance won’t help me (yes I’m American). I can’t quit cause I have bills to pay. So I drink. And smoke. And I’ve started trying to microdose mushrooms to help with the depression. For me, the mushrooms are helping the most. Ymmv.",
            "title_similarity": "0.75916934",
            "sentiment_compound": 0.7924
        },
        {
            "id": "h73krwb",
            "score": 7,
            "text": "I'm very lucky to have my wife, pets and friends to survive the downturn of my work environment. It's been tough, and getting worse, but Ive got some good prospects on some different jobs",
            "title_similarity": "0.56797737",
            "sentiment_compound": 0.815
        },
        {
            "id": "h73jt8r",
            "score": 9,
            "text": "It gets old just being an ordinary, replaceable worker. I never thought being invisible would sting so much.",
            "title_similarity": "0.56943554",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7481te",
            "score": 9,
            "text": "Nursing enters the chat.",
            "title_similarity": "0.16749199",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73yfch",
            "score": 59,
            "text": "I really hate that nobody will believe poor people until there's 1500 peer reviewed studies definitely showing it's true.\n\nI've previously seen studies citing it doubled your risk of depression, so I guess workplaces are just becoming more emotionally abusive over time (not surprising)",
            "title_similarity": "0.84476215",
            "sentiment_compound": -0.9285
        },
        {
            "id": "h733mu0",
            "score": 45,
            "text": "I find it baffling that this sort of thing isn’t just common sense but at least it explains a lot for those who don’t have it.\n\nIn my experience it’s been very apparent these sort of things have had a negative impact on myself and those around me, including an odd tendency to discourage coworker friendship and encourage isolation.",
            "title_similarity": "0.6714103",
            "sentiment_compound": -0.7876
        },
        {
            "id": "h73g2lm",
            "score": 18,
            "text": "A lot of companies don’t care….soo…",
            "title_similarity": "0.5328366",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7361gb",
            "score": 81,
            "text": "Having to work 5 days a week (some 7) is depressing enough. I'll never understand the 'grinders' who work 80+ hours a week in an attempt to make it out of that situation. \n\nI make more than the comfort zone salary and I'm still stuck here. How much do you have to grind for to make it out? All you're doing is burning yourself out, which will make your depression that much worse when your body gives up.",
            "title_similarity": "0.75021076",
            "sentiment_compound": -0.8242
        },
        {
            "id": "h7357p1",
            "score": 132,
            "text": "Having met a lot of people I sincerely think some people understand this and are simply evil, extracting their self worth by walking over other people.",
            "title_similarity": "0.6419172",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h72umdg",
            "score": 444,
            "text": "[removed]",
            "title_similarity": "0.10745399"
        },
        {
            "id": "h73h4lb",
            "score": 25,
            "text": "Wow, that pretty much sums up the entire construction industry, at least in the US.",
            "title_similarity": "0.35442194",
            "sentiment_compound": 0.7906
        },
        {
            "id": "h73qsu1",
            "score": 106,
            "text": "Having worked in some extremely toxic environments, it definitely has had an effect on my mental health.\n\nIn one job, I was consistently the top performer. I was the dude everyone came to when they didn't know what to do. I trained new hires. Yet, management would regularly pull me in the office and wear me out and threaten my job. It was so bad that I would sit in my car outside the office and smack myself in the face to hype myself up enough to go in. I finally quit, and immediately felt like a weight had literally been lifted from my shoulders.\n\nMy last job was in a call center and while it wasn't as dire as the above example, constantly having everything I do tracked down to the second and audited definitely wore on me. I coped by being cynical. I went from being the bright-eyed, enthusiastic, extra mile type to just doing the bare minimum because doing the bare minimum was better for my metrics. It bled over into my personal life, and I just had no enthusiasm for anything.\n\nNow I have a job where I work independently at home. Yesterday I was jamming the hell out playing the air drums with my music blasting while I cranked out my work. So much happier.",
            "title_similarity": "0.8037857",
            "sentiment_compound": 0.6201
        },
        {
            "id": "h7348t5",
            "score": 150,
            "text": "I'd love to forward this to my manager. I was already depressed when I arrived but it sure as hell doesn't help.",
            "title_similarity": "0.7240627",
            "sentiment_compound": -0.7837
        },
        {
            "id": "h73cu7z",
            "score": 403,
            "text": ">not give them autonomy\n\nI had a job where  5 years into it I got a new manager, and I kept having to teach him how to do something, then immediately ask him permission to do the thing I just taught him how to do. If he hesitated to give permission, I then had to teach him why he absolutely had to give me the permission and the (sometimes legal) consequences of not letting me do it.\n\nHe always gave the permission but it was so belittling to me. I'd worked there 5 years and was basically the expert that everyone came to for help in that area, but I still had to get the OK for every little thing.\n\nIt was a major reason why I quit.",
            "title_similarity": "0.5361973",
            "sentiment_compound": 0.7935
        },
        {
            "id": "h73bz4k",
            "score": 545,
            "text": "It's very obvious that someone has been injured if they lose a limb or a finger in an industrial machinery accident. But, injuries like this are not looked at as \"real\" or something you need to \"get over\". I'm looking forward to a day where we can readily and authoritatively recognize mental damage from work environments and hold employers accountable, in precisely the same way as someone who is outwardly, physically injured.",
            "title_similarity": "0.74016744",
            "sentiment_compound": -0.8537
        },
        {
            "id": "h73prx9",
            "score": 189,
            "text": "My last job's work environment was so toxic I became the most depressed I've been in my life. Finally found a new job 5 years ago and it took a good 3 years to heal from that...including medication!   \n\n\nToxic jobs are often a result of shortcomings of the owners/managers and nothing to do with you. They're not able to solve an issue, so you become the scapegoat for those issues:  \n\\-It's not the company's business model that's unprofitable- it's your lack of productivity!  \n\\-It's not that the procedures are inefficient- you're not following them properly!  \n\\-It's not the products that have flaws- it's how you're handling customer service!  \netc  \n\n\nAfter finding a great place to work, I was shocked that a career could actually be enjoyable and fulfilling :D",
            "title_similarity": "0.77808404",
            "sentiment_compound": 0.6824
        },
        {
            "id": "h72x0jx",
            "score": 190,
            "text": "Basically all retail establishments",
            "title_similarity": "0.12802204",
            "sentiment_compound": 0.0
        },
        {
            "id": "h72rwwl",
            "score": 1199,
            "text": "I've been fortunate to work in a non-toxic  manufacturing environment. We all are fairly friendly, we help each other out. We're paid a monthly incentive bonus based on overall shipments, scrap, customer complaints, etc. We have a cookout every once in a while. Stuff like that makes everyone feel valued for their services and time. My particular work area is next to a garage door, and outside of that door are trees. The mental health boost of seeing trees nearby is HUGE when you run similar parts on CNC machines all day.",
            "title_similarity": "0.44994402",
            "sentiment_compound": 0.9692
        },
        {
            "id": "h747crh",
            "score": 430,
            "text": "Psychotherapist checking in: I’ve seen numerous examples of depression being essentially cured by quitting a job with toxic work environment. The sad part is, psychotherapy was required to help the person get to place where they felt strong enough to quit. \n\nThese work environments make people depressed, which consistently makes folks feel like they can’t escape either. \n\nIf you hate your job so much you are considering going to therapy, save yourself some time and money and just start applying to new jobs. Go to therapy too, if you want, but don’t delay the job search.",
            "title_similarity": "0.7950262",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h73vf3z",
            "score": 498,
            "text": "Also: workplace bullying, \"we are family\" workplaces, and the general pressure to be super productive, \"on\" all the time, always available to work even during your off time.",
            "title_similarity": "0.5792934",
            "sentiment_compound": -0.296
        },
        {
            "id": "h73wn9l",
            "score": 652,
            "text": "And restaurants are wondering why everyone’s quitting",
            "title_similarity": "0.5477149",
            "sentiment_compound": 0.0
        },
        {
            "id": "h740t70",
            "score": 497,
            "text": "A year past leaving a toxic work place.\n\nGlad I did, I don't think I'd have survived, but not sure I'll ever recover - just broke inside.\n\nIf you're in a toxic work place, get out as soon as you can, it's seriously not worth it and can mess up your entire life and those around you.",
            "title_similarity": "0.7818109",
            "sentiment_compound": -0.8516
        },
        {
            "id": "h73qsw2",
            "score": 649,
            "text": "I experienced this first hand. Turns out Im not \"not a morning person\". I just didn't want to get out of bed to face the day.",
            "title_similarity": "0.4490285",
            "sentiment_compound": 0.4548
        },
        {
            "id": "h73m20y",
            "score": 15,
            "text": "Oh yeah I was working one of those and was super depressed and stressed. Got a new job that’s reasonable and likes how I work and it’s incredible. Sometimes I find myself smilingly work for no reason and I don’t remember the last time I did that.",
            "title_similarity": "0.6626873",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h73sfti",
            "score": 99,
            "text": "THIS SUCKS! I'm going though this right now.. But I can't leave my job as I pay for my wife's education every month and its about the same as our rent. I'm a video editor if anyone needs one. I have a great portfolio with hundreds of videos if your interested. I can't handle this job anymore. I'm editing 16 wedding videos a month.",
            "title_similarity": "0.5486288",
            "sentiment_compound": 0.8401
        },
        {
            "id": "h73smc3",
            "score": 9,
            "text": "The exact reasons I left Amazon",
            "title_similarity": "0.20703821",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h73sp5e",
            "score": 2,
            "text": "I can attest to that. It got so bad I had to be on pills.",
            "title_similarity": "0.54984474",
            "sentiment_compound": -0.6696
        },
        {
            "id": "h73swr5",
            "score": 1,
            "text": "How about just overall working with people who are outright got mental issues and yell at people. Where is that one?",
            "title_similarity": "0.5807761",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73t1gs",
            "score": 79,
            "text": "I needed to see this today. It's not me, it's them. I need to leave.",
            "title_similarity": "0.29876235",
            "sentiment_compound": -0.0516
        },
        {
            "id": "h73t5xq",
            "score": 496,
            "text": "[removed]",
            "title_similarity": "0.10745399"
        },
        {
            "id": "h73tfmm",
            "score": 2,
            "text": "This kinda sounds like parenting, in a nutshell.",
            "title_similarity": "0.14097866",
            "sentiment_compound": 0.3008
        },
        {
            "id": "h73u4hw",
            "score": 8,
            "text": "I worked it a toxic workplace, it was awful. I also worked in a place where employees went to full weekends together, wearing the same shirts and hats, singing song in a bus. Those weekends were “mandatory”. I’m honestly not sure which one was the worst…",
            "title_similarity": "0.6375478",
            "sentiment_compound": -0.2411
        },
        {
            "id": "h73uxht",
            "score": 1,
            "text": "Thanks a lot restaurant industry. You broke me. I’ll never be the same again.",
            "title_similarity": "0.652352",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h73vg58",
            "score": 1,
            "text": "Well this certainly explains Kitchens and that type of workplace environment",
            "title_similarity": "0.24847484",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h73vh4r",
            "score": 1,
            "text": "*Cough* Bell, let's talk *cough*",
            "title_similarity": "0.12640545",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73vlje",
            "score": 10,
            "text": "This absolutely rings true for me. I work at a 911 dispatch and it checks all the boxes. It's a big \"Mean Girl's Club\". It is incredibly stressful due to emergency calls, lack of staffing, cops being assholes over the radio, no actual break periods (lunch time is scarf it down between calls and traffic stops or eat it cold), and don't even get started with adding warrant entries on top of all that. We're constantly told by people who can't do the job themselves (cops) that we suck. Finally the lack of autonomy is a big one too. It's like we're there to be pissed on by everyone else. I love helping people but I can't do it like I used to anymore. The job will destroy your mental faculties over time and I've seen it in many dispatchers that have come and gone. I'm now only part time there because I value my sanity more than money. If you're looking to be a dispatcher proceed with caution, make sure you have family and friends at the very least who can be there and support you on the bad days, and don't be afraid to ask for help yourself.",
            "title_similarity": "0.7477884",
            "sentiment_compound": -0.1833
        },
        {
            "id": "h73w6kp",
            "score": 1,
            "text": "Well that explains the current plight of the USAF. Thanks science!!",
            "title_similarity": "0.3748879",
            "sentiment_compound": 0.6792
        },
        {
            "id": "h73wa81",
            "score": 36,
            "text": "My mental health took a massive dive in the last six months and I attribute it entirely to a toxic work environment. Fortunately, I just obtained a job offer for a similar role that will nearly double my salary and likely result in less hours worked.",
            "title_similarity": "0.7712258",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73wjgb",
            "score": 1,
            "text": "I saved my company $10s of millions of dollars and never even got a thank you\n\nI hate it",
            "title_similarity": "0.6103034",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h73wxfr",
            "score": 1,
            "text": "Hold on...are you telling me that if you're unhappy at work it may have an impact on how you feel in all facets of your life? Color me shocked",
            "title_similarity": "0.7373977",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h73xfju",
            "score": 1,
            "text": "I'm honestly tired of seeing those \"new studies\" just confirming common sense.",
            "title_similarity": "0.5748838",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h73xm01",
            "score": 5,
            "text": "I’ve experienced that first hand.  It’s made me seek out jobs where I’m on my own a lot and rarely encounter management, which is great but I miss having work friends a great deal.",
            "title_similarity": "0.5220375",
            "sentiment_compound": 0.9267
        },
        {
            "id": "h73xz7d",
            "score": 137,
            "text": "This really speaks to me. I work two jobs. One is part time during the winter in a ski resort. The other is full time for a design firm.\n\nAt my full time job, it is all computer work. I make drawings, order samples, talk to clients, survey locations, and write emails. Pretty cushy on the surface. \n\nAt my part time job, i work outside in inclement weather conditions. Im responsible for ensuring the skiing terrain is safe for a relatively dangerous sport. I have to call ski patrol several times a season when i see someone crash. I have to deal with drunk tourists, mountain chads, ego-driven mom karens. \n\nGuess which job gives me a feeling of total emptiness and drove me to see a therapist for anger issues and depression. Yep, the office job. \n\nThe culture in my design job is one of middle-school gossip, invalidation, manipulation and management building themselves up by tearing others down. We're a small company without an HR firm and every hour you work is tracked down to 15 minute chunks. It has a high turnover rate and most people say they feel like they're in a daycare. Ive had my pay docked for taking my daughter to the emergency room. Its that kind of place. \n\nBy contrast, the job at the ski resort employs people who are friendly and enjoy being there. Despite the harsh nature of the job, the feeling i have at the end of the day is much better than the office job.",
            "title_similarity": "0.58851135",
            "sentiment_compound": 0.2989
        },
        {
            "id": "h73y3xd",
            "score": 3,
            "text": "This kind of work environment was the reason I changed careers. Absolutely fried me. As soon as you start feeling the pressure, get out! If you love the thing that you do, don't let a bad employer take that from you.",
            "title_similarity": "0.7356051",
            "sentiment_compound": 0.7678
        },
        {
            "id": "h73y64w",
            "score": 1,
            "text": "In other \"News\", Sky blue, Water wet",
            "title_similarity": "0.053081214",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73y8ab",
            "score": 1,
            "text": "But does it increase profitability?",
            "title_similarity": "0.26126295",
            "sentiment_compound": 0.6808
        },
        {
            "id": "h73yanu",
            "score": 13,
            "text": "And for some reason some  people are unsure of why the military has these problems in spades.",
            "title_similarity": "0.43006283",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h73yhy7",
            "score": 1,
            "text": "You could have just changed the titles to “working in the navy….”",
            "title_similarity": "0.24557248",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73yrdy",
            "score": 1,
            "text": "Or in other words \"the army\"",
            "title_similarity": "0.03003719",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73z8s2",
            "score": 2,
            "text": "Some even give their workers pizza parties after 20+ people write a letter about how toxic the work environment is.",
            "title_similarity": "0.65067977",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h73zmhm",
            "score": 1,
            "text": "Posted a month ago with a different link : https://www.reddit.com/r/science/comments/o7k1ee/toxic_workplaces_increase_risk_of_depression_by/",
            "title_similarity": "0.60251427",
            "sentiment_compound": 0.0
        },
        {
            "id": "h73zna4",
            "score": 1,
            "text": "With a neverending supply of desperate people, I'd wager they don't care. Look at Amazon, they're not an outlier, they're just the most visible.",
            "title_similarity": "0.5555212",
            "sentiment_compound": -0.4986
        },
        {
            "id": "h7407et",
            "score": 9,
            "text": "My last place was exactly like this.  Pierce MFG can eat my ass, if you see a fire truck theres a 50/50 chance its made from them.  They can eat my ass.\n\nThis not only causes depression, but results in new employees that were supposed to be replacing retirees leave for other companies.  If you have a product that takes years to learn you shouldnt be paying bottom dollar.  The only people that stay are the old fucks who still have their pensions and have invested so much time into the company they literally cant leave.  Everybody else that can get out does.  \n\nThen the company wants to turn around and go \"why is our product coming back so often for warranty repairs\" like its some big ass mystery",
            "title_similarity": "0.7802701",
            "sentiment_compound": -0.8262
        },
        {
            "id": "h7409ac",
            "score": 1,
            "text": "That's my job for the government right there. Being a contractor sucks",
            "title_similarity": "0.60473824",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h740cw7",
            "score": 1,
            "text": "Hello Accounting! :D Audit BABY!!!!",
            "title_similarity": "0.31563997",
            "sentiment_compound": 0.7352
        },
        {
            "id": "h740nxk",
            "score": 6,
            "text": "I thought that was the point. Completely crush their souls, remind them daily they are replicable, take any credit for ideas they have, and dangle the paycheck needed to survive over their heads. I thought that was the base model for capitalism",
            "title_similarity": "0.65951204",
            "sentiment_compound": 0.1796
        },
        {
            "id": "h740p8w",
            "score": 1,
            "text": "Wow, they describes grad school really well!",
            "title_similarity": "0.19077624",
            "sentiment_compound": 0.7569
        },
        {
            "id": "h740s73",
            "score": 9,
            "text": "So basically every US emergency and ICU department in the country right now is operating at the managerial level to cause depression upon the staff of people actually doing the risky and real work.",
            "title_similarity": "0.81986696",
            "sentiment_compound": -0.7964
        },
        {
            "id": "h740t2t",
            "score": 3,
            "text": "Sounds like every job I’ve worked since I was 16.",
            "title_similarity": "0.18233144",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h740u9k",
            "score": 1,
            "text": "And workplaces that fire you dont have to care about it either.",
            "title_similarity": "0.51535684",
            "sentiment_compound": -0.6159
        },
        {
            "id": "h7412z8",
            "score": 54,
            "text": "This hits me so hard. My current boss is not trustworthy. He's spineless, he shields his decisions behind human resources policies, he doesn't treat employees equally, and he has absolutely no ability to respond to any form of confrontation. He treats me and my counterpart differently, he BCCs constantly on email, and I know for a fact that I make $20k more a year than my counterpart. \n\nMy team trusts me, they know I'll have their back no matter what and if a policy is keeping them from success, I'm going to break that policy and affect change at the company. I'm quitting my job because of my boss and when I told my team I was leaving, over half of them asked if they could come along.  \n\nI hate leaving, I actually love my job, but my boss is just a complete disaster. He's nice and likable but he's a terrible leader and I don't trust him at all.",
            "title_similarity": "0.80164087",
            "sentiment_compound": -0.904
        },
        {
            "id": "h7413kh",
            "score": 6,
            "text": "Imagine that—treating people like human beings prevents depression. Who’d have thunk it.",
            "title_similarity": "0.41339532",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h741bs8",
            "score": 1,
            "text": "I just quit my job due to a toxic workplace today, my depression and anxiety was getting so bad it just wasn’t worth the paycheck anymore.",
            "title_similarity": "0.82371503",
            "sentiment_compound": -0.8398
        },
        {
            "id": "h741dmm",
            "score": 1,
            "text": "This and other things businesses don't give a shot over as long as you keep making them money. When your output falls they will replace you with fresh meet and keep the money flowing.",
            "title_similarity": "0.6283275",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h741mpz",
            "score": 2,
            "text": "UHC be like...\n\nI can't afford to see a therapist but please keep sending me emails on what the board of directors learned on their company funded ski trips.",
            "title_similarity": "0.55237865",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h741ozc",
            "score": 1,
            "text": "Our corporate culture has taken a decided shift to the toxic.  It was easily foreseeable and I'll spare you all the details.  The journey however began with the appointment of the first ever American CEO of what had always been a Canadian run company.  It's been five years now. Gone is the sense of camraderie and cooperation, respect for life outside of work, and honesty.  Repeat the lies, hide the truth, screw over colleagues, reap the rewards.",
            "title_similarity": "0.54301184",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h741tcq",
            "score": 3,
            "text": "I haven't even gotten my second paycheck at this place...and both managers have already invited me to walk out and not come back on separate occasions...I've never had an employer speak to me that way, or get angry with me so early in. I do a good job and extra work without being asked while those 2 bicker all day every day. Im on my feet 7-11 hours doing dishes and prep with only a couple 5 minute breaks here and there. I almost walked out yesterday, but I'm toughing it out to pay my overdue bills. Started a second job yesterday too. All the while I live out my car to pay everything off faster. Lord, help me. Thank goodness I'm getting to watch a friends place so for a few days I can sleep inside.",
            "title_similarity": "0.58638906",
            "sentiment_compound": 0.9153
        },
        {
            "id": "h741ud4",
            "score": 2,
            "text": "A toxic environment makes you feel bad? \n\n*SurprisedPikachu.jpg*",
            "title_similarity": "0.63213205",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h741vkc",
            "score": 1,
            "text": "Someone should start a toxic tech companies thread. I've done time at Salesforce, LinkedIn, Yelp and a big 4 consulting firm",
            "title_similarity": "0.52439463",
            "sentiment_compound": 0.0
        },
        {
            "id": "h741wam",
            "score": 2,
            "text": "Ever since I insisted on *not* taking my job seriously me mental health got a noticeable boost.",
            "title_similarity": "0.5540981",
            "sentiment_compound": 0.25
        },
        {
            "id": "h7420hq",
            "score": 1,
            "text": "It’s fine we will get to do some “awareness” training and learn about the risks of suicide and stuff. That will make everything better right? RIGHT? *nods head to corporate overlord* \n\nAnyone else noticed as of recently a lot of this type of training is popping up? Must be covid, couldn’t be the work environment…",
            "title_similarity": "0.6512965",
            "sentiment_compound": -0.533
        },
        {
            "id": "h742p4n",
            "score": 2,
            "text": "Blizzard needs to read this",
            "title_similarity": "0.34954172",
            "sentiment_compound": 0.0
        },
        {
            "id": "h742pkt",
            "score": 3,
            "text": "Companies run by inhuman ghouls and criminal psychopath CEOs are a threat to public health and the public interest https://www.independent.co.uk/news/world/australasia/psychopaths-ceos-study-statistics-one-five-psychopathic-traits-a7251251.html",
            "title_similarity": "0.76268137",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h743p41",
            "score": 2,
            "text": "And since that might not mean anything to sociopathic CEO's...that means lower productivity, higher turn-over and higher sick costs...less money for you.",
            "title_similarity": "0.68559015",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h743py0",
            "score": 1,
            "text": "This is a big reason teachers are so hard to retain. It is very toxic when you constantly do well and get absolutely no thanks or even monetary rewards.",
            "title_similarity": "0.72492456",
            "sentiment_compound": 0.2364
        },
        {
            "id": "h743zbl",
            "score": 1,
            "text": "Oh hey, that happened to me",
            "title_similarity": "0.037682824",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7448z2",
            "score": 2,
            "text": "The scary part is if you speak about it, they will silence you.",
            "title_similarity": "0.5308282",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h744u5o",
            "score": 1,
            "text": "Let me just forward this to my divisions VP and see how that goes ~",
            "title_similarity": "0.21569282",
            "sentiment_compound": 0.0
        },
        {
            "id": "h744vmb",
            "score": 1,
            "text": "Huh so that's why my country has a mental health crisis.\n\nAmong many other things",
            "title_similarity": "0.512061",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h744vvo",
            "score": 5,
            "text": "Then I'm safe, already got the depression",
            "title_similarity": "0.18400086",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h7453mt",
            "score": 1,
            "text": "I worked in municipal government in a large Canandian city for 10 years, I had to leave. The lack of recognition for employees wanting to do the best job possible, made people just not care after a while. Do a bad job, do a good job, or do a great job, all were treated the same. The people wanting to create a great city, just left to go into the private sector. The rewards and recognition were better, but it’s not hard to beat nothing. Also the managers favouring their friends, and not reprimanding their bad behaviour (sexual, and mental harassment), made the work place even more toxic. The only people who spent their whole careers in my department were the bad employees, they just didn’t care about the job, the regular pay cheque was all they wanted. It really opened my eyes as to the problems in government, and made me a better leader. I used the lessons of a truly toxic workplace, to try and create a fair and balanced workplace.",
            "title_similarity": "0.70716965",
            "sentiment_compound": 0.9707
        },
        {
            "id": "h745679",
            "score": 1,
            "text": "Took them long enough to figure out how it feels to work in the service industry…",
            "title_similarity": "0.43411267",
            "sentiment_compound": 0.0
        },
        {
            "id": "h745d0b",
            "score": 1,
            "text": "Instead they give performance reviews and make up some non-sense so that you can't receive a raise.",
            "title_similarity": "0.45594347",
            "sentiment_compound": 0.0
        },
        {
            "id": "h745x9p",
            "score": 2,
            "text": "Almost every job I’ve had has in a way been toxic. Dairy Queen, dutch bros, Intuit and now Starbucks. Corporations are literally the worst you’re just a number to them.",
            "title_similarity": "0.7136092",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h745xul",
            "score": 25,
            "text": "Restaurants: \"Why does no one want to work anymore?\" \n\nLiterally have a degree in biomedical engineering and a masters in economics but fell on hard times so I gt a job in a restaurant. Still got talked down to like I was simple and compeltely unacknowledged about the systems of efficiency I implemented with the very little amount of autonomy I did have.",
            "title_similarity": "0.60852855",
            "sentiment_compound": 0.8051
        },
        {
            "id": "h745zk6",
            "score": 36,
            "text": "All of our employees are upset and don't want to work?\n\nPizza lunch!",
            "title_similarity": "0.6515087",
            "sentiment_compound": -0.4791
        },
        {
            "id": "h746ppx",
            "score": 3,
            "text": "Someone show this to CVS. Those poor workers.",
            "title_similarity": "0.49133673",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h746w1d",
            "score": 1,
            "text": "Yet another thing I have always known. We didn't need Science ™ to tell us this. This has always been true.",
            "title_similarity": "0.11109096",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h747da7",
            "score": 1,
            "text": "What is a good way to reward and acknowledge them?",
            "title_similarity": "0.14358707",
            "sentiment_compound": 0.765
        },
        {
            "id": "h747ik6",
            "score": 1,
            "text": "Why are these people studying the obvious? Push the boundaries a little.",
            "title_similarity": "0.26370013",
            "sentiment_compound": 0.0
        },
        {
            "id": "h747o8p",
            "score": 1,
            "text": "Serious question: Why shouldn't the government track the jobs of people getting treatment for depression, and name, shame, and fine the worst offenders? This has externality written all over it.",
            "title_similarity": "0.7805679",
            "sentiment_compound": -0.9169
        },
        {
            "id": "h747raq",
            "score": 1,
            "text": "This is literally to a T...my last job and they wondered why my attitude declined after 11 years.",
            "title_similarity": "0.53935355",
            "sentiment_compound": 0.0
        },
        {
            "id": "h748ct8",
            "score": 1,
            "text": "Its where you spend approximately a third of your days during the work week. If you dont feel comfortable for 8 hours 5 days a week, it would be ridiculous to think that doesnt have an effect on your mental health",
            "title_similarity": "0.6118563",
            "sentiment_compound": -0.6372
        },
        {
            "id": "h748qqa",
            "score": 1,
            "text": "Makes sense considering I spend about 1 third of my life at work.",
            "title_similarity": "0.29533327",
            "sentiment_compound": 0.0
        },
        {
            "id": "h748sq7",
            "score": 1,
            "text": "My anecdote:\nI worked for a private business for a few years. Went into the office everyday, unless I was feeling sick or unable to go to the office, then I would either call in or work from home depending on how I felt. No problems. I was happy working and felt taken care of. \n\nCOVID hits and we're all ordered to work from home. No problems there! We end up having the most successful year of business during that time.\n\nThen in April of this year we're ordered to return back to the office. Leadership had turned over at the end of 2020, so there's an odd incentive to get everyone back in the office.\n\nI worked from home on a Friday since returning back to the office because I wasn't feeling well and thought better to keep it at home and not bring it in the office. The following Monday my Boss's Boss sends me an email (and everyone else that didn't come into work) asking for my justification for working remotely (we don't have a formal policy, but I did contact my direct supervisor and Boss about my situation on Friday). As it turns out, HR was monitoring all the badge swipes at the employee entrance and was providing reports to the senior leadership, having them follow up on why employees weren't showing up.\n\nLong story short, I got out of there because of the terrible working conditions and the torpedoed, toxic work culture. I no longer felt recognized or taken care of, and micromanagement had increased severely. There was a lot of cognitive dissonance from what Leadership was saying and what they were actually doing. \n\nToday, I'm much happier as a result!",
            "title_similarity": "0.5054576",
            "sentiment_compound": 0.776
        },
        {
            "id": "h748xe5",
            "score": 1,
            "text": "This describes the vast majority of jobs in the entertainment industry, where being treated like crap is acceptable.\n\nNo wonder all my coworkers are depressed (and depressing).",
            "title_similarity": "0.7599131",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h748zxl",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.14481676"
        },
        {
            "id": "h7492bj",
            "score": 3,
            "text": "This is my job right now. We lost 8 in my department. Now it's just me and another guy. We are doing the work of many people...with no increase in pay, no title change, no thank you or acknowledgment for holding it down for almost two years, and continued pressure to take on even more work that we weren't even hired for in the first place. Time to leave.",
            "title_similarity": "0.63662875",
            "sentiment_compound": -0.8545
        },
        {
            "id": "h74986q",
            "score": 2,
            "text": "I can’t believe this is considered to be new news …..",
            "title_similarity": "0.36053202",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7499y1",
            "score": 1,
            "text": "This seems super familiar. I've been more and more depressed over the last few years and it almost directly coincides with changes at work that have completed changed the culture from what it was into the toxic mess that it is now.",
            "title_similarity": "0.7324623",
            "sentiment_compound": -0.352
        },
        {
            "id": "h749b75",
            "score": 1,
            "text": "Man, here I was thinking a toxic workplace only doubled my depression. I'm glad at least someone is answering life's toughest questions, no human would have ever been capable of knowing otherwise.",
            "title_similarity": "0.76531625",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h749ckp",
            "score": 35,
            "text": "[deleted]",
            "title_similarity": "0.14481676"
        },
        {
            "id": "h749cvc",
            "score": 2,
            "text": "R/OctoberStrike \n\ncure what ails ya,come fight with us!",
            "title_similarity": "0.49215204",
            "sentiment_compound": -0.4389
        },
        {
            "id": "h749ddu",
            "score": 14,
            "text": "[deleted]",
            "title_similarity": "0.14481676"
        },
        {
            "id": "h749oa9",
            "score": 1,
            "text": "I work in a very very toxic  workplace and it’s messing up my mental health and idk any other job to go work :(",
            "title_similarity": "0.82649237",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h749pck",
            "score": 1,
            "text": "They’re totally gonna read this and change their ways",
            "title_similarity": "0.25362697",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74b2oe",
            "score": 1,
            "text": "> ...fail to reward or acknowledge their employees hard work\n\nGod, this was a company that I worked for a while back. Medical device company that \"made the game\" they were in, but damn if it wasn't a meat grinder for the engineers, there. Sales and marketing got all the glory while the engineers were working tirelessly under a director who had no business being in his position, and my manager was a tyrant of his own.\n\nThe chief engineer had been there \"since the beginning\", so his word was gospel... But like the Bible, there were so many inconsistencies you could drive a Mac truck through the holes. But God forbid you question his instructions.\n\nWorked there for almost three years and I rejoiced when I finally found another job.",
            "title_similarity": "0.67476296",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h74b7yt",
            "score": 3,
            "text": "In my experience it doesn't take a lot of mistreatment to become depressed.  I just think that most people think the depression is normal.",
            "title_similarity": "0.35338047",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h74b94q",
            "score": 1,
            "text": "Nurse here. Can vouch.",
            "title_similarity": "0.05516718",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74bgcv",
            "score": 2,
            "text": "I mean, they *are* placing their employees at greater risk…..they just *do not care*.",
            "title_similarity": "0.7337891",
            "sentiment_compound": -0.033
        },
        {
            "id": "h74bhj1",
            "score": 1,
            "text": "As everyone is different and depression is more like a personal issue, I don't think \"triples\" accurately describes this potential. But it is obvious that it is an important factor.",
            "title_similarity": "0.69239223",
            "sentiment_compound": 0.1893
        },
        {
            "id": "h74bhls",
            "score": 1,
            "text": "A good work environment is crucial to mental health. Being surrounded by good people u can actually trust, and not only on the job. Having a beautiful environment, such as mountains or trees definitely makes a job a lot better.",
            "title_similarity": "0.43550664",
            "sentiment_compound": 0.9559
        },
        {
            "id": "h74c3h7",
            "score": 6,
            "text": "With all these stories where the hell are people finding the money to pay double price for a house from a year ago?",
            "title_similarity": "0.5714879",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h74di23",
            "score": 3,
            "text": "Welcome to the world of they don't give a f***",
            "title_similarity": "0.13329625",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h74dq13",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.10745399"
        },
        {
            "id": "h74duc0",
            "score": 1,
            "text": "What about hostile workplace from workers (retail) that are very fake?",
            "title_similarity": "0.74089754",
            "sentiment_compound": -0.7178
        },
        {
            "id": "h74e4av",
            "score": 2,
            "text": "Wait, so the thing making you miserable is making you miserable?",
            "title_similarity": "0.5189011",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h74eul1",
            "score": 2,
            "text": "Forget depression, my last job gave me ptsd.",
            "title_similarity": "0.47883558",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h74f6g7",
            "score": 1,
            "text": "Oh hey, this is me! For the last 3 years I've bounced around to multiple different departments within the same hospital and each one has been toxic. I've been fighting like hell to stave off the depression but it's finally catching up to me now. Too bad they have me by the balls because they're paying for my school.... 1 more year left and I get my sanity back!",
            "title_similarity": "0.6399546",
            "sentiment_compound": -0.8881
        },
        {
            "id": "h74foii",
            "score": 1,
            "text": "It took less than 6 months with a new toxic boss for me to walk off the job because of just how bad my depression was. I was on the verge of a breakdown. Now that I’m healing I can’t believe how low I had gotten during that time. I was truly in survival mode because of just how much stress I was under. I thought I was good at standing up for myself but I will never let myself get to that point again. Unless you’re part of a select few your workplace simply does not care about you, and sacrificing for them is not worth your health.",
            "title_similarity": "0.7973753",
            "sentiment_compound": -0.822
        },
        {
            "id": "h74fqjc",
            "score": 2,
            "text": "So every warehouse and factory, EVER.\n\nIt seems like these places are where dreams go to die and numpty people take advantage of the poor.",
            "title_similarity": "0.603986",
            "sentiment_compound": -0.2023
        },
        {
            "id": "h74fro6",
            "score": 2,
            "text": "Hmm sounds like the environment I work in at Whole Foods. Used to be great but Amazon ruined it.",
            "title_similarity": "0.6027249",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h74fyx4",
            "score": 1,
            "text": "For real.  I left my old job because I just couldn't deal with the management and some very negative colleagues (related to the business owner...). I was in a huge rut and felt work-based depression constantly,  ground my teeth in my sleep,  lashed out at the wrong people etc.\n\nSure enough when I started my new job it was so much more open and friendly. In the orientation there was a bullying/equality policy which highlighted about 90% of things my old colleagues did as grounds for dismissal!",
            "title_similarity": "0.8145672",
            "sentiment_compound": -0.6151
        },
        {
            "id": "h74g0wk",
            "score": 1,
            "text": "They do not care, if you are depressed you are less likely to stick up for yourself and more likely to become a drone, this is what they want",
            "title_similarity": "0.5622481",
            "sentiment_compound": -0.6836
        },
        {
            "id": "h74gaqh",
            "score": 1,
            "text": ">...impose unreasonable demands on workers...\n\n...aaaaand this is why I quit my job.",
            "title_similarity": "0.7523687",
            "sentiment_compound": -0.296
        },
        {
            "id": "h74ghv7",
            "score": 1,
            "text": "Sounds a lot like Enterprise Rent-A-Car.",
            "title_similarity": "0.14473483",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h74glb1",
            "score": 1,
            "text": "This is a long way to spell CVS",
            "title_similarity": "0.30933368",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74gq34",
            "score": 1,
            "text": "Quick lets drug those people or have them to purchase commodified emotional support",
            "title_similarity": "0.3732015",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h74h3s2",
            "score": 1,
            "text": "Wish I could tag HomeWorks energy",
            "title_similarity": "0.2748553",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h74h6ze",
            "score": 1,
            "text": "Wish I could tag HomeWorks Energy",
            "title_similarity": "0.2748553",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h74hdal",
            "score": 1,
            "text": "These studies are getting more and more obvious",
            "title_similarity": "0.1694655",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74hqxr",
            "score": 2,
            "text": "Yup. I was fine until I worked for three terrible places back to back. I ended up with my low level anxiety (that I didn’t really realize was there, I thought it was “normal”), that turned into full blown terrible anxiety after going through so much stress at work.",
            "title_similarity": "0.76162124",
            "sentiment_compound": -0.8996
        },
        {
            "id": "h74i51u",
            "score": 1,
            "text": "Left a good paying job that I didn't hate because the toxic work environment. I had already graduated high school and yet somehow I was right back in it. My sanity was way more important to me than that bridge.",
            "title_similarity": "0.5765606",
            "sentiment_compound": 0.79
        },
        {
            "id": "h74icjh",
            "score": 3,
            "text": "I work in as a web developer for a fintech company and just knowing that they want us to go back 100% to the office soon gives me incredible anxiety just thinking of the amount pf traffic I’m going to face. Looking for a new job has not been great with companies asking for so much more than what is done in a daily basis and moving closer is not an option due to the extreme cost of living and my employer doesn’t give any raises. Feels like they want us to become stuck there so that they don’t loose us instead of actúa giving us better incentives to work harder. Hell one of their competitors was offering positions and hired about 12 developers from my employer until they received a cease and desist from my employer to stop them from giving jobs we want.\n\nI now take anxiety and stress medication thanks to them.",
            "title_similarity": "0.7734047",
            "sentiment_compound": -0.5554
        },
        {
            "id": "h74igjv",
            "score": 1,
            "text": "Looking at you, Lippert Components Inc.",
            "title_similarity": "0.12337226",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74ik9u",
            "score": 2,
            "text": "[Link to full paper](https://bmjopen.bmj.com/content/11/6/e044133)\n\nAbstract:\n\n>**Objectives:** This study sought to assess the association between long working hours, psychosocial safety climate (PSC), work engagement (WE) and new major depression symptoms emerging over the next 12 months. PSC is the work climate supporting workplace psychological health.  \n>  \n>**Setting:** Australian prospective cohort population data from the states of New South Wales, Western Australia and South Australia.  \n>  \n>**Participants:** At Time 1, there were 3921 respondents in the sample. Self-employed, casual temporary, unclassified, those with working hours <35 (37% of 2850) and participants with major depression symptoms at Time 1 (6.7% of 1782) were removed. The final sample was a population-based cohort of 1084 full-time Australian employees.  \n>  \n>**Primary and secondary outcome measures:** The planned and measured outcomes were new cases of major depression symptoms.  \n>  \n>**Results:** Long working hours were not significantly related to new cases of major depression symptoms; however, when mild cases were removed, the 41–48 and ≥55 long working hour categories were positively related to major depression symptoms. Low PSC was associated with a threefold increase in risk for new major depression symptoms. PSC was not related to long working hours, and long working hours did not mediate the relationship between PSC and new cases of major depression symptoms. The inverse relationship between PSC and major depression symptoms was stronger for males than females. Additional analyses identified that WE was positively related to long working hours. Long working hours (41–48 and ≥55 hours) mediated a positive relationship between WE and major depression symptoms when mild cases of major depression were removed.  \n>  \n>**Conclusion:** The results suggest that low workplace PSC and potentially long working hours (41–48; ≥55 hours/week) increase the risk of new major depression symptoms. Furthermore, high WE may increase long working hours and subsequent major depression symptoms.",
            "title_similarity": "0.5736804",
            "sentiment_compound": -0.9837
        },
        {
            "id": "h74j5eo",
            "score": 1,
            "text": "Facts. I walked off a job that I ended up picking up the slack all my coworkers left, it was so crushing and frustrating, running a goddamn store at 22 and making minimum.",
            "title_similarity": "0.6728487",
            "sentiment_compound": -0.8592
        },
        {
            "id": "h74j6gu",
            "score": 2,
            "text": "My husband works for a global IT company.  He's been there for over 20 years.  His title is Manager, but he does front line trouble shooting and field work as well.  Because of the industry and his \"Management\" title, he is overtime exempt.   He frequently works massive amounts of overtime, and is on call 24/7.  For his 20th work anniversary they gave him a resin paperweight with their logo on it.  In March, he worked over 300 hours on a project (again, no OT), and as a \"thank you\" he recieved a $200 pre-paid Visa, which can only be used in the United States.  We live in Canada.",
            "title_similarity": "0.5755582",
            "sentiment_compound": 0.5927
        },
        {
            "id": "h74j7ar",
            "score": 1,
            "text": "Teacher here. What's *reward* mean? My employer doesn't have those for adults.",
            "title_similarity": "0.48868492",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h74jfft",
            "score": 2,
            "text": "You want to acknowledge me? Pay me more",
            "title_similarity": "0.2683409",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h74jj6z",
            "score": 1,
            "text": "*laughs, stops, begins sobbing and curls up in fetal position* Hooyah, Navy Medicine",
            "title_similarity": "0.35455465",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74jlm7",
            "score": 1,
            "text": "In my old job in a supermarket, the management thought it was actually funny that they behaved in such a way as to harass other employees, constantly joking about it, as in:   \nManager: \"I won't talk to you guys directly when problems arise, but i'll certainly destroy your team leader for it, it's his job to \"take those punches\"  \n   \n And he did just that, cursing the poor guy, yelling at him in the middle of the store, harassing him.  \n We had 2 team leaders, one of them would just take it all and stay silent, while the other one, would just come at us, in pure rage and yell at everyone after he the manager did just that to him.  \nNeedless to say, everyone got tired of that really fast, that old mentality that people only improve by being constantly \"beaten\" and placed under constant pressure, is what killed the whole staff and its morale.",
            "title_similarity": "0.7506294",
            "sentiment_compound": -0.9858
        },
        {
            "id": "h74jocn",
            "score": 1,
            "text": "Oh so a place where you spend most of your time and where you have most of your human interactions has a high correlation with your mental health? Wow I’m shocked.",
            "title_similarity": "0.55173445",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h74jr70",
            "score": 1,
            "text": "If you need to find that out from a new study, then i have no words. And who is so lazy to run this study. Hey I have a new study, if you run 2 miles, you will be tired and thirsty.",
            "title_similarity": "0.64551276",
            "sentiment_compound": -0.8096
        },
        {
            "id": "h74ju3f",
            "score": 2,
            "text": "Starbucks: zero autonomy, and impossible tasks.      \n9/10 stores have pink mold in their ice because no one can get around to cleaning the machines but record that they do anyway.",
            "title_similarity": "0.61409223",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h74juec",
            "score": 1,
            "text": "I work for a railroad. Miserable business. They are intentionally aggressively toxic towards employees.",
            "title_similarity": "0.7763674",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h74jwo9",
            "score": 2,
            "text": "Meanwhile, my employer does exactly all of those things yet still pats itself on the back with its JD Power “Best Place to Work” award",
            "title_similarity": "0.46196425",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h74k9a4",
            "score": 1,
            "text": " A nice pat-on-the-back is really nice when I'm working hard. Gives me satisfaction and makes me wanna continue with that same energy. \n\nI work in the union and my work contract is very clear on what I can and can't do. Won't stop me if I have a foreman that notices the work I'm doing.",
            "title_similarity": "0.49930733",
            "sentiment_compound": 0.894
        },
        {
            "id": "h74kbqc",
            "score": 1,
            "text": "Nooo, you don't say? It's like work force is made by human beings who needs a happy life to be fine and work properly",
            "title_similarity": "0.4119333",
            "sentiment_compound": 0.5252
        },
        {
            "id": "h74kd4u",
            "score": 1,
            "text": "damn. definitely feeling this one.",
            "title_similarity": "0.08483396",
            "sentiment_compound": 0.128
        },
        {
            "id": "h74l1jh",
            "score": 1,
            "text": "Therapy companies need to read this. I've had 2 hours a day for the past few months and I got a written warning for my low productivity, despite only having 2 patients to treat. They don't care. There's talk that companies will shift to emphasize group treatments like most other therapy companies where I live. If our caseload increased and I happen to have 6 patients on a given day, instead of having 6 hours of work they'll want me to see most of them at once to avoid paying me for 6 hours. \n\nIf you're thinking of being a physical therapist assistant, don't. Do anything else.",
            "title_similarity": "0.6805832",
            "sentiment_compound": -0.1847
        },
        {
            "id": "h74l5y7",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.14481676"
        },
        {
            "id": "h74lhqf",
            "score": 1,
            "text": "Do we really need study to know this?",
            "title_similarity": "0.20122671",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74m4z9",
            "score": 1,
            "text": "Companies: can we be sued?\nLawyer: no.\nCompanies: ...\nCompanies: ROFLMFAO!",
            "title_similarity": "0.51403224",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74m8om",
            "score": 1,
            "text": "My girlfriend has done 2 solid weeks of a mix of 12hr and 8hr shifts, no day off at all. She now has a really bad chest infection/cold virus (its not covid, they made her take a test even tho shes fully vaccinated) I just feel so bad for her and others like her.",
            "title_similarity": "0.6180149",
            "sentiment_compound": -0.8118
        },
        {
            "id": "h74mbo6",
            "score": 2,
            "text": "Next question should be: should companies care? Does it affect their profit. Arguably it should have an effect as productivity has been proven to diminish in depressed workers. However, if the workers are easily replaced without any cost, and if psychopath leaders increase value for a company more than that they decrease value through causing depression by creating a toxic environment, then a company will not care.\n\nCompanies only care about the wellbeing of their workers if this wellbeing is a net positive for productivity and profit. Companies would grind homeless people for homeless nuggets if they could ethically get away with it and make a profit.",
            "title_similarity": "0.8072703",
            "sentiment_compound": 0.9499
        },
        {
            "id": "h74mu4v",
            "score": 1,
            "text": "Most people I know just want to be left alone to do their jobs.  Too much interfering with that via gamification or company culture stuff makes everyone miserable.  Give people holiday bonuses, make sure that middle management people communicate clearly and that's it.  I'm happy.",
            "title_similarity": "0.6796799",
            "sentiment_compound": 0.8779
        },
        {
            "id": "h74n426",
            "score": 3,
            "text": "I went through this with my last employer, not to mention the anxiety and the stomach problems. I finally left and it turns out that all three came from the workplace and the low wages instead of being me.",
            "title_similarity": "0.64219296",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h74ngkf",
            "score": 1,
            "text": "AKA any production job.",
            "title_similarity": "0.123937294",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74ngtt",
            "score": 3,
            "text": "No democracy in the workplace de facto means no democracy anywhere. Powerful corporations are run like dictatorships, and they lobby Congress using the massive leverage their massive power allows. Dictatorial institutions run everything and you all still think we live in a democracy because they occasionally poll you to see which wealthy elite you'd prefer making decisions for you. If there is no democracy in the workplace there is no democracy anywhere.",
            "title_similarity": "0.70024776",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h74nkus",
            "score": 1,
            "text": "I had a bad manager and I was suicidal",
            "title_similarity": "0.6652822",
            "sentiment_compound": -0.8402
        },
        {
            "id": "h74nprb",
            "score": 1,
            "text": "And people wonder why ive had sooooo many jobs throughout my working career.",
            "title_similarity": "0.5092373",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74odya",
            "score": 1,
            "text": "Workplaces don’t care about your mental well being.  They care about your productivity and whether or not you can help them turn in a profit.  \n\nThis is why you should only worry about your duties that you are compensated and nothing more.\n\nI care about my company’s financial well being as much as they care about my mental well being.\nRespect and concern is a two way street.",
            "title_similarity": "0.62690663",
            "sentiment_compound": 0.9171
        },
        {
            "id": "h74oe1h",
            "score": 1,
            "text": "Awesome, ill try to remember this next time I'm going over the laundry list of potential sources of my depression",
            "title_similarity": "0.44637907",
            "sentiment_compound": -0.34
        },
        {
            "id": "h74ohjz",
            "score": 1,
            "text": "This really does explain a lot for me. I feel my numbers are really impossible to meet",
            "title_similarity": "0.5604667",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74oxov",
            "score": 1,
            "text": "Placin' they own ass at an even further risk of mass employee exodus.",
            "title_similarity": "0.72732055",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h74p5v2",
            "score": 1,
            "text": "Basically what it's like working at an Amazon warehouse",
            "title_similarity": "0.22464481",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h74pbqg",
            "score": 1,
            "text": "What about toxic work from home environments?",
            "title_similarity": "0.49980283",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74pbzy",
            "score": 1,
            "text": "I feel like Ive been seeing studies like this for years and still nothing changes.",
            "title_similarity": "0.17485896",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h74pjnu",
            "score": 1,
            "text": "Oh look, it's veterinary medicine.",
            "title_similarity": "0.00017156731",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74q5nw",
            "score": 1,
            "text": "What’s it mean when you work for yourself but all of this still applies…",
            "title_similarity": "0.29060078",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74qb3b",
            "score": 1,
            "text": "So... all work and no play makes Jake a depressed boy?",
            "title_similarity": "0.636119",
            "sentiment_compound": -0.6526
        },
        {
            "id": "h74qli2",
            "score": 1,
            "text": "They could have interviewed anyone in the military and come away with these results in 2 days.",
            "title_similarity": "0.30063435",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74qxnm",
            "score": 1,
            "text": "I’m living proof of this.",
            "title_similarity": "0.0153406495",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74r46x",
            "score": 2,
            "text": "Attempted suicide directly due to the nature of my employment around 10 years ago.  My pride prevented me from pursuing unemployment or any sort of reimbursement this entire time, but I'm starting to rethink my thoughts.",
            "title_similarity": "0.66979206",
            "sentiment_compound": -0.4497
        },
        {
            "id": "h74r4ui",
            "score": 1,
            "text": "*laugh-cries in military*",
            "title_similarity": "0.3594912",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74rlx4",
            "score": 3,
            "text": "Yup, I’ve worked in a high end kitchen where happiness is frowned upon, no jokes or laughter, only prep and service, breaks were not allowed, even during a 15 hour shift, no sunlight, no respect, plates being thrown back at you if they weren’t *perfect,* etc. Sure enough, that was the height of my drinking and my depression.\n\nIt really ruined professional kitchens for me, even after spending so much on culinary school.",
            "title_similarity": "0.70160437",
            "sentiment_compound": -0.5757
        },
        {
            "id": "h74rnvs",
            "score": 1,
            "text": "Some of the bosses I’ve worked for gleefully enjoyed making life hell for their workers. They would read this headline and cheer.",
            "title_similarity": "0.63996106",
            "sentiment_compound": 0.25
        },
        {
            "id": "h74rx7l",
            "score": 1,
            "text": "I worked in a very toxic place for 15 years, I stayed because they pay was good and for the most part they left me to work how I wanted.  \n\nI found a new job after the owners brother was sexually harassing female staff who were told its “been noted and to ignore him”.  I brought up to the owner the behavior was disgusting and we shouldn’t just tell the female staff to “ignore him”.\n\nIt was a huge argument over how I betrayed the owners by speaking up.\n\nThe point is, at my new location they’re extremely professional, I LOVE working for them.\n\nI was aware I was miserable at my previous job but I didn’t realize how awful it was until I found new employment and enjoyed my work and respect the people I work for.",
            "title_similarity": "0.74620926",
            "sentiment_compound": 0.1402
        },
        {
            "id": "h74rxg7",
            "score": 1,
            "text": "I’ve had some of the most suicidal thoughts and days at my current job. They told me they needed me to manage my stress because it was getting noticeable, now they’re upset because I’m not always available and planning to go back to school.",
            "title_similarity": "0.7735014",
            "sentiment_compound": -0.8805
        },
        {
            "id": "h74sn8l",
            "score": 1,
            "text": "Oh look, it's veterinary medicine.",
            "title_similarity": "0.00017156731",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74spqc",
            "score": 1,
            "text": "It's almost like they don't care.",
            "title_similarity": "0.1668191",
            "sentiment_compound": -0.1081
        },
        {
            "id": "h74tbkv",
            "score": 1,
            "text": "Ayyy all three of those things happened to me at FedEx and I got super depressed",
            "title_similarity": "0.67905813",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h74tbny",
            "score": 1,
            "text": "I work in a venom lab, catch rattlesnakes in the field, and extract their venom with the goal of isolating toxins with pharmacological potential.  I am far more stimulated by my PI and peers than previous boss and coworkers.  I know I’m just an N of 1 but my workplace is highly toxic with frequent contact with toxins which require injection to cause harm but I’m far less depressed than I’ve ever been working someplace else.\n\nCan we please reclaim the word toxic!  Just because I work with toxins doesn’t mean my workplace is toxic!  The rattlesnakes CAN be grouchy though.",
            "title_similarity": "0.69968396",
            "sentiment_compound": -0.8921
        },
        {
            "id": "h74th8k",
            "score": 1,
            "text": "Any place with a hostile environment with do that. Not anything new.",
            "title_similarity": "0.21777081",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h74tiim",
            "score": 1,
            "text": "\"Everyone seems really depressed lately.\"\n\n\"I wonder if it's something to do with the moon?\"\n\n# \"No it's capitalism.\"",
            "title_similarity": "0.6310716",
            "sentiment_compound": -0.5563
        },
        {
            "id": "h74tjgy",
            "score": 1,
            "text": "Where would we be without science",
            "title_similarity": "0.21547714",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74tory",
            "score": 1,
            "text": "I worked for a few soul suckers in the past.",
            "title_similarity": "0.17797908",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h74tswk",
            "score": 1,
            "text": "Replace workplace with parents and then you can square your depression, 6x risk of depression baby!",
            "title_similarity": "0.60521764",
            "sentiment_compound": -0.8687
        },
        {
            "id": "h74tsxo",
            "score": 1,
            "text": "Toxic work place? They should try construction.",
            "title_similarity": "0.51058626",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74tvci",
            "score": 1,
            "text": "100% accurate and true! I work for Amazon.",
            "title_similarity": "0.13758956",
            "sentiment_compound": 0.5848
        },
        {
            "id": "h74ugjq",
            "score": 1,
            "text": "Company is like: I don’t pay you to be depressed! Get happy!",
            "title_similarity": "0.43640852",
            "sentiment_compound": 0.4738
        },
        {
            "id": "h74ugrc",
            "score": 1,
            "text": "I was on antidepressants at my previous job. I left it because of the toxic environment. I got off the antidepressants a few months after I started my new job and I am a lot more happy and even keeled now. It’s amazing how awful coworkers and bosses can affect a person. Best part is, people are leaving in droves and leadership can’t figure out why. I know this because the new company I work for is in the same industry and I still work closely with people at my old company.",
            "title_similarity": "0.7217927",
            "sentiment_compound": 0.8748
        },
        {
            "id": "h74uhkn",
            "score": 1,
            "text": "*Pikachu surprise face.gif*",
            "title_similarity": "0.20836237",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h74ujk0",
            "score": 1,
            "text": "That sounds like the last company I worked for.  The toxicity in top-performing IT companies is so rampant. Some of my colleagues were ready to off themselves due to mental stress and pressures. I'm glad I'm no longer in that environment. Although, It did take a toll on my soul. Take care of yourselves no job is worth your life.",
            "title_similarity": "0.853233",
            "sentiment_compound": 0.5574
        },
        {
            "id": "h74ujnh",
            "score": 1,
            "text": "All of those qualities listed in the title sum up my last employer. I cold quit that job after the owner harassed me an entire weekend through emails. Best decision I’ve ever made for my mental health.",
            "title_similarity": "0.6559658",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h74uz7n",
            "score": 1,
            "text": "Are there jobs that don't do this??\n\nSeriously. I've been working for like 15 years now and this describes literally every job I've ever heard of.",
            "title_similarity": "0.33561343",
            "sentiment_compound": 0.2465
        },
        {
            "id": "h74uz8x",
            "score": 1,
            "text": "The problem is that most people don’t realize that good companies ARE out there. They just assume that every workplace is as bad if not worse than their current situation. I stayed in a toxic workplace for 15 years because of “the evil I know” mentality. I found a new job this year and am the happiest I’ve ever been. I have never slept better at night and actually get excited to go to work everyday. \n\nMy only regret is how much time I wasted at my last job not knowing that there are better places out there.",
            "title_similarity": "0.74642",
            "sentiment_compound": -0.6189
        },
        {
            "id": "h74v6qf",
            "score": 1,
            "text": "Usually the reward for working hard is an even higher work load.",
            "title_similarity": "0.5396755",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h74w3f9",
            "score": 1,
            "text": "Wow interesting, I never would have guessed.",
            "title_similarity": "0.16074985",
            "sentiment_compound": 0.7579
        },
        {
            "id": "h74wlkr",
            "score": 1,
            "text": "I just returned to General Motors after a few years away. The grass ain't greener for sure. Most companies suck. Happy to be back and forgot what its like to enjoy your work and team.",
            "title_similarity": "0.60299903",
            "sentiment_compound": 0.6729
        },
        {
            "id": "h74wvpy",
            "score": 1,
            "text": "Your only there to get chewed up and spat out at most places.",
            "title_similarity": "0.25303626",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74x589",
            "score": 1,
            "text": "You don’t hate Mondays, you hate your job.",
            "title_similarity": "0.66037554",
            "sentiment_compound": -0.8126
        },
        {
            "id": "h74xris",
            "score": 1,
            "text": "To be honest, I feel like a good majority of work places are toxic. No one cares whats going on outside of work as long as you are being pushed to work non stop. It's the whole \"if I do it, you have to do it\" mentality.",
            "title_similarity": "0.71988106",
            "sentiment_compound": 0.4253
        },
        {
            "id": "h74y1co",
            "score": 1,
            "text": "Saving to read later. Interesting title.",
            "title_similarity": "0.17479652",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h74ydti",
            "score": 1,
            "text": "I’m waiting for the day universities figure this out",
            "title_similarity": "0.15354034",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74yjl0",
            "score": 1,
            "text": "Is there such a thing as a ‘septic’ workplace?",
            "title_similarity": "0.442808",
            "sentiment_compound": 0.0
        },
        {
            "id": "h74yxso",
            "score": 1,
            "text": "Yeah I hole heartedly agree, recently quit a very toxic workplace with narcissistic owners and coworkers",
            "title_similarity": "0.7696801",
            "sentiment_compound": 0.5719
        },
        {
            "id": "h74z38g",
            "score": 1,
            "text": "***2500+ Blizzard Employees Agree!***",
            "title_similarity": "0.38214964",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h74zhjh",
            "score": 1,
            "text": "Some employers have this weird idea that a friendly and relaxed workplace decreases productivity, but a stressful soul crushing one increases it. Does this mentality come from the time when people got whipped? I've worked in quite a few places where you get scolded for making a small mistake or being behind schedule, but are completely ignored when you go the extra mile or do an extra good job. And where do employers get the idea that I'd give two and a half shits about how much money the owners of the company are going to make that year? If I'm not getting a percentage of it I couldn't care less, it's a contract, not charity.",
            "title_similarity": "0.84081197",
            "sentiment_compound": -0.9614
        },
        {
            "id": "h74zqpy",
            "score": 1,
            "text": "Toxic work environments suck, but happily one can always find a different place to work.\n\nEasier said than done i know.",
            "title_similarity": "0.51288617",
            "sentiment_compound": 0.8248
        },
        {
            "id": "h7501j0",
            "score": 1,
            "text": "My guns are stored safely under my bed at 3471 Oak Avenue…\n\nWait a minute…\n\nThe best security is obscurity people. No one should know that you own guns, and they really shouldn’t know where you store them.",
            "title_similarity": "0.46586198",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h750isg",
            "score": 1,
            "text": "So being a public school teacher.",
            "title_similarity": "0.12880117",
            "sentiment_compound": 0.0
        },
        {
            "id": "h751agg",
            "score": 1,
            "text": "Companies all know this already. They rely on the pool of unemployed people to recruit from whenever they're done sucking the life out of you.",
            "title_similarity": "0.6541201",
            "sentiment_compound": 0.0
        },
        {
            "id": "h751tw6",
            "score": 1,
            "text": "Been working at a company for 7 years and been struggling with depression for at least 4 years. Got in a motorcycle wreck and exploded my knee essentially and split my shin. Worst pain of my life. Was out of work for 6 months. Even with the pain I managed to realize I felt in a better mood even with my condition. Returned to work and am immediately feeling like I'm falling back to where I was.",
            "title_similarity": "0.6612022",
            "sentiment_compound": -0.9413
        },
        {
            "id": "h751up0",
            "score": 1,
            "text": ">A toxic workplace triples...it shoots up 300 percent. \n\nWhich is it? It's either triple (i.e. 3x baseline), or it's raised by 300% (i.e. an *additional* 3x *over* the baseline), not both.",
            "title_similarity": "0.6426313",
            "sentiment_compound": 0.0
        },
        {
            "id": "h751w9y",
            "score": 1,
            "text": "Been on the job for almost 6 months, really thinking of leaving due to extreme toxicity and unethical behavior... not sure if I should try to make it a year as that would look better.",
            "title_similarity": "0.62657523",
            "sentiment_compound": -0.387
        },
        {
            "id": "h751yas",
            "score": 1,
            "text": "I just left a 13 year old career for this very reason. People have been fleeing that place in drastic fashion.",
            "title_similarity": "0.5649481",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7527ba",
            "score": 1,
            "text": "I work in IT.  I've gone to work every day during the pandemic.  For the first 8 months everyone treated us like we were wonderful. It was the best time I had at work in a long time.  Then people got bored with it all and started shitting on us again.  Half of them are back in the office and the other half are at home. Everyone wants everything done yesterday, no one reads instructions for Return to Work and now we're back to being treated like the furniture.  Oh, and I haven't had a promotion since 2001.  Yay me!",
            "title_similarity": "0.6474922",
            "sentiment_compound": 0.8883
        },
        {
            "id": "h752hhv",
            "score": 1,
            "text": "Is dreading going to work normal? Why is it normalized in the United States",
            "title_similarity": "0.43769008",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h752vav",
            "score": 1,
            "text": "Okay but let's not act like this isn't completely obvious",
            "title_similarity": "0.1271185",
            "sentiment_compound": -0.2993
        },
        {
            "id": "h752zyd",
            "score": 1,
            "text": "I can 100% believe this. I’m outta here!",
            "title_similarity": "0.17043245",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7534hf",
            "score": 1,
            "text": "Welcome to Rio Tinto Australia",
            "title_similarity": "0.02867227",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h7536so",
            "score": 1,
            "text": "I like how this is stated with the implication that they care.",
            "title_similarity": "0.11283128",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h7538on",
            "score": 1,
            "text": "Can a similar thought process be applied to schools or even the home (working at home)?",
            "title_similarity": "0.15678301",
            "sentiment_compound": 0.0
        },
        {
            "id": "h753fhu",
            "score": 1,
            "text": "Normal workers do not count any more. Companies only see the money. Employees get less money, less attention for good work. But be careful - each mistake you do will be seen immediately and not be forgiven....\nYou work all the time, give your best, identify with the Company and what happens? In the end you are fooled. Be aware of it and take good care of yourself. Because usually neither your chef nor your clients do. It is your own responsibility.",
            "title_similarity": "0.7290659",
            "sentiment_compound": 0.8553
        },
        {
            "id": "h753t52",
            "score": 1,
            "text": "Explains a lot about depression among military veterans.",
            "title_similarity": "0.65242946",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h753ta8",
            "score": 1,
            "text": "I’m already depressed, so there’s that.",
            "title_similarity": "0.5222499",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h753vpm",
            "score": 1,
            "text": "Started taking antidepressants 2 months into a job. Worked my way up to max dosage and a couple other meds to manage anxiety. Stayed in that job for 6 year. Within 6 weeks of starting my current job I was ready to start reducing my dosage. It’s nuts how quickly your job can have an impact on your mental health.",
            "title_similarity": "0.5575248",
            "sentiment_compound": -0.128
        },
        {
            "id": "h753x2f",
            "score": 1,
            "text": "I hope that one day mental abuse and violence will be just as illegal as physical. So no employers or anyone else can get away with doing that stuff anymore.",
            "title_similarity": "0.53446317",
            "sentiment_compound": -0.9164
        },
        {
            "id": "h753zap",
            "score": 1,
            "text": "I suffered an extreme mental breakdown due to stress and it took me well over two years to truly heal from it. Even then, I am not the same person I was before. It was genuinely extreme. I was one person starting, managing and running an entire cosmetics brand from product development, marketing, graphic design, copy, product description, web design. Initially, I hired a team to help me with this but the company hired a CEO.\n\nShe took everyone from my team for another brand that she was in charge of launching and left me by myself. I held out for about a year and a half like that before I hit a wall and suffered a serious meltdown due to burnout. \n\nThere are no words to describe how serious burnout is and WHY you need to leave as soon as a work environment is leading you in that direction.\n\nIf I think back to those years, there are holes in my memory. My brain was stretched so thin that I cannot recall a lot of things.\n\nMy personal life disappeared. I am a person that routinely has a lot of friends. Guess what? I dropped off the face of the planet for about 2 or 3 years and had to rebuild a social network. I had no friends. My life was work.\n\nBecause my life was work, my identity became fused with this job. This not only caused severe depression, but suicide ideation. I'm not a suicidal person. \n\nSymptoms weren't just emotional or mental - they were physical too. I am still dealing with psoriasis that started due to stress. Stress caused a lifelong skin condition that I will now have to live with. Forever. My life now revolves around stress management.\n\nBut what I think really scared me was my memory loss and inability to retain information in those days. Anyone who knows me knows how unlike me that is - my memory has always been one of my favorite attributes about myself. I did not have the ability to retain information whatsoever and in one case, I straight up forgot how to get home. I had taken that route daily for 2 years.",
            "title_similarity": "0.6709955",
            "sentiment_compound": -0.9828
        },
        {
            "id": "h7541b0",
            "score": 1,
            "text": "Were they interviewing teachers?",
            "title_similarity": "0.24016875",
            "sentiment_compound": 0.0
        },
        {
            "id": "h754cws",
            "score": 1,
            "text": "Honestly I am surprised it is only triple.",
            "title_similarity": "0.21003845",
            "sentiment_compound": 0.5994
        },
        {
            "id": "h754n9c",
            "score": 1,
            "text": "I had a department meeting a couple of days ago and my boss tried to say a good word about me and a coworker for doing a good job on some task we had, and he was interrupted by his boss mid sentence just for him to start tell a story he was reminded of, my boss then tried to finish what he was saying only to be ignored.\n\nI don’t know if it’s toxic or not, it doesn’t seem like anyone cared (including my coworker who worked with me on the task), but I felt kinda sad cause I wanted that little acknowledgment especially since I’m new there",
            "title_similarity": "0.69445485",
            "sentiment_compound": -0.0671
        },
        {
            "id": "h754pd1",
            "score": 1,
            "text": "This happened to me last year. I moved to a new city for a promotional position. The demands for the position continued to increase with little help and guidance from my boss. I had a real back problem issue that only exacerbated my depression and I quit two months into my new position.\n\nLess than a year before, similar story. My coworker and mentor was about to move onto a new unit for a promotion. My boss comes up to me and expresses that I'd have to step up and fill the void. The overwhelmingness of it all, had me depressed and not showing up for work for a week. It also didn't help that I wasn't rewarded or acknowledged for my hard work or given autonomy. I was given autonomy, but there were daily check-ins, sometimes multiple times a day.",
            "title_similarity": "0.7568252",
            "sentiment_compound": -0.6848
        },
        {
            "id": "h754s7g",
            "score": 1,
            "text": "Retail pharmacy anyone?",
            "title_similarity": "0.11770122",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7565du",
            "score": 1,
            "text": "I think my workplace is toxic but then I remember it pays $190k and 5 weeks leave a year. I think I’ll put up with them for a while longer.",
            "title_similarity": "0.64070964",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h756ryo",
            "score": 1,
            "text": "That’s exactly what happened to me. What should I do? I am completely stressed out.",
            "title_similarity": "0.49353355",
            "sentiment_compound": -0.4005
        },
        {
            "id": "h756teu",
            "score": 1,
            "text": "They don't care; You are replaceable.",
            "title_similarity": "0.27185935",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h756w9v",
            "score": 1,
            "text": "whew I've quit two super toxic jobs: one my manager almost physically attacked me in front of clients and another supervisor told me his wife and the receptionist (male) could do my job better than me. So much happier away from both.",
            "title_similarity": "0.78851426",
            "sentiment_compound": 0.8297
        },
        {
            "id": "h756y8o",
            "score": 1,
            "text": "Does an employees depression matter to a company? Like would it affect the bottom line?",
            "title_similarity": "0.71023846",
            "sentiment_compound": -0.3527
        },
        {
            "id": "h7572g5",
            "score": 1,
            "text": "Sucks for those in law enforcement",
            "title_similarity": "0.5007736",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h757hc2",
            "score": 1,
            "text": "Here’s to being a nurse!",
            "title_similarity": "0.118786596",
            "sentiment_compound": 0.0
        },
        {
            "id": "h757o7p",
            "score": 1,
            "text": "If only any person in charges cared.",
            "title_similarity": "0.161125",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h757okb",
            "score": 1,
            "text": "If only any person in charge cared.",
            "title_similarity": "0.118361086",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h757p2z",
            "score": 1,
            "text": "Absolutely concur. Hopefully workplace policies will change with this study!  I continue to experience depression and severe insomnia from a very toxic work environment I endured for over 10 years; the consequences are far-reaching.",
            "title_similarity": "0.7443023",
            "sentiment_compound": -0.5594
        },
        {
            "id": "h7581ed",
            "score": 1,
            "text": "Jokes on the author, most workplaces are toxic, as fully displayed by the onset of the pandemic. No one was surprised, almost all corporations are evil and revel in toxic work culture and practices.",
            "title_similarity": "0.7941273",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h758el1",
            "score": 1,
            "text": "See: [Gattungswesen](https://en.wikipedia.org/wiki/Marx's_theory_of_human_nature?wprov=sfti1)",
            "title_similarity": "0.28881267",
            "sentiment_compound": 0.0
        },
        {
            "id": "h758eyz",
            "score": 1,
            "text": "That’s kind of why we get paid.. for doing hard work.",
            "title_similarity": "0.4269828",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h758hm7",
            "score": 1,
            "text": "Thankful for studies like this that challenge intuitive, self-evident conclusions and common sense!!",
            "title_similarity": "0.33511317",
            "sentiment_compound": 0.7955
        },
        {
            "id": "h758l5k",
            "score": 1,
            "text": "This is one of those studies that you know innately is true, and now you're relieved to know that it's backed by science",
            "title_similarity": "0.21285981",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h758plw",
            "score": 1,
            "text": "Nofuckingduh.com another study we didn't need",
            "title_similarity": "0.19914104",
            "sentiment_compound": 0.0
        },
        {
            "id": "h759847",
            "score": 1,
            "text": "Socialism or barbarism. You cannot rely on capitalists to be \"woke\" it goes against their only interest which is extracting wealth from labor.",
            "title_similarity": "0.53370345",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h7598r4",
            "score": 2,
            "text": "Exactly the reason I just quit my job on Monday after a year of hell. No notice just worked my last day and walked out. I hit my max and couldn't take it anymore. So happy to start my new job. Huge weight lifted off my shoulders. Wish I would have done it sooner.",
            "title_similarity": "0.65989846",
            "sentiment_compound": 0.4481
        },
        {
            "id": "h759jld",
            "score": 1,
            "text": "So every job ivs had in the past 20 years.",
            "title_similarity": "0.22282125",
            "sentiment_compound": 0.0
        },
        {
            "id": "h759yr4",
            "score": 1,
            "text": "Don't fail to consider preference, some people don't like being cross trained or placed in different situations. I get put in the same job each dwyz despite knowing all of the other positions, which is actually fine for me, I know the process of the workplace so I don't feel inadequate compared to my coworkers, but 8bjave the mental comfort of stability. \n\nPlus, I get to listen to music on my phone, thank God.",
            "title_similarity": "0.5179311",
            "sentiment_compound": 0.8897
        },
        {
            "id": "h75ai8p",
            "score": 1,
            "text": "I don't need your congratulations Jeff, I need a Living Wage and some basic health benefits. I would be a lot less depressed for sure.",
            "title_similarity": "0.40364",
            "sentiment_compound": -0.3646
        },
        {
            "id": "h75aqjf",
            "score": 1,
            "text": "This literally explains everything.",
            "title_similarity": "0.08189865",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75aqsw",
            "score": 1,
            "text": "I just recently left a stable job of 7 years, in a career field I loced, because of toxicity caused by upper management.  I cap personally vouch for the truth in this article.",
            "title_similarity": "0.57360005",
            "sentiment_compound": 0.5423
        },
        {
            "id": "h75b93n",
            "score": 1,
            "text": "So every graduate program should fall into this category.",
            "title_similarity": "0.11116817",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75c9hr",
            "score": 1,
            "text": "As a lorry driver I unfortunately see this, I feel pretty much invisible. Requests for short runs when it's a birthday or holiday are usually met with 13 hr shifts. Starting to look Into different Carrer paths now because it's gotton so bad. The job itself isn't too bad if you can manage it but the lack of respect is terrible. Also lots of grown up men bitching like nothing else. Such a shame.",
            "title_similarity": "0.72945344",
            "sentiment_compound": -0.7245
        },
        {
            "id": "h75clzq",
            "score": 1,
            "text": "I can't wait to write my resignation letter.",
            "title_similarity": "0.38915032",
            "sentiment_compound": -0.296
        },
        {
            "id": "h75cpdr",
            "score": 1,
            "text": "These companies could care less. You're replaceable.",
            "title_similarity": "0.46053064",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h75crjh",
            "score": 1,
            "text": "Have a close friend who ranked up extremely fast in the corporate world for their age. Like, 4 hops up in the first 3-4 years and started at a higher than average salary at the beginning. They’re working in the field they obtained their degree in and started off enjoying the job. The company is up there in the Fortune 500 list.\n\n**Their most recent promotion has them managing a couple people and was a generous increase in salary. Their old director left and the new one is apparently disconnected from the department needs and my friend has told me the very things in the title:** they feel they don’t get enough credit/comp considering the work they do; their department is only cutting positions/resources from the department while the workload only increases in volume along with higher expectations; and they feel like they are micromanaged and have no autonomy despite having to now manage a whole department pretty much by themself, but with a conflicting manager micromanaging them.\n\nNeedless to say, they aren’t very happy lately and it was interesting for me to scroll past this post given the recent encounter.",
            "title_similarity": "0.6731539",
            "sentiment_compound": 0.9472
        },
        {
            "id": "h75d74t",
            "score": 1,
            "text": "\\*pretends to be shocked\\*",
            "title_similarity": "0.2860489",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h75dwua",
            "score": 1,
            "text": "I just quit my job this week with no plans because it was making me want to die inside. Anyone want to like buy a painting or something??",
            "title_similarity": "0.64210856",
            "sentiment_compound": -0.5204
        },
        {
            "id": "h75dx8r",
            "score": 1,
            "text": "Another study where the results were bleeding obvious. Study finds that people who ate more food than those who didn't were more likely to put on weight. \nStudy finds that people who were called by a name they did not know were less likely to respond than those who were called by their name.\nStudy finds that kids that were cruel to animals are more likely to turn out to be wrong 'uns than those who were nice to animals.",
            "title_similarity": "0.6028625",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h75dye4",
            "score": 1,
            "text": "This is why I quit teaching.",
            "title_similarity": "0.3557685",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75e2yg",
            "score": 1,
            "text": "I work in a place where every day is an unreasonable demand. I have 4 guys who are there for 9-10 hours a day. They expect us to complete 70-100 hours of work a day and they will complain about how slow everyone is. Meanwhile they ask for everything in our building to be completely spotless clean like a damn hospital.\n\nIt has literally given me ulcers from the stress. We all make very good paychecks, but God damn is it stressful.",
            "title_similarity": "0.7195133",
            "sentiment_compound": -0.7296
        },
        {
            "id": "h75edly",
            "score": 1,
            "text": "So you're saying things that suck are bad? Oh dear....",
            "title_similarity": "0.438189",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h75egtb",
            "score": 1,
            "text": "It’s called being a slave not an employee.",
            "title_similarity": "0.2630573",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75fr56",
            "score": 1,
            "text": "I quit a dumpster fire last Wednesday and I've felt better than I have in years",
            "title_similarity": "0.5383896",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h75fux2",
            "score": 1,
            "text": "I wonder if this is also a contributing factor in mental health problems for graduate students.",
            "title_similarity": "0.47107714",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h75fxed",
            "score": 1,
            "text": "Unreasonable demands and no autonomy are why I'm just jaded at my office. If I end up working on stuff for 2 weeks that gets thrown away at the end, or if I get asked to do something that should take a week in 5 hours, well it all pays the same. I'll get done what I can, and if management doesn't like it they'll learn to stop being stupid or they'll just have me do it again. But the pay is good enough idgaf if I'm forced to do dumb short sighted stuff. I'll tell them they're being dumb, but if they wanna keep being dumb ill let them as long as the paycheck keeps coming in.",
            "title_similarity": "0.7445694",
            "sentiment_compound": -0.975
        },
        {
            "id": "h75g0fd",
            "score": 1,
            "text": "Yeah, but it’s all about the bar graphs with the green or red line running through them.\n\nAnyone notice that the “essential workers” in this pandemic are the lowest paid?",
            "title_similarity": "0.661898",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h75hcv1",
            "score": 1,
            "text": "Source to confirm this: me",
            "title_similarity": "-0.012933861",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75heyz",
            "score": 1,
            "text": "@dexter.school WichitaFalls",
            "title_similarity": "0.10893427",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75hf7s",
            "score": 1,
            "text": "This seems like the sort of thing that companies already know, but they just don't care.",
            "title_similarity": "0.47144887",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h75huri",
            "score": 1,
            "text": "Admin either doesn’t care or thinks depression and or turnover helps their cause.",
            "title_similarity": "0.53582305",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h75i2pz",
            "score": 1,
            "text": "I’m on short term disability right now because my mental health was impacted so greatly by my role that I began seriously considering committing myself because I was trying to figure out a way out. I went from one toxic environment to what turned into another, in an incredibly high stress field with minimal staff. And my blocker was my senior manager, who was doing everything in his power to make sure I had no hiring reqs and no available budget. I’m currently struggling to function at home, with no work to do. Basic tasks are incredibly overwhelming and all I want to do is sleep. I’m already diagnosed with depression and anxiety. At least I’m catching up on my sleep I guess…",
            "title_similarity": "0.72511244",
            "sentiment_compound": -0.9284
        },
        {
            "id": "h75iftg",
            "score": 1,
            "text": "The sad part is that these employers do not care in the slightest. I work for the federal government in a department that is strictly for disabled veterans. They make it a point to frustrate us, belittle us, etc. Our department head has been trying to get rid of at least half our department and replace the vets with civilian contractors because they are cheaper and can be let go much easier. They went as far as not repairing any of our equipment to make us look incompetent at our jobs. NO ONE will help us. The union ignores our phone calls and emails, OIG won't do anything, and congress (whom appointed our department for disabled veterans) won't reply back at all.",
            "title_similarity": "0.7244992",
            "sentiment_compound": -0.9226
        },
        {
            "id": "h75jlks",
            "score": 1,
            "text": "I wish my boss would read this...and realize it applied to him and the way he runs our team.",
            "title_similarity": "0.5471224",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h75keqd",
            "score": 1,
            "text": "Those work places don't care if you're depressed. If it slows productivity there's always a threatening email queued about targets etc.",
            "title_similarity": "0.7259304",
            "sentiment_compound": -0.8529
        },
        {
            "id": "h75kh0k",
            "score": 1,
            "text": "Sounds like the military",
            "title_similarity": "0.017680438",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h75kvaa",
            "score": 1,
            "text": "I just dumped a job like this. Worst company I've worked for. They're the perfect example of why IT needs unions.",
            "title_similarity": "0.74455047",
            "sentiment_compound": -0.3346
        },
        {
            "id": "h75lhni",
            "score": 1,
            "text": "My first job at Walmart  gave me some of the worst anxiety and depression I’ve ever experienced and that was from bad management and toxic employees. I haven’t worked at that job since 2016 but man I still feel the effects.",
            "title_similarity": "0.7691363",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h75mc9o",
            "score": 1,
            "text": "Reddit sure loves to restate the blatantly obvious on a regular basis so they can justify being a neet bum all day",
            "title_similarity": "0.44800386",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h75n1zo",
            "score": 1,
            "text": "Toxic workplaces also don’t care that they might be a toxic workplace.",
            "title_similarity": "0.6167872",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h75ncew",
            "score": 1,
            "text": "Obvious research yields obvious results.",
            "title_similarity": "0.10095776",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75no1h",
            "score": 1,
            "text": "It's been 3-4 years of in and out of bad jobs, the recent one I quit kinda broke the camel's back.. I don't feel myself anymore, but I'm hopeful :)",
            "title_similarity": "0.519387",
            "sentiment_compound": 0.7541
        },
        {
            "id": "h75odq1",
            "score": 1,
            "text": "Man, I work at Waffle House and it’s abhorrently toxic. Rampant nepotism (to the point of my manager literally living with the 3rd shift supervisor, who never does his job yet complains about everything, in the midst of her divorce), leadership doesn’t do anything about it. I get paid decently though, just to cook eggs and bacon… but damn",
            "title_similarity": "0.70887077",
            "sentiment_compound": -0.6542
        },
        {
            "id": "h75oe0l",
            "score": 1,
            "text": "I left my mixed gender workplace to work for a small mens underwear startup with just 5 dudes. Including me. \n\nMy old work place was toxic af. I even contemplated just speeding towards a wall at one point when for work reason only i sent a woman a message outside working hours to remind her of a presentation the next day. \n\nResult i was brought to HR for harassment. \n\nThat was the last straw. I submitted my resignation and left with 2 other people who were also fed up. \n\nMy present job pays a third of what of i am earning but at least there is no sexism.",
            "title_similarity": "0.7068052",
            "sentiment_compound": -0.6858
        },
        {
            "id": "h75ok6a",
            "score": 1,
            "text": "I had a job that was literally making me suicidal.\n\nEven nearly 3 years later, I have anxiety regarding my job to the point my current boss has to remind me to relax and calm down.\n\nI was forced to go back after a temp agency baited and switched me and I was forced to go back to the same company for nearly 2 months until I found better employment.",
            "title_similarity": "0.7120291",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h75onpp",
            "score": 1,
            "text": "Giving your employees clinical depression seems to have become a feature of capitalism in some cases.",
            "title_similarity": "0.69813067",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h75pdk3",
            "score": 1,
            "text": "I’ve been there. Very demanding family demanded I was available 24/7. Worst people to work for",
            "title_similarity": "0.6235529",
            "sentiment_compound": -0.8155
        },
        {
            "id": "h75phb8",
            "score": 1,
            "text": "Someone should inform my chain of command about this article. The Navy is text book toxic workplace",
            "title_similarity": "0.5411611",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75pjcc",
            "score": 1,
            "text": "So, basically the entire U.S. education system?",
            "title_similarity": "0.16632102",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75pjd7",
            "score": 1,
            "text": "Just quit a job after working there for two months because of this",
            "title_similarity": "0.5728842",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75pv3k",
            "score": 1,
            "text": "Teachers everywhere: \"Oooooohhhhhhhh, okay. That explains it..\"",
            "title_similarity": "0.2770654",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h75q1tc",
            "score": 1,
            "text": "Yeah, companies that do this don’t care if their workers are depressed.",
            "title_similarity": "0.5687027",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h75q8mr",
            "score": 1,
            "text": "Someone send this to Blizzard.",
            "title_similarity": "0.28791723",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75qmwm",
            "score": 1,
            "text": "I quit my toxic job on Tuesday. Getting these past few days off to rest has been so refreshing that I can feel my will to live a creative life slowly returning",
            "title_similarity": "0.48307642",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h75r4f2",
            "score": 1,
            "text": "Stop working for others! Stop the 9-5’s. Borrow money from the banks and invest instead!!",
            "title_similarity": "0.5058905",
            "sentiment_compound": -0.6458
        },
        {
            "id": "h75r4ty",
            "score": 1,
            "text": "*suprise Pikachu face\n\nDoi.",
            "title_similarity": "0.10050069",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75rjc5",
            "score": 1,
            "text": "At my previous job, things got really bad. Management was giving no real direction and when tasks were given,  o support was provided - even when asked. I was a sales rep, and the owner of the company changed my commission structure, but wouldn’t give the new structure to me in writing. The company itself had no new products that were company designed, and all modern products were OEMed from others. Our prices were high and lead times were long with promised ship dates slipping on the regular. Things were bad. The owner of the company would gaslight me when I brought concerns, and towards the end of my employment with them, I was recording every conversation I had with that owner on my Apple Watch. \n\nI remember driving in to work one day, and my left arm start to ache with pain going into my hand and up the back of my neck. I thought to myself, “ I’m having a heart attack. This is how I die.” I continued to drive, and realized I didn’t care.  I got to work and immediately called my GP, and at my doctor’s appointment a few days later, I was told that I had a panic attack and put on antidepressants. I left that job in May 2020. Two weeks after I started my new job, I tapered off of the antidepressants, and I haven’t needed them since.",
            "title_similarity": "0.77737534",
            "sentiment_compound": -0.8989
        },
        {
            "id": "h75rxea",
            "score": 1,
            "text": "A study had to be done in order to find this out? I need to speak to a manager.",
            "title_similarity": "0.48471275",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75shnl",
            "score": 1,
            "text": "...*hello*... it's me, the restaurant industry....",
            "title_similarity": "0.17086266",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75tjac",
            "score": 1,
            "text": "IMO,  most large companies could care less if employee's suffer as long as the CEO, Executive and Shareholders are increasing revenue and filling their pockets. Government agencies are complacent and just there to provide a lip service and good optics, but they don't really do anything. The only time these issues pick up steam is when there is a public outcry.\n\nI am optimistic though, employees are slowly starting to become more aware of these issues. Hopefully it picks up steam.",
            "title_similarity": "0.7204544",
            "sentiment_compound": 0.4276
        },
        {
            "id": "h75uqh7",
            "score": 1,
            "text": "Welcome to all government work",
            "title_similarity": "0.16575447",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h75vi5l",
            "score": 1,
            "text": "They know, they just don’t care",
            "title_similarity": "0.10380043",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h75vpkp",
            "score": 1,
            "text": "What about getting yelled at, is that in their study?",
            "title_similarity": "0.50374484",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75vqts",
            "score": 1,
            "text": "I JUST walked out on a toxic job during my lunch yesterday. \n\nOddly enough it was because it was making me miserable due to those EXACT three reasons. \nDon’t be afraid to leave a bad job. There are so many options, especially now.",
            "title_similarity": "0.78211117",
            "sentiment_compound": -0.7845
        },
        {
            "id": "h75w6it",
            "score": 1,
            "text": "Personally the good ole pat on the back for going above and beyond doesn't help, nor does a pizza party.",
            "title_similarity": "0.462361",
            "sentiment_compound": 0.5175
        },
        {
            "id": "h75wl42",
            "score": 1,
            "text": "Companies know this and do not care. Worked in the front office of a large distribution center right after college where I was expected to work one or two extra hours late almost every day and only get paid for 40 hours and workers were regularly told they were expendable and easily replaceable. Actually got called into a meeting one time and told we didn’t have to respect the managers / supervisors but we’d better act like we did. Horrible, horrible place to work. Many years later, my son said he had a friend who got a job there and it was still as bad. His friend left there after like two months.",
            "title_similarity": "0.6972016",
            "sentiment_compound": 0.6844
        },
        {
            "id": "h75wp47",
            "score": 1,
            "text": "Yeah we’re looking at you Frito Lay.",
            "title_similarity": "0.1673502",
            "sentiment_compound": 0.296
        },
        {
            "id": "h75wqpa",
            "score": 1,
            "text": "Leaving my toxic workplace next week, for a bigger salary than i asked, less hours, less days, company lunches, no working public holidays or weekends. My mental health improves even looking forward too it",
            "title_similarity": "0.65942395",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h75x1dv",
            "score": 1,
            "text": "You need a stay for this?",
            "title_similarity": "0.10816169",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75xyub",
            "score": 1,
            "text": "Literally me! But I make 6 figures a year and really hard to walk away from that... I have no friends and no love life but I have fast cars and make stupid money instead of wasting it on women haha",
            "title_similarity": "0.61212885",
            "sentiment_compound": -0.9367
        },
        {
            "id": "h75z0xk",
            "score": 1,
            "text": "Guess that's why I've been depressed the past six years",
            "title_similarity": "0.50673544",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h75z58k",
            "score": 1,
            "text": "And somebody got paid to do a study to find this out…",
            "title_similarity": "0.42058325",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75zvem",
            "score": 1,
            "text": "Hello, ever worked in a restaurant before?",
            "title_similarity": "0.14037518",
            "sentiment_compound": 0.0
        },
        {
            "id": "h75zww9",
            "score": 1,
            "text": "Is this the military? * *in reference to is this a pikachu meme* *",
            "title_similarity": "0.16594177",
            "sentiment_compound": 0.0
        },
        {
            "id": "h760ora",
            "score": 1,
            "text": "And companies don’t give af. Burn someone out and then replace them with someone cheaper.",
            "title_similarity": "0.6148484",
            "sentiment_compound": 0.0
        },
        {
            "id": "h760uvz",
            "score": 1,
            "text": "Can anecdotally confirm. My last employer absolutely ran me into the ground, and it's the only time I've been borderline suicidal.",
            "title_similarity": "0.59008586",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h7612i3",
            "score": 1,
            "text": "I honestly love my staffs they are my greatest assest, my biggest investment. Im nothing without them, i cant coach a team with out team!. Not all money is good money!.\n\n I try to get the most from staff, all I really do is build on strenghths.... very simple, seems to work.",
            "title_similarity": "0.57103765",
            "sentiment_compound": 0.9421
        },
        {
            "id": "h762ca7",
            "score": 1,
            "text": "That’s pretty much every work space. I think we would do better to say that the mean, unrealistic and over the top expectations that work places put on us should not be taken to heart. It’s a sign of a sick and dysfunctional society and economy, and no amount of hard work by an individual will change fix the situation for the corporation you are working for.",
            "title_similarity": "0.7689143",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h762op7",
            "score": 1,
            "text": "Tell me something I don't already know.",
            "title_similarity": "0.09239282",
            "sentiment_compound": 0.0
        },
        {
            "id": "h763861",
            "score": 1,
            "text": "This is so true. I recently quit my job for a new one. I've always kinda made self depreciating jokes typically about suicide or general lack of interest in really about everything. Always in a joking sense or at least I thought. Today somebody ask me how I was at work. I went with a typical response of \"well im here\" and I had to correct myself to \"really good\". I actually enjoy my new job and feel happy for the first time in a decade. I wouldn't say I hated my previous jobs but its painfully obvious now how much they contributed to my overall mental health.",
            "title_similarity": "0.6612201",
            "sentiment_compound": 0.5482
        },
        {
            "id": "h763li3",
            "score": 1,
            "text": "The real question I wanna ask.... Is there a place to work with no toxicity????",
            "title_similarity": "0.20562565",
            "sentiment_compound": -0.4871
        },
        {
            "id": "h7640ua",
            "score": 1,
            "text": "Now to just get them to care about it.",
            "title_similarity": "0.03767041",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h764exg",
            "score": 1,
            "text": "Now is when I wish reddit would let me reply in memes. Because <shocked Pikachu>",
            "title_similarity": "0.4690165",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h764gxv",
            "score": 1,
            "text": "Dynorphin and kappa receptors.",
            "title_similarity": "0.07998523",
            "sentiment_compound": 0.0
        },
        {
            "id": "h764plh",
            "score": 1,
            "text": "I mean… do we need to hear a scientific report on this? I feel like its pretty damn obvious that its the case",
            "title_similarity": "0.30162686",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h764zij",
            "score": 1,
            "text": "Don’t work for any military then",
            "title_similarity": "0.22347653",
            "sentiment_compound": 0.0
        },
        {
            "id": "h765fnh",
            "score": 1,
            "text": "i joined a startup for the first time ever from a private consultancy background and although the pay was double, i hated it. the politics, the backstabbing, the force you to fire someone on someone else's behalf, etc. i became extremely angry, short temper, and doubt everything and everyone else. luckily my SO had the biggest heart and patience to see me through that. quit a year back and never look back since.",
            "title_similarity": "0.7647303",
            "sentiment_compound": -0.8251
        },
        {
            "id": "h765y5h",
            "score": 1,
            "text": "My boss once said “I don’t get thanked at the end of the day so why should I thank anyone else?” \n\nAs a supervisor, I thank everyone I’m in charge of when they leave for the day. It takes absolutely no effort at all but makes people feel appreciated. Especially if it has been a difficult day.",
            "title_similarity": "0.5914111",
            "sentiment_compound": 0.5864
        },
        {
            "id": "h766jkn",
            "score": 1,
            "text": "I’m getting my affairs in order to leave a toxic work environment as we speak! I’m getting so excited a mass exodus is happening! Hopefully enough people leave so that our non-compete contracts are void.",
            "title_similarity": "0.6890595",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h767wdi",
            "score": 1,
            "text": "You say that like they would care?",
            "title_similarity": "0.044203926",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h768geb",
            "score": 1,
            "text": "Anyone who has worked for Amazon could have told you that.",
            "title_similarity": "0.16737676",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h768nfe",
            "score": 1,
            "text": "wow im depressed the last 14 years and i worked here and there so nah, you are just fucked up. Every workplace is stupid so just get therapy.",
            "title_similarity": "0.7406488",
            "sentiment_compound": -0.8468
        },
        {
            "id": "h769qkj",
            "score": 1,
            "text": "Welcome to healthcare!",
            "title_similarity": "0.06133771",
            "sentiment_compound": 0.5093
        },
        {
            "id": "h76a63v",
            "score": 1,
            "text": "I dont even get it. Studies have shown that toxic employees do more damage to the workplace than incompetent employees. So what are we doing? Just fire those assholes.",
            "title_similarity": "0.8932233",
            "sentiment_compound": -0.9152
        },
        {
            "id": "h76ae34",
            "score": 1,
            "text": "Wow, that headline describes my QA job perfectly. \nGod I need a hug.",
            "title_similarity": "0.2699019",
            "sentiment_compound": 0.9217
        },
        {
            "id": "h76axn4",
            "score": 1,
            "text": "Many people here blaming management are just whiney operations people who think they're the center of the universe. Newsflash! I don't have to know every detail of what you do to manage your role in the organization. Operations people suffer from persistent solipsism. I was in Ops for 25 years. You're not as elusive and complicated as you think.",
            "title_similarity": "0.74131376",
            "sentiment_compound": -0.8516
        },
        {
            "id": "h76b8jr",
            "score": 1,
            "text": "Petco was extremely toxic and I left. They hired me on the spot and then I quit in less than a month. Everyone was miserable.",
            "title_similarity": "0.7250829",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h76cqhz",
            "score": 1,
            "text": "Companies reading this:\n\n\\*Loki meme yes, very sad :(...\n\nAnyway!\\*",
            "title_similarity": "0.66723",
            "sentiment_compound": -0.2465
        },
        {
            "id": "h76dgz3",
            "score": 1,
            "text": "I need to forward this to all of my last few workplaces",
            "title_similarity": "0.2775159",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76eczp",
            "score": 1,
            "text": "This applies also to childbirth... as a toxic home will make the kid troubled in the future. \n\nVice versa if the home is not toxic, the kid will be sucessfull... \n\nImagine you water a plant with fertiizer, water, and sunlight.... \n\nThe plant will have food + water + light to burn off the calories... \n\nnow imagine that plant fed with junk food, gasoline, and the night... \n\nIt will be weak, wither, and die. \n\n\"your 5 closest friends will be the accumulation of you\"\n\nI work at home depot... the place lacks the responsbility to work on making an enviroment good enough for the associates to fully thrive in.",
            "title_similarity": "0.66387963",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h76ezm9",
            "score": 1,
            "text": "They know. They dont care.",
            "title_similarity": "0.047928076",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h76fpty",
            "score": 1,
            "text": "One would think it would be the same in school for students...",
            "title_similarity": "0.12191198",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76fswi",
            "score": 1,
            "text": "Scaffolding nuff said",
            "title_similarity": "0.012077905",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76itmy",
            "score": 1,
            "text": "Quicken Loans / Rocket Mortgage",
            "title_similarity": "0.13153422",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76iykz",
            "score": 1,
            "text": "I've been asking a lot of people and they feel sick at work. Wanna throw up. Trying to get to the bottom of it but idk I'm not real smart",
            "title_similarity": "0.7534909",
            "sentiment_compound": -0.6845
        },
        {
            "id": "h76k34k",
            "score": 1,
            "text": "Yep I've experienced this.  I used to fantasize about jumping in front of the tube train on the way home (I'm fine now - quit the job and got mental health help).\n\nHad a full mental health crisis and ended up quitting in a very dramatic fashion.  Made my manager cry too by telling him a few home truths about the way he ran the business.",
            "title_similarity": "0.7062297",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h76kf3i",
            "score": 1,
            "text": "This hits so hard. I’ve hit rock bottom with my work and handed my notice in. I’ve been depressed, self harming and just can’t cope with the pressure’s of being there any more. Just three months to go.",
            "title_similarity": "0.72168744",
            "sentiment_compound": -0.8301
        },
        {
            "id": "h76kklk",
            "score": 1,
            "text": "These come out like wvwry other month and America goes \"wow, that's crazy.\" Then proceedes to ignore it and say the younger generations are lazy and complaining too much.",
            "title_similarity": "0.7257099",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h76kuq7",
            "score": 1,
            "text": "Sounds like the place I am in right now!",
            "title_similarity": "-0.021902207",
            "sentiment_compound": 0.4199
        },
        {
            "id": "h76ny4i",
            "score": 1,
            "text": "This is exactly why I had to leave a job once. I love work, but this one environment demanding so much with little reward, and bosses that are rude and crude? Naw, I left. They left right after.",
            "title_similarity": "0.71471655",
            "sentiment_compound": -0.6474
        },
        {
            "id": "h76owgm",
            "score": 1,
            "text": "It is utterly painful to see this reposted to [26 other subreddits](https://www.reddit.com/r/science/duplicates/oujqvq/a_toxic_workplace_triples_your_risk_of_depression/), most of which are company-specific.",
            "title_similarity": "0.8147731",
            "sentiment_compound": -0.4927
        },
        {
            "id": "h76stkj",
            "score": 1,
            "text": "Architecture is Riddles with this. Alot of old generation that dont trust the young and want us to be as miserable as they were for the first decades of our careers.",
            "title_similarity": "0.80243045",
            "sentiment_compound": -0.681
        },
        {
            "id": "h76t4bk",
            "score": 1,
            "text": "What about a toxic planet?",
            "title_similarity": "0.40629646",
            "sentiment_compound": 0.0
        },
        {
            "id": "h76z0qe",
            "score": 1,
            "text": "Shoutout to all the military folks out there",
            "title_similarity": "0.29464668",
            "sentiment_compound": 0.0
        },
        {
            "id": "h773846",
            "score": 1,
            "text": "I left my previous position because of a toxic boss and coworker. I used to think: if I got in a car accident on the way to work, would that be so bad? Realized that wasn't a good mindset and started looking for new work. My coworker at the time was more stuck, and couldn't leave. They turned all the hostility they had previously shown to me onto her. She ended up coming in one day and telling them she was planning to kill herself that night. Of course they got all concerned and \"omg not that\" and got the police and HR involved. She ended up on 6 weeks of Family Medical Leave (so couldn't get fired) but they packed up her office within that first week of her bring gone, and then sent her the notice at week 5 that if she wasn't in the office on that following Monday (the end of her Leave) then she was fired. She went in to talk with the boss/HR and saw her stuff already packed up, and decided it wasn't worth coming back so she took it all and left.",
            "title_similarity": "0.7818927",
            "sentiment_compound": -0.9478
        },
        {
            "id": "h7756ow",
            "score": 1,
            "text": "Well…\n\nSo how much does depression cost us? You know. When compared to the profit we make through increased exploitation?\n\nOh we’re still in the green. \n\nMore exploitation it is. \n\nHave you considered mindfulness training?",
            "title_similarity": "0.5551695",
            "sentiment_compound": 0.212
        },
        {
            "id": "h776cdq",
            "score": 1,
            "text": "Experiencing this now. Went from one toxic environment to another that’s somehow worse than the first, which I left for my mental health’s sake. It’s gotten so bad that even the meds aren’t helping much anymore. I know I’m good at my job, but the vibrant criticism is too much.",
            "title_similarity": "0.73923135",
            "sentiment_compound": -0.1269
        },
        {
            "id": "h77i2ci",
            "score": 1,
            "text": "Companies know this, they  just don’t care",
            "title_similarity": "0.34169856",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h77oiof",
            "score": 1,
            "text": "They just have to man up",
            "title_similarity": "0.15303437",
            "sentiment_compound": 0.0
        },
        {
            "id": "h77q8u7",
            "score": 1,
            "text": "What a twist. Being terrible to ya workers will make em sad and give em a risk of depression.\n\nThat being said I wouldn't want to be the one in charge of balancing what is considered reasonable and unreasonable demands because I know some peeps can be an ass, both from the company and employee side.",
            "title_similarity": "0.80314684",
            "sentiment_compound": -0.9405
        },
        {
            "id": "h77rywa",
            "score": 1,
            "text": "Hated my first job so much but wanted to strive for the top that it led to 3 years of depression and severe alcoholism",
            "title_similarity": "0.74262536",
            "sentiment_compound": -0.8047
        },
        {
            "id": "h77sxxk",
            "score": 1,
            "text": "Mine likes the phrase \"that's how we've always done it\" to justify their pigheaded decisions. The only reason we outperform our competitors is because we have been in business like 30 years longer and it's a small town.",
            "title_similarity": "0.56578857",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h78a4d3",
            "score": 2,
            "text": "I believe this to be true. I used to work at an engineering firm and wondered why we never got kudos for doing a good job. My manager told me “we don’t give complements, because then you would expect a raise.” And as you can imagine it sucked there. It was very Marxist. “Hey, you’re supposed to be happy you even have a job!”",
            "title_similarity": "0.6957816",
            "sentiment_compound": 0.6111
        },
        {
            "id": "h7dafv6",
            "score": 1,
            "text": "Yo! Sparky! Neither management nor stockholders give a damn. Capitalism. American style 2021.  YEEEEEEEEE-HAWWWWWWWWW.",
            "title_similarity": "0.4497257",
            "sentiment_compound": -0.508
        },
        {
            "id": "h7einaf",
            "score": 1,
            "text": "This. I worked at the VA. They tripled our workload, made us do stuff we aren’t technically licensed to do, didn’t explain how to do the said stuff, got rid of shift differentials working holidays and cancelled those days (we wanted to work but they said no). I sent repeated emails asking for help and never got a response. I also maxed out on my pay, found out my male coworker makes $5k more than me, despite me having a degree in our field, also being certified longer and having more experience, same age, and he only has a hs diploma. No, he’s not a veteran or has anything else. Also, 2 females were fired 6 months before covid. I witnessed bullying by the supervisor to those girls and reported it and nothing happened. Then covid hit and we had no PPE the first month and checking in sick veterans outside in the 90 degree heat at midnight. Then I decided to quit.\n\nBefore I did, I met with a therapist who suggested this. I almost committed suicide if it wasn’t for them. He told me to find another job and meant it with concern and help, not as a bad thing. So glad I did. My mood changed instantly",
            "title_similarity": "0.70366377",
            "sentiment_compound": -0.8445
        },
        {
            "id": "h7m0evf",
            "score": 1,
            "text": "There are 3 determinants that can lead to stress and eventually to chronic stress and worse:\n\n* the job itself,\n* level of autonomy at work,\n* relationships with colleagues/boss.\n\nIf you're interested to know more, search for Karasek.",
            "title_similarity": "0.6456186",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h9fu0ha",
            "score": 1,
            "text": "So retail and fast food, and any and all other service occupations. Gotcha",
            "title_similarity": "0.1881252",
            "sentiment_compound": 0.0
        },
        {
            "id": "hagay9b",
            "score": 1,
            "text": "Recently left this type of situation for an exciting new opportunity. Turns out the new job environment is worse than the previous one. I feel stuck and unsure of what to do. It’s demoralizing",
            "title_similarity": "0.72398263",
            "sentiment_compound": -0.0258
        }
    ]
}