{
    "Climate crisis: Scientists spot warning signs of Gulf Stream collapse\n": [
        {
            "id": "h7tyxut",
            "score": 1,
            "text": "Direct link to the study: [N. Boers, Observation-based early-warning signals for a collapse of the Atlantic Meridional Overturning Circulation, *Nature Climate Change*, **11**, 680–688 (2021).](https://doi.org/10.1038/s41558-021-01097-4)\n\n* Access the full text via my referral: [https://rdcu.be/cspBH](https://rdcu.be/cspBH)\n\n>**Abstract:** The Atlantic Meridional Overturning Circulation (AMOC), a major ocean current system transporting warm surface waters toward the northern Atlantic, has been suggested to exhibit two distinct modes of operation. A collapse from the currently attained strong to the weak mode would have severe impacts on the global climate system and further multi-stable Earth system components. Observations and recently suggested fingerprints of AMOC variability indicate a gradual weakening during the last decades, but estimates of the critical transition point remain uncertain. Here, a robust and general early-warning indicator for forthcoming critical transitions is introduced. Significant early-warning signals are found in eight independent AMOC indices, based on observational sea-surface temperature and salinity data from across the Atlantic Ocean basin. These results reveal spatially consistent empirical evidence that, in the course of the last century, the AMOC may have evolved from relatively stable conditions to a point close to a critical transition.",
            "title_similarity": "0.77012146",
            "sentiment_compound": -0.8201
        },
        {
            "id": "h7tzo2k",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.27692544"
        },
        {
            "id": "h7tpdiz",
            "score": -4,
            "text": "For those who didn't read the article:\n\n\"The complexity of the AMOC system and uncertainty over levels of future global heating make it impossible to forecast the date of any collapse for now. It could be within a decade or two, or several centuries away. But the colossal impact it would have means it cannot ever be allowed to happen, the scientists said.\"\n\nSo this isn't something that's about to happen in the next few months. I'm not saying we shouldn't be acting to resolve this, we should ASAP; however the title of this post is making this sound scarier than it is.",
            "title_similarity": "0.56999767",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h7twh1g",
            "score": -19,
            "text": "The greenest thing you can do to help avert the upcoming climate crisis is not to recycle or go vegan, but stop having children.  \n\nGoing vegan and what ever helps, but the biggest producer of green house gasses is yet another human.  Want to reduce the world population growth, well better education helps not just in the first world but the third as well. Ironically giving access to clean electricity in the third world would also help as if the only entertainment that exists when the sun goes down and theres no power well 9 months later...",
            "title_similarity": "0.50979817",
            "sentiment_compound": 0.9772
        },
        {
            "id": "h7ubvou",
            "score": 5,
            "text": "Quick! Who do we give more power and money to, to make this go away? \n\nHint: the control freaks in power I suspect.",
            "title_similarity": "0.49514154",
            "sentiment_compound": -0.4389
        },
        {
            "id": "h7umwpp",
            "score": -3,
            "text": "Its time to stop having kids.",
            "title_similarity": "0.35227925",
            "sentiment_compound": -0.296
        },
        {
            "id": "h7u20c9",
            "score": 17,
            "text": "Call me when it happens.",
            "title_similarity": "0.24893907",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7u6pps",
            "score": 12,
            "text": "they said the golf stream would change direction in 15 years too, in 1975...",
            "title_similarity": "0.3903625",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7tndx8",
            "score": 6,
            "text": "[deleted]",
            "title_similarity": "0.27692544"
        },
        {
            "id": "h7u8z5o",
            "score": -28,
            "text": "Props for not using a picture of a wildfire for your propaganda this time. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPoliticians & Scientists- GIVE US $ AND POWER AND WE’LL MAKE IT COLDER!",
            "title_similarity": "0.5723167",
            "sentiment_compound": -0.3164
        },
        {
            "id": "h7tvt6f",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.2516776"
        },
        {
            "id": "h7udagy",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.2516776"
        },
        {
            "id": "h7ucbq2",
            "score": 4,
            "text": "You're all just discussing how terrible it would be, rather than the validity of the paper. There's very many variables and missing pieces to the research, which is admitted by the study. I'm also curious as to how they know what the warning signs are. No one has seen a gulf stream stop, as far as I'm aware. Very speculative, for me. Not saying it won't happen, but I'm not seeing anything the evidence here.",
            "title_similarity": "0.516216",
            "sentiment_compound": -0.5193
        },
        {
            "id": "h7uuunc",
            "score": -12,
            "text": "Sounds horrible!\n\nI wonder if Obama et all will sell their $15+ million mansions by the ocean, and their private jets after this terrible news",
            "title_similarity": "0.5788933",
            "sentiment_compound": -0.8135
        },
        {
            "id": "h7u5oa0",
            "score": 11,
            "text": "All going according to plan.\n\nThe wealthy will inherit the earth, \"new earth\".\n\nOf course, they're getting rid of 99.99% of the rest of us to make that work.",
            "title_similarity": "0.4140273",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h7ujiqu",
            "score": -2,
            "text": "In 200 years we’ll turn the corner on this issue.  In 300 years we’ll have public education explaining the dangers of Conservative Capitalism and how it destroyed most of the world and wiped out nearly a billion people.  In 400 years we’ll have forgotten everything we learned, but we’ll have enough renewable energy sources that it mostly will seem like a problem for the “primitives of the first century of 2000”.   I just hope I am an immortal vampire by this point and that anime is still a thing.",
            "title_similarity": "0.5331927",
            "sentiment_compound": 0.6187
        },
        {
            "id": "h7tz6ge",
            "score": -2,
            "text": "Once the great Britain is fucket by climate, are we all going to be fucket as well?",
            "title_similarity": "0.6789932",
            "sentiment_compound": 0.7351
        },
        {
            "id": "h7wesxx",
            "score": 0,
            "text": "Here we go again… first of all [read this](http://ocp.ldeo.columbia.edu/res/div/ocp/gs/).  \n\nSecond, there is not such thing as an irreversible tipping point. The earth has been far hotter than it is today, with far higher concentrations of greenhouse gas than we have today and yet it was clearly reversible. Any source that claims we are reaching an irreversible tipping point is literally lying to you and should not be a trusted source of news.",
            "title_similarity": "0.5151573",
            "sentiment_compound": -0.6192
        },
        {
            "id": "h7ufxsj",
            "score": 0,
            "text": "We've been hearing about this for so many years. Is this different than all the previous warnings?",
            "title_similarity": "0.317133",
            "sentiment_compound": -0.296
        },
        {
            "id": "h7wdk8n",
            "score": 0,
            "text": "TIL most Redditors are climate experts",
            "title_similarity": "0.43072543",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7ucm62",
            "score": 4,
            "text": "If people would start doing simple stuff like\n\nNot getting a new phone every year\nDitching smart devices like watches\nNot buying stuff you use once and tossing it.\n\nLast I checked it people went to a 3 year phone upgrade cycle it would take the equivalent of 600,000 cars off the road in America alone.  I don’t know what the figure are on smart watches.",
            "title_similarity": "0.45688736",
            "sentiment_compound": 0.8126
        },
        {
            "id": "h7ua6ki",
            "score": -7,
            "text": "The end is nigh....for humans. Earth will will be fine. We screwed the pooch long ago. No stopping it now.",
            "title_similarity": "0.42984414",
            "sentiment_compound": -0.2396
        },
        {
            "id": "h7u3vp7",
            "score": -9,
            "text": "You guys haven’t accepted the collapse of the human race yet, have you?",
            "title_similarity": "0.46332794",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h7tpmvk",
            "score": 31,
            "text": "[removed]",
            "title_similarity": "0.2516776"
        },
        {
            "id": "h7tkoei",
            "score": -45,
            "text": "This appears to be misreporting. The Gulf Stream is massive and has massive momentum. It would take millennia for it to slow down. However the effect it has in warming NE America and Northern Europe is only skin deep. Ice-cold fresh water from Greenland is lighter than warm sea-water and spills out on the surface of the North Atlantic with the warmer water still moving underneath. This cancels the Gulf Stream warming effect and makes the surface ocean even colder than ordinary seawater. This results in climate change, in this case for the colder, while Greenland ice melts for the next few centuries. I have not seen any indication that this has been modeled but in theory this should make the most Northern  Atlantic cold and dry.",
            "title_similarity": "0.58927643",
            "sentiment_compound": 0.2471
        },
        {
            "id": "h7ulkjc",
            "score": -1,
            "text": "The tolerance on this stuff makes my head hurt. A couple decades or a couple centuries ….who knows. But we do know that without a doubt that this is clearly the weakest it’s ever been in the last 1600 years. Ok so it was weaker 1700 years ago? Or is that as far back we can conclude due to our current technology? Speaking of technology how are that certain, fine soil sediment…. What separates classification of fine soil and the AMOC is weaken fine soil? Listen I get it we need to do something globally, but being this vague and just expecting people to take it as gospel bugs me. If I wanted bold, vague predictions I’d read the bible.",
            "title_similarity": "0.5552618",
            "sentiment_compound": 0.594
        },
        {
            "id": "h7unc6m",
            "score": 1,
            "text": "You’ll recall the Younger Dryas event took place the last time the Gulf Stream stopped. Mini Ice incoming? On one hand I’d welcome the return to a cold climate thus avoiding global warming. On the other hand I hate winters.",
            "title_similarity": "0.61594033",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h7v4hno",
            "score": 1,
            "text": "Am I the only one who is totally stoked that this is coming way quicker than expected. For the longest time it felt like capital was leaving the populace out to dry, with the new science of the past few years though it seems no one is going to live on this planet with any level of comfort in a hundred years.",
            "title_similarity": "0.43220338",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h7v63tx",
            "score": 1,
            "text": "If every person on the planet and every private company on the planet did absolutely everything to mitigate climate change we are still screwed because The US military alone is releasing enough greenhouse gases (equal to 100 smaller countries) to tip the planet to dangerous CO2 levels: https://www.google.com/search?q=pentagon%20pollution&ie=utf-8&oe=utf-8&client=firefox-b-m\n\nThe war machine has to end. It’s either a 360 degree fundamental paradigm shift in everything we do or we are gone!",
            "title_similarity": "0.62024826",
            "sentiment_compound": -0.9098
        },
        {
            "id": "h7vhc07",
            "score": 1,
            "text": "Our Earth is a living organism. THAT FACT ALONE should change our thinking. \n\nNo matter what we do, our Earth will take care of itself. \n\nI think it’s funny, that humans have so much pride, that they think, they can actually change how the Earth changes. \n\nYes!  There is “Climate Change.”  The Earth will always take care of itself.",
            "title_similarity": "0.5079202",
            "sentiment_compound": 0.9035
        },
        {
            "id": "h7viods",
            "score": -1,
            "text": "The doomsaying prophets are out in full force here, and they want you to repent your carbon sins for salvation.",
            "title_similarity": "0.5518259",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h7vt6zb",
            "score": -1,
            "text": "This is also what you get when you have to support 8 billion lives.\n\nAll you over population deniers, the ones that said \"yeah, get more in here\" you got a hand in this as well. \n\nBut also, not the first time this has happened, and I the notion it takes \"millions \" of years is 1 and educated guess and 2, as far as we know, happened about a million years ago \n\nWhen we see natural climate change,  we freak out cause we as a species think we're in control and can't handle ideas like the planet shifting on its own",
            "title_similarity": "0.5792087",
            "sentiment_compound": 0.0734
        },
        {
            "id": "h7vxy7t",
            "score": -1,
            "text": "Can’t fix it if it’s already that far gone. Climate isn’t a switch that can be flipped Willy nilly. Takes decades. Which we don’t have if we are to believe any climate warrior",
            "title_similarity": "0.43921936",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7w3bco",
            "score": -1,
            "text": "Embrace change, adapt, stop clinging to the way things were.",
            "title_similarity": "0.40453383",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h7tme42",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.2516776"
        },
        {
            "id": "h7tqo3x",
            "score": 134,
            "text": "Some heroic assumptions in that little manifesto. Ocean water follows Newton's first law, in order to follow the curved course it takes, powerful forces are acting on the waters of the Gulf Stream.\n\nIt is those forces, not momentum, that moves all that water. Momentum would be dissipated quickly by the changes in direction, the Gulf Stream is driven by temperature differentials, weather effects, and the geometry of the earth.\n\nThe Gulf Stream has been weakening for some time, this is not a sudden change. It's part of a complete reset of the world's ecology that global warming is just beginning to impose.\n\nIf it depresses you that 2021 is the hottest of the past hundred years, cheer up! This year will be the coolest of the next hundred years, so make the most of it.",
            "title_similarity": "0.74849653",
            "sentiment_compound": 0.5983
        },
        {
            "id": "h7uwdee",
            "score": 1,
            "text": "Now it's getting funny",
            "title_similarity": "0.1755166",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7v7c5i",
            "score": -1,
            "text": "Does anyone know realistically how much longer we have ? And how soon will things like power grids stop working ? I’m just trying to figure out my 30s …does anyone know ?",
            "title_similarity": "0.46577105",
            "sentiment_compound": 0.212
        },
        {
            "id": "h7txm3v",
            "score": -19,
            "text": "the article says Europe might get colder. isn't that the goal since many parts of Europe have been warming and are too hot according to recent studies?",
            "title_similarity": "0.532657",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h7ttc98",
            "score": 10,
            "text": ">The likelihood of this extremely high-impact event happening increases with every gram of CO2 that we put into the atmosphere”.\n\nGreat, now I feel bad for breathing.",
            "title_similarity": "0.5016028",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h7ux2m8",
            "score": 0,
            "text": "YES FINALLY THE RAIN WILL STOP. Oh and we’ll get snow whatever.",
            "title_similarity": "0.39546978",
            "sentiment_compound": 0.128
        },
        {
            "id": "h7v0rfd",
            "score": 0,
            "text": "It might finally be cold and snow again in the UK at Christmas??\nSign me up.",
            "title_similarity": "0.44296953",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7w1uca",
            "score": 0,
            "text": "This is something I read about years ago as a possibility of having started.\nI'm not denying or arguing against science, I'm just annoyed that they are reinventing a headline for a new round of attention. This is why so many people are apathetic to outright denying climate change. Everything is an apocalypse.",
            "title_similarity": "0.64798164",
            "sentiment_compound": -0.3987
        },
        {
            "id": "h7w7wwm",
            "score": 0,
            "text": "I think the plan is to wait and see what happens",
            "title_similarity": "0.37286174",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7wj0sj",
            "score": 0,
            "text": "It could happen now or centuries from now",
            "title_similarity": "0.29674175",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7xbi4o",
            "score": 0,
            "text": "So.....when energy is removed from the Gulfstream, that causes Global Cooling?\n\n57,000 wind turbines in the U.S.\n\nWe're going to need more CO2.\n\nOur new hero in a cape.......\n\nCARBON EMISSIONS MAN",
            "title_similarity": "0.6302867",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h7u54ey",
            "score": 92,
            "text": "Thing is, climate change science has been a thing for DECADES! I’m 39 now. When I was 10, I did a project about the damage CFCs and exhaust fumes would do to the atmosphere, environment, and climate. I remember the fear of acid rain and superstorms. \n\nAnd yet, here we are almost 30 years later….",
            "title_similarity": "0.6580037",
            "sentiment_compound": -0.8398
        },
        {
            "id": "h7u7ise",
            "score": 23,
            "text": "They KNEW this wild happen and did nothing. Now it’s happening and they do WORSE than nothing.",
            "title_similarity": "0.3938551",
            "sentiment_compound": -0.5904
        },
        {
            "id": "h7u5hw7",
            "score": 68,
            "text": "Honestly I used to want kids and a family and stuff but in the last five years I've completely done a 180°, worlds fucked man. We're never leaving this dirtball and a few generations from now is gonna suck.",
            "title_similarity": "0.4134199",
            "sentiment_compound": -0.8689
        },
        {
            "id": "h7u9kil",
            "score": -6,
            "text": "Global Warming... Whadya mean?! The UK is about to enter a new ice age",
            "title_similarity": "0.6078665",
            "sentiment_compound": 0.2244
        },
        {
            "id": "h7tve1f",
            "score": 107,
            "text": "Currently shareholders and profiteers pay to not deal with things that average people deal with. They pay and work to keep power so they do not suffer with the rest of people and their basic needs.\n\nNothing will change that behavior. Not climate crisis, not a labor crisis, not a food crisis. They will throw money at it and they will keep themselves separated.\n\nThey know the end game ends with many people dying that's why they're securing so much power and means to stay separated.\n\nThey feel people are made for work so they will work them until they get what they want.\n\nWhich is more power to separate themselves from people who suffer from things that the  shareholders and profiteers just do not want to suffer from.\n\nCatastrophe will come. Many will die. The profiteers will pay to keep themselves safe. \n\nIt will work for some. They will attempt to purchase their way out of suffering like the rest of humanity will. \n\nIt's a given.",
            "title_similarity": "0.41345042",
            "sentiment_compound": 0.7757
        },
        {
            "id": "h7uhb3s",
            "score": 1,
            "text": "Unfortunately the title and first paragraph are wrong. The Gulf Stream is not the same thing as the AMOC and the paper this is referring to is not predicting the collapse of the Gulf Stream. The Gulf Stream is a boundary current of a wind-driven gyre and is not going to collapse as long as the winds keep blowing and the earth keeps spinning.\n\nSetting this problem aside, it's a controversial question in oceanography whether the AMOC is capable of suddenly collapsing (as opposed to gradually weakening). There is no consensus as to whether this is true.",
            "title_similarity": "0.60885954",
            "sentiment_compound": -0.6672
        },
        {
            "id": "h7ut8k5",
            "score": -1,
            "text": "So there was a huge back and forth in the last few decades or so about the possibility of a slowdown (or complete collapse) of the Gulf stream, and scientists were completely devided by this. Once, this was regarded as a real possibility, then it was said this forecast was just plain fear mongering, false alarm and all that. Now we have scientists revisting their statements again - which one is it? It's too late here to completely get into for me, but in case I 'll find the time, I re-evaluate the research on this topic here...",
            "title_similarity": "0.6865746",
            "sentiment_compound": -0.5647
        },
        {
            "id": "h7uu56w",
            "score": -1,
            "text": "Second Ice age incoming...",
            "title_similarity": "0.34340525",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7v9k2i",
            "score": 1,
            "text": "I want to plant “time capsules” underground of my life and those I care for at certain places in my state because it is far enough from big water to be safe when either the aliens come after we’re gone, or whatever humans evolve into a millennia or ten from now, may one day see the beautiful family I could’ve created but was sacrificed because idiots who think brown people having a voice is more dangerous than climate change. “The climate is always changing” with that kind of avoidant personality, I wish those people were the ones wiped off the face of the earth. But they will bring the peaceful ones with them.",
            "title_similarity": "0.52539504",
            "sentiment_compound": 0.8738
        },
        {
            "id": "h7w0ol8",
            "score": -1,
            "text": "Over toJoe Biden for comment: Joe? Whatcha gonna do?\n\n“Huh? What are you talking about? Where am I? Hey cmon man, what am I supposed to do?”",
            "title_similarity": "0.37080032",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7w93tf",
            "score": -1,
            "text": "Most of these extreme predictions don’t pan out fortunately.\n\nhttps://www.aei.org/carpe-diem/50-years-of-failed-doomsday-eco-pocalyptic-predictions-the-so-called-experts-are-0-50/",
            "title_similarity": "0.54252225",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7twsoi",
            "score": 44,
            "text": "And that's what happens when the Artic dumps huge amounts of ice melt fresh water into the circulation system of saline sea water. This was predicted many years ago\n\nSummer in UK this year has been very cool - temps above 25C only 4 days in my southern county.  And more constant rain showers than the jokes about our weather. For decades there has been little or no snow this far south",
            "title_similarity": "0.48999894",
            "sentiment_compound": 0.5531
        },
        {
            "id": "h7uepzs",
            "score": -6,
            "text": "What if china is letting it happen on purpose cus it doesnt seem like theyre affected and they produce the most carbon",
            "title_similarity": "0.39578855",
            "sentiment_compound": -0.4039
        },
        {
            "id": "h7tt8iz",
            "score": 95,
            "text": "This is extraordinarily bad for the uk",
            "title_similarity": "0.47834057",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h7tjmww",
            "score": 34,
            "text": "[removed]",
            "title_similarity": "0.2516776"
        },
        {
            "id": "h7ty8sf",
            "score": 37,
            "text": "There is nothing we as individuals can do to stop it, and those in power don’t care...\n\nI’ve already come to terms that we’ve already catalyzed everything that will come, and a possible mass extinction at that.",
            "title_similarity": "0.4266237",
            "sentiment_compound": 0.25
        },
        {
            "id": "h7uyfj0",
            "score": 10,
            "text": "This thread is FULL of people who think they know what theyre talking about. Just remember these are all random people spouting something they heard somewhere for the most part. Dont take these comments as facts.",
            "title_similarity": "0.300444",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7u7wr0",
            "score": 2,
            "text": "Scientists say that tipping point is uncertain. But on what basis do they say there is wide gap for tipping?\n\nHeat domes that killed people in Canada didn't exhibit wide bands over the years. So what if Gulf stream gives suddenly?",
            "title_similarity": "0.6023164",
            "sentiment_compound": -0.8485
        },
        {
            "id": "h7vv9i8",
            "score": -2,
            "text": "So much for global warming",
            "title_similarity": "0.538979",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h7w3jwe",
            "score": -2,
            "text": "Maybe we should stop fishing and eating meat? Idk if it's too late but you know maybe we already caused enough harm y'all",
            "title_similarity": "0.48878348",
            "sentiment_compound": -0.7615
        },
        {
            "id": "h7wo7h7",
            "score": 2,
            "text": "Interesting. But how much of that is affected by humanity and not just a natural cycle of the Earth?",
            "title_similarity": "0.45114097",
            "sentiment_compound": -0.4049
        },
        {
            "id": "h7tzfyb",
            "score": 26,
            "text": "[deleted]",
            "title_similarity": "0.27692544"
        },
        {
            "id": "h7tenum",
            "score": -3,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.41075635",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h7txffb",
            "score": 4,
            "text": "Finally we will have the Elfstedentocht again in The Netherlands. It giet oan!",
            "title_similarity": "0.2335698",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7v6sww",
            "score": 3,
            "text": "God we are so fucked. This stuff horrifies me because I feel like no matter what changes I make, it doesn’t matter. Billionaires will just do whatever they want to destroy to get more money than they can spend, all at our expense. This still literally has kept me up at night because I worry of the horrible things I will experience when I get old. I can’t imagine people having kids now, I’d be terrified of putting them into an all out war for water and food.",
            "title_similarity": "0.45165756",
            "sentiment_compound": -0.9761
        },
        {
            "id": "h7tzf1n",
            "score": 4,
            "text": "Europe gonna be frozen in 2050",
            "title_similarity": "0.46920002",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7u79u6",
            "score": -4,
            "text": "Will that negatively impact Florida, Texas and other Gulf Coast States?  Oh well!",
            "title_similarity": "0.54664034",
            "sentiment_compound": 0.3382
        },
        {
            "id": "h7u81z4",
            "score": 4,
            "text": "Geez... my grandkids are fucked",
            "title_similarity": "0.4349156",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h7ues6n",
            "score": -6,
            "text": "The earth will be just fine, all of these changes only threaten current human societal structures but humanity and fauna will survive it. \n\nIt is probably a good thing for the planet and we can hope that future societies learned from our mistakes.",
            "title_similarity": "0.48366702",
            "sentiment_compound": 0.6187
        },
        {
            "id": "h7umhyv",
            "score": -3,
            "text": "Wow could this be happening because our planet is spinning faster.\n\nhttps://phys.org/news/2021-01-earth-faster.html",
            "title_similarity": "0.42175442",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h7u6sp6",
            "score": 52,
            "text": "And people still don’t care about the environment. Yikes",
            "title_similarity": "0.2431824",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h7tp6l1",
            "score": 331,
            "text": "A longer and harsh winter in USA’s east coast and Europe means more energy needed for keeping them working, so more CO2 will be released to the atmosphere. Yeap, we’re doomed.",
            "title_similarity": "0.54549724",
            "sentiment_compound": -0.6915
        },
        {
            "id": "h7trb0w",
            "score": 33,
            "text": "Oh boy! Europe is going to get some snow when this happens.\n\nThe winter is coming!",
            "title_similarity": "0.44736046",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7u8cyp",
            "score": 5,
            "text": "If we only had a warning that these things were going to happen! Where were the scientists 20 years ago?",
            "title_similarity": "0.5532914",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h7uxhrt",
            "score": -6,
            "text": "Who cares? I am not going to stop driving to starbucks to get my coffee just to save the planet.",
            "title_similarity": "0.3610995",
            "sentiment_compound": 0.7957
        },
        {
            "id": "h7uve6w",
            "score": 6,
            "text": "P1: The world needs fresh, potable water.\n\nP2: A major criticism of ocean water desalination plants is that highly concentrated salts are a byproduct.\n\nP3: The Mid-Atlantic ocean conveyor current that drives the jet stream is stalling out because the melt water from the Greenland ice sheet (among other rapidly melting Arctic fresh water melt inputs) is making the water too fresh, not saline enough.\n\nC: We should engage in ocean water desalination around the world and ship gigatons of salt using the lowest carbon cost transportation available to heavily salt the waters in the arctic ocean in select places to keep the salination overturn that drives the conveyor ocean current going!",
            "title_similarity": "0.6185629",
            "sentiment_compound": 0.2498
        },
        {
            "id": "h7uak5n",
            "score": 9,
            "text": "At what point do we just admit humanity is fucked?",
            "title_similarity": "0.4572472",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h7tzn0w",
            "score": 139,
            "text": "Question(probably a dumb one) if the Gulf Stream collapses wouldn’t that possibly be the  start of a cooling period maybe eventually an ice age?",
            "title_similarity": "0.72497326",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h7v1gsk",
            "score": 10,
            "text": "Thanks, one more reason to avoid having kids. The best time to have been born has passed and it's all downhil from here.",
            "title_similarity": "0.4304128",
            "sentiment_compound": 0.6845
        },
        {
            "id": "h7u188h",
            "score": 79,
            "text": "When they say it \"must not be allowed to happen\" they mean \"is going to happen because humans\"",
            "title_similarity": "0.40367663",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7tu2by",
            "score": 139,
            "text": "[removed]",
            "title_similarity": "0.2516776"
        },
        {
            "id": "h7uaqx3",
            "score": 12,
            "text": "Another warning to be ignored, you people think things are just going to be fine and then when it's evident and the end is literally incoming it will be all what do I do? How do we stop this? Sacrifice is how we band together and we take down the mega corps whatever the cost that are polluting. We end cattle farms and humans deal. We stop China's reckless abandon. There are real things to do but none of you are going to do anything and we're all going to have to look in our children's eyes and lie as we tuck them in on the titanic. Enjoy the end bc nothing's going to change and for bonus points the rich will escape off to space so the worst of us and the people responsible will live.",
            "title_similarity": "0.52534914",
            "sentiment_compound": 0.807
        },
        {
            "id": "h7tkvo7",
            "score": 314,
            "text": "[removed]",
            "title_similarity": "0.2516776"
        },
        {
            "id": "h7uvs0y",
            "score": 14,
            "text": "So we’re fucked. The environment is collapsing and no one with any degree of power seems to be willing to do anything about it",
            "title_similarity": "0.36752766",
            "sentiment_compound": -0.8434
        },
        {
            "id": "h7trram",
            "score": 412,
            "text": "Cutting emissions and transitioning to more eco-friendly energy solutions doesn't seem like it's going to be enough. What kind of technological solutions for carbon capture are possible? We're going to need to employ some moon-shot level efforts to combat this (when the world finally comes around to the idea).",
            "title_similarity": "0.5600079",
            "sentiment_compound": 0.0083
        },
        {
            "id": "h7ufjm6",
            "score": 18,
            "text": "My retirement plan is dying in the climate collapse.",
            "title_similarity": "0.677681",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h7u7y3x",
            "score": 108,
            "text": "So nobody has to deal with their ridiculous paywall.\n\n\nThu 5 Aug 2021 11.08 EDT\n\nClimate scientists have detected warning signs of the collapse of the Gulf Stream, one of the planet’s main potential tipping points.\nThe research found “an almost complete loss of stability over the last century” of the currents that researchers call the Atlantic meridional overturning circulation (AMOC). The currents are [already at their slowest point in at least 1,600 years](https://www.theguardian.com/environment/2018/apr/11/critical-gulf-stream-current-weakest-for-1600-years-research-finds), but the new analysis shows they may be nearing a shutdown.\n\nSuch an event would have catastrophic consequences around the world, severely disrupting the rains that billions of people depend on for food in India, South America and West Africa; increasing storms and lowering temperatures in Europe; and pushing up the sea level in t4he eastern North America. It would also further endanger the Amazon rainforest and Antarctic ice sheets.\nThe complexity of the AMOC system and uncertainty over levels of future global heating make it impossible to forecast the date of any collapse for now. It could be within a decade or two, or several centuries away. But the colossal impact it would have means it must never be allowed to happen, the scientists said.\n\n“The signs of destabilisation being visible already is something that I wouldn’t have expected and that I find scary,” said Niklas Boers, from the Potsdam Institute for Climate Impact Research in Germany, who did the research. “It’s something you just can’t [allow to] happen.”\nIt is not known what level of CO2 would trigger an AMOC collapse, he said. “So the only thing to do is keep emissions as low as possible. The likelihood of this extremely high-impact event happening increases with every gram of CO2 that we put into the atmosphere”.\n\nScientists are increasingly concerned about tipping points – large, fast and irreversible changes to the climate. Boers and his colleagues reported in May that a significant part of the Greenland ice sheet is [on the brink](https://www.theguardian.com/environment/2021/may/17/greenland-ice-sheet-on-brink-of-major-tipping-point-says-study), threatening a big rise in global sea level. Others have shown recently that the Amazon rainforest is now[ ](https://www.theguardian.com/environment/2021/jul/14/amazon-rainforest-now-emitting-more-co2-than-it-absorbs)emitting more CO2 than it absorbs, and that the 2020 Siberian heatwave led to [worrying releases of methane](https://www.theguardian.com/environment/2021/aug/02/climate-crisis-siberian-heatwave-led-to-new-methane-emissions-study-says).\n\n￼\n\nAmazon rainforest now emitting more CO2 than it absorbs\n\nRead more\n\nThe world may already have crossed a series of [tipping points](https://www.theguardian.com/environment/2019/nov/27/climate-emergency-world-may-have-crossed-tipping-points), according to a 2019 analysis, resulting in “an existential threat to civilisation”. A major report from the Intergovernmental Panel on Climate Change, due on Monday, is expected to set out the worsening state of the climate crisis.\n\nBoer’s research, published in the journal Nature Climate Change, is titled “Observation-based early-warning signals for a collapse of the AMOC”. Ice-core and other data from the last 100,000 years show the AMOC has two states: a fast, strong one, as seen over recent millennia, and a slow, weak one. The data shows rising temperatures can make the AMOC switch abruptly between states over one to five decades.\nThe AMOC is driven by dense, salty seawater sinking into the Arctic ocean, but the melting of freshwater from Greenland’s ice sheet is slowing the process down earlier than climate models suggested.\nBoers used the analogy of a chair to explain how changes in ocean temperature and salinity can reveal the AMOC’s instability. Pushing a chair alters its position, but does not affect its stability if all four legs remain on the floor. Tilting the chair changes both its position and stability.\n\nEight independently measured datasets of temperature and salinity going back as far as 150 years enabled Boers to show that global heating is indeed increasing the instability of the currents, not just changing their flow pattern.\nThe analysis concluded: “This decline [of the AMOC in recent decades] may be associated with an almost complete loss of stability over the course of the last century, and the AMOC could be close to a critical transition to its weak circulation mode.”\nLevke Caesar, at Maynooth University in Ireland, who was not involved in the research, said: “The study method cannot give us an exact timing of a possible collapse, but the analysis presents evidence that the AMOC has already lost stability, which I take as a warning that we might be closer to an AMOC tipping than we think.”\n\nDavid Thornalley, at University College London in the UK, whose work showed the AMOC is at its weakest point in 1,600 years, said: “These signs of decreasing stability are concerning. But we still don’t know if a collapse will occur, or how close we might be to it.”",
            "title_similarity": "0.7415441",
            "sentiment_compound": -0.9976
        },
        {
            "id": "h7u09kj",
            "score": 49,
            "text": "[removed]",
            "title_similarity": "0.2516776"
        },
        {
            "id": "h7uq5i0",
            "score": 19,
            "text": "The crisis is already busy, last month the south of my country was submerged. My neighbouring country got totally fucked. We are already to late, I lost the hope that we would be able to come together and fix this issue.",
            "title_similarity": "0.5545831",
            "sentiment_compound": -0.8479
        },
        {
            "id": "h7txyvt",
            "score": 59,
            "text": "[removed]",
            "title_similarity": "0.2516776"
        },
        {
            "id": "h7tqu14",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.2516776"
        },
        {
            "id": "h7trrf1",
            "score": 2575,
            "text": "Thanks to researchers at MIT, you can see the impact of various climate policies, when put into effect, at https://en-roads.climateinteractive.org/scenario.html?v=2.7.11\n\nIf you're American, we have an opportunity right now include the most impactful climate policy in this year's budget reconciliation package. You can contact your senators and ask them to include a price on carbon at https://cclusa.org/senate",
            "title_similarity": "0.6175509",
            "sentiment_compound": 0.6908
        },
        {
            "id": "h7u7n78",
            "score": 165,
            "text": "Every week there’s a new science warning. Governments around the world barely react, or ignore them completely.\n\nIt should just be: “scientists create own society on island, tells the rest of the world ‘good luck’ as they build their own infrastructure to survive climate catastrophe.”",
            "title_similarity": "0.53752327",
            "sentiment_compound": -0.3687
        },
        {
            "id": "h7tmiez",
            "score": 456,
            "text": "[removed]",
            "title_similarity": "0.2516776"
        },
        {
            "id": "h7tqt8k",
            "score": 594,
            "text": "Europe entirely will be affected, not just the UK.",
            "title_similarity": "0.42796284",
            "sentiment_compound": -0.2177
        },
        {
            "id": "h7tnti9",
            "score": 37,
            "text": "[removed]",
            "title_similarity": "0.25167757"
        },
        {
            "id": "h7tp9ta",
            "score": 97,
            "text": "[removed]",
            "title_similarity": "0.2516776"
        },
        {
            "id": "h7tq737",
            "score": 449,
            "text": "Unless I am wrong, I think that would mean that Europe would be getting seasons similar to the corresponding latitude in North America. Winters in Northern Europe could get interesting.",
            "title_similarity": "0.4661501",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h7u6ub0",
            "score": 64,
            "text": "[removed]",
            "title_similarity": "0.2516776"
        },
        {
            "id": "h7u2noo",
            "score": 2430,
            "text": "It is worth pointing out that the Gulf Stream is not synonymous with the Atlantic Meridional Overturning Circulation (AMOC). While AMOC is extremely important for our climate and makes up a *portion* of the Gulf Stream flow, the Gulf Stream would exist without AMOC because of wind forcing and something called the Sverdrup balance. \n\nThere is an analogous current off the coast of Japan called the Kuroshio Current, and it exists despite there being no Pacific Meridional Overturning. \n\nThe article references a study about AMOC collapse. As far as I'm aware, there's no expectation that the Gulf Stream will collapse (though admittedly I'm not familiar with the literature about projected changes to the large scale wind/Sverdrup balance).\n\n**EDIT**: to be clear, AMOC collapse would likely be catastrophic to the climate system. I'm just explaining that there's a distinction between AMOC and wind-driven boundary current that makes up (part of) the Gulf Stream - and only one of those is being studied here.",
            "title_similarity": "0.56769335",
            "sentiment_compound": -0.8186
        },
        {
            "id": "h7tiumk",
            "score": 2501,
            "text": "This has huge implications for marine ecosystems as nutrient-rich water from the arctic won't be brought up to swallower depths thus fueling trophic webs.   \nNot to mention destabilizing terrestrial regions.",
            "title_similarity": "0.5583507",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h7u4gdz",
            "score": 657,
            "text": "Want to see an animation the current state of the Gulf Stream? One of my favorite web pages: https://earth.nullschool.net/#current/ocean/surface/currents/orthographic=-46.25,25.55,254/loc=-64.023,17.964",
            "title_similarity": "0.5459634",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h7tfxap",
            "score": 10493,
            "text": "As I recall, the Gulf Stream keeps Great Britain warmer than other countries at that latitude.  If it slows down or collapses completely, GB could see winters as cold and severe Canada as far north as Hudson Bay.",
            "title_similarity": "0.5252038",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h7tzrxq",
            "score": 2,
            "text": "No wonder Davos has been talking climate recently. They are royally fucked.",
            "title_similarity": "0.6282481",
            "sentiment_compound": -0.765
        },
        {
            "id": "h7u0ywj",
            "score": 1,
            "text": "Basically... we f$%ked up. Europe, welcome to the Ice Age.",
            "title_similarity": "0.47698557",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h7u17wc",
            "score": 1,
            "text": "How will this affect Southwest Africa?",
            "title_similarity": "0.42828494",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7u3s13",
            "score": 1,
            "text": "If a Gulf Stream collapse means colder winters in Europe, does this mean more ice sheet formation (and thus some reversal of global warming)?",
            "title_similarity": "0.6424503",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h7u6qdj",
            "score": 1,
            "text": "There was a movie about it",
            "title_similarity": "0.24355201",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7u81jg",
            "score": 1,
            "text": "I'm not even super far north in Canada and our record low is below -50 for about 5 months of the year with the record wind chill being -62. I wonder if western and northern Europe can even adapt to that.",
            "title_similarity": "0.3582909",
            "sentiment_compound": -0.6423
        },
        {
            "id": "h7u8y7d",
            "score": 1,
            "text": "so long everyone,  it's been a good run!",
            "title_similarity": "0.11426307",
            "sentiment_compound": 0.4926
        },
        {
            "id": "h7u9pnh",
            "score": 1,
            "text": "I fear that a global drought is imminent in my lifetime... Goodbye crops, goodbye food.",
            "title_similarity": "0.61059093",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h7uafe1",
            "score": 1,
            "text": "CO2 emissions are expected to [increase by approximately 4.8%](https://www.iea.org/reports/global-energy-review-2021/co2-emissions) in 2021, which would leave the world 1.2% below the 2019 emissions peak. If emissions increase by at least 1.2% in 2022, we will be back to 2019  emissions levels. [According to Climate Action Tracker](https://climateactiontracker.org/global/temperatures/), based on current policies, it's possible we might not reach peak CO2 emissions until around 2050.",
            "title_similarity": "0.5375805",
            "sentiment_compound": 0.5149
        },
        {
            "id": "h7ualna",
            "score": 1,
            "text": "People taste like pork, right? Gonna need to stock up on dry rubs...",
            "title_similarity": "0.36489943",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h7uam3l",
            "score": 1,
            "text": "Politicians haven't listened to climate science up to this point, why would they listen now?",
            "title_similarity": "0.4783358",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7uao90",
            "score": 4,
            "text": "We need to degrow. Live frugally. We need to get to a similar level to that on the 70-80s in terms of energy and resources consumption",
            "title_similarity": "0.37338105",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h7uardm",
            "score": 1,
            "text": "God damn.  I just want some good news.  I know you cannot deny science and the facts but man. I just want something to look forward to.",
            "title_similarity": "0.34863082",
            "sentiment_compound": 0.4153
        },
        {
            "id": "h7ub292",
            "score": 1,
            "text": "Serious question, given the gulf stream moves warmer water from the US east coast towards europe, does that mean the US east coast gets warmer if the gulf stream shuts down?  I.e. will Maine be warmer some day because of this? Or maybe Maine currently benefits from the gulf stream? I dunno",
            "title_similarity": "0.55433035",
            "sentiment_compound": 0.8146
        },
        {
            "id": "h7ubd86",
            "score": 1,
            "text": "This is actually kind of terrifying.",
            "title_similarity": "0.3339835",
            "sentiment_compound": -0.6115
        },
        {
            "id": "h7uc0b8",
            "score": 1,
            "text": "I’m in Britain, the brutal winters scare me about half as much as the onslaught of moaning about the cold weather I’m going to endure.",
            "title_similarity": "0.55833286",
            "sentiment_compound": -0.8271
        },
        {
            "id": "h7uc4ob",
            "score": 1,
            "text": ">It is not known what level of CO2 would trigger an AMOC collapse\n\nso everyone panic?",
            "title_similarity": "0.58851445",
            "sentiment_compound": -0.7769
        },
        {
            "id": "h7uc9dm",
            "score": 3,
            "text": "2021 is going to be the last gasp after 2020 gave the clearest warning to change course ASAP.\n\nIt's deserved after such fecklessness.",
            "title_similarity": "0.53870064",
            "sentiment_compound": -0.34
        },
        {
            "id": "h7ucdca",
            "score": 4,
            "text": "We’re all doomed and no one cares!",
            "title_similarity": "0.288742",
            "sentiment_compound": -0.847
        },
        {
            "id": "h7ucj4s",
            "score": 1,
            "text": "Afaik this is a process that takes quite a long time. I don't think we are gonna see many changes during our life time. I'm not denying the seriousness of this, but panic won't help.",
            "title_similarity": "0.39232764",
            "sentiment_compound": -0.7747
        },
        {
            "id": "h7ucn6t",
            "score": 1,
            "text": "Good who needs private jets anyways.",
            "title_similarity": "0.21057844",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7ud3bj",
            "score": 8,
            "text": "Good thing we are doing so much to mitiga—oh wait. Fml",
            "title_similarity": "0.3354606",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7ud9bb",
            "score": 1,
            "text": "There's a bunch of people on this thread that don't know what the piss they are talking about.",
            "title_similarity": "0.3125754",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h7ud9gp",
            "score": 1,
            "text": "I spoke with a few people who were worried about UK summers getting too hot esp since most of us don't have any kind of AC so being called wimps over a heatwave isn't fair when you can't escape it at all. The Gulf stream changing would mean our summers could end up cooler instead. Cold winters will definitely need help with as most the uk comes to halt with 1inch of snow",
            "title_similarity": "0.53029937",
            "sentiment_compound": -0.139
        },
        {
            "id": "h7udokr",
            "score": 1,
            "text": "Europe about to get a lot colder…some areas will probably benefit of course but I think I would hate to live in the UK right about now.",
            "title_similarity": "0.53459984",
            "sentiment_compound": -0.6187
        },
        {
            "id": "h7udru5",
            "score": 1,
            "text": "Anyone got a TLDR of how long until things go bad for UK?",
            "title_similarity": "0.57910824",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h7udug9",
            "score": 1,
            "text": "Can you /r/explainlikeimfive",
            "title_similarity": "0.28391975",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7udxjr",
            "score": 1,
            "text": "If this collapsed would that mean more hot water would sit at the equator causing even stronger storms?",
            "title_similarity": "0.5979773",
            "sentiment_compound": 0.128
        },
        {
            "id": "h7udzkg",
            "score": 5,
            "text": "Yeah but it doesn’t matter. Scientists aren’t listened to. In today’s economy money talks. Even if the meeting is held in a room being flooded, politicians laugh at scientists and change nothing.",
            "title_similarity": "0.371325",
            "sentiment_compound": 0.7684
        },
        {
            "id": "h7ue64c",
            "score": 1,
            "text": "Perfect to counter climate change !",
            "title_similarity": "0.6039352",
            "sentiment_compound": 0.6114
        },
        {
            "id": "h7uep4o",
            "score": 1,
            "text": "Can anyone please chime in about how this will affect South East Asia? Places like Malaysia(where I am), Indonesia and Thailand",
            "title_similarity": "0.49753004",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h7uf3fr",
            "score": 2,
            "text": "Glasgow, Scotland is the same Latitude as Moscow, the gulf stream keeps it temperate, there's even palm trees in the Victorian Arboretum there",
            "title_similarity": "0.23543704",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7ufdp9",
            "score": 1,
            "text": "As things get worse it will be important to keep track of climate change deniers, and continually remind everyone else that they never took it seriously and actively caught any attempt to mitigate climate change. This will be important because these same people will no doubt still fight doing anything about climate change bit will attempt to weasel their way out of their previously stated position because they will realize they have lost all credibility. Their opinion on the subject should always be suspect as they will likely always put their narrow self interest above that of all life on earth.",
            "title_similarity": "0.54565156",
            "sentiment_compound": -0.1955
        },
        {
            "id": "h7ufg1w",
            "score": 1,
            "text": "Forgive my ignorance but, here in central Europe, last few winters have been pretty mild. Doesent the rising global temprature offset the gulf stream collapse? As i recall, the gulf stream warms europe \"just\" by a few degrees. Thanks for anyone shining a bit of light on this for me :)",
            "title_similarity": "0.50254285",
            "sentiment_compound": 0.8834
        },
        {
            "id": "h7ufh13",
            "score": 1,
            "text": "We need direct carbon capture at mass",
            "title_similarity": "0.4176291",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7ufhi2",
            "score": 1,
            "text": "So this is based of my knowledge from when I used to live in Florida:\n\nDoes this also mean Florida is going to get extra fucked in hurricane season? From what I remember the gulf stream acted like a \"shield\" that deflects hurricanes and I imagine it collapsing means more of them going for direct hits in the future.",
            "title_similarity": "0.686532",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h7ufiba",
            "score": 1,
            "text": "This is literally my worst fear",
            "title_similarity": "0.44086948",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h7ufklx",
            "score": 3,
            "text": "\"Gulf Stream collapse\" is really misleading here. The Gulf Stream is partially wind-driven, and those winds will always be present, even though their strength can change (they're caused by the rotation of the Earth and by the energy balance between the equator and the poles). So, short of changing Earth's orbital configuration/rotation or continent positions, the Gulf Stream will always be present. What we're really talking about here is a DECREASE in the strength of the Gulf Stream, not a total collapse.",
            "title_similarity": "0.5950155",
            "sentiment_compound": 0.6312
        },
        {
            "id": "h7ufnx9",
            "score": 1,
            "text": "It would be great if news sources would start putting articles out about what people can do, instead of how we’re all gonna die.\n\nThese just stress people out and we neee to start focusing on the solution, not the problem.",
            "title_similarity": "0.51795685",
            "sentiment_compound": 0.2401
        },
        {
            "id": "h7ug4k2",
            "score": 1,
            "text": "Fresh water slows it down. Melting Greenland is major contributor, from what I recall. Wonder how it will effect central Canada.",
            "title_similarity": "0.58902127",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h7ug67n",
            "score": 1,
            "text": "G  ex eueetasaseaassas  as",
            "title_similarity": "0.1808885",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7ugiix",
            "score": 1,
            "text": "I am just waiting for earths constant never ending hurricane sort of like Jupiter.",
            "title_similarity": "0.46732688",
            "sentiment_compound": 0.2975
        },
        {
            "id": "h7ugkkz",
            "score": 5,
            "text": "Looks like Texas' incredible power grid will be put to the test again...and again...and again",
            "title_similarity": "0.4764378",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h7ugvy9",
            "score": 1,
            "text": "If this does not scare people, they are not paying attention.  Will we still have wind?",
            "title_similarity": "0.3587954",
            "sentiment_compound": 0.3875
        },
        {
            "id": "h7ugyu2",
            "score": 1,
            "text": "Everyday we read these headlines and every day nothing will be done. At this point it’s just added stress to an already stressful life.",
            "title_similarity": "0.3592914",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h7uh4iq",
            "score": 1,
            "text": "Soon.... The world! Sad.  When it does... It will be TOO LATE to stop it.  Sad.",
            "title_similarity": "0.5097513",
            "sentiment_compound": -0.8268
        },
        {
            "id": "h7uh5oc",
            "score": 1,
            "text": "Oooh, that would be bad for Great Britain, Ireland, and Iceland.",
            "title_similarity": "0.515134",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h7uh5py",
            "score": 1,
            "text": "With all of the recent floods across Europe there aren't many changes,I don't think the collapse of the Gulf stream will provoke change either",
            "title_similarity": "0.39950445",
            "sentiment_compound": -0.0186
        },
        {
            "id": "h7uhtd8",
            "score": 1,
            "text": "We are doomed…it’s all so scary to me and it feels like the world leaders hardly do a thing to change our fate",
            "title_similarity": "0.47870797",
            "sentiment_compound": -0.3851
        },
        {
            "id": "h7uhxdn",
            "score": 2,
            "text": "If we don’t find a way to remove the carbon dioxide we already created we are fucked.\nit will take decades for all the carbon dioxide to be removed naturally so temperature is likely to rise for a lot of time even if we stop. This early warning isn’t really a warning, cause destruction of the AMOC is already inevitable",
            "title_similarity": "0.5731566",
            "sentiment_compound": -0.9243
        },
        {
            "id": "h7uiafm",
            "score": 3,
            "text": "Someone get Jake Gyllenhaal and Dennis Quaid.",
            "title_similarity": "0.27837452",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7uie38",
            "score": 1,
            "text": "Damn that sucks. I hope it’s 100+ years away.",
            "title_similarity": "0.398563",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h7uio8r",
            "score": 1,
            "text": "Every subreddit's becoming r/collapse and I'm afraid",
            "title_similarity": "0.48466903",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7uipef",
            "score": 2,
            "text": "Seriously? Mankind is doomed.",
            "title_similarity": "0.47672012",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h7uj7l9",
            "score": 3,
            "text": ">Climate crisis: Scientists spot warning signs of Gulf Stream collapse\n\nGreenland is hot this year and the highest meltwater ever seen.  The flood of freshwater into this part of the conveyer belt has been slowing Gulfstream for decades.  \n\nThis summer's heat wave may do the trick.",
            "title_similarity": "0.6998681",
            "sentiment_compound": -0.872
        },
        {
            "id": "h7ujcg9",
            "score": 1,
            "text": "\\*existential dread screaming intensifies\\*",
            "title_similarity": "0.48637336",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h7ujjww",
            "score": 1,
            "text": "It seems like so many of our natural systems are being taxed to the point of collapse. The scary part for me is that we may already be well past the tipping point.\n\nAnyone starting to feel like we're living out the beginning of Interstellar?\n\n*Laughs nervously*",
            "title_similarity": "0.6225935",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h7ujyjq",
            "score": 1,
            "text": "So do you think radical action will be taken, or do you think the people who are capable of making change will just sit and watch?",
            "title_similarity": "0.4605157",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h7uk2pe",
            "score": 1,
            "text": "Well,  good luck with your insane winters incoming, northern Europe. \n\nEnjoy your 8 months of winter.",
            "title_similarity": "0.41906333",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h7ukbnm",
            "score": 1,
            "text": "It is already too late to stop this and climate change in general, it's going to happen, the only thing humans can do is change their ways and hopefully the earth will recover eventually",
            "title_similarity": "0.58280206",
            "sentiment_compound": 0.128
        },
        {
            "id": "h7uknly",
            "score": 1,
            "text": "Is there a corollary in the Pacific to the gulf stream?",
            "title_similarity": "0.5500054",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7ul11b",
            "score": 1,
            "text": "Collapse **to a lower mode of transportation, from the current higher mode**.\n\nThis doesn't say total collapse.",
            "title_similarity": "0.37573904",
            "sentiment_compound": -0.3726
        },
        {
            "id": "h7ulzcs",
            "score": 5,
            "text": "Oh wait is something happening to the climate? It probably doesn't have anything to do with the oceans and land being on fire and us dumping oil all over the place?",
            "title_similarity": "0.58159035",
            "sentiment_compound": -0.6199
        },
        {
            "id": "h7um4mh",
            "score": 2,
            "text": "There’s no stopping it at this point, and on top of that we can’t even get Washington to agree on money to help people in need. Our best bet is developing infrastructure that can survive climate change.",
            "title_similarity": "0.57137793",
            "sentiment_compound": 0.892
        },
        {
            "id": "h7umau6",
            "score": 1,
            "text": "Wow, would be nice if they actually published the data in additiiin to their narritive. This is HuffPost quality integrity that we have here.",
            "title_similarity": "0.35322428",
            "sentiment_compound": 0.8481
        },
        {
            "id": "h7umggj",
            "score": 1,
            "text": "It’s all cascading now. This hammered down the final nail in the having kids coffin for me.",
            "title_similarity": "0.4213559",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7umr8v",
            "score": 1,
            "text": "Well I love in Iceland so I guess Im fucked.",
            "title_similarity": "0.31925684",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h7un7yf",
            "score": 1,
            "text": "Thank you for sharing this!",
            "title_similarity": "0.11570727",
            "sentiment_compound": 0.68
        },
        {
            "id": "h7uniy3",
            "score": 1,
            "text": "Thank you for informing me our system doesn’t work anymore, I’m glad the ocean is figuring out new more efficient methods of distributing its flow in order to meet humanity’s need although still moving towards renewables and less polluted energy sources is a must especially over the next 5 years.",
            "title_similarity": "0.4930451",
            "sentiment_compound": 0.7722
        },
        {
            "id": "h7uocmd",
            "score": 1,
            "text": "what indicates the likelihood of collapse?",
            "title_similarity": "0.51895446",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h7uonra",
            "score": 2,
            "text": "There will be a massive global oceanic die-off - which in turn will greatly destabilize, well, everything. \n\nThis could end humanity and we are witnesses to it - it is likely going to happen. We are past the tipping point.\n\nGlobal scientists make these decade(s) off pronouncements and they are mostly ignored. I remember when Global Superstoms was bandied about. They predicted storms that would carry across the US - and a decade later, here we are.\n\nThey warned that if we continue down this path, the oceanic circulatory system could shut down - and now we are seeing it. \n\nWe are literally killing ourselves.",
            "title_similarity": "0.77723974",
            "sentiment_compound": -0.7522
        },
        {
            "id": "h7upbxg",
            "score": 1,
            "text": "Honestly, I kinda hope the world leaders learn a lesson soon. I fear it's something on the magnitude of this or even larger that will be required.",
            "title_similarity": "0.4510485",
            "sentiment_compound": 0.3415
        },
        {
            "id": "h7upfhk",
            "score": 1,
            "text": "I sailed up the gulf stream from Ft. Lauderdale to the Chesapeake Bay several years ago. Made great time with that push! It was fun doing 10-15 knots consistently.",
            "title_similarity": "0.3689226",
            "sentiment_compound": 0.8268
        },
        {
            "id": "h7upiof",
            "score": 1,
            "text": "Great. May as well just drink myself fo death",
            "title_similarity": "0.41466975",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h7upy5s",
            "score": 1,
            "text": "Would the colder weather from this be offset by the warming of the planet in general?  Like… which wins, warming or cooling?\n\nCould this actually be beneficial to offset the warming trend in some areas?",
            "title_similarity": "0.54157937",
            "sentiment_compound": 0.8732
        },
        {
            "id": "h7uqeb5",
            "score": 2,
            "text": "Yeah, living in Scandinavia, this is my biggest fear",
            "title_similarity": "0.45570618",
            "sentiment_compound": -0.25
        },
        {
            "id": "h7ur193",
            "score": 1,
            "text": "I sometimes wonder, if this hasn't happened to civilizations in the past (them causing their own collapse). Yeah, I know it's a silly idea.",
            "title_similarity": "0.56732213",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h7ura26",
            "score": 1,
            "text": "So... where in the US would be good place to move to?\n\nGotta beat the rush.",
            "title_similarity": "0.42393297",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7urkxj",
            "score": 1,
            "text": "Time to start treating climate change like the global crisis that it is. Small, incremental changes won’t cut it. We need large-scale coordinated change on every level, not only to decarbonize the economy, but also to mitigate the coming changes that are unavoidable.",
            "title_similarity": "0.63839865",
            "sentiment_compound": -0.3291
        },
        {
            "id": "h7urmsb",
            "score": 1,
            "text": "Damn\n\n*has to go to work everyday and use massive amounts of energy or I’ll die* \n\nThe only solution is to all become Amish, and I think it is time. Join me brothers.",
            "title_similarity": "0.36267433",
            "sentiment_compound": -0.25
        },
        {
            "id": "h7urn1q",
            "score": 31,
            "text": "I really want to help. how can i help :(",
            "title_similarity": "0.21035334",
            "sentiment_compound": 0.5198
        },
        {
            "id": "h7urtau",
            "score": 1,
            "text": "Everyone's willing to blame everyone else about this, but never themselves. Use of plastic, overconsumption of meat, pollution, etc. The average person makes multiple decisions a day that destroy our planet and few that benefit it.",
            "title_similarity": "0.42724615",
            "sentiment_compound": -0.3506
        },
        {
            "id": "h7us861",
            "score": 1,
            "text": "“UK will get colder winters” … the entire worlds climate will be affected (collapse/flip) bigtime by this.",
            "title_similarity": "0.6344726",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h7usdxc",
            "score": 1,
            "text": "Can someone ELI5 how a water current collapses? What’s the mechanism behind that?",
            "title_similarity": "0.6300243",
            "sentiment_compound": -0.3736
        },
        {
            "id": "h7usngt",
            "score": 1,
            "text": "Has anyone tried refreshing the stream?",
            "title_similarity": "0.25443774",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7ust7c",
            "score": 1,
            "text": "I dunno.  They seem kinda biased.  Anyone know a good place on Facebook or YouTube to get real information from?",
            "title_similarity": "0.31384102",
            "sentiment_compound": 0.2716
        },
        {
            "id": "h7utlnj",
            "score": 1,
            "text": "On today’s episode of how fucked we are",
            "title_similarity": "0.43551242",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h7utmvh",
            "score": 1,
            "text": "We love living in Buffalo. We're not immune from climate impacts but greatly insulated. Very good beer AND wine scene to boot!",
            "title_similarity": "0.3592241",
            "sentiment_compound": 0.7983
        },
        {
            "id": "h7utpac",
            "score": 1,
            "text": "Well what are we expected to do about it?",
            "title_similarity": "0.28512162",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h7uu451",
            "score": 1,
            "text": "Do we know what it will become?",
            "title_similarity": "0.23834941",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7uujk4",
            "score": 1,
            "text": "Gulf Stream collapse? Yeah...that's not good...",
            "title_similarity": "0.5877036",
            "sentiment_compound": -0.6814
        },
        {
            "id": "h7uuyoe",
            "score": 1,
            "text": "People need to take this serious.  Put politics aside!",
            "title_similarity": "0.3783357",
            "sentiment_compound": -0.1697
        },
        {
            "id": "h7uv6n3",
            "score": 1,
            "text": "So we're starting the Frostpunk timeline? Oof",
            "title_similarity": "0.40933508",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7uvk58",
            "score": 2,
            "text": "with all this news coming out, at this point i'm just looking forward to dying",
            "title_similarity": "0.34432623",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7uvsae",
            "score": 3,
            "text": "We have had the ability to remove carbon from the atmosphere on a massive scale since the 1980s. The technology was developed and suppressed. The one reason I can see for this is that certain groups are using the climate crisis as a way to massively decrease the population through the collapse of the food chain, reduced fertility, and temperature induced fatalities. This will affect poorer countries the hardest. Only once society reaches the edge of complete collapse, and they have profited will they use these \"new\" technologies to start repairing the planet. This is similar to selling the cure for a disease that you yourself created. They most likely see this as nothing more than a money making venture. I hope their greed doesn't push things too far, or make them wait too long...  The best thing we can do is contact our representatives in the United States to declassify the technology so it can be used.",
            "title_similarity": "0.6710011",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h7uvx8j",
            "score": 2,
            "text": "This is gonna be a fun lifetime/s",
            "title_similarity": "0.1810019",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h7uweqb",
            "score": 1,
            "text": "In 20-25 years, humanity will suffer more than we can possibly imagine. The water & food supply will be interrupted at a catastrophic level. Millions, possibly billions will die.",
            "title_similarity": "0.5809082",
            "sentiment_compound": -0.9153
        },
        {
            "id": "h7ux95n",
            "score": 1,
            "text": "Somebody call Dennis Quaid :/",
            "title_similarity": "0.24257329",
            "sentiment_compound": -0.34
        },
        {
            "id": "h7uxhr6",
            "score": 3,
            "text": "Aaaaand, nothing is done by corporations to fix the problem.",
            "title_similarity": "0.29345858",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h7uxrzk",
            "score": 1,
            "text": "Are we royally screwed?",
            "title_similarity": "0.3699151",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h7uxs0c",
            "score": 1,
            "text": "Omg this is terrifying. The house is on fire",
            "title_similarity": "0.4448902",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h7uz3qe",
            "score": 1,
            "text": "Gonna go ahead and click hide on this little nugget of joy thanks",
            "title_similarity": "0.24794811",
            "sentiment_compound": 0.6943
        },
        {
            "id": "h7uzavm",
            "score": 2,
            "text": "Climate catastrophe is going arrive a lot faster than everyone expects and it will be brutal. Prepare for your families now, don't wait.",
            "title_similarity": "0.5983577",
            "sentiment_compound": -0.8591
        },
        {
            "id": "h7uzitt",
            "score": 1,
            "text": "This was predicted quite a while ago.",
            "title_similarity": "0.27449697",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7uzmwg",
            "score": 1,
            "text": "First ever year of my life when summer was actually warm you call it a crisis? Lame.",
            "title_similarity": "0.28399456",
            "sentiment_compound": -0.7184
        },
        {
            "id": "h7uznsr",
            "score": 2,
            "text": "Oh wow I was already a nervous wreck today. Now I’m even more of a nervous wreck",
            "title_similarity": "0.3451091",
            "sentiment_compound": -0.6666
        },
        {
            "id": "h7uzodl",
            "score": 2,
            "text": "Politicians: Who knew this would happen!!\n\nScientists: We’ve been warning you for decades.\n\nOur leaders and the wealthy who have the power to make change will continue ignoring the problem while building themselves places they think they’ll be able to escape to.",
            "title_similarity": "0.54374665",
            "sentiment_compound": -0.6351
        },
        {
            "id": "h7v02qz",
            "score": 1,
            "text": "On a scale of 1-10 how bad is this",
            "title_similarity": "0.40705478",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h7v0x20",
            "score": 1,
            "text": "Yea unfortunately no one cares...this article should say \"Gulf stream will collapse soon\"..because no one cares enough to stop it or try to",
            "title_similarity": "0.48317748",
            "sentiment_compound": -0.9132
        },
        {
            "id": "h7v1008",
            "score": 1,
            "text": "As an fyi for anyone that reads this. Its significantly rained twice in the Canadian prairies over the last 3 months. Combined with hardly any snow all winter, this is the most significant drought of all time in this location. The sky has been filled with forest fire smoke here everyday for the past month even when the fires are a province or 2 away. The climate collapse is here and is the new way of life, we live with it just as we did with covid after it was released upon us. It has become clear that humanity has no hope of banding together as long as the marxist media keeps us all scared at the will of the corporations that fund them and all levels of government. China's creation and release of the covid19 bioweapon worked exactly as they planned, with absolutely no pushback against their country whatsoever. We've proven that facts no longer serve any weight in the direction of humanity as long as a corporation is able to control media and government. They can and will now control the population to any level they please as humanity clearly will not be providing any other solution to the climate collapse.",
            "title_similarity": "0.46500248",
            "sentiment_compound": -0.6002
        },
        {
            "id": "h7v1210",
            "score": 1,
            "text": "Does anyone else feel we're really on the cusp of some sort of natural disaster that's really going to kick climate chaos into gear?",
            "title_similarity": "0.8062322",
            "sentiment_compound": -0.7837
        },
        {
            "id": "h7v14av",
            "score": 1,
            "text": "Just a genuine question. I'm no climate science expert even though I do some work with climate change. If/when this occurs, how would this interact with raising global temperatures. What I mean is, if the North Atlantic would be getting significantly colder winters how would that interact with the rise in global temperatures. Would there be any sort of cancellation effect going on? Or would it mean really hot summers and really cold winters?\n\nThanks for any clarification.",
            "title_similarity": "0.6101817",
            "sentiment_compound": 0.3234
        },
        {
            "id": "h7v1yhd",
            "score": 1,
            "text": "Here we go. People thought COVID was bad... pfft",
            "title_similarity": "0.47893053",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h7v21jh",
            "score": 1,
            "text": "What would happen if Gulf stream collapses?\n\nEdit: nevermind, I'm stupid today, should have read the article...",
            "title_similarity": "0.6460128",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h7v23nx",
            "score": 1,
            "text": "How are we doing with planting trees and not eating more animals? Those are the two most significant things we humans can do to help prevent a climate disaster.",
            "title_similarity": "0.5031801",
            "sentiment_compound": -0.0534
        },
        {
            "id": "h7v27b0",
            "score": 1,
            "text": "tie it to money and you may scare politicians into acting, IE tell them that it will stop fish coming into THEIR waters and they will act.",
            "title_similarity": "0.55209017",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h7v2de8",
            "score": 2,
            "text": "You know how you can stop the climate crisis? Stop China & India because those two countries are the biggest polluters of the world.",
            "title_similarity": "0.612706",
            "sentiment_compound": -0.8885
        },
        {
            "id": "h7v2hvb",
            "score": 1,
            "text": "Wel this bodes well for my nomination for ‘news story that everyone who could affect (effect?) change will ignore’ of 2021",
            "title_similarity": "0.54762447",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h7v31dc",
            "score": 1,
            "text": "It will collapse, the oceans will recede back turning the Atlantic Ocean into 2 large salt rivers. With a large island between. The poles are re positioning. When its over the new North Pole will be in Southeast Siberia, the South Pole is moving opposite position. The equator will adjust as well. It happens around every 12,000 years. The poles move. In 10 years most of Russia, all of Korea, Mongolia, and 2/3s of China will become uninhabitable. Western Europe will become like Northern Africa weather wise. Eastern Europe will become like the norther US, and Canada. The Us will end up just above the new equator. Some people have been knowing this for some time. The change will happen over the next 300 days, or it could stretch slowly through the next 300 years. Regardless it’s been confirmed that the poles are moving, and the earth is changing as a result. The climates will change over the entire planet starting just under 1 year ago. Just remember when you watch it happen that you read it first from a wacko on Reddit.",
            "title_similarity": "0.6386798",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h7v3etl",
            "score": 3,
            "text": "We can’t even get people to believe a virus that has killed millions that it’s real on a much shorter timeline. Even some that do downplay it as nothing more than a mild flu. Then there’s people who refuse to wear masks even when people in their communities are dying. These same types will barely be treading water when sea levels rise and still deny science all while complaining that nobody warned them.",
            "title_similarity": "0.48618406",
            "sentiment_compound": -0.9274
        },
        {
            "id": "h7v3qhs",
            "score": 1,
            "text": "Yay all the fish gun die",
            "title_similarity": "0.36543205",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h7v48t8",
            "score": 1,
            "text": "I can't cope with the anxiety recent climate news is giving me. Nothing I do will have a meaningful impact on it. At least I can avoid Covid and stay safe. The climate emergency gives me near on panic attacks because we all know, we are not going to resolve it. By the time the world is doing anything meaningful about it, it will be far too late.",
            "title_similarity": "0.58586955",
            "sentiment_compound": -0.6103
        },
        {
            "id": "h7v49dw",
            "score": 2,
            "text": "Won’t another current eventually pop up if this one collapses? Obviously not in the same place, but I can’t imagine climate change will lead to the oceans being stagnant bowls of water. If anything, wouldn’t warmer temperatures cause more movement? Not to downplay the severity of this of course, just trying to get the full picture.",
            "title_similarity": "0.6256397",
            "sentiment_compound": 0.3736
        },
        {
            "id": "h7v4gn3",
            "score": 11,
            "text": "I think most influential people who can do something about this issue are asking themselves: What is the ROI on addressing this issue today for benefits that won't be realized until tomorrow? \n\nWe're fucked.",
            "title_similarity": "0.50857323",
            "sentiment_compound": 0.101
        },
        {
            "id": "h7v4s4d",
            "score": 1,
            "text": "Sim City 2000 with disasters turned allllll the way up!",
            "title_similarity": "0.5304745",
            "sentiment_compound": -0.5983
        },
        {
            "id": "h7v52k3",
            "score": 1,
            "text": "Yissss. Ice age outcome it is bois! \\*breaks out xc skiis happily\\*",
            "title_similarity": "0.36881518",
            "sentiment_compound": 0.5983
        },
        {
            "id": "h7v54jd",
            "score": 1,
            "text": "When will America start a war on climate change?",
            "title_similarity": "0.67458814",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h7v5fcx",
            "score": 2,
            "text": "And this is why I don't see a point in trying to hustle and grind for a better life. Worlds got like 5-10 years why bother",
            "title_similarity": "0.41966176",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h7v5uhh",
            "score": 4,
            "text": "Good.  Maybe this will give the human race the slap in the face it needs to wake up and start working on the problem.",
            "title_similarity": "0.48043406",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h7v5zcv",
            "score": 1,
            "text": "It has been demonstrated that the ocean heat transport plays a limited role in determining regional climates around the Atlantic Ocean \n\n[https://ocp.ldeo.columbia.edu/res/div/ocp/gs/pubs/Seager\\_etal\\_QJ\\_2002.pdf](https://ocp.ldeo.columbia.edu/res/div/ocp/gs/pubs/Seager_etal_QJ_2002.pdf)\n\nSomeone must be seeking grant funds...",
            "title_similarity": "0.5656878",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h7v601u",
            "score": 1,
            "text": "I would like to read one of these reports without all the \"could\" maybe\" we don't know but we are concerned!!! Well I am glad they are concerned, As concerned as when they were saying the jets were moving the jet stream?",
            "title_similarity": "0.53505576",
            "sentiment_compound": 0.851
        },
        {
            "id": "h7v60o0",
            "score": 2,
            "text": "Looks like more news I can do nothing about!!",
            "title_similarity": "0.27946734",
            "sentiment_compound": 0.4738
        },
        {
            "id": "h7v74gv",
            "score": 2,
            "text": "Don't have kids, fellow Redditors",
            "title_similarity": "0.25889558",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7v74mv",
            "score": 1,
            "text": "Wow, we’ve really fucked it all up, haven’t we?!",
            "title_similarity": "0.4108765",
            "sentiment_compound": -0.2926
        },
        {
            "id": "h7v7asg",
            "score": 1,
            "text": "If we don't fix this we're fucked, permanently.",
            "title_similarity": "0.4877907",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h7v7f7f",
            "score": 1,
            "text": "The agricultural industry across Europe will completely collapse as summer temperature highs will be the same as similar latitudes in Labrador in Canada. Basically very little will grow in that colder climate.",
            "title_similarity": "0.48280203",
            "sentiment_compound": -0.5413
        },
        {
            "id": "h7v81ac",
            "score": 1,
            "text": "Oh great. I'll make sure to add this to my anxiety to-go list as well!",
            "title_similarity": "0.40535235",
            "sentiment_compound": 0.7959
        },
        {
            "id": "h7v87gb",
            "score": 1,
            "text": "This may be a dumb question, but how does Climate Change divert or weaken currents?",
            "title_similarity": "0.67018515",
            "sentiment_compound": -0.705
        },
        {
            "id": "h7v8ufl",
            "score": 1,
            "text": "Will this in turn lead to significant changes in the Jet stream too?",
            "title_similarity": "0.5187081",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h7v9fnf",
            "score": 1,
            "text": "[/collapse](www.reddit.com/collapse)",
            "title_similarity": "0.524656",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7v9qv2",
            "score": 2,
            "text": "No way, why so many things happening with our nature? Hope we will use our adaptation skill soon.",
            "title_similarity": "0.3760873",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h7va1yg",
            "score": 1,
            "text": "This would make my homeland essentially uninhabitable.",
            "title_similarity": "0.33009",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7va8q8",
            "score": 1,
            "text": "Yep, we’re screwed but, hey, at least I got a Tesla for the apocalypse.",
            "title_similarity": "0.57806635",
            "sentiment_compound": -0.128
        },
        {
            "id": "h7vaec1",
            "score": 1,
            "text": "This article is from The Guardian. Does anyone know what that means or considered to take it with a huge grain of salt?",
            "title_similarity": "0.49521077",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h7vam1c",
            "score": 1,
            "text": "James Burke called this in the 90s with his special about Global Warming. By the point we will know the Gulf Stream is in danger, it will be too late to fix it.  Goodbye summers in UK.  Too bad we had over 20 years to do something about it and just spent the time making the rich richer.",
            "title_similarity": "0.63907766",
            "sentiment_compound": 0.5267
        },
        {
            "id": "h7vao9f",
            "score": 1,
            "text": "I think this is one of many things to come faster than people can figure out how to wear a mask correctly.  And will be completely blindsided by it",
            "title_similarity": "0.4022525",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7vaqvv",
            "score": 1,
            "text": "How is this not all over the news?",
            "title_similarity": "0.34756732",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7vawjx",
            "score": 1,
            "text": "And here I thought getting fucked was supposed to be a good idea.",
            "title_similarity": "0.39979655",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h7vawmn",
            "score": 1,
            "text": "It's  really interesting having learned about the potential of this to occur in high school and my undergrad and now seeing it showing advancing signs so soon after.",
            "title_similarity": "0.3639753",
            "sentiment_compound": 0.4576
        },
        {
            "id": "h7vbswt",
            "score": 1,
            "text": "Please don't destroy me I drive an EV, have solar panels, and use geothermal heating and cooling.\n\nFrom the article: \"The complexity of the AMOC system and uncertainty over levels of future global heating make it impossible to forecast the date of any collapse for now.\"\n\nIs it possible this stream just changes over time? Slowing, speeding, even reversing?",
            "title_similarity": "0.5874877",
            "sentiment_compound": -0.2047
        },
        {
            "id": "h7vdlmh",
            "score": 1,
            "text": "Just ignore the counter evidence...",
            "title_similarity": "0.3061836",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h7veccx",
            "score": 1,
            "text": "Another sign of the ocean's deteriorating health that will amount to no mitigation measures from the ruling elite that have the power to stop this from getting worse.",
            "title_similarity": "0.55252737",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h7vevzc",
            "score": 1,
            "text": "I saw this movie. Jake Gyllenhaal gets stuck in a library with angry cold chasing him. There's also a oil tanker that drifts onto land.",
            "title_similarity": "0.4392075",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h7vf1ms",
            "score": 2,
            "text": "Essentially we fucked. Not as if we weren't before but now it's actual, observable penetration, not hypothetical, de niable intercourse...",
            "title_similarity": "0.36914593",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h7vfft7",
            "score": 1,
            "text": "As an Australian, uh-oh.",
            "title_similarity": "0.16223046",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7vg510",
            "score": 1,
            "text": "I feel like I read this story last summer",
            "title_similarity": "0.21695367",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h7vgkc3",
            "score": 1,
            "text": "This is actually so bad",
            "title_similarity": "0.32770568",
            "sentiment_compound": -0.6696
        },
        {
            "id": "h7vgofs",
            "score": 2,
            "text": "Like watching yourself slowly die... guess we are the planets cancer.",
            "title_similarity": "0.46203995",
            "sentiment_compound": -0.7783
        },
        {
            "id": "h7vgokk",
            "score": 2,
            "text": "Nature's way to clean and reset some",
            "title_similarity": "0.33256167",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h7vhc5g",
            "score": 1,
            "text": "Pretty sure I saw that movie. It didn't end well",
            "title_similarity": "0.35471225",
            "sentiment_compound": 0.5699
        },
        {
            "id": "h7vhdoh",
            "score": 1,
            "text": "Newsflash, those of us who care don't have the ability to do anything about it.",
            "title_similarity": "0.2711969",
            "sentiment_compound": 0.3045
        },
        {
            "id": "h7vhfpu",
            "score": 2,
            "text": "FYI the biggest contributing factor is cooperations not the individual. They continue to ask everyone else to stop while casuing 80% of the pollution destroying the planet.",
            "title_similarity": "0.4858774",
            "sentiment_compound": -0.5052
        },
        {
            "id": "h7vi5f3",
            "score": 1,
            "text": "Tell republicans that the Gulf Stream will collapse and all the fisherman will be up in arms about the climate crises.",
            "title_similarity": "0.6903204",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h7vje59",
            "score": 1,
            "text": "Why do rains in India depend on the gulf stream?",
            "title_similarity": "0.5286351",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7vjr1c",
            "score": 1,
            "text": "It’s a question of price.  At a price we can lower carbon dioxide in the atmosphere.  Here’s a Swiss company that makes a CO2 capture system and they use the carbon for plants in greenhouses.  If you want to pay the price you can massively scale it up and lower CO2.  But at what price wil we invest in this technology?\n\nhttps://www.climatecentral.org/news/first-commercial-co2-capture-plant-live-21494#:~:text=The%20Climeworks%20direct%20carbon%20capture%20plant%20in%20Switzerland,long-term%20buildup%20of%20greenhouse%20gases%20in%20the%20atmosphere.[CO2 Capture](https://www.climatecentral.org/news/first-commercial-co2-capture-plant-live-21494#:~:text=The%20Climeworks%20direct%20carbon%20capture%20plant%20in%20Switzerland,long-term%20buildup%20of%20greenhouse%20gases%20in%20the%20atmosphere.)",
            "title_similarity": "0.52445614",
            "sentiment_compound": -0.3071
        },
        {
            "id": "h7vk1k8",
            "score": 1,
            "text": "I'm from Nova Scotia and part of the reason I relocated to coastal BC, was so my kids and grandkids have a chance to weather the future wrath of climate change.\n\nIn 250-500 years there's a very good chance that there will only be (the former) mountainous regions left above water.",
            "title_similarity": "0.58201414",
            "sentiment_compound": 0.7559
        },
        {
            "id": "h7vl4ja",
            "score": 1,
            "text": "How soon will we be in danger?",
            "title_similarity": "0.3876562",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h7vlf0t",
            "score": 1,
            "text": "I've stopped reading articles like this. There is nothing o can do about it, and those in power  have shown no actual real interest in resolving this issue, many even prefer to act as if the past 2000 years of science never happened and prefer arguing over things proven 2000 years ago instead.\n\nBut I'm done with it. If the world burns down, it will burn down. I just no longer want to be confronted with it, i can't take it anymore.",
            "title_similarity": "0.4301462",
            "sentiment_compound": -0.5904
        },
        {
            "id": "h7vlfed",
            "score": 1,
            "text": "This is a real danger. If the oceanic circulation shuts down, things are going to go from bad to worse real fast.",
            "title_similarity": "0.6954006",
            "sentiment_compound": -0.875
        },
        {
            "id": "h7vnn4u",
            "score": 1,
            "text": "Big business can solve this. Step 1: Allow government contracts to incentivise a private company or companies to build large underwater fans. Step 2: Allow those companies to charge each of us to run those fans. Suck us dry. \n\nOh, wait!\n\nJust like they are doing with drinking water, air conditioning, flood control, yada, yada, yada. \n\nI hate what this planet has become, and the Earth will be much better off on a hundred years when we are gone. I'm sure I speak for the animals on this too.",
            "title_similarity": "0.57735217",
            "sentiment_compound": 0.6114
        },
        {
            "id": "h7vo25k",
            "score": 1,
            "text": "European ice age dead ahead.",
            "title_similarity": "0.41778132",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h7voeyi",
            "score": 1,
            "text": "I live in massachusetts and, at 45, was banking on getting at least to old before the next ice age, goddamit.",
            "title_similarity": "0.37888914",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7vojch",
            "score": 1,
            "text": "If the gulf stream collapses then the next ice age will begin. Oh noz",
            "title_similarity": "0.6941134",
            "sentiment_compound": -0.296
        },
        {
            "id": "h7vph5y",
            "score": 1,
            "text": "\"... the only thing to do is keep emissions as low as possible. The likelihood of this extremely high-impact event happening increases with every gram of CO2 that we put into the atmosphere”.",
            "title_similarity": "0.49113232",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h7vpi73",
            "score": 1,
            "text": "Yet another thing half the world will deny.",
            "title_similarity": "0.3120553",
            "sentiment_compound": -0.34
        },
        {
            "id": "h7vpo25",
            "score": 1,
            "text": "I hope it forces the world population to reduce to ~1 billion by year 2100.",
            "title_similarity": "0.53765607",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7vqbuu",
            "score": 1,
            "text": "So when should we start funding Vault-Tec?",
            "title_similarity": "0.36085117",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7vrdty",
            "score": 1,
            "text": "Ok so what are we actually going to do about this? I’m serious. There’s no way to stop it with so many corporations controlling things and idiots running the government. My reusable bags and all the work I’ve put into making a difference doesn’t matter. We are all going to experience suffering so very soon.",
            "title_similarity": "0.4829727",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h7vrj6b",
            "score": 1,
            "text": "I feel like I’m screaming into a void. This is all coming, there is so little any individual can do, and no one with any ability to make large, swift changes seems to care. AHHHHHHHHHHH! A virtual yell because I can’t scream in my apartment in the middle of the night",
            "title_similarity": "0.30180228",
            "sentiment_compound": 0.3802
        },
        {
            "id": "h7vs5x7",
            "score": 1,
            "text": "i‘m 30years old now. when i was a small kid, i‘ve learned about those scenarios back in school. now i‘m scared!",
            "title_similarity": "0.3738318",
            "sentiment_compound": -0.4926
        },
        {
            "id": "h7vslwh",
            "score": 1,
            "text": "Climate \"crisis\", amirite, Republicans?",
            "title_similarity": "0.52010095",
            "sentiment_compound": -0.6249
        },
        {
            "id": "h7vszhm",
            "score": 1,
            "text": "Does this have anything to do with the record breaking freeze we had here in Texas and the bizarre but much appreciated coolest and wettest summer i remember ever having?\n\nSeriously im in San Antonio and I think we've only had like 2 or 3 days close to 100deg F and its usually that hot from July until September.",
            "title_similarity": "0.45174497",
            "sentiment_compound": 0.7269
        },
        {
            "id": "h7vtgo0",
            "score": 2,
            "text": "Covid was treated like an actual crisis. Climate change is treated like a greenwashing fad. Humans are morons.",
            "title_similarity": "0.6603699",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h7vtls9",
            "score": 3,
            "text": "Best way to solve this is to inject everyone with Covid so the population decreases and then there will be less electric, water, materials consumed. Easy fix",
            "title_similarity": "0.46986696",
            "sentiment_compound": 0.836
        },
        {
            "id": "h7vtzoo",
            "score": 1,
            "text": "Translation: we're fucked",
            "title_similarity": "0.3292299",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h7vu105",
            "score": 1,
            "text": "The North Atlantic has had anomalies suggesting this for years.  If you are reading this; it’s too late.",
            "title_similarity": "0.47896448",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7vu3a4",
            "score": 1,
            "text": "And nothing will be done about it, unfortunately.",
            "title_similarity": "0.1738056",
            "sentiment_compound": -0.34
        },
        {
            "id": "h7vuer5",
            "score": 1,
            "text": "Headlines like this really make me want to give up what little hope I have left for my future.",
            "title_similarity": "0.46113542",
            "sentiment_compound": 0.6879
        },
        {
            "id": "h7vugv9",
            "score": 1,
            "text": "Well, which is it? Is Europe going to be hellishly hot from Global Warming or freezing cold from the death of the Gulf Stream?\n\nOr are they going to cancel out, and it'll just be perfect?",
            "title_similarity": "0.6818142",
            "sentiment_compound": 0.163
        },
        {
            "id": "h7vv2o6",
            "score": 1,
            "text": "I'm from East Asia. When I looked at the weather report of the world throughout this spring, I found that despite most of Asia has warmed significantly compared to 30-year average, the eastern half of North America seems to have cooled significantly instead. Temperature even dropped below freezing in late May in the northern United States. I have to ask American and Canadian redditors: Is this really the case Or the weather forecast of my country is broken? If yes I assume the Gulf Stream is already in the process of shutting down.",
            "title_similarity": "0.6129483",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h7vv5c4",
            "score": 1,
            "text": "Give it a few decades and we will call it the gulf steam.",
            "title_similarity": "0.46108013",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7vv6o4",
            "score": 1,
            "text": "Article incorrectly states that Amazon releases more CO2 than it absorbs. The recent news about that stated parts on the Amazon do. Not the whole Amazon.",
            "title_similarity": "0.39662504",
            "sentiment_compound": 0.222
        },
        {
            "id": "h7vvpjx",
            "score": 1,
            "text": "RIP Irelands weather then I guess.",
            "title_similarity": "0.49137455",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7vvq4i",
            "score": 2,
            "text": "Welp might as well head down to the Winchester for a pint and wait for this whole thing to blow over",
            "title_similarity": "0.492001",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h7vvwi0",
            "score": 1,
            "text": "Someone get Dennis Quad up on here. We’ve hit a critical desalinization point!",
            "title_similarity": "0.52967495",
            "sentiment_compound": -0.3802
        },
        {
            "id": "h7vwtat",
            "score": 1,
            "text": "Ahhh, just like they said 40 years ago. We have had a lot of tire graveyard fires since then . Hmm.",
            "title_similarity": "0.336942",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h7vwyko",
            "score": 5,
            "text": "Somebody get Dennis Quaid!\n\n\nIn all seriousness, this is not good",
            "title_similarity": "0.4164341",
            "sentiment_compound": -0.4401
        },
        {
            "id": "h7vziop",
            "score": 1,
            "text": "This would not be a blessing for the rains in Africa",
            "title_similarity": "0.42918408",
            "sentiment_compound": -0.3875
        },
        {
            "id": "h7w0586",
            "score": 1,
            "text": "2020's about to put the icy in spicy.",
            "title_similarity": "0.4730243",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7w06fc",
            "score": 1,
            "text": "Time to reinstall FrostPunk.",
            "title_similarity": "0.37585998",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7w06ws",
            "score": 1,
            "text": "Well....does that mean California will get more rain and snow....if so, then.....let’s do it.",
            "title_similarity": "0.54814065",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7w0fz0",
            "score": 2,
            "text": "So should I stop buying all the aerosol spray and emptying them all in my back yard like some evil genius?",
            "title_similarity": "0.4711085",
            "sentiment_compound": -0.7152
        },
        {
            "id": "h7w0j3w",
            "score": 2,
            "text": "Global Warming > Climate Change > Climate Crisis",
            "title_similarity": "0.7056055",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h7w0n1e",
            "score": 1,
            "text": "We're doomed what's new",
            "title_similarity": "0.40662783",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h7w0qet",
            "score": 1,
            "text": "I’ve been waiting for this to happen. But i was thinking more about the thermohaline circulation",
            "title_similarity": "0.49933752",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7w11c6",
            "score": 1,
            "text": "What does CO2 emissions have to do with ocean currents?",
            "title_similarity": "0.5627782",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7w132n",
            "score": 1,
            "text": "So some good news for once... awesome... <cries into pillow>",
            "title_similarity": "0.2654125",
            "sentiment_compound": 0.6786
        },
        {
            "id": "h7w14r2",
            "score": 2,
            "text": "I love the \"must not be allowed to happen\" in the headline. If it's started, it's definitely too late. We're talking a problem involving orders of magnitude more energy than we can possibly effect as a species. Trillions of tons of water. We can't do anything about it, soz",
            "title_similarity": "0.5072912",
            "sentiment_compound": 0.7645
        },
        {
            "id": "h7w2zbi",
            "score": 1,
            "text": "This will absolutely devastate my parents home country (azores) right in the middle of the Atlantic and depends on the stream for it’s crazy beautiful climate",
            "title_similarity": "0.5810779",
            "sentiment_compound": -0.4391
        },
        {
            "id": "h7w4h37",
            "score": 2,
            "text": "If only signs of things meant we could see the problem and then act to solve the problem..",
            "title_similarity": "0.36593",
            "sentiment_compound": -0.5574
        },
        {
            "id": "h7w4oab",
            "score": 1,
            "text": "There’s absolutely nothing we can do, we can’t even get people vaccinated.  Welcome to the THUNDERDOME. Buy guns.",
            "title_similarity": "0.33934596",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h7w4qxr",
            "score": 1,
            "text": "Maybe we should go back to the times before electricity.",
            "title_similarity": "0.31565887",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7w7urq",
            "score": 2,
            "text": "If I recall correctly there is a movie about something like this.",
            "title_similarity": "0.28877804",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h7wa7oz",
            "score": 2,
            "text": "Buckle up boys and girls.",
            "title_similarity": "0.13989523",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7wbxbw",
            "score": 3,
            "text": "It's been obvious to any idiot for SEVERAL years. The people in charge just choose not to report on it.\n\nOld news. They knew and opted not to tell you.",
            "title_similarity": "0.37269258",
            "sentiment_compound": -0.5106
        },
        {
            "id": "h7wcq8r",
            "score": 2,
            "text": "The time to act was at least 20 years ago.  Essentially we’ve done nothing of any note.  It’s way too late now.",
            "title_similarity": "0.3147548",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7wdpkj",
            "score": 2,
            "text": "Arrest everyone of those god damn polluting CEOs, they shouldn’t be able to just pay a fine for killing the planet.",
            "title_similarity": "0.5472046",
            "sentiment_compound": -0.7906
        },
        {
            "id": "h7wedip",
            "score": 1,
            "text": "Can someone ELI5 what this means for non-coastal NE USA and western USA?",
            "title_similarity": "0.38511777",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7wg771",
            "score": 5,
            "text": "More and more posts are looking like r/collapse",
            "title_similarity": "0.4138859",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h7wgk1i",
            "score": 2,
            "text": "Reddit fucked up the stock market.... Let Reddit save the planet... Where do we start?",
            "title_similarity": "0.62754476",
            "sentiment_compound": -0.296
        },
        {
            "id": "h7wglrn",
            "score": 2,
            "text": "soo.... what can we do, seems we are well past the point of no return as corporations, politicians and people keeping on consuming.",
            "title_similarity": "0.37560335",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h7whfc7",
            "score": 1,
            "text": "suspiciousobservers on youtube",
            "title_similarity": "0.3895344",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7whxlo",
            "score": 1,
            "text": "Why aren’t we doing more to use technology to trap carbon? It seems like I’ve read about half a dozen tech inventions developed specifically for this purpose but have never read “the city of ___ planted tons of these new carbon trapping trees” or “the government of ___ is building a giant carbon capture machine.”",
            "title_similarity": "0.38883466",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h7widw9",
            "score": 1,
            "text": "Just to think what is the bay harbor butcher gonna do.with his bodies now.",
            "title_similarity": "0.39424038",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7wkq2k",
            "score": 4,
            "text": "I've just put 2 beer cans and a pizza box into my recycling wheelie bin. We'll be alright. No need to thank me.",
            "title_similarity": "0.22829112",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h7wl1qm",
            "score": 1,
            "text": "Buckle up, kids, the plummet to extinction is about to begin.",
            "title_similarity": "0.5445638",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7wmjtf",
            "score": 1,
            "text": "I wish we could just speed the whole thing up. What can we do, so it collapses next year?",
            "title_similarity": "0.5214063",
            "sentiment_compound": 0.0571
        },
        {
            "id": "h7wndsx",
            "score": 1,
            "text": "What can a everyday person do to combat this?\n\nIsn't it the manufacturers and industries who put out large exhaust stacks and don't recycle responsible?",
            "title_similarity": "0.44371474",
            "sentiment_compound": -0.7115
        },
        {
            "id": "h7wnldr",
            "score": 1,
            "text": "The world as we know it is changing due to lasting impacts of human industrialization on the earth, over the next 30 years the world will change more so then any other decades past.",
            "title_similarity": "0.5418918",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7wnq83",
            "score": 1,
            "text": "Maynard from Tool said \"learn to swim\", it should be \"learn to camp.\" Shits gonna be real fucked when most of the world's population centers are under water.",
            "title_similarity": "0.47931337",
            "sentiment_compound": -0.8176
        },
        {
            "id": "h7wnrf4",
            "score": 1,
            "text": "Funny how these are popping up now.",
            "title_similarity": "0.20152068",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h7wnwhp",
            "score": 1,
            "text": "Dennis Quaid was right! Why didn't anyone listen to him?!",
            "title_similarity": "0.2982525",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7woj3b",
            "score": 1,
            "text": "well this is terrifying",
            "title_similarity": "0.33588523",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h7wpfpd",
            "score": 1,
            "text": "This would be the cherry on top of all the other natural disasters we had in the last years.",
            "title_similarity": "0.5239681",
            "sentiment_compound": -0.0772
        },
        {
            "id": "h7wpkef",
            "score": 1,
            "text": "Well, who could have known that delaying doing something against climate change can have a dramatic effect on the climate?",
            "title_similarity": "0.69947064",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h7wr1lk",
            "score": 1,
            "text": "This is the big one. Weather patterns are changing in dramatic ways. Water that should fall here in BC as snow in the winter isnt, heck it's a temperate rainforest here in the PNW and it has barely rained in over 45 days. I know, it's summer, but it is a sign of change in fundamental ways that we have no control over. We'll see more catastrophic flooding as temperatures keep moisture in the air for longer and create huge storms that will deluge areas with crazy amounts of water that used to be spread around more liberally and in places where it could be stored for the last thousands of years. It is going to places where it wasn't before in ways it never used to. Snow packs are dwindling due to lack of snow falling in the winter where it should be, resulting in more and more droughts through the summer months. The ocean currents are changing and the air currents are changing. This drives weather.",
            "title_similarity": "0.6217145",
            "sentiment_compound": -0.8717
        },
        {
            "id": "h7wr7u9",
            "score": 1,
            "text": "Hey ive seen that movie",
            "title_similarity": "0.2691446",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7wsmcy",
            "score": 1,
            "text": "This is real and it is awful.  What I interpret from this is that for the first time, I am now convinced we have past the tipping point of civilization extinction.  Invest in whatever you want.  It's over.",
            "title_similarity": "0.5367335",
            "sentiment_compound": -0.0
        },
        {
            "id": "h7wsryg",
            "score": 1,
            "text": "As a Spaniard, it terrifies me that one day millions of English and Californians are goin to want to immigrate in mass to warmer places.",
            "title_similarity": "0.40964943",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h7wts88",
            "score": 2,
            "text": "brb going to drive to the steakhouse to eat a 40 oz steak in my pickup truck while investing in ARAMCO",
            "title_similarity": "0.28346932",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7wuhif",
            "score": 1,
            "text": "Hey Thing-that-we-have-known-would-happen-20-years-ago, I am so surprised to see you come back in actual action 20 years later!",
            "title_similarity": "0.45384803",
            "sentiment_compound": 0.4182
        },
        {
            "id": "h7wuyg7",
            "score": 1,
            "text": "Can we get an end of the world movie but have it more realistic\n\nI want there to be thousands of climate deniers refusing to acknowledge the destruction of the climate",
            "title_similarity": "0.6415347",
            "sentiment_compound": -0.8861
        },
        {
            "id": "h7wv0ai",
            "score": 3,
            "text": "Once again a friendly reminder that:\n\nIt’s not you at home that needs to solve the climate crisis.\n\nIt’s the 3rd world and big business that is responsible for this ongoing.\n\nSanctions, laws, anti corruption and regulation solves a climate crisis, not you using paper straws at home or something.",
            "title_similarity": "0.51781845",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h7wv95k",
            "score": 1,
            "text": "The words “Gulf Stream Collapse” make me feel… intimidated\n\nI’m actually just realizing as i type this it’s not “Gulf of Mexico” collapse",
            "title_similarity": "0.6048163",
            "sentiment_compound": -0.7269
        },
        {
            "id": "h7wwb4z",
            "score": 2,
            "text": "So if it doesn’t collapse on a regular basis “how do they know what the warning signs are?” This is weak scientific speculation full of Ifs, buts and maybes a report deliberately written to get idiots frightened",
            "title_similarity": "0.6129824",
            "sentiment_compound": -0.886
        },
        {
            "id": "h7wwep2",
            "score": 2,
            "text": "\"impossible to forecast the date of any collapse for now\".\n\nSo actually, they are just trying to scare more people.",
            "title_similarity": "0.481434",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h7wwocn",
            "score": 1,
            "text": "Well, that was a depressing read",
            "title_similarity": "0.32202685",
            "sentiment_compound": -0.128
        },
        {
            "id": "h7wy3dz",
            "score": 1,
            "text": "And here in Australia the animals will still be as deadly, but now they’ll be SUPER pissed off instead of just casually passive aggressive.",
            "title_similarity": "0.43557522",
            "sentiment_compound": 0.4587
        },
        {
            "id": "h7wyp00",
            "score": 1,
            "text": "Yes we need to move to renewables etc but this kind of climate change isn't shocking, it just makes things different. Some places will get colder, some warmer, population will move around.\n\nI don't see this as end if days stuff",
            "title_similarity": "0.5768964",
            "sentiment_compound": 0.7606
        },
        {
            "id": "h7wyt45",
            "score": 1,
            "text": "But will the giant corporations be OK?\n\nI sure hope they can increase their profits even more throughout the incoming crisis so that they can build more rocket ships and escape this doomed hellhole.\n\nFarewell, brave billionaires!",
            "title_similarity": "0.4868799",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h7wzigf",
            "score": 1,
            "text": "Welp... Time to bring out my winter jacket",
            "title_similarity": "0.26883486",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7wztwf",
            "score": 2,
            "text": "The article talks about an existential threat to civilisation. So, a threat to the very existence of our civilisation. The IPCC report doesn’t suggest that this is the case.\n\nI’m perplexed by the approach here, clearly civilisation isn’t on the brink of collapse, and I find it extraordinarily difficult to believe that’s a serious risk within a hundred years, even hundreds of years. The idea that we won’t respond and find ways to adapt seems like complete nonsense to me.\n\nLet’s say civilisation doesn’t collapse; 2030 comes by, 2040, 2050. Isn’t there a big risk that claims that civilisation will collapse, which aren’t supported by the science, cause more harm than good?",
            "title_similarity": "0.5535996",
            "sentiment_compound": -0.9663
        },
        {
            "id": "h7wzv73",
            "score": 1,
            "text": "One of the theories on why the Little Ice Age occurred is basically what this research is about, a dumping of glacial water into the North Atlantic that stopped thermohaline circulation. It's estimated this can actually happen very rapidly, within a decade. It's kind of a great mechanism at cooling the planet and honestly I don't know if it would be entirely a bad thing with the direction things are going. Last time it occurred the global temps only dropped about .5-1C with Europe seeing the brunt of it. With Europe temperatures already up nearly 2C from preindustrial levels and rain well above the norm and projected to continue rising for most of Europe, it could be a nice equalizer at cooling and drying Europe.\n\nIt would absolutely throw every single climate model out the window though.",
            "title_similarity": "0.63939536",
            "sentiment_compound": 0.6151
        },
        {
            "id": "h7x11dq",
            "score": 1,
            "text": "The Gulf Stream is the starting point of all the ocean's currents. If that stops, Australia will be affected.",
            "title_similarity": "0.63488156",
            "sentiment_compound": -0.296
        },
        {
            "id": "h7x14qt",
            "score": 1,
            "text": "I'm from an area close to London, which is a similar latitude to Calgary in Alberta, Canada (51.5°N vs 51.04°N respectively). Canada is infamous for having very snowy winters. Southern England rarely gets snow at all, perhaps 1 or 2 snow days every year at the most frequent? It's also uncommon for us to have days with a high temperature below 0°C, whereas I imagine Calgary gets that on a frequent basis. The one thing keeping things sensible for us Brits (and other European nations such as France, Belgium and the Netherlands) is the Gulf Stream. \n\nThe collapse of the Gulf Stream would be nothing short of catastrophic for these areas that have surprisingly 'warm' winters compared to other regions at similar latitudes.",
            "title_similarity": "0.46195978",
            "sentiment_compound": 0.6031
        },
        {
            "id": "h7x1qwu",
            "score": 1,
            "text": "I'm starting to hope that the climate change deniers and flat eartherts are right...",
            "title_similarity": "0.6251945",
            "sentiment_compound": 0.2023
        },
        {
            "id": "h7x2cxt",
            "score": 1,
            "text": "Will someone smarter than me compile a data info graphic of the last three months of Reddit Climate news?! It seems there are at LEAST three articles a day if not more. At least. THREE articles a day of some massive climate issue, BACKED by research and data typically more than any other news on Reddit. Articles and research covering some new scientific disaster happening or starting to happening. Articles covering so many different countries, bodies of water, animals, humans, basically at this point any and all life, so that we can CLEARLY see how screwed things are getting?! I had a personal list going but it honestly got too long. The amount of fires alone. There has to be a way to aggregate it, compile and list the “101 climate disasters this month alone!” All the blockbuster hits with encyclopedias worth of data and research! Stay tuned for falls release! And look forward to 2022’s biggest blockbuster hit, “We’re exponentially screwing ourselves!” With all the easy to read pics and digestible content like a look back at how many wildfires can you name or how many large bodies of marine life dying in a single day can you list?!",
            "title_similarity": "0.5251139",
            "sentiment_compound": 0.9589
        },
        {
            "id": "h7x3xru",
            "score": 1,
            "text": "this isn't sudden, I remember hearing about this in the '70s",
            "title_similarity": "0.16557193",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7x4p8u",
            "score": 1,
            "text": "At this point in this timeline, I’m willing to take the risks",
            "title_similarity": "0.33846158",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h7x5ew6",
            "score": 1,
            "text": "So I guess, the gulf is going to get HOT! That will be fuel for devastating storms.",
            "title_similarity": "0.63554895",
            "sentiment_compound": -0.68
        },
        {
            "id": "h7x6nyr",
            "score": 1,
            "text": "i wish there was someone who could help us. we are not going to be able to save the planet on our own without drastic action like complete dictatorial control of the entire planet by a single governing body .",
            "title_similarity": "0.48092264",
            "sentiment_compound": 0.7572
        },
        {
            "id": "h7x70h1",
            "score": 1,
            "text": "Global warming solved! Now well all be under a deep, deep freeze.... oh.",
            "title_similarity": "0.6404369",
            "sentiment_compound": 0.6476
        },
        {
            "id": "h7x7df2",
            "score": 1,
            "text": "Scary to see this. Hope this brings climate change back to the front of the Agenda of current World Issues.",
            "title_similarity": "0.7602434",
            "sentiment_compound": 0.0451
        },
        {
            "id": "h7x8f68",
            "score": 1,
            "text": "Unpopular opinion:\n\nNo stream profile is better than another. Earth streams was always changing.\nThinking that the current situation is the best or the correct one is false.",
            "title_similarity": "0.49827826",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h7xckr3",
            "score": 1,
            "text": "People in the UK cry when they get half a cm of snow if this happens the country will collapse",
            "title_similarity": "0.55924004",
            "sentiment_compound": -0.743
        },
        {
            "id": "h7xudvz",
            "score": 1,
            "text": "Oh no! The worlds going to end if I don’t stop eating meat, don’t have kids, stop driving, and go broke because everything is insanely expensive due to carbon taxes.",
            "title_similarity": "0.49326593",
            "sentiment_compound": -0.7574
        },
        {
            "id": "h7xx9wd",
            "score": 1,
            "text": "Who could have seen this coming?   Oh right, we’ve been warned for decades.",
            "title_similarity": "0.4070285",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h7y4jax",
            "score": 1,
            "text": "A contribution to the Gulf Stream is the inflow of water from North American rivers. As the US continues to draw ever increasing amounts of water from our rivers, the inflow into the gulf will continue to decrease.",
            "title_similarity": "0.5684924",
            "sentiment_compound": 0.0
        },
        {
            "id": "h7yjmxg",
            "score": 1,
            "text": "Did anyone read the article? It says it’s impossible, I’ll  say again impossible to forecast a collapse. No one has any idea what’s happening!",
            "title_similarity": "0.38718182",
            "sentiment_compound": -0.69
        },
        {
            "id": "h7z9zyy",
            "score": 1,
            "text": "Everyone is complaining about how bad it is without thinking of what we can do!",
            "title_similarity": "0.44412068",
            "sentiment_compound": -0.68
        },
        {
            "id": "h7znrjv",
            "score": 1,
            "text": "Unmentioned in this piece: a slowing Gulf Stream also means more heat piling up in the tropical Atlantic and Caribbean, breeding much stronger hurricanes. \n\nIt's happened before.\n\n[https://news.climate.columbia.edu/2017/11/01/giant-boulders-on-bahamas-coast-are-evidence-of-ancient-storms-and-sea-level-says-study/](https://news.climate.columbia.edu/2017/11/01/giant-boulders-on-bahamas-coast-are-evidence-of-ancient-storms-and-sea-level-says-study/)",
            "title_similarity": "0.6484635",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h85alyr",
            "score": 1,
            "text": "Disclaimer: I used to work in the field, but not anymore. The science is evolving at a fast pace, and I may not be completely up to date. Feel free to challenge the below. \n\nHere is my educated take on this whole thing —\n\nFirst I want to talk a bit about what we know from looking at the past. A weakening/shutdown of the AMOC during the deglaciation coincides with the onset of the Younger Dryas cooling which is associated with extremely rapid and massive climate changes over the world (and in particular cooling over Europe). Also, modeling studies show that the impact of shutting down the AMOC  results in climate changes that are consistant with those observed during the Younger Dryas, suggesting that it played a major role. Though recent research also suggest that other factors were also at play. What is clear is that shutting down the AMOC results in RAPID and CATASTROPHIC climate changes — we are talking 5C to 10C of cooling over a few years in some regions. Imagine. \n\nBut don’t panic just yet. None of the climate models contributing to the IPCC's 5th model intercomparison (CMIP-5) show a shut-down of the AMOC, but most still show a slow-down (greater with a faster rate of global warming). Until now, the consensus was that the forcing conditions are not strong enough (e.g., compared to the deglaciation) and thus are unlikely to cause a shutdown.\n\nBut models are imperfect and it wouldn’t be the first time that we are just... wrong. In this case, it might be that the models used were to coarse to represent the relevant processes: the AMOC simulated by more recent, higher resolution model are much easier to shut down... So we might not be safe after all. \n\nThat Is why it is crucial to continue funding projects such as RAPID that aim to monitor the AMOC. The results presented in this new paper are worrying; it is really starting to look like the AMOC is not just weakening but becoming unstable — a behavior that typically precedes a shutdown. Let’s hope that our interpretation of the measurements incorrectly represent the strength of the AMOC or that these fluctuations are an unlucky coincidence that is the result of natural variability or other processes that we currently do not understand.",
            "title_similarity": "0.6840346",
            "sentiment_compound": 0.873
        },
        {
            "id": "h88kfma",
            "score": 1,
            "text": "*The Gulf Stream and AMOC shouldn’t be used interchangeably. There is a difference.",
            "title_similarity": "0.49495214",
            "sentiment_compound": 0.0
        },
        {
            "id": "hmmv02w",
            "score": 1,
            "text": "Got other worries down here in Aus.",
            "title_similarity": "0.275697",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hs8xf0c",
            "score": 1,
            "text": "Recently bought 5 acres in Maine, 80 miles inland, 600ft above sea level on a lake. Climate change didn’t originally influence the purchasing decision but in hindsight I think it was a good move.",
            "title_similarity": "0.46277335",
            "sentiment_compound": 0.5927
        }
    ]
}