{
    "Permafrost Thaw in Siberia Creates a Ticking ‘Methane Bomb’ of Greenhouse Gases, Scientists Warn\n": [
        {
            "id": "h889uk3",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.3856073",
            "sentiment_compound": 0.7088
        },
        {
            "id": "h88xtgl",
            "score": 3,
            "text": "They have been saying this for decades.",
            "title_similarity": "0.12775771",
            "sentiment_compound": 0.0
        },
        {
            "id": "h88tutl",
            "score": 6,
            "text": "we only have chance if china actually was liable for any of their emissions.",
            "title_similarity": "0.4444406",
            "sentiment_compound": 0.25
        },
        {
            "id": "h88n4ec",
            "score": -1,
            "text": "That extra 100 ppb of methane counts as 10000 ppb of CO2 for global warming. Or 10 ppm. So add that to our 250 ppm of CO2 and we are moving up fast. This is not the end of all life though.",
            "title_similarity": "0.5961552",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h8999x8",
            "score": -8,
            "text": "If the world survives, never forget the political party that gaslit the entire world, dragged their feet, and straight up fought against legislation to protect the environment at every turn. NEVER FORGET REPUBLICANS ARE TO BLAME.",
            "title_similarity": "0.642599",
            "sentiment_compound": 0.5333
        },
        {
            "id": "h88vz0l",
            "score": 0,
            "text": "I know climate change is real. I am not doubting it. \n\nWhy have I been hearing about this for decades with no actual result? \n\nI think this is why so many people ignore global warming or believe it to be a hoax. We've been hearing threats for so long that haven't gone anywhere \n\nAgain. I am not doubting this. I am genuinely asking so I can tell anyone else who DOESN'T believe in climate change because of this reason.",
            "title_similarity": "0.51812893",
            "sentiment_compound": -0.636
        },
        {
            "id": "h89mzr9",
            "score": -2,
            "text": "Meanwhile, entitled millenials and Gen-Z morons don't bother to take the time to research realistic solutions like nuclear power and hydroelectric energy. Wind and solar are pushed far too much, considering not only their inefficiency, but also the chemicals that *they also* leech into the environment. I'm all for getting rid of fossil fuels when we can, but you can't just screech and say *hurr durr, now iss illegal.* That accomplishes nothing and will destroy the world economy, further exacerbating problems. We need to work towards transitioning in a sustainable way, and the \"green energy\" lobbyists and their uneducated celebrity spokespeople flying around in private jets are not the people we should be listening to.\n\nUse your brains.",
            "title_similarity": "0.62317413",
            "sentiment_compound": 0.5563
        },
        {
            "id": "h88lpb3",
            "score": -25,
            "text": "Human beings do not have the ability to mitigate natural disaster.  None of the predictions of climate change account for sudden disaster.  And there are a multitude of powder kegs just lying in wait.  There are no current viable proposals for saving the human race.  Honestly, what happens if the Yellowstone caldera exploded tomorrow?  Or the New Madrid Fault decides to hiccup?  Human accelerated climate change could probably be fixed, even past a \"tipping point.\"  We don't possess the computing power to predict nature's contribution.  Just watch the weather channel.",
            "title_similarity": "0.5975061",
            "sentiment_compound": -0.9235
        },
        {
            "id": "h88twvy",
            "score": 0,
            "text": "[Clathrate Gun Hypothesis we meet again.](https://en.wikipedia.org/wiki/Clathrate_gun_hypothesis)  ;| I get the odd feeling this will not stop coming up any time soon.    \n\n\nThe good news is we may be forced to learn  how to terraform a few hundred years early, so there is that.",
            "title_similarity": "0.48647493",
            "sentiment_compound": -0.3425
        },
        {
            "id": "h88wos3",
            "score": 2,
            "text": "wait till people find out about the alien spaceships full of extinction level creatures that are frozen in the permafrost.",
            "title_similarity": "0.63831645",
            "sentiment_compound": 0.0
        },
        {
            "id": "h88vtsk",
            "score": 0,
            "text": "Please find a better source, not that I'm doubting the scientific assertion.\n\nSmithsonian (the media company not the museum) is known for outright lies.",
            "title_similarity": "0.45630324",
            "sentiment_compound": 0.5324
        },
        {
            "id": "h89gko0",
            "score": 0,
            "text": "Haha cool I remember reading about this ages ago",
            "title_similarity": "0.13972883",
            "sentiment_compound": 0.6486
        },
        {
            "id": "h8a1s68",
            "score": 1,
            "text": "ITS A BOMB!!! BTW, send us scientists more money this year for our \"research\"",
            "title_similarity": "0.574705",
            "sentiment_compound": -0.7012
        },
        {
            "id": "h88xple",
            "score": -4,
            "text": "Been hearing this for decades",
            "title_similarity": "0.09203519",
            "sentiment_compound": 0.0
        },
        {
            "id": "h88rfhk",
            "score": 0,
            "text": "So like is there any chance climate change is wrong and we'll be ok? Or any chance we'll survive with some shred of civilized society?\n\nI feel like I would be further ahead killing myself if not.",
            "title_similarity": "0.52727103",
            "sentiment_compound": -0.1449
        },
        {
            "id": "h88p3sk",
            "score": 4,
            "text": ">So, on any definition, the risk of an Arctic seabed methane pulse is one of the greatest immediate risks facing the human race. \n\n>Why then are we doing nothing about it? Why is this risk generally ignored by climate scientists, and scarcely mentioned in the latest IPCC assessment? I fear it is a collective failure of nerve by those whose responsibility is to speak out and advocate action. It seems to be not just climate change deniers who wish to conceal the Arctic methane threat, but also many Arctic scientists, including so-called ‘methane experts’.\n\n*A Farewell to Ice: A Report from the Arctic* - \nPeter Wadhams ~ 2017",
            "title_similarity": "0.66826034",
            "sentiment_compound": -0.7467
        },
        {
            "id": "h88v40i",
            "score": 5,
            "text": "I mentioned this during a dinner party last week and it made everyone sad.",
            "title_similarity": "0.39612257",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h88qesr",
            "score": -28,
            "text": "[removed]",
            "title_similarity": "0.08555996"
        },
        {
            "id": "h88lngp",
            "score": 91,
            "text": "Our planet will hold its own. We are in a mass extinction, we will be included.",
            "title_similarity": "0.47711557",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89emgm",
            "score": 3,
            "text": "Those gases are going to kill us in 50-100 years, but the viruses that are also under there are going to kill us all a hell of a lot faster than that",
            "title_similarity": "0.6110108",
            "sentiment_compound": -0.9571
        },
        {
            "id": "h88q1nh",
            "score": 1,
            "text": "I remember talk of these methane pockets more than 15 years ago, it's embarrassingly sad we have *yet* to change course for the better.",
            "title_similarity": "0.58285296",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h88tdul",
            "score": 1,
            "text": "We're so fucked. \n\nThis is all stuff that we knew was coming but the powers that be just don't care. The governments and big corporation only care about one thing, and it's money. \n\nThey will try to lay the blame on individuals, but there's really nothing we can do alone without changes at the top, that they won't do. They've created an economy that revolves around fossil fuel and we're just stuck using it because in lot of cases there are simply no alternatives.  Lot of it is also completely out of our control, like all the background processes that happen to products we need like food.",
            "title_similarity": "0.532069",
            "sentiment_compound": -0.6484
        },
        {
            "id": "h88l6vt",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.10243307"
        },
        {
            "id": "h89dkac",
            "score": -8,
            "text": "Lolll I've been hearing about this since I was a kid. Plz stop spreading bullsht",
            "title_similarity": "0.27054304",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h88ntnl",
            "score": -30,
            "text": "I would not be the least bit surprised if humanity is extinct within the next 30 years…",
            "title_similarity": "0.42621863",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h88p246",
            "score": 5,
            "text": "Isn't this fairly common knowledge for a while now...",
            "title_similarity": "0.04038483",
            "sentiment_compound": 0.0
        },
        {
            "id": "h88s8cv",
            "score": 0,
            "text": "I kid you not, me and an old scout master called this news article 8 years ago. Once the permafrost thaws it is game over for any efforts on greenhouse gases.",
            "title_similarity": "0.6376622",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89emae",
            "score": 2,
            "text": "Yup. We know. We’ve known about this for years and years. Still people don’t vote for Green parties, so nothing changes in my country.",
            "title_similarity": "0.22416508",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h88tzx5",
            "score": 3,
            "text": "Don't worry, we were assured the clathrate gun can't fire.  Right?",
            "title_similarity": "0.2224448",
            "sentiment_compound": 0.5487
        },
        {
            "id": "h8927cf",
            "score": 2,
            "text": "Does this planet even have another 50 years left in it, or should I just off myself now?",
            "title_similarity": "0.4189638",
            "sentiment_compound": 0.0
        },
        {
            "id": "h88i085",
            "score": 47,
            "text": "Follow this Map Site link. (Best world map site!)\n\nhttps://satellites.pro/Russia_map#E69.927108,70.550917,9.516269232845595\n\nZoom in and out. What you'll see is 10s of 1000's of methane holes. They go boom then over time fill with water.\n\nHere's a link to Google images.\nEarth zits that will change the planet. \n\nhttps://www.google.com/search?q=methane+holes+siberia&prmd=insv&source=lnms&tbm=isch&sa=X&ved=2ahUKEwi4vffQ4qLyAhXSSzABHecPBTIQ_AUoAXoECAIQAQ&biw=412&bih=783&dpr=2.63",
            "title_similarity": "0.7385484",
            "sentiment_compound": 0.6696
        },
        {
            "id": "h88hm0i",
            "score": 14,
            "text": "Would the release of methane cause a literal explosion of the ground?",
            "title_similarity": "0.7518683",
            "sentiment_compound": 0.0
        },
        {
            "id": "h88ra2o",
            "score": 25,
            "text": "I think about climate change probably more than is beneficial, but the idea I keep coming back to is how inescapable it is. Climate change is driven by profits, and convenience, and consumerism and it is essentially a byproduct of Western Civilization at this point. If we truly want to rewind the clock on climate change, if that’s even possible at this point, I think we have to rewind our lifestyles along with it. No more fast food at every corner with cheap toys from China, no more upgrading tech every 2-3 years, no more new clothes for each season, the whole shebang needs to stop; not just the drilling. Trouble is, people have lost their knowledge of how to live simply and in tune with the environment. Most people need grocery stores and restaurants to survive at this point and it’ll take a lot of learning and hard work to get back to where our lifestyle is anywhere close to carbon neutral. After watching people react to the relatively mild inconveniences of mask wearing and social distancing with COVID, it seems next to impossible that we’d undertake a change that will make our lives significantly less convenient. \n\nMaybe we’ll nail carbon capture in a way we can’t imagine today or maybe we’ll make it to space, but I have a feeling we’ve all signed ourselves up for this ride and there’s no going back.",
            "title_similarity": "0.5905442",
            "sentiment_compound": -0.8449
        },
        {
            "id": "h893shi",
            "score": 0,
            "text": "/r/collapse.  It's game over.  Nothing is changing.",
            "title_similarity": "0.18012863",
            "sentiment_compound": 0.0
        },
        {
            "id": "h894cic",
            "score": 0,
            "text": "20,000 years of this, 7 more to go.",
            "title_similarity": "0.28960413",
            "sentiment_compound": 0.0
        },
        {
            "id": "h895cfq",
            "score": -4,
            "text": "Moderna 是一种极其安全的疫苗，有时会触发休眠病毒通过其巨噬细胞激活来吞没您的器官。你什么都没做",
            "title_similarity": "0.27959186",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89grtn",
            "score": 0,
            "text": "Yeah, we know. This article offers no new information. Everyone has heard this thousands of times. So what?",
            "title_similarity": "0.18648097",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8adkr5",
            "score": 0,
            "text": "56 year veteran of LIFE. All of these things are not new. It’s part of the political spectrum from both sides. They have their data. They know what each of us believes in & the messages we see are all correlated.  That is not to say climate change isn’t real. We should all do our part to be kind to the planet. The planet has been thru a few climate changes & we just happen to be living in the middle of one now. Some were clatecismic. Lush green areas were turned to deserts. Volcanic eruptions, flooding etc. the earth is experiencing pain & must correct itself.  We, as humanity must learn to get along and every time the 1% & politicians (all of them) try to force us to act a certain way we must learn to roll with the punches & see opportunities to help ourselves & family.  Living a life for good. \nThings Will change. Some for good some not good. We are collectively individuals.  Don’t try to force what is right for you onto someone else.  You will always be disappointed. But always be ready to support Truth & Love.",
            "title_similarity": "0.6049056",
            "sentiment_compound": 0.9635
        },
        {
            "id": "h8au22n",
            "score": 0,
            "text": "If temperatures were warmer in the northern hemisphere during the Roman and Medieval warm periods, why did they not release then?",
            "title_similarity": "0.48327446",
            "sentiment_compound": 0.4767
        },
        {
            "id": "h89k2hv",
            "score": -5,
            "text": "If you care about the environment go vegan. Otherwise you’re part of the problem",
            "title_similarity": "0.41937312",
            "sentiment_compound": 0.128
        },
        {
            "id": "h88mhr1",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.085559964"
        },
        {
            "id": "h89533a",
            "score": -11,
            "text": "Um yeah... Science... Currently a galactic magnetic field is altering the sun and weather. Google it. There is NOTHING humans can do to alter this climate change...and yea, the climate has changed since the beginning of time.",
            "title_similarity": "0.63525486",
            "sentiment_compound": 0.296
        },
        {
            "id": "h88w0wo",
            "score": 1,
            "text": "I guess we're all just gonna die then.",
            "title_similarity": "0.29443038",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h88zond",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.102433115"
        },
        {
            "id": "h892ip1",
            "score": 1,
            "text": "If I’ve learned anything from our efforts to stop global warming so far — that bomb is gonna go off.  Our attempts to curb this have been so lackluster so far I assume we should just be planning around how to endure the fallout.",
            "title_similarity": "0.6450678",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h89455p",
            "score": 1,
            "text": "Nice, so lets get this straight, russia and china are the kings of killing the earth...?",
            "title_similarity": "0.63949215",
            "sentiment_compound": -0.1217
        },
        {
            "id": "h89h6cp",
            "score": -1,
            "text": "But hey were going electric on non-recyclable batteries",
            "title_similarity": "0.29388306",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89ogul",
            "score": 1,
            "text": "Judging by how the world acted during a worldwide pandemic, I think it’s safe to say we’re fucked.",
            "title_similarity": "0.6638675",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h8b5ust",
            "score": 1,
            "text": "P/Tr extinction event part II.",
            "title_similarity": "0.40036225",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8c7wbi",
            "score": 1,
            "text": "The news is actually even worse than it appears. Methane releases from the Arctic sea floor north of Siberia have been observed. I have yet to see even an accurate estimate of the volume of the release, but it could easily equal the emissions from land. We can expect the Arctic to get remarkably warmer in a relatively short period of time as a result.",
            "title_similarity": "0.7250408",
            "sentiment_compound": 0.6474
        },
        {
            "id": "h88bl6j",
            "score": -59,
            "text": "Methane doesnt last long in the atmosphere",
            "title_similarity": "0.3784262",
            "sentiment_compound": 0.0
        },
        {
            "id": "h895dko",
            "score": 2,
            "text": "We've know  this for what.. 20 years? I have no idea. But we only have ourselves to blame. We're the literally definition of a virus.",
            "title_similarity": "0.49789315",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h89hd4q",
            "score": 2,
            "text": "Roughly 100 companies are responsible for like 70% of the worlds pollution. \n\nThe CEOs and executives should all stand trial for crimes against humanity imo. Be done with them all",
            "title_similarity": "0.55076444",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h88qt8k",
            "score": -10,
            "text": "Look, this is all about to be over for us.  The Earth is about to do what it takes to clean us off.  It’s been a good run.  We all get to see what’s in the great beyond sooner or later, might as well be sooner!",
            "title_similarity": "0.469421",
            "sentiment_compound": 0.902
        },
        {
            "id": "h88qyci",
            "score": 3,
            "text": "This isn't exactly new news. I remember reading about this almost 10 years ago",
            "title_similarity": "0.21391621",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89c5fu",
            "score": 3,
            "text": "I'm 31 years old and at the point of being able to put my downpayment for my first home from.\n\nMy family lives in a hot, coastal zone, and I've always intended to build a life for myself there.\n\nNow, I am not too sure anymore. Do I really want to invest my life savings into a place that might legitimately be uninhabitable in 40 years time?\n\nI'm legit considering to continue to rent for life and use my money to buy cheap houses in cheap but (currently) undesirable areas inland. I know I'm more fortunate than most, but screw having to gamble like this.\n\nAlso I was planning on using the stock market for retirement savings, that's also something I am second guessing now. The way things are looking I just think that permanent economic recession or even collapse is increasingly likely. Probably safer to put my money in brick and mortar.",
            "title_similarity": "0.36723208",
            "sentiment_compound": -0.4239
        },
        {
            "id": "h89cxim",
            "score": 3,
            "text": "I'm torn.  \nOn one hand I would like to live out my days before real apocalyptic stuff starts happening.  \nOn the other hand I would like to see the faces of the rich once they finally start to feel the effects of climate change on their own skin.",
            "title_similarity": "0.6658032",
            "sentiment_compound": 0.8225
        },
        {
            "id": "h89g5s9",
            "score": 3,
            "text": "Oh? Every time I brought this up, I was shouted down by people who swore blind that the methane clathrate gun hypothesis was debunked and we had nothing to fear from the methane.\n\nI said before that climate change deniers are to climate change experts, what climate change experts are to the methane experts.\n\nEach one adopts the attitude \"That can't possibly be true - if it was, we'd be terrified.\"\n\nYou just had to watch the video of Dr. Natalia Shakovas conference in 2007, when she's talking about this. She looks like a woman who's been told she has stage 4 terminal cancer. \n\nIt was disgraceful when the Royal Society snubbed the Arctic scientists and their research. But now we're to believe that they've known about this for decades? Well they didn't act like it.\n\nIf anything this shows us what it will be like when the climate change denialists finally cave - they'll claim they'd known for decades and were sounding the alarm all along, because hypocrisy means nothing to these people. \n\n/rant.",
            "title_similarity": "0.609202",
            "sentiment_compound": -0.8854
        },
        {
            "id": "h89uf46",
            "score": -4,
            "text": "If you really care about climate change, one of the more useful things you can do on a personal level is to go vegan. \nNo, it won’t solve the problem; no, you are not to blame for the collapse of the climate. However, if you want to make the biggest small impact you can have, start by going veggie and then try to transition to a plant-based diet. It’s better for the planet, helping to off-set a large part of your essential CO2 footprint (think food, commuting, etc.. the stuff you need, not want), and in many ways is arguably more ethical. \nI went vegetarian for a year and a half 2 years ago, and have spent the last 6 months mostly vegan. Up until 2019 I was a big meat-eater and really enjoyed the taste of meat. I still miss a few things, like kebabs and sushi. However, overall the transition to eating veggie was really not that challenging, and from veggie to vegan has been even easier. It’s better for you, for the planet, for the animals, and for your wallet. It’s made me a better cook, and I’ve discovered that contradictory to my previous beliefs, vegetarian dishes can have the same (or greater!) depth of flavour, variety of texture, ease of preparation, and overall enjoyment as meat. I would highly recommend exploring vegetarian Indian cuisine in particular, but there are loads of different ways to eat vegan if curry isn’t your thing. Good luck! :)",
            "title_similarity": "0.4626818",
            "sentiment_compound": 0.9823
        },
        {
            "id": "h8a451f",
            "score": 2,
            "text": "I said it once, I'll say it again, global warming is intentional. People stand to profit from it. There's an entire continent untapped for resources buried underneath ice. There's a nation who has historically been denied a warm water port which would suddenly see new ports open up. This is no accident or negligence, it is deliberate.\n\nHumanity will not go extinct in the way that media portrays, millions will die, yes, but the rich do not care for the thoughts of ant's.\n\nMy prediction is that global warming will hasten the end of US dominance due to massive droughts and wildfires. The Midwest will not have enough water for crops and starvation will result worldwide, not quite 9 meals from anarchy sort of thing, but enough of a strain to bring us to a tipping point.",
            "title_similarity": "0.69857574",
            "sentiment_compound": 0.7339
        },
        {
            "id": "h88jwko",
            "score": 96,
            "text": "Sucks because russia wants siberia to thaw",
            "title_similarity": "0.63250476",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h88mm27",
            "score": 64,
            "text": "Can’t wait for the new and exciting diseases that this permafrost melt is sure to bring about",
            "title_similarity": "0.6153883",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h88nfcr",
            "score": 14,
            "text": "It seems like we'd have thought of some way to make a viable use of or way to contain methane in this sort of quantity before now. \n\nI mean someone please correct me here if im wrong but if any of these pockets of methane or co2 releasing too fast could cause an eruption like Lake nyos killing hundreds right? Basically just an invisible cloud of suffocation rolling through the area at ridiculous speeds. \n\n\nI mean as is it sounds like a multi level disaster. The seas will be changed; there's going to be co2 and methane released that was trapped in the ice itself thawing and pockets underground now able to be released as I mentioned above in possible eruptions too. This just seems horrible.",
            "title_similarity": "0.80859923",
            "sentiment_compound": -0.9661
        },
        {
            "id": "h88anji",
            "score": 261,
            "text": "As they have been saying for most of this century.",
            "title_similarity": "0.08035689",
            "sentiment_compound": 0.0
        },
        {
            "id": "h88tylc",
            "score": 81,
            "text": "If people actually cared about resolving the climate dilemma, they'd be lobbying to replace all power generation with hydroelectric and nuclear, which would solve most of the problems caused by manufacturing and power needs. \n\nInstead, they're trying to get people to drive Priuses and use paper straws, which have minimal impact in the grander scale of things.",
            "title_similarity": "0.58660305",
            "sentiment_compound": 0.6041
        },
        {
            "id": "h894e65",
            "score": 16,
            "text": "It gets harder everyday to pretend we are not living in the end of times.",
            "title_similarity": "0.22013418",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h88o23k",
            "score": 85,
            "text": "This has been a conversation people have been having for decades. We're just watching a slow motion train wreck while we sit by and talk about it. We've clearly shown that even if we're in the middle of an emergency, we don't listen to the people sounding the alarm, so why would we listen to people's sounding the alarm about something that hasn't happened yet?\n\nHumankind, it's been fun. Mostly frustrating, but fun",
            "title_similarity": "0.4543819",
            "sentiment_compound": 0.3291
        },
        {
            "id": "h88p2jm",
            "score": -7,
            "text": "Methane would be much lighter than the air that is mostly nitrogen and oxygen. So I would like to think most of the molecules freed from permafrost would go out to the space within short time. Is it not the case?",
            "title_similarity": "0.48628825",
            "sentiment_compound": 0.6666
        },
        {
            "id": "h88uqs3",
            "score": 8,
            "text": "At this point it seems like we just need to accept that we’re going to keep changing the climate.  And things are going to cascade.\n\nI’m not saying we shouldn’t keep trying to do things to help the environment or slow climate change.  \n\nBut it’s pretty clear by now that we aren’t going to do enough to stop it, if that’s even possible at this point, so it is going to happen.  \n\nSo we should plan for that.",
            "title_similarity": "0.4776975",
            "sentiment_compound": 0.8519
        },
        {
            "id": "h88ur52",
            "score": 7,
            "text": "Anything regular people can do about it?",
            "title_similarity": "-0.01628563",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89j40u",
            "score": 7,
            "text": "Please look into Holistic management (Allen Savory). We can likely halt and even reverse climate change with this very cheap, very quick (2-3 years) method. It involves creating grasslands on now desertified land, since living soil can bind incredible amounts of carbon. It is also very economically viable, since you use livestock to do it, and you make previously useless land useable again. I believe it is our best, and perhaps, only hope.\n\nEdit: I have looked into holistic management more closely, and have found the claims of Allen Savory to be vastly exaggerated. Here's a link to a scientific study on the matter: https://www.slu.se/globalassets/ew/org/centrb/epok/dokument/holisticmanagement_review.pdf?fbclid=IwAR1PHlXkoWKJzKhm7Q0wc_2Vcoczcn96kReSB1tf6unsTXqrgW5k5Cr3-H4",
            "title_similarity": "0.5507776",
            "sentiment_compound": 0.8176
        },
        {
            "id": "h88pm4k",
            "score": 168,
            "text": "Make sure to recycle your bottles and cans, also remember no straws for you.\n\nWhelp that's all I got to say don't mind me flying cross country in my private jet like you do your car to the store.",
            "title_similarity": "0.38272488",
            "sentiment_compound": 0.3818
        },
        {
            "id": "h88mn9t",
            "score": 223,
            "text": "No one will care until it’s too late. And that sucks.",
            "title_similarity": "0.28573292",
            "sentiment_compound": -0.128
        },
        {
            "id": "h88stw1",
            "score": 8,
            "text": "“If we die, we die” -Ivan Bezos",
            "title_similarity": "0.40745455",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h89glh1",
            "score": 8,
            "text": "What frustrates me is that I and many others do our recycling but the fact is that it needed the big companies to change their habits a decade ago for the human race to survive. Now we are looking at the rich practicing their escape plans in phallic space wagons.",
            "title_similarity": "0.6382711",
            "sentiment_compound": 0.7184
        },
        {
            "id": "h8934ny",
            "score": 48,
            "text": "[deleted]",
            "title_similarity": "0.10243309"
        },
        {
            "id": "h88mcwr",
            "score": 568,
            "text": "[removed]",
            "title_similarity": "0.08555996"
        },
        {
            "id": "h88puar",
            "score": 103,
            "text": "can anything be done about this that will matter?\n\nEDIT: I guess were all gonna die",
            "title_similarity": "0.34968823",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h88v8eg",
            "score": 120,
            "text": "All of the people who had the power to stop this will be dead by time the effects are in full force.  We need to take our planet back.  Now or never.",
            "title_similarity": "0.4997272",
            "sentiment_compound": -0.7579
        },
        {
            "id": "h88kln1",
            "score": 65,
            "text": "Look on the bright side.  This will distract us from ocean acidification.",
            "title_similarity": "0.37404734",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h88iwp6",
            "score": 1000,
            "text": "Headline: Scientists warn; people ignore.",
            "title_similarity": "0.4427902",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h88qz1v",
            "score": 102,
            "text": "Sweet, I needed my daily dose of ‘everything you do is futile because the world is going to end any minute anyway’. Cheers!",
            "title_similarity": "0.48029453",
            "sentiment_compound": 0.5411
        },
        {
            "id": "h88gkzz",
            "score": 353,
            "text": "[removed]",
            "title_similarity": "0.085559964"
        },
        {
            "id": "h88ngh0",
            "score": 21,
            "text": "Is this the same as the clathrate gun firing?",
            "title_similarity": "0.2675269",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h88rjbx",
            "score": 163,
            "text": "Now what? Ever since last year (and possibly before that) I felt an ever-growing fear of the inevitable. I don’t think humanity will entirely go extinct because of this, but the fact that it is threatening some people more than others and taking out the beautiful plants and animals we share the planet with doesn’t reassure me at all. The fact that my potential future of being a paleontologist working in one of the best museums (the dream I had since I was small, and my driving force and motivator in the world up to now) is in jeopardy only makes me more afraid. Sometimes I’m afraid to open up, not wanting to stress my loved ones more, and often try to numb it by looking at good news or trying to look at other things but it always comes back. I try to calm myself down by spreading word about it via family texts and social media posts, eating less meat, checking companies that I buy from, joined Citizen’s Climate Lobby, emailed and called my senators about the upcoming infrastructure bill, try to help others in similar situations to the best of my ability, and just trying to calm myself down (sometimes I listen to You Will Be Okay from Helluva Boss) in general, but as the days go by and more fires and flooding and carbon and methane level increases and intense heat and so on continue, I can’t help but notice that it slowly wearing away at me. I don’t know what to do next. What should I do?",
            "title_similarity": "0.5046587",
            "sentiment_compound": 0.9927
        },
        {
            "id": "h88o3dg",
            "score": 32,
            "text": "Pacific northwest is under a record heat dome. Greece and Turkey are on fire. Nobody could've predicted climate change!",
            "title_similarity": "0.66029483",
            "sentiment_compound": -0.4003
        },
        {
            "id": "h88b8m9",
            "score": 1773,
            "text": "It's hard to stop a moving freight train, and this puts that freight train going down a slope.",
            "title_similarity": "0.45238873",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h88tmiq",
            "score": 58,
            "text": "So, let's say you have enough food and supplies in a bunker to survive some post apocalyptic life and out-survive most of the population that starved. It would be you and mostly the rich/elites left alive after a few years or at least a lot less than that...\n\nWould there be any point? It's just going to get worse and I don't really think it would stop getting worse soo... I don't even know what I'm saying anymore this is all just sad I'm going to go live my life.",
            "title_similarity": "0.45327467",
            "sentiment_compound": -0.9509
        },
        {
            "id": "h88tirn",
            "score": 1445,
            "text": "Sea level rise is neither the largest nor most immediate threat of climate change.\r  \nWater happens to have one of the highest, and I would argue, the most important thermal capacity of all the compounds we're likely to come into contact with daily. Water has about 5-10 times the heat capacity of most common things and so heating up all the oceans by say 2 degrees average is an ENORMOUS amount of energy.\r  \n\r  \nWhy is this important? The reason we have climate refugees today is not the water level but rather the higher intensity storms that the warmer waters spawn. Far before people are forced from the shores by rising waters they will be forced from the shores by massive, frequent, destructive storms that, instead of saying destroying 1/1000 homes, will destroy 1/100. Eventually, it will be economically non-viable to live in storm-prone zones. And those zones will increase in size over time to go far inland (away from freshwater), causing more migration.\r  \n\r  \nThis is happening NOW and will be a major factor in the lives of all our children.\r  \n\r  \nIt's easy for people to dismiss rising sea levels because it doesn't seem dangerous and happens over decades. It's far harder for people to dismiss weather disasters that they might have some first or second-handed experience of or, more likely, visceral fear of.\r  \n\r  \nMaybe we should have a different metric? So instead of sea rise/year, we should have expected homes destroyed/year.",
            "title_similarity": "0.5619929",
            "sentiment_compound": -0.9675
        },
        {
            "id": "h88i1ai",
            "score": 8879,
            "text": "We’ve been warned about this at least since the early nineties when I was taking undergrad courses in climatology about positive feedback loops. This is a societal facepalm decades in the making.",
            "title_similarity": "0.50108564",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h88oqn5",
            "score": 5,
            "text": "It's ok, nobody will care until it's already melted.",
            "title_similarity": "0.28671372",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h88q7vl",
            "score": 1,
            "text": "That’d be a cool place to have a campfire at",
            "title_similarity": "0.1711303",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h88rm0o",
            "score": 2,
            "text": "Which they've known might happen for decades, but now it's actually starting to be a problem.",
            "title_similarity": "0.31805453",
            "sentiment_compound": -0.5499
        },
        {
            "id": "h88rr8f",
            "score": 1,
            "text": "Couldn’t they preemptively drill and get the Meghan for fuel or something?",
            "title_similarity": "0.53675616",
            "sentiment_compound": 0.0
        },
        {
            "id": "h88rswg",
            "score": 1,
            "text": "Great, I'll just file this mentally under F...for \"fun\"... as in \"We're all funned, aren't we?\"",
            "title_similarity": "0.23849729",
            "sentiment_compound": 0.8934
        },
        {
            "id": "h88t29x",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.10243307"
        },
        {
            "id": "h88t88u",
            "score": 1,
            "text": "That makes two of us.\n\nAnd I no longer feel so alone.",
            "title_similarity": "0.0037533715",
            "sentiment_compound": -0.5881
        },
        {
            "id": "h88u5ul",
            "score": 2,
            "text": "Question: would the best response to this be to ignite the gas? I realize that will release a *frackton* of greenhouse gasses, but if I remember correctly, methane is worse.",
            "title_similarity": "0.79073584",
            "sentiment_compound": -0.3716
        },
        {
            "id": "h88ulnm",
            "score": 1,
            "text": "I’m waiting for the day when we see smoke in the air that isn’t from California and we turn on the news to find that all the Siberian oil fields are on fire due to a methane cloud that seeped out from the tundra and was lit by a man’s cigarette.",
            "title_similarity": "0.8108208",
            "sentiment_compound": -0.34
        },
        {
            "id": "h88uqu5",
            "score": 1,
            "text": "All those climate deniers will surely be convinced this time!",
            "title_similarity": "0.37844077",
            "sentiment_compound": 0.5848
        },
        {
            "id": "h88vb4l",
            "score": 1,
            "text": "Top layer is ice. Then 30 metres of sand. Then a twisted mess of organic material half rotted away. Then more ice.",
            "title_similarity": "0.41460127",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h88vg9g",
            "score": 1,
            "text": "How does something that is currently in the process of exploding count as \"ticking?\"",
            "title_similarity": "0.5091133",
            "sentiment_compound": 0.0
        },
        {
            "id": "h88vgt7",
            "score": 1,
            "text": "They'd been saying this for years in Fairbanks at the UAF until the 2016 federal administration pulled all funding related to climate change.  My nephew went on a field trip with geologists at UAF studying permafrost and peat bogs in 2015.  Methane and dormant bacteria/viruses are the big dangers.",
            "title_similarity": "0.67599463",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h88vmij",
            "score": 8,
            "text": "The problem with this is it presents the problem as unsolvable. The average joe or joedet thinks they can't do anything to stop it. Solutions aren't put out or even discussed. People have so many fucks to give and this has universally become a unfuckable problem. Corporations and the overall rich could do something about it, but when you have money and power. The problems of the world and people become less significant. Great thing about mother nature is it's unbiased. It will kill and destroy whoever, whenever. Let's just make sure the bastards can't escape that fate. \nEdit: we could also put out more information and find solutions that work for the average person. Just an idea.",
            "title_similarity": "0.48764467",
            "sentiment_compound": -0.96
        },
        {
            "id": "h88vwuw",
            "score": 1,
            "text": "So again, yes, doomsday is upon us. What can I do as an average working class American to help tho? Like.. it’s a real question I’m actually curious. Should I try and bike all 7 miles to work, and unplug everything every time I leave my apartment? \n\nI really don’t want to live in a climate destroyed world, but it almost feels like I have no real say in the matter",
            "title_similarity": "0.5518824",
            "sentiment_compound": 0.3267
        },
        {
            "id": "h88w2hr",
            "score": 17,
            "text": "smoke em if you got em.",
            "title_similarity": "0.20776121",
            "sentiment_compound": 0.0
        },
        {
            "id": "h88wicq",
            "score": 2,
            "text": "Can someone smart chime in and realistically put this in literal years? How much do we have left?",
            "title_similarity": "0.3575578",
            "sentiment_compound": 0.4696
        },
        {
            "id": "h88wlkd",
            "score": 3,
            "text": "Question. This had to have happened before in previous ice age cycles, right? So don’t we have some data on the impact of these events? \n\nCouldn’t you look for spikes of temperatures that happened around the same temperatures and check gas content of the atmosphere from ice cores at that time?",
            "title_similarity": "0.641879",
            "sentiment_compound": 0.0
        },
        {
            "id": "h88wsj1",
            "score": 1,
            "text": "Don’t forget about the anthrax in the soil too",
            "title_similarity": "0.5805898",
            "sentiment_compound": -0.2263
        },
        {
            "id": "h88x6z0",
            "score": 1,
            "text": "Someone help me sleep tonight, is ANYTHING being done about this?",
            "title_similarity": "0.22866437",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h88x7mu",
            "score": 2,
            "text": "So this is where The Tomorrow war got their plot line from",
            "title_similarity": "0.4062514",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h88xawv",
            "score": 1,
            "text": "When this happens, will there be anywhere left on earth that's comfortable to live?",
            "title_similarity": "0.112715185",
            "sentiment_compound": 0.5106
        },
        {
            "id": "h88xbqp",
            "score": 1,
            "text": "1. I think we need to be talking about what actions we can take. \n\n2. I’m also horrified for the future",
            "title_similarity": "0.3911122",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h88xuvz",
            "score": 6,
            "text": "It’s already too late..they just don’t wanna say it out loud",
            "title_similarity": "0.1914591",
            "sentiment_compound": 0.0
        },
        {
            "id": "h88y3g6",
            "score": 1,
            "text": "I keep reading these headlines and every end of the world movie pops into my head. Scary times we're living in.",
            "title_similarity": "0.46109778",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h88yh0q",
            "score": 1,
            "text": "Guess how the great dying happened? Methane bomb and extreme CO2 emissions!",
            "title_similarity": "0.8192805",
            "sentiment_compound": 0.2942
        },
        {
            "id": "h88yr5n",
            "score": 1,
            "text": "Well, I guess it’s time for project wooly mammoth",
            "title_similarity": "0.30906314",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h88z036",
            "score": 1,
            "text": "Has nobody seen Tomorrow War? This is gonna lead to the alien invasion as well",
            "title_similarity": "0.51413",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h88z7w1",
            "score": 1,
            "text": "Anyone else hear that pistol going off?",
            "title_similarity": "0.279153",
            "sentiment_compound": 0.0
        },
        {
            "id": "h88zhq2",
            "score": 1,
            "text": "But didn't Siberia freeze within the last 25k or so years? Humans have been around for more than 10x longer than that.",
            "title_similarity": "0.36651385",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h88zpwe",
            "score": 1,
            "text": "When I first heard of the great filter I always thought it was coming in the future. More and more it's feeling like the great filter is behind us and we failed that test miserably.",
            "title_similarity": "0.40544635",
            "sentiment_compound": 0.7463
        },
        {
            "id": "h8900xo",
            "score": 5,
            "text": "Yay! More things to have crippling anxiety about!",
            "title_similarity": "0.31753212",
            "sentiment_compound": 0.508
        },
        {
            "id": "h890e9y",
            "score": 1,
            "text": "I feel like this warning has come once a month for 30 to 40 years.",
            "title_similarity": "0.24238051",
            "sentiment_compound": -0.0644
        },
        {
            "id": "h890lax",
            "score": 1,
            "text": "Just stop talking about it and plant some trees.",
            "title_similarity": "0.120508745",
            "sentiment_compound": -0.296
        },
        {
            "id": "h890th2",
            "score": 2,
            "text": "1) what is the total amount of CH4 expected to be released?\n\n2) CH4 decomposes into CO2 and H2O in 10 years. How much CO2 will be created from the process?\n\n3) how does that compare to the amount of CO2 emitted by humans annually?\n\nI ran these numbers once, I think i came up with 2 years worth of global CO2 emissions",
            "title_similarity": "0.5795952",
            "sentiment_compound": 0.533
        },
        {
            "id": "h8918gw",
            "score": 1,
            "text": "The world is really coming to an end. Well, for humans that is. I bet sharks will live on for another million years.",
            "title_similarity": "0.40467572",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h891s47",
            "score": 6,
            "text": "Welp, based how badly we're handling climate change, we're doomed.",
            "title_similarity": "0.630985",
            "sentiment_compound": -0.8074
        },
        {
            "id": "h891ywh",
            "score": 1,
            "text": "\"Methane Bomb\" sounds so official.  The most official and most scientific term ever, really a tremendous term, no one warns people like climate scientists, they're the best as making terms sound official.",
            "title_similarity": "0.5359989",
            "sentiment_compound": 0.3221
        },
        {
            "id": "h8920w8",
            "score": 1,
            "text": "we used the *global warming* to create more *global warming*",
            "title_similarity": "0.6048038",
            "sentiment_compound": 0.5542
        },
        {
            "id": "h892kme",
            "score": 2,
            "text": "Oh the viruses we'll find hiding in that old permafrost... What a time to be alive. :/",
            "title_similarity": "0.5735402",
            "sentiment_compound": -0.25
        },
        {
            "id": "h892nzl",
            "score": 2,
            "text": "I don’t doubt this will eventually happen but I think this headline and emergency status is to get world leaders on the same page to avoid it happening eventually.",
            "title_similarity": "0.374015",
            "sentiment_compound": -0.7876
        },
        {
            "id": "h892vwn",
            "score": 1,
            "text": "Yay for positive feedback loops. :(",
            "title_similarity": "0.19964495",
            "sentiment_compound": 0.6249
        },
        {
            "id": "h893jt4",
            "score": 1,
            "text": "Has anything good happened on earth? And would I find it on Reddit?",
            "title_similarity": "0.34759328",
            "sentiment_compound": 0.504
        },
        {
            "id": "h893kjx",
            "score": 1,
            "text": "Can we take a pledge of when we are fighting 130 degree summers we take it out on energy industry executives from 1970-2020 before each other.",
            "title_similarity": "0.5984117",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h893r5e",
            "score": 1,
            "text": "Canada and Alaska too.",
            "title_similarity": "0.32811594",
            "sentiment_compound": 0.0
        },
        {
            "id": "h893vnq",
            "score": 1,
            "text": "Republicans: “but how does that help us buy another mansion or yacht?”",
            "title_similarity": "0.3473537",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h893xyc",
            "score": 1,
            "text": "Love me some clathrate bomb hypothesis.",
            "title_similarity": "0.551574",
            "sentiment_compound": 0.25
        },
        {
            "id": "h894csb",
            "score": 1,
            "text": "The sad part is how many people thing carbon is the only issue when the methane feedback loop is going to really speed up the end of society",
            "title_similarity": "0.63244253",
            "sentiment_compound": -0.4767
        },
        {
            "id": "h894lbu",
            "score": 1,
            "text": "If the methane were to be released it would be better to set it all on fire.",
            "title_similarity": "0.622895",
            "sentiment_compound": 0.128
        },
        {
            "id": "h894mur",
            "score": 1,
            "text": "I remember seeing homemade signs about the permafrost melt along the freeway 20 years ago",
            "title_similarity": "0.5459408",
            "sentiment_compound": 0.0516
        },
        {
            "id": "h894o6v",
            "score": 1,
            "text": "We have known this for years. We have all seem this article once or twice every year for the past decade....yet, we have done nothing, but rehash the same article.",
            "title_similarity": "0.20327309",
            "sentiment_compound": 0.0
        },
        {
            "id": "h894pii",
            "score": 1,
            "text": "This has been known for quite some time. There is a really cool project happening where scientists are attempting to clone/revive Woolly Mammoths so they can roam the Siberian permafrost and pack it down to keep it frozen. [Check out the progress so far](https://reviverestore.org/projects/woolly-mammoth/progress-to-date/)",
            "title_similarity": "0.55689335",
            "sentiment_compound": 0.659
        },
        {
            "id": "h894tlm",
            "score": 1,
            "text": "Scientists warned—DECADES AGO!",
            "title_similarity": "0.48506498",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8954tq",
            "score": 1,
            "text": "Wait. This was mentioned last year too as if it was imminent because 2020’s freeze was super delayed. \n\nWhat happened in 2020? Did freeze come on time?",
            "title_similarity": "0.5252074",
            "sentiment_compound": 0.5803
        },
        {
            "id": "h89571f",
            "score": 1,
            "text": "Isn’t the “bomb” going off already?",
            "title_similarity": "0.51106626",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8957im",
            "score": 1,
            "text": "not to mention pathogens that no living thing has encountered since prehistory :) would be nice if we could get this pandemic dealt with before the next one but maybe i'm being too ambitious",
            "title_similarity": "0.5242473",
            "sentiment_compound": 0.7543
        },
        {
            "id": "h895r1j",
            "score": 1,
            "text": "The only thing that matters to the people causing this problem is that they make enough money to freely ignore its consequences: if we fix that, we fix everything.",
            "title_similarity": "0.25481337",
            "sentiment_compound": -0.3869
        },
        {
            "id": "h8961j0",
            "score": 1,
            "text": "Scientist will be held accountable , mob mentality",
            "title_similarity": "0.41184998",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8961rx",
            "score": 1,
            "text": "Can I log on to good news for like one day?",
            "title_similarity": "0.24496706",
            "sentiment_compound": 0.6597
        },
        {
            "id": "h8964ha",
            "score": 1,
            "text": "Lets not forget the ancient viruses lurking there which has been shown to be able to come alive.",
            "title_similarity": "0.32843986",
            "sentiment_compound": 0.4149
        },
        {
            "id": "h896b7k",
            "score": 1,
            "text": "Methane bomb, my high school nick name.",
            "title_similarity": "0.6143602",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h896bcx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08555996"
        },
        {
            "id": "h896dp8",
            "score": 3,
            "text": "We need more work from home. More electric cars. Less airplane travel. Less meat. Less consumptive lifestyle overall. But it might be too late for us anyway.",
            "title_similarity": "0.36974144",
            "sentiment_compound": 0.0
        },
        {
            "id": "h896i8h",
            "score": 1,
            "text": "Methane holds 25 times more heat than CO2",
            "title_similarity": "0.47629428",
            "sentiment_compound": 0.0
        },
        {
            "id": "h896kyr",
            "score": 1,
            "text": "Methane is a not permanent in the atmosphere right? I think I recall reading that it breaks down after 5 years?",
            "title_similarity": "0.4540573",
            "sentiment_compound": 0.0
        },
        {
            "id": "h896tkv",
            "score": 2,
            "text": "Just accept that we’re all about to die and enjoy your lives.",
            "title_similarity": "0.21965328",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h896u68",
            "score": 1,
            "text": "Not like there's anything we can do about it.",
            "title_similarity": "0.05343384",
            "sentiment_compound": -0.2755
        },
        {
            "id": "h8970xx",
            "score": 1,
            "text": "So let’s cover Siberia in a big thick plastic sheet, collect the methane, then use it to power Coca Cola factories",
            "title_similarity": "0.744711",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8978f4",
            "score": 1,
            "text": "Not so Perma now are ya!",
            "title_similarity": "0.13931386",
            "sentiment_compound": 0.0
        },
        {
            "id": "h897uk9",
            "score": 1,
            "text": "thats a lot of cow farts\n\nits all coming out at this rate.",
            "title_similarity": "0.43291038",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8981s7",
            "score": 1,
            "text": "Eff it, im going to take out the biggest mortgage I can an live of credit cards till I die in the Climate Wars, because let’s be real… I’m not retiring, so live it up now.",
            "title_similarity": "0.5970602",
            "sentiment_compound": -0.7096
        },
        {
            "id": "h898bcw",
            "score": 1,
            "text": "I thought permafrost never thaw",
            "title_similarity": "0.273428",
            "sentiment_compound": 0.0
        },
        {
            "id": "h898jyv",
            "score": 1,
            "text": "I was told it was already too late to stop this........... back in the Flippin 90s",
            "title_similarity": "0.29319572",
            "sentiment_compound": -0.296
        },
        {
            "id": "h898m5g",
            "score": 1,
            "text": "Billionaires: We tricked the rubes and made a mint. Now, let's hightail to our refuges in New Zealand and watch the rest of the world burn.",
            "title_similarity": "0.64062583",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h898pdt",
            "score": 1,
            "text": "That is going to be a big boom if it ever happens.",
            "title_similarity": "0.3171422",
            "sentiment_compound": 0.0
        },
        {
            "id": "h898s91",
            "score": 1,
            "text": "It's a good time to be a misanthrope. I have my popcorn ready!",
            "title_similarity": "0.30246052",
            "sentiment_compound": 0.69
        },
        {
            "id": "h898vba",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.10243307"
        },
        {
            "id": "h898zjq",
            "score": 1,
            "text": "And the fuse has been lit. Bleak. Yes. But true.",
            "title_similarity": "0.3550269",
            "sentiment_compound": 0.6757
        },
        {
            "id": "h8990a2",
            "score": 1,
            "text": "This would never happen but we would have to come together as a collection of 200+ nations to solve this with the same vigor as the Manhattan Project, and even then it may not be enough. \n\nIt'll also never happen but I think fossil fuel companies need to be held responsible monetarily.",
            "title_similarity": "0.53229856",
            "sentiment_compound": 0.7783
        },
        {
            "id": "h8999t3",
            "score": 1,
            "text": "This is why projects like Pleistocene park need to be funded! We need to bring back the wooly mammoth to survive!!",
            "title_similarity": "0.4927254",
            "sentiment_compound": 0.5229
        },
        {
            "id": "h899cls",
            "score": 1,
            "text": "I feel like the more we convert to clean energy, the faster it speeds up the climate crisis.",
            "title_similarity": "0.5495132",
            "sentiment_compound": 0.296
        },
        {
            "id": "h899ij1",
            "score": 2,
            "text": "It really is sad how now, seemingly on an exponential basis, I am reminded that my choice to be child-free, was (is, and will be) the right one.",
            "title_similarity": "0.3722721",
            "sentiment_compound": -0.5233
        },
        {
            "id": "h899kfb",
            "score": 1,
            "text": "And they want to know why we don't want to spend our entire lives working, because there isn't much life left. I don't want to spend my last days slaving away for pennies.",
            "title_similarity": "0.34921247",
            "sentiment_compound": -0.0372
        },
        {
            "id": "h899q9r",
            "score": 1,
            "text": "I refuse to accept that anyone expects me to have any hope for the future when headlines like this come out every couple days",
            "title_similarity": "0.33387658",
            "sentiment_compound": 0.7003
        },
        {
            "id": "h899qjs",
            "score": 1,
            "text": "It’s ok. We’re all doomed.",
            "title_similarity": "0.19769907",
            "sentiment_compound": -0.6369
        },
        {
            "id": "h899uy6",
            "score": 1,
            "text": "Russia is winning the warm war.",
            "title_similarity": "0.47964185",
            "sentiment_compound": 0.1027
        },
        {
            "id": "h89a34c",
            "score": 1,
            "text": "I've been a ticking methane bomb since 1990",
            "title_similarity": "0.6078271",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h89a7ij",
            "score": 1,
            "text": "Also Russia would develop a lot of Siberia with less permafrost they have new natural gas and minable materials",
            "title_similarity": "0.62679124",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h89afh9",
            "score": 1,
            "text": "It's out of your control, so stop worrying about it. - Seneca, probably.",
            "title_similarity": "0.25484622",
            "sentiment_compound": -0.6751
        },
        {
            "id": "h89aryq",
            "score": 1,
            "text": "Can we legalize suicide already",
            "title_similarity": "0.36341685",
            "sentiment_compound": -0.6705
        },
        {
            "id": "h89bcau",
            "score": 1,
            "text": "\\~\\~We are fucked and there's nothing any of us can conceivably do about it until it gets to huge losses of life in rich nations!\\~\\~",
            "title_similarity": "0.5214863",
            "sentiment_compound": -0.3595
        },
        {
            "id": "h89bnfr",
            "score": 1,
            "text": "Stupid question but I don’t actually know. If we make a hole in the ozone, can oxygen escape through it? Like can the earth lose oxygen without an ozone layer?",
            "title_similarity": "0.6093044",
            "sentiment_compound": -0.2047
        },
        {
            "id": "h89bs5v",
            "score": 1,
            "text": "At this point I am just waiting the inevitable.\n\nBut we sent a rich ass to space so we are fine...",
            "title_similarity": "0.36655903",
            "sentiment_compound": 0.4109
        },
        {
            "id": "h89c1ef",
            "score": 1,
            "text": "The next couple decades should be interesting",
            "title_similarity": "0.2530385",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h89c8iy",
            "score": 1,
            "text": "Its so disheartening. I remember 2 decades ago, being in grade school and hearing all the possibilities of global warming. Wondering why no one with the means to do anything, would do anything to prevent this outcome.",
            "title_similarity": "0.5794296",
            "sentiment_compound": -0.5563
        },
        {
            "id": "h89cjrx",
            "score": 1,
            "text": "All of what's going on recently around the world, you know, the fires, heatwaves, droughts and all that really remind me of that David Attenborough documentary (his latest one) where he outlines what happens with the climate throughout the next few decades. Watching it was eye opening enough, but the fact what he said is already starting to happen, it's mad. \n\nGovernments and world leaders have been warned about this for years now, they didn't do anything then, I really doubt their going to do anything now; not until it's too late at least.",
            "title_similarity": "0.5970378",
            "sentiment_compound": -0.8919
        },
        {
            "id": "h89cnbf",
            "score": 1,
            "text": "I can almost hear the politicians gasping and rushing into action.",
            "title_similarity": "0.36678272",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89dpjj",
            "score": 1,
            "text": "*sighs* greeeaaaaat. Is it getting to the point where its sane to build a doomsday bunker yet?",
            "title_similarity": "0.5073927",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h89eatz",
            "score": 1,
            "text": "Set it on fire and perhaps we'll get another huge eternal gas stove.",
            "title_similarity": "0.64543945",
            "sentiment_compound": -0.0258
        },
        {
            "id": "h89em00",
            "score": 2,
            "text": "Quick! Let's do nothing!",
            "title_similarity": "0.106975526",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89etio",
            "score": 1,
            "text": "Yeah methane is much worse than CO2 and CO2 is already bad.\n\nOof, the only good thing is that methane doesn't last as long in the atmosphere as CO2",
            "title_similarity": "0.548966",
            "sentiment_compound": -0.3612
        },
        {
            "id": "h89etma",
            "score": 2,
            "text": "They can keep writing scary stories, thing is it hasn't helped a bit for the last 50 years but elites flying with planes to discuss it and then fly back again.\nDoing nothing would've been better for the environment.",
            "title_similarity": "0.46767223",
            "sentiment_compound": -0.638
        },
        {
            "id": "h89f05o",
            "score": 2,
            "text": "It’s all just comin down",
            "title_similarity": "0.110287204",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89f2qs",
            "score": 1,
            "text": "And then people start smoking there...",
            "title_similarity": "0.17664889",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89g2z9",
            "score": 2,
            "text": "[Climate Deception Dossiers](https://ucsusa.org/resources/climate-deception-dossiers), or how the fossil fuel comapnies have been screwing is since the seventies:",
            "title_similarity": "0.61845416",
            "sentiment_compound": -0.5859
        },
        {
            "id": "h89hucd",
            "score": 1,
            "text": "Thats literally one of the plot points in andy weirs new book, project hail mary. Unbelievable",
            "title_similarity": "0.43485713",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h89im6u",
            "score": 1,
            "text": "We're all fucked. I 100% beleive it's already too late. Will we here in this moment see the full scope of these changes? Nope, but our grandkids will, absolutely.",
            "title_similarity": "0.461433",
            "sentiment_compound": -0.4019
        },
        {
            "id": "h89inna",
            "score": 1,
            "text": "From the article: \"Interpreting this data correctly “may make the difference between catastrophe and apocalypse”\"\n\nCatastrophe or apocalypse....these are the alternatives we are down to.",
            "title_similarity": "0.5133304",
            "sentiment_compound": -0.8689
        },
        {
            "id": "h89ip80",
            "score": 1,
            "text": "Why would you hug of death already!",
            "title_similarity": "0.37079495",
            "sentiment_compound": -0.2714
        },
        {
            "id": "h89j4d2",
            "score": 3,
            "text": "Been trying to save the planet since the late 80s. Where was all the support for the cause back then? Oh that's right they have only just got the so called green tech to save us and make shed loads of money in the process!",
            "title_similarity": "0.44276583",
            "sentiment_compound": 0.8553
        },
        {
            "id": "h89jkjv",
            "score": 1,
            "text": "And for people who don’t care about this but care about russia. THIS IS LITERALY THE THING THAT LETS THEM BECOME THE SUPERPOWER THEY WANT TO BE. THEY DONT HAVE LIMITS ON THE FARMLAND THEY CAN HAVE. THE DONT HAVE LIMITS ON THE LAND THEY CAN LIVE ON OR BUILD ON AND SURVIVE. and for everyone else(who is normal) it’s a damn shame people are idiots",
            "title_similarity": "0.4881042",
            "sentiment_compound": 0.0643
        },
        {
            "id": "h89jsy9",
            "score": 1,
            "text": "[Read Boichi's \"Hotel\" short manga](http://m.fanfox.net/manga/hotel/v01/c001/1.html). There is one scene in there that is unforgettable (Amazing story) regarding the methane build-up.",
            "title_similarity": "0.5652779",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h89jvff",
            "score": 1,
            "text": "Hahaha, my future is SO fucked",
            "title_similarity": "0.32937694",
            "sentiment_compound": -0.6037
        },
        {
            "id": "h89klof",
            "score": 2,
            "text": "This was already known decades ago. Scientists have been warning about this for those same decades. If we didn't listen then, why will we now? This was always urgent.",
            "title_similarity": "0.47139937",
            "sentiment_compound": -0.1531
        },
        {
            "id": "h89lg30",
            "score": 1,
            "text": "Surely the Russians will just bottle it up and sell it to the world.",
            "title_similarity": "0.5587188",
            "sentiment_compound": 0.4404
        },
        {
            "id": "h89m7xy",
            "score": 1,
            "text": "I wonder how much methane the worldwide population of cows contributes to global warming on an annual basis.",
            "title_similarity": "0.68780303",
            "sentiment_compound": 0.1531
        },
        {
            "id": "h89mhdv",
            "score": 1,
            "text": "We will need a new name for that zone.",
            "title_similarity": "0.28470755",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89nrcc",
            "score": 1,
            "text": "After the past two years now, I’m kind of getting numb to all this climate stuff. It’s just gotten worse and I think finally I’m accepting that literally nothing we do can change it, and that we are probably the last humans for a long time. I’m 26, will never have kids.",
            "title_similarity": "0.4401464",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h89ofoe",
            "score": 2,
            "text": "This is terrible. When I see how the covid crisis is managed on an international level, I lost hope in solving the climate crisis.\n\n/rant :\nWe should have been acting since the 90's, now decision makers are thinking \"yeah, +2°C isn't that bad\" ... it is very bad ! There are already floods and fires at the same time in Europe, Asia and America, famine in Africa, do they expect it to get better ? \n\nPeople who can make the biggest changes to save humanity are the one who profit the most from the system as it is anyways...\n\n/rant",
            "title_similarity": "0.63434273",
            "sentiment_compound": -0.6292
        },
        {
            "id": "h89ozdh",
            "score": 1,
            "text": "It's an accelerating effect. Things are snowballing fast now.",
            "title_similarity": "0.4176916",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89pf1v",
            "score": 1,
            "text": "Looks like the final cascade has begun. Tbh at this point all we can really do is pray and brace for impact.",
            "title_similarity": "0.2909268",
            "sentiment_compound": 0.6204
        },
        {
            "id": "h89pykr",
            "score": 1,
            "text": "It’s too late, we’re fucked",
            "title_similarity": "0.25306273",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h89q3va",
            "score": 1,
            "text": "yeah -  it is known already years..., additionally there is this:  \n[https://en.wikipedia.org/wiki/Methane\\_clathrate](https://en.wikipedia.org/wiki/Methane_clathrate)  \nso - it is possible, we'll see big changes at our lifetime.",
            "title_similarity": "0.5156234",
            "sentiment_compound": 0.296
        },
        {
            "id": "h89qiky",
            "score": 3,
            "text": "Terrifying prospect. Note that even though the individual is not capable of solving climate change, we can do several things to improve the situation.\n\nThe biggest is moving your pensions or savings into funds that promote renewables. I did this with my pensions against advise of our company financial advisor. My pension is outperforming those who invested in non-ethical non-renewable funds. Sure you can also reduce your direct impact, but your money is your vote and it makes a real difference where it is spent.\n\nNote that a lot of ethical funds invest heavily in banks, which to me, seems highly unethical as they have pushed oil, has and coal for decades. Worth a quick check to avoid these.",
            "title_similarity": "0.5096031",
            "sentiment_compound": -0.0899
        },
        {
            "id": "h89qobl",
            "score": 1,
            "text": "Its over, nothing we can do about it, voting won't help, where will the end of the world party be?",
            "title_similarity": "0.354142",
            "sentiment_compound": 0.1134
        },
        {
            "id": "h89relw",
            "score": 1,
            "text": "I am afraid that Covid19 was still the tip of the iceberg, there are still some challenges for human mankind.",
            "title_similarity": "0.40448776",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h89s4k6",
            "score": 1,
            "text": "I literally just watched a YT video on this ʕ•ᴥ•ʔ",
            "title_similarity": "0.2421322",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89sepo",
            "score": 1,
            "text": "Permafrost aged like milk.",
            "title_similarity": "0.29246897",
            "sentiment_compound": 0.3612
        },
        {
            "id": "h89spq3",
            "score": 3,
            "text": "Warning? It's been happening, it is happening, and it will continue to happen.\n\nThis \"ticking time bomb\" has already gone off.",
            "title_similarity": "0.50675726",
            "sentiment_compound": -0.6808
        },
        {
            "id": "h89sqpz",
            "score": 1,
            "text": "Earth is about to do a giant fart.",
            "title_similarity": "0.58010155",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89t850",
            "score": 1,
            "text": "It’s all going to happen. We’re all going to die. Nobody is going to do anything to stop it until that’s more profitable than doing nothing, and the people with money won’t be willing to spend it on that until they’re SURE the climate crisis will kill THEM during their lifetimes. Once the can can’t be kicked anymore these folks with the means to do something will finally wake up. \n\nAnd, like people on a ventilator writing down that they’re  ready to take the COVID vaccine now, it’ll be way too late.",
            "title_similarity": "0.5661514",
            "sentiment_compound": -0.6882
        },
        {
            "id": "h89tfkx",
            "score": 1,
            "text": "It's already over. We lost",
            "title_similarity": "0.16469704",
            "sentiment_compound": -0.3182
        },
        {
            "id": "h89uh38",
            "score": 1,
            "text": "What will come after humans I wonder?\nWhat will replace us at the top?",
            "title_similarity": "0.42676497",
            "sentiment_compound": 0.2869
        },
        {
            "id": "h89vcu4",
            "score": 1,
            "text": "A lot of these around. One was under a sheet of ice somewhere here in Canada",
            "title_similarity": "0.3127711",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89vz2e",
            "score": 1,
            "text": "I know y’all are intelligent, some of you put that intelligence to work capturing these gasses and repurpose them. There must be a way. Science it up you geeks!!",
            "title_similarity": "0.52508664",
            "sentiment_compound": 0.7418
        },
        {
            "id": "h89w7e4",
            "score": 1,
            "text": "Anyone watched downsize me? Great display of this positive feedback loop at work, average movie",
            "title_similarity": "0.31136888",
            "sentiment_compound": 0.8537
        },
        {
            "id": "h89xfk2",
            "score": 2,
            "text": "Scientists keep warning, but nobody's listening.",
            "title_similarity": "0.29995638",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h89xppr",
            "score": 1,
            "text": "The year is 2040 Canada and Russia are tropical paradises.",
            "title_similarity": "0.41803497",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89yi08",
            "score": 1,
            "text": "We need to destroy the fossil fuel industry immediately. \nSeize all their assets without compensation and dismantle their operations. They are expendable despite their propaganda. Anthropogenic climate change needs to be stopped right now.",
            "title_similarity": "0.63998973",
            "sentiment_compound": -0.4515
        },
        {
            "id": "h89ymyb",
            "score": 1,
            "text": "We’re all gonna die, and corporations are gonna blame us for it. What are we gonna do about it?",
            "title_similarity": "0.5463922",
            "sentiment_compound": -0.743
        },
        {
            "id": "h89ywc3",
            "score": 1,
            "text": "Let me guess....the only possible solution is to raise taxes.",
            "title_similarity": "0.4265951",
            "sentiment_compound": 0.3182
        },
        {
            "id": "h89z3ob",
            "score": 1,
            "text": "Nu vad nimic gresit in porumbul cu ciocolata",
            "title_similarity": "0.12708892",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89zcuh",
            "score": 3,
            "text": "The more I go to Reddit and see posts like this the worse my mental health gets I feel.\n\nLike what’s the point in planning for the future when it’s all fucked for me? And I live in Sweden too where we’ve done alright working on our carbon footprint (not good, but alright compared to others) and now the Gulf Stream is about to shut down and freeze us to death.\n\nSo what’s the point?",
            "title_similarity": "0.61366665",
            "sentiment_compound": -0.8742
        },
        {
            "id": "h89zgxr",
            "score": 1,
            "text": "Can someone put in a report of what the probable and likely effects of climate change will most certainly be? Sadly, people are motivated, especially the ones that need to enact change, are motivated by only a few things. Fear and money being the largest motivators. Tell them what they will be losing, put that in terms of dollars, and they will change their policies overnight.",
            "title_similarity": "0.6436179",
            "sentiment_compound": -0.044
        },
        {
            "id": "h89zs5u",
            "score": 1,
            "text": "Nothing to stop it now.",
            "title_similarity": "-0.046145774",
            "sentiment_compound": 0.2235
        },
        {
            "id": "h89zsqm",
            "score": 1,
            "text": "Get to work on climate engineering yall",
            "title_similarity": "0.49616766",
            "sentiment_compound": 0.0
        },
        {
            "id": "h89zt3e",
            "score": 1,
            "text": "Saw this in r/collapse",
            "title_similarity": "0.26040724",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8a0lbu",
            "score": 1,
            "text": "It’s always ticking, I wonder when/ if they will just say we’re fucked.",
            "title_similarity": "0.46845365",
            "sentiment_compound": -0.6597
        },
        {
            "id": "h8a0sin",
            "score": 1,
            "text": "Will America invade cause of gas?",
            "title_similarity": "0.6200572",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8a0ufb",
            "score": 1,
            "text": "Nobody cares about what scientists say, unless it can make them money.",
            "title_similarity": "0.28422466",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8a18x7",
            "score": 1,
            "text": "हाल के वर्षों में, जलवायु वैज्ञानिकों ने चेतावनी दी है कि साइबेरिया में पिघलना पर्माफ्रॉस्ट एक \"मीथेन टाइम बम\" हो सकता है जो धीरे-धीरे विस्फोट कर रहा हो। अब, उपग्रह इमेजरी का उपयोग करते हुए एक सहकर्मी-समीक्षा अध्ययन और एक अंतरराष्ट्रीय संगठन द्वारा एक समीक्षा चेतावनी दे रही है कि रूस के सुदूर उत्तरी इलाकों में गर्म तापमान मीथेन के बड़े पैमाने पर उपाय जारी कर रहा है - कार्बन डाइऑक्साइड की तुलना में काफी अधिक वार्मिंग शक्ति वाला एक शक्तिशाली ग्रीनहाउस गैस।",
            "title_similarity": "0.32056835",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8a1cmz",
            "score": 1,
            "text": "I got a vasectomy because i didn't want to bring a child into a world that will be terminal by the time he is my age (34).",
            "title_similarity": "0.43217975",
            "sentiment_compound": -0.0572
        },
        {
            "id": "h8a20ef",
            "score": 1,
            "text": "How scared should I be?",
            "title_similarity": "0.27321404",
            "sentiment_compound": -0.4404
        },
        {
            "id": "h8a2otv",
            "score": 1,
            "text": "We are pretty much done as a species.",
            "title_similarity": "0.044703305",
            "sentiment_compound": 0.4939
        },
        {
            "id": "h8a32tv",
            "score": 1,
            "text": "Considering the potential resources under there the Russian government is probably excited for this.",
            "title_similarity": "0.40607545",
            "sentiment_compound": 0.34
        },
        {
            "id": "h8a357n",
            "score": 1,
            "text": "And there's a lot, I mean A LOT, of old dead frozen things in there. They're rotting now.",
            "title_similarity": "0.33290374",
            "sentiment_compound": -0.6486
        },
        {
            "id": "h8a3hd1",
            "score": 1,
            "text": "When those hydrates let go...we are fucked.\n\nYou will look back at the CO2 warming as a pleasant stage.",
            "title_similarity": "0.5326086",
            "sentiment_compound": -0.128
        },
        {
            "id": "h8a3xvt",
            "score": 1,
            "text": "Yes, but won't somebody think of the shareholders?!",
            "title_similarity": "0.2757146",
            "sentiment_compound": 0.2828
        },
        {
            "id": "h8a3xyd",
            "score": 1,
            "text": "Will it destroy the o-zone layer?:))",
            "title_similarity": "0.478534",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h8a4cqp",
            "score": 1,
            "text": "And we won't do anything until its at our front door. Even then humanity has proven itself to incapable of adapting.",
            "title_similarity": "0.31926513",
            "sentiment_compound": -0.3818
        },
        {
            "id": "h8a4heu",
            "score": 1,
            "text": "I’ve already made peace with the fact that mankind is doomed.",
            "title_similarity": "0.31348795",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h8a5nbs",
            "score": 1,
            "text": "What am I supposed to do?",
            "title_similarity": "0.075608045",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8a5y0s",
            "score": 1,
            "text": "for those interested by the actual state of ice melt8ng in greenland http://nsidc.org/greenland-today/\n\nalso, why people seem so reactive to redundant news, well imo, because they don't look at the details and progression. Their is a LOT to learn if you want to have the big picture of it, every climate change markers are important. This is not a reminder that we are wrong about how we live our lives or whatever, these are actual signs of climate change and we should know more about them, that's it !",
            "title_similarity": "0.5960039",
            "sentiment_compound": 0.4753
        },
        {
            "id": "h8a6ef5",
            "score": 1,
            "text": "I found the source of the ticking",
            "title_similarity": "0.47386408",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8a6lp0",
            "score": 1,
            "text": "News just keeps rolling out and I become despondant. What does it do to the psychology of a generation to believe that there is no future and that there is nothing we can do about it? Not for lack of trying...",
            "title_similarity": "0.3560088",
            "sentiment_compound": -0.0613
        },
        {
            "id": "h8a6vym",
            "score": 1,
            "text": "Maybe it won't be so bad.",
            "title_similarity": "0.009540407",
            "sentiment_compound": -0.6696
        },
        {
            "id": "h8a7prz",
            "score": 1,
            "text": "As stated in an earlier thread.\n\nI’m all out of stress.",
            "title_similarity": "0.14990014",
            "sentiment_compound": -0.4215
        },
        {
            "id": "h8a7uzr",
            "score": 1,
            "text": "We know, but until politicians and corporations do something we’re out of luck. \n\nVote with your money and your wallet but outside of that nothing can be done.",
            "title_similarity": "0.32804167",
            "sentiment_compound": 0.6124
        },
        {
            "id": "h8a7v4m",
            "score": 1,
            "text": "Is there anything in this world which isn't fucked up!?",
            "title_similarity": "0.10419245",
            "sentiment_compound": 0.587
        },
        {
            "id": "h8a80n7",
            "score": 1,
            "text": "Following every Ice Age there has been a Greenhouse Period and then another Ice Age followed by a Greenhouse Period followed by an Ice Age, rinse, repeat.",
            "title_similarity": "0.46934685",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8a8675",
            "score": 1,
            "text": "Grabbing a ticket to Mars anybody want me to grab you one?",
            "title_similarity": "0.38641122",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8a8904",
            "score": 1,
            "text": "Remember the good old days when everyone laughed at those idiots on Krypton for not listening to Jor-El?",
            "title_similarity": "0.5207021",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h8a918z",
            "score": 1,
            "text": "George Carlin must be smiling up at us, and I think he's pleased.",
            "title_similarity": "0.14147016",
            "sentiment_compound": 0.7096
        },
        {
            "id": "h8a98cx",
            "score": 1,
            "text": "Facebook tells me this is all a cycle so whatyagunnado",
            "title_similarity": "0.24830401",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8a9lu4",
            "score": 1,
            "text": "Pretty hard to stop. Realized pretty late",
            "title_similarity": "0.21576883",
            "sentiment_compound": 0.5859
        },
        {
            "id": "h8a9sv4",
            "score": 1,
            "text": "That was my nickname in high school",
            "title_similarity": "0.24174738",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8aa1u6",
            "score": 1,
            "text": "Man, we're so fucked its not even funny.",
            "title_similarity": "0.2587455",
            "sentiment_compound": -0.8411
        },
        {
            "id": "h8aa33b",
            "score": 1,
            "text": "This is so sad. Breaks my heart man.",
            "title_similarity": "0.27894744",
            "sentiment_compound": 0.0538
        },
        {
            "id": "h8aa8yl",
            "score": 1,
            "text": "We need carbon capture and methane capture plants all over the world. One way we'll get through this short-term. Long term we need renewable energy.",
            "title_similarity": "0.57985467",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h8abg0h",
            "score": 2,
            "text": "This will definetly happen if we let capitalism continue. The profit motive is at odds with preserving an environment that enables us to live normally. There's just not enough profit to be made from saving the planet as opposed to destroying it.",
            "title_similarity": "0.5043162",
            "sentiment_compound": -0.4777
        },
        {
            "id": "h8abjpy",
            "score": 1,
            "text": "Why can't they burn it off? I know this is grossly simplifying the scenario but I'm just wondering.",
            "title_similarity": "0.43502468",
            "sentiment_compound": -0.1154
        },
        {
            "id": "h8abmyw",
            "score": 1,
            "text": "*“Scientists have been shocked that the warm weather conducive to permafrost thawing is occurring roughly 70 years ahead of model projections”*",
            "title_similarity": "0.5647397",
            "sentiment_compound": -0.1027
        },
        {
            "id": "h8ac11u",
            "score": 3,
            "text": "If your losing hope or thinking about just offing yourself now, then read this. \n\n\nOur future as a species and a people might seem dark and to be honest it very well might be, but there is always hope. Sure we may all die out but that doesn't change the fact that we can still have hope and love in our hearts. Eventually humans were destined to go extinct, we have what, a few billion years until our Sun expands? Even if we got to Mars and started a colony, it wouldn't change anything unless we figured out a way to leave our solar system and find a new one suitable for life. Something like that would take a long time to figure out. \n\nThe Rich and the selfish, the corrupt politicians and governments, and the violent closed minded individuals will die in fear and in sadness because of the fact their money making ways will be reduced to nothing. That their hateful ways are nothing. They might live longer than us casual folks but all that means is their death will be more painful and rightfully so. \n\nBut the rest of us, the ones who keep their head up, who do their part to heal our Planet, who carry love in their hearts for themselves and others, we will die an honorable death because we would die with love. The best of the human race isnt the top 1%, it's the people who aren't afraid to die, it's the people who'll go out with representing what we could have been and what we still can become. \n\nI know all of this is cheesy but this usually helps me sleep better at night. What I'm going to do, is look forward, be excited to read the new comic books that are coming out, games, movies, completely indulging myself into the things I enjoy. And maybe one day I'll find that special someone to spend the rest of my life with on this planet. \n\n\nSo guys, just enjoy your life, no matter how dark things get, be strong and be a beacon of light for others. Be opened minded and accepting of people, read that new book you've been wanting to read, learn that new skill that you've been thinking about, get that pet or tattoo that you have always wanted, tell the person you have a crush on how you feel. Just live.",
            "title_similarity": "0.5316895",
            "sentiment_compound": 0.9934
        },
        {
            "id": "h8ack6p",
            "score": 1,
            "text": "This next decade is gonna be a hoot, isn't it.",
            "title_similarity": "0.38063297",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8actr8",
            "score": 1,
            "text": "I just watched The Tomorrow War, some methane isn't the worst that could thaw in Siberia.",
            "title_similarity": "0.6900599",
            "sentiment_compound": -0.1546
        },
        {
            "id": "h8ad01c",
            "score": 1,
            "text": "You guys know that Russia wants this, right? Russia has been aggressively supporting pro-pollution policies at home and abroad, precisely because if Siberia thaws, Russia gains literally billions of acres of arable land.",
            "title_similarity": "0.6177391",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8adnm6",
            "score": 1,
            "text": "So basically the earth is farting itself to death. What a way to go.",
            "title_similarity": "0.5268303",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h8aduik",
            "score": 1,
            "text": "Until people houses and communities are on fire, under water, or the air is toxic for months and years, nothing would change, i say, let the wild fires burn out countries, let people think electric cars will “save the planet”, let countries go to war.\n\nFreedom is pollution, choice is waste, six feet under, eco friendly",
            "title_similarity": "0.6883461",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h8aeema",
            "score": 1,
            "text": "Gonna go ahead and put this on the con side of my “do I want to have kids” list.",
            "title_similarity": "0.3300857",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8aeqf3",
            "score": 1,
            "text": "This makes me want to throw myself off a bridge. What's even the point anymore.",
            "title_similarity": "0.37412634",
            "sentiment_compound": 0.0772
        },
        {
            "id": "h8afdxd",
            "score": 1,
            "text": "At this point I’m convinced that you could force politicians, CEOs, shareholders, and consumers to watch and read about all the damning facts twice a week, and they’d still think it’s someone else’s problem to sort out. For how long have we known about what’s coming for us when the permafrost thaws? 15...20 years? And what has been done within this time? And because unregulated capitalism doesn’t rhyme well with environmental equilibrium, we’re all just continuing as if there was no tomorrow.",
            "title_similarity": "0.55876416",
            "sentiment_compound": -0.466
        },
        {
            "id": "h8afeyn",
            "score": 1,
            "text": "It'll be like a giant earth fart that clears the room",
            "title_similarity": "0.5927886",
            "sentiment_compound": 0.4215
        },
        {
            "id": "h8afrh3",
            "score": 1,
            "text": "Everyone knows by now that we are at the end of the tunnel and there is nothing that will prevent this to happen. When you give birth now to a kid you pretty much setting it up to live in climate hell and some pandemic kind of situation where disruption to economy and society just develops stronger and stronger",
            "title_similarity": "0.61038",
            "sentiment_compound": 0.0583
        },
        {
            "id": "h8ag2el",
            "score": 1,
            "text": "Oh how refreshing some bad news for a change",
            "title_similarity": "0.29732257",
            "sentiment_compound": -0.5423
        },
        {
            "id": "h8aglj1",
            "score": 1,
            "text": "Ya we’ve known this for quite a few years unfortunately",
            "title_similarity": "0.09389582",
            "sentiment_compound": -0.34
        },
        {
            "id": "h8ai3je",
            "score": 1,
            "text": "We really need to change our primary source of fuel.  Switzerland is doing incredible. Apparently, 50% of the countries energy is from wind and the other from nuclear power.",
            "title_similarity": "0.5873995",
            "sentiment_compound": 0.2732
        },
        {
            "id": "h8aicwv",
            "score": 7,
            "text": "The paper this references is pretty egregiously bad. Their methane retrieval dataset is PULSE which is explicitly a visualization tool not useable for individual source identification. They use rolling monthly averages which are not useable for this type of plume identification, you need a higher sampling frequency. The time series they show also has several images without change because PULSE didn’t have new data for those periods. On top of that the “plume” they focus on is an albedo artifact that is reasonably well studied and characterized. This paper is going to need to be retracted.\n\nThis topic is important but the work presented here is just not at all usable and shouldn’t be taken with any degree of seriousness in its conclusions.\n\nEdit: here’s a Twitter thread that goes through the issues in more detail: https://twitter.com/carBenPoulter/status/1422373962844082178\n\nAnd here’s a paper on the albedo feature (fig. 15): https://acp.copernicus.org/articles/21/5117/2021/",
            "title_similarity": "0.5540504",
            "sentiment_compound": 0.2263
        },
        {
            "id": "h8ajnqs",
            "score": 1,
            "text": "So many of these climate bombs have been announced over the years. Have any detonated yet?",
            "title_similarity": "0.4581222",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8akjsx",
            "score": 1,
            "text": "At this point it's a race to see if the old guard policy makers who let things get to this point will die and let us fix their mess before everyone dies",
            "title_similarity": "0.48308066",
            "sentiment_compound": -0.7506
        },
        {
            "id": "h8ang0b",
            "score": 1,
            "text": "can we capture this methane and use it instead?",
            "title_similarity": "0.64639056",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8anjb4",
            "score": 1,
            "text": "oh look its the end of downsizing",
            "title_similarity": "0.13481516",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8anowk",
            "score": 1,
            "text": "Can anyone eli5 with the least bias possible, who are the biggest responsible of this that we can tell to stop or slow down some activities unnecessary to our survival that would help the situate immensely, and who has the power to stop them? (how, why do they do nothing?)",
            "title_similarity": "0.40574068",
            "sentiment_compound": 0.3085
        },
        {
            "id": "h8anvdm",
            "score": 2,
            "text": "Maybe the solution to Climate Change Is wealth equality. These idiots and power are probably insulated from all this because they think they're going to buy their way out,. \n\nWe should be working to remove billionaires from society.",
            "title_similarity": "0.57787037",
            "sentiment_compound": 0.6705
        },
        {
            "id": "h8ap9yt",
            "score": 3,
            "text": "Yo didn’t one of these things kill like an entire village but no one knew outside the village because EVERYONE suffocated?",
            "title_similarity": "0.36056307",
            "sentiment_compound": -0.5994
        },
        {
            "id": "h8aqp3t",
            "score": 2,
            "text": "Wait..oh ya forgot the permafrost warnings this year, add it to the menu of we are fucked..takeout only.",
            "title_similarity": "0.41883194",
            "sentiment_compound": -0.296
        },
        {
            "id": "h8av22v",
            "score": 1,
            "text": "we've been hearing about this for like 40 years. the methane craters are already a thing. IDK what else there is to say that this point about it because clearly the mainstream community, indeed concerned about climate change, keeps sweeping this one away.",
            "title_similarity": "0.6472511",
            "sentiment_compound": 0.4708
        },
        {
            "id": "h8awo55",
            "score": 1,
            "text": "Alaska also has permafrost, and UAA Fairbanks has been studying this for years.",
            "title_similarity": "0.34530848",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8axuku",
            "score": 1,
            "text": "Would it be possible to find a catalyst that causes methane to react with air (forming the less harmful CO2) without requiring much maintenance/external energy supply? Could this be used to mitigate emissions either locally or globally?",
            "title_similarity": "0.56602395",
            "sentiment_compound": 0.3527
        },
        {
            "id": "h8aygql",
            "score": 1,
            "text": "So Earth is about to fart and we are trapped under the covers?",
            "title_similarity": "0.6013606",
            "sentiment_compound": -0.5267
        },
        {
            "id": "h8ayt3z",
            "score": 1,
            "text": "Life up north, atleast I can probably start growing vegetables outside",
            "title_similarity": "0.2325938",
            "sentiment_compound": 0.1779
        },
        {
            "id": "h8b1h7n",
            "score": 2,
            "text": "I have a question. \n\nIf we suddenly became global net carbon tomorrow, would the heating we've already been locked in to cause the permafrost to melt anyhow?",
            "title_similarity": "0.7362056",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8b2h1v",
            "score": 1,
            "text": "With any luck, the timebomb blows up putin.",
            "title_similarity": "0.65636396",
            "sentiment_compound": 0.4588
        },
        {
            "id": "h8b4jrd",
            "score": 3,
            "text": "We don’t care lalalala, I’m covering my ears I can’t hear this lalalala. Are the scary scientists gone yet?",
            "title_similarity": "0.41885042",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8b7hts",
            "score": 1,
            "text": "At what point do we start looking into Geo-Engineering solutions? I know most large-scale carbon-capture tech is still a few decades out, but there have been other proposals too (the most notable one I can think of with no extra research is that one about releasing volcanic sand into the atmosphere to artificially cool the planet by blocking out the sunlight by 1-2%). \n\nIt’s clear prevention has failed. When do we start looking into how to actually reverse things?",
            "title_similarity": "0.6011673",
            "sentiment_compound": -0.6497
        },
        {
            "id": "h8b7vep",
            "score": 1,
            "text": "I might finally have a chance to be king",
            "title_similarity": "0.21626566",
            "sentiment_compound": 0.25
        },
        {
            "id": "h8b8wdb",
            "score": 2,
            "text": "At this point we need a giant Times Square countdown sequence to the predicted doom of mankind from Climate neglect. And I'm talking about the point where there's no saving it or turning back, and that our fate is inevitable. Time will be added if we can stop certain pollution and removed otherwise. People need visuals, constant reminders, etc. Also an accountability list, with names of the people and their families responsible for the corporations causing the most harm. Put their pictures on billboards, and Jumbotron screens all over the world. Put the heat on them that they're doing to the world.",
            "title_similarity": "0.7111002",
            "sentiment_compound": -0.8588
        },
        {
            "id": "h8b9h3a",
            "score": 2,
            "text": "I wish I was aborted now",
            "title_similarity": "0.25638297",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8ba3ro",
            "score": 2,
            "text": "Ok, get outside work on cardio and do your sit-ups mad Max time is coming",
            "title_similarity": "0.40094987",
            "sentiment_compound": -0.4939
        },
        {
            "id": "h8bar6w",
            "score": 1,
            "text": "Real talk now. Should we detect and burn the methane vents as they pop up?\n\nMethane burns into CO2 and H20. And CO2, while not great, is far better for the atmosphere than methane.",
            "title_similarity": "0.70064914",
            "sentiment_compound": -0.1012
        },
        {
            "id": "h8bbobq",
            "score": 1,
            "text": "The only positive from this is methane only stays in the atmosphere for 9 years. But is 21 times more powerful as a greenhouse gas than carbon dioxide. Be interesting to know if burning the methane off and turning it to co2 is better or worse for the environment.",
            "title_similarity": "0.6205268",
            "sentiment_compound": 0.8654
        },
        {
            "id": "h8bckqd",
            "score": 1,
            "text": "The good news is that methane is not very persistent in the atmosphere. The bad news is, it is 80x more powerful than CO2 as a greenhouse gas while it lasts.",
            "title_similarity": "0.4793239",
            "sentiment_compound": 0.3597
        },
        {
            "id": "h8bg7xb",
            "score": 1,
            "text": "Can't we just set it on fire when it's released? Like an earth fart.",
            "title_similarity": "0.6699123",
            "sentiment_compound": 0.0258
        },
        {
            "id": "h8bjszx",
            "score": 1,
            "text": "I wonder what ancient viruses and pathogens are lurking dormant below the surface there, waiting for the day when their thaw comes and the next involuntary host comes along to carry them around the world..",
            "title_similarity": "0.581527",
            "sentiment_compound": -0.128
        },
        {
            "id": "h8bk4nj",
            "score": 2,
            "text": "Not a climate scientist but can’t shake the thought that after the last 100 years of spewing all the CO2 and methane that’s been locked away for many millions of years, we are setting ourselves up for Permian-Triassic extinction, Part 2, Directors Cut.",
            "title_similarity": "0.6649126",
            "sentiment_compound": -0.5719
        },
        {
            "id": "h8blyo2",
            "score": 1,
            "text": "So anyone wanna take bets on what will kill everyone first? Winner gets to clean up the mess",
            "title_similarity": "0.54456544",
            "sentiment_compound": -0.1779
        },
        {
            "id": "h8bnflr",
            "score": 3,
            "text": "Good thing Elon is building a rocket to allow rich people to leave earth once we've trashed it.",
            "title_similarity": "0.6652664",
            "sentiment_compound": 0.802
        },
        {
            "id": "h8brug7",
            "score": 2,
            "text": "End of the world party at my house? \n\nEdit: bring your own ice.",
            "title_similarity": "0.44232273",
            "sentiment_compound": 0.4019
        },
        {
            "id": "h8c4gdq",
            "score": 1,
            "text": "As ive grew up over the years born in 93\" ive noticed a hotter qeather pattern over the years and since 2005 its been hotter and hotter with a few years being alright",
            "title_similarity": "0.41055772",
            "sentiment_compound": 0.25
        },
        {
            "id": "h8cf3h1",
            "score": 2,
            "text": "The excellent James Burke's Connections TV series covered all this.  Methane, the Atlantic Ocean currents, all of it.  From 1978.  We are truly doomed if we fail to learn what science tells us.",
            "title_similarity": "0.6806634",
            "sentiment_compound": -0.2732
        },
        {
            "id": "h8ch2o6",
            "score": 2,
            "text": "You mean WARNED. Scientists have been warning about the Siberian thawing for a great many years.",
            "title_similarity": "0.51525426",
            "sentiment_compound": -0.0343
        },
        {
            "id": "h8cm93i",
            "score": 1,
            "text": "Goodbye humans I'll never meet. Our species is done.",
            "title_similarity": "0.2898798",
            "sentiment_compound": 0.0
        },
        {
            "id": "h8d8uyp",
            "score": 1,
            "text": "Can someone put this in laymen’s terms? What is happening? And how bad is it?",
            "title_similarity": "0.3425703",
            "sentiment_compound": -0.6174
        },
        {
            "id": "h8m00fh",
            "score": 1,
            "text": "It is still physically possible (~60% shot) to prevent long-term apocalyptic outcomes if we enact worldwide emergency measures starting now. The odds get worse the more we delay or act half-heartedly.\n\nNow, if you only care about *your* lifetime experiences then no, there's no hope whatsoever, because we've locked in enough warming and pushed our biogeochemical flows such that, even if we stopped all emissions post-haste, planetary conditions will continue to degrade for the remainder of your life. Like sure we could go renewables + nuclear worldwide, redistribute wealth, \"humanely\" curb population growth, go vegan, ban cars and planes, etc, and with all that working out then towards the end of your life you might get to see the temperature curve start to plateau around 2°C... which is equivalent to a nightmarish hellworld where every fortnight will reveal a new and hitherto unthinkable tragedy.\n\nBut! A few generations after that people might get to stabilize the biosphere and adapt to its new conditions, so what we do now definitely matters.",
            "title_similarity": "0.71975255",
            "sentiment_compound": -0.508
        },
        {
            "id": "h8udrt2",
            "score": 1,
            "text": "When it happens it’ll turn political , everybody blaming everybody. Nobody doing anything to change it.",
            "title_similarity": "0.41244292",
            "sentiment_compound": -0.4939
        }
    ]
}