{
    "Feeling like leisure is wasteful and unproductive may lead to less happiness and higher levels of stress and depression, new research suggests (Four studies, n = 1310)\n": [
        {
            "id": "ha0te72",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.55508614",
            "sentiment_compound": 0.7088
        },
        {
            "id": "ha14u96",
            "score": 7,
            "text": "I think this paper is really ignoring the fact that happiness is completely subjective.  Some people are motivated by their work, some are not.  I know I am happiest after a job well done.  Once I'm done building my deck/painting my room/fixing the door/etc, it's supremely the happiest I'll be.  Sitting on a beach on vacation is the most inanely boring pursuit I can come up with, and travel is more stressful than going into the office every day.",
            "title_similarity": "0.59324276",
            "sentiment_compound": 0.9124
        },
        {
            "id": "ha1551g",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.26556093"
        },
        {
            "id": "ha18yar",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.29341704"
        },
        {
            "id": "ha106zh",
            "score": 141,
            "text": "[removed]",
            "title_similarity": "0.26556093"
        },
        {
            "id": "ha23j4t",
            "score": 0,
            "text": "“Feeling like leisure ISN’T wasteful and unproductive may lead to less happiness and higher levels of stress and depression, common sense suggests”",
            "title_similarity": "0.8371501",
            "sentiment_compound": -0.1761
        },
        {
            "id": "ha0yh6q",
            "score": 47,
            "text": "[removed]",
            "title_similarity": "0.26556093"
        },
        {
            "id": "ha1eyw0",
            "score": 13,
            "text": "Everyone I've met that is like this had a history of child abuse/neglect. \n\nI think it's time we figure out how to teach people to be parents instead of just encouraging them to reproduce indiscriminately.",
            "title_similarity": "0.52459896",
            "sentiment_compound": 0.7096
        },
        {
            "id": "ha18pyo",
            "score": 4,
            "text": "I never feel like I work enough. I slack off more than i should because reddit is always at the computer and the work I do drains me. it should be a passion project, the thing I'm working on, but I feel no love for it. I don't deserve breaks if I can't even tear myself away from this godforsaken website for a dopamine hit.",
            "title_similarity": "0.6092053",
            "sentiment_compound": -0.6258
        },
        {
            "id": "ha1ksvl",
            "score": 0,
            "text": "How do I report this? It has me in it and I don’t like it.",
            "title_similarity": "0.53368384",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha1lfyw",
            "score": 0,
            "text": "The 3 best things you can do at work are:\n1. Stand up\n2. Walk out the door\n\n3. And never go back",
            "title_similarity": "0.307804",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ha1u0z7",
            "score": 0,
            "text": "Everything in moderation.  If I feel like taking time off I take it off. I don’t need a three day weekend every weekend.",
            "title_similarity": "0.4344726",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha26xgs",
            "score": 0,
            "text": "Well, it depends... What is the definition of leisure ? Sitting at home and doing jack all will get you depressed.\nOn the other hand going camping or writing some music on my time off feels rewarding.",
            "title_similarity": "0.6295386",
            "sentiment_compound": 0.6597
        },
        {
            "id": "ha15yh7",
            "score": 14,
            "text": "I always try a tell ppl who like to work as many hours as they can…your personal time have a greater value than work time. Once you understand that concept everything becomes easier",
            "title_similarity": "0.5107681",
            "sentiment_compound": 0.8481
        },
        {
            "id": "ha14m0s",
            "score": 1,
            "text": "This is very insightful. I wonder how this relates to a stoic frame of mind vs. a hedonistic one.",
            "title_similarity": "0.5270752",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1757a",
            "score": 1,
            "text": "Does anyone really think that leisure is wasteful though? Having other things that you prioritize or things that you need to get done isn't really the same thing as thinking leisure is wasteful. Prioritizing different things isn't really the same as disliking leisure... I'm in an industry that is fairly well known for \"hustle culture\" or whatever you want to call it, where we very rarely work less than 60 and frequently work 70-80 hour weeks, but I genuinely don't think I know a single person who would say that leisure is wasteful or unproductive.",
            "title_similarity": "0.6548703",
            "sentiment_compound": 0.0129
        },
        {
            "id": "ha1j0lh",
            "score": -1,
            "text": "I can understand that. It is why I have a pseudo standing desk. While I'm relaxing chatting with my friends Im also walking on the treadmill! Healthy and spending time with them. Win win!",
            "title_similarity": "0.2615603",
            "sentiment_compound": 0.953
        },
        {
            "id": "ha1uoba",
            "score": 1,
            "text": "Time doing anything that makes you happy is never wasted. It's just a way of working on your mental health",
            "title_similarity": "0.3965879",
            "sentiment_compound": 0.7452
        },
        {
            "id": "ha23gbv",
            "score": -1,
            "text": "When a person lacks a deep sense of meaning, they distract themselves with pleasure - Viktor Frankel",
            "title_similarity": "0.6636052",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha153u5",
            "score": -9,
            "text": "Asian researchers for sure.",
            "title_similarity": "0.19259687",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha1299a",
            "score": 68,
            "text": "[removed]",
            "title_similarity": "0.26556093"
        },
        {
            "id": "ha17bx1",
            "score": 11,
            "text": "That is exactly the emotional state these Protestant ethics toward work are supposed to instill in people. \n\nThis was never a secret.",
            "title_similarity": "0.2883147",
            "sentiment_compound": 0.1531
        },
        {
            "id": "ha1crj0",
            "score": 3,
            "text": "Explains Japan and their high rates of depression and suicide?",
            "title_similarity": "0.5394585",
            "sentiment_compound": -0.8481
        },
        {
            "id": "ha1cxjo",
            "score": 3,
            "text": "Sorry you feel like leisure is wasteful. Your thought process is the issue not Buddha sitting under a tree doing nothing with a smile.",
            "title_similarity": "0.6189966",
            "sentiment_compound": 0.0232
        },
        {
            "id": "ha20472",
            "score": 4,
            "text": "This article has good points but the bigger problem I see is that many people feel like they have to constantly be productive to justify their existence on earth. \"If you're not productive you don't deserve to live\" is the message I got throughout my life and it hurts! Look at how north America treats the homeless and tell me I'm wrong.",
            "title_similarity": "0.6207353",
            "sentiment_compound": -0.8378
        },
        {
            "id": "ha2mil0",
            "score": 3,
            "text": "I feel like these studies would get different results in different cultures. Western culture is so hyperfocused on utilitarian valuation of time and people that it might bias results.  \n\nI bet some more laid back indigenous cultures would not value productivity the same way.\n\nIf you ask me utilitarianism is a good way to value tools and systems but not necessarily holisticly complex beings like people.",
            "title_similarity": "0.72985184",
            "sentiment_compound": 0.7124
        },
        {
            "id": "ha1awhj",
            "score": 4,
            "text": "My life now. Did not expect to become part of the statistics at almost 30...",
            "title_similarity": "0.5266906",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1was9",
            "score": 5,
            "text": "\nPretty sure \"Feeling like leisure is wasteful and unproductive\" is not something that people would naturally end up at, and maybe is pushed on others by certain people and environments..\n\nHmm whoda thunk?",
            "title_similarity": "0.7102361",
            "sentiment_compound": 0.8625
        },
        {
            "id": "ha23cey",
            "score": 5,
            "text": "Wait, a core tenet of capitalism causes higher levels of stress and depression?! Who would have guessed!!",
            "title_similarity": "0.6474111",
            "sentiment_compound": -0.8114
        },
        {
            "id": "ha109mn",
            "score": 130,
            "text": "[deleted]",
            "title_similarity": "0.293417"
        },
        {
            "id": "ha1brgm",
            "score": 6,
            "text": "Ive felt this before, cant enjoy things you used to. Constantly thinking you need to be improving or earning. Its a battle to enjoy the little things, but thats whats important at the end of the day. Of course its nice being successful financially, but I believe the whole point of being successful for me is having free time for hobbies, experiences and laughter",
            "title_similarity": "0.63055116",
            "sentiment_compound": 0.9807
        },
        {
            "id": "ha1f11h",
            "score": 6,
            "text": "What if I do nothing but leisure? How happy would I be then?\n\n\n r/antiwork",
            "title_similarity": "0.5275025",
            "sentiment_compound": 0.7514
        },
        {
            "id": "ha1f434",
            "score": 6,
            "text": "I was this way 100%. I wanted to be a filmmaker, then I settled on being a YouTuber. Kept grinding and grinding, spending my nights alone and disappointed with the results of my channel and then I met a girl which made me want to have a stable career. Meanwhile I tried to do the YouTube thing on the side and overall was just miserable. Early this year I just said to hell with it, will focus on my career and being the best partner I could be. I’m finally gaming again and just overall enjoying life. Grinding is definitely a young man’s game. Now, I just want to hang out with my partner and play games when I can. Happier now than ever before.",
            "title_similarity": "0.5285872",
            "sentiment_compound": 0.7184
        },
        {
            "id": "ha1rrpu",
            "score": 6,
            "text": "There's a lot of attempts to pathologize not being able to check out of work in this thread, but let's not forget that societal leisure time is actually indebted to the labour movement. It was the power of unions to protect workers' from the penalties associated with taking time for themselves – ensuring they couldn't be fired or demoted, and that leisure was a right of working people and not not just of elites – that made for a unique period of private time. Before the American industrial labour movement gained real traction in the early 20th century, most people didn't have the expectation of having much time for themselves. And now, the industries that are driving the modern economy have a swirling pit of gig or contract labour that purposefully isolates those doing this work while signalling to the professional classes to work hard on employers' terms or suffer the consequences. \n\nSo yeah, without an organized movement capable of materially defending the idea that leisure belongs to everyone and is important, it's not a surprise that many find it a stressful concept.",
            "title_similarity": "0.6008821",
            "sentiment_compound": 0.83
        },
        {
            "id": "ha18g0h",
            "score": 35,
            "text": "Balancing your work and personal life is important. It never hurts to take a break.",
            "title_similarity": "0.33569095",
            "sentiment_compound": 0.5194
        },
        {
            "id": "ha12g0v",
            "score": 7,
            "text": "I like the picture of the guy with a 1980s phone depicts how business is run.",
            "title_similarity": "0.32025057",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha16vpn",
            "score": 99,
            "text": "[removed]",
            "title_similarity": "0.26556093"
        },
        {
            "id": "ha188m1",
            "score": 19,
            "text": "Did they factor in the fact that most workplaces unofficially punish you for going on vacation?",
            "title_similarity": "0.5912128",
            "sentiment_compound": -0.5667
        },
        {
            "id": "ha16z16",
            "score": 107,
            "text": "For many Americans this would be a very difficult habit to break. The culture partly originates from a core beliefs stemming from the \"protestant work ethic\". Idle hands are the devil's play things and such.\n\nTo accept this change would require them to reject a part of their religion.",
            "title_similarity": "0.594528",
            "sentiment_compound": -0.1263
        },
        {
            "id": "ha22a45",
            "score": 7,
            "text": "Yes, more reason to hate capitalism! \nMan I called this since I was a kid, and loathed the idea that when I grow up I wouldn’t have time to do things I want to anymore",
            "title_similarity": "0.56771564",
            "sentiment_compound": -0.6548
        },
        {
            "id": "ha17oaz",
            "score": 122,
            "text": "[removed]",
            "title_similarity": "0.2655609"
        },
        {
            "id": "ha140gd",
            "score": 8,
            "text": "I feel personally attacked.",
            "title_similarity": "0.29648268",
            "sentiment_compound": -0.4588
        },
        {
            "id": "ha1d3fm",
            "score": 29,
            "text": "It boggles my mind that people are like this. Sitting around and doing nothing is the goal. We work so we can achieve more of this goal.\n\n\"The mark of a successful man is one who has spent an entire day on the bank of a river without feeling guilty about it\"",
            "title_similarity": "0.39373517",
            "sentiment_compound": 0.8054
        },
        {
            "id": "ha17k07",
            "score": 44,
            "text": "[removed]",
            "title_similarity": "0.26556093"
        },
        {
            "id": "ha18c5e",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.26556093"
        },
        {
            "id": "ha17tsb",
            "score": 77,
            "text": "My fiancée is like this. If she spends a weekend day reading and laying around instead of running all over the place trying to get things done she freaks out. She busts her ass all week at work and sees relaxing as wasteful. Half the time she says she doesn’t even enjoy it",
            "title_similarity": "0.5900432",
            "sentiment_compound": 0.6124
        },
        {
            "id": "ha19mmt",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "0.26556093"
        },
        {
            "id": "ha13lyk",
            "score": 329,
            "text": "Leisure is the whole point of life, you spend time being productive so you can spend it however you want after youre done.\n\nUnless you consider it your duty to be productive and are willing to sacrifice your own happyness for it, but thats a personal choice.",
            "title_similarity": "0.49838364",
            "sentiment_compound": 0.0387
        },
        {
            "id": "ha18wvc",
            "score": 22,
            "text": "no lie. when you find a way to make even your recharge time a chore, you’re done",
            "title_similarity": "0.43301263",
            "sentiment_compound": -0.296
        },
        {
            "id": "ha12g58",
            "score": 784,
            "text": "You have a whole toxic hustle culture being pushed through Influencers/Gurus etc who would have you flat to the mat 24/7/365",
            "title_similarity": "0.467054",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha11x4h",
            "score": 78,
            "text": "[removed]",
            "title_similarity": "0.26556093"
        },
        {
            "id": "ha0u6cw",
            "score": 2362,
            "text": "There is a great course, free on Coursera, (I think it's called) The Science of Happiness, Dr. Laurie Santos.  No graded homework or anything like that.  I advise anyone who is lacking this balance in their lives to check it out.  Or basically anyone should check it out!\n\n\nEdit:  The course is https://www.coursera.org/learn/the-science-of-well-being\n\nCredit and thank you to u/ButaneLilly for finding the link!",
            "title_similarity": "0.46886244",
            "sentiment_compound": 0.9515
        },
        {
            "id": "ha1d3bj",
            "score": 245,
            "text": "My mom instilled this in me. Get one thing productive done every single day. I have a love hate relationship with this ideology, but yesterday in a pit of depression I stayed home and streamed movies I've been wanting to see all day and watched 4 movies. Best I've felt in a long time.",
            "title_similarity": "0.49746642",
            "sentiment_compound": 0.25
        },
        {
            "id": "ha0tok8",
            "score": 331,
            "text": "In the Journal of Experimental Social Psychology: [https://www.sciencedirect.com/science/article/abs/pii/S0022103121001013](https://www.sciencedirect.com/science/article/abs/pii/S0022103121001013)\n\nFull abstract:\n\nEngagement in leisure offers a host of benefits for mental and physical health, yet many people view leisure as wasteful and unproductive. Four studies (n = 1310) demonstrate that believing leisure is wasteful undermines enjoyment of enacted leisure activities. Studies 1 and 2 document that people with a general tendency to find leisure wasteful report lower enjoyment of leisure activities on average, especially terminally-motivated leisure (performed as an end in itself) compared to instrumentally-motivated leisure (performed as a means to an end). The belief that leisure is wasteful is also associated with poorer mental health outcomes, including lower reported happiness, and greater reported depression, anxiety, and stress. Establishing causality, Studies 3 and 4 show that priming the belief that leisure is wasteful or unproductive reduces enjoyment of terminally-motivated leisure activities; unfortunately, priming the belief that leisure is productive does not increase enjoyment. We discuss implications for maximizing hedonic utility and well-being.",
            "title_similarity": "0.79053414",
            "sentiment_compound": 0.1813
        },
        {
            "id": "ha1ag1s",
            "score": 132,
            "text": "Welcome to chapter 2 of \"My Life With ADHD\".  For those like me, this topic is a bit of a double-edged sword   Some of us find it extremely difficult to really relax, myself included.  I'm a \"Do-er\", and it's often extremely uncomfortable sitting still unless I'm actively engaged in something. I don't watch TV by myself, but will if it's with someone else for a little while.  But then I can game hours on end, since I'm not just a spectator.\n\nAnd here's the crux: I know I NEED to actually relax since always going just burns me out, but I can't usually just relax because my mind just keeps on truckin'.  It's like a racehorse need to just run, so it actually takes effort and energy just to relax.\n\nMindfulness, proper sleep/diet, and medication can do wonders, but I still have to actively NOT be busy.  This is a slightly different take on the article, but I can tell you that stress, depression, anxiety, destructive perfectionism and all sorts of other garbage hitchhike on that ride.  For me it's one of those \"well THAT'S obvious\" studies that I know still needed to be done.",
            "title_similarity": "0.6414501",
            "sentiment_compound": 0.6422
        },
        {
            "id": "ha162nn",
            "score": 1429,
            "text": "I live somewhere where free time and leisure is highly valued. (Extremely rare to see people left in the office after 4pm). So that makes me wonder if people in different countries / cultures view leisure differently. Is it less valued in Japan than Spain for instance?\n\nEdit: I live in Norway",
            "title_similarity": "0.62193596",
            "sentiment_compound": 0.8442
        },
        {
            "id": "ha1esef",
            "score": 405,
            "text": "I live for this quote: \"the time you enjoy wasting is not wasted time\".",
            "title_similarity": "0.33936286",
            "sentiment_compound": 0.4815
        },
        {
            "id": "ha12mkp",
            "score": 1748,
            "text": "[removed]",
            "title_similarity": "0.26556093"
        },
        {
            "id": "ha16h3j",
            "score": 1,
            "text": "I just try to find enjoyment in useful, productive activities.  I like cleaning and organizing my house and workspace, for example.",
            "title_similarity": "0.3325519",
            "sentiment_compound": 0.8402
        },
        {
            "id": "ha17dq7",
            "score": 12,
            "text": "A key component of **Obsessive Compulsive Personality Disorder** is: \n\n* Individuals with OCPD devote themselves to work and productivity at the expense of interpersonal relationships and recreation. Economic necessity, such as poverty, cannot account for this behavior.\n\nThe alternative dimensional model for personality disorders (detailed in the appendix of DSM-5) takes a spectrum approach to personality disorder symptomology as opposed to the dichotomous approach (diagnosis or non-diagnosis) \n\nIt would interesting to see how these research subjects reflect (on a dimensional level) with other criteria considered components of this disorder.\n\n(Granted: overachieving and attributable components may be over expressed, situationally, for college students the primary research subjects)",
            "title_similarity": "0.70171547",
            "sentiment_compound": -0.7667
        },
        {
            "id": "ha18rg3",
            "score": 13,
            "text": "I definitely feel that at times. Having to be in constant motion physically or mentally is exhausting, and occasionally leads to drowning my sorrows (or the noise).",
            "title_similarity": "0.58362865",
            "sentiment_compound": -0.34
        },
        {
            "id": "ha18wsd",
            "score": 5,
            "text": "People need to synthesize like plants.",
            "title_similarity": "0.29727829",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha196ba",
            "score": 11,
            "text": "Yeah, I'm like this and I need to learn to stop. Anytime my wife makes me go away on a day trip or a vacation, I spend most of the time thinking \"I could be doing this or getting this done or...\" I just feel I need a month off of life to spend time catching up on chores and maintenance :(",
            "title_similarity": "0.48373345",
            "sentiment_compound": -0.1027
        },
        {
            "id": "ha19akf",
            "score": 2,
            "text": "Is this my mother? And in turn me? Yes.",
            "title_similarity": "0.21754615",
            "sentiment_compound": 0.4696
        },
        {
            "id": "ha19yt5",
            "score": 4,
            "text": "I hope the research consisted of taking off all the time they would have wasted on something so obvious and then reporting the results afterwards.",
            "title_similarity": "0.49236345",
            "sentiment_compound": -0.0772
        },
        {
            "id": "ha1a4sk",
            "score": 16,
            "text": "That's why I avoid work as much as possible",
            "title_similarity": "0.51229274",
            "sentiment_compound": -0.296
        },
        {
            "id": "ha1ad3g",
            "score": 7,
            "text": "I struggle with this. If I spend a Saturday afternoon playing video games then I feel like I “wasted” it by not being productive. I don’t like that mindset because I do like playing video games, just there is that mental block sometimes.",
            "title_similarity": "0.62297404",
            "sentiment_compound": 0.5994
        },
        {
            "id": "ha1bbka",
            "score": 1,
            "text": "I work with a guy that likes to work in his free time - like he wants to make more money so he maximizes in areas he feels he can (real-estate or sales) - I feel like this is similar but his enjoyment of his leisure comes with being able to work.",
            "title_similarity": "0.49303845",
            "sentiment_compound": 0.8873
        },
        {
            "id": "ha1bmzg",
            "score": 2,
            "text": "So...how do I get help with this? I can't relax even if I try. I seriously hate my life because of it.",
            "title_similarity": "0.54622054",
            "sentiment_compound": -0.6256
        },
        {
            "id": "ha1bxm3",
            "score": 2,
            "text": "I’m definitely that way. Often feel guilty when I’m just chilling out.",
            "title_similarity": "0.5717224",
            "sentiment_compound": -0.0516
        },
        {
            "id": "ha1c116",
            "score": 2,
            "text": "Someone tell my dad this. I always ask him  what is all the work and effort for if not to enjoy your life when you can? We aren't machines in a factory, our worth is not linked to our economic productivity and that is a poor reflection of a life well spent.",
            "title_similarity": "0.50609684",
            "sentiment_compound": -0.4075
        },
        {
            "id": "ha1c92c",
            "score": 3,
            "text": "Ha! Jokes on you! I *indulge* in leisure. So I am, deliberately, unproductive.",
            "title_similarity": "0.52667797",
            "sentiment_compound": 0.3786
        },
        {
            "id": "ha1cc2e",
            "score": 1,
            "text": "I feel like this all the time. I blame childhood trauma",
            "title_similarity": "0.32793894",
            "sentiment_compound": -0.4019
        },
        {
            "id": "ha1ch8i",
            "score": 2,
            "text": "The thing that helped me not feel guilty about relaxing is better managing my tasks. If I have something to do I'll write it down on a task list and give it a realistic due date. Even if I can remember it in my head, I'll still write it down. The benefit is that I can look at the list and say \"I don't need to be productive right now because all my tasks for the day are already finished.\" And because I write everything down, there's no more \"I must be forgetting something\" either.",
            "title_similarity": "0.52335227",
            "sentiment_compound": 0.8493
        },
        {
            "id": "ha1cno6",
            "score": 2,
            "text": "I've seen this and it seems to be a chicken and egg problem to me, people who are stressed and depressed feel they don't deserve to relax.",
            "title_similarity": "0.64814365",
            "sentiment_compound": -0.8691
        },
        {
            "id": "ha1cnui",
            "score": 1,
            "text": "Hi everyone, spent every week with a psychologist this year on topics like these, feel free to DM me if you need a sounding board",
            "title_similarity": "0.25838187",
            "sentiment_compound": 0.7003
        },
        {
            "id": "ha1coi7",
            "score": 1,
            "text": "Who would have guessed that :O",
            "title_similarity": "0.20962265",
            "sentiment_compound": -0.2808
        },
        {
            "id": "ha1cy5x",
            "score": 2,
            "text": "Welcome to my midwest protestant upbringing!  I loved to read as a kid, and my dad would say, reading's good, but as a means to an end, not as an end in itself.",
            "title_similarity": "0.4564632",
            "sentiment_compound": 0.69
        },
        {
            "id": "ha1d8pz",
            "score": 1,
            "text": "This explains my boss",
            "title_similarity": "0.25367403",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1d9ue",
            "score": 1,
            "text": "If you enjoy something in moderation it isn't a 'waste of time'. That phrase has become too common.",
            "title_similarity": "0.49068493",
            "sentiment_compound": 0.6738
        },
        {
            "id": "ha1de49",
            "score": 4,
            "text": "Stuff like this makes me feel guilty that I don't seem to enjoy television, video games, or slacking off the way I used to.  Instead I find it less painful to work on my house.",
            "title_similarity": "0.7161124",
            "sentiment_compound": -0.6741
        },
        {
            "id": "ha1dfiw",
            "score": 8,
            "text": "*cries in American worker*",
            "title_similarity": "0.3054856",
            "sentiment_compound": -0.4019
        },
        {
            "id": "ha1dfko",
            "score": 17,
            "text": "Leisure is what I worked so hard for from the age of 18  through 55.  I ended up with serious cancer and retired at 56 moved to the S.W. Coast of Florida and life is so much better.  I don’t know how much longer I’ve got to live but every day is a Sunday!",
            "title_similarity": "0.45370916",
            "sentiment_compound": -0.3582
        },
        {
            "id": "ha1dgc0",
            "score": 1,
            "text": "I mean, I'd be surprised if it didn't",
            "title_similarity": "0.43699104",
            "sentiment_compound": 0.2263
        },
        {
            "id": "ha1dhu2",
            "score": 1,
            "text": "I'm kind of skeptical of this article. \n\nOn one hand, yeah, it's a good reminder that leisure attached to a bigger goal is more meaningful. We only have so much time in our lives. As I get older, I'm finding it harder to justify a few hours of playing video games outside the context of intentional unplugging \"self-care\" time. I'm much more interested in helping my wife take care of our kid.\n\nSo it's not surprising to me that people who had value-added experiences attached to their Halloween celebration had a more positive view of their leisure time. I'm going to get a pretty low self-satisfaction score for going to the park by myself. Going to the park with my son and taking him on a swing is going to be much higher.",
            "title_similarity": "0.65704256",
            "sentiment_compound": 0.9669
        },
        {
            "id": "ha1dl0z",
            "score": 1,
            "text": "Please do one on Feeling like work is wasteful and unproductive may lead to .....?\n\n>happiness",
            "title_similarity": "0.6442356",
            "sentiment_compound": 0.836
        },
        {
            "id": "ha1dlag",
            "score": 1,
            "text": "This is a confusing title; it really should be \"Thinking that leisure is...\"",
            "title_similarity": "0.5430045",
            "sentiment_compound": -0.2263
        },
        {
            "id": "ha1dr2k",
            "score": 1,
            "text": "/r/notmeirl \n\nOne thing I’ll never be accused of is not enjoying my time off.",
            "title_similarity": "0.4796009",
            "sentiment_compound": -0.2235
        },
        {
            "id": "ha1dw6c",
            "score": 1,
            "text": "Sounds like propaganda",
            "title_similarity": "0.25246507",
            "sentiment_compound": 0.128
        },
        {
            "id": "ha1eae4",
            "score": 1,
            "text": "I live with a partner that thinks this and says it out loud.",
            "title_similarity": "0.2115361",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1ejld",
            "score": 1,
            "text": "I feel like leisure is the only way to live. So anyone that wants to send me on their vacations so you don’t waste your time and get depressed hit me up.",
            "title_similarity": "0.58094543",
            "sentiment_compound": -0.5945
        },
        {
            "id": "ha1eo1g",
            "score": 5,
            "text": "I don't really go on vacation because it feels like that teasing yourself. Like, if you worked harder or smarter this could be your life all the time.\n\nThat being said I'm very happy with my life, and who really wants to explore the world these days?",
            "title_similarity": "0.60091984",
            "sentiment_compound": 0.8932
        },
        {
            "id": "ha1eo2x",
            "score": 2,
            "text": "Hey I just want to say that I was in your shoes when I was 14 as well and felt similarly. Please seek help and get therapy through school or another psychologist. Speaking to a therapist changed my life for the better and helped me process a lot of feelings I couldn't otherwise. They also taught me about meditation and how powerful it can be for treating anxiety and depression. Please seek help especially if you have suicidal thoughts. Life really is amazing you just might need help processing some feelings. Also try your best is school but don't overdo it either. Take some harder classes if you're interested in the subject but even still you don't need to be taking all honors or AP classes etc.",
            "title_similarity": "0.6133337",
            "sentiment_compound": 0.9523
        },
        {
            "id": "ha1f0qv",
            "score": 2,
            "text": "Its probably more likely that being stressed may lead to feeling like taking leisure time to relax is wasteful and unproductive, as that is time that could be used to get something that is causing you stress done.\n\nSource:  Stressed af dude who has struggled for years trying to get the to-do list done, before realising the list is never 'done', and that taking some time for yourself is both necessary and more productive in the long run.",
            "title_similarity": "0.7748463",
            "sentiment_compound": -0.4767
        },
        {
            "id": "ha1f5qd",
            "score": 1,
            "text": "No matter how obvious or relatable the conclusion is, studies with a low \"n\" (number of subjects) *are not representative* of the population being studied, and because of that, cannot produce reliable data.",
            "title_similarity": "0.6173781",
            "sentiment_compound": -0.2201
        },
        {
            "id": "ha1fjvz",
            "score": 2,
            "text": "If i have to see one more super obvious shitbird \"STUDY\" posted that tells me something i could easily have guessed or already noticed about this depressing capitalist, and increasingly fascist dystopian world........ !!!!!",
            "title_similarity": "0.55619586",
            "sentiment_compound": -0.2903
        },
        {
            "id": "ha1fl1z",
            "score": 3,
            "text": "Culture industry by Horkheimer and Adorno, written in 1947 about this topic, great read if you like philosophy and aren't having a bad day.",
            "title_similarity": "0.4697293",
            "sentiment_compound": 0.8573
        },
        {
            "id": "ha1fncm",
            "score": 1,
            "text": "I *knew* there was nothing to be ashamed of playing video games during my shift at work!",
            "title_similarity": "0.20987947",
            "sentiment_compound": 0.5641
        },
        {
            "id": "ha1fnio",
            "score": 1,
            "text": "I haven’t been good at enjoying leisure recently. Not sure why. I think at times I worry about 5-10 years from now me to much. On paper I’m doing fine but I think I need to learn to manage my time better and also do little things that I enjoy outside of my main hobbies and work.",
            "title_similarity": "0.72221494",
            "sentiment_compound": 0.8825
        },
        {
            "id": "ha1g5z7",
            "score": 1,
            "text": "This hits surprisingly close to home",
            "title_similarity": "0.22796464",
            "sentiment_compound": 0.296
        },
        {
            "id": "ha1gb3p",
            "score": 1,
            "text": "25, been out of work for abit now, entered the work force officially at 14, did 30+ hour weeks in highschool.... I feel it today.... I can't relax in my own home despite that being one of my only jobs now.... I feel so guilty.",
            "title_similarity": "0.49167976",
            "sentiment_compound": -0.7203
        },
        {
            "id": "ha1gg51",
            "score": 1,
            "text": "This is me. It’s really interesting how we end up conditioning ourselves to think that. I’m in law school now and a lot of my peers get anxious and stressed when they are not working/studying 24/7. This also leads to a lot of burnout.",
            "title_similarity": "0.5474637",
            "sentiment_compound": -0.1045
        },
        {
            "id": "ha1h8gf",
            "score": 1,
            "text": "Did we really need research on this",
            "title_similarity": "0.35316494",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1hirg",
            "score": 1,
            "text": "Oh what has till world come to",
            "title_similarity": "0.08850971",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1hitq",
            "score": 1,
            "text": "Welp i’m excellent at being useless. I should hold a masterclass",
            "title_similarity": "0.42330027",
            "sentiment_compound": 0.2263
        },
        {
            "id": "ha1hn1z",
            "score": 1,
            "text": "This is me but for some reason I have it worse. I feel like sitting around not being productive is a waste of time so it stresses me out but at the same time that same stress keeps me demotivated and from being productive so I just sit around and curse myself out for not doing anything \n\nBrain don’t work no good I guess",
            "title_similarity": "0.7096988",
            "sentiment_compound": -0.9705
        },
        {
            "id": "ha1hwzy",
            "score": 1,
            "text": "I often remind myself how lucky I was to have had a father and grandfather who taught me to value leisure activities above all else. That included allowing for some time just sitting mindlessly.",
            "title_similarity": "0.47970706",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ha1hy7o",
            "score": 10,
            "text": "The idea of ‘leisure’ itself has an interesting history. It only really became a concept fairly recently as a way of describing our spare time, but in a way that could be marketed : ‘leisure time’, ‘leisure activities’ - leisure came to mean the things you actively seek to do during the hours your not working. \n\nIt’s a shame we can’t justify time for ourselves without thinking about whether it makes money.",
            "title_similarity": "0.6028721",
            "sentiment_compound": -0.09
        },
        {
            "id": "ha1ie9t",
            "score": 1,
            "text": "There is a therapy called recreational therapy. You learn to allow leisure into your life.",
            "title_similarity": "0.41576725",
            "sentiment_compound": 0.2263
        },
        {
            "id": "ha1iihq",
            "score": 1,
            "text": "If you are like me, you are conditioned to work circles around your coworkers and others. I found I need to constantly tell myself to slow down. I’m still really fast but way less stressed about maintaining a speed no one else is close to. Still get paid the same also so there’s that. Take your time to relax and shut down when you need to.",
            "title_similarity": "0.60806274",
            "sentiment_compound": 0.036
        },
        {
            "id": "ha1ip5q",
            "score": 1,
            "text": "This is the one thing I miss about smoking weed. It make me feel totally fine about sitting on my ass all day, which at times was exactly what I needed. Sadly, I can’t smoke anymore.",
            "title_similarity": "0.47488374",
            "sentiment_compound": -0.701
        },
        {
            "id": "ha1j1qi",
            "score": 1,
            "text": "if i know theres something better i can do even though i might not have ti do it for weeks i still feel like i cant truly have fun until i do everything i possibly can",
            "title_similarity": "0.6119081",
            "sentiment_compound": 0.0752
        },
        {
            "id": "ha1j2hu",
            "score": 1,
            "text": "Definitely me. But I'm happy when I'm being mildly productive (like cleaning, gardening, etc). Is that ok?",
            "title_similarity": "0.32880276",
            "sentiment_compound": 0.8793
        },
        {
            "id": "ha1jccd",
            "score": 23,
            "text": "The book Can't Even: How Millennials Became the Burnout Generation by Anne Helen Petersen, hits this very topic. Just finished it and it confirmed all of my stressors.",
            "title_similarity": "0.44775617",
            "sentiment_compound": -0.4767
        },
        {
            "id": "ha1jtgp",
            "score": 1,
            "text": "Seems obvious. Who knew that leisure and fun would lower stress from work...",
            "title_similarity": "0.5301026",
            "sentiment_compound": -0.1779
        },
        {
            "id": "ha1juc3",
            "score": 1,
            "text": "This was me. Took on a big opiate addiction at the same time. Been clean for about 2+ months",
            "title_similarity": "0.34955075",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ha1kdjp",
            "score": 1,
            "text": "Don’t have anything meaningful to say about the link. Just want to give a shout-out to people openly talking about this. You made it a good start of the day for me. Thanks!",
            "title_similarity": "0.38996896",
            "sentiment_compound": 0.8268
        },
        {
            "id": "ha1kfxx",
            "score": 1,
            "text": "Unless your super happy with the job you do. For example, there are many tattoo artist out there who legitimately love what they do and feed on that positivity. Even taking time off for some isn't as joyful to them because they're work and artistic lifestyle is already super amazing. Being a great artist and having a good clientele is leisure in it self. It's hard work but the benefits are there if you love what you do. I know not everyone can achieve the job they want but I think striving and doing what you really love is the secret here. Don't get me wrong though, going to the lake for some fishing and BBQ is hard to beat.",
            "title_similarity": "0.5400966",
            "sentiment_compound": 0.9857
        },
        {
            "id": "ha1kl2c",
            "score": 1,
            "text": "It's all about balance! I've adhd so it also requires discipline but for me from 9-5 I'm hyper focused on work. 5-7 is my exercise time and then 7-sleep is my relaxing time..all work and no play is so bad for your mind and body! I never had any sort of guilt about using my annual leave but tbf I'm European so we are actively encouraged to use all time off as possible!\n\nThe problem for alot of people I think is the toxic social media \"grind\" mindset that if your not working all day everyday your some how a failure. Its such absolute nonsense that is often pushed by people who's parents are bank rolling them! So a form of FOMO kicks in where people feel ashamed that they are not working as much as they \"influencers\" are working.\n\nMy advice is take your time! Life is a marathon not a sprint. No point in burning out by the age of 30!",
            "title_similarity": "0.58098865",
            "sentiment_compound": -0.9242
        },
        {
            "id": "ha1klbi",
            "score": 1,
            "text": "My wife points this out to me almost weekly.\n\nFortunately or unfortunately ( however you want to look at it ) I’m in a career that leans heavily on me and my time. To the point that just recently I did a 54 hr “shift”… Im salary so yes… but on my off time all I think about Is work and I get bored VERY quickly because of it",
            "title_similarity": "0.5292522",
            "sentiment_compound": -0.4939
        },
        {
            "id": "ha1knom",
            "score": 1,
            "text": "I feel like that all the time ...don't know how to get over this feeling",
            "title_similarity": "0.31386453",
            "sentiment_compound": 0.481
        },
        {
            "id": "ha1krgj",
            "score": 1,
            "text": "This is me to a \"T\". I have been struggling to get over this mentality, but slowly and surely am working on it.",
            "title_similarity": "0.52789116",
            "sentiment_compound": 0.4497
        },
        {
            "id": "ha1l0x7",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.29341704"
        },
        {
            "id": "ha1l5is",
            "score": 1,
            "text": "Another example of countless reasons why capitalism needs to end",
            "title_similarity": "0.4795687",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1l64k",
            "score": 1,
            "text": "Uhh, yeah; not even enjoying yourself when you're deliberately taking time to enjoy yourself is gonna be part of a bigger problem.",
            "title_similarity": "0.69880235",
            "sentiment_compound": -0.0196
        },
        {
            "id": "ha1l7e2",
            "score": 1,
            "text": "Through trauma I’ve learnt to unlove free time from a variety of reasons. How do I see the point of fun when there’s so much around me which needs attention??",
            "title_similarity": "0.53891146",
            "sentiment_compound": 0.6322
        },
        {
            "id": "ha1l9mg",
            "score": 1,
            "text": "Hustle culture is killing us.",
            "title_similarity": "0.56246203",
            "sentiment_compound": -0.6597
        },
        {
            "id": "ha1lm1o",
            "score": 1,
            "text": "This is me. I want to work hard now so I don’t have to when I have a family and can retire early. That’s what I tell myself anyway.",
            "title_similarity": "0.38748062",
            "sentiment_compound": -0.0258
        },
        {
            "id": "ha1ln4l",
            "score": 1,
            "text": "Says professor of marketing??? Weird... Probably the first person I'd ask for mental health advice.",
            "title_similarity": "0.5107444",
            "sentiment_compound": -0.3049
        },
        {
            "id": "ha1lwou",
            "score": 1,
            "text": "Feels like you guys are talking about me...",
            "title_similarity": "0.2935841",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha1m13y",
            "score": 1,
            "text": "What’s more depressing is once these things are studied and out there, businesses make a conscious decision to do nothing about it",
            "title_similarity": "0.551311",
            "sentiment_compound": -0.4391
        },
        {
            "id": "ha1m7n5",
            "score": 1,
            "text": "It’s all about balance mannnnnn",
            "title_similarity": "0.20123985",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1m8s1",
            "score": 1,
            "text": "As someone who can't relax cause I don't feel like it is productive. Is there anyone who has any tips to change that mindset? Like I know that resting is beneficial and I shouldn't worry about constantly monetizing hobbies and just do things for fun, but my brain has a disconnect and just doesn't relax.",
            "title_similarity": "0.73091906",
            "sentiment_compound": 0.048
        },
        {
            "id": "ha1mnbh",
            "score": 1,
            "text": "My problem is that I need to do a lot to occupy my mind.",
            "title_similarity": "0.34380367",
            "sentiment_compound": -0.4019
        },
        {
            "id": "ha1mpsf",
            "score": 1,
            "text": "Work to live, don't live to work.",
            "title_similarity": "0.35968652",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1ms36",
            "score": 1,
            "text": "I think finding a meaningful hobby might be good",
            "title_similarity": "0.3921653",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ha1mts9",
            "score": 1,
            "text": "My wife has this problem. She has a hard time chilling out when it comes to most things in life, so she needs to pre-occupy her mind/day with things.\n\nI am the polar opposite in that I can just enjoy doing nothing, when nothing needs to be done. But when she sees me doing nothing, she thinks I'm unhappy. I constantly tell her I'm good and nothing's wrong, but because I'm doing nothing (she figures) I must be depressed.\n\nIt's something I have to keep telling her, because we keep repeating it over and over.",
            "title_similarity": "0.63169456",
            "sentiment_compound": -0.8645
        },
        {
            "id": "ha1n1bg",
            "score": 1,
            "text": "If you enjoy wasting time is it really a waste?",
            "title_similarity": "0.6296396",
            "sentiment_compound": -0.3774
        },
        {
            "id": "ha1n7gd",
            "score": 1,
            "text": "I can relax at night or on the weekend, but I hate vacations. \n\nI like working and hate spending money on myself. \n\nI don't care if others do, but I relax enough on my normal time off and maybe once a year go somewhere. I try to enjoy it.",
            "title_similarity": "0.6605743",
            "sentiment_compound": -0.2942
        },
        {
            "id": "ha1nf1g",
            "score": 1,
            "text": "Ive experienced thls in my own life. I swung from all leisure to all work, and now I view leisure as part of working I make a point to factor it on.",
            "title_similarity": "0.39346147",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1ng9b",
            "score": 1,
            "text": "“Feeling stressed when relaxing may lead to higher levels of stress.”\n\nHow much are we paying people for this? Aren’t there enough interesting problems in the world, why are we researching such dumb questions?",
            "title_similarity": "0.7736769",
            "sentiment_compound": -0.4329
        },
        {
            "id": "ha1nkn1",
            "score": 1,
            "text": "That's basically me. And now, I'm having to bear it's cost with an year long severe depression with 2 attempted suicides :(",
            "title_similarity": "0.5042879",
            "sentiment_compound": -0.8481
        },
        {
            "id": "ha1ntlp",
            "score": 1,
            "text": "Feeling like leisure is wasteful and unproductive is a tenet of the american work ethic.",
            "title_similarity": "0.594174",
            "sentiment_compound": 0.4588
        },
        {
            "id": "ha1o047",
            "score": 1,
            "text": "\"Time you enjoy wasting is not wasted time\"\n\n\\- Unknown",
            "title_similarity": "0.42006668",
            "sentiment_compound": 0.4815
        },
        {
            "id": "ha1o0ll",
            "score": 1,
            "text": "A lot of Americans think that way, I know because I live here",
            "title_similarity": "0.16107339",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1o0st",
            "score": 1,
            "text": "i think its important to keep in mind that its leisure, a break from work, if you don't do any work then what is it really?\r  \nto me at least it seems like a waste of time if you do no work to begin with, sure you can have days or weeks to relax but at the end of the day it to relax from work or your concept of work\r  \nif you don't do any work then you are simply wasting your life\r  \nand if you relax too much relaxing becomes your work and then you have no way of relaxing, that is what i am experiencing currently i have relaxed (played games) too much in my life and don't get the same enjoyment out of them  \n\n\ntldr: its a fine balance",
            "title_similarity": "0.67442954",
            "sentiment_compound": 0.9812
        },
        {
            "id": "ha1o20u",
            "score": 1,
            "text": "I’m the exact opposite. I feel like I’m wasting my time and life at work meanwhile riding my bike or playing video games with my friends feels like what I should be doing with my life because it actually makes me happy.",
            "title_similarity": "0.5841328",
            "sentiment_compound": 0.872
        },
        {
            "id": "ha1o3eb",
            "score": 1,
            "text": "I can't enjoy anything without feeling like I'm moving forward in some way. Doesn't matter how, I just feel like I have to be doing something. It's awful.",
            "title_similarity": "0.5008657",
            "sentiment_compound": -0.689
        },
        {
            "id": "ha1okng",
            "score": 1,
            "text": "Award for giving sample size, still to check 2 latter parts but cudos to op",
            "title_similarity": "0.43193185",
            "sentiment_compound": 0.4497
        },
        {
            "id": "ha1om1w",
            "score": 2,
            "text": "What do I do to be better about this?",
            "title_similarity": "0.39976674",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ha1omsv",
            "score": 1,
            "text": "*In Paise of  Idleness* by Bertand Russetl is a wonder treatise on leisure, relaxing and laziness. Highly Recommended!",
            "title_similarity": "0.4702341",
            "sentiment_compound": 0.6793
        },
        {
            "id": "ha1orcw",
            "score": 1,
            "text": "This is exactly why paid vacations and paid parental leave are important.",
            "title_similarity": "0.30035368",
            "sentiment_compound": 0.1531
        },
        {
            "id": "ha1ozeh",
            "score": 1,
            "text": "The fallout from my own personal burnout lasted a couple of years but I learned that boundaries and saying no to things is my greatest tool to avoid getting there again.",
            "title_similarity": "0.56029284",
            "sentiment_compound": 0.296
        },
        {
            "id": "ha1ozkp",
            "score": 1,
            "text": "As someone who is super lazy and abhors labour, I’d imagine there is a healthy balanced somewhere along the line.",
            "title_similarity": "0.6210204",
            "sentiment_compound": 0.0516
        },
        {
            "id": "ha1p27b",
            "score": 1,
            "text": "The happiest people I know are the ones with hobbies. The unhappiest people I know are the ones who claim not to have time (and/or interest) for hobbies.\n\nThe findings of this study always seemed pretty obvious to me.\n\nMoral of the story is, find time for your hobbies. Everyone can do it. You can even find a way to integrate hobbies into your everyday life, if you need to. \n\nThink you don't have enough time because you're a single parent? Find a way to involve your kid(s) in your hobby, problem solved. Most kids would be thrilled to be involved in some way, even if it's a hobby you think they wouldn't like. \n\nToo busy working all the time? Get your coworkers involved in your hobby, and they'll be more likely to let you spend more time enjoying it yourself, or at worst, at least you'll get to have fun talking about it with them while you're working.",
            "title_similarity": "0.65432286",
            "sentiment_compound": 0.8841
        },
        {
            "id": "ha1pbp2",
            "score": 1,
            "text": "I certainly have this issue. I think holidays where you just sit on a beach earning 20% are wasteful.  \n\nI regret watching TV/Movies because that time is gone, used up. I've taken to watching them whilst doing something I consider useful - eg learning somehting new, doing one of my side projects. I do consider that it's me winding down just in a **different** way to how most people do but I find TV shows mind-blowingly awful and repetative. \n\nI don't think I'm suffering for it, I actually enjoy the productive part. Covid gave me time to start learning new stuff and I think I've become much more eager to take stuff in.",
            "title_similarity": "0.67570615",
            "sentiment_compound": 0.8711
        },
        {
            "id": "ha1pdl2",
            "score": 1,
            "text": "\"New research suggests that feeling useless makes you upset.\"",
            "title_similarity": "0.6909849",
            "sentiment_compound": -0.5994
        },
        {
            "id": "ha1pn5l",
            "score": 1,
            "text": "Everyone should also read \" The Geography of Bliss\" to understand systemic differences told through non-judgemental cultural differences.",
            "title_similarity": "0.4365021",
            "sentiment_compound": 0.5719
        },
        {
            "id": "ha1pujo",
            "score": 1,
            "text": "Work to live, not live to work",
            "title_similarity": "0.33953828",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1q6p3",
            "score": 1,
            "text": "Did the study look into ways to make leisure less wasteful and unproductive so I can relax more efficiently?",
            "title_similarity": "0.7049733",
            "sentiment_compound": 0.7316
        },
        {
            "id": "ha1qewj",
            "score": 1,
            "text": "Isn't n=1310 a very small sample size ?  \n\nUsually in harder sciences n=1310 would not be accepted.",
            "title_similarity": "0.68279755",
            "sentiment_compound": -0.2057
        },
        {
            "id": "ha1qoeu",
            "score": 1,
            "text": "I'm kind of needed to hear that right now.  I've entered a phase of hyper productivity lately and have inadvertently adopted that mindset along the way.",
            "title_similarity": "0.41453627",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1qxeb",
            "score": 1,
            "text": "I’m not going to be on my death bed wishing I was more productive.",
            "title_similarity": "0.5429775",
            "sentiment_compound": -0.4588
        },
        {
            "id": "ha1qyl5",
            "score": 1,
            "text": "Great now I get to feel anxious about feeling anxious during my leisure time",
            "title_similarity": "0.58874774",
            "sentiment_compound": 0.3818
        },
        {
            "id": "ha1r0t2",
            "score": 1,
            "text": "..and of course this is me.",
            "title_similarity": "-0.08335941",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1r31f",
            "score": 1,
            "text": "One of the greatest and most productive thinkers of the 20th century said that time you enjoy wasting is not wasted time. I think a lot of intelligent and informed people have known for a long time that enjoying leisure time is not wasteful.",
            "title_similarity": "0.47020918",
            "sentiment_compound": 0.9291
        },
        {
            "id": "ha1r96z",
            "score": 2,
            "text": "Listen up retired folks, gaming was made for you, not the kids.  Fly a dragon, fight monsters, run, jump, and explore 3D worlds.  Take back your fun.",
            "title_similarity": "0.4673305",
            "sentiment_compound": 0.1779
        },
        {
            "id": "ha1r9i2",
            "score": 1,
            "text": "The economy is to work for us, not the other way around. The point of life is to enjoy your time on this earth. Jobs are just a means to an end. Never let a job destroy your quality of life.",
            "title_similarity": "0.38530648",
            "sentiment_compound": -0.0772
        },
        {
            "id": "ha1rfw2",
            "score": 1,
            "text": "Or. Just a wild thought. Some people actually enjoy being busy and there are people who enjoy leisure time. Why cant both be true? Why do we always gotta keep getting lumped as a whole?",
            "title_similarity": "0.5484712",
            "sentiment_compound": 0.6628
        },
        {
            "id": "ha1rh3r",
            "score": 1,
            "text": "It's honestly worrying just how conditioned we become in believing that taking any time for ourselves to rest or pursue something fun or fulfilling is considered \"wasteful\". Any time we are not spending being productive for capitalist systems seems to be stigmatized in a thousand small ways. In particular all these \"influencers\" on social media promoting so called hussle culture, I feel are going to utterly destroy the self-esteem and general welfare of entire generations to come.",
            "title_similarity": "0.6864978",
            "sentiment_compound": 0.3832
        },
        {
            "id": "ha1rjq9",
            "score": 1,
            "text": "I have over a month of accumulated time off with no plans to use it.\n\nTouristy stuff is more stressful than being at work.",
            "title_similarity": "0.57337755",
            "sentiment_compound": -0.6997
        },
        {
            "id": "ha1sb7k",
            "score": 1,
            "text": "How can I manage this? I'm extraordinarily hard on myself for resting or doing things that don't feel productive",
            "title_similarity": "0.57130253",
            "sentiment_compound": -0.1027
        },
        {
            "id": "ha1sdv4",
            "score": 1,
            "text": "You’re just describing my twenties",
            "title_similarity": "0.24543631",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1sf07",
            "score": 1,
            "text": "Well aren't those researchers just fuckkng geniuses",
            "title_similarity": "0.38798767",
            "sentiment_compound": 0.2732
        },
        {
            "id": "ha1snsr",
            "score": 1,
            "text": "I often have difficulty in relaxing with leisure activities - and I often feel that not being productive all the time means that I am making no progress in my life. Marijuana helps.",
            "title_similarity": "0.67271733",
            "sentiment_compound": 0.2658
        },
        {
            "id": "ha1sv8f",
            "score": 1,
            "text": "I’m in this picture and I don’t like it",
            "title_similarity": "0.41887534",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha1szx1",
            "score": 1,
            "text": "\"Obvious negative action causes obvious negative effect\" reports science",
            "title_similarity": "0.5083114",
            "sentiment_compound": -0.8126
        },
        {
            "id": "ha1tk6h",
            "score": 1,
            "text": "Alternate title: People who are unable to relax are less happy and more stressed. \n\nMild shock!",
            "title_similarity": "0.7413658",
            "sentiment_compound": 0.2599
        },
        {
            "id": "ha1tkpf",
            "score": 2,
            "text": "Wonder how much is cause and effect. When I'm happy with my career, I have a much better view of leisure. When I'm unhappy with my career, I'm much more likely to be in the \"I should be spending my free time improving my career / doing more work / updating resume\" mindset.\n\nSame thing would apply to things like exercise. If I'm out of shape, I'm going to view my leisure time as much more wasteful, as I could be spending it getting back in shape.\n\nLastly, I think life satisfaction is equally as important as transitionary happiness. People who over-index on leisure are likely to have relatively low life satisfaction, as I wouldn't expect their career, life goals, or relationships to progress at the same speed as others.",
            "title_similarity": "0.70397496",
            "sentiment_compound": 0.9729
        },
        {
            "id": "ha1tnh4",
            "score": 1,
            "text": "New research suggests water makes things wet",
            "title_similarity": "0.27561402",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1tq2d",
            "score": 1,
            "text": "I'm pretty sure higher stress levels and depression might lead to feeling like leisure time is wasteful.",
            "title_similarity": "0.85025924",
            "sentiment_compound": 0.25
        },
        {
            "id": "ha1turs",
            "score": 1,
            "text": "My grandma is like that, because she fears the most that people perceive her as useless.",
            "title_similarity": "0.63999856",
            "sentiment_compound": -0.4767
        },
        {
            "id": "ha1u5wa",
            "score": 1,
            "text": "I'm beyond guilty of this. My idea of \"relaxing\" is working on one of my 4 project vehicles. Literally zero downtime from when I'm up in the morning, to when my head hits the pillow.",
            "title_similarity": "0.49507713",
            "sentiment_compound": 0.1027
        },
        {
            "id": "ha1uj8z",
            "score": 7,
            "text": "feeling like that means your bosses have everything they want from you. your time, your labor, and now your mind. why do firms need to subject you to coercion when youve internalized it to the point that you hate yourself for doing anything but work? there are currently middle aged and elderly people working for free at businesses that dont pay workers a living wage and are without employees due to the pandemic. this can cripple whole generations of people.",
            "title_similarity": "0.58817255",
            "sentiment_compound": 0.6902
        },
        {
            "id": "ha1ulma",
            "score": 1,
            "text": "I have never and will never consider leisure to be wasteful and unproductive.  Quite the opposite,  I consider it one of the most important things in my life.",
            "title_similarity": "0.35223165",
            "sentiment_compound": 0.2716
        },
        {
            "id": "ha1uojg",
            "score": 1,
            "text": "I hate that I'm like this. I have such a hard time enjoying my days off because I'm always stressed and feel like I should be doing something productive.",
            "title_similarity": "0.6046222",
            "sentiment_compound": 0.2263
        },
        {
            "id": "ha1uuu3",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "0.29341704"
        },
        {
            "id": "ha1ux66",
            "score": 1,
            "text": "Everything weve been told about work, money, relationships, and freedom has been a lie. I think we are reaching a turning point in data reflecting this.",
            "title_similarity": "0.5561466",
            "sentiment_compound": 0.7184
        },
        {
            "id": "ha1uxbx",
            "score": 1,
            "text": "Perspective is one of the most under-valued tools to change your life. Reframing your perspective should be a routine for every adult because we tend to assume our thoughts are truth when they are just possibilities.",
            "title_similarity": "0.64863664",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha1uysd",
            "score": 1,
            "text": "\"New research shows being ridiculously unbalanced in your approach to life is bad for you.\"\n\n -Science...again.",
            "title_similarity": "0.68941474",
            "sentiment_compound": -0.7096
        },
        {
            "id": "ha1vanw",
            "score": 1,
            "text": "I’ve come to the realization that pain and suffering should be embraced as an imminent reality in life. We should not succumb to laziness and nihilistic cynicism. Failing our family members and the community around us. Everything in the right measure and properly balanced. My humble thoughts",
            "title_similarity": "0.46307427",
            "sentiment_compound": -0.9081
        },
        {
            "id": "ha1vkq7",
            "score": 1,
            "text": "this is like saying \"convincing yourself there is actual freddy krueger waiting for you to fall asleep at night, may lead to loss of sleep, new research suggests\"",
            "title_similarity": "0.62382424",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ha1vlly",
            "score": 1,
            "text": "Sadly I can attest to this.",
            "title_similarity": "0.2507243",
            "sentiment_compound": -0.4215
        },
        {
            "id": "ha1vuah",
            "score": 1,
            "text": "I seriously cannot fathom the attitude that leisure is surplus to requirements for human functioning. You can compare so many phenomena in engineering and nature, things that are overexerted, things that overheat, things that don't undergo proper maintenance. Cars if not maintained will break down, ants who do not regularly maintain their tunnels will have cave-ins, blades that are not sharpened will become dull, woodpeckers have various mechanisms in their beaks and skull that prevent overheating and impact damage from continuous workloads, the list goes on and on and on.\n\nNo feat of engineering, whether it's human technology or biological mechanisms, is limitless. The human mind and its ability to exert itself through focus and directed effort is no different, glucose metabolism, dopamine receptor sensitivity, mitochondrial function, these are just a handful of the many elements of mental and physical exertion that can and will be affected. The degree to which they are affected is heavily mitigated by things like leisure, sleep, rest, genuine relaxation (so not leisure just for productivity's sake). It's such an effective tool, it's akin to cooling down the overheating drill, sharpening the blunted blade, and maintaining the car engine to optimal efficiency all at once. \n\nI cannot believe that this perspective is lacking in a society that is supposedly built upon the capitalistic pursuit of optimizing worker output and efficiency and extracting the maximum possible of workload from employees. Obviously I do not agree with this, but I can't believe that such a basic perspective on the functioning of... basically anything and how those principles affect humans just like everything else, is missing from corporate policies and possibly even government policies.",
            "title_similarity": "0.638793",
            "sentiment_compound": 0.5782
        },
        {
            "id": "ha1vw21",
            "score": 1,
            "text": "Chicken or egg? \n\nDo people who are depressed lack interest in leisure or does a lack of interest in leisure cause depression?",
            "title_similarity": "0.6665176",
            "sentiment_compound": -0.7149
        },
        {
            "id": "ha1wfx7",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.293417"
        },
        {
            "id": "ha1xm7g",
            "score": 1,
            "text": "I’ve recently been telling a lot of US business defenders I run into to consider getting therapists.",
            "title_similarity": "0.30590397",
            "sentiment_compound": 0.0772
        },
        {
            "id": "ha1xmhn",
            "score": 1,
            "text": "I get so little free time that I’m overwhelmed when I get it. So many things I could do, but then I shut down after getting stressed.",
            "title_similarity": "0.70282805",
            "sentiment_compound": -0.2161
        },
        {
            "id": "ha1xwus",
            "score": 2,
            "text": "I can attest to this with my current job. I work in a call center and 2 months ago I was promoted to the Escalation line which is contacted whenever a contract holder requests to speak with a supervisor.   \nMy inbound calls dropped from 40+ calls per day to about 6 calls per day, a ridiculous drop in calls. I also work from home so I had literally hours of free time to do whatever I want. Sounds like a dream right?  \nIn the beginning, that is. After you sleep for hours waiting for a call or play video games, watch movies, etc. you pretty much run out of things to do and you get bored and sluggish then eventually you get depressed. Not gonna lie I was grateful for that free time but it does affect you negatively after a certain point.",
            "title_similarity": "0.48368275",
            "sentiment_compound": 0.7269
        },
        {
            "id": "ha1y5gt",
            "score": 1,
            "text": "Bruh isn’t this kinda obvious? “ New research suggests” who needed to do research on this??",
            "title_similarity": "0.44130397",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha1yac4",
            "score": 1,
            "text": "Yes! They need to teach, “how to leisure” in school. I’m terrible at it.",
            "title_similarity": "0.5190296",
            "sentiment_compound": -0.1759
        },
        {
            "id": "ha1ze60",
            "score": 1,
            "text": "Lately I’ve been thinking along the same lines. Stressed from current life situations causes unhappiness and can ruin the morning or afternoon for me. I’ve been trying to just be “in the moment” more on my off days and free time and do what makes me most happy. Because we all deserved our own free time.",
            "title_similarity": "0.66118145",
            "sentiment_compound": 0.2484
        },
        {
            "id": "ha1zins",
            "score": 1,
            "text": "It sure feels like that to me.",
            "title_similarity": "0.110103466",
            "sentiment_compound": 0.5859
        },
        {
            "id": "ha1zm8u",
            "score": 1,
            "text": "Great study thanks for sharing",
            "title_similarity": "0.34495044",
            "sentiment_compound": 0.8689
        },
        {
            "id": "ha20bet",
            "score": 1,
            "text": "I have firsthand experience of this, because I go through phases of doing nothing but study followed by not wanting to study, but feeling guilty about it so not committing to anything too fun, and that's how end up on reddit :)",
            "title_similarity": "0.6235035",
            "sentiment_compound": 0.6956
        },
        {
            "id": "ha20chi",
            "score": 5,
            "text": "I don’t want to personally know anyone who thinks leisure time is a bad thing…",
            "title_similarity": "0.5068317",
            "sentiment_compound": -0.4939
        },
        {
            "id": "ha20n2w",
            "score": 1,
            "text": "Four: Keep away from my grade.",
            "title_similarity": "0.52020985",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha20rs4",
            "score": 1,
            "text": "Cries in a country founded by puritans.",
            "title_similarity": "0.2782842",
            "sentiment_compound": -0.4019
        },
        {
            "id": "ha20upz",
            "score": 1,
            "text": "My girlfriends and friends never understand why I am this way. If I don't worry,I won't make myself be productive. When I do take time off from work,all I can think about is how unproductive I am ,and that my business is suffering from me not being there. Its true,but I also have to tell myself that since I own my own small brick and mortar business,I indeed am my most most valued employee. And hence,I HAVE to take care of that employee. Its a daily struggle,but I am working on it!!",
            "title_similarity": "0.5730354",
            "sentiment_compound": 0.805
        },
        {
            "id": "ha2115r",
            "score": 1,
            "text": "or is it wasteful and unproductive because you are stressed or depressed",
            "title_similarity": "0.6597213",
            "sentiment_compound": -0.6908
        },
        {
            "id": "ha21iiu",
            "score": 1,
            "text": "One of the biggest turning points in my adult life came when I read an article about this very topic. Making myself relax and press pause has led to so much more happiness.",
            "title_similarity": "0.4391076",
            "sentiment_compound": 0.7939
        },
        {
            "id": "ha21lz1",
            "score": 1,
            "text": "Taking care of yourself is quite literally investing in your future.",
            "title_similarity": "0.29627553",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ha21toj",
            "score": 3,
            "text": "That is a mind boggling mindset- I only feel like I am living during leisure time.",
            "title_similarity": "0.4616161",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha22mv7",
            "score": 9,
            "text": "I loathe people like that. They often try to drag you into their misery by accusing you of being lazy.",
            "title_similarity": "0.6083149",
            "sentiment_compound": -0.8591
        },
        {
            "id": "ha22uzn",
            "score": 2,
            "text": "I once heard a Ted talk where the guy explained away needing vacation because of diminishing utility and I just felt so bad for him",
            "title_similarity": "0.66666985",
            "sentiment_compound": -0.6696
        },
        {
            "id": "ha233mb",
            "score": 2,
            "text": "I found it the hard way. You don’t have to be working all the time.",
            "title_similarity": "0.4918431",
            "sentiment_compound": -0.1027
        },
        {
            "id": "ha239hl",
            "score": 2,
            "text": "My whole family has this new England puritanical work is the meaning of existence thing. It's terrible, and not particularly well suited attitude for a future where people will do less and less production. I'm trying to pivot myself by enjoying some very relaxing hobbies and doing that stuff with my kids when they're older.",
            "title_similarity": "0.71211934",
            "sentiment_compound": 0.4141
        },
        {
            "id": "ha23q4i",
            "score": 5,
            "text": "Unspoken part of this headline: If you have ADHD, welcome to the suck, because that's how you'll feel all the time forever as you try to catch up.",
            "title_similarity": "0.49903888",
            "sentiment_compound": 0.0258
        },
        {
            "id": "ha242b7",
            "score": 1,
            "text": "This is why I could never win the lottery",
            "title_similarity": "0.44784784",
            "sentiment_compound": -0.4717
        },
        {
            "id": "ha24o8v",
            "score": 1,
            "text": "Considering how toxic and hustle obsessed academia is, I find this scientific study a bit ironic.\n Yes, I’m a scientist who leaves the lab at 4pm most nights and worries about his career future",
            "title_similarity": "0.6349876",
            "sentiment_compound": -0.3744
        },
        {
            "id": "ha24wv9",
            "score": 1,
            "text": "I learned I had a problem when I felt horrible for taking time away from my job for ONE day. \n\nWe are so mentally and emotionally tied to what we do for a living that disconnecting makes us feel like failures. \n\nThat’s why I think so many can’t fully disconnect: our identities are tired to what we do for a living.",
            "title_similarity": "0.6766514",
            "sentiment_compound": -0.8625
        },
        {
            "id": "ha252ey",
            "score": 1,
            "text": "Of course it leads to less happiness. If I can't enjoy my downtime, and I feel like I am constantly wasting time that I could otherwise be productive, how would I ever have enjoyment? Even when you're producing, that kind of mindset will drive you to feel like it isn't enough",
            "title_similarity": "0.77077305",
            "sentiment_compound": 0.7635
        },
        {
            "id": "ha25kmp",
            "score": 1,
            "text": "That’s why I have no guilt about procrastinating.",
            "title_similarity": "0.29962596",
            "sentiment_compound": 0.2057
        },
        {
            "id": "ha25lsi",
            "score": 1,
            "text": "Wow, really????? Thank god they studied that.",
            "title_similarity": "0.2493883",
            "sentiment_compound": 0.873
        },
        {
            "id": "ha26530",
            "score": 1,
            "text": "I blame my upbringing",
            "title_similarity": "0.446166",
            "sentiment_compound": -0.34
        },
        {
            "id": "ha26ife",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.2655609"
        },
        {
            "id": "ha26okj",
            "score": 3,
            "text": "If you consider leisure time as your personal little protest against the Machine you will enjoy it 300x more.",
            "title_similarity": "0.63189423",
            "sentiment_compound": 0.3597
        },
        {
            "id": "ha270x4",
            "score": 1,
            "text": "Is that why I feel useless no matter how hard I work and sacrifice?",
            "title_similarity": "0.50041246",
            "sentiment_compound": -0.5063
        },
        {
            "id": "ha273em",
            "score": 1,
            "text": "Can anyone point me to a study that confirms my bias that people who avoid leisure are no fun at parties?",
            "title_similarity": "0.6901847",
            "sentiment_compound": -0.3822
        },
        {
            "id": "ha277iq",
            "score": 1,
            "text": "Anyone else feel like a lot of these studies are just common sense? I don't understand why this had to be studied but then again I don't understand a lot of things.",
            "title_similarity": "0.56646883",
            "sentiment_compound": 0.1901
        },
        {
            "id": "ha27e6p",
            "score": 1,
            "text": "It kills me. I have so many things to do all the time. Any time I take for myself I feel guilty about for not furthering my career, working on the house, doing for others, doing for my family. \n\nI don’t feel this way when I’m doing things with my family, for others, for work. Only when I try and take time for myself",
            "title_similarity": "0.56598216",
            "sentiment_compound": -0.743
        },
        {
            "id": "ha28qbj",
            "score": 1,
            "text": "I aspire to attain total leisure. The ability to be completely unproductive if that’s what I want. It makes me happy.\n\nI’ve figured out that I don’t need to be productive 40 hours a week to feel good about myself. I can be perfectly happy working on something that matters to me or that I enjoy for 10-15 hours per week and just spend the rest of my time goofing off.",
            "title_similarity": "0.55127233",
            "sentiment_compound": 0.9668
        },
        {
            "id": "ha28wpn",
            "score": 1,
            "text": "How do I stop thinking this?",
            "title_similarity": "0.3576094",
            "sentiment_compound": -0.296
        },
        {
            "id": "ha293g2",
            "score": 1,
            "text": "The problem is not work. It is working for unethical dogs that want to use you and ruin your life. Being free to pursue what you want to do is better than avoiding what you do not",
            "title_similarity": "0.6381695",
            "sentiment_compound": -0.6597
        },
        {
            "id": "ha29ara",
            "score": 1,
            "text": "I once saw a quote on Twitter that really helped my own thoughts on this issue. I do not remember it verbatim, but here is the jist.\n\nWe are mammals, omnivores, primates, and social beings. If you look to the animal kingdom those types of animals play, rest, socialize, and live in community. It is normal and needed. \n\nWe are not bees in a hive. It is not our purpose to work and work and work. So, don't feel bad that you are not acting like an animal that is not your species. We are acting within accordance of who we are. Leisure is not wasteful and unproductive, it is part of who we are.\n\nMy wife has repeated this to me on occasion as a reminder to not be hard on myself, if I ever feel like I haven't done enough.",
            "title_similarity": "0.47304353",
            "sentiment_compound": 0.8361
        },
        {
            "id": "ha29ki2",
            "score": 1,
            "text": "So having a stick up your ass is detrimental to your health.",
            "title_similarity": "0.59847856",
            "sentiment_compound": -0.5423
        },
        {
            "id": "ha29xsn",
            "score": 1,
            "text": "I enjoy nothing more than leisure. The whole point of my life os to figure out how much leisure time i can get, and how. I have hobbies sure, buy one of them is laying in bed trapped in my own little world.    \nFeeling unproductive? Nope.",
            "title_similarity": "0.470146",
            "sentiment_compound": 0.323
        },
        {
            "id": "ha29yv4",
            "score": 1,
            "text": "This is my problem. I’m working really hard on not working as much and feeling okay about it. I’m down to about 15 hours a week but considering how sick I’ve been for years that still feels like too much and I still feel guilty.",
            "title_similarity": "0.6452491",
            "sentiment_compound": -0.7504
        },
        {
            "id": "ha2amw5",
            "score": 1,
            "text": "Legitimately having therapy appointments about this very phenomenon. I struggle to feel like I’m justified in just doing nothing. I kick myself for it, get internally upset, and feel like hot trash when I relax for three hours before bed after a 13 hour day (work, gym, chores and errands). \n\nI know this is a study talking about it, but do any of you all experience the same? How do you cope with it and what do you do?",
            "title_similarity": "0.64245546",
            "sentiment_compound": 0.4728
        },
        {
            "id": "ha2bum2",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.29341704"
        },
        {
            "id": "ha2cckd",
            "score": 1,
            "text": "This is what I’ve been fighting with myself over the last few years",
            "title_similarity": "0.34308875",
            "sentiment_compound": -0.3612
        },
        {
            "id": "ha2co7l",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.26556093"
        },
        {
            "id": "ha2d6wu",
            "score": 1,
            "text": "We live one life, or even if we live multiple (as I believe…) we only remember one by one! We are here to experience and enjoy life too! All with the right balance!- I will never get those people working 60 hours a week for what??? Buying stuff and making others rich??? Live with less things and enjoy more free time!",
            "title_similarity": "0.5369031",
            "sentiment_compound": 0.9473
        },
        {
            "id": "ha2d82w",
            "score": 3,
            "text": "TL;DR: Feeling bad about feeling good feels bad.",
            "title_similarity": "0.66446215",
            "sentiment_compound": -0.4767
        },
        {
            "id": "ha2dh32",
            "score": 1,
            "text": "Why did somebody think that this needs research?",
            "title_similarity": "0.3809954",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha2dqk7",
            "score": 1,
            "text": "Has anyone ever read one of these studies and gone “Ah that’s it, I’m going to fix this aspect of my life now with this information”?",
            "title_similarity": "0.40561533",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha2eus9",
            "score": 1,
            "text": "My mother-in-law is starting to change but she used to think that taking a nap is being lazy. Can't imagine how some people think that their lives that they only get one of is not worth living if you have fun. To work until you die is a medieval construct.",
            "title_similarity": "0.68369055",
            "sentiment_compound": -0.731
        },
        {
            "id": "ha2fycx",
            "score": 1,
            "text": "Not having fun when you're supposed to be having fun, sucks. \n\n\\*Standing in the corner while strangers scream flirtatiously at each other over the music and slop each other's drinks  \n\n\\*Huffing and puffing up a mountain while your friends skip gaily away up the trail.  \n\n\\*Jittery and paranoid, wondering if all the other stoners are laughing AT you  \n\nYou just have to find something that's fun for YOU, and do it, and avoid people who mock you for it.",
            "title_similarity": "0.5490397",
            "sentiment_compound": -0.0263
        },
        {
            "id": "ha2goqv",
            "score": 1,
            "text": "I recently quit my 9-5 retail job that I spent 9 years fulltime at for a freelance gig more in line with my passions. For the first month after I left my old job, I suddenly had an overwhelming amount of free time. I couldn’t find any leisure in it though; the days I spent doing very little felt wasteful and by the end of it I was despairing over how much time I wasted. This was the first month in 9 years I truly had “off” and I could not relax.",
            "title_similarity": "0.51965475",
            "sentiment_compound": 0.4007
        },
        {
            "id": "ha2gxu2",
            "score": 3,
            "text": "It’s because American culture has become one where we are worship overworking and it is slowly killing us all…",
            "title_similarity": "0.5605259",
            "sentiment_compound": -0.4939
        },
        {
            "id": "ha2hu4q",
            "score": 1,
            "text": "I take any moment for myself and feel like a waste of oxygen instantly.",
            "title_similarity": "0.4110425",
            "sentiment_compound": -0.0772
        },
        {
            "id": "ha2ixpo",
            "score": 1,
            "text": "Not for me. I love leisure. I’d wear it as a suit if I could.",
            "title_similarity": "0.39167047",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ha2j35k",
            "score": 1,
            "text": "Scientist need study to find people who have less fun have less fun. Another brain buster on here it's like you guys are getting these from a pamphlet left in a 3rd grade classroom entitled obvious things we still wasted time studying.",
            "title_similarity": "0.67464197",
            "sentiment_compound": 0.7517
        },
        {
            "id": "ha2j6e4",
            "score": 1,
            "text": "Work culture is so ingrained upon american society, I clearly remember my father getting mad when he saw us kids sitting around when we could be working on a project or building something in the shed something during the weekend.\n\nIt lead to me as an adult feeling like I was doing something wrong when I wasn't up working on something on my days off. Thankfully my SO helped me learn that there's nothing wrong with relaxing.",
            "title_similarity": "0.51526684",
            "sentiment_compound": 0.2792
        },
        {
            "id": "ha2jl2x",
            "score": 1,
            "text": "This is just a sad side effect of high functioning people who are already predisposed to anxiety disorders and other mental health issues.",
            "title_similarity": "0.7203423",
            "sentiment_compound": -0.5859
        },
        {
            "id": "ha2k3w0",
            "score": 1,
            "text": "Truly unexpected groundbreaking work.",
            "title_similarity": "0.21098426",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ha2k72l",
            "score": 1,
            "text": "I have ocd, which makes me a ruthless perfectionist. So I feel guilty for relaxing if I haven’t yet completed all tasks & everything isn’t in its right place. I would imagine it’s the same for like minded people in many cultures",
            "title_similarity": "0.7140313",
            "sentiment_compound": 0.6293
        },
        {
            "id": "ha2k79k",
            "score": 1,
            "text": "I view leisure time as wasteful as do most people I work with.   \n\n\nIs that why we are stressed?",
            "title_similarity": "0.67242783",
            "sentiment_compound": -0.34
        },
        {
            "id": "ha2ken2",
            "score": 1,
            "text": "Thats me. It comes from childhood issues.",
            "title_similarity": "0.31288657",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha2kh47",
            "score": 1,
            "text": "The first time that someone introduced the idea that 'productivity' is a concept that has been weaponized by employers/ corporations/ capitalism in general, it was like a lightbulb switching on. People should, in general, be able to be idle or relaxed without labelling it as 'lazy', just as they should allow themselves to be 'busy' and 'productive' if it's enjoyable and/or necessary to them. \n\nPersonally, I like to be busy enough that I'm not bored and that my leisure time feels special. However, I ALSO like to be busy because it distracts me from worries...which I could benefit from learning how to deal with more effectively!",
            "title_similarity": "0.61446404",
            "sentiment_compound": 0.9623
        },
        {
            "id": "ha2ks9o",
            "score": 1,
            "text": "All work and no play makes Jack a dull boy.",
            "title_similarity": "0.37768146",
            "sentiment_compound": -0.577
        },
        {
            "id": "ha2kzaa",
            "score": 1,
            "text": "Gee I better just ignore my bills and relax then and my happiness will increase",
            "title_similarity": "0.5528468",
            "sentiment_compound": 0.8481
        },
        {
            "id": "ha2me42",
            "score": 1,
            "text": "The pursuit of *quality* leisure is the only reason I'm motivated to work and clean.",
            "title_similarity": "0.36212975",
            "sentiment_compound": 0.6908
        },
        {
            "id": "ha2nblv",
            "score": 1,
            "text": "I mean, obviously. Feeling like you are wasting your time is extremely stressful for anyone.",
            "title_similarity": "0.56950134",
            "sentiment_compound": -0.5095
        },
        {
            "id": "ha2o17v",
            "score": 1,
            "text": "Don't worry, I manage to feel quite depressed as well and I value leisure time very highly!",
            "title_similarity": "0.56336087",
            "sentiment_compound": 0.4346
        },
        {
            "id": "ha2ohv6",
            "score": 1,
            "text": "Hey, that's me...mom, dad...i made it...my 15 minutes of fame.",
            "title_similarity": "0.2165444",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ha2olwj",
            "score": 1,
            "text": "Uh oh, this is me. BRB, adding leisure to my to-do list.",
            "title_similarity": "0.37443095",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha2ovuz",
            "score": 1,
            "text": "This study is powered by Amazon Prime",
            "title_similarity": "0.15007907",
            "sentiment_compound": 0.1779
        },
        {
            "id": "ha2p9a5",
            "score": 1,
            "text": "Wasting time is my favourite thing to do",
            "title_similarity": "0.41261676",
            "sentiment_compound": -0.4019
        },
        {
            "id": "ha2pe2s",
            "score": 1,
            "text": "Study confirms water can cause wetness",
            "title_similarity": "0.22855558",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha2ptq0",
            "score": 1,
            "text": "I like to compare myself to a tree. If I don't put my bonsai outdoors and let it rest through the winter, it'll try and grow year round and eventually it'll die. Trees need rest in order to grow. People are like that too.",
            "title_similarity": "0.5796605",
            "sentiment_compound": 0.0258
        },
        {
            "id": "ha2qrx1",
            "score": 1,
            "text": "In Argentina depends a bit on the work You do, but in general we value our weekends, bank holidays and vacation time is a mandatory two weeks or more.",
            "title_similarity": "0.47645995",
            "sentiment_compound": 0.7876
        },
        {
            "id": "ha2qv7n",
            "score": 1,
            "text": "Someone wanna tell this to my dad?",
            "title_similarity": "0.27564165",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha2r1d4",
            "score": 1,
            "text": "I have been there and confirm high levels of stress and anxiety",
            "title_similarity": "0.32547557",
            "sentiment_compound": -0.5423
        },
        {
            "id": "ha2r9hu",
            "score": 1,
            "text": "Ex European live in America I feel guilty asking for my well earned vacation time. The transformation is complete.",
            "title_similarity": "0.51671445",
            "sentiment_compound": -0.1779
        },
        {
            "id": "ha2s2g0",
            "score": 1,
            "text": "Covey:Prioritize things based on importance, not urgency.  He had it all figured out!",
            "title_similarity": "0.2869436",
            "sentiment_compound": 0.4199
        },
        {
            "id": "ha2s84h",
            "score": 1,
            "text": "This is my husband. His mother raised him this way. I have PTSD from growing up in abuse and it can be hard to live with someone who can't sit still. I need space and I need rest. I have chronic health issues and I can't go the way he does. It is stressful to have someone who feels they can't stop. Therapy has helped a ton for both of us. My husband had to learn that just because he doesn't want to slow down doesn't mean I have to match him. If he feels he needs to do certain things and can't let them sit that is on him. It isn't on me to do what isn't reasonable. We still argue over what that is sometimes, but it is getting better. I try not to get anxious when he is doing stuff if I am not. If he wants to do it that is on him. If I can't I can't.",
            "title_similarity": "0.6057662",
            "sentiment_compound": 0.3701
        },
        {
            "id": "ha2sbyo",
            "score": 1,
            "text": "We needed research for this?",
            "title_similarity": "0.34377056",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha2shx6",
            "score": 1,
            "text": "Okay but how do I *stop* feeling like this",
            "title_similarity": "0.32822502",
            "sentiment_compound": 0.3919
        },
        {
            "id": "ha2t2qi",
            "score": 1,
            "text": "Time enjoyed wasting is not wasted time.",
            "title_similarity": "0.3696114",
            "sentiment_compound": 0.4986
        },
        {
            "id": "ha2ugmr",
            "score": 1,
            "text": "You got bigger problems if you live for work like that",
            "title_similarity": "0.44179773",
            "sentiment_compound": -0.0516
        },
        {
            "id": "ha2urc2",
            "score": 1,
            "text": "How to stop this feeling, may I ask?",
            "title_similarity": "0.3837871",
            "sentiment_compound": -0.1469
        },
        {
            "id": "ha2vtxf",
            "score": 1,
            "text": "i definitely don't feel guilty about leisure time. i only have to be productive a couple hours a day, on my own schedule at home, being creative and that's an ideal life for me. i need something to do that interests me, or i'd just drink all day and night. and while i'd love to do that, did it for a couple years, my body has finally said. \"go find something to do for a couple hours, dummy\"",
            "title_similarity": "0.4880948",
            "sentiment_compound": 0.948
        },
        {
            "id": "ha2wi1l",
            "score": 1,
            "text": "What do we define as leisure? Is it periods of inactivity or is it activities that are active or keeping us busy without the purpose of making money?",
            "title_similarity": "0.6024781",
            "sentiment_compound": 0.4696
        },
        {
            "id": "ha2wpfk",
            "score": 1,
            "text": "I run two companies. I took 3 days off when my first child was born. I haven’t had a day off in months. If you have normal jobs and can take time off pleas do it. Not all of us have that luxury",
            "title_similarity": "0.4198668",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha2y1bj",
            "score": 1,
            "text": "I don't think its wasteful. I just have no time for it. And if I do have a few minutes suddenly, I think there must be something I need to do right now instead of relaxing. I have books stacked I wanna read. I have giant lego boxes and model kits in the corner of this very room I'll never put together but want to. Because it always feels like there's something else I should be doing to keep my family afloat and everything from falling apart.",
            "title_similarity": "0.55901754",
            "sentiment_compound": 0.5994
        },
        {
            "id": "ha2zgxt",
            "score": 1,
            "text": "i dont get it, what am i supposed to feel when i have free time other than disappointment in myself for not doing more?\n\nhow do i become normal",
            "title_similarity": "0.6200284",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha307xo",
            "score": 1,
            "text": "What if I feel like work is wasteful and unproductive?",
            "title_similarity": "0.5933317",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha31h4f",
            "score": 1,
            "text": "I haven’t read the article but basically what I’m getting from the title is if you aren’t happy on vacation you might be sad. I wonder how much research it took to figure that out…",
            "title_similarity": "0.7111374",
            "sentiment_compound": 0.2263
        },
        {
            "id": "ha31ibk",
            "score": 1,
            "text": "Study says people who don’t like to have fun don’t have fun",
            "title_similarity": "0.68729043",
            "sentiment_compound": 0.8442
        },
        {
            "id": "ha31pbv",
            "score": 1,
            "text": "I love doin nothin but my calls me a lazy pos if I do nothing all day",
            "title_similarity": "0.5209984",
            "sentiment_compound": -0.1655
        },
        {
            "id": "ha31v86",
            "score": 1,
            "text": "Bertrand Russell's *[In Praise of Idleness](http://www.zpub.com/notes/idle.html)* comes to mind.",
            "title_similarity": "0.43020433",
            "sentiment_compound": 0.5574
        },
        {
            "id": "ha3255p",
            "score": 1,
            "text": "Did an employer tell you this",
            "title_similarity": "0.23191163",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha32mo1",
            "score": 1,
            "text": "What is our definition of leisure? I feel like that term can include a wide variety of behaviors and/or activities.",
            "title_similarity": "0.22420074",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha33008",
            "score": 1,
            "text": "If leisure is wasteful, then so is saving for retirement, because it's all investing in yourself.",
            "title_similarity": "0.6280309",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha334ns",
            "score": 1,
            "text": "Might be kind of the same thing but I value leisure time a lot. I get stressed when I feel like I'm not making the absolute most of it. Like if I have a day off work where I just relax around the house I feel like I wasted it and get depressed about that. Even if I really do just need a day to do nothing",
            "title_similarity": "0.68716806",
            "sentiment_compound": 0.6423
        },
        {
            "id": "ha33xp5",
            "score": 1,
            "text": "“In today’s episode of science confirms life experience…”",
            "title_similarity": "0.2062635",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha342yf",
            "score": 1,
            "text": "When I had my first job at 15- I worked for a tanning salon and the manager while in was in school would keep me there to 11-12 even when we “closed” at 9pm.\nEven on weekends when it was supposed to be 7.\nEvery night after I would get up 6am for school and cry. \nI was exhausted.\nBut my stepmom and dad refused to help- I was responsible in their eyes to provide for myself becuase they gave me housing (their own view reguardless of legalities).\n\nAt any rate every night was different but it ended the same- counting the till- a two perosn job so both sign off. I signed as a “witness.”\n\nAfter 6 months I finally had a sleep deprived collapse (my job was cleaning beds/ we had 30 of them. After getting up for school 6am to start at 8 get done by 3, haul to work and repeat I was losing it).\n\nMy body hurt so much.\n\nAt this point everyone but me quit so they said I should be happy to get more hours more money. \n\nAnyway full mental collapse i fall to the ground sobbing and the people waiting for the tanning beds start yelling at the manager (I had been drinking 3 monsters a day to push on).\n\nI was fired.\n\nA month later the corporate office reached out- turns out the logs of customers stopped at 9. However- he would tell them the till locks but they could always come for cash after 9 and he would keep open becuase he was such a nice guy.\n\nI had been signing off on him stealing money and had no idea.",
            "title_similarity": "0.45821694",
            "sentiment_compound": -0.9834
        },
        {
            "id": "ha35bkt",
            "score": 1,
            "text": "I feel like I'd enjoy leisure a lot more if I could stop thinking about how I don't have enough money to stop working yet.",
            "title_similarity": "0.60776985",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha367cc",
            "score": 1,
            "text": "Anything over 60 hours per week for me the world seems to lose its color, and everything looks grey.  The money is good though.",
            "title_similarity": "0.64356047",
            "sentiment_compound": 0.1027
        },
        {
            "id": "ha3875a",
            "score": 1,
            "text": "This is totally me. Sitting down feels like a waste of time. Even eating feels like a chore. So much to do in life and sit, lay, sleep or eat is the last thing on my mind.",
            "title_similarity": "0.59491813",
            "sentiment_compound": 0.296
        },
        {
            "id": "ha38bop",
            "score": 1,
            "text": "Maybe more stress is required. What business does anyone have enjoying themselves while people suffer?",
            "title_similarity": "0.6864627",
            "sentiment_compound": -0.4927
        },
        {
            "id": "ha38sbm",
            "score": 1,
            "text": "I leisure as much as I can without getting fired or singled. \n\nLife is finite folks. Get after that sweet sweet whatever makes you happy.",
            "title_similarity": "0.48150456",
            "sentiment_compound": 0.9122
        },
        {
            "id": "ha3aggx",
            "score": 1,
            "text": "Cause you r trapped in a guilty feeling and work more hrs and don’t take vacation. It’s a vicious social construct imo.",
            "title_similarity": "0.6248733",
            "sentiment_compound": -0.802
        },
        {
            "id": "ha3aqqv",
            "score": 1,
            "text": "IMO maybe a partial solution is to re-define \"being productive,\" or at the very least, dispense with this absolutely idiotic idea that those workaholic types seem to cling to, which is that it only applies to \"work.\"\n\nI'd say being productive is more than just work - it can also be applicable in working towards being healthy (working out), relaxing or unwinding (whatever you do to unwind), etc.",
            "title_similarity": "0.6594875",
            "sentiment_compound": 0.5118
        },
        {
            "id": "ha3c2xu",
            "score": 1,
            "text": "I agree and I feel it",
            "title_similarity": "0.048380665",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha3ctfb",
            "score": 1,
            "text": "waiting for r/gaming to show up and explain why 6 hours of games a day is totally fine because its fun",
            "title_similarity": "0.37921375",
            "sentiment_compound": 0.659
        },
        {
            "id": "ha3cwra",
            "score": 1,
            "text": "Well damn I could have told ya that",
            "title_similarity": "0.20739925",
            "sentiment_compound": -0.1531
        },
        {
            "id": "ha3duyo",
            "score": 1,
            "text": "I've been replicating this study over the past few years and found the same results. n=1.",
            "title_similarity": "0.26330534",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha3ftdl",
            "score": 1,
            "text": "It’s when it’s something like adhd or infringing on life so much that it becomes a problem. Like everything. The biggest issue is the push and pull between this modern way of life where we are forced to do so many unnatural things we don’t want and procrastinate on them and the way humans were developed to only do what is necessary.",
            "title_similarity": "0.60107553",
            "sentiment_compound": -0.1027
        },
        {
            "id": "ha3g5i7",
            "score": 1,
            "text": "I get anxious and depressed if I’m on vacation too long or if we have a rainy day with not much going on and I didn’t bring a file to work on. I’m trying to work on it, but work makes me feel normal",
            "title_similarity": "0.6649681",
            "sentiment_compound": -0.4215
        },
        {
            "id": "ha3gjpj",
            "score": 1,
            "text": "This title sounds like something the corporate bosses of America wrote.",
            "title_similarity": "0.245849",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha3gxps",
            "score": 1,
            "text": "r/lazy We're vindicated!!",
            "title_similarity": "0.41397345",
            "sentiment_compound": 0.5242
        },
        {
            "id": "ha3h6o9",
            "score": 1,
            "text": "Well I could have told you that.",
            "title_similarity": "0.176151",
            "sentiment_compound": 0.2732
        },
        {
            "id": "ha3i0sz",
            "score": 1,
            "text": "You can’t be hustlin if you dead. Always take care of yourself as you can always make more money.",
            "title_similarity": "0.39713645",
            "sentiment_compound": -0.2732
        },
        {
            "id": "ha3ia2t",
            "score": 1,
            "text": "What about when you feel like leisure time is incredibly rare and precious so you spend every second of it thinking about when it will end and you'll be forced back into the hellish rat race for survival?",
            "title_similarity": "0.6133363",
            "sentiment_compound": -0.1868
        },
        {
            "id": "ha3j02w",
            "score": 1,
            "text": "My narcissistic baby boomer dad made me feel like absolute dog sh*t if I was ever not working, so now I have a VERY hard time enjoying my free time.. it’s something I’ve just recently learned I need to work on.",
            "title_similarity": "0.56753397",
            "sentiment_compound": 0.827
        },
        {
            "id": "ha3jowe",
            "score": 2,
            "text": "i love when i read science and im like ok that makes sense.",
            "title_similarity": "0.3240674",
            "sentiment_compound": 0.836
        },
        {
            "id": "ha3js6h",
            "score": 3,
            "text": "Of course, it's being stuck under capitalism that has people buying into the notion you must always hustle to make it. There are clearly better ways we could be doing this as a species. We weren't meant to be constantly working, that's the rich exploiting us so they can have a monopoly on leisure time and resources.",
            "title_similarity": "0.6223169",
            "sentiment_compound": 0.6486
        },
        {
            "id": "ha3jtj1",
            "score": 2,
            "text": "Having both freedom and purpose generally leads to more happiness and less stress. freedom (like leisure) without purpose may make life seem meaningless, and purpose without freedom is just detrimental to happiness and stress levels.\n\nalso, people generally become unhappy and more stressed when they compare their lives with others (what they see on social media) and when they worry too much about the future, in this case any leisure and sense of purpose is interrupted by societal pressures and over expectations",
            "title_similarity": "0.8083766",
            "sentiment_compound": -0.5599
        },
        {
            "id": "ha3kd6v",
            "score": 1,
            "text": "Water is still wet and will still raise your water bill",
            "title_similarity": "0.20778313",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha3kwyp",
            "score": 1,
            "text": "Depression may lead to depression",
            "title_similarity": "0.6058985",
            "sentiment_compound": -0.8126
        },
        {
            "id": "ha3m8dd",
            "score": 1,
            "text": "Corporate propaganda in a time when they desperately need us to go back to work for them.",
            "title_similarity": "0.43101168",
            "sentiment_compound": -0.5574
        },
        {
            "id": "ha3n52f",
            "score": 1,
            "text": "Ha! Next they'll be saying sleeping, eating, drinking water, and pooping are productive! Hahahahahahahahanyways back into the salt mines with your catheters.",
            "title_similarity": "0.41427392",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha3nypj",
            "score": 1,
            "text": "Pretty much why I can't enjoy video games anymore.\n\nI can't there for hours and shut off the chores and the expectations of others. I always have half my brain immersed in the game and the other half trying to drag me out of it",
            "title_similarity": "0.55627596",
            "sentiment_compound": -0.0844
        },
        {
            "id": "ha3obks",
            "score": 1,
            "text": "I used to enjoy leisure until I learned about climate change. Now all I can think about is how much work needs to be done all around me. Leisure activities I used to enjoy, activities that contributed to this climate mess, now seem so childish, selfish and wasteful.",
            "title_similarity": "0.66343707",
            "sentiment_compound": -0.328
        },
        {
            "id": "ha3oh2m",
            "score": 2,
            "text": "Time you enjoy wasting is not wasted time.",
            "title_similarity": "0.37181634",
            "sentiment_compound": 0.4815
        },
        {
            "id": "ha3oiua",
            "score": 1,
            "text": "This is something that really really affects me. I don't even understand how to view life in a different way... Can someone please tell me how I can deal with these feelings? I feel super guilty if I just play a videogame or something so I end up not enjoying it and end up not doing it.\n\nEverything in my life must be work, work related or a house chore. The only free time I allow myself is to watch the occasional movie with my girlfriend as I think my brain actually understands that spending time with her is something important and worthwhile.\n\nI simply do not understand how it is possible to have a hobby or something and people around me warn me it's not healthy all the time but I simply can't deal with the guilt and just work... At times I used to work 100+ hour weeks (intermittently, ofc).",
            "title_similarity": "0.613042",
            "sentiment_compound": 0.3034
        },
        {
            "id": "ha3or8i",
            "score": 1,
            "text": "Existence is largely meaningless, so while going full hedo isn't likely the best way to go, enjoying yourself and finding meaning in your chosen hobbies/interests/relationships should be your focus.\n\nLiving to work is a sucker's game.",
            "title_similarity": "0.64372706",
            "sentiment_compound": -0.4344
        },
        {
            "id": "ha3pkb1",
            "score": 1,
            "text": "Leisure time doesn't just mean not at work. I binge watch a show occasionally then stress over the fact the vacuuming isn't done or I should have painted the room I've been putting off. I work long hours and don't have the energy for projects but feel guilty about not doing them when I decide to relax or visit friends.",
            "title_similarity": "0.65078473",
            "sentiment_compound": 0.4823
        },
        {
            "id": "ha3q3co",
            "score": 1,
            "text": "So, if you are too poor to go on vacation and not worry about the bills and missed work hours. Science has concluded that you may be stressed.... Good on you science....",
            "title_similarity": "0.74695545",
            "sentiment_compound": -0.3387
        },
        {
            "id": "ha3q8jy",
            "score": 5,
            "text": "Im struggling rn at the moment, and having free time feels like i should be doing something to help myself instead of enjoying myself. So I’m jus sad until I have work which sucks. It’s a bad feeling of just not going to be able to make it.",
            "title_similarity": "0.7200971",
            "sentiment_compound": 0.0609
        },
        {
            "id": "ha3qdbp",
            "score": 1,
            "text": "Cool, just measure functions of human attributes like conscientiousness and it’s common sense.",
            "title_similarity": "0.37362233",
            "sentiment_compound": 0.5859
        },
        {
            "id": "ha3qwzf",
            "score": 1,
            "text": "Wish I’d have known this 20 years ago.",
            "title_similarity": "0.38159835",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ha3t12x",
            "score": 1,
            "text": "Great way to feel like your leisure time is important is to have a job. When all your time is leisure time it’s easy to find it wasteful",
            "title_similarity": "0.56259143",
            "sentiment_compound": 0.8834
        },
        {
            "id": "ha3thgx",
            "score": 2,
            "text": "Life is a balancing act of leisure and work",
            "title_similarity": "0.30883843",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha3x49q",
            "score": 1,
            "text": "I guess I'll find out about that next month I go on vacation",
            "title_similarity": "0.28566465",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha3xebw",
            "score": 1,
            "text": "An aversion to the activities that lower stress and increase happiness may lead to more stress and depression. Hmm. Still though, I know several people who could benefit from being smacked upside the head with this message.",
            "title_similarity": "0.74623317",
            "sentiment_compound": -0.7233
        },
        {
            "id": "ha3xxvl",
            "score": 1,
            "text": "Now that I am retired, I look back and wish for the 'work life balance' lifestyle could have been obtained: the cruel answer is \"no way\".  In merit based and performance measured workplace, the higher ups aren't going to let that happen.  I has some government employees, and contract engineers friends who milked the system cause the money was already built into their standard workweek.  Plus, living in the Washington, DC Metro area, you have so many additional hours of travel to and from the workplace.   The American business system was built on the strenght of a workers back and nothing else.  The stock holders and owners of businesses get the rewards, the worker, just 'the pay'.  I tried to get home by 9 PM to hug my daughter and sit with her a spell, most every night; that was it!",
            "title_similarity": "0.53353477",
            "sentiment_compound": 0.8718
        },
        {
            "id": "ha41w2n",
            "score": 1,
            "text": "This title basically sums up the US American work culture :(",
            "title_similarity": "0.16456118",
            "sentiment_compound": -0.4404
        },
        {
            "id": "ha427l5",
            "score": 1,
            "text": "Hey I don’t want to read the article does this mean I can do hard drugs every now and then or still nah?",
            "title_similarity": "0.55173194",
            "sentiment_compound": -0.128
        },
        {
            "id": "ha42x9l",
            "score": 1,
            "text": "Too much of _anything_ is simply bad. I have been not so productive in my professional life for the past couple of months and that really gets me sad, angry and insecure. Mostly because i know what to do and i know i can do but i just simply dont do it. I really dont have a reason not to do it. Its like i lack resolve to do it and it really pains me.",
            "title_similarity": "0.6206625",
            "sentiment_compound": -0.7858
        },
        {
            "id": "ha43snx",
            "score": 1,
            "text": "Next time you feel like your not being productive enough remember that romans had like 6 months of holidays where they didn't work at all!",
            "title_similarity": "0.5209455",
            "sentiment_compound": 0.784
        },
        {
            "id": "ha447et",
            "score": 1,
            "text": "I do feel like I've wasted time if I'm not working or doing something productive. This was especially true when I was younger. I picked up drawing, self-taught, and my dad said I was doing something useless. Then when I started making side money from commissions, he changed his tune. The culture where I am places high importance on work and earning money. \n\nThe most relaxing time I've ever had in my life was when I had just finished a contract position, and had secured a permanent position at a new job. 3 weeks break between the two. Best 3 weeks I ever experienced.",
            "title_similarity": "0.59619695",
            "sentiment_compound": 0.9097
        },
        {
            "id": "ha44xmg",
            "score": 1,
            "text": "“Not enjoying relaxing events causes you to feel less relaxed”.\nGot it. I think I will relax.",
            "title_similarity": "0.7314567",
            "sentiment_compound": 0.8591
        },
        {
            "id": "ha476u5",
            "score": 1,
            "text": "Society and those who control workers have basically made the idea that “personal time” is actually bad and detrimental when in reality NO ANIMAL works all day everyday, we need breaks and abilities to do other things as well but the general idea in society is that it’s bad which only makes it harder to not let that noice effect you and science shows how much our brains are subconsciously influenced by the constant nature of being around said ideas, it starts to follow said ideas and if you let you mind do it it will go off the deep end too.\n\nReality is not what you make it but how you feel and let yourself feel & talk about the things in your reality is what changes how reality “hits” you kinda thing",
            "title_similarity": "0.7038083",
            "sentiment_compound": -0.7855
        },
        {
            "id": "ha47bhg",
            "score": 1,
            "text": "Study authors accidentally discover one mechanism of depression",
            "title_similarity": "0.6194248",
            "sentiment_compound": -0.7269
        },
        {
            "id": "ha4dhni",
            "score": 1,
            "text": "Do you guys ever get the feeling some of these studies obvious based on the title? Like why do we keep funding some these obvious studies.",
            "title_similarity": "0.48734915",
            "sentiment_compound": 0.4588
        },
        {
            "id": "ha4r4ji",
            "score": 1,
            "text": "Oh my golly, what's the point of living if not to enjoy living?",
            "title_similarity": "0.5239984",
            "sentiment_compound": -0.3875
        },
        {
            "id": "ha4u05s",
            "score": 1,
            "text": "Great, now if I can only find a way to enjoy leisure time in spite of the crushing guilt it makes me feel...",
            "title_similarity": "0.65033007",
            "sentiment_compound": 0.0772
        },
        {
            "id": "ha50prx",
            "score": 1,
            "text": "I’m addicted to stress and that’s the way I get things done. When I’m not under pressure I sleep too long and I hang around like a bum.",
            "title_similarity": "0.6334609",
            "sentiment_compound": 0.1501
        },
        {
            "id": "ha5a8m1",
            "score": 1,
            "text": "Its all about the things you enjoy! leisure or work doesn't matter",
            "title_similarity": "0.30948246",
            "sentiment_compound": 0.5296
        },
        {
            "id": "ha5aqgw",
            "score": 1,
            "text": "Why is this so obvious?\n\nIf you spend less time doing leisure activity you enjoy, you’ll be less happy, no way",
            "title_similarity": "0.7235453",
            "sentiment_compound": 0.6893
        },
        {
            "id": "ha5cugl",
            "score": 1,
            "text": "This explains why I’m so happy and chill, leisure is my favorite part of being alive",
            "title_similarity": "0.41260839",
            "sentiment_compound": 0.8845
        },
        {
            "id": "ha5pg2f",
            "score": 1,
            "text": "Leisure being a complete waste of time and borderline immoral is pretty core to how I was raised.",
            "title_similarity": "0.551185",
            "sentiment_compound": -0.3818
        },
        {
            "id": "ha5pmnu",
            "score": 1,
            "text": "my wife is like this. anytime she’s just laying in bed watching TV (which she barely does!) she feels super guilty and feels like she should be doing something productive. I have to reassure her every time that relaxing and watching some TV is ok!!!",
            "title_similarity": "0.465119",
            "sentiment_compound": 0.9164
        },
        {
            "id": "ha5zdrn",
            "score": 1,
            "text": "More communist propaganda",
            "title_similarity": "0.3304885",
            "sentiment_compound": -0.3134
        },
        {
            "id": "ha6cnnb",
            "score": 1,
            "text": "Here is an open-access link to the study itself:\n\n[https://authors.elsevier.com/a/1dcdA51f8hFer](https://authors.elsevier.com/a/1dcdA51f8hFer)",
            "title_similarity": "0.2641167",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha71y6n",
            "score": 1,
            "text": "How is this not surprising at all?? Imagine, not having hobbies, leisure or free time and becoming depressed! Shocking.",
            "title_similarity": "0.6491818",
            "sentiment_compound": -0.6329
        },
        {
            "id": "hac52xv",
            "score": 2,
            "text": "Why an old rotary phone for the shot?",
            "title_similarity": "0.34435663",
            "sentiment_compound": 0.0
        },
        {
            "id": "hagkss3",
            "score": 1,
            "text": "I just came to that same conclusion myself. That and that time is an illusion.",
            "title_similarity": "0.42609122",
            "sentiment_compound": 0.0
        }
    ]
}