{
    "Study suggests that feeling sexually desired by one’s partner is more important for men than we think\n": [
        {
            "id": "ha3xd3q",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.48991692",
            "sentiment_compound": 0.7088
        },
        {
            "id": "ha4g70z",
            "score": 0,
            "text": "\"Gender norms in heterosexual relationships dictate that men are responsible for desiring women and initiating sex while feeling desired themselves is relatively unimportant.\"\n\nThis might be the stupidest sentence ive ever read.",
            "title_similarity": "0.6991657",
            "sentiment_compound": -0.128
        },
        {
            "id": "ha4v42x",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4h51z",
            "score": 6,
            "text": "n=300 is a joke. Even tho I agree with the conclusion.",
            "title_similarity": "0.4152772",
            "sentiment_compound": 0.5719
        },
        {
            "id": "ha4gjv7",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4m16c",
            "score": -33,
            "text": "Backlash be damned....\nAre you taking care of yourself the same way you expect your partner to take care of herself? I've known plenty of men who complain their wives gained weight and/or dress a bit sloppy around the house. Well, physical attraction is important to women as well; so take a look in the mirror and make sure you're doing something to warrant the compliments you seek.",
            "title_similarity": "0.6069758",
            "sentiment_compound": 0.9423
        },
        {
            "id": "ha4fmx9",
            "score": 0,
            "text": "Who is \"we\"? I've always wanted to be sexually desired. That's the difference between the limp hustle and the unga bunga 3000.",
            "title_similarity": "0.65168643",
            "sentiment_compound": 0.2732
        },
        {
            "id": "ha4fm6a",
            "score": 26,
            "text": "My wife TELLS me I'm \"hot\" if not daily then close to it. But it starts to lose meaning when it never takes the next step. Lucky if we do it once or twice a month, when I try to initiate almost daily. That amount of rejection from someone that supposedly is so attracted to you is a real kick in the self esteem.",
            "title_similarity": "0.5861393",
            "sentiment_compound": 0.0835
        },
        {
            "id": "ha5auc7",
            "score": 0,
            "text": "This goes both ways. I'm not trying to invalidate what the study is saying, because it's true I think. But I also think that it's culturally accepted and almost expected that women's libidos are going to be lower than men's automatically and that it will fade faster for them than in men. I could only speak anecdotally of course, but my libido is the same as it ever was. My husband's has tanked. He can give me all the compliments he wants (not that be usually does, at least not without me fishing for one) but if there isn't some sort of independently-initiated sexual action to show me that his compliments are sincere, the compliments become kind of meaningless. The constant dry spells, being the sole pursuer of sex in the relationship, the limiting of affection to hugs and the occasional peck, etc has really tamped down my attraction to him.",
            "title_similarity": "0.6284645",
            "sentiment_compound": 0.9765
        },
        {
            "id": "ha5i9lj",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.09361865"
        },
        {
            "id": "ha49rgf",
            "score": -54,
            "text": "I complimented my ex often. Until I found him in a compromising position with another woman. I regret complimenting him.",
            "title_similarity": "0.5810672",
            "sentiment_compound": 0.5106
        },
        {
            "id": "ha6c1kz",
            "score": -1,
            "text": "A lot of these insecure men in this thread talking about how their partner doesn’t give them affection or desire them. Maybe it’s because you’re insecure! Women like confident men, women like men who know what they want. This isn’t complicated. Look in the mirror before you start blaming someone else.",
            "title_similarity": "0.76348555",
            "sentiment_compound": 0.7263
        },
        {
            "id": "ha4f38f",
            "score": -20,
            "text": "Shouldn't it go both ways?",
            "title_similarity": "0.28755406",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4fk6s",
            "score": -5,
            "text": "Man. :( I thought being an asexual woman sucks enough, but I'm sure now it must suck even more for my husband.",
            "title_similarity": "0.6682416",
            "sentiment_compound": -0.5574
        },
        {
            "id": "ha4jbzu",
            "score": -6,
            "text": "Yeah that kinda just goes all out the window once those papers get signed.",
            "title_similarity": "0.3062204",
            "sentiment_compound": 0.296
        },
        {
            "id": "ha47rym",
            "score": -48,
            "text": "[deleted]",
            "title_similarity": "0.09361865"
        },
        {
            "id": "ha4g5w2",
            "score": 9,
            "text": "And that's why going to a prostitute isn't the solution. A man needs to feel genuinely desired and a sex worker can't give them that.",
            "title_similarity": "0.76463205",
            "sentiment_compound": 0.0356
        },
        {
            "id": "ha4wxt6",
            "score": -22,
            "text": "If only men did more to seem sexually desirable\n\nedit: I'm a man working in the IT field. Some of ya'll are *not* trying at all",
            "title_similarity": "0.722289",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha4hzjp",
            "score": 30,
            "text": "Really? Someone spent money on a study to determine that a man's sexual appeal is important to them?",
            "title_similarity": "0.8234817",
            "sentiment_compound": 0.2869
        },
        {
            "id": "ha4bx61",
            "score": 37,
            "text": "Pretty sure lots off stuff is more important for men than we think since what's important to men doesn't matter to a significant amount of people.",
            "title_similarity": "0.7554172",
            "sentiment_compound": 0.845
        },
        {
            "id": "ha4orq6",
            "score": 3,
            "text": "Hell, being complimented nicely by anyone (don't be gross) could be the highlight of someone's day.\n\nYeah, I'm a cis white male.  Not trying to complain.\n\nI remember every shirt I've worn that got a compliment, from anyone.  I'm 38 and have rocked a mohawk for the last 6 years because I get compliments about it (I actually like it myself too, cool on the sides, still some longish hair to play with)",
            "title_similarity": "0.43556845",
            "sentiment_compound": 0.9529
        },
        {
            "id": "ha5ct9g",
            "score": -11,
            "text": "And just like that - all the “psychology isn’t a real science” men that show up under every trans-related post vanished in an instant.",
            "title_similarity": "0.39438158",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha40rr6",
            "score": -44,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4yvf1",
            "score": 8,
            "text": "My whole life tons of women (and definitely men) I've known have had this weird assumption that men are incapable of anything but anger and humor. Like we're machines that spit out jokes and opinions. It's gross- toxic masculinity hurts everyone, and feeling unwanted is a direct result of this assumption that we won't care.",
            "title_similarity": "0.46202174",
            "sentiment_compound": -0.9077
        },
        {
            "id": "ha4gzb4",
            "score": 17,
            "text": "Cool. Hope ladies do it more often.",
            "title_similarity": "0.3853714",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ha4qn8d",
            "score": 0,
            "text": "Oh yea it is. I naturally lose interest in sex after about 2 years in a relationship and it just kills my partners self esteem…so I don’t really do relationships anymore",
            "title_similarity": "0.4238051",
            "sentiment_compound": -0.4939
        },
        {
            "id": "ha4rn7t",
            "score": 0,
            "text": "Wish my wife would do this but she's just concerned on finances. I'm motivated and doing good at work but if she makes me feel desired sexually, I'm sure I'll do great and excel. But life is life, it's not fantasy.",
            "title_similarity": "0.62212694",
            "sentiment_compound": 0.9775
        },
        {
            "id": "ha4rxzz",
            "score": 0,
            "text": "I don't have a partner but it does hurt my feelings when women look at the wall when talking to me",
            "title_similarity": "0.38700515",
            "sentiment_compound": -0.6808
        },
        {
            "id": "ha4sl8m",
            "score": 0,
            "text": "I got invited to some secret swingers thing.  ( not something I’m familiar with in the least bit.) She said “we want beautiful people only.”  Daaamn did that boost my mood.  \n\nI declined but let her know my day was made.",
            "title_similarity": "0.44045967",
            "sentiment_compound": 0.5346
        },
        {
            "id": "ha4u8e3",
            "score": 0,
            "text": "“majority of men (95%) say that feeling desired by their female partner is important to their sexual experiences, and 88% say there are things their partners can do to help them feel more desired.”\n\nTHIS. I have an amazing wife. If you have a lady in your love you know what I mean. She does more than I could ever ask for, which is why I think a lot of men (married or committed) hesitate or flat out deny they want to be wanted. Not as a father, or a a husband, but almost as a sexual object. It sounds super weird to women because they get overdosed with how they’re being desired equals sex from men but their man just wants to be desired. \n\nMy wife recently bought me new (sexually suggestive) underwear for Father’s Day and literally every time I put them on I’m hoping for a compliment or just feel great because I know she bought them because them highlight (and cradle/moisture-wick) the goods. \n\nMost men want to be seen as the unfeeling protector but, in reality to quote a cliche song: “I want you to want me” to feel like it all been worth it.",
            "title_similarity": "0.69608593",
            "sentiment_compound": 0.9908
        },
        {
            "id": "ha4u9ix",
            "score": 0,
            "text": "Please tell your male partners how attracted you are to them! We don’t hear it nearly enough and sometimes we can think it’s sarcastic or not genuine because it doesn’t feel like it should because we have no idea how it should feel. \n\nI even make it a point to tell my best friends sometimes if they smell good like they’re cologne is on point, if they get a new haircut, or some snazzy new clothes. \n\nThe other week my friend slaved away on their kitchen ripping out the bench seats and table that was used as storage and installed wall mounted shelving and art work they bought at comicon a few years back. Me and another friend were gushing over how much effort went in to it, and while I was there she arrived and…it was sad how uninterested it was. Like she was happy and said ‘wow this is nice!’ But I felt bad. Like damn that was a lot of initiative for a surprise that almost meant nothing to very little",
            "title_similarity": "0.54156953",
            "sentiment_compound": 0.8353
        },
        {
            "id": "ha4xsr6",
            "score": 0,
            "text": "Is it equally important as for women?",
            "title_similarity": "0.4244992",
            "sentiment_compound": 0.2023
        },
        {
            "id": "ha5a328",
            "score": 0,
            "text": "the only reason you would think this is if you're only ever examining heterosexual relationships. shameful!",
            "title_similarity": "0.5362923",
            "sentiment_compound": -0.5411
        },
        {
            "id": "ha6l1lh",
            "score": 0,
            "text": "First science discovered the female orgasm, and now science discovered the male emotion... and it only took a thousand nerds sitting in boxes in total isolation for 400 years to prove it. What will science discover next?",
            "title_similarity": "0.29681128",
            "sentiment_compound": -0.4576
        },
        {
            "id": "ha6lhda",
            "score": 0,
            "text": "As a male I could have really told you this.   \n\nTo bad my ex-wife didn't realize it.",
            "title_similarity": "0.57120657",
            "sentiment_compound": -0.5423
        },
        {
            "id": "ha6moky",
            "score": 0,
            "text": "It's very critical to stay in shape not just for yourself ,but for your partner. Male or female, I believe this is a good way to keep the attraction going in the long run. Yes this study makes sense.",
            "title_similarity": "0.6180102",
            "sentiment_compound": 0.8911
        },
        {
            "id": "ha6nmgw",
            "score": 0,
            "text": "Now I know why I constantly want to put a gun to my head.",
            "title_similarity": "0.26460078",
            "sentiment_compound": -0.2732
        },
        {
            "id": "ha6o7jm",
            "score": 0,
            "text": "if you had asked me, i coupd have told you this without having conducted the study.\n\nAlso men like blowjobs.",
            "title_similarity": "0.6039715",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha4u1p4",
            "score": 2,
            "text": "Could be some truth to this. \r  \nOr...you could just slap him, then sit on his face.  :)",
            "title_similarity": "0.47188053",
            "sentiment_compound": 0.7096
        },
        {
            "id": "ha4nwgt",
            "score": 47,
            "text": "Is psychology so female-dominated that this extremely basic knowledge about men is a revelation? That's terrifying.\n\nJust checked. As of 2019, 80% of psychologists are women. So, yes.",
            "title_similarity": "0.45856878",
            "sentiment_compound": -0.25
        },
        {
            "id": "ha4e9k7",
            "score": -7,
            "text": "I (F) actually do this for my fiancé (M)all the time and am always feeling like I need words of affirmation back. I’m a pretty confident person but it’s hard to feel attractive with all the Kardashians and influencer culture. Otherwise I feel I seek validation through thirst traps.",
            "title_similarity": "0.59266746",
            "sentiment_compound": 0.8151
        },
        {
            "id": "ha4man4",
            "score": 7,
            "text": "My wife and I had an amazing sex life. Then we decided to conceive a child in our late 30s. Now she wants to have sex to get knocked up and not because she wants it with me. It sucks royal ass. I miss the days when she just wanted to be intimate with me for me.",
            "title_similarity": "0.55605567",
            "sentiment_compound": -0.4215
        },
        {
            "id": "ha5ca9n",
            "score": 10,
            "text": "Nobody tell r/twochromosomes.\n\nThey'll join ranks with the anti-vaxers before listening to this.",
            "title_similarity": "0.29796043",
            "sentiment_compound": 0.296
        },
        {
            "id": "ha4ijgm",
            "score": -35,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha5w9n3",
            "score": -4,
            "text": "Ha ha hs ha ha....get the f*ck out of here..... those men need therapy",
            "title_similarity": "0.51669806",
            "sentiment_compound": 0.7351
        },
        {
            "id": "ha4egs8",
            "score": 27,
            "text": "How do you gage \"more than we think\" \n\nI really wish this sub was actually science and not just cringe nonsense sociological theory posted in an article",
            "title_similarity": "0.51825964",
            "sentiment_compound": 0.6429
        },
        {
            "id": "ha4bduo",
            "score": 21,
            "text": "Is the headline just clickbait, or are the expectations of how much men want to feel desired part of the study?",
            "title_similarity": "0.77414346",
            "sentiment_compound": 0.34
        },
        {
            "id": "ha49dtp",
            "score": 191,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4wgv1",
            "score": -8,
            "text": "Being desired by someone else’s partner is equally important",
            "title_similarity": "0.69954914",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ha4eyql",
            "score": 66,
            "text": "Female dating strategy is gonna have a field day with this one",
            "title_similarity": "0.42221573",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4jhb8",
            "score": 10,
            "text": "I am a fairly sexually active man. COVID took away my income, home, and everything else. Thankfully, I have rebounded (WAY better job and apartment hunting) but still have not been with anyone more than a makeout sesh in 18 months. \n\nWhat I really miss is someone that wants to be my little spoon the morning after. That sounds like perfection. Sex is like 3rd on my list now and it took a lot of work and growth.",
            "title_similarity": "0.5012582",
            "sentiment_compound": 0.9539
        },
        {
            "id": "ha4g2z4",
            "score": 1,
            "text": "Sure, we want all kinds of things in life ... but after 30yrs, is this happening?\n\nIt becomes another item to cross off the chore list for some.",
            "title_similarity": "0.4113582",
            "sentiment_compound": 0.2023
        },
        {
            "id": "ha4q2jb",
            "score": 1,
            "text": "I mean, this isn't...news...it's just that society has done a very very very good job beating home the fact that while \"all\" women are beautiful, only a _very_ small sub-set of men are attractive, and if you don't fall in that category you don't deserve love.",
            "title_similarity": "0.6707575",
            "sentiment_compound": 0.5998
        },
        {
            "id": "ha4qfez",
            "score": 1,
            "text": "I didn't think I would be hearing about a research study more obvious than \"to nobody's surprise, vaccines work\" --- and yet here I am, reading of findings which are even *more painfully obvious*",
            "title_similarity": "0.5143081",
            "sentiment_compound": -0.3804
        },
        {
            "id": "ha4vbyo",
            "score": 1,
            "text": "Is this actually news to anyone ?",
            "title_similarity": "0.30086625",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4vg0a",
            "score": 1,
            "text": "Well, that's the whole point of a relationship.",
            "title_similarity": "0.30246067",
            "sentiment_compound": 0.2732
        },
        {
            "id": "ha4vqom",
            "score": 1,
            "text": "This is true. Men in some ways feel insecure about themselves when they are dating someone who is more attractive than they are.",
            "title_similarity": "0.8477098",
            "sentiment_compound": 0.4927
        },
        {
            "id": "ha4vrvx",
            "score": 1,
            "text": "Something i Will never experience",
            "title_similarity": "0.09959164",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4yulm",
            "score": 1,
            "text": "My wife initiated spontaneous sex last night for the first time in a very long time. No idea if really has anything to do with this post, I just wanted to tell someone.",
            "title_similarity": "0.3547179",
            "sentiment_compound": -0.3535
        },
        {
            "id": "ha57gyc",
            "score": 1,
            "text": "Based on the number of only fans accounts and prostitutes I see I'm going to go ahead and say it's not that important.  When can I Have my grant money?",
            "title_similarity": "0.3767571",
            "sentiment_compound": 0.2978
        },
        {
            "id": "ha5a3x8",
            "score": 1,
            "text": "I assume the “We” is women as a collective? And yes it is important",
            "title_similarity": "0.34184343",
            "sentiment_compound": 0.5423
        },
        {
            "id": "ha5bv6i",
            "score": 1,
            "text": "Compliments are everything. My wife tells me my cock is almost as big as my brother's. She doesn't have to say that but she knows it makes me proud because he has a very big cock.",
            "title_similarity": "0.6036799",
            "sentiment_compound": 0.524
        },
        {
            "id": "ha5koqm",
            "score": 1,
            "text": "Did… did this study come from an ask Reddit thread???\n\nI’m not saying the idea of the study isn’t important, but an ASK REDDIT THREAD???",
            "title_similarity": "0.43873286",
            "sentiment_compound": 0.3313
        },
        {
            "id": "ha65k21",
            "score": 1,
            "text": "Aaaaaand this is why my marriage is dead.",
            "title_similarity": "0.21093003",
            "sentiment_compound": -0.6486
        },
        {
            "id": "ha4glpz",
            "score": 24,
            "text": "[deleted]",
            "title_similarity": "0.09361865"
        },
        {
            "id": "ha4omu0",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4jgw2",
            "score": 20,
            "text": "A married female coworker once put on social media something along the lines of \"dont want him to cheat, touch the penis. Want him to love you more touch the penis. Want him to return a favor touch the penis.\" Some of her single lady friends said no way or made excuses.  Some of her married friends said they knew they should, but.....",
            "title_similarity": "0.6100999",
            "sentiment_compound": 0.6296
        },
        {
            "id": "ha4gm6w",
            "score": 16,
            "text": "That we need studies for this obvious kind of information about men having feelings proves how disposable we are. This western society does not care about men.",
            "title_similarity": "0.59323204",
            "sentiment_compound": -0.3875
        },
        {
            "id": "ha4hbdd",
            "score": -13,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4gbl2",
            "score": 3,
            "text": "Humans want to be desired. Not sure why this is news.",
            "title_similarity": "0.6141154",
            "sentiment_compound": 0.1124
        },
        {
            "id": "ha4dpi8",
            "score": 27,
            "text": "Than we think? Who is we? Certainly it must be women",
            "title_similarity": "0.3091957",
            "sentiment_compound": 0.4137
        },
        {
            "id": "ha4n39s",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4nj1z",
            "score": 2,
            "text": "Yeah, my husband gets this huge grin when I tell him I like/want him.\n\nI wish he would return the favour though.",
            "title_similarity": "0.6574507",
            "sentiment_compound": 0.9104
        },
        {
            "id": "ha6siwi",
            "score": 3,
            "text": "Only women could be surprised by this",
            "title_similarity": "0.24479096",
            "sentiment_compound": 0.2263
        },
        {
            "id": "ha4jcuu",
            "score": 17,
            "text": "You’re stupid if you think this isn’t the single most important thing to men, period.",
            "title_similarity": "0.69828606",
            "sentiment_compound": -0.3197
        },
        {
            "id": "ha4usmu",
            "score": -17,
            "text": "This is a joke, right? \nWant some? Earn some.\nPS: work for it, people.",
            "title_similarity": "0.5096041",
            "sentiment_compound": 0.4329
        },
        {
            "id": "ha4a45c",
            "score": 192,
            "text": "Also, to add to this for us hetero couples. \n\nLadies, INITIATE SEX MORE!\n\nMy wife was awful at this but over the last 2 years got way better cause I simply told her I feel undesired. If you even feel slightly in the mood, go for it. Hell, just give us attention that's affectionate. It helps us in ways that are hard to explain.",
            "title_similarity": "0.59290403",
            "sentiment_compound": 0.3382
        },
        {
            "id": "ha4m7qm",
            "score": 12,
            "text": "Yep and right now my wife’s thirsting for another women and sometimes other guys. It’s been a rough 5 months. Very rough.",
            "title_similarity": "0.35710567",
            "sentiment_compound": 0.296
        },
        {
            "id": "ha4c7mf",
            "score": 34,
            "text": "Who the duck is “we”? There are people out their that think their male partner doesn’t want to be sexually desired?!",
            "title_similarity": "0.62354994",
            "sentiment_compound": 0.4682
        },
        {
            "id": "ha4k9t3",
            "score": -3,
            "text": "5% . . . We found the psychpopaths, guys.",
            "title_similarity": "0.21792206",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4ptpc",
            "score": -3,
            "text": "\"We\" think that you are only beginning to understand how driven by sex men are",
            "title_similarity": "0.7256975",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5k38y",
            "score": 3,
            "text": "I can attest to the findings of the study.\n\nMy wife had a lumpectomy for breast cancer (caught very early, thank goodness) then less than a year later had a radical hysterectomy following the discovery of abnormal cells in her uterine wall. Combine that with her already lowish libido,  estrogen inhibitor medication, hot flashes, vaginal atrophy, post-surgery vaginismus and weight gain and you end up with a woman who has very little interest in getting frisky with me.\n\nIt's been four years since those operations and I still really miss being sexually desired by my wife. She's not interested in sex and therefore doesn't convey to me in any way that she still finds me handsome, desirable, etc. I understand why and I'm OK about it most days. On other days I feel so lonely... On those days I feel like a roommate more than a husband. I know she still loves me - she tells me every day. And I love her too. So that's my reality now.",
            "title_similarity": "0.25969374",
            "sentiment_compound": 0.9655
        },
        {
            "id": "ha4ed67",
            "score": 23,
            "text": "It’s so sad that there needs to be a study for this for some people to understand. Yes, men want to feel loved and desired too. No we are not emotionally dead. No, we don’t only think about beer and fighting other dudes at the bar.",
            "title_similarity": "0.6899158",
            "sentiment_compound": 0.6541
        },
        {
            "id": "ha4w9r5",
            "score": 8,
            "text": "\"we\"?\n\nAll men already know this, you could have just asked half the earth's population",
            "title_similarity": "0.35472667",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4oe52",
            "score": 0,
            "text": "Pretty sure the majority of my waking life is motivated by wanting to be sexually desired by women.",
            "title_similarity": "0.6383758",
            "sentiment_compound": 0.8625
        },
        {
            "id": "ha4si6d",
            "score": 0,
            "text": "All the feminists must be raging reading this",
            "title_similarity": "0.25801355",
            "sentiment_compound": -0.5267
        },
        {
            "id": "ha4xx8w",
            "score": 0,
            "text": "As another take on this, as a guy and when I've not been on the mood for anything sexual with some partners in the past, I've been questioned and interrogated as there '\"must be something wrong\". Nothing was up, I just wasn't really up for having sex at that particular moment. I've even had some jokingly accuse me of being gay for not being up for it. \n\nWe need to move away from seeing men as being one track-minded. We want affection and desire to be respected just as much as women want those things too.",
            "title_similarity": "0.6751126",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ha5zdty",
            "score": 0,
            "text": "And of course the next post in my Reddit feed after this one is a definition of the Dirty Chewbacca move.",
            "title_similarity": "0.2909259",
            "sentiment_compound": -0.4404
        },
        {
            "id": "ha61h55",
            "score": 0,
            "text": "It’s very important. This is one of the reasons my wife and I are getting divorced.",
            "title_similarity": "0.35859102",
            "sentiment_compound": 0.2716
        },
        {
            "id": "ha61sfp",
            "score": 0,
            "text": "I might leave this out on the home printer",
            "title_similarity": "0.22450396",
            "sentiment_compound": -0.0516
        },
        {
            "id": "ha61t8v",
            "score": 0,
            "text": "Unfortunately men are pretty disposable so if you don't get that out of a relationship its better to just suck it up unless you prefer nothing. Kind of sucks, but in contrast to the benefits of being a guy there's not much room to complain without looking like a complete asshole.",
            "title_similarity": "0.67965686",
            "sentiment_compound": -0.1795
        },
        {
            "id": "ha632cc",
            "score": 0,
            "text": "Tell that to my ex wife ...",
            "title_similarity": "0.14059222",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha63mby",
            "score": 0,
            "text": "I sent this to my girlfriend, do you guys think thats a bad way to do it?",
            "title_similarity": "0.44990087",
            "sentiment_compound": -0.5423
        },
        {
            "id": "ha63r0y",
            "score": 0,
            "text": "Lots of things are important to men!\n\n... they've just been taught to ignore them and slowly go crazy as they spiral toward bitterness.",
            "title_similarity": "0.6410997",
            "sentiment_compound": -0.7263
        },
        {
            "id": "ha656j1",
            "score": 0,
            "text": "36/m here. All this did was depress me more for my current situation. I see what the men type, but I can't leave my son. It's awful, but when I'm just with him it makes it tolerable.",
            "title_similarity": "0.6396372",
            "sentiment_compound": -0.7076
        },
        {
            "id": "ha66cpq",
            "score": 0,
            "text": "Hold on. Men want to be wanted like everyone else. It's like we're humans or something.",
            "title_similarity": "0.69794893",
            "sentiment_compound": 0.6486
        },
        {
            "id": "ha66qsr",
            "score": 0,
            "text": "I love when my lady complements me. Parallel with that, I feel the same way when she supports my goals and dreams.  I crave her support and being by my side",
            "title_similarity": "0.34880203",
            "sentiment_compound": 0.9022
        },
        {
            "id": "ha67o1j",
            "score": -4,
            "text": "Although it's true, i really hope men won't use this to justify them or someone else raping their partner.",
            "title_similarity": "0.65704757",
            "sentiment_compound": 0.0498
        },
        {
            "id": "ha6b5le",
            "score": 0,
            "text": "So does this mean that incels have a smidge of validation here? Not that their behaviour is valid, but the cause for their behaviour seems to have a light shown on it here.",
            "title_similarity": "0.5495224",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6bbn4",
            "score": 0,
            "text": "Almost any man could have told them this. No one listens to men. After 20 years of marriage, nothing has affected the marriage more than her absolute inability to initiate sex. The conundrum is that most women do not initiate sex and make their partner feel attractive so there are no real ways to get your needs met. Wives have no idea how many husbands are into adultery, AMPS, escorts, and Sugar Babies because of this dynamic. Married men literally have to pay people outside of the marriage to feel wanted and attractive, except for the brief endorphins that adultery provides.",
            "title_similarity": "0.5022841",
            "sentiment_compound": -0.0051
        },
        {
            "id": "ha6c34e",
            "score": 0,
            "text": "i couldve told you this",
            "title_similarity": "0.22880253",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6c5ab",
            "score": 0,
            "text": "I'm sorry, did wanting to be viewed as attractive become a gendered thing because why the hell did we pay for a study on this. Shouldn't it be assumed that normal people have emotional needs?",
            "title_similarity": "0.70080423",
            "sentiment_compound": -0.4215
        },
        {
            "id": "ha6chuw",
            "score": 0,
            "text": "I have tossed girls out of my room for not giving me explicit consent / looking like they were not having a good time. I'm fine if you are doing me out of boredom (I'm a solid 4.5, quirky introvert) but if you are hot but can't be bothered, I have video games to play.",
            "title_similarity": "0.4308164",
            "sentiment_compound": 0.678
        },
        {
            "id": "ha6z7md",
            "score": 0,
            "text": "Not true, i love it when my partner doesn't find me attractive",
            "title_similarity": "0.5691663",
            "sentiment_compound": -0.7967
        },
        {
            "id": "ha72scz",
            "score": 0,
            "text": "Another study suggests ice feels cold while fire feels hot.",
            "title_similarity": "0.37933457",
            "sentiment_compound": -0.34
        },
        {
            "id": "ha75inn",
            "score": 0,
            "text": "I feel like a lot of studies could save themselves time by just rewording the theory they want to test. If you changed \"do men want to be sexually desired by their partner?\" to \"do \\*people\\* want to be sexually desired by their partner?\" you are going to make the problem seem trivial to everyone researching it. Its called empathy guys, use it. EDIT: I understand this is a very simplistic view of a complicated topic and that studies like this can be helpful, but the flipside is that some of  these studies answer what a lot of us already knew to begin with.",
            "title_similarity": "0.7864723",
            "sentiment_compound": 0.7587
        },
        {
            "id": "ha75y75",
            "score": 0,
            "text": "Why the hell did it take a panel of scientists and a bunch of money for research to figure this one out? You could literally ask any man in the world, and they'd just tell you this.",
            "title_similarity": "0.50397813",
            "sentiment_compound": -0.6808
        },
        {
            "id": "ha4adka",
            "score": -15,
            "text": "[deleted]",
            "title_similarity": "0.09361865"
        },
        {
            "id": "ha4gioj",
            "score": 40,
            "text": "Best description I ever heard (on Reddit too) for sex in a relationship:\n\nSex is like your toilet. If it’s working, it’s nice but goes mostly unnoticed. You do your business and move on. However, if it ever goes out of order or has issues, it suddenly becomes your #1 priority. Cleaning up after dinner, washing laundry, taking the trash out - it all comes secondary to getting the toilet fixed. Sex is your toilet when it comes to priorities in a relationship. \n\nAnd if you need any proof of that, check out r/deadbedrooms.",
            "title_similarity": "0.57730055",
            "sentiment_compound": 0.6428
        },
        {
            "id": "ha4szwd",
            "score": -15,
            "text": "[deleted]",
            "title_similarity": "0.09361865"
        },
        {
            "id": "ha46vu2",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4ucxx",
            "score": 18,
            "text": "Love this wave on social media of women discovering men are entities capable of human emotions and nuances",
            "title_similarity": "0.5944294",
            "sentiment_compound": 0.7783
        },
        {
            "id": "ha5aipm",
            "score": 26,
            "text": "My wife keeps asking why we don't have sex.\n\nWhile I rub her feet, cook her dinner, clean the house, call her beautiful.\n\nI don't know, maybe a little reciprocated actions from you? But if I say that, I know I'll just get an earful.",
            "title_similarity": "0.330551",
            "sentiment_compound": 0.5106
        },
        {
            "id": "ha40xrw",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4hz61",
            "score": 6,
            "text": "This is heartbreaking. My husband gets complimented by me at least once a week.",
            "title_similarity": "0.45916033",
            "sentiment_compound": -0.0516
        },
        {
            "id": "ha4mg1v",
            "score": -6,
            "text": "Yes when people tell me they can't believe I'm real or I'm Hella fit after or during sex . I cherish it",
            "title_similarity": "0.63879097",
            "sentiment_compound": 0.796
        },
        {
            "id": "ha552x1",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.09552069"
        },
        {
            "id": "ha5ovpt",
            "score": 7,
            "text": "I (43F) had a very difficult time with assaults and abuse from men in my adolescence. I was basically conditioned to think that men all demanded sexual attention and their egos required constant stoking and if I wanted or needed anything, I had to pay for it with my body. Then I got married to a truly good, kind, humble man and his behavior, even 23 years later totally evades my understanding. I am still, 23 years in, so very confused by what a healthy sexual relationship should be. I'm trying. I'm learning. My husband has the patience of a Saint. I love my husband very much and show him in my own ways (which he understands). But it was only 3 years ago that I could admit to myself and my husband that I was still treating sex as a transaction. If I wanted something or wanted him to be on a good mood, I instigated sex. I can't remember a time in at least the last 15 years of marriage that I felt attracted to my husband. No, I don't compliment him. But in my messed up head, if I compliment him, I'm only giving in to that old demanding male ego which I learned at a very young age was a dangerous thing.\n\nAll this to say - yes, I get that men have feelings and need affection and compliments, but there are a lot of women like me out there who are just not emotionally capable of it. It's not that we don't care or are incapable of love and affection - we just might show it differently.",
            "title_similarity": "0.67091435",
            "sentiment_compound": 0.9767
        },
        {
            "id": "ha3ypdt",
            "score": 118,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4nqiv",
            "score": 1,
            "text": "For sure. Does not matter how HOT they are, if they act in unsavoury ways then it's a real easy turn off. The saving grace is that it's easy to turn around because mens attraction is easily manipulated.",
            "title_similarity": "0.6094116",
            "sentiment_compound": 0.9123
        },
        {
            "id": "ha4pg4k",
            "score": 1,
            "text": "I always try to compliment my husband at least once a day. His eyes light up every time and he does this little boyish smile that I know means that he’s happy and it melts my heart. \n\nI love the man and I find him attractive af so I try to let him know that every chance I get.",
            "title_similarity": "0.5200274",
            "sentiment_compound": 0.9695
        },
        {
            "id": "ha4ptzp",
            "score": -1,
            "text": "I mean this really should be obvious",
            "title_similarity": "0.21982576",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4qgkh",
            "score": -1,
            "text": "Who the hell is “we”?",
            "title_similarity": "0.24081233",
            "sentiment_compound": -0.6808
        },
        {
            "id": "ha4r9dj",
            "score": -1,
            "text": "Than \"we\" think? Who tf is we?",
            "title_similarity": "0.36163425",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4rckk",
            "score": -1,
            "text": "Who is the \"we\" in the title? I think almost anyone, men at very least, would have intuited this.",
            "title_similarity": "0.56832623",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4rimf",
            "score": -1,
            "text": "I'm always a bit worried that I compliment my S.O. too much but he's so goddamn handsome I can't help it sometimes!",
            "title_similarity": "0.6741767",
            "sentiment_compound": -0.5421
        },
        {
            "id": "ha4ucgj",
            "score": -1,
            "text": "She tells me I have big cock and whilst I know it to be false, it feels good to receive it at the time. The compliment I mean. Get your minds out the gutter.",
            "title_similarity": "0.653254",
            "sentiment_compound": 0.6597
        },
        {
            "id": "ha4ufsx",
            "score": -1,
            "text": "What’s this? Men have feelings?\n\nToo bad the current social environment is all focused on women and disregards and downplays men.",
            "title_similarity": "0.62366015",
            "sentiment_compound": -0.5661
        },
        {
            "id": "ha4uic1",
            "score": -1,
            "text": "Confession: I just shared this link with girls in order to convey a sense of modern, romantic fragility.\n\nI mean also it resonates with me.. but also I used it.",
            "title_similarity": "0.34995535",
            "sentiment_compound": 0.3716
        },
        {
            "id": "ha4ujhk",
            "score": -1,
            "text": "Study conducted by the the completely disconnected and obtuse pocket calculators of normal human beings. #bezostron",
            "title_similarity": "0.16905606",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4uqsu",
            "score": -1,
            "text": "I would take it a step further and say this is why getting nudes from your partners are so gratifying even if it can get toxic. Its not even the nude, its the fact that you sent it.",
            "title_similarity": "0.5995794",
            "sentiment_compound": 0.6418
        },
        {
            "id": "ha4v04r",
            "score": 1,
            "text": "A study that incels and married men can both agree on! That's an odd sentence.",
            "title_similarity": "0.6900357",
            "sentiment_compound": 0.2003
        },
        {
            "id": "ha4v2dv",
            "score": -1,
            "text": "We already knew this, if only people didn't keep dismissing us as neanderthals.",
            "title_similarity": "0.443223",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4vaxu",
            "score": -1,
            "text": "\"more important than we think\" I don't know who \"we\" is but it seems like commonsense to me.",
            "title_similarity": "0.5246835",
            "sentiment_compound": 0.5854
        },
        {
            "id": "ha4viu3",
            "score": -1,
            "text": ".....I'm going to cry on how true this article is....",
            "title_similarity": "0.4300013",
            "sentiment_compound": -0.0772
        },
        {
            "id": "ha4wy3h",
            "score": 1,
            "text": "Now imagine being a single 18 year old and having a hard time finding anyone to have sex with you at parties.\n\nThe reading nothing but \"men think they're entitled to sex\".\n\nBut higher suicide rates for young men are due to toxic masculinity.\n\nRight.",
            "title_similarity": "0.5954273",
            "sentiment_compound": -0.6059
        },
        {
            "id": "ha4wzt3",
            "score": -1,
            "text": "Than who thinks? Most men will tell you it's pretty damn important.",
            "title_similarity": "0.6526938",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha4x70o",
            "score": 1,
            "text": "All the women going on about \"I tell my husband he is handsome\".\n\nMost studies show you probably had casual sex with hotter dudes before him.\n\nIn a relationship \"looks don't matter as much\"",
            "title_similarity": "0.6146289",
            "sentiment_compound": 0.6028
        },
        {
            "id": "ha4xbjw",
            "score": -1,
            "text": "I moved to Australia for a woman and had a kid.  3 years of celibacy out of our 6 year relationship.  We don’t even sleep in the same room most nights now, but trying to keep it together for the boy.",
            "title_similarity": "0.2244436",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4y8av",
            "score": -1,
            "text": "I’ve been through actual domestic abuse, but nothing hurt as bad as when the woman I loved stopped desiring me.",
            "title_similarity": "0.37133804",
            "sentiment_compound": 0.8702
        },
        {
            "id": "ha4yvyc",
            "score": -1,
            "text": "So I got to lick booty like groceries!?!",
            "title_similarity": "0.26897472",
            "sentiment_compound": 0.4738
        },
        {
            "id": "ha4yzt9",
            "score": -1,
            "text": "Get ready to face the hot flash hell...boys.\n..\n Don't leave them at this time and don't expect any compliments. Ride it out and have a partner to help you get old with, one that won't abandon you when your brain turns to mush just to find yourself being thrown around by some pissed off male nurse at a run down \"resting home\".",
            "title_similarity": "0.52974844",
            "sentiment_compound": 0.0762
        },
        {
            "id": "ha4z44s",
            "score": -1,
            "text": "I envy these people. I feel no sexual desire towards my girlfriend. She doesn’t care about her physical appearance and it shows. And I’m an ugly guy so asking for someone attractive is a tall order.",
            "title_similarity": "0.5577394",
            "sentiment_compound": -0.4133
        },
        {
            "id": "ha4zl37",
            "score": -1,
            "text": "I was 14 and am ex told me I reminded her of Randy the Macho Man Savage. Keep in mind I was still in 8th grade, I had no facial hair, and had a voice that sounded like Doogie Howser. Still I ecstatic tears later about the compliment. \n\nSadly we drifted apart and now she’s a leader of a Qanon group. \n\nDo that love story story lifetime.",
            "title_similarity": "0.24034867",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ha4zslg",
            "score": -1,
            "text": "Meanwhile down at r/askmen:\nWhat do you want in a girl?\n\nMen: I want to feel wanted by them",
            "title_similarity": "0.6915215",
            "sentiment_compound": 0.1531
        },
        {
            "id": "ha500us",
            "score": -1,
            "text": "I love how the title is just a women basically saying she doesn't get that men are human.",
            "title_similarity": "0.4598539",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ha51kgh",
            "score": -1,
            "text": "I can’t understand why a woman WOULDNT compliment her man to the same magnitude…",
            "title_similarity": "0.57904506",
            "sentiment_compound": -0.3724
        },
        {
            "id": "ha51oig",
            "score": -1,
            "text": "Looks like reddit crashed the site. It’s down for maintenance",
            "title_similarity": "0.2297354",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha51rts",
            "score": -1,
            "text": "You’re goddamn right it is",
            "title_similarity": "0.16564828",
            "sentiment_compound": -0.4767
        },
        {
            "id": "ha53pmx",
            "score": -1,
            "text": "Comments don't cut it. My wife can tell me how attractive I am all day long. If the attraction doesn't lead to physical intimacy of some kind, then all the comments are just a tease. All the comments about how attractive i am or how much she loves me kinda feel like lies when she's never in the mood and is obviously put off by the thought of sexual activity with me, of any kind.",
            "title_similarity": "0.5724908",
            "sentiment_compound": 0.9552
        },
        {
            "id": "ha541pv",
            "score": -1,
            "text": "I have often said, women dont understand men want the same things emotionally women claim to want. However they will rarely ever do these things. Then withhold sex from a guy which is the only thing the guy feels makes him feel like he wanted by the woman. The way society has evolved in this department has really hurt men and put nearly all of the attention on women. Social media has really bombed this all into a mess as well imo.",
            "title_similarity": "0.6435773",
            "sentiment_compound": -0.3643
        },
        {
            "id": "ha5435y",
            "score": -1,
            "text": "Every teen ever :\n“It took you that long?”",
            "title_similarity": "0.23879512",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha54niv",
            "score": -1,
            "text": "If you’re a woman in a dead bedroom situation, close your eyes and point to any part of this article. You’ll find your answer.",
            "title_similarity": "0.14626615",
            "sentiment_compound": -0.6486
        },
        {
            "id": "ha557c4",
            "score": -1,
            "text": "Yes, partly why men want women with low numbers. Less guys to compare us to.",
            "title_similarity": "0.69012177",
            "sentiment_compound": 0.1621
        },
        {
            "id": "ha55b6a",
            "score": -1,
            "text": "I don’t think it’s necessarily compliments, I think it’s more the feeling your partner wants the sex just as much as you and isn’t doing it just for you. Me personally when I can tell my partner isn’t fully with it get turned off too. Like I love it when my partner is just as much of a sex pest towards me, as I am towards her.",
            "title_similarity": "0.7813944",
            "sentiment_compound": 0.8801
        },
        {
            "id": "ha55p8f",
            "score": -1,
            "text": "My ex was asexual and called me “adorable”. I know she meant well but it felt really demasculating.",
            "title_similarity": "0.529235",
            "sentiment_compound": 0.1406
        },
        {
            "id": "ha595rp",
            "score": -1,
            "text": "Who is the “we” in this headline? Certainly not men!",
            "title_similarity": "0.4072578",
            "sentiment_compound": 0.4003
        },
        {
            "id": "ha5a8pk",
            "score": -1,
            "text": "I was in a brief relationship about a year ago, where I was consistently shown that I was very attractive and desirable to my partner. It did absolute wonders for my confidence and I felt amazing. \nThere were other problems there which led to the end of that though. \n\nNow I’m in another relationship with an absolutely incredible person but I just don’t get the same level of validation on that front and it’s quite frustrating sometimes. She will compliment me and initiate occasionally but it’s very much on her terms. I’m mostly shut down when I try to initiate too and in very insensitive and swift ways. \n\nIt sucks because I absolutely adore the person and don’t want to ask her to do things which she doesn’t feel. Maybe she’s just not that attracted to me? Or maybe I’m expecting too much as a result of that past relationship? \nAnyway, I always make a conscious effort to constantly give her positive reinforcement when it comes to how attractive I find her. And she’s openly told me many times that she’s never felt such desire from anybody before, and that it’s helping her confidence grow a lot. \nI just wish this could start flowing both ways but I have no idea how to approach it.",
            "title_similarity": "0.6093713",
            "sentiment_compound": 0.9683
        },
        {
            "id": "ha5cwik",
            "score": -1,
            "text": "Men are wired up to want to please their partners.",
            "title_similarity": "0.7669989",
            "sentiment_compound": 0.3818
        },
        {
            "id": "ha5djz0",
            "score": -1,
            "text": "This is why I’m getting divorced, I’ve told her multiple times over the years but she doesn’t seem to take it in. I want to feel sexy to her. I always tell her how beautiful she is but she never returned the compliment. Why is this such a hard thing for women to do?",
            "title_similarity": "0.45723906",
            "sentiment_compound": 0.8161
        },
        {
            "id": "ha5e1eo",
            "score": -1,
            "text": "1. Who is this 'we' that did not think it was important for men?  \n  \n2. Why is there even a gendered approach in this study, one would think that this is something that's about the same across the gender divide?  \n  \n3. Why does it feel like this article tries to put the onus on women? Doesn't it just mean that we should never stop trying to be sexually attractive?",
            "title_similarity": "0.7392928",
            "sentiment_compound": 0.8421
        },
        {
            "id": "ha5ef4h",
            "score": -1,
            "text": "Of course it is, I am miserable right now partly because of lack of appreciation or intimacy for almost two weeks. It is crazy how much disapproval from my wife messes with me. \n\nI mean the opinion of someone who is important in your life is always going to have a great effect. You are uniquely vulnerable in a way that has is not comparable to other relationships.\n\nThis goes for both men and women obviously.",
            "title_similarity": "0.5421879",
            "sentiment_compound": 0.1689
        },
        {
            "id": "ha5hf4c",
            "score": -1,
            "text": "My wife tells me maybe three times a year that I’m handsome. I’ve asked her to hug me more. She instantly says “if you want them initiate”\n\nI really don’t know what to do some days.",
            "title_similarity": "0.378524",
            "sentiment_compound": 0.765
        },
        {
            "id": "ha5ht23",
            "score": -1,
            "text": "Man this study feels weird to see because I’ve been saying this to my wife for over a decade and she always comes back with a generic man response. Very interesting read",
            "title_similarity": "0.40951797",
            "sentiment_compound": 0.3167
        },
        {
            "id": "ha5i3ur",
            "score": -1,
            "text": "Wow men aren’t unfeeling monsters. Who knew.",
            "title_similarity": "0.54438287",
            "sentiment_compound": 0.5859
        },
        {
            "id": "ha5i4qa",
            "score": -1,
            "text": "Really need all the PHDs to figure this one out uh?\nNext time “magnets: this is how they work”",
            "title_similarity": "0.36085334",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5j679",
            "score": -1,
            "text": "Yupp. My wife compliments me regularly and it is a fantastic feeling! Before her it was like walking through a compliment desert. Basically most of my 20's I thought I was kind of ugly because I never heard a single positive word about it. Same women would of course fawn over various celebrities etc. while complaining that \"there are no guys to date here\" when in groups containing men etc. Very hard to not develop a bit of a complex. \n\nIt wasn't until I took a long good look at myself and realized I'm actually pretty good looking that I managed to break the cycle. \n\nOf course looking back at that period I realize that it was immaturity on all parties. Immature young women that didn't know how to express themselves or how to actually aknowledge and accept their own desires and immature young men who don't have any self image outside of what interest they can generate in the opposite sex etc. Basically just a messy soup of immaturity that leads to bad outcomes. However many women (and men of course) never quite leave that mindset behind and it affects their relationships negatively.",
            "title_similarity": "0.43126655",
            "sentiment_compound": 0.9621
        },
        {
            "id": "ha5j86l",
            "score": -1,
            "text": "I've also noticed that when my partner shows more romantic and sexual interest in me, I lay off trying to seduce them because I'm actually getting attention from them already. I thought I was just a super horny guy all the time but turns out I just crave touch/attention. Growing up all I ever heard was how men needed to romance women/what they needed to do to keep their woman interested and I was sorely disappointed how few things women seemed to do to keep me romanced/interested.",
            "title_similarity": "0.7299621",
            "sentiment_compound": 0.8956
        },
        {
            "id": "ha5jgxx",
            "score": -1,
            "text": "I lost about 60 lbs and my girlfriend told me she hates hugging me because my bones poke her and she doesn't like putting her head on my \"bird ribcage\" chest.",
            "title_similarity": "0.2712344",
            "sentiment_compound": -0.5439
        },
        {
            "id": "ha5k3nd",
            "score": -1,
            "text": "“we” must refer to womem",
            "title_similarity": "0.20770341",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5k7ey",
            "score": -1,
            "text": "Who is the ‘We’ in that sentence?  Every guy needs this.  A lot.",
            "title_similarity": "0.52610874",
            "sentiment_compound": 0.0772
        },
        {
            "id": "ha5kcyk",
            "score": -1,
            "text": "There was a period of my marriage (several years) where my wife was so stressed from work and other things that she had basically no desire for sex or intimacy. I tried so many thing to help her. I did all the cooking, virtually all the cleaning, I would spend time with her and just cuddle without any expectation of sex, I would give her massages, I made sure she took time for herself and planned time for her to get away, and I did so many other things. But she had no interest in sex. We would go 6 or more weeks without it. I was constantly rejected when I tried to initiate. It left me feeling truly depressed and miserable. \n\nThat was almost a decade ago now and I still feel the effects of that time of our marriage in our intimacy today. I never truly believe she wants sex even when she is adamant and obviously into it. To some degree, it always feels like she is trying to fulfill an obligation she thinks she has. I know in my head that is not true anymore. But I can’t shake the feelings that have been conditioned into me during those few years.",
            "title_similarity": "0.3279217",
            "sentiment_compound": -0.9196
        },
        {
            "id": "ha5ki5f",
            "score": -1,
            "text": "Ladies, please tell your men how sexy you think they are. I tell my man at least a few times a week that he looks amazing. You gotta let these guys know! You know they ain’t readin our minds!",
            "title_similarity": "0.6499758",
            "sentiment_compound": 0.8774
        },
        {
            "id": "ha5l1d6",
            "score": -1,
            "text": "I left a gf of 8 years because of this",
            "title_similarity": "0.1304773",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5mhlk",
            "score": -1,
            "text": "I came on here to joke about how this must have been a study done by women, and indeed it was. We owe all of civilization to men wanting to feel sexually desired by their partner.",
            "title_similarity": "0.7343483",
            "sentiment_compound": 0.5106
        },
        {
            "id": "ha5nww3",
            "score": -1,
            "text": "Men have only been screaming this from the rooftops. Compliment your man!",
            "title_similarity": "0.45956576",
            "sentiment_compound": 0.2003
        },
        {
            "id": "ha5rgzx",
            "score": -1,
            "text": "Just how unimportant did \"we\" think men wanting to feel desired by their partner was?",
            "title_similarity": "0.7510484",
            "sentiment_compound": -0.0516
        },
        {
            "id": "ha5rqa5",
            "score": -1,
            "text": "Considering how often women care to have sex compared to men yeah we need something to know that we're still attractive to our partner even if they're sexual drive is different from ours",
            "title_similarity": "0.786582",
            "sentiment_compound": 0.8074
        },
        {
            "id": "ha5szhm",
            "score": 1,
            "text": "Noone cares about men , don't waste your time",
            "title_similarity": "0.59943664",
            "sentiment_compound": 0.6522
        },
        {
            "id": "ha5u99g",
            "score": -1,
            "text": "Turns out men have feelings too.\n\nWhat a shocker.",
            "title_similarity": "0.63653994",
            "sentiment_compound": -0.1531
        },
        {
            "id": "ha5vaw3",
            "score": -1,
            "text": "How do I send it to my girlfriend without sending it to her :P",
            "title_similarity": "0.32525605",
            "sentiment_compound": 0.4084
        },
        {
            "id": "ha5vhag",
            "score": -1,
            "text": "I (f) genuinely think my partner (m) is so incredibly handsome and sexy, but when I tell him this he sometimes thinks I am patronizing him. :(",
            "title_similarity": "0.7493045",
            "sentiment_compound": -0.0342
        },
        {
            "id": "ha5vlwm",
            "score": -1,
            "text": "Pretty sure any man who has cheated or anyone who has asked someone why they cheated, knows this.",
            "title_similarity": "0.5068384",
            "sentiment_compound": -0.2732
        },
        {
            "id": "ha5xrq8",
            "score": -1,
            "text": "That's impossible. Women don't sexually desire men.",
            "title_similarity": "0.44405413",
            "sentiment_compound": -0.3089
        },
        {
            "id": "ha5xt7n",
            "score": -1,
            "text": "Having access to sex and and being sexually desired is a how a man is validated in the way he is living his life and the man he is or is becoming.\n\nWomen are sex objects.  Men are success objects.\n\nWomen are born with inherent value.  Men have to work to achieve their value.\n\nSex and desire are an affirmation to men that they have value.\n\nIt's not very complicated.",
            "title_similarity": "0.8055113",
            "sentiment_compound": 0.9393
        },
        {
            "id": "ha5zhs3",
            "score": -1,
            "text": "... than we think...\n\nWho the hell is \"we\" and why are they confused?",
            "title_similarity": "0.44852856",
            "sentiment_compound": -0.7845
        },
        {
            "id": "ha64eep",
            "score": -1,
            "text": "More important than “super important?” What a dumb article… who’s the “we” in *we think?* culture? Culture is just a mash up of advertising and entertainment designed to sell… its not an accurate measure of how people think.",
            "title_similarity": "0.6427798",
            "sentiment_compound": 0.2808
        },
        {
            "id": "ha6e0da",
            "score": 1,
            "text": "Men are becoming insecure",
            "title_similarity": "0.5652623",
            "sentiment_compound": -0.4215
        },
        {
            "id": "ha6fqko",
            "score": 1,
            "text": "> Gender norms in heterosexual relationships dictate that men are responsible for desiring women and initiating sex while feeling desired themselves is relatively unimportant.\n\nI totally disagree with this premise.",
            "title_similarity": "0.6824644",
            "sentiment_compound": -0.0754
        },
        {
            "id": "ha6vx9b",
            "score": -1,
            "text": "I really wish this sub wasn't completely filled up with these lazy, bias-confirming blogspam posts from psypost.",
            "title_similarity": "0.44976795",
            "sentiment_compound": 0.1263
        },
        {
            "id": "ha6y1s7",
            "score": -1,
            "text": "Can someone send this to the female roommate who lives with me rent-free and board-free, currently? She weirdly sleeps in the same bed with me, so I'm thinking there's a chance ....",
            "title_similarity": "0.29708108",
            "sentiment_compound": -0.0516
        },
        {
            "id": "ha42phw",
            "score": 42,
            "text": "[removed]",
            "title_similarity": "0.09552069"
        },
        {
            "id": "ha4fenk",
            "score": 6,
            "text": "who is this \"we\" assuming men are just sexccraving machines without emotions?",
            "title_similarity": "0.61232007",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4n5z7",
            "score": 19,
            "text": "I'm 30 and Ive never had sex or felt sexually desired. I've never been on a date.",
            "title_similarity": "0.19767606",
            "sentiment_compound": 0.2732
        },
        {
            "id": "ha4ez4c",
            "score": 11,
            "text": "Yes, people generally like when they feel liked and wanted. Probably more so when it's their significant other.\n\nI think I remember every compliment I've received in the last two decades. I don't need both hands to count that high but it really does help on occasion to remember. \n\nHuh, I just had a thought. I wonder if this might play a tiny role in why a lot of guys really like the kinds of anime that have a lot of women and one dude. I'd expect that the guy would receive a lot of compliments. Maybe it's a vicarious thing?",
            "title_similarity": "0.58510846",
            "sentiment_compound": 0.965
        },
        {
            "id": "ha4h9e9",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.09361863"
        },
        {
            "id": "ha4objf",
            "score": 2,
            "text": "Isn’t basically every single male animal In the animal kingdom the ones who need to look attractive to get a mate ?",
            "title_similarity": "0.612735",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ha4rokv",
            "score": -2,
            "text": "Huge area women are allowed to neglect in our society...\n\nNot saying there aren't areas men neglect as well. There definitely are. But this is just a big one with women.",
            "title_similarity": "0.4753437",
            "sentiment_compound": 0.4195
        },
        {
            "id": "ha5ap1d",
            "score": -2,
            "text": "Wow… men have feelings is really an amazing scientific discovery? Thanks girls….",
            "title_similarity": "0.5861106",
            "sentiment_compound": 0.7893
        },
        {
            "id": "ha5pvne",
            "score": -2,
            "text": "This made me feel like a fantastic girlfriend. He's the best thing ever and I tell him every day.",
            "title_similarity": "0.43754715",
            "sentiment_compound": 0.8834
        },
        {
            "id": "ha60ghm",
            "score": 2,
            "text": "My husband and I tell each other all the time how hot & sexy the other is. I tell him he's handsome multiple times a day. When he calls me on the phone at lunch break I answer, \"Hi handsome\". I text him things like \"Ugh why are you so hot?? I can't wait for you to get home so I can rip your clothes off & rape you!!\"\n\nHe tells me I'm beautiful like 10 times a day. He never turns me down for sex unless he's seriously dead tired from working (he's an aircraft mechanic). Even then he'll  tell me \"Ride me\".\n\nWe've been married 8 years & have kids. We have mind blowing sex. I feel so lucky.",
            "title_similarity": "0.43107778",
            "sentiment_compound": 0.7821
        },
        {
            "id": "ha6lg60",
            "score": 2,
            "text": "Hence why Incels don't just go get a prostitute and prostitution is not a solution",
            "title_similarity": "0.38612092",
            "sentiment_compound": -0.2411
        },
        {
            "id": "ha49fu1",
            "score": 49,
            "text": "A question about something I’ve often seen discussed in this sub, response numbers: For a study like this, how telling is having a survey size of 300? Also, is there more research on this?",
            "title_similarity": "0.39653838",
            "sentiment_compound": 0.4329
        },
        {
            "id": "ha4dsxs",
            "score": 21,
            "text": "Who is the \"we\" in this equation?",
            "title_similarity": "0.28897214",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4yp54",
            "score": 20,
            "text": "The worst part of this study : it was necessary in 2021. We have language, the ability to say what we want and need and feel, for tens of thousands of years and we STILL need a scientific study to tell us what our partner needs...  \n  \nF**k people are bad at communicating, especially to the very close ones  \n  \nIt's even worse when you realize A LOT of people, women included, think / thought that another fellow human does not need / want to feel desired, even though human, just because he has a penis. Dude....",
            "title_similarity": "0.58895093",
            "sentiment_compound": -0.8032
        },
        {
            "id": "ha4fcen",
            "score": 4,
            "text": "Altough I now resent my ex... she did make me feel like I'm some sort of Brad Pitt caliber guy.",
            "title_similarity": "0.5673692",
            "sentiment_compound": 0.2023
        },
        {
            "id": "ha4m7wj",
            "score": 4,
            "text": "I can not emphasise this enough. I have 0 self esteem in my body.\n\nLike none. It doesn't hold me back really cause I have always been a \"personality guy\" but there has never been a time when I woulda considered myself attractive.\n\nEven if I doubt it, or don't even believe it, it is nice to hear that there's a chance that someone feels differently.\n\nIt's a major boost to the esteem on days when it may be necessary.",
            "title_similarity": "0.5520153",
            "sentiment_compound": 0.9107
        },
        {
            "id": "ha4nc8h",
            "score": 4,
            "text": "My boyfriend is the sexiest man on the planet. At least to me. He is so hot and I tell him this all the time. I used to be terrible at this, until long-distance relationships and dating someone whose love language was words of affirmation. Sometimes it feels awkward to complement someone, but if you genuinely mean it, and they are able to receive it, is just magic. I love watching him melt when I tell him he’s the sexiest guy on the beach. His love language is words of affirmation, so it weighs even more. And I think more men are this way than it might seem - a lot of people try to influence the results of the love language test away from words of affirmation because it is perceived as being vain. But it really helps me to know how much it affects him; it makes it less awkward for me! And I always speak from my heart, so whatever I say is always genuine. I’m specific - that shirt fits you so well, you have such a hot body. Man I loved watching you walk up the beach toward me, I’m so turned on by you. (While massaging him) Ugh you have sexy arms, your workouts are really paying off. Your eyes are stunning, I love when you look at me like that. When you smile at me like that, I want to run back up to the room. You have great taste - you look so handsome today. \n\nAnd so on. Anything I think in my head and then think we’ll that would probably be nice for him to hear, I just make myself actually say out loud. Edit: clarity, spelling",
            "title_similarity": "0.71209824",
            "sentiment_compound": 0.9975
        },
        {
            "id": "ha4nx1w",
            "score": 3,
            "text": "Then why the lack of effort?",
            "title_similarity": "0.33444676",
            "sentiment_compound": -0.3182
        },
        {
            "id": "ha4q4p5",
            "score": 3,
            "text": "Honestly, I think this plays a large part in why men cheat and can be viewed as “unfaithful creatures”. As soon as one mate stops showing interest and another starts, we tend to gravitate towards that new person. Perhaps thinking on some subconscious level “After all, why would the other person care; they stopped showing interest in us.”",
            "title_similarity": "0.7270293",
            "sentiment_compound": 0.8381
        },
        {
            "id": "ha4wjou",
            "score": 2,
            "text": "“Whattttttaaaaa…. No way” said ever emotionally aware male",
            "title_similarity": "0.33545634",
            "sentiment_compound": -0.296
        },
        {
            "id": "ha5al9v",
            "score": 3,
            "text": "Who thinks that this isn’t important??? Who is “we”?",
            "title_similarity": "0.40142763",
            "sentiment_compound": 0.4137
        },
        {
            "id": "ha5f8bv",
            "score": -2,
            "text": "Which is a bit surprising to learn, given the real *creatures* that some women get with…",
            "title_similarity": "0.42443383",
            "sentiment_compound": 0.2732
        },
        {
            "id": "ha5jb84",
            "score": 3,
            "text": "Definitely.  \n\nLong story short, my wife had a total radical hysterectomy (not as rad as it sounds) after going through an intense surgery for endometriosis a couple of years earlier, a few years after an emergency c-section for our kid. We're super honest with each other. Years of hormone therapy basically destroyed any remaining libido. It sucks for both of us.   \n\n\nI feel so ugly. I have a dad bod. I get called a \"good dad\" by my mom and wife. That's super awesome to hear, BUT that only goes so far. I'm the type of person that needs to feel that physical intimacy- not just sex. Passionate kissing, etc. are things I haven't experienced in too long. I know she is suffering and there is nothing but love in my heart for her. I don't burden her with this, other than an occasional casual mention. Just have to shrug it off. We both have severe depression. So any kind of \"feeling sexually desired by my partner\" is a no for me.   \n\n\n It adds to my depression. There is no win.",
            "title_similarity": "0.3062527",
            "sentiment_compound": -0.896
        },
        {
            "id": "ha5oqhl",
            "score": 4,
            "text": "Woman here to give you my perspective. I want to show sexual attraction without it having to lead to sex every time. Being sexually attracted to someone isn't always the same as being in the mood. \n\nIt's kind of like back rubs, it feels amazing but if it ends in sex every time, you just stop doing it if you're not in the mood.",
            "title_similarity": "0.7047248",
            "sentiment_compound": 0.5029
        },
        {
            "id": "ha5ppfi",
            "score": 3,
            "text": "So... “The average man is more interested in a woman who is interested in him than he is in a woman with beautiful legs.” - Marlene Dietrich\n\nYup, got it.",
            "title_similarity": "0.6475436",
            "sentiment_compound": 0.8622
        },
        {
            "id": "ha5wfoz",
            "score": 3,
            "text": "Guess men should start putting more effort into themselves",
            "title_similarity": "0.7031537",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha60fzo",
            "score": 3,
            "text": "One thing I think that as a society we neglect is for men, they want *validation* sex and not *transactional* sex. Most men simply will never know what it's like to be truly desired by the women they pair up with. \n\nI'm talking about the guy who women throw themselves at, even if he isn't particularly rich or holds high status. When women talk about 'chemistry', this is what they mean. They see this type of man and all caution gets thrown to the wind. This is the \"bad boy\" trope. The woman instinctively knows this guy isn't a viable long-term partner, but that doesn't matter. He's hot and she wants him. This is validational sex. Maybe 10-15% of the male population gets this consistently from women. \n\nThen you have the guys who check all the boxes but just doesn't quite do it for the woman. She'll give him sex in exchange for access to his status and resources because that's what's required to maintain a relationship. If he can't provide status and resources, the woman tends to move on. The bulk of the male population falls into this category. This is transactional in nature.",
            "title_similarity": "0.7055193",
            "sentiment_compound": -0.2573
        },
        {
            "id": "ha4ejuv",
            "score": 61,
            "text": "Studies confirm: “Men are indeed humans and not mindless penis machines”.",
            "title_similarity": "0.47516695",
            "sentiment_compound": 0.3412
        },
        {
            "id": "ha45foo",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.09552069"
        },
        {
            "id": "ha4deup",
            "score": 27,
            "text": "than who think! who is \"we\"?",
            "title_similarity": "0.3274863",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4mynu",
            "score": 24,
            "text": "\"Not Always in the Mood: The **New** Science of Men\" Glad to know scientists have made the breaking discovery that shockingly 50% human race aren't completely wired different then the other half, and do in fact have feelings. The fact that a study had to show this is genuinely laughable. There is this misconception that men are sex-craving cavemen and it is not only harmful as it used to justify monstrous behavior, but so goddamn degrading it makes my blood boil.",
            "title_similarity": "0.66038036",
            "sentiment_compound": -0.9073
        },
        {
            "id": "ha4azlz",
            "score": 62,
            "text": "It's about attention. Everyone likes it. Everyone wants it.",
            "title_similarity": "0.45611733",
            "sentiment_compound": 0.4215
        },
        {
            "id": "ha4ayue",
            "score": 14,
            "text": "Anyone who's ever heard Cheap Trick's \"I Want You To Want Me\" knows this.",
            "title_similarity": "0.38713932",
            "sentiment_compound": 0.1531
        },
        {
            "id": "ha4ga9h",
            "score": 3,
            "text": "I think any conpliment is sent from the heavens at this point",
            "title_similarity": "0.27903026",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ha5hj5k",
            "score": 15,
            "text": "Don't think it's a coincidence I googled yesterday why my wife never initiates sex...even though she says she has a strong sex drive like mine.  \"I want to feel sought after....I just touch your penis and you're ready to go\". \n\n\nSure...that's true, but when I'm the one who initiates 9/10 it gets really old.  Especially when she denies me cause she's too tired, too busy, not the appropriate time, not the place etc.  \n\nGotten to point where I honestly don't like initiating anymore.",
            "title_similarity": "0.4945982",
            "sentiment_compound": -0.2289
        },
        {
            "id": "ha4e8mf",
            "score": 110,
            "text": "I can't believe this requires a scientific study, basically men are human.",
            "title_similarity": "0.52337813",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha50tlz",
            "score": 3,
            "text": "I do't think I've seen a single study posted on r/science that has come to a conclusion that is anything more than incredibly, obviously, unsurprising",
            "title_similarity": "0.26681587",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6q8vv",
            "score": 4,
            "text": "They need to do a study on how sexual desire for their partner relies on women's emotional needs being met.\n\nThis is something my ex never understood. It's a cycle. How can I sexually desire someone who won't give my thoughts and feelings the time of day?\n\nI struggled so hard with arousal and desire for him. I explained and re-explained for 5 years that the lack of emotional fulfillment, among many other issues, was making me extremely unhappy with our relationship. Yet he wouldn't make any changes. Instead of actually working on the issues we had, he would try to bribe me for sex. Like buying me clothes and makeup to make me \"happy\". That was his solution.\n\nBut I couldn't force myself to desire him because feelings can't be forced. If I'm feeling constantly disrespected, belittled, dismissed, and ignored, there is no sexual desire.\n\nI communicated this and my issues in detail very clearly to him time after time for years, yet he could never understand why I struggled so hard with my attraction for him.\n\nTo me, it seems pretty obvious. If you can't keep your girl emotionally happy, she's not going to truly desire you sexually. And you shouldn't do things to make her happy just so she'll desire you sexually.",
            "title_similarity": "0.5781479",
            "sentiment_compound": 0.9636
        },
        {
            "id": "ha4dpnj",
            "score": 71,
            "text": "The study literally came from an /r/askmen thread... wow.",
            "title_similarity": "0.28899458",
            "sentiment_compound": 0.5859
        },
        {
            "id": "ha4hq2h",
            "score": -6,
            "text": "why for me when i'm in love with someone after i have sex with her i would become boring  and i could not stand with her attitude? can someone explain to me why?",
            "title_similarity": "0.62789816",
            "sentiment_compound": 0.504
        },
        {
            "id": "ha50xna",
            "score": 4,
            "text": "Bruh why is this news? Who on this increasingly not green earth doesn’t want their SO to find them sexually attractive? Like I understand that is gonna be true for some people but like realistically how many?",
            "title_similarity": "0.7772732",
            "sentiment_compound": 0.8196
        },
        {
            "id": "ha4dgfx",
            "score": 189,
            "text": "I'm 6'3 my girl 5'5 and I love nothing more than to be big spooned by her.",
            "title_similarity": "0.22058058",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ha4qgxc",
            "score": 23,
            "text": "[deleted]",
            "title_similarity": "0.09361863"
        },
        {
            "id": "ha492or",
            "score": 121,
            "text": "Incidentally, this study was 100% funded by Cheap Trick",
            "title_similarity": "0.35903138",
            "sentiment_compound": -0.0516
        },
        {
            "id": "ha42c6d",
            "score": 40,
            "text": "[removed]",
            "title_similarity": "0.09552069"
        },
        {
            "id": "ha452ty",
            "score": 45,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4jvy2",
            "score": 90,
            "text": "Study finds men have emotions and stuff! What other fascinating mysteries have they been hiding!",
            "title_similarity": "0.6728449",
            "sentiment_compound": 0.4374
        },
        {
            "id": "ha57dk5",
            "score": 10,
            "text": "Read: men have feelings",
            "title_similarity": "0.61045086",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4dx5v",
            "score": 10,
            "text": "Of course it's important, why would anyone say otherwise?",
            "title_similarity": "0.42618257",
            "sentiment_compound": 0.2023
        },
        {
            "id": "ha4fpah",
            "score": 10,
            "text": "300 men from 18 to 65 does seem like a bit of a small pool. I'd also be interested to see if socioeconomic standings have any change in outcome.",
            "title_similarity": "0.48980895",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ha4dw7c",
            "score": 108,
            "text": "A lot of stuff is more important to men than people think.",
            "title_similarity": "0.767205",
            "sentiment_compound": 0.2716
        },
        {
            "id": "ha4hk5o",
            "score": 56,
            "text": "This wasn’t already obvious?",
            "title_similarity": "0.26010728",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4r3ez",
            "score": -12,
            "text": "Women know. This is why they use it as a weapon in the gender wars.",
            "title_similarity": "0.319934",
            "sentiment_compound": -0.7003
        },
        {
            "id": "ha4j2n8",
            "score": 12,
            "text": "I think men are impacted by all issues far more than we realize.",
            "title_similarity": "0.6095238",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4kbxc",
            "score": 12,
            "text": "Ahh yes, the floor here is made of floor",
            "title_similarity": "0.105403684",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ha4lnmj",
            "score": 13,
            "text": "I realize that it's important to study and obtain hard data on things that seem obvious or intuitive.  So in that sense, this is valuable.  But \"than we think\"?  *Seriously?*  Who the hell *ever* thought otherwise, and just how much duct sealant do you have to huff to draw the conclusion that feeling sexually desired isn't important to anyone who does not have a diagnosable psychological problem in the first place?",
            "title_similarity": "0.7161039",
            "sentiment_compound": -0.8683
        },
        {
            "id": "ha435bc",
            "score": 2563,
            "text": "I hope people take this seriously. I make a point to remind my husband how handsome he is and how I still only have eyes for him (which seriously, he's an absolute 10 to me). I would never condone cheating, but when people don't feel sexually desired by their partner it creates a weak spot in the relationship. Humans are sexual beings and we ultimately seek it, hope it can be found within the relationship.",
            "title_similarity": "0.72860384",
            "sentiment_compound": 0.3723
        },
        {
            "id": "ha4etva",
            "score": 104,
            "text": "There are all these studies basically saying 'people like it when you're nice to them'; and nobody wants to do it. Simply Dazzling",
            "title_similarity": "0.5127399",
            "sentiment_compound": 0.6486
        },
        {
            "id": "ha46x74",
            "score": 49,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha49hkl",
            "score": 1415,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4ch24",
            "score": 400,
            "text": "It's almost like men are human or something, very strange indeed!",
            "title_similarity": "0.519204",
            "sentiment_compound": 0.1043
        },
        {
            "id": "ha4v1rm",
            "score": 45,
            "text": "A simple, honest conversation with a man could have told anyone this.",
            "title_similarity": "0.4068228",
            "sentiment_compound": 0.5106
        },
        {
            "id": "ha4vbaw",
            "score": 46,
            "text": "Get yourself a gay friend. We are like magic for the mental health (of everyone but ourselves).",
            "title_similarity": "0.5365958",
            "sentiment_compound": 0.431
        },
        {
            "id": "ha49jja",
            "score": 116,
            "text": "As an historically average guy, this makes sense. I'm not used to getting those compliments; even now later in life with a longtime partner, I hear the compliments but it just doesnt feel real/natural.",
            "title_similarity": "0.608524",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ha5kqpr",
            "score": 18,
            "text": "Men get compliments but I have noticed it's often about how useful they are not how desirable they are.",
            "title_similarity": "0.7014624",
            "sentiment_compound": 0.5035
        },
        {
            "id": "ha4vr1t",
            "score": 807,
            "text": "I’ve been married 18 years and not once, and I’m not being dramatic here, not once has she paid me a compliment. A couple of years ago I decided to do something different and grew a beard, a couple of weeks in and she told me I look ugly with it, so I shaved it off. Nothing. I thought in the least she would give a smile of approval. It’s really quite pathetic sometimes how low you will go to try and get a lift.\n\nEdit: I’ve tried numerous times to talk about things. It’s hard to explain but she doesn’t engage in conversation. I’ll talk, she’ll say nothing, nothing changes. I think I’ve learnt to accept it but then I see posts like this come up and it gets me a little sad. I want that complimentary, fun and loving relationship buy, well not every relationship is going to be a romcom. I’ll keep trying on my end.\n\nEdit: No, I’m not. There’s reasons why I haven’t left which I won’t delve into here. But I would like to take this opportunity to offer some advice to you as a 21 year old person (and maybe talking to my 21 year old self). Go with your instincts, do not delay your decision thinking it will get better. I hate myself that I didn’t go with my instincts and have to live with that for, probably the remainder of my days. Don’t be like me\n\nEdit: I’ll add a little more just to answer my reasoning why I feel stuck here. 12 years ago I suffered an injury and am now in a wheelchair. They took my drivers license off me, we moved to the sticks, her family are here, mine are not, I’m not working anymore due to mobility and pain issues and hardly leave the house because of that. If I put my conspiracy theory hat on for a little I can’t help but feel that maybe she prefers me like this. I’ll stop now because I could moan for hours. there’s so many details to everyone’s relationships that could be dissected by everyone else if the ball keeps rolling. I get down at times but on the whole I’ve made peace with what it is. Thanks for reading.\nEdit: Grammar\nEdit: Just to confirm, I’m not a fat person. I was fit and even though I haven’t exercised since my injury (except for a hand bike to work my heart a little) I think I’m in ok condition. A little middle aged gut, but nothing that you wouldn’t expect from a regular 40 odd year old.",
            "title_similarity": "0.30069706",
            "sentiment_compound": 0.9884
        },
        {
            "id": "ha4ns54",
            "score": 17,
            "text": "Newsflash : men are human beings with human feelings and desires",
            "title_similarity": "0.6010623",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4jrp6",
            "score": 316,
            "text": "It's nice to have the obvious validated scientifically.",
            "title_similarity": "0.3348575",
            "sentiment_compound": 0.5719
        },
        {
            "id": "ha4iys5",
            "score": 221,
            "text": "I dated a woman who was asexual (she didn't realize it/admit it until we'd been dating for a year) who would say \"I like that shirt\" or things like that, but never made me feel sexually desired even when we were having sex and holy hell did it annihilate my self esteem over the course of a year. I understand now why she didn't, but it made me realize how important it is to feel desired.",
            "title_similarity": "0.49377608",
            "sentiment_compound": 0.1531
        },
        {
            "id": "ha4kydv",
            "score": 182,
            "text": "Yeah, my wife didn’t get this *at all*. To her mind, it was my responsibility to initiate everything physical, romantic, intimate, sexual.\n\nAs a result of her inability to treat me like a desirable person, my needs for her faded, I ceased initiating, and she ended our marriage because of it.",
            "title_similarity": "0.40186965",
            "sentiment_compound": 0.8271
        },
        {
            "id": "ha4zc9k",
            "score": 56,
            "text": "Is it too passive aggresive to forward this to my partner?",
            "title_similarity": "0.52412236",
            "sentiment_compound": 0.2023
        },
        {
            "id": "ha4ih7r",
            "score": 25,
            "text": "Men deserve to be comfortable discussing their emotions and thoughts. I’m a woman, so I obviously can’t speak for men, but I know that I absolutely love being complimented and shown affection. I try to give my boyfriend compliments and show him appreciation every day in some way, shape or form. I’m terrified of him feeling neglected by me in any way, because I love him SO much and I feel like I need to make sure he knows he’s my favorite human. I’m going to get him some flowers tomorrow!",
            "title_similarity": "0.60786617",
            "sentiment_compound": 0.9873
        },
        {
            "id": "ha4l0cl",
            "score": 63,
            "text": "I’ve always thought we need a holiday where you spend a day treating & seducing your spouse the way you want to be treated, and then the same day in reverse.\n\nI *really* hope it’s just ignorance that so many people don’t care about the needs, health, or happiness of men…. Even the men themselves.",
            "title_similarity": "0.5974754",
            "sentiment_compound": 0.8883
        },
        {
            "id": "ha4flwb",
            "score": 1197,
            "text": "[removed]",
            "title_similarity": "0.095520675"
        },
        {
            "id": "ha4i3v6",
            "score": 226,
            "text": "There was once a popular Quora question in a literary forum where a woman asked how she could better understand the motivations of men. \n\nThe overwhelming answer was “men feel very lonely most of the time”.",
            "title_similarity": "0.5466495",
            "sentiment_compound": 0.4417
        },
        {
            "id": "ha4kdbg",
            "score": 230,
            "text": "The sexiest thing my wife does is lust after me and express to me how badly she needs it. I honestly don't think I could ever have sex with a woman if I thought she was doing it with me begrudgingly or as a pity favor. Ladies, your compliments go further than you think.",
            "title_similarity": "0.64529204",
            "sentiment_compound": 0.4767
        },
        {
            "id": "ha4jip8",
            "score": 378,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4hxor",
            "score": 37,
            "text": "Study suggests men do in fact have feelings.",
            "title_similarity": "0.71929824",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4j766",
            "score": 207,
            "text": "As someone who recently was told by their partner that I wasn't attractive to them sexually, it feels good to know I'm not alone. It really made me feel selfish and bad when I was told that by my partner.",
            "title_similarity": "0.6475611",
            "sentiment_compound": -0.656
        },
        {
            "id": "ha49yws",
            "score": 4093,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4dwnu",
            "score": 249,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4gpnn",
            "score": 37,
            "text": "Well that's alarming, I would assume it's pretty important to begin with.",
            "title_similarity": "0.48555732",
            "sentiment_compound": 0.6808
        },
        {
            "id": "ha492st",
            "score": 2051,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha48d68",
            "score": 6061,
            "text": "This is the part I found interesting:\n\n> Interestingly, when describing things their partners could do to show their sexual desire, many men described actions that were romantic rather than sexual. For example, 18% of the men wanted more romance from their partners, 16% wanted more non-sexual touch, and 19% insinuated they wanted more flirting/teasing from their partners.\n\nI think men in general are conditioned to not ask for romance but the truth is that it definitely is important to men. \n\nWhen my wife buys me flowers or is physically affectionate, it makes a huge difference in terms of my mood and how I feel.\n\nAdditionally, I think physical affection and initiating sex is also a significant part of this. \n\n> When the men were asked what their partners were currently doing to make them feel desired, 41% described ways their partners expressed their attraction verbally, 34% mentioned their partners initiating physical touch, 28% mentioned their partners initiating physical activity, and 19% described their partners being enthusiastic/excited during sex.\n\nWhen my wife (or other partners in the past) have desired me and made the moves, it really made me that much more invested in the relationship. \n\nWhat I found surprising was that 88% of men feel like that their partners could be doing better. That says a lot. \n\nI’m in a very happy relationship but when I examine how I feel, I’ll admit - there are definitely things my wife could do that’ll make a significant difference.",
            "title_similarity": "0.7960869",
            "sentiment_compound": 0.9957
        },
        {
            "id": "ha49daf",
            "score": 576,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4i3lz",
            "score": 107,
            "text": "https://med-fom-brotto.sites.olt.ubc.ca/files/2021/08/Murray-Brotto-JSMT-2021-I-Want-You-to-Want-Me-A-Qualitative-Analysis-of-Heterosexual-Men-s-Desire-to-Feel-Desired-in-Intimate-Relationships.pdf\n\nThe study - not a paywall",
            "title_similarity": "0.54079294",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4dsqa",
            "score": 42,
            "text": "As a woman, I feel like it's expected for the man to appreciate and show love and romance to a woman .  That's been our culture.  But we are equal in those feelings now and men need it too, always have.  We forget that sadly.",
            "title_similarity": "0.6760564",
            "sentiment_compound": 0.1154
        },
        {
            "id": "ha4a5bi",
            "score": 1982,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4g41w",
            "score": 206,
            "text": "Is that weird? I don’t have a lot of luck with women but I always wanted to feel “desired” by my partner if I had one or was in a relationship. I want to feel attracted to them but I want them be attracted to me, and while sex might not be everything, I’d want to feel sexually desired by my partner. I find it strange if you have people dating and they’re not physically attracted to one another, I guess sexual attraction wouldn’t matter to an asexual person? You can still have physical attraction I suppose?",
            "title_similarity": "0.78620243",
            "sentiment_compound": 0.9555
        },
        {
            "id": "ha4w4wo",
            "score": 133,
            "text": "Didn’t realise it was so common. My wife and I love each other dearly, and we do a lot for each other but this is a topic I’ve brought up quite a few times. I’m not sure if she gets the difference between wanting more sex and wanting to feel desired - we have a fair amount of sex, but 99% of the time I feel like she’s doing it for me to help me de stress. Which is great and all, but doesn’t really help the “feeling desired” part.\n\nI feel loved and am grateful for my wife for the sex we do have, but more than anything I want her to want sex from me for her /own/ selfish reasons. Is that weird?",
            "title_similarity": "0.66477203",
            "sentiment_compound": 0.9787
        },
        {
            "id": "ha4hla9",
            "score": 3171,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4ngov",
            "score": 8113,
            "text": "Oh hey, that's our study!   \n\n\nOur director Dr. Lori Brotto joined forces with the incredible Dr. Sarah Hunter Murray for this one and we were so ecstatic to share the findings. If anyone would like to read the full paper, it's available on our website here (under 2021): https://brottolab.med.ubc.ca/publications/",
            "title_similarity": "0.26812443",
            "sentiment_compound": 0.859
        },
        {
            "id": "ha4vdwj",
            "score": 203,
            "text": "It's a common misbelief that \"strong\" men don't need validation or to be complimented. \n\nScrew that. I love it when I date a woman and she tells me, \"You look sexy/ I want to do you right now.\" It feels great.",
            "title_similarity": "0.6511147",
            "sentiment_compound": 0.9565
        },
        {
            "id": "ha47554",
            "score": 14709,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4epfz",
            "score": 143,
            "text": "I've been known as having very nice eyes (a light blue, lighter than the sky). I remember when I started high school I had an older girl stop me in the hallway and she just said \"oh my god. You're eyes are amazing\" and she and her friends admired my eyes for a moment.\n\nI was extremely embarrassed at the time, naturally, but I still remember that compliment almost a decade later and probably will for the rest of my life.",
            "title_similarity": "0.30202618",
            "sentiment_compound": 0.8705
        },
        {
            "id": "ha3xyes",
            "score": 193,
            "text": "[removed]",
            "title_similarity": "0.09552069"
        },
        {
            "id": "ha44ik7",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha44u6i",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha486jh",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.09552067"
        },
        {
            "id": "ha4fh86",
            "score": 2,
            "text": "I don't need any studies to suggest this.",
            "title_similarity": "0.13719219",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4h46i",
            "score": 2,
            "text": "Hurts how true this is.",
            "title_similarity": "0.3728509",
            "sentiment_compound": -0.0772
        },
        {
            "id": "ha4hn1n",
            "score": 1,
            "text": "Is this relative to showing affection? \nWanting cuddles and kisses. \n\nDoes that add to the bucket or is it a totally separate department?",
            "title_similarity": "0.55355525",
            "sentiment_compound": 0.7941
        },
        {
            "id": "ha4i7o8",
            "score": 2,
            "text": "I love how we have to do studies to state the obvious.",
            "title_similarity": "0.42626166",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ha4ifl8",
            "score": 2,
            "text": "I thought it was pretty damn important.",
            "title_similarity": "0.39959902",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha4iqrv",
            "score": 1,
            "text": "No kidding. My girlfriend loves touching my ass and will casually play with my hair and rub my chest because she likes that I have visible pec muscles. Just her paying attention to me like that turns me on.",
            "title_similarity": "0.44325382",
            "sentiment_compound": 0.8076
        },
        {
            "id": "ha4izmn",
            "score": 1,
            "text": "Duuuuuuurrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr",
            "title_similarity": "0.27886865",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4j0ds",
            "score": 1,
            "text": "Its the only thing i crave and i believe it will never happen",
            "title_similarity": "0.22306737",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4j55p",
            "score": 1,
            "text": "Who’s we? Why didn’t “we” logically already know this?",
            "title_similarity": "0.32272112",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4j5mc",
            "score": 1,
            "text": "That is the difference between feeling need and wanted. \n\nIt really sucks to know that people need you but they don’t want you",
            "title_similarity": "0.599674",
            "sentiment_compound": -0.0507
        },
        {
            "id": "ha4j6r8",
            "score": 1,
            "text": "Great, another reason for folks to run other folks to the ground even more.",
            "title_similarity": "0.35756534",
            "sentiment_compound": 0.6249
        },
        {
            "id": "ha4jatn",
            "score": 1,
            "text": "I just wish my wife's compliments were able to overcome my own self loathing",
            "title_similarity": "0.47509578",
            "sentiment_compound": 0.1779
        },
        {
            "id": "ha4jf6s",
            "score": 25,
            "text": "I totally agree..that does wonders. Sometimes even that affection and compliment on appearance makes a huge difference. Just wish it happened more often..",
            "title_similarity": "0.57268894",
            "sentiment_compound": 0.8885
        },
        {
            "id": "ha4jrrt",
            "score": 7,
            "text": "Or by anyone for that matter :/",
            "title_similarity": "0.15534747",
            "sentiment_compound": -0.3182
        },
        {
            "id": "ha4kil6",
            "score": 2,
            "text": "As someone who’s felt unimportant to both parents I wish I had parental love as a foundation of how to build a healthy relationship.",
            "title_similarity": "0.5015429",
            "sentiment_compound": 0.8074
        },
        {
            "id": "ha4klpp",
            "score": 1,
            "text": "Thanks for this article! I thought I was weird.",
            "title_similarity": "0.44449863",
            "sentiment_compound": 0.3595
        },
        {
            "id": "ha4km6d",
            "score": 1,
            "text": "I tell my husband how sexy he is all the time. I felt a bit silly at first, but man, he is very sexy to me. I can't keep it to myself. But I also love being desired. There's nothing like it.",
            "title_similarity": "0.6995807",
            "sentiment_compound": 0.9334
        },
        {
            "id": "ha4ky7o",
            "score": 1,
            "text": "Who thought this wasnt important for men?",
            "title_similarity": "0.6049571",
            "sentiment_compound": -0.1511
        },
        {
            "id": "ha4l2sy",
            "score": 4,
            "text": "Does anyone think it’s not?",
            "title_similarity": "0.26644406",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4layh",
            "score": 2,
            "text": "Yes, men are human beings with emotipns",
            "title_similarity": "0.43851888",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ha4lb01",
            "score": 3,
            "text": "Is it normal to think that guys were indifferent about wanting to be desired? Did they ask any guy?",
            "title_similarity": "0.68240786",
            "sentiment_compound": 0.168
        },
        {
            "id": "ha4ljvw",
            "score": 5,
            "text": "Huh. It's like my A1 issue. If I don't feel desired, I feel pretty damn worthless. It has been the catalyst in  a couple relationships ending.",
            "title_similarity": "0.48089653",
            "sentiment_compound": -0.1813
        },
        {
            "id": "ha4loip",
            "score": 1,
            "text": "We’re just figuring this out?",
            "title_similarity": "0.2792858",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4lqrs",
            "score": 1,
            "text": "Of freaking course it is.",
            "title_similarity": "0.07026024",
            "sentiment_compound": -0.4215
        },
        {
            "id": "ha4lsad",
            "score": 2,
            "text": "This is something I've been struggling with recently. I feel like my Girlfriend only wants Romance from me and nothing more, hits the self esteem real hard.",
            "title_similarity": "0.6114124",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ha4ltc8",
            "score": 1,
            "text": "Yeah but have you seen the smile on the rich 60-year old dating an 18 year old?",
            "title_similarity": "0.3027186",
            "sentiment_compound": 0.8674
        },
        {
            "id": "ha4m2ih",
            "score": 1,
            "text": "The fact that this is being presented as a big discovery is fucked. Of course this is true",
            "title_similarity": "0.5163945",
            "sentiment_compound": -0.3818
        },
        {
            "id": "ha4m2yj",
            "score": 1,
            "text": "It's legit everything. Most men will NOT admit it. Imagine not being desired by your significant other.. awful.",
            "title_similarity": "0.56311333",
            "sentiment_compound": -0.5583
        },
        {
            "id": "ha4m6bz",
            "score": 3,
            "text": "SKY BLUE, says new study!!",
            "title_similarity": "0.21036947",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4micr",
            "score": 1,
            "text": "Well yeah. This is basically part of the reason for my suicidal depression over the last few years. Men tend to get largely ignored when asking for mental health help or validation or focus on these things in my experience.",
            "title_similarity": "0.4931882",
            "sentiment_compound": -0.6705
        },
        {
            "id": "ha4mwp6",
            "score": 1,
            "text": "I like being completed on things I am working on or can control, and that goes for more than just physical traits too, like a skill I’ve been working on.\nI don’t like complements on things like my height or my eye color because those didn’t take effort on my part.",
            "title_similarity": "0.60829496",
            "sentiment_compound": 0.8402
        },
        {
            "id": "ha4mzp0",
            "score": 1,
            "text": "\"Give a man sex, he will enjoy it once, give him consent and he can masturbate for life\".",
            "title_similarity": "0.61964",
            "sentiment_compound": 0.6249
        },
        {
            "id": "ha4n3d7",
            "score": 1,
            "text": "I'm trying to type something but all these comments are eloquent and written by really sexy people that it's hard to think.",
            "title_similarity": "0.63191605",
            "sentiment_compound": 0.664
        },
        {
            "id": "ha4n4le",
            "score": 1,
            "text": "This is 100% true for me!",
            "title_similarity": "0.16730931",
            "sentiment_compound": 0.4753
        },
        {
            "id": "ha4n9on",
            "score": 8,
            "text": "So I’m not married or even in a relationship so I don’t exactly have a horse in this race, but why wouldn’t you compliment your partner or tell them how sexy you think they are, regardless of gender?",
            "title_similarity": "0.45013326",
            "sentiment_compound": 0.8674
        },
        {
            "id": "ha4ne57",
            "score": 1,
            "text": "My girlfriend does this and it was a complete game changer in my life. I kinda knew that I am not too hideous before but low key had some doubts about it.",
            "title_similarity": "0.5039289",
            "sentiment_compound": -0.6652
        },
        {
            "id": "ha4nep4",
            "score": 1,
            "text": "Little rates R here but I love catching my man when he least expects it. I'll tell him things like how sexy he is and how much I want to worship a certain part of his body ;) I'll walk up and rub his arms and tell him he's so strong and and my comfort place. I'm a bit of a nympho so I'm always telling him about how much I want to stroke and play with him or I'll just touch him without warning. He loves it. 3 years married and he still blushes sometimes <3",
            "title_similarity": "0.5641895",
            "sentiment_compound": 0.9898
        },
        {
            "id": "ha4ngm3",
            "score": 1,
            "text": "I feel like this shouldn't be surprising in any way?",
            "title_similarity": "0.301907",
            "sentiment_compound": 0.1744
        },
        {
            "id": "ha4ngmo",
            "score": 1,
            "text": "In theory I’d love it if my partner was more verbal and proactive with appreciating me, but when she does I just squirm and shut down inside because, as an ugly person, I just can’t believe any of it to be true. \n\nIt’s almost better when nothing is said or done even thought I want it.",
            "title_similarity": "0.57682216",
            "sentiment_compound": 0.8268
        },
        {
            "id": "ha4nsi6",
            "score": 36,
            "text": "Maybe I'm niave but I thought that would be pretty obvious/important for most people?",
            "title_similarity": "0.548028",
            "sentiment_compound": 0.6486
        },
        {
            "id": "ha4ntvl",
            "score": 1,
            "text": "This just reminded me how little to no affection I get from my partner and it really deteriorates my mental health and self esteem. And I am a naturally very confident person. Strangers give me compliments quite frequently and try to flirt with me. It’s frustrating to not get the same attention from the one that matters the most.",
            "title_similarity": "0.6172075",
            "sentiment_compound": 0.1537
        },
        {
            "id": "ha4ny01",
            "score": 1,
            "text": "Was anyone out there thinking it wasn't important?",
            "title_similarity": "0.33574623",
            "sentiment_compound": -0.1511
        },
        {
            "id": "ha4o1mq",
            "score": 1,
            "text": "Men already knew this, you just made us too ashamed to bring it up.",
            "title_similarity": "0.5369942",
            "sentiment_compound": -0.4767
        },
        {
            "id": "ha4olmb",
            "score": 3,
            "text": "Than we think? Of course being sexually desired is important who thinks it isn’t ?",
            "title_similarity": "0.7958354",
            "sentiment_compound": 0.504
        },
        {
            "id": "ha4omk1",
            "score": 1,
            "text": "Wow. Men have feelings. Shocking.",
            "title_similarity": "0.57170725",
            "sentiment_compound": 0.2732
        },
        {
            "id": "ha4onjf",
            "score": 1,
            "text": "Yeah thats generally what I always do. When im in a relationship I usually like to try to show my affection in all the little ways I would like it in return. Im not christian anymore but I was always taught do unto others as you would have them do unto you. \n\nBiggest downside is when it ISN’T returned like you would want… thats when resentment can settle in. So its more a dangerous game than you’d think. Communication is challenging for sure though…",
            "title_similarity": "0.60256696",
            "sentiment_compound": -0.0303
        },
        {
            "id": "ha4oo1r",
            "score": 1,
            "text": "Oh yes i absolutely love genuine positive comments! \nIt just lifts my whole day up",
            "title_similarity": "0.31454998",
            "sentiment_compound": 0.9071
        },
        {
            "id": "ha4ozvm",
            "score": 1,
            "text": "I believe this. I don't remember the last time my wife complimented me on my looks and it sucks.\n\n It's hard to feel good about yourself when you're not even sure if the one you love still thinks you're attractive or not.",
            "title_similarity": "0.53350186",
            "sentiment_compound": 0.8376
        },
        {
            "id": "ha4ozye",
            "score": 1,
            "text": "It makes you feel secure in your relationship as well, when your partner shows you that desire more freely.",
            "title_similarity": "0.59857696",
            "sentiment_compound": 0.8553
        },
        {
            "id": "ha4p2ur",
            "score": 1,
            "text": "Gee who could have thought that?! \n \nDepressing but actually not unsurprising that this even needs to be said..",
            "title_similarity": "0.44583404",
            "sentiment_compound": -0.2714
        },
        {
            "id": "ha4p2zg",
            "score": 1,
            "text": "...what was the old bar? Why would you be with someone who didn’t want you?!",
            "title_similarity": "0.4274195",
            "sentiment_compound": 0.2387
        },
        {
            "id": "ha4p5qt",
            "score": 1,
            "text": "My husband works as an engineer at a facility that completely covers him in black goo and metal shavings. He sometimes gets to dress a little nice for a meeting and he always looks so handsome! Not gonna lie though,  that dirty , greasy uniform looks hot!!! I'm always happy to have those dirty hands on me! Unless its dangerous, I'm always open arms for my filthy hard working man!",
            "title_similarity": "0.49895352",
            "sentiment_compound": 0.4924
        },
        {
            "id": "ha4p9l3",
            "score": 1,
            "text": "Go listen to Kevin Samuels on YouTube. Thank me later.",
            "title_similarity": "0.26865703",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha4pafp",
            "score": 1,
            "text": "Than who thinks? Almost everyone wants to be wanted",
            "title_similarity": "0.54835385",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4pdk2",
            "score": 1,
            "text": "As Cheap Trick so eloquently put it, “I want you to want me.”",
            "title_similarity": "0.51506394",
            "sentiment_compound": 0.1027
        },
        {
            "id": "ha4piuh",
            "score": 1,
            "text": "So people didn't realize that all dudes aren't two dimensional walking sex craving machines? Sad to think that some people think men literally lack dimension and don't even care about being desired sexually by their partner like they're just... empty in that regard. Ridiculous generalization if that's happening.",
            "title_similarity": "0.67266774",
            "sentiment_compound": -0.7736
        },
        {
            "id": "ha4pj88",
            "score": 1,
            "text": "I mean, fifty years old.",
            "title_similarity": "0.03726609",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4pnar",
            "score": 1,
            "text": "It’s always given me “push” to keep going hard for my family. Wish it happened more than it has, but I do enjoy it when it happens",
            "title_similarity": "0.5260316",
            "sentiment_compound": 0.714
        },
        {
            "id": "ha4pxy2",
            "score": 1,
            "text": "I just want my wife to sit next to me on the couch and let me put my arm around her.",
            "title_similarity": "0.13517348",
            "sentiment_compound": 0.0772
        },
        {
            "id": "ha4q2qh",
            "score": 1,
            "text": "\"They\" needed to do a study to find out what every guy already knows?? That study prob took 5 mins.",
            "title_similarity": "0.28965035",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4q34e",
            "score": 1,
            "text": "Who is we? Bc 50% of the population already knew this.",
            "title_similarity": "0.15501928",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4q8ho",
            "score": 1,
            "text": "Study also suggest contact with water can make things wet. Further results awaited.",
            "title_similarity": "0.3595101",
            "sentiment_compound": -0.0258
        },
        {
            "id": "ha4q9s8",
            "score": 1,
            "text": "Can confirmed, significant other drowns me in compliments about my body several times a day. Feels good to have your ego confirmed.",
            "title_similarity": "0.51730615",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ha4qczg",
            "score": 1,
            "text": "Who is this a surprise to? Isn't it important for everyone to feel sexually wanted by their partner?",
            "title_similarity": "0.8221139",
            "sentiment_compound": 0.2187
        },
        {
            "id": "ha4qdry",
            "score": 1,
            "text": "100%. If I feel like my partner does not desire me sexually then why even be in a relationship with me?",
            "title_similarity": "0.66980326",
            "sentiment_compound": 0.0624
        },
        {
            "id": "ha4qoa1",
            "score": 1,
            "text": "This article’s title is moronic. Imagine that…a person actually wants to be found attractive?!?! A man has nuanced EMOTIONS?!?! Surely you’re mistaken? The testicles removes all such things!",
            "title_similarity": "0.70645714",
            "sentiment_compound": -0.5466
        },
        {
            "id": "ha4qphv",
            "score": 1,
            "text": "Is that why I’m depressed a lot? Because I have nobody to actually give me that feeling",
            "title_similarity": "0.386232",
            "sentiment_compound": -0.4215
        },
        {
            "id": "ha4qtz9",
            "score": 1,
            "text": "Being more mindful of your feelings is key. I feel like most people would benefit from the book”the art of mindfulness” and it is very informative on how to apply the techniques",
            "title_similarity": "0.54466164",
            "sentiment_compound": 0.6969
        },
        {
            "id": "ha4r7ac",
            "score": 1,
            "text": "really, that wasn't obvious worth all the dickpics?",
            "title_similarity": "0.45714244",
            "sentiment_compound": -0.1695
        },
        {
            "id": "ha4rdjy",
            "score": 1,
            "text": "Nope.. it’s pretty damn important. Last week I ran naked from the washroom after showering to the computer to click a button on a computer game (I know I know) all kids where in bed etc only the wife was up. Later that night she told me how hot it was (for her) \n\n\nI been riding that compliment since then and will be for months! I am not even good looking!",
            "title_similarity": "0.26646888",
            "sentiment_compound": 0.4035
        },
        {
            "id": "ha4rdl9",
            "score": 1,
            "text": "can verify, this has always made me feel ten feet tall.",
            "title_similarity": "0.2520426",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4rf1b",
            "score": 1,
            "text": "“I'm a man. I'm sensitive. I need to feel loved. I need to be desired.” -Peter Venkman",
            "title_similarity": "0.6578863",
            "sentiment_compound": 0.5994
        },
        {
            "id": "ha4rogw",
            "score": 1,
            "text": "\"Society surprised: Men have feelings\"",
            "title_similarity": "0.66461885",
            "sentiment_compound": 0.2263
        },
        {
            "id": "ha4rsm9",
            "score": 1,
            "text": "my mechanic told me i looked buff the other day and until someone tops that i’m riding that high for the next month",
            "title_similarity": "0.36762843",
            "sentiment_compound": 0.5106
        },
        {
            "id": "ha4rx4i",
            "score": 1,
            "text": "I think men get a bad wrap for only wanting sex. I feel like men desire the entire package of romance and sex. I know just do.",
            "title_similarity": "0.7698183",
            "sentiment_compound": 0.6486
        },
        {
            "id": "ha4s2j7",
            "score": 1,
            "text": "Today on the obvious channel...",
            "title_similarity": "0.13477165",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4s2yj",
            "score": 1,
            "text": "Most of my early gf's i percieved to be out of my league, their compliments and affirmations that i was attractive gave me the confidence i needed to grow out of my anxiety over my face, i still have body dismorphia but i feel like even thats not as bad as it once was",
            "title_similarity": "0.5908276",
            "sentiment_compound": 0.8916
        },
        {
            "id": "ha4s9xs",
            "score": 1,
            "text": "Yeah, nobody want to be loved.",
            "title_similarity": "0.35421467",
            "sentiment_compound": 0.7506
        },
        {
            "id": "ha4sa19",
            "score": 1,
            "text": "is this why i lack confidence and feel so inadequate? i always felt like i wasnt the ugliest dude, inside or out. i can’t seem to find a new gf; my ex left me after 2 and a half years and found a new guy seemingly overnight, up and left w no closure. since then i haven’t even dated... it’s been 3 years and not even someone to hang out w, not even a kiss. not even on the cheek. i feel so lonely nowadays, and i’m starting to figure out how to be happy just with myself, but truthfully i’m painfully reminded about how alone i am every time i see any couple doing anything. i know it’s not all sunshine and rainbows behind closed doors, but i have nothing but grey walls in my apartment and a cat (im super grateful for him, as he is really the only constant in my life). idk guys, idk what i’m phishing for but i just really feel low nowadays.",
            "title_similarity": "0.4051717",
            "sentiment_compound": -0.209
        },
        {
            "id": "ha4sd7d",
            "score": 1,
            "text": "I just like feeling pretty",
            "title_similarity": "0.36919117",
            "sentiment_compound": 0.7351
        },
        {
            "id": "ha4se1o",
            "score": 1,
            "text": "How is this a surprise?",
            "title_similarity": "0.2804902",
            "sentiment_compound": 0.2732
        },
        {
            "id": "ha4se42",
            "score": 1,
            "text": "Yeah why the hell would anyone think otherwise?  It really impacts me if my partner doesn't show me affection and make me feel desired.  I think that's simply human nature.\n\nWe're all human and men and women are 95% alike, it's just the 5% is blown outta proportion, and the media makes money by pitting the two sexes against one another and driving a wedge between us in general as a society.",
            "title_similarity": "0.63201916",
            "sentiment_compound": -0.6219
        },
        {
            "id": "ha4sf3c",
            "score": 1,
            "text": "They're really like \"New findings tonight from the scientific community, some evidence suggests men could actually have feelings and emotions, more at 9.\"",
            "title_similarity": "0.5269233",
            "sentiment_compound": 0.4201
        },
        {
            "id": "ha4sh5m",
            "score": 1,
            "text": "That's hilarious because I love giving my SO components as often as is tastefully possible... It happens alot. Wish I got the same. Seems the hype train for women comes from their massive followings. Meanwhile we blush when we're told our haircut looks nice or they like that shirt on us...",
            "title_similarity": "0.50130606",
            "sentiment_compound": 0.946
        },
        {
            "id": "ha4sj4t",
            "score": 1,
            "text": "In what way is this at all surprising?",
            "title_similarity": "0.27199942",
            "sentiment_compound": 0.2732
        },
        {
            "id": "ha4sjxk",
            "score": 1,
            "text": "What's it even like to be wanted?",
            "title_similarity": "0.40743154",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha4sms3",
            "score": 2,
            "text": "My wife compliments me but myself confidence is shot. I'm on antidepressants and anxiety .Ed's and just got diagnosed with low t. So here's to changes.",
            "title_similarity": "0.4368107",
            "sentiment_compound": 0.3818
        },
        {
            "id": "ha4snp5",
            "score": 1,
            "text": "Married, 45… dead inside (because of work and life expectations, not wife and kids).  Would be a 10x boost to soul and confidence to get some romance outside of a few dates on the calendar…",
            "title_similarity": "0.49333894",
            "sentiment_compound": 0.6486
        },
        {
            "id": "ha4sorz",
            "score": 1,
            "text": "I tell my boyfriend how nice he looks every single day. I don't think I've missed a day in maybe 7 months now? It genuinely startles me every time I see him just how attractive he is to me and how lucky I feel just to be with him. He usually responds by ruffling his hair saying it looks weird or how he feels like he needs a shower. \n\nSometimes I think that maybe the special-ness of me saying it has faded since it happens every day, though I do change up how I say it every time. I try to make it cute sometimes, (e.g. before I see him) \"hey honey, I have a prediction to make. I bet you're gonna look really nice and have the best smile today.\" He'll giggle and at the very end of the conversation, after he's forgotten about it, I'll bring it up again: \"Hey honey, I was right. You looked amazing and your smile was the best I've ever seen.\" Then I'm lucky enough to get another one of his knockout smiles. \n\nUgh, I'm so in love with that man.",
            "title_similarity": "0.5318482",
            "sentiment_compound": 0.9915
        },
        {
            "id": "ha4srkj",
            "score": 1,
            "text": "As a partner of 32 and a wife of 18 years, I love seeing how much compliments can mean to guys.",
            "title_similarity": "0.5474544",
            "sentiment_compound": 0.7845
        },
        {
            "id": "ha4swz8",
            "score": 1,
            "text": "I can't believe anybody finds these results surprising.",
            "title_similarity": "0.37254947",
            "sentiment_compound": 0.2732
        },
        {
            "id": "ha4t1so",
            "score": 1,
            "text": "This is exactly why I tell my wife to tell me I am handsome. And she follows my commands every day.",
            "title_similarity": "0.3662361",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ha4t2cq",
            "score": 1,
            "text": "Than we think? Than who thinks? Useless studies executed by clueless people",
            "title_similarity": "0.44485638",
            "sentiment_compound": -0.6868
        },
        {
            "id": "ha4t2za",
            "score": 1,
            "text": "Todays news: Men have feelings.\n\n\nBased on shocking reaserch: We asked.",
            "title_similarity": "0.6414984",
            "sentiment_compound": -0.4019
        },
        {
            "id": "ha4t331",
            "score": 1,
            "text": "Hmmm yes. The floor is made of floor.",
            "title_similarity": "0.12508121",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ha4t7cx",
            "score": 1,
            "text": "How do I secretly send this to my wife?",
            "title_similarity": "0.33646187",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4tduc",
            "score": 1,
            "text": "Hold up, since when did they think it wasn't important?",
            "title_similarity": "0.35676256",
            "sentiment_compound": -0.1511
        },
        {
            "id": "ha4tg0m",
            "score": 1,
            "text": "To be wanted, especially in a sexual way, is very rewarding and can honestly make or break my day. Superficial, yes.",
            "title_similarity": "0.6518511",
            "sentiment_compound": 0.8553
        },
        {
            "id": "ha4tjk3",
            "score": 1,
            "text": "Wait, at what point did we not think this was essentially essential?",
            "title_similarity": "0.38634416",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4ttrn",
            "score": 1,
            "text": "I don't think that I am a woman who can ever verbally admire her (male) partner's ass as much as it deserves.",
            "title_similarity": "0.58448666",
            "sentiment_compound": -0.1027
        },
        {
            "id": "ha4ttup",
            "score": 1,
            "text": "My wife pretty much never touches me or engage in any sexual conduct. It is depressing.",
            "title_similarity": "0.24109474",
            "sentiment_compound": 0.4588
        },
        {
            "id": "ha4tu9v",
            "score": 1,
            "text": "\"Men only want sex\" - women since the beginning of time\n\nTitle the story of this post.\n\nShocked pikachu face",
            "title_similarity": "0.48584473",
            "sentiment_compound": -0.25
        },
        {
            "id": "ha4twc7",
            "score": 1,
            "text": "... What? Is this supposed to be a secret?",
            "title_similarity": "0.33990026",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4tyxf",
            "score": 1,
            "text": "I like that this article for me featured an ad for some flash game that was a picture of Spider Gwen with an enormous ass",
            "title_similarity": "0.25531048",
            "sentiment_compound": -0.3167
        },
        {
            "id": "ha4tyxj",
            "score": 1,
            "text": "Many men can attest to the horror of the opposite.",
            "title_similarity": "0.48027653",
            "sentiment_compound": -0.5719
        },
        {
            "id": "ha4tziv",
            "score": 1,
            "text": "I love it when Siri does that.",
            "title_similarity": "0.28430146",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ha4u0dl",
            "score": 1,
            "text": "I know this is r/science and that this comment might get deleted but it honestly makes me realize how lucky I am.",
            "title_similarity": "0.49957138",
            "sentiment_compound": 0.8271
        },
        {
            "id": "ha4u1ef",
            "score": 1,
            "text": ">more important for men than we think\n\nIf by we, we mean not me.",
            "title_similarity": "0.7753429",
            "sentiment_compound": 0.2716
        },
        {
            "id": "ha4ua1m",
            "score": 1,
            "text": "Reallyy? And i was wondering why literally every man goes to the gym.",
            "title_similarity": "0.34855098",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4uaax",
            "score": 1,
            "text": "Sexual compatibility is more important than people think. Some people are able to just push it aside but it can really affect your self esteem over time",
            "title_similarity": "0.7980865",
            "sentiment_compound": 0.1397
        },
        {
            "id": "ha4ugcu",
            "score": 1,
            "text": "…how important did we think it was?",
            "title_similarity": "0.39834535",
            "sentiment_compound": 0.2023
        },
        {
            "id": "ha4umj3",
            "score": 1,
            "text": "Two years ago a woman working the MacDonalds drive through said I have nice eyes.  Don’t think I’ll ever let that one go.",
            "title_similarity": "0.19389391",
            "sentiment_compound": 0.4215
        },
        {
            "id": "ha4uotc",
            "score": 1,
            "text": "Why the hell was a study needed to determine this?",
            "title_similarity": "0.36643934",
            "sentiment_compound": -0.6808
        },
        {
            "id": "ha4urto",
            "score": 1,
            "text": "True, it's why my marriage is failing.",
            "title_similarity": "0.40365213",
            "sentiment_compound": -0.128
        },
        {
            "id": "ha4ux5o",
            "score": 1,
            "text": "My partner of 11 years barely ever gives me compliments, but when she's does I get a huge boost in self esteem. I've got pretty low self esteem as it is, so it's always a plus for me when she does.",
            "title_similarity": "0.44455767",
            "sentiment_compound": 0.875
        },
        {
            "id": "ha4v27x",
            "score": 1,
            "text": "Who thought it wasnt important?",
            "title_similarity": "0.357481",
            "sentiment_compound": -0.1511
        },
        {
            "id": "ha4vkn9",
            "score": 1,
            "text": "Wait… men…. Feeeling?!?  \n\nOf course we want to be desired. Why was this not important before?",
            "title_similarity": "0.6615107",
            "sentiment_compound": 0.3899
        },
        {
            "id": "ha4w0j5",
            "score": 1,
            "text": "So true. Haven't had anyone \"desire\" me for 5+ years and it feels pretty bad. All my friends are settling down, some are already on 2 kids but this 34yr old can't even get a single date or a match on usual apps.",
            "title_similarity": "0.24757397",
            "sentiment_compound": 0.3221
        },
        {
            "id": "ha4w0ld",
            "score": 2,
            "text": "I thought this goes without saying? Sex is more important to men and always has been.",
            "title_similarity": "0.8143876",
            "sentiment_compound": 0.2716
        },
        {
            "id": "ha4w5ie",
            "score": 1,
            "text": "So so much of this makes sense. \n\nPart of me has just died inside reading the article, then reading the comments. But also made me realise that I've only been complimented by gay men. As a straight guy, I take any compliment that comes my way but damn",
            "title_similarity": "0.62568796",
            "sentiment_compound": 0.6542
        },
        {
            "id": "ha4wiyr",
            "score": 2,
            "text": "I know that it's important to collect data, but this seems like an absolute given. Sitting around constantly questioning if you even could be sexually attractive to your partner is just hell.",
            "title_similarity": "0.6762276",
            "sentiment_compound": -0.128
        },
        {
            "id": "ha4x3e6",
            "score": 1,
            "text": "Think there might be something wrong with me or I'm just different. I honestly just think \"Ok\" and move on when my gf compliments me. I compliment her and I can see how happy it makes her straight away but when I get complimented on my appearance it does nothing. \n\nHowever I hope those that do get happiness from it, get more compliments!",
            "title_similarity": "0.5451862",
            "sentiment_compound": 0.947
        },
        {
            "id": "ha4x4md",
            "score": 1,
            "text": "I know this to be true from the inverse \n\nFeeling unattractive, despite the right words when it's brought up, make me feel worse then almost anything.",
            "title_similarity": "0.47023815",
            "sentiment_compound": -0.4019
        },
        {
            "id": "ha4xf78",
            "score": 1,
            "text": "I've only truly gotten one compliment from a girl and it was related to my eyelashes and how they were peculiarly long for man. But because she noticed it, I always try to use it to my advantage when dating girls.\n\nMost of the other compliments are because I'm tall but that is said by both my male and female peers so I kind of take it for granted. However, after seeing \"short\" guys post about their difficulties, it is a relief that I have at least this asset that some girls like. All I need now is good game because I think I'm boring and sometimes awkward.",
            "title_similarity": "0.59646875",
            "sentiment_compound": 0.9626
        },
        {
            "id": "ha4xmis",
            "score": 1,
            "text": "New evidence suggests being told you’re sexy makes you feel sexy",
            "title_similarity": "0.66163296",
            "sentiment_compound": 0.7783
        },
        {
            "id": "ha4xols",
            "score": 1,
            "text": "Who knew men had feelings too. We like hugs also.",
            "title_similarity": "0.6286782",
            "sentiment_compound": 0.6908
        },
        {
            "id": "ha4xzf9",
            "score": 1,
            "text": "Honestly I don't get why people don't realize in 2021 that men and women aren't entirely different creatures.\n\nThe caveman days are over. We're all pretty similar now. \nMen and women both want love and all that.",
            "title_similarity": "0.69319934",
            "sentiment_compound": 0.8934
        },
        {
            "id": "ha4yh24",
            "score": 1,
            "text": "By ones partner is key.",
            "title_similarity": "0.49473017",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4ymv1",
            "score": 1,
            "text": "That is it all for me!",
            "title_similarity": "0.104349494",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4ywd2",
            "score": 1,
            "text": "You guys are just realizing this?!",
            "title_similarity": "0.38349053",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4yx36",
            "score": 1,
            "text": "Those scientists clearly do not know what we think.",
            "title_similarity": "0.3901826",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ha4z2qb",
            "score": 1,
            "text": "People want their partner to be attracted to them? Wow.",
            "title_similarity": "0.68277335",
            "sentiment_compound": 0.7845
        },
        {
            "id": "ha4z3au",
            "score": 1,
            "text": "Is this really 'science' or just basic common sense? So many of these articles seem to be stating the forehead-slappingly obvious.",
            "title_similarity": "0.40529734",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4zle2",
            "score": 1,
            "text": "is it not common knowledge that this is almost always required?",
            "title_similarity": "0.4496685",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4zlg9",
            "score": 1,
            "text": "Men: Now with feelings",
            "title_similarity": "0.5400708",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4zmzp",
            "score": 1,
            "text": "Who’d’ve thought that men are human beings with emotional needs too?",
            "title_similarity": "0.7270003",
            "sentiment_compound": 0.1531
        },
        {
            "id": "ha4zn28",
            "score": 1,
            "text": "Enthusiasm is everything.",
            "title_similarity": "0.20794423",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ha4zo0h",
            "score": 1,
            "text": "Sorry….. study’s suggest? Since when has this NOT been the case? Am I missing something?",
            "title_similarity": "0.3912248",
            "sentiment_compound": -0.4098
        },
        {
            "id": "ha4zo5g",
            "score": 1,
            "text": "Who is the 'we' in that sentence?",
            "title_similarity": "0.24677622",
            "sentiment_compound": 0.0772
        },
        {
            "id": "ha4zq8d",
            "score": 1,
            "text": "I mean, as a dumpy man in his 30's and in a loving relationship, I coulda told you that.",
            "title_similarity": "0.5684227",
            "sentiment_compound": 0.296
        },
        {
            "id": "ha4zql6",
            "score": 1,
            "text": "Tell this to my girlfriend…",
            "title_similarity": "0.1847811",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha4zsqt",
            "score": 2,
            "text": "What is it with these stupid studies. Who said men and women don’t equally have the need to feel desired by their partner?",
            "title_similarity": "0.7246852",
            "sentiment_compound": -0.3182
        },
        {
            "id": "ha4ztmr",
            "score": 1,
            "text": "Whats next? Men have feelings too or like complimemts?!",
            "title_similarity": "0.7239288",
            "sentiment_compound": 0.4857
        },
        {
            "id": "ha5032r",
            "score": 1,
            "text": "For me it’s #1. I don’t feel great about that, because it makes me feel vain and insecure, but it’s absolutely true. It’s the single most attractive trait for me in a potential partner. And not just sexually desired. I just want to feel wanted and liked above anything else.",
            "title_similarity": "0.7182522",
            "sentiment_compound": 0.9023
        },
        {
            "id": "ha5047l",
            "score": 2,
            "text": "Me, an ace, reading this : LE SIGH\nGood I'm more into women.",
            "title_similarity": "0.4842428",
            "sentiment_compound": 0.5766
        },
        {
            "id": "ha5071k",
            "score": 1,
            "text": "I really hope more studies like this get around.\nEspecially ones done by women. It helps deter any sexist comments. \n\nRomance is SO insanely important. Yet my whole dating life I've always been told \"all you want is sex\" even after telling them repeatedly I want affection/love/romance. \nI'm 36 now and still get told how I feel and what I want even though I express how much I want more. \n\nMaybe one day I'll find someone who gets it.",
            "title_similarity": "0.6062608",
            "sentiment_compound": 0.9446
        },
        {
            "id": "ha50ayd",
            "score": 1,
            "text": "Study finds that men are human beings too",
            "title_similarity": "0.5782812",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha50bsv",
            "score": 3,
            "text": "So what is the converse for women?  What do women crave that is important to them and is often neglected by men",
            "title_similarity": "0.65344036",
            "sentiment_compound": -0.3818
        },
        {
            "id": "ha50fnt",
            "score": 1,
            "text": "My wife said to me the other day 'No one else looks like you'\n\nIt was a compliment.. I think.",
            "title_similarity": "0.28321317",
            "sentiment_compound": 0.6808
        },
        {
            "id": "ha50orl",
            "score": 1,
            "text": "I kinda reay want to hear from the couples who had this talk, but it was difficult for one or both of you to change or understand because of how conditioned society leaves us to think man+sex=happy. Or that men typically should hide emotions and longing for such things. \n\nLike really, I want to hear from those people. Kinda scared to start a talk like that..",
            "title_similarity": "0.7399479",
            "sentiment_compound": -0.1235
        },
        {
            "id": "ha50zzx",
            "score": 1,
            "text": "Makes me sad to ask my gf if she finds me attractive because I never hear it.",
            "title_similarity": "0.49109632",
            "sentiment_compound": -0.0516
        },
        {
            "id": "ha5129l",
            "score": 1,
            "text": "Who knew men liked getting loved by their partners! I mean I always assumed that they were just emotionless automatons",
            "title_similarity": "0.6729675",
            "sentiment_compound": 0.7901
        },
        {
            "id": "ha513vu",
            "score": 2,
            "text": "This isn't news, partners. I'm a wealthy man at the end of the day because my partner still LIKES me.",
            "title_similarity": "0.5816358",
            "sentiment_compound": 0.7213
        },
        {
            "id": "ha5152r",
            "score": 1,
            "text": "It seems that men are lacking and really desire affection and tenderness... hmmmm",
            "title_similarity": "0.62346876",
            "sentiment_compound": 0.8581
        },
        {
            "id": "ha519on",
            "score": 1,
            "text": "Why have we been thinking that men are almost inert and don't feel anything, men and women are both human so it'd be pretty safe to assume most if not all the emotions women go through men do aswell.",
            "title_similarity": "0.6165068",
            "sentiment_compound": 0.7479
        },
        {
            "id": "ha51a65",
            "score": 1,
            "text": "It's literally why me and my ex split",
            "title_similarity": "0.31439418",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha51cy6",
            "score": 1,
            "text": "So who told people that this wasn't important?",
            "title_similarity": "0.3160438",
            "sentiment_compound": -0.1511
        },
        {
            "id": "ha51eio",
            "score": 1,
            "text": "I wonder what the study would be like on women. Men seem to be secure with their appearance on most occasions they just need the validation. Do women feel the same way when they’re complemented?",
            "title_similarity": "0.6695349",
            "sentiment_compound": 0.5994
        },
        {
            "id": "ha51eq2",
            "score": 1,
            "text": "I just want to know who ever thought men don't care if we're desired.  Of course we do.",
            "title_similarity": "0.6232223",
            "sentiment_compound": -0.0588
        },
        {
            "id": "ha51uks",
            "score": 1,
            "text": "Wow, this thread really opened my eyes. I often compliment my man bc and maybe I can do more. But sometimes I'm expecting the same thing from him and it's just not happening.. I know he likes me but I would like to hear it more from him.",
            "title_similarity": "0.69172084",
            "sentiment_compound": 0.886
        },
        {
            "id": "ha52bf6",
            "score": 1,
            "text": "In normal corners of the world men and women in a relationship remind each other how attractive and desirable they are to one another.\n\nI have not been in a single relationship where my partner and I didn't constantly remind eachother of that.\n\nAre you telling me there are socities where a partner never expresses their sexual desire for their man?",
            "title_similarity": "0.669325",
            "sentiment_compound": 0.7845
        },
        {
            "id": "ha52zon",
            "score": 1,
            "text": " It's a bit depressing that this is not already common knowledge.",
            "title_similarity": "0.4548102",
            "sentiment_compound": -0.3818
        },
        {
            "id": "ha534cu",
            "score": 1,
            "text": "I guess this goes under pointing out the obvious research.",
            "title_similarity": "0.33048433",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha534q4",
            "score": 1,
            "text": "Wait, did people think that wasnt important to men? What?",
            "title_similarity": "0.641063",
            "sentiment_compound": -0.2387
        },
        {
            "id": "ha53a1h",
            "score": 1,
            "text": "I'm asexual, how do that influence then for men?",
            "title_similarity": "0.6726444",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha53dad",
            "score": 1,
            "text": "F.d signifier went over this.\n\nAlso why I wish speed dating actually worked. Still works better than dating apps, thank shuma-gorath I was able to delete those with the vaxx out",
            "title_similarity": "0.5752483",
            "sentiment_compound": 0.7964
        },
        {
            "id": "ha53dch",
            "score": 1,
            "text": "How important did they think it was before?… this study seems obvious…",
            "title_similarity": "0.48625684",
            "sentiment_compound": 0.2023
        },
        {
            "id": "ha53x0p",
            "score": 1,
            "text": "Beyond true. Was with a my ex wife for 7 years and I was literally an afterthought to her. My new wife makes sure I feel wanted and tells how much she loves the way I look and compliments my natural smell and it actually makes me feel good.",
            "title_similarity": "0.25635922",
            "sentiment_compound": 0.9423
        },
        {
            "id": "ha540ka",
            "score": 1,
            "text": "Super important, even more so then actually having sex. just feeling wanted will make any man's day",
            "title_similarity": "0.8060984",
            "sentiment_compound": 0.7351
        },
        {
            "id": "ha541vh",
            "score": 1,
            "text": "How unimportant did people think it was?",
            "title_similarity": "0.3000794",
            "sentiment_compound": -0.3182
        },
        {
            "id": "ha543qw",
            "score": 1,
            "text": "Is this seriously news to anyone? Like, no joke, is anyone at all actually surprised by this?\n\nThe vast majority of men care about being sexually desired by their partner - or at the very least, the sex they're attracted to - than literally anything else. We are hardwired for this, and I'd bet good money that the majority of men who claim otherwise do so because they've been indoctrinated, virtually since birth, to believe that valuing being sexually desired is wrong.",
            "title_similarity": "0.827868",
            "sentiment_compound": 0.9037
        },
        {
            "id": "ha543uq",
            "score": 1,
            "text": "Sorry, but has science thought so far that men are completely independent from feelings and outside validation?",
            "title_similarity": "0.47550792",
            "sentiment_compound": -0.0387
        },
        {
            "id": "ha544yu",
            "score": 1,
            "text": "Did people think this didn't matter??",
            "title_similarity": "0.36999243",
            "sentiment_compound": -0.1114
        },
        {
            "id": "ha54dgl",
            "score": 1,
            "text": "I give my SO sincere compliments about how handsome he is and how attracted to him I am, but he doesn’t believe me. He’s at his heaviest currently and going through depression and it makes me sad that he feels this way, that I can’t help him, and that he rarely compliments me or tell me he’s attracted to me. Leaves me feeling undesirable even though I know this is a long but temporaryish problem and deep down he doesn’t find me unattractive or ugly. It’d just be nice to hear it more than a few times a year:/",
            "title_similarity": "0.66999876",
            "sentiment_compound": -0.8763
        },
        {
            "id": "ha54f6n",
            "score": 1,
            "text": ".. this needed to have a study done?  \n\nWhat's next,  feeding your partner their favourite food when they are hungry makes them happier and more satisfied than we think.",
            "title_similarity": "0.57412463",
            "sentiment_compound": 0.7574
        },
        {
            "id": "ha54iu1",
            "score": 1,
            "text": "I tell my husband how hot I think he is every day. Occasionally I’ll ask if it’s numbing him to the sentiment, but it’s always an emphatic “no keep doing it!!” Everyone likes compliments!",
            "title_similarity": "0.5841704",
            "sentiment_compound": 0.8213
        },
        {
            "id": "ha54ivd",
            "score": 1,
            "text": "It’s most notable in my opinion because I have such low self esteem with how I look. Combined with strained relationships, it feels like a welcomed unorthodox lifeline.",
            "title_similarity": "0.55444604",
            "sentiment_compound": 0.0258
        },
        {
            "id": "ha54ixn",
            "score": 1,
            "text": "Oh wow who'd have thought men are creatures with needs and feelings?",
            "title_similarity": "0.70134914",
            "sentiment_compound": 0.5859
        },
        {
            "id": "ha54m8c",
            "score": 1,
            "text": "I compliment my husband constantly even though he has a dad bod I don't care at all. But I slipped a disc and it's pinching off my spinal cord and i have a hard time getting around and I got fat. I went from an absolute 10 with men constantly drooling over me to a 5 and he doesn't really want me anymore. Oh he loves me for sure, does everything for me and takes good care of me, but he doesn't see me as a sexual being or as anyone he would sleep with. So I guess this works both ways.",
            "title_similarity": "0.55253696",
            "sentiment_compound": 0.9444
        },
        {
            "id": "ha54r7b",
            "score": 1,
            "text": "Men has ego, crazy i know.",
            "title_similarity": "0.6452472",
            "sentiment_compound": -0.34
        },
        {
            "id": "ha54tpg",
            "score": 1,
            "text": "At 18 a random lady told me I had nice eyes - I’m now 25 and a single dad. I can’t remember anything about the lady in particular, but I know where I was and if I feel low or unattractive in myself it always casts my mind back to that day and then I pick myself up and keep going",
            "title_similarity": "0.2909721",
            "sentiment_compound": -0.6808
        },
        {
            "id": "ha552f6",
            "score": 1,
            "text": "Yes, men have emotional needs. We're not rocks. Science!",
            "title_similarity": "0.55206823",
            "sentiment_compound": 0.5562
        },
        {
            "id": "ha553jr",
            "score": 1,
            "text": "This is one of many studies I see here that baffles me. I get that even if everyone thinks something is true it is good to test common beliefs to verify them, but I do not understand how the idea to question some of this stuff comes about. \n\nWho thought we didn't care if our partners find us attractive?",
            "title_similarity": "0.6567098",
            "sentiment_compound": 0.5037
        },
        {
            "id": "ha55c52",
            "score": 1,
            "text": "my ex used to call me cute and i didn’t appreciate it like i should have because I hated myself",
            "title_similarity": "0.5646558",
            "sentiment_compound": 0.4588
        },
        {
            "id": "ha55ghn",
            "score": 1,
            "text": "This was up for debate? Breaking: Compliments feel good! \n\nStay tuned for the next study next month on how insults feel!",
            "title_similarity": "0.34043756",
            "sentiment_compound": 0.5242
        },
        {
            "id": "ha55k65",
            "score": 1,
            "text": "I mean, men sure knew this all along",
            "title_similarity": "0.33481485",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha5678h",
            "score": 1,
            "text": "Reallyyyy?? That is so strange? People need to feel that their so is attracted to them? Shocker",
            "title_similarity": "0.654058",
            "sentiment_compound": 0.2668
        },
        {
            "id": "ha56dh2",
            "score": 3,
            "text": "This headline is really stupid and contradicts the study itself. More important than we think? They found that 95% of men knew it was important, and if even a third of women realized this pretty obvious fact, that's about two-thirds of the population right there. So why does the headline assume people don't realize what appears to be common knowledge.",
            "title_similarity": "0.57296777",
            "sentiment_compound": 0.0737
        },
        {
            "id": "ha56rqv",
            "score": 1,
            "text": "> than we think\n\n  \n\n\nHow important did we think it was?",
            "title_similarity": "0.48790425",
            "sentiment_compound": 0.2023
        },
        {
            "id": "ha570q4",
            "score": 1,
            "text": "Yawn. Yeah we know. Man has a one-track mind.",
            "title_similarity": "0.35498247",
            "sentiment_compound": 0.296
        },
        {
            "id": "ha570xp",
            "score": 1,
            "text": "So the entire midlife crisis concept and the staggering amount of commerce designed to cater to it wasn't a clue?",
            "title_similarity": "0.41732162",
            "sentiment_compound": -0.6249
        },
        {
            "id": "ha577p4",
            "score": 1,
            "text": "After mentioning these exact same things to my partner, and having some really thorough communication about why it doesn’t happen more often if at all, I came to the realisation that is was partly due to my own behaviour and complacency within the relationship too. Communication has been the key for me, and ultimately it’s been greatly beneficial for both of us.",
            "title_similarity": "0.6267005",
            "sentiment_compound": 0.4927
        },
        {
            "id": "ha57buk",
            "score": 1,
            "text": "Can’t relate to it, but it’s always handy to know such stuff.",
            "title_similarity": "0.45160976",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha57hhl",
            "score": 2,
            "text": "It’s pretty rare as a bloke for someone to say something nice to you",
            "title_similarity": "0.43549174",
            "sentiment_compound": 0.7184
        },
        {
            "id": "ha57vva",
            "score": 1,
            "text": "I have a relatively new partner, so we are still in the honeymoon phase I guess, but one of the things I appreciate so much about her is that she very clearly expresses her desire for me. And, as the study suggests, not just sexually but in little romantic gestures like a passing kiss etc. It is honestly so important and great for my own self-image and esteem. I think it is an important part of a relationship that each partner boosts the other's self-esteem like this.",
            "title_similarity": "0.6361964",
            "sentiment_compound": 0.9919
        },
        {
            "id": "ha5813j",
            "score": 1,
            "text": "I suppose it’s not one size fits all but my bf doesn’t really like it when I compliment him. I think he finds it awkward …definitely has said before now that he could do with less. I do try to hold back some compliments but they always just seem to fall out of my mouth, there is a lot to compliment. Weird to read about how many men go without them and wish they would hear them more.",
            "title_similarity": "0.65980923",
            "sentiment_compound": 0.8934
        },
        {
            "id": "ha58533",
            "score": 1,
            "text": "I was in a 4 year relationship and I really noticed this.\nIn the beginning the sex was amazing but in the final year we where so busy with school and stuff that we rately had sex.\nHer libido was super low all of a sudden, probably combination of birthcontrol en depression, so we never had sex anymore.\nAbsolutely broke me as a person, I was in the best physical state of my life and I felt so bad at the same time. I just missed the feeling of being desired by her.",
            "title_similarity": "0.40058002",
            "sentiment_compound": -0.6028
        },
        {
            "id": "ha588cr",
            "score": 1,
            "text": "Love this article and love these comments, makes me feel like I’m not alone for wanting affection and feel wanted",
            "title_similarity": "0.51375324",
            "sentiment_compound": 0.9436
        },
        {
            "id": "ha58jpa",
            "score": 1,
            "text": "Humans want to be wanted.",
            "title_similarity": "0.5201231",
            "sentiment_compound": 0.0772
        },
        {
            "id": "ha58nmp",
            "score": 120,
            "text": "Science has almost figured out that guys have feelings too. Almost there fellas.",
            "title_similarity": "0.59728533",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha58o8j",
            "score": 1,
            "text": "I compliment my partners all the time. More then they compliment me even haha.",
            "title_similarity": "0.4417084",
            "sentiment_compound": 0.8578
        },
        {
            "id": "ha58rid",
            "score": 1,
            "text": "I really didn’t wanna see this headline, heh. I hate myself.",
            "title_similarity": "0.34784758",
            "sentiment_compound": -0.6486
        },
        {
            "id": "ha58s3p",
            "score": 1,
            "text": "Yes. Correct. Obviously. What are men robots? The only men who pretend not to have feelings are toxic and self-destructive.",
            "title_similarity": "0.49376854",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha595cw",
            "score": 1,
            "text": "Than who thinks? You surveyed people",
            "title_similarity": "0.3645488",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha597vp",
            "score": 1,
            "text": "It's great to see the scientific foundation for research on stuff we already know is still getting a strong funding stream in these trying times.",
            "title_similarity": "0.44697887",
            "sentiment_compound": 0.8126
        },
        {
            "id": "ha598sq",
            "score": 1,
            "text": "Like how is this a surprise? Like wow, men like to feel appreciated and enticing to the person they love most, what a revelation!",
            "title_similarity": "0.7448",
            "sentiment_compound": 0.9647
        },
        {
            "id": "ha5991s",
            "score": 1,
            "text": "ah yes every time i express that they get a power psychosis and get weird dont do it girls",
            "title_similarity": "0.44818962",
            "sentiment_compound": 0.25
        },
        {
            "id": "ha59k7h",
            "score": 1,
            "text": "Who says we don’t think it is important?",
            "title_similarity": "0.36251217",
            "sentiment_compound": 0.2023
        },
        {
            "id": "ha59yu8",
            "score": 1,
            "text": "I guess I shouldn't take it for granted then. My girlfriend of 5 years constantly tells me how much she loves my arms and hair. Calls me handsome now and then.\n\nI found it weird, and I guess I didn't believe her for the longest time? I never thought of myself as attractive so I learned to not care too much about it.\n\nSo when she compliments me I get weirded out that someone would even find me attractive.\n\nBut she is also the only person besides my mother to say anything like that to me.",
            "title_similarity": "0.41953558",
            "sentiment_compound": 0.8726
        },
        {
            "id": "ha5a0sm",
            "score": 1,
            "text": "I'm a woman and I could have guessed this. Why wouldn't men want the same things I want?",
            "title_similarity": "0.5845145",
            "sentiment_compound": 0.0201
        },
        {
            "id": "ha5a144",
            "score": 1,
            "text": "I love letting my husband know how good he looks! Sometimes I intentionally stare at him until he \"catches\" me asks me what, just so I can say I like looking at him. It's adorable to see him turn a little red and smile.",
            "title_similarity": "0.5662391",
            "sentiment_compound": 0.9363
        },
        {
            "id": "ha5a3a1",
            "score": 1,
            "text": "How is this news!? Obviously people want to feel desired, it should be obvious",
            "title_similarity": "0.58469766",
            "sentiment_compound": 0.4003
        },
        {
            "id": "ha5a7br",
            "score": 1,
            "text": "How is this a “suggestion” we want to love and we want to be loved. You don’t need scientists to research on this.",
            "title_similarity": "0.5138738",
            "sentiment_compound": 0.8658
        },
        {
            "id": "ha5a845",
            "score": 1,
            "text": "Is it strange I shower my boyfriend with praises about his looks? \n\nHe didn’t used to get praises by women all that often or at all so I took it upon myself to tell him every day or every few days at least he’s cute or hot or good looking or sexy etc.",
            "title_similarity": "0.61402404",
            "sentiment_compound": 0.936
        },
        {
            "id": "ha5aa9a",
            "score": 5,
            "text": "I've been complimented once in my life about Broad shoulders, when a random middle aged woman asked me to help her take a rucksack off the tube and light heartedly said it. \n\nI still think about it now and then.\n\nI've been in a relationship for 12 years, married for 5. It's just that rare I guess.",
            "title_similarity": "0.2642733",
            "sentiment_compound": 0.6705
        },
        {
            "id": "ha5ac8w",
            "score": 1,
            "text": "Is this not known? Doesn't every guy have an 'I got a compliment 2 years ago and I'm still riding it' story?",
            "title_similarity": "0.36907506",
            "sentiment_compound": 0.5362
        },
        {
            "id": "ha5ak6b",
            "score": 5,
            "text": "Study Proves that feeling sexually desired by your partner is extremely important; Regardless of chromosomes.",
            "title_similarity": "0.7227732",
            "sentiment_compound": 0.5709
        },
        {
            "id": "ha5aohv",
            "score": 1,
            "text": "This is kinda obvious no?",
            "title_similarity": "0.1640923",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5asji",
            "score": 1,
            "text": "Me and my husband just had a conversation about this. He asked me if I was sexually attracted to him still… I really thought it was obvious but I’m thankful that he asked because it opened my eyes that I’m not making FEEL it. So I am working on being more aware to say or do what I’m thinking. He deserves to feel sought after and desired just as much as I like to feel it.",
            "title_similarity": "0.77044624",
            "sentiment_compound": 0.9161
        },
        {
            "id": "ha5ay4m",
            "score": 1,
            "text": "Any man who’s been married more than 12 minutes could’ve told you this",
            "title_similarity": "0.3566258",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5b1l8",
            "score": 1,
            "text": "Happens so rarely that when my girlfriend compliments me I think she's making a joke or lying",
            "title_similarity": "0.4627739",
            "sentiment_compound": 0.128
        },
        {
            "id": "ha5be61",
            "score": 1,
            "text": "\"More important than we think\" \nWho thinks it's not important?",
            "title_similarity": "0.54227877",
            "sentiment_compound": 0.1283
        },
        {
            "id": "ha5bfzt",
            "score": 1,
            "text": "This is news? Guess nobody asked men before.",
            "title_similarity": "0.36881167",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5bg7x",
            "score": 1,
            "text": "My wife cares about this. I have never.",
            "title_similarity": "0.14681827",
            "sentiment_compound": 0.4588
        },
        {
            "id": "ha5bisi",
            "score": 1,
            "text": "I always make sure to compliment my boyfriend. Maybe after a hair cut or a shave, maybe while he's wearing a particular shirt(or not) or maybe just coz he looks extra cute/handsome/hot that day, I always make sure to let him know. But he never accepts my compliment. Why? Is it becoz he's not used to it?",
            "title_similarity": "0.6294546",
            "sentiment_compound": -0.5162
        },
        {
            "id": "ha5bkl5",
            "score": 1,
            "text": "I'm frankly more curious as to why we'd think it *wasn't* important?",
            "title_similarity": "0.5187293",
            "sentiment_compound": 0.2502
        },
        {
            "id": "ha5bou2",
            "score": 1,
            "text": "My wife bought me cool ranch lays the other day. Bought the most romantic she gets.",
            "title_similarity": "0.27063823",
            "sentiment_compound": 0.6478
        },
        {
            "id": "ha5btxy",
            "score": 1,
            "text": "Kind of amazing how even some smart women will think “there is nothing to study about men’s desire because men’s desire is simple, straight forward, and surface-level.” and expect so much attention to their emotional needs without much empathy that men are more similar than they think.",
            "title_similarity": "0.6143304",
            "sentiment_compound": 0.9246
        },
        {
            "id": "ha5bz2d",
            "score": 1,
            "text": "Good luck with that after year 10…",
            "title_similarity": "0.26297015",
            "sentiment_compound": 0.7096
        },
        {
            "id": "ha5c3d7",
            "score": 1,
            "text": "News just I’m in - Men want to feel wanted too. Shock!",
            "title_similarity": "0.7388999",
            "sentiment_compound": -0.3802
        },
        {
            "id": "ha5c4r5",
            "score": 1,
            "text": "Someone send this to my wife please.",
            "title_similarity": "0.24460822",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha5c9wy",
            "score": 1,
            "text": "I think the opposite is also true. Being told You’d be beautiful if you just “ Fill in the blank”, preys on your mind for a long long long time.",
            "title_similarity": "0.533578",
            "sentiment_compound": 0.7717
        },
        {
            "id": "ha5ch3j",
            "score": 1,
            "text": "Oh society's discovering that men have feelings too?",
            "title_similarity": "0.753383",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5cnin",
            "score": 1,
            "text": "was this not common knowledge? huh.. yeah, in my experience, nothing makes me happier than the feeling of being wanted",
            "title_similarity": "0.6328107",
            "sentiment_compound": -0.0196
        },
        {
            "id": "ha5co7v",
            "score": 1,
            "text": "I’m really not a complement giving type of person and it has made some exes annoyed. If they brought it up I remind them I’ve never received a complement from them either. That did  not compute on their end.",
            "title_similarity": "0.41448596",
            "sentiment_compound": -0.5627
        },
        {
            "id": "ha5cpht",
            "score": 1,
            "text": "How is this news? No sh*t men want to feel desired.",
            "title_similarity": "0.7176951",
            "sentiment_compound": 0.0516
        },
        {
            "id": "ha5cw4m",
            "score": 1,
            "text": "I'll put this underneath 'things I wish more people knew'",
            "title_similarity": "0.38184974",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ha5d1cg",
            "score": 1,
            "text": "I've only received one compliment once from a girl, and it helped me through out the whole week when I was down or upset. it really does help but its extraordinarily low how we receive one",
            "title_similarity": "0.25406882",
            "sentiment_compound": -0.1055
        },
        {
            "id": "ha5d3al",
            "score": 1,
            "text": "I love when my wife grabs my butt. Glad I told her to do it more often",
            "title_similarity": "0.39982387",
            "sentiment_compound": 0.802
        },
        {
            "id": "ha5d7o5",
            "score": 1,
            "text": "Ya think. Most men don't get any compliments and when they do it makes them feel great.",
            "title_similarity": "0.55264854",
            "sentiment_compound": 0.4295
        },
        {
            "id": "ha5deoi",
            "score": 1,
            "text": "You think!? You think men don't have emotions? Of course we need all that.",
            "title_similarity": "0.6278479",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5dg8i",
            "score": 1,
            "text": "I pay lots of money to be sexually desired, I'm going broke.",
            "title_similarity": "0.55052984",
            "sentiment_compound": -0.2732
        },
        {
            "id": "ha5diju",
            "score": 1,
            "text": "I mean, thats just stating the obvious. Is there anyone anywhere that wouldnt like to have words of affirmation thrown their way from their partner? \n\n\"How come you never call me ugly?\"",
            "title_similarity": "0.47441292",
            "sentiment_compound": 0.2387
        },
        {
            "id": "ha5dlaz",
            "score": 1,
            "text": "Of course ask a prostitute, the entire industry is about temporary validation.",
            "title_similarity": "0.33455855",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5dq1c",
            "score": 1,
            "text": "Maybe it is just me and my experience but it happens so rarely, when it does happen, you either don't catch it, don't believe it, or just thrown off by how unusual it feels.",
            "title_similarity": "0.46269107",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5dqpp",
            "score": 1,
            "text": "How about:\n\nStudy suggests that we underestimate importance of feeling sexually desired by one’s partner for men",
            "title_similarity": "0.8423461",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ha5e42v",
            "score": 1,
            "text": "Im glad to know I might not be as “weird” as I have been lead to believe…interesting study!!",
            "title_similarity": "0.5302318",
            "sentiment_compound": 0.555
        },
        {
            "id": "ha5e4zt",
            "score": 1,
            "text": "We all want to feel desired. Even small compliments go a long way.",
            "title_similarity": "0.56766486",
            "sentiment_compound": 0.6249
        },
        {
            "id": "ha5e7ke",
            "score": 1,
            "text": "I don’t think many men thought otherwise.",
            "title_similarity": "0.45009077",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5ei32",
            "score": 1,
            "text": "88% huh...\n\nAt least that'll make me feel less alone..",
            "title_similarity": "0.2921162",
            "sentiment_compound": -0.1796
        },
        {
            "id": "ha5ejyj",
            "score": 1,
            "text": "How is this news, or even requiring of a study? Was there previously some widely held opinion that we... didn't want to feel desired? Sounds more like a Cosmo article.",
            "title_similarity": "0.61609024",
            "sentiment_compound": 0.6163
        },
        {
            "id": "ha5et4x",
            "score": 6,
            "text": "What!? Are you saying men are human beings who have feelings and emotions along with wanting to feel appreciated just like women?!",
            "title_similarity": "0.80002594",
            "sentiment_compound": 0.7746
        },
        {
            "id": "ha5exoc",
            "score": 1,
            "text": "When I was younger strip clubs were a strange novelty and didn’t see the allure.  The money spent would be better off on a date with getting laid after being higher probability.\n\nAfter being married for years I now realize the allure is to go somewhere where women pretend to be interested in you as an escape. The sexual aspect is actually a secondary trait to the illusion of being desired.",
            "title_similarity": "0.65718937",
            "sentiment_compound": 0.7351
        },
        {
            "id": "ha5f35i",
            "score": 1,
            "text": "I could not imagine being in a long term relationship with someone I did not find attractive.\n\nE: Yes, physically.",
            "title_similarity": "0.5377293",
            "sentiment_compound": 0.0757
        },
        {
            "id": "ha5f5w9",
            "score": 1,
            "text": "Always use \"we\" when you really mean, \"I didn't know something that should have been obvious.\"",
            "title_similarity": "0.4503438",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5flrk",
            "score": 1,
            "text": "Feels a little stupid we took this long to figure this one out.",
            "title_similarity": "0.49314648",
            "sentiment_compound": -0.4779
        },
        {
            "id": "ha5fpfj",
            "score": 1,
            "text": "When i first started dating my husband, I made a cheesy comment like “it should be illegal for you to be this handsome!!!!” in a dramatic tone. To my surprise, he was BEAMING. I realized early on that he loved getting compliments about his appearance, something he doesn’t really get from his family/friends.\n\nAs a woman, we compliment other women often, a girl at the mall with a nice pedicure, a lady at work who dyed her hair, etc. But i guess it’s not as socially acceptable for men to do that?",
            "title_similarity": "0.56816584",
            "sentiment_compound": 0.7162
        },
        {
            "id": "ha5fqhp",
            "score": 1,
            "text": "...how important did we think this was?",
            "title_similarity": "0.38542908",
            "sentiment_compound": 0.2023
        },
        {
            "id": "ha5fv4b",
            "score": 1,
            "text": "Huh. No wonder my long term relationship has always felt empty. Ive tried explaining it to her but nothing changes. Probably time to get out if it",
            "title_similarity": "0.27994138",
            "sentiment_compound": -0.25
        },
        {
            "id": "ha5g994",
            "score": 1,
            "text": "I’ll join the party here. Compliments from my wife are few and far between although I know how she feels inside. I think a lot of it is her family as giving credit or compliments takes an act of Congress.",
            "title_similarity": "0.331415",
            "sentiment_compound": 0.9231
        },
        {
            "id": "ha5giug",
            "score": 6,
            "text": "It is sad reading those comments and realizing so many men are not given enough affection and compliments. I'm sure the world would be a better place if that was the case.",
            "title_similarity": "0.7157453",
            "sentiment_compound": 0.2556
        },
        {
            "id": "ha5gmi4",
            "score": 1,
            "text": "Looking at some comments I think most people are missing the point. Study isn’t suggesting that we *have feelings,* it’s suggesting that they’re more *important* than previously thought. \n\nSo yes, still late to the party but I see plenty of people misinterpreting the findings. They basically did a study that justified all the “we have feelings, too” men v. women memes",
            "title_similarity": "0.58766574",
            "sentiment_compound": 0.7551
        },
        {
            "id": "ha5goea",
            "score": 1,
            "text": "Well, I tell you this right now, dudes….. you gotta stop announcing that you gotta take a dump all the time.",
            "title_similarity": "0.3836114",
            "sentiment_compound": -0.4019
        },
        {
            "id": "ha5gqkf",
            "score": 1,
            "text": "My wife is my biggest cheerleader and constantly makes comments about how handsome I look. it makes a huge difference to how I feel.",
            "title_similarity": "0.43214616",
            "sentiment_compound": 0.7506
        },
        {
            "id": "ha5gthr",
            "score": 1,
            "text": "Its true, all I want is my wife to want me sexually 24/7",
            "title_similarity": "0.3971994",
            "sentiment_compound": 0.5267
        },
        {
            "id": "ha5guo9",
            "score": 1,
            "text": "Every-time i see something like this i realise what a healthy relationship my parents have got maintained , my mom at every chance she has she compliments my dad telling him he looks like a model and that he is beautiful every time.\nAnd I’m so happy that 7 years ago they went to couples therapy and re ignited the love they had and now have.\nBecause for me they’re relationships has become the standard i look for in a relationship.",
            "title_similarity": "0.3755268",
            "sentiment_compound": 0.9757
        },
        {
            "id": "ha5gvsu",
            "score": 1,
            "text": "Of course it is important. Why would you not want your partner to sexually desire you?",
            "title_similarity": "0.7706108",
            "sentiment_compound": 0.507
        },
        {
            "id": "ha5h3cj",
            "score": 3,
            "text": "*More than *you* think.",
            "title_similarity": "0.31434155",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5h5uc",
            "score": 1,
            "text": "I'm my own partner.  Trust me, it's extremely important.",
            "title_similarity": "0.38374746",
            "sentiment_compound": 0.659
        },
        {
            "id": "ha5hajn",
            "score": 1,
            "text": "Because of the Covid-19 Pandemic I've gained some weight and even though I've done home exercises the whole situation has impacted my view of myself.\n\nI've gotten positive feedback from my significant other and even though I still feed bad about myself it's a lot for my self-esteem.",
            "title_similarity": "0.5727369",
            "sentiment_compound": 0.5423
        },
        {
            "id": "ha5hdaa",
            "score": 1,
            "text": "I didn’t realize this was new information. Isn’t this the kind of data that supports the idea of “love languages”?",
            "title_similarity": "0.53258574",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha5hfx6",
            "score": 1,
            "text": "I wonder how many \"studies\" it's going to take until women realise men are actually human too.\n\nI say women bacause I am sure gay dudes don't have issues with this. They're both men, so they'd know what they like/need/want.",
            "title_similarity": "0.71966434",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha5hl3e",
            "score": 2,
            "text": "This explains so much. My wife doesn’t do intimate anything anymore.",
            "title_similarity": "0.20983395",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5hlin",
            "score": 1,
            "text": "Who knew?\n\nI thought they could only man up and take one for the team over and over again with no emotions and never able to cry because you know, muscles.",
            "title_similarity": "0.3463722",
            "sentiment_compound": 0.091
        },
        {
            "id": "ha5hm95",
            "score": 2,
            "text": "That who thinks? Is this group's sexism showing? Like who would think that wouldn't be important to any individual? It would be sexist to think this was a woman only thing right?",
            "title_similarity": "0.55139744",
            "sentiment_compound": 0.4344
        },
        {
            "id": "ha5hmme",
            "score": 1,
            "text": "Were there people who thought men weren't human beings? Do people think men are just non-human workslaves or something?",
            "title_similarity": "0.63713586",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5hu9u",
            "score": 1,
            "text": "So do I just forward this to my gf or is that too direct?",
            "title_similarity": "0.40422592",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5huh3",
            "score": 1,
            "text": "1000% agree. Knowing I'm wanted is almost more gratifying than getting boinked. Otherwise sex comes off feeling like more of a chore, physically pleasing but emotionally barren.",
            "title_similarity": "0.710066",
            "sentiment_compound": 0.7276
        },
        {
            "id": "ha5i0dq",
            "score": 1,
            "text": "People want to be desired by their partners? How shocking!",
            "title_similarity": "0.7330828",
            "sentiment_compound": -0.1511
        },
        {
            "id": "ha5i678",
            "score": 1,
            "text": "I can assure you that any man who receives not too many female compliments knows how important it is without making a study.\n\nBut jokes aside, good work on scientifically proving it! Better to know it than to guess it.",
            "title_similarity": "0.62582684",
            "sentiment_compound": 0.9252
        },
        {
            "id": "ha5ihha",
            "score": 1,
            "text": "You’re saying men have feelings too? Wow revolutionary research.",
            "title_similarity": "0.71562624",
            "sentiment_compound": 0.5859
        },
        {
            "id": "ha5ijcs",
            "score": 1,
            "text": "Have you not seen Criminal Minds? Mother or lover, it’s always one of the two.",
            "title_similarity": "0.32705468",
            "sentiment_compound": 0.7633
        },
        {
            "id": "ha5isla",
            "score": 1,
            "text": "*gasp!* *clutches man pearls* so unexpected!\n\nEdit: not questioning validity of study, sad that we need to have one.",
            "title_similarity": "0.56755686",
            "sentiment_compound": -0.5248
        },
        {
            "id": "ha5j4nz",
            "score": 1,
            "text": "I'm sure this comes as absolutely no surprise to any man in a relationship.\n\nI would work the flesh off my bones to provide for my family and keep them safe. All I need to keep me going is just that feeling that I'm sexy, desirable and valued.\n\nA touch here and there, a look, a kiss, a gesture. Small things but unbelievably significant",
            "title_similarity": "0.5125053",
            "sentiment_compound": 0.8686
        },
        {
            "id": "ha5j63c",
            "score": 1,
            "text": "y.. y'all really need *a scientific study* just to realize that men like to be desired by their S.O., too?",
            "title_similarity": "0.7488849",
            "sentiment_compound": 0.5574
        },
        {
            "id": "ha5j962",
            "score": 1,
            "text": "How long did it take to understand.",
            "title_similarity": "0.22344069",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5jeej",
            "score": 1,
            "text": "It’s important to anyone in a relationship...   we all want to be desired by our partners...",
            "title_similarity": "0.5961443",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ha5jph5",
            "score": 1,
            "text": "Study suggests that men are human beings & have emotions, more research is needed!",
            "title_similarity": "0.7337376",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5kbl3",
            "score": 1,
            "text": "I do it all the time for him. \n\nIt's so rare I feel sexual desire from my man. \nIt makes me grumpy. \n\nOften.",
            "title_similarity": "0.61680186",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ha5kdhe",
            "score": 1,
            "text": "Never had a relationship, but I do remember every time I've been complimented (can be counted on one hand).\n\nIt's a borderline dangerous high to ride, so at some point you better start just ignoring what is said to avoid the false hopes.",
            "title_similarity": "0.47028345",
            "sentiment_compound": 0.7227
        },
        {
            "id": "ha5kkg8",
            "score": 1,
            "text": "Did we not all know that feeling sexually desired by a partner in a sexual relationship is important to everyone?",
            "title_similarity": "0.8163961",
            "sentiment_compound": 0.5267
        },
        {
            "id": "ha5knhz",
            "score": 1,
            "text": "It took them a whole study? I could have told you that, damn",
            "title_similarity": "0.29348582",
            "sentiment_compound": -0.4019
        },
        {
            "id": "ha5lk7w",
            "score": 1,
            "text": "I might be in the wrong sub to say this, and i do completely support the people who studied this. But this is something iv been saying to people for years. We are still animals, no matter what you want to believe or say. We are always animals, and sex is always a top priority, because thats how animals survive. But good job to the people who studied it! Maybe some high end people will see it and realize something!",
            "title_similarity": "0.48391843",
            "sentiment_compound": 0.7857
        },
        {
            "id": "ha5lv61",
            "score": 3,
            "text": "Yep. In my relationship, it is 100% up to me to initiate sex. If I don’t, and I make comments about how it’s been a while, I regularly get “you had a chance to make a move, now it’s too late.” My partner is extremely schedule oriented - so if I miss the window of opportunity - it’s my fault we don’t have sex because of her daily routine. It’s really frustrating for me, and completely takes the fun and desire out of sex. I’m not sure if this is related to the study or not… just kinda wanted to vent.",
            "title_similarity": "0.6120969",
            "sentiment_compound": 0.5492
        },
        {
            "id": "ha5lw0b",
            "score": 1,
            "text": "who on earth thinks that any person doesnt want to feel sexually desired?",
            "title_similarity": "0.5836158",
            "sentiment_compound": 0.2211
        },
        {
            "id": "ha5m1oz",
            "score": 1,
            "text": "I've always felt that men's preoccupation with sex really comes from that momentary experience of feeling desired. So often we are pushed to chase and deal with rejection that I think it creates a baseline perception of a lack of value. People can go from perceiving themselves as equal -> feeling less wanted/valuable -> unsure of how to reclaim value -> temperamental and upset at those they perceive can achieve value much easier. \n\n\nThere is no universal description of personality traits but I have found this to be anecdotally consistent.",
            "title_similarity": "0.7859584",
            "sentiment_compound": 0.2339
        },
        {
            "id": "ha5m7zs",
            "score": 1,
            "text": "the best compliment I was ever given was when a girl I had just started seeing called me sexy, the day after the first time we had sex",
            "title_similarity": "0.42368323",
            "sentiment_compound": 0.8934
        },
        {
            "id": "ha5mkbf",
            "score": 1,
            "text": "I had a moment of quiet reflection after complimenting a guy in high school who probably didn't receive enough affirmation of sexuality. \nI just said he had a reallllly  attractive name, and a few months/years later I heard through a different person that he really remembered and appreciated that moment. \nI felt somewhat guilty after, knowing he clearly received so few compliments. \n\nI always try to be more open about complimenting men, always makes their day when you notice something great about them.",
            "title_similarity": "0.61232936",
            "sentiment_compound": 0.9666
        },
        {
            "id": "ha5mmbj",
            "score": 2,
            "text": "So true, it gives you all the confidence in the world.",
            "title_similarity": "0.28845546",
            "sentiment_compound": 0.7501
        },
        {
            "id": "ha5mtaz",
            "score": 1,
            "text": "As someone who was in a relationship with someone who didn’t make me feel wanted, this is very true. That relationship broke me and got me very depressed, my self esteem is very low because of it. I know I’m not that good looking but whenever someone tells me i look good or  handsome, any compliment or makes me feel wanted in any way, it does a lot for my self esteem and it makes my day better instantly,",
            "title_similarity": "0.6557369",
            "sentiment_compound": 0.9274
        },
        {
            "id": "ha5mwgq",
            "score": 1,
            "text": "You don't realize how nice it is until you're with someone who makes a point of expressing their desire.",
            "title_similarity": "0.6413877",
            "sentiment_compound": 0.0946
        },
        {
            "id": "ha5n2wh",
            "score": 1,
            "text": "They noted they studied heterosexual men. However, I think I remember reading that homosexual men report more satisfaction in their relationships. Obviously, there are some ways in which experiences overlap better with one's partner, if they share the same gender identity and have grown up with similar cultural experiences. But, my assumption is also that there is a better comprehension of their desires due to physiological traits too. That would be a good follow up study.",
            "title_similarity": "0.7879672",
            "sentiment_compound": 0.9071
        },
        {
            "id": "ha5n7s2",
            "score": 1,
            "text": "Compliments are nice, but once you’ve been with someone for a long time, it’s the actions that become important. Easy to say a nice compliment in passing. Almost part of ones duty in a relationship no? Physical touch becomes really important, not necessarily sexual even.",
            "title_similarity": "0.6985917",
            "sentiment_compound": 0.9601
        },
        {
            "id": "ha5n98s",
            "score": 1,
            "text": "Who thought that was unimportant?",
            "title_similarity": "0.28839955",
            "sentiment_compound": -0.3182
        },
        {
            "id": "ha5nf8q",
            "score": 2,
            "text": "A friend of a friend told me I had the body for tucked in shirts. She went into passionate detail about how It zushed my appearance. You best believe I tucked in all my shirts for like a year after. It helped so much with my confidence and how I looked at myself.",
            "title_similarity": "0.29285026",
            "sentiment_compound": 0.9628
        },
        {
            "id": "ha5o0cx",
            "score": 23,
            "text": "is it because men rarely get complimented, and we remember that one time 7 years ago when the bartender said we look good tonight?\n\nDidn't even matter that it was a dude.",
            "title_similarity": "0.421127",
            "sentiment_compound": 0.1265
        },
        {
            "id": "ha5o0tq",
            "score": 1,
            "text": "That's literally the only thing that I need in a relationship,  how do people get in relationship with someone if they don't find you hot",
            "title_similarity": "0.6375257",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5o2ke",
            "score": 1,
            "text": "why did you think we didn’t think that???",
            "title_similarity": "0.3652029",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5o2nj",
            "score": 1,
            "text": "This sub could be an argument for defunding social science.",
            "title_similarity": "0.41622904",
            "sentiment_compound": -0.3612
        },
        {
            "id": "ha5o41b",
            "score": 1,
            "text": "Who tf thought it wasn’t top priority important?",
            "title_similarity": "0.43625885",
            "sentiment_compound": 0.3818
        },
        {
            "id": "ha5oaub",
            "score": 1,
            "text": "Yes. And it can be a turn on as well.",
            "title_similarity": "0.3431192",
            "sentiment_compound": 0.5859
        },
        {
            "id": "ha5ocpi",
            "score": 1,
            "text": "Men have been saying that for years, and women have been capitalizing on it for just as long.",
            "title_similarity": "0.38071516",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5ocwt",
            "score": 1,
            "text": "I love it when studies confirm things that seem like common sense but we all aren't quite sure if still.",
            "title_similarity": "0.5657655",
            "sentiment_compound": 0.1485
        },
        {
            "id": "ha5oueg",
            "score": 1,
            "text": "Well, that’s it, I’m dead on this inside and romantically.",
            "title_similarity": "0.25496063",
            "sentiment_compound": -0.1027
        },
        {
            "id": "ha5ow1x",
            "score": 1,
            "text": "I’ve always said this nice to see I was correct",
            "title_similarity": "0.23782896",
            "sentiment_compound": 0.5023
        },
        {
            "id": "ha5pamj",
            "score": 1,
            "text": "Who ever thought this wasn't important to men? It's blindingly obvious to anyone paying attention.",
            "title_similarity": "0.4823641",
            "sentiment_compound": -0.1511
        },
        {
            "id": "ha5pbyn",
            "score": 1,
            "text": "Umm. What made the world go 'round? All these years until recently? The fact that a study was done on this is direct evidence we are done as a species.",
            "title_similarity": "0.33846527",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5pcsw",
            "score": 1,
            "text": "Ok so here are the steps to have a higher self esteem:\n\nStep 1: get a partner\n\nThere's no step 2 if I keep failing at step 1",
            "title_similarity": "0.5678584",
            "sentiment_compound": -0.5106
        },
        {
            "id": "ha5pgmn",
            "score": 3,
            "text": "I agree that compliments/feeling sexually desired are important to guys as much as to ladies. The problem is that some don’t put any effort to stay attractive at all and still want compliments and still want their partners to be sexually attracted (Vice versa for women). Aging is inevitable but just giving up on their body(not when you don’t have medical condition but when you are just lazy) and having a mentality like my body is perfect as it is and so should people or my partner think as well is not attractive. I can still compliment their other aspects like their personality or their strengths but physical/sexual attraction is something I have to feel and I can’t force myself to feel it.",
            "title_similarity": "0.73394424",
            "sentiment_compound": 0.9826
        },
        {
            "id": "ha5pmc5",
            "score": 1,
            "text": "I mean really.  If you have to be told this,  you probably shouldn't have a boyfriend.  Sheesh.",
            "title_similarity": "0.554693",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5poaa",
            "score": 1,
            "text": "So most hetero males are more insecure than they let on... also in today's news sugar is more water soluble than it previously claimed to be.",
            "title_similarity": "0.63950515",
            "sentiment_compound": -0.4754
        },
        {
            "id": "ha5ppkd",
            "score": 1,
            "text": "I'd like to see this study for non-heteronormative people who fall outside the standard sexual relationship dynamic. People on the asexual/gray-asexuality spectrum, etc.\n\nSomething tells me (mostly personal anectodal evidence) that they don't have a similar need since they place far less value on sex and sexual desire.",
            "title_similarity": "0.67281854",
            "sentiment_compound": 0.8363
        },
        {
            "id": "ha5puft",
            "score": 1,
            "text": "Yeah all this stuff is a matter of comments sense really at this point",
            "title_similarity": "0.28174692",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha5pxrs",
            "score": 1,
            "text": "Complete and utter clickbait title, check\n\nBorderline trivial truth in said title, check\n\nPsychology, check",
            "title_similarity": "0.315673",
            "sentiment_compound": 0.296
        },
        {
            "id": "ha5q047",
            "score": 1,
            "text": "I constantly worry yaar my sexual advances are being accepted as responsibility.\n\n\"Letting me\" have sex makes me feel gross and abusive. \n\nFeeling sexually desired makes me feel accepted.",
            "title_similarity": "0.7370714",
            "sentiment_compound": -0.6597
        },
        {
            "id": "ha5q2lh",
            "score": 1,
            "text": "Sounds great, wonder what it's like.",
            "title_similarity": "0.27879512",
            "sentiment_compound": 0.765
        },
        {
            "id": "ha5q90t",
            "score": 1,
            "text": "This was one of the things that ruined my last relationship. I had to initiate a lot of the sexual stuff. I ended up doing it too much and pushing her away.",
            "title_similarity": "0.50848526",
            "sentiment_compound": -0.4767
        },
        {
            "id": "ha5qbeo",
            "score": 1,
            "text": "Is this honestly an actual surprise to anyone. Its like the number one thing brought up in any askmen thread.",
            "title_similarity": "0.36273092",
            "sentiment_compound": 0.7845
        },
        {
            "id": "ha5qp0g",
            "score": 1,
            "text": "What? Men have feelings too? No, that's nonsense.",
            "title_similarity": "0.5890578",
            "sentiment_compound": -0.4696
        },
        {
            "id": "ha5qq00",
            "score": 1,
            "text": "Wait’ll they learn we also have tons of body issues",
            "title_similarity": "0.38483858",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5r8i4",
            "score": 1,
            "text": "My wife cheated and now I just assume I'm unwanted by everyone even when women show interest. I definitely agree, before that whole thing I felt like a king to be with someone so beautiful who I thought felt the same.",
            "title_similarity": "0.5484401",
            "sentiment_compound": 0.8883
        },
        {
            "id": "ha5s3br",
            "score": 3,
            "text": "This is something I'm struggling with a LOT right now with my gf of 1 year. I am a very openly affectionate and passionate person. I give out compliments readily and I'm usually enthusiastic during sex. I tell her how cute, beautiful, sexy, hot, funny, and amazing she is all the time. But I get NOTHING in return.\n\nIt's been 6 weeks since we last had sex. Twice I've made a hard attempt at initiating and even whispered something like \"I want you\" and she flat out rejected it. Even when we do have sex, she never seems to enjoy it. She never takes control, she won't even be on top, and when we're done she just rolls over and goes to sleep. It's to the point of making me quite depressed. \n\nBut I don't want her to think it's just about sex. I'd say my libido is pretty low and I'm generally content with sex once or twice a week. There are definitely weeks where I'm not in the mood at all. For me, it's more about the feeling of want and desire. I think she is unbelievable gorgeous and sexy.... I feel like she doesn't feel that same way about me. Or that I've been a bad lover and don't do enough for her sexually. I honestly don't even know but it's killing me.\n\nIt's at the point where it's ruining the relationship. It's absolutely crushed my self confidence and my mental health. I'm petrified to talk to her about it though because I don't want to seem like I'm forcing her to have sex with me or anything.",
            "title_similarity": "0.45740592",
            "sentiment_compound": 0.977
        },
        {
            "id": "ha5sevw",
            "score": 1,
            "text": "\"Recent study suggests men have emotions too\"\n\nI feel like I see this headline constantly.",
            "title_similarity": "0.56630933",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha5si85",
            "score": 1,
            "text": "This. When my girlfriend talks to me about how much she's been wanting me and craving me, it makes me feel so good and important. Being desired is an incredible feeling and it's super important to us. Seriously helped with my depression.",
            "title_similarity": "0.5622697",
            "sentiment_compound": 0.8401
        },
        {
            "id": "ha5siz7",
            "score": 1,
            "text": "Dealing with this right now in my long term relationship, it’s really cool to know I’m not alone.",
            "title_similarity": "0.39323938",
            "sentiment_compound": 0.516
        },
        {
            "id": "ha5sq9q",
            "score": 2,
            "text": "We like to feel handsome and desirable. Men don't get many compliments, and even in a relationship that is overflowing with verbal love, knowing that my girlfriend thinks unclean thoughts about me is the best confidence booster ever.",
            "title_similarity": "0.68729275",
            "sentiment_compound": 0.9548
        },
        {
            "id": "ha5ssr3",
            "score": 1,
            "text": "I don’t think we needed science to figure this out. It should be pretty obvious? Ofc not because we’re robots made in a factory",
            "title_similarity": "0.35394102",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ha5svuh",
            "score": 1,
            "text": "Wow reading all these makes me feel like I should compliment my husband more. I know I don’t do it enough but that is because when I do he goes hog wild with it & doesn’t let it go. \nEverything that he does he’s always asking me to tell him what a great job he did. Is he a narcissist?\nI don’t expect to be complimented on everything. \nBut now I know it means a lot to him.",
            "title_similarity": "0.6689016",
            "sentiment_compound": 0.9387
        },
        {
            "id": "ha5tetm",
            "score": 1,
            "text": "I don’t get why anyone would think otherwise honestly",
            "title_similarity": "0.4053623",
            "sentiment_compound": 0.4588
        },
        {
            "id": "ha5ttpv",
            "score": 1,
            "text": "Did we really need science to tell us this.",
            "title_similarity": "0.40553898",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5u0xd",
            "score": 1,
            "text": "Oh boy this does not bode well for me.",
            "title_similarity": "0.33333033",
            "sentiment_compound": -0.2057
        },
        {
            "id": "ha5ufmk",
            "score": 1,
            "text": "My wife makes me feel like a stud. It floods me with feel good endorphins and confidence. So I try to live up to being a stud. It’s a virtuous cycle.",
            "title_similarity": "0.51029366",
            "sentiment_compound": 0.9022
        },
        {
            "id": "ha5ulzx",
            "score": 3,
            "text": "As someone who has been in excellent shape at times and also just shy of obesity at times, I don't get turned on by the idea of my fat, weak ass getting it on with an attractive woman.    \nPart of the equation is in my hands, and I don't stay in a relationship with women who don't find me attractive.  \nIf neither of us are expressing our desires about what we find sexy and attractive, it isn't a very healthy relationship, and people don't usually become unattractive overnight.  \nWhen I was young I was somewhat oblivious to my own attractiveness but by the time I was twenty, it was pretty obvious that guys need to be attractive in some way and that I needed to take responsibility for the aspects of myself which I can control if I want to attract the women I find desirable.  \nAnd it seemed obvious to me that if we aren't finding each other sexy, that something is wrong with the relationship.    \nI have a difficult time believing that most men are oblivious to this. It sounds like one of those gender norms that is not based in reality.  \nI think a lot of guys get the things women find sexy wrong often enough, like think they have to have a cool car or clothes. But it seems to me they are pretty aware that they need to be attractive enough to get the response and relationship they want with women.",
            "title_similarity": "0.6406453",
            "sentiment_compound": 0.9876
        },
        {
            "id": "ha5urqc",
            "score": 1,
            "text": "Sorry but was this in doubt?\n\nMen's egos have been the center of traditional relationships all along.",
            "title_similarity": "0.67022145",
            "sentiment_compound": -0.5267
        },
        {
            "id": "ha5uszl",
            "score": 5,
            "text": "r/science has the most unscientific headlines, studies say",
            "title_similarity": "0.4603967",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5vag4",
            "score": 1,
            "text": "My best friend for almost 30 years is dealing with this in his marriage. I’ve never seen him lack confidence like this or be so self-hating, just because he feels his wife isn’t attracted to him anymore. It’s really affecting him negatively to the point where he wants to go out to meet women just to feel wanted and attractive again, not to cheat on his wife or anything. He’s really one of the best and kindest people out there so it’s difficult to watch him struggle and I can’t help.",
            "title_similarity": "0.57405555",
            "sentiment_compound": 0.9755
        },
        {
            "id": "ha5vbxk",
            "score": 1,
            "text": "In 2050 a study will show that men also like to cuddle.",
            "title_similarity": "0.5943101",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha5vgez",
            "score": 1,
            "text": "Uhhhhhh yeah! Men want cuddles and want to feel desired too!!",
            "title_similarity": "0.7316816",
            "sentiment_compound": 0.6981
        },
        {
            "id": "ha5voey",
            "score": 25,
            "text": "I met a very happy couple a few years back. I was talking to the woman about relationships, and she told me \"Every now and then, before he goes off to work, I look at him and say 'You are SO handsome and capable and smart and strong!! How did I get so lucky??' \" And she told me how he would just beam and have a great day after that. I really took this to heart. Unfortunately, after 8+ years with my partner, I often forget how powerful that message was. I'm grateful to have stumbled upon this thread today. :) \n\nNow excuse me while I go butter up my partner.",
            "title_similarity": "0.4776821",
            "sentiment_compound": 0.99
        },
        {
            "id": "ha5vrzs",
            "score": 1,
            "text": "Ok, question. How does this article know how important we *think* it is?",
            "title_similarity": "0.44710904",
            "sentiment_compound": 0.2023
        },
        {
            "id": "ha5vzu9",
            "score": 1,
            "text": "Men are human? No way!",
            "title_similarity": "0.34225604",
            "sentiment_compound": -0.3595
        },
        {
            "id": "ha5w08t",
            "score": 1,
            "text": "\"And in a turn of events as shocking as it is controversial, a new study suggests that men.. *squinting at teleprompter*.. I can't be reading this right, did we get the lines mixed up on th- huh? it's correct? Well, I'll be damned *Widens eyes with a few quick blinks while blowing out a gust of air and shaking their head*.. suggests that the gross walking wallets known as *men* have *human emotions.*",
            "title_similarity": "0.60146797",
            "sentiment_compound": -0.8466
        },
        {
            "id": "ha5xbf9",
            "score": 1,
            "text": "My wife says she loves me all the time but when she says she wants me, I get a fantastic feeling",
            "title_similarity": "0.37802273",
            "sentiment_compound": 0.8402
        },
        {
            "id": "ha5xhrn",
            "score": 1,
            "text": "Im 25yo rn my first compliment was at 23yo and it was one of The best feelings ever I cant imagine how it would feel having someone that loves you!",
            "title_similarity": "0.39794216",
            "sentiment_compound": 0.906
        },
        {
            "id": "ha5xpw9",
            "score": 1,
            "text": "It’s like half of the battle for me.",
            "title_similarity": "0.31274152",
            "sentiment_compound": -0.0258
        },
        {
            "id": "ha5xw5y",
            "score": 1,
            "text": "Ohh. I don’t think I’ll have someone to say that to me",
            "title_similarity": "0.22086443",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5xx1v",
            "score": 1,
            "text": "Must be nice to even have a partner",
            "title_similarity": "0.4488122",
            "sentiment_compound": 0.4215
        },
        {
            "id": "ha5xx3r",
            "score": 1,
            "text": "Is it normal for a man not to believe any compliments he receives?",
            "title_similarity": "0.60285735",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ha5ycsz",
            "score": 1,
            "text": "Literally any man could tell you this",
            "title_similarity": "0.30543843",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5yeu1",
            "score": 1,
            "text": "I read the article. As a 40 year old guy I can only say, this is news? I seriously have to question anyone who thought men's sexuality was nothing more than surface level, physical desire. Of course we like flirting, of course having a partner show real desire and interest in us is extremely important. I'm sorry for sounding like a condescending a-hole but it's baffling that people thing this isn't the case.",
            "title_similarity": "0.77508724",
            "sentiment_compound": 0.759
        },
        {
            "id": "ha5yi2o",
            "score": 1,
            "text": "Yes... being sexually desired by your partner is important to anybody. Go science!",
            "title_similarity": "0.656199",
            "sentiment_compound": 0.7088
        },
        {
            "id": "ha5ymut",
            "score": 2,
            "text": "By “we” they mean women. Could have surveyed 10 random guys and got the same info.",
            "title_similarity": "0.43197858",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5ynos",
            "score": 2,
            "text": "Words of affirmation is a love language!",
            "title_similarity": "0.38394123",
            "sentiment_compound": 0.6696
        },
        {
            "id": "ha5yord",
            "score": 1,
            "text": "Who tf thought it was not important?",
            "title_similarity": "0.3535037",
            "sentiment_compound": -0.1511
        },
        {
            "id": "ha5yroj",
            "score": 1,
            "text": "\"Study shows men have been lying about the emotional need to be sexually desired in earnest.\"",
            "title_similarity": "0.76176023",
            "sentiment_compound": 0.3818
        },
        {
            "id": "ha5yy2g",
            "score": 1,
            "text": "My wife tells me she wants me to have a dad-bod but I just can't do it. I know deep down she wants me to work out and be sexy like Chris Hemsworth but doesn't want to say it",
            "title_similarity": "0.5588652",
            "sentiment_compound": 0.8185
        },
        {
            "id": "ha5zcjr",
            "score": 1,
            "text": "I always tell spouse ‘you’re beautiful’, they used to reply ‘I’m just a weirdo’ and now they say ‘ummm I’m alright’ \n\nSo definitely makes an impact",
            "title_similarity": "0.50325406",
            "sentiment_compound": 0.541
        },
        {
            "id": "ha5ze60",
            "score": 1,
            "text": "Study shows that men have feelings too.",
            "title_similarity": "0.66750175",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha5zjvh",
            "score": 1,
            "text": "After my last relationship I thought this wasn't important because my ex would get extremely mad at me for telling him that he was attractive, initiating sex, or even trying to hug or kiss him. He made me feel awful about wanting to have any sort of intimacy with him.",
            "title_similarity": "0.5873905",
            "sentiment_compound": 0.1815
        },
        {
            "id": "ha5zkkt",
            "score": 1,
            "text": "Probably. My bf is always surprised when I call him sexy.....poor guy. I love him for more than his looks, but like myself, we need to know we are beautiful.",
            "title_similarity": "0.71411186",
            "sentiment_compound": 0.9127
        },
        {
            "id": "ha5znr5",
            "score": 1,
            "text": "I always told my ex how I hated how I always had to initiate anything sexual, because if i'm the only one asking for it it makes it feel like its not wanted. Well 6 months later and I was still the only one to ever imply any sexual interest in the other and I am now back to being single. Men can have low self confidence as well and if I feel like I have to work for sex instead of her just wanting it then it just wasn't going to last.",
            "title_similarity": "0.5201201",
            "sentiment_compound": 0.647
        },
        {
            "id": "ha60072",
            "score": 2,
            "text": "My ex was a trans guy. I'm bringing it up because he got on both sides of the gender divide, realized men don't get compliments, and I think resolved to give guys he dated lots of compliments as a result.\n\nHe called me pretty all the time. I thought it was odd at first because you don't call guys pretty but I got used to it. It's a nice thing being pretty for someone.\n\nOur relationship didn't work out but we're on good terms and I'm always going to think of him looking at me and telling me how pretty I was.",
            "title_similarity": "0.6727125",
            "sentiment_compound": 0.9542
        },
        {
            "id": "ha608xa",
            "score": 1,
            "text": "Study suggest men have feelings too",
            "title_similarity": "0.70518017",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha609l5",
            "score": 1,
            "text": "This is why it’s hard for a dude to not give in that feels unwanted at home and gets a simple compliment elsewhere.",
            "title_similarity": "0.6641818",
            "sentiment_compound": 0.2023
        },
        {
            "id": "ha60c0p",
            "score": 1,
            "text": "I didn't realise we didn't think this was important to men. I'm a man and it seems like a no brainer.",
            "title_similarity": "0.633566",
            "sentiment_compound": 0.2732
        },
        {
            "id": "ha60fu7",
            "score": 1,
            "text": "I have maybe received 1 or 2 compliments from my partner of 6 years. Guess I look like a thumb or something...",
            "title_similarity": "0.32342342",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ha60l2o",
            "score": 1,
            "text": "Than we think? How do you even measure the level of importance we think it has",
            "title_similarity": "0.48628426",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha60o8a",
            "score": 2,
            "text": "The book \"For Women Only\" talks about this. Being rejected for sex is an emotional thing for men a lot more than a physical frustration\n\nMen want to feel desired. They think, \"I think she's irresistible, I wish she felt that way about me too\"",
            "title_similarity": "0.7897121",
            "sentiment_compound": 0.1779
        },
        {
            "id": "ha60sqf",
            "score": 1,
            "text": "Wasn’t this kind of a given though? Doesn’t matter what gender you are, everyone likes to feel sexy.",
            "title_similarity": "0.5771798",
            "sentiment_compound": 0.743
        },
        {
            "id": "ha60vn0",
            "score": 1,
            "text": "My wifes disability and associated meds do a number on her sex drive. It can be a kick in the ego sometimes if I let it get in my head too much.",
            "title_similarity": "0.56276727",
            "sentiment_compound": 0.0772
        },
        {
            "id": "ha615rk",
            "score": 1,
            "text": "It’s as if men actually do have feelings. Such a shock I tell ya.",
            "title_similarity": "0.6322768",
            "sentiment_compound": -0.3818
        },
        {
            "id": "ha61cs1",
            "score": 1,
            "text": "Is 300 a large enough sample to come to any conclusion? And I’m sure many more men would have been willing to take the study had they known about it.",
            "title_similarity": "0.6259136",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha61e7j",
            "score": 2,
            "text": "So true. Being desired is an absolute turn on.",
            "title_similarity": "0.48068076",
            "sentiment_compound": 0.6659
        },
        {
            "id": "ha61f66",
            "score": 1,
            "text": "Wow… very surprising, totally didn’t see this coming",
            "title_similarity": "0.27367973",
            "sentiment_compound": 0.3384
        },
        {
            "id": "ha625mv",
            "score": 1,
            "text": "Undoubtedly true. I don't need gifts. Just touch me and tell me I'm pretty. Haha",
            "title_similarity": "0.32249773",
            "sentiment_compound": 0.8402
        },
        {
            "id": "ha62c23",
            "score": 7,
            "text": "Alarming that a study like this is made to be groundbreaking and revolutionary, it seems like common sense. 95% of guys will tell you that feeling sexually desired will give them more security, a sense of worth, and confidence. Sad that guys were never seriously asked in numbers before.",
            "title_similarity": "0.7139735",
            "sentiment_compound": 0.8863
        },
        {
            "id": "ha62equ",
            "score": 2,
            "text": "Surprise: Men have feelings\n\n&#x200B;\n\nEdit: typo",
            "title_similarity": "0.5967971",
            "sentiment_compound": 0.2732
        },
        {
            "id": "ha62js2",
            "score": 1,
            "text": "We already thought the importance was infinity tho",
            "title_similarity": "0.24789202",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha62m6b",
            "score": 4,
            "text": "This is the case too. My wife will have sex if we are both available when I ask and sometimes she suggests it, but I never feel desired. I would love for her to come up to me kissing me and expressing a desire. Unfortunately, what I really want is for HER to want to do that, I'm sure she would do that on request but it would be because I want her to.",
            "title_similarity": "0.53497386",
            "sentiment_compound": 0.9503
        },
        {
            "id": "ha62vut",
            "score": 1,
            "text": "Umm, yeah, it matters a great deal.",
            "title_similarity": "0.32271865",
            "sentiment_compound": 0.7506
        },
        {
            "id": "ha62y1g",
            "score": 1,
            "text": "Wow... It's almost as though men are human beings too, eh?!",
            "title_similarity": "0.576632",
            "sentiment_compound": 0.6239
        },
        {
            "id": "ha63bfk",
            "score": 1,
            "text": "I wonder how many men do something to become more attractive, especially those who are in a relationship and feel unattractive.",
            "title_similarity": "0.8420413",
            "sentiment_compound": 0.0754
        },
        {
            "id": "ha63efo",
            "score": 1,
            "text": "I feel like guys had been saying this since 20+ years. We really needed science to acknowledge that?",
            "title_similarity": "0.37791562",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha63w0w",
            "score": 1,
            "text": "I currently experience this and it‘s such an exciting feeling.",
            "title_similarity": "0.33800906",
            "sentiment_compound": 0.5719
        },
        {
            "id": "ha63wju",
            "score": 5,
            "text": "A lot of men should probably be less unappealing then I suppose. \n\nBeing a hairy chubby slob probably isn’t going to get the wife all hot and bothered.",
            "title_similarity": "0.7174723",
            "sentiment_compound": -0.3182
        },
        {
            "id": "ha63x37",
            "score": 1,
            "text": "Who exactly thought it was not important for men?",
            "title_similarity": "0.5100411",
            "sentiment_compound": -0.1511
        },
        {
            "id": "ha63y0m",
            "score": 1,
            "text": "Thanks for providing some science to help my partner understand.",
            "title_similarity": "0.40656835",
            "sentiment_compound": 0.6808
        },
        {
            "id": "ha6437m",
            "score": 3,
            "text": "I like how I can be upset or anxious or depressed and all my wife has to do is say \"you know I still love you, right?\" and there's an immediate improvement. Results vary but I tend to bounce back much faster when she says something like that.",
            "title_similarity": "0.47676694",
            "sentiment_compound": 0.631
        },
        {
            "id": "ha643vs",
            "score": 5,
            "text": "Science?\n\nA survey of men at a backyard barbecue could have solved this 'mystery' in 5 minutes. I am amazed at how easily taxpayer money can be squandered.",
            "title_similarity": "0.3364996",
            "sentiment_compound": 0.7717
        },
        {
            "id": "ha64e98",
            "score": 1,
            "text": "How do they know what we think tho.",
            "title_similarity": "0.3446879",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha64xbo",
            "score": 2,
            "text": "Men and women just want the same things, hugs, chips and dips.",
            "title_similarity": "0.41276017",
            "sentiment_compound": 0.5423
        },
        {
            "id": "ha64yv6",
            "score": 1,
            "text": "How is this something that we didn't already know?\n\nWhat is the demographic that assumed that men didn't need affirmation of Attraction from their partner?",
            "title_similarity": "0.73485744",
            "sentiment_compound": 0.5204
        },
        {
            "id": "ha64zkg",
            "score": 2,
            "text": "Who’s the ‘we’ in the headline? \n\nBecause it certainly isn’t men.",
            "title_similarity": "0.42963582",
            "sentiment_compound": 0.34
        },
        {
            "id": "ha656e8",
            "score": 1,
            "text": "I think the thing that makes me feel the best is when I am washing dishes or concentrating on something and my wife comes up behind me and hugs me or touches me in a slightly sexual way.",
            "title_similarity": "0.38404185",
            "sentiment_compound": 0.8126
        },
        {
            "id": "ha65a0o",
            "score": 1,
            "text": "New study men actually want to be loved more then women think",
            "title_similarity": "0.87450475",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ha65dhs",
            "score": 1,
            "text": "This is mostly such a wholesome thread.",
            "title_similarity": "0.2226621",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha65jlt",
            "score": 1,
            "text": "\"Suggests\"? Are you f'ing kidding me? We didn't need a scientific study to know this.",
            "title_similarity": "0.34578046",
            "sentiment_compound": 0.1926
        },
        {
            "id": "ha65kk2",
            "score": 5,
            "text": "\"Objectification\" gets a bad rap. \n\nPeople of all genders understandably don't want to have objectification non-consensually inflicted on them. But at the same time there is a deep and universal desire to still want to be the object of sexual desire, and not exclusively the subject experiencing it. \n\nWe really need to improve our language around discussing viewing people as objects of sexual desire, because simply painting \"objectification\" as universally negative undermines people's ability to have a fully satisfying relationship and sexual identity.",
            "title_similarity": "0.6925656",
            "sentiment_compound": 0.922
        },
        {
            "id": "ha65p53",
            "score": 2,
            "text": "News flash: men have feelings",
            "title_similarity": "0.6019733",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha65t82",
            "score": 5,
            "text": "Next: Who could know men are able to have the same feelings like women!",
            "title_similarity": "0.65092266",
            "sentiment_compound": 0.4199
        },
        {
            "id": "ha663v0",
            "score": 3,
            "text": "My wife uses my belly as a pillow when reading a book. Then falls asleep. Yeah I would not trade it for anything else.",
            "title_similarity": "0.2538917",
            "sentiment_compound": 0.296
        },
        {
            "id": "ha666gm",
            "score": 1,
            "text": "As a 30 something who's been in a few relationships but is currently single, the only people who have ever called me handsome were my grandma and mom. This study just reminded me how depressing that is. Thanks.",
            "title_similarity": "0.3681454",
            "sentiment_compound": 0.6956
        },
        {
            "id": "ha66cc9",
            "score": 2,
            "text": "It works for women too",
            "title_similarity": "0.25731423",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha66jp2",
            "score": 1,
            "text": "Makes complete sense, tho. Regardless of the gender, it’s a special kind of pain when your partner informs you that you’re no longer attractive to them. That’s something I’ve experienced both in the past and in the present, and it’s a hurt that lingers, causes doubt and insecurity, and poisons thoughts.",
            "title_similarity": "0.5948046",
            "sentiment_compound": -0.9486
        },
        {
            "id": "ha66zy5",
            "score": 2,
            "text": "Is this a question?  I’ve never had a single partner who didn’t show attraction and in some subtle way acknowledge that it’s important.\n\nBeing with a woman who doesn’t show sexual attraction to me would be weird.  It wouldn’t get very far, and I wouldn’t even think of it as dating unless she said something about it.\n\nI’m not talking about someone being shy, reserved, or moving slowly.  Even people who take their time signal attraction.\n\nAre there men out there cohabitating with women who aren’t even attracted to them?",
            "title_similarity": "0.561961",
            "sentiment_compound": 0.8823
        },
        {
            "id": "ha6736p",
            "score": 2,
            "text": "Today, on obvious things are obvious",
            "title_similarity": "0.17873026",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha67nsa",
            "score": 2,
            "text": "Science discovers men have feelings",
            "title_similarity": "0.6244453",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha67w2d",
            "score": 1,
            "text": "Ohhh man, it means SO much to us (or at least me). I’d die if my wife didn’t think I was a tad bit “sexy”. She tells me that a good amount and I always think, “god, how lucky am I” because I know she could have done SO much better",
            "title_similarity": "0.58856475",
            "sentiment_compound": 0.6883
        },
        {
            "id": "ha681ey",
            "score": 1,
            "text": "Yuppers, the emotions your partner experiences the more it feeds the brain. Emotions = Voltage of your being. Forget blockers.",
            "title_similarity": "0.6452694",
            "sentiment_compound": -0.2263
        },
        {
            "id": "ha68e6v",
            "score": 1,
            "text": "Wow it’s almost like men have been saying this for all of time and yet society is just realizing that men do, in fact, have emotional needs that need to be in a relationship by their female partners.",
            "title_similarity": "0.72877496",
            "sentiment_compound": 0.7655
        },
        {
            "id": "ha68eph",
            "score": 1,
            "text": "Rip short ugly smoll pp homies.",
            "title_similarity": "0.2697872",
            "sentiment_compound": -0.5106
        },
        {
            "id": "ha68fqe",
            "score": 1,
            "text": "I've been seeing some version of this article title for the past 10 years. Who is the \"we\" that hasn't picked up on the fact that men also have self esteem issues?",
            "title_similarity": "0.4808303",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha694qe",
            "score": 1,
            "text": "Alternative heading:\n\nWomen typically give so little thought to men’s feelings that they needed to conduct a study to find out men like to feel wanted and appreciated.",
            "title_similarity": "0.7066508",
            "sentiment_compound": 0.7003
        },
        {
            "id": "ha695q2",
            "score": 1,
            "text": "My boyfriend sent me a link to this as a way of saying I don’t compliment his appearance or make him feel attractive enough. This has been tough for me because when we were first dating I thought he was the hottest thing but since then he has put on 60+ lbs and I just don’t find him attractive anymore. I love him and my love for him is what keeps things alive but it’s hard to want to have sex the way I wanted to before. I feel like I could never say “your weight makes me unattracted to you” because that would kill him, I know he feels bad about his weight.",
            "title_similarity": "0.6959206",
            "sentiment_compound": 0.9246
        },
        {
            "id": "ha69f0l",
            "score": 1,
            "text": "They really had to do a study to realize men also like being physically attractive?",
            "title_similarity": "0.8354608",
            "sentiment_compound": 0.6597
        },
        {
            "id": "ha69kpj",
            "score": 1,
            "text": "I read the first sentence, particularly \"while feeling desired themselves is relatively unimportant\" and thought \"people think what now??\".\n\nPart of desiring and romancing stems from a need/want of being desired and romanced. That's my town personal take at least, and I feel like ranting on and on about how this, coupled with men not being socially \"allowed\" to express this, perpetuates harmful behaviour...\n\nGirls, guys, everyone, we all just want some love :(",
            "title_similarity": "0.6734552",
            "sentiment_compound": 0.9313
        },
        {
            "id": "ha69nqg",
            "score": 1,
            "text": "*Examples included having their woman partner rub their feet, give them a kiss in passing, cuddle up to them on the couch, or tell them they looked cute or sexy. The implications for this are, in my opinion, quite large. It not only paints a gentler, more responsive side of men’s sexuality than we typically talk about*\n\nThat's so sad, what are these couples doing if not this? You should love each other.",
            "title_similarity": "0.62792575",
            "sentiment_compound": 0.9274
        },
        {
            "id": "ha69wzj",
            "score": 1,
            "text": "What's the deal with all the \"u/deleted\" \"removed\" comments? What happened?",
            "title_similarity": "0.28144118",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6a7cg",
            "score": 1,
            "text": "A better question is “why did we think it didn’t matter”?",
            "title_similarity": "0.49801707",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ha6ahc5",
            "score": 1,
            "text": "My SO and I make it a point to comment on each other whenever we like what we see. It’s nice to get a “Damn, you’re looking fine!” every now and then.",
            "title_similarity": "0.3829502",
            "sentiment_compound": 0.68
        },
        {
            "id": "ha6arrd",
            "score": 1,
            "text": "Omh who would of thought men were more visual then women!",
            "title_similarity": "0.6873095",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6azdw",
            "score": 1,
            "text": "Man no just want snu snu. Man want be held. Man want reminder he wanted too.",
            "title_similarity": "0.715312",
            "sentiment_compound": -0.2076
        },
        {
            "id": "ha6b08j",
            "score": 2,
            "text": "It depends on the person.",
            "title_similarity": "0.27085808",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6c6c8",
            "score": 1,
            "text": "Why would anyone think otherwise?!??",
            "title_similarity": "0.3506096",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6cvly",
            "score": 2,
            "text": "Yeah. This makes a lot of sense. Personally, I haven’t felt sexually desired by anyone in about 10 years and can report that I have absolutely zero confidence. In fact, it’s pretty much the opposite. I am 100% confident that people don’t like me.",
            "title_similarity": "0.3790045",
            "sentiment_compound": 0.9411
        },
        {
            "id": "ha6cxwi",
            "score": 2,
            "text": "Aka men have feelings too",
            "title_similarity": "0.60771394",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6d9oz",
            "score": 2,
            "text": "I could have told you that. I always thought it was weird how some men have sex with prostitutes. I couldn't imagine being interested in sleeping with a woman who didn't want to sleep with me. What a turn off.",
            "title_similarity": "0.62062514",
            "sentiment_compound": -0.4905
        },
        {
            "id": "ha6dlem",
            "score": 2,
            "text": "Study suggests that cheese tastes good",
            "title_similarity": "0.41965356",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ha6emjv",
            "score": 2,
            "text": "I'm small but fit.\n\nIf you see me with clothes you'd think about Steve Rogers before the serum, once you start seeing my legs, arms, etc. you realize I'm not thin, but I have 10% body fat with a base of years doing all kind of sports.\n\n20 years ago (yeah!) I was playing with some friends and a girl (which afterwards became kind of a thing for 2 years) complimented my arms. I receive so few compliments that I still remember it.\n\nSo, yeah... men need love, and we're idiots so you really need to spell it out for us.",
            "title_similarity": "0.42118326",
            "sentiment_compound": 0.9834
        },
        {
            "id": "ha6eu13",
            "score": 2,
            "text": "Breaking: Men have feelings! \n\nOur showers- so does this mean you’re going to stop crying in here now, or?..",
            "title_similarity": "0.52381957",
            "sentiment_compound": -0.68
        },
        {
            "id": "ha6ewft",
            "score": 2,
            "text": "Opposite is true in my relationship. I dont really care for being sexually desired, but I also dont care if people desire me in general. While my wife needs sex constantly for validation that she is still sexy.",
            "title_similarity": "0.67175007",
            "sentiment_compound": 0.738
        },
        {
            "id": "ha6ey3y",
            "score": 3,
            "text": "Not a surprise at all.  \n\n\nI am in a 'relationship' with a woman who is battling a grab bag of emotional and mental health issues that has gotten nearly debilitating for her AFTER we had 3 kids.  I have spent a lot of time analyzing how her issues effect me, and why they effect me in those ways.  I came to the conclusion that men need the physical attention (including being sexually desired) more and women need the romantic thoughtful attention more.",
            "title_similarity": "0.5709747",
            "sentiment_compound": 0.6232
        },
        {
            "id": "ha6eypd",
            "score": 3,
            "text": "Omg, yes!   Men have to initiate all the time, and it’s necessary to get some reciprocal feelings, otherwise it seems unwanted.",
            "title_similarity": "0.6807368",
            "sentiment_compound": 0.2714
        },
        {
            "id": "ha6f0bl",
            "score": 2,
            "text": "Bigger paychecks make you more attractive to women.",
            "title_similarity": "0.5889329",
            "sentiment_compound": 0.4927
        },
        {
            "id": "ha6f4wt",
            "score": 2,
            "text": "half the population already knew this :p",
            "title_similarity": "0.23756671",
            "sentiment_compound": 0.3071
        },
        {
            "id": "ha6f7cw",
            "score": 3,
            "text": "This study makes it seem like men are barely above rutting beasts. \n\nSlow evolution.",
            "title_similarity": "0.54805064",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha6fie7",
            "score": 2,
            "text": "I am a man.   I only learned about Reddit because of the Dead Bedrooms community.   I can vouch for this study.",
            "title_similarity": "0.3787795",
            "sentiment_compound": -0.6486
        },
        {
            "id": "ha6fkco",
            "score": 1,
            "text": "What idiot ever thought this wasn't a thing anyway? Every human being appreciates a little boost to their ego . Men are not machines !",
            "title_similarity": "0.61416036",
            "sentiment_compound": 0.4017
        },
        {
            "id": "ha6fyhp",
            "score": 2,
            "text": "This finding makes me so happy! I tell my boyfriend how handsome he is at least 3 times every time we hangout so I’m glad to know it’s important to him. I love science!",
            "title_similarity": "0.41711655",
            "sentiment_compound": 0.9572
        },
        {
            "id": "ha6g56p",
            "score": 3,
            "text": "I would sometimes catch myself/be caught unintentionally staring at my now ex boyfriend. He seemed to hate it. He’d get defensive and ask “what?!” My response was always something along the lines of “I like looking at you!” Or “you’re just too good looking to not look at.” He’d roll his eyes and tell me to stop.",
            "title_similarity": "0.61336565",
            "sentiment_compound": -0.2462
        },
        {
            "id": "ha6g7cf",
            "score": 2,
            "text": "Wait, who thought that wasn't the case?",
            "title_similarity": "0.32307345",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6gnjx",
            "score": 2,
            "text": "Who's we?  I think most men in a relationship are already aware of this.",
            "title_similarity": "0.571089",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6gpah",
            "score": 2,
            "text": "We?\n\nI think most men already knew this.",
            "title_similarity": "0.38806832",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6hm1b",
            "score": 2,
            "text": "I love this. I find it essential to make sure my bf knows how wanted he is and how amazing and attractive he is as well. It’s just good to show appreciation. Imitation is good too IMO.  I’m surprised but also not that it’s 95%",
            "title_similarity": "0.63759935",
            "sentiment_compound": 0.9127
        },
        {
            "id": "ha6hnwm",
            "score": 2,
            "text": "I've always been apathetic to uncomfortable to compliments about my looks. Wife included. Could be because I've gotten it my whole life but I never got positive reinforcement out of any of it. Maybe if it stopped I'd miss it. But eh.",
            "title_similarity": "0.41625077",
            "sentiment_compound": -0.7956
        },
        {
            "id": "ha6hrhr",
            "score": 2,
            "text": "It is amazing that needed to be proven. This was probably always true, just never talked about.",
            "title_similarity": "0.36476326",
            "sentiment_compound": 0.765
        },
        {
            "id": "ha6i6ub",
            "score": 2,
            "text": "I’m really shook and disheartened that this comes as a “revelation”. Every one should have know this already.",
            "title_similarity": "0.38908225",
            "sentiment_compound": -0.6318
        },
        {
            "id": "ha6idr4",
            "score": 2,
            "text": "Did you really need to make a study about it…no one ever wanted you babe?",
            "title_similarity": "0.40937594",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6ioaf",
            "score": 5,
            "text": "So many women out here, especially after being married for a while and having kids, just completely stop caring for their husband sexually and it makes me so sad to see. Sex is (usually)an important part of relationships. If you started a relationship having consistent sexual encounters and flirting, it reasons that you would want it to continue throughout the marriage!",
            "title_similarity": "0.5505105",
            "sentiment_compound": -0.1022
        },
        {
            "id": "ha6isf5",
            "score": 2,
            "text": "My wife married me so I assume she digs me",
            "title_similarity": "0.3399793",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6j2mk",
            "score": 2,
            "text": "My comment will be buried at the very bottom but... I have always said that the reason men watch pornography is because the women are lusting after him. (Even if its just acting)  The man is wanted.  Seeing someone else get what you want has a element of fascination... which is part of the reason pornography is so appealing to many.\n\nI feel it has a lot to do with the \"being wanted\".",
            "title_similarity": "0.72480106",
            "sentiment_compound": 0.6956
        },
        {
            "id": "ha6j9ra",
            "score": 4,
            "text": "Oh what a suprise almost like guys actually have feelings",
            "title_similarity": "0.6431489",
            "sentiment_compound": 0.2975
        },
        {
            "id": "ha6joor",
            "score": 2,
            "text": "Won’t let me save it so I guess I’ll comment",
            "title_similarity": "0.3503006",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ha6jva7",
            "score": 2,
            "text": "I just had a conversation with my wife about this last week... Boiled down to \"it's not about the presence or lack of sex, it's about feeling like I'm wanted/desired\"",
            "title_similarity": "0.3395508",
            "sentiment_compound": 0.1779
        },
        {
            "id": "ha6ke9v",
            "score": 2,
            "text": "Is this not incredibly obvious?",
            "title_similarity": "0.27828673",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6kgrb",
            "score": 4,
            "text": "Woah men also have feelings? How bizarre!",
            "title_similarity": "0.6526567",
            "sentiment_compound": -0.3802
        },
        {
            "id": "ha6kjog",
            "score": 2,
            "text": "Compliments really do go a long way for us",
            "title_similarity": "0.44484058",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ha6kleo",
            "score": 2,
            "text": "Gah. Sorry to be blue but I'm pretty sure sex workers and have known this \"clever trick to make men go wild\" since year -1billion.",
            "title_similarity": "0.5741586",
            "sentiment_compound": 0.9109
        },
        {
            "id": "ha6km6d",
            "score": 2,
            "text": "Thank you for sharing! I am going to work on expressing this for my husband!",
            "title_similarity": "0.47802722",
            "sentiment_compound": 0.7081
        },
        {
            "id": "ha6kvqj",
            "score": 2,
            "text": "Huh? Who’s this “we” that thought it wasn’t?",
            "title_similarity": "0.30813166",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6l4ep",
            "score": 2,
            "text": "There needed to be a study to confirm this? What’s their next study going to reveal? “ not being eaten alive by a bear is more important for campers then we think”?",
            "title_similarity": "0.5272211",
            "sentiment_compound": -0.1608
        },
        {
            "id": "ha6lz7m",
            "score": 2,
            "text": "Did we not already think it was important?",
            "title_similarity": "0.47426802",
            "sentiment_compound": 0.2023
        },
        {
            "id": "ha6mjcb",
            "score": 6,
            "text": "It had never occurred to me that men *wouldn’t* need to feel desired in the first place..\n\nI assumed that men want to feel desired just the same as their partner.",
            "title_similarity": "0.64284176",
            "sentiment_compound": 0.5423
        },
        {
            "id": "ha6n25e",
            "score": 4,
            "text": "Feeling sexually desired is good for ones mental health and self esteem. Is this a surprise to anyone?",
            "title_similarity": "0.73883736",
            "sentiment_compound": 0.765
        },
        {
            "id": "ha6oi0g",
            "score": 5,
            "text": "A huge part of the appeal of porn for men is seeing a woman who is really into her partner. A lot of the popular kinks and things guys are into as well are things that communicate \"I desire you\" to the man. I'm sure this is the case for women as well, but I feel women often have to deal a lot more with unwanted attention/desire, while men have to deal with not getting much attention/desire at all.",
            "title_similarity": "0.74688447",
            "sentiment_compound": 0.524
        },
        {
            "id": "ha6p222",
            "score": 2,
            "text": "\"In a qualitative study of 30 heterosexual men (age 30-65), researchers explored various factors that may be related to men’s experiences of sexual desire in longer-term relationships (Murray, Milhausen, Graham & Kuzynski, 2016). Over the course of in-depth interviews, researchers asked men about what factors increased and decreased their level of sexual interest. The authors noted that the desire to feel desired was one of three themes that men described as being most integral to their sexual experiences. The men in Murray et al.’s (2016) study said that while they felt there was a social belief that women want to feel desired while men “do the wanting,” they believed that feeling desired was a universal need for both men and women. \n\nSpecifically, men indicated that receiving compliments about their appearance, their awareness of their female partner’s equal interest in a sexual encounter, and their female partner initiating sexual activities were the biggest facilitators of their own sexual desire (Murray et al., 2016). Despite the importance that men in this study put on  \nfeeling desired, the authors stated that men acknowledged feeling desired was a rare occurrence, and something they felt their female partner was not aware was important to them.\"  \n\n\nI've tried explaining this to my wife so many times.  It's mind boggling to me.  I want to feel attractive and wanted to. It makes me feel so good.",
            "title_similarity": "0.7061087",
            "sentiment_compound": 0.9854
        },
        {
            "id": "ha6p86f",
            "score": 1,
            "text": "Guess what? We already know",
            "title_similarity": "0.109119415",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6pgqh",
            "score": 1,
            "text": "I thought we already knew why people cheat.",
            "title_similarity": "0.40376973",
            "sentiment_compound": -0.4588
        },
        {
            "id": "ha6pu6s",
            "score": 1,
            "text": "it seems sad that we had to wait until 2021 for this study to be done when it has been so obvious for a century or so by just taking to men.",
            "title_similarity": "0.51704496",
            "sentiment_compound": -0.4767
        },
        {
            "id": "ha6qstp",
            "score": 1,
            "text": "Im amazed this required a study to be known. I don’t know a single man who doesn’t feel that way.",
            "title_similarity": "0.4650115",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ha6qvdc",
            "score": 1,
            "text": "It's hilarious how inhuman men are considered.",
            "title_similarity": "0.50361395",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ha6qvhx",
            "score": 1,
            "text": "Ok what is a cis gendered woman?  Damn this is confusing.",
            "title_similarity": "0.23008096",
            "sentiment_compound": -0.34
        },
        {
            "id": "ha6rjt6",
            "score": 1,
            "text": "gotta say, ladies who want it and are more public are hotter af that want men badly",
            "title_similarity": "0.7431519",
            "sentiment_compound": -0.3612
        },
        {
            "id": "ha6s8km",
            "score": 1,
            "text": "Absolutely love it when a study \"suggests\" something you could confirm by just asking any person on the interest group ...\n\nAlso yeah I know that this is not how scientific research works",
            "title_similarity": "0.49157387",
            "sentiment_compound": 0.8655
        },
        {
            "id": "ha6sb34",
            "score": 2,
            "text": "How is this not common knowledge? Human is human, we all require the same basic care and have the same basic needs.",
            "title_similarity": "0.33733392",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ha6shaa",
            "score": 1,
            "text": "I love how much conversation this is getting.\n\nThe number of people surprised by this - that men are human - makes me feel like we are making progress as a culture.\n\nAlso, if any other researcher displayed the level of casual stereotyping towards literally any other group they would probably be losing grants. Not disparaging- I'm a fan - just pointing out the very black-and-white evidence that lack of understanding and damaging assumptions are universal and not limited to any one group. Just look at the \"we\" in the headline. Who's \"we?\"",
            "title_similarity": "0.68814105",
            "sentiment_compound": 0.8955
        },
        {
            "id": "ha6spq6",
            "score": 3,
            "text": "Study suggests the obvious, turns out men are not robots and actually have feelings just like everyone else. Idiotic study.",
            "title_similarity": "0.5892925",
            "sentiment_compound": -0.2732
        },
        {
            "id": "ha6sybz",
            "score": 4,
            "text": "Study finds men have feelings. Amazing",
            "title_similarity": "0.68012595",
            "sentiment_compound": 0.5859
        },
        {
            "id": "ha6thvr",
            "score": 2,
            "text": "This title should read;\nMen value consent to no ones surprise",
            "title_similarity": "0.5429907",
            "sentiment_compound": 0.0736
        },
        {
            "id": "ha6tqsu",
            "score": 2,
            "text": "Are there people who think it isn't important for a partner to find you sexually desirable??",
            "title_similarity": "0.7458981",
            "sentiment_compound": 0.2658
        },
        {
            "id": "ha6u5wq",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.09361865"
        },
        {
            "id": "ha6uijl",
            "score": 4,
            "text": "Study finds that men are not a monolithic mass of rapey ogre beasts.",
            "title_similarity": "0.5126842",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6upd5",
            "score": 1,
            "text": "More important than who thinks?",
            "title_similarity": "0.4900153",
            "sentiment_compound": 0.2716
        },
        {
            "id": "ha6w7sg",
            "score": 2,
            "text": "I would send my wife this study… but I have sent her a lot of stuff like this.  Every time I do it, I feel like she has even less respect for me… and I honestly don’t know how to address it.  I have pretty much just relinquished my behavior around her to be as cold to her as she is to me… just hoping that maybe seeing things from my side can give her a little insight.  Doesn’t seem like a very good strategy to me either… but I don’t know what else to do at this point other than leave.",
            "title_similarity": "0.48362797",
            "sentiment_compound": 0.9841
        },
        {
            "id": "ha6wcp6",
            "score": 1,
            "text": "I wish my partner accepted my compliments. Honestly, he's the most beautiful man I've ever laid eyes on, but struggles greatly with self-esteem issues, especially since he is reaching his mid 30's. He hides his insecurities well though - most men do. \n\nAlways remember to bring your man up, express your love and adoration for him, make him feel special, make him feel sexy.\n\nWe expect all this as women but forget about our men. 💔",
            "title_similarity": "0.7019365",
            "sentiment_compound": 0.9758
        },
        {
            "id": "ha6wxmh",
            "score": 1,
            "text": ">more important for man than we think\n\nThan who thinks? The people who wrote the article? Stop projecting your own nonsense onto others. Thank you. I know the most people aren't the greatest thinkers in the world, but it doesn't take a rocket scientist to realize that the vast majority of people want to be sexually desired by others. Do the authors of this article think men are some alien species or something?",
            "title_similarity": "0.69488686",
            "sentiment_compound": 0.3188
        },
        {
            "id": "ha6x8e2",
            "score": 2,
            "text": "Of course us men want to feel loved and be romanced. There’s nothing I want more at times than to have the person I love tell me I’m looking hot today or grab me and pull me in for a kiss for no apparent reason.",
            "title_similarity": "0.7217406",
            "sentiment_compound": 0.9182
        },
        {
            "id": "ha6xlye",
            "score": 1,
            "text": "To quote Megan the Stallion.  \"If it aint slappin, it didn't happen.\"",
            "title_similarity": "0.30940413",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha6yfha",
            "score": 1,
            "text": "I'm not surprised. I'm 61. My wife and I have been married for 31 years. She stopped sex 24 years ago. My general interest in the household has waned. And I have had sex with men and am turning into a sissy to some degree.",
            "title_similarity": "0.4023426",
            "sentiment_compound": 0.1114
        },
        {
            "id": "ha6ygqe",
            "score": 1,
            "text": "Kinda obvious. Praise our intelligence and how much our minds have evolved past other species all you’d like. Fact is we are still animals, and animals have an inherent biological need to reproduce. Overriding this trait is no easy feet, and shouldn’t be looked over just because we wear clothes and use forks.",
            "title_similarity": "0.51825",
            "sentiment_compound": 0.7591
        },
        {
            "id": "ha6yje9",
            "score": 1,
            "text": "Feeling sexually desired by one's partner is important to men.\n\nThe floor here is made out of floor",
            "title_similarity": "0.8523445",
            "sentiment_compound": 0.5267
        },
        {
            "id": "ha70g7e",
            "score": 1,
            "text": "Men are socially conditioned to not be in touch with their emotions.  This is just a side effect of years and years of sucking it up buttercup.",
            "title_similarity": "0.5946121",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha70oa6",
            "score": 1,
            "text": "Haven't read the study, but I have anecdotal evidence that my wife having no sexual desire for me did nearly cost me my life.",
            "title_similarity": "0.4179741",
            "sentiment_compound": -0.6895
        },
        {
            "id": "ha70qaw",
            "score": 2,
            "text": "It’s almost like men are people?!?!",
            "title_similarity": "0.6325102",
            "sentiment_compound": 0.4855
        },
        {
            "id": "ha72aqj",
            "score": 1,
            "text": "I once got a note from a a bank teller saying, \"Not to be creepy or anything but you have the biggest smile.\" Still riding that high.",
            "title_similarity": "0.35797256",
            "sentiment_compound": 0.5023
        },
        {
            "id": "ha72hql",
            "score": 1,
            "text": "Of course it is you mad bastard. Most men care about what their partners think of them.",
            "title_similarity": "0.66385233",
            "sentiment_compound": -0.4976
        },
        {
            "id": "ha749u9",
            "score": 1,
            "text": "Seems obvious but some interesting points…",
            "title_similarity": "0.3931074",
            "sentiment_compound": 0.5499
        },
        {
            "id": "ha74ua2",
            "score": 1,
            "text": "I've let my wife know this.  Her response is that she doesn't want it going to my head, doesn't want me getting arrogant.\n\nI guess she'd rather me feel ugly and undesirable, because that's the alternative.",
            "title_similarity": "0.46258524",
            "sentiment_compound": -0.8703
        },
        {
            "id": "ha76rub",
            "score": 1,
            "text": "A woman once told me I had nice teeth. I still remember it.",
            "title_similarity": "0.16192687",
            "sentiment_compound": 0.4215
        },
        {
            "id": "ha76w6h",
            "score": 1,
            "text": "Didn't Cheap Trick say as much way back in 1977?",
            "title_similarity": "0.21011482",
            "sentiment_compound": 0.0382
        },
        {
            "id": "ha77rc8",
            "score": 2,
            "text": "Sending this to my wife because science",
            "title_similarity": "0.28643572",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha77y8d",
            "score": 1,
            "text": "Seems to track with my personal life; I just want my SO to talk to me more.   \n\n\nThank you to the authors and some of the comments here. I already understand myself a bit better. I want to use this info with my SO.",
            "title_similarity": "0.48109674",
            "sentiment_compound": 0.7425
        },
        {
            "id": "ha793nc",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.09361863"
        },
        {
            "id": "ha79rw6",
            "score": 1,
            "text": "It’s amazing that there needed to be a study for this in the first place. Why wouldn’t men want those things too?",
            "title_similarity": "0.66962636",
            "sentiment_compound": 0.6249
        },
        {
            "id": "ha7a346",
            "score": 17,
            "text": "My wife and I celebrated our 27th this past June.  We recently reignited our passion and healed a decade-long dead bedroom (you can check my post history if interested).\n\nThis article is hitting me in the feels right now.  Like I'm kinda fighting back tears.  \n\nIt's resonating with me because this time last year, my wife and I weren't having sex and the memory of my emotional attachment (or lack thereof) to my wife is still fresh enough to put a pit in my stomach.  Sure, we loved each other, but we weren't 'in love', per se.  Awesome partners and truly the best of friends, but there was zero passion.  Now, we're having sex multiple times a week and have literally been falling deeper and deeper in love for the past 8 months straight.  The pull she has over me is almost physical. All the things the men say they want from their partners?  Yeah, my wife does those.  Romance, initiating, non-sexual touch, tons of flirting.  Check check check check.  And I give it all right back.  We can't keep our hands off each other.  Every single aspect of our lives is better.  All of it.\n\nMy wife and I wanted to heal our bedroom.  We ended up healing our lives.",
            "title_similarity": "0.34926134",
            "sentiment_compound": 0.9937
        },
        {
            "id": "ha7au6s",
            "score": 1,
            "text": "I am very thankful for this article and research. It very much describes my experience.",
            "title_similarity": "0.3514645",
            "sentiment_compound": 0.6115
        },
        {
            "id": "ha7bo0u",
            "score": 4,
            "text": "I’m currently in a relationship where my girlfriend is not afraid to compliment me and does it multiple times daily on average if I had to guess. Although She’s a bit more shy when it comes to initiating sexy time, I don’t think I’ve ever had someone make me feel as sexy as she does. Good lord I hope it doesn’t change.",
            "title_similarity": "0.49150506",
            "sentiment_compound": 0.8295
        },
        {
            "id": "ha7c3ba",
            "score": 1,
            "text": "I feel desirable, rarely desired",
            "title_similarity": "0.43734848",
            "sentiment_compound": 0.1245
        },
        {
            "id": "ha7estc",
            "score": 1,
            "text": "Really just by anyone.",
            "title_similarity": "0.119406864",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7fmgj",
            "score": 1,
            "text": "I have never seen a more moderated comment section",
            "title_similarity": "0.27129233",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7gl1r",
            "score": 1,
            "text": "Who in the world would fund a \"study\" where researchers sample from cherry-picked subreddits. Science outta be doing better than this.",
            "title_similarity": "0.51728064",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ha7ii8c",
            "score": 1,
            "text": "I've never got lucky on a night out, most relationships have lost all attraction to me within a few month (and sometimes go on for a year or two like that before being cheated on)\n\nIdk what to do, I follow people's advice on dressing and grooming, nothing ever changes...",
            "title_similarity": "0.2575509",
            "sentiment_compound": -0.4759
        },
        {
            "id": "ha7ldyx",
            "score": 1,
            "text": "this required a study?",
            "title_similarity": "0.3165161",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7lpr1",
            "score": 1,
            "text": "A few months ago I broke up with a girl I had been with for over a year because of feelings of not being desired. No matter how many times I explained to her that it was important for me to feel loved and desired, just as much as I made her feel, nothing really changed. Over time it made me so sad that being in the relationship made me miserable. Eventually, I decided that I had had enough and I ended our relationship. One of the best decisions of my life!\n\nI won't be getting myself into any relationship anytime soon because I am convinced that it is more likely than not that the next woman will be just like my ex. This is because it isn't the first time that I am seeing something like this. In fact, a lot of my male friends have either gone through or are going through the seem thing. Even worse, a female friend of mine has confided in me that her boyfriend feels the same way about her and it's making him miserable.\n\nCrazy.",
            "title_similarity": "0.41951945",
            "sentiment_compound": 0.692
        },
        {
            "id": "ha7m3e5",
            "score": 1,
            "text": "In my casual sex days, I had a pretty open door policy for aggressive women. Making it pretty clear you’d like to bang me would go a long way to overlook other, cosmetic or personal issues. Can’t say it was good policy just how things played out.",
            "title_similarity": "0.5466972",
            "sentiment_compound": 0.9432
        },
        {
            "id": "ha7p1gl",
            "score": 1,
            "text": "Yeah it's almost like men are capable of having feelings and aren't just sex crazed maniacs.",
            "title_similarity": "0.76000816",
            "sentiment_compound": 0.6342
        },
        {
            "id": "ha7swnp",
            "score": 1,
            "text": "Strong men also cry. Strong men also cry…",
            "title_similarity": "0.4926139",
            "sentiment_compound": 0.5423
        },
        {
            "id": "ha7v4rb",
            "score": 2,
            "text": "How do I get my wife to read this without telling my wife to read this?",
            "title_similarity": "0.35938388",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7wt37",
            "score": 2,
            "text": "Used to love it when I would wake up in the morning and the wife would be cupping my junk, not really trying to get anything started just holding me.",
            "title_similarity": "0.38598993",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ha7xssy",
            "score": 1,
            "text": "You're telling me men want mutuality in a relationship too? Wow! Who could have ever guessed?\n\nExcept EVERYBODY!",
            "title_similarity": "0.72864586",
            "sentiment_compound": 0.7222
        },
        {
            "id": "ha82a56",
            "score": 2,
            "text": "Wow my sadness could of told you that a long time ago.",
            "title_similarity": "0.2813118",
            "sentiment_compound": 0.2263
        },
        {
            "id": "ha83v4m",
            "score": 1,
            "text": "I am ashamed of the fact that it takes a reasarch to find out that men wants to feel desireable. Where the hell is society going?\n\nIn the next study: How important it is for man to have love in a relationship\n\nJust to clarify, I am not against that reasarch, I am just don't understand how this is not a basic thing.",
            "title_similarity": "0.8163036",
            "sentiment_compound": -0.4019
        },
        {
            "id": "ha87pah",
            "score": 1,
            "text": "How do I get my wife to see this without just showing her?",
            "title_similarity": "0.32984757",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8cslv",
            "score": 3,
            "text": "Man this whole sub is just \"removed\".\nIs it really so hard to believe that men are just as human as women?",
            "title_similarity": "0.6888987",
            "sentiment_compound": -0.2991
        },
        {
            "id": "ha8g3g8",
            "score": 1,
            "text": "Am I the only one that didn’t need any study to know this? This should be r/nofuckingshit",
            "title_similarity": "0.31147957",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8jusg",
            "score": 1,
            "text": "i just want someone to hold me",
            "title_similarity": "0.2578416",
            "sentiment_compound": 0.0772
        },
        {
            "id": "ha8rhol",
            "score": 1,
            "text": "But I already think it's important",
            "title_similarity": "0.32479107",
            "sentiment_compound": 0.296
        },
        {
            "id": "ha94nzr",
            "score": 1,
            "text": "Basically 5% of men are okay with having sex knowing their partner is nor actually interested.. jup that explains the rape numbers. Glad it is not more tho. 5%are bad apples i can live with that.",
            "title_similarity": "0.5151847",
            "sentiment_compound": -0.7796
        },
        {
            "id": "ha9s88x",
            "score": 1,
            "text": "Why such obvious things require scientific researches? Are people really that dumb?",
            "title_similarity": "0.5453497",
            "sentiment_compound": -0.6044
        },
        {
            "id": "haafw6k",
            "score": 1,
            "text": "Ah, men. We really are just like people sometimes!",
            "title_similarity": "0.57013667",
            "sentiment_compound": 0.4688
        },
        {
            "id": "haav0xk",
            "score": 1,
            "text": "What a shock! I can't believe it...",
            "title_similarity": "0.22766164",
            "sentiment_compound": -0.4389
        },
        {
            "id": "haawo30",
            "score": 1,
            "text": "Reminds me of Cheap Tricks song",
            "title_similarity": "0.32079095",
            "sentiment_compound": -0.128
        },
        {
            "id": "habiygo",
            "score": 1,
            "text": "I didn't even realize it was a commonly held belief that men found being sexually desired to be unimportant, and makes me wonder how many more misconceptions people hold about men that I'm not even aware of.",
            "title_similarity": "0.6982117",
            "sentiment_compound": -0.0516
        },
        {
            "id": "habskgf",
            "score": 1,
            "text": "Oh boy oh boy, a study that says men can and want to feel?\n\nReady your popcorn, fellas. The misandrists are gonna raid this one hard.",
            "title_similarity": "0.47759816",
            "sentiment_compound": 0.34
        },
        {
            "id": "hacj63h",
            "score": 1,
            "text": "You don't say? Why would it not matter, are we not human?",
            "title_similarity": "0.3014087",
            "sentiment_compound": -0.1114
        },
        {
            "id": "hacqlpc",
            "score": 1,
            "text": "Surprise, surprise we have emotional needs.",
            "title_similarity": "0.39143932",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hacs9qo",
            "score": 1,
            "text": "Study, shows men are human",
            "title_similarity": "0.46303916",
            "sentiment_compound": 0.0
        },
        {
            "id": "haecdgc",
            "score": 2,
            "text": "I’m sorry but this feels so meta. A study finding posted on Reddit where the sample for the study was obtained from subreddits. Wowowow.\n\n“The sample for this study was recruited from the on-line website Reddit, an American social news aggregation, web content rating, and discussion website from January through March of 2018. In an attempt to capture a diverse group of men, various Subreddit groups (forums within Reddit dedicated to a specific topic) were targeted. Specifically we targeted Subreddit groups that were dedicated to discussing topics related to men’s issues, sex, and romantic relationships. Based on this criteria, r/men, r/marriage, r/askmenover30, r/sexover30, r/MensLib were used as recruit- ment bases for this study.”",
            "title_similarity": "0.49053752",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hah5xgq",
            "score": 1,
            "text": "How did this study get published in this day and age? Isn't the whole anti-cis-het mob against this sort of thing?",
            "title_similarity": "0.40850765",
            "sentiment_compound": 0.0
        },
        {
            "id": "hdhwx82",
            "score": 1,
            "text": "Zero fucks given by my gf",
            "title_similarity": "0.20977814",
            "sentiment_compound": -0.4767
        }
    ]
}