{
    "An engineered \"glue\" inspired by barnacle cement can seal bleeding organs in 10-15 seconds. It was tested on pigs and worked faster than available surgical products, even when the pigs were on blood thinners.\n": [
        {
            "id": "ha6ksum",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.4797287",
            "sentiment_compound": 0.7088
        },
        {
            "id": "ha711kx",
            "score": -7,
            "text": "Wow if you can make a Pig stop bleeding could it also make Trump stop talking?",
            "title_similarity": "0.5541054",
            "sentiment_compound": 0.1027
        },
        {
            "id": "ha7oae4",
            "score": 0,
            "text": "Poor pigs. Test on murderers instead",
            "title_similarity": "0.45906174",
            "sentiment_compound": -0.8126
        },
        {
            "id": "ha7jqol",
            "score": 4,
            "text": "Alright pig, I'm going to cut you again for another test. I know you can't understand me, but just know, you'd be bacon if we weren't doing this.",
            "title_similarity": "0.60228264",
            "sentiment_compound": -0.0129
        },
        {
            "id": "ha7vf4t",
            "score": -4,
            "text": "This sounds like an f'd up experiment. Free all the lab pigs",
            "title_similarity": "0.5401388",
            "sentiment_compound": 0.7003
        },
        {
            "id": "ha7cptu",
            "score": 13,
            "text": "That sounds like a very cruel experiment...",
            "title_similarity": "0.18354419",
            "sentiment_compound": -0.3804
        },
        {
            "id": "ha6qzi2",
            "score": -10,
            "text": "Make you squeal like a pig has a new meaning",
            "title_similarity": "0.4730812",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha7yrsn",
            "score": 5,
            "text": "That’s a fucked up experiment, what the hell",
            "title_similarity": "0.10399931",
            "sentiment_compound": -0.875
        },
        {
            "id": "ha7ftgv",
            "score": -2,
            "text": "My only question is why a pig would need to be on blood thinners?",
            "title_similarity": "0.48986578",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha85d32",
            "score": 0,
            "text": "It's pretty disgusting to cut open an animal, hurt it and then see if you can fix it.",
            "title_similarity": "0.40292785",
            "sentiment_compound": -0.6908
        },
        {
            "id": "ha7fq5x",
            "score": 9,
            "text": "Oof at giving pigs blood thinners then cutting them, surgically or not.",
            "title_similarity": "0.5979724",
            "sentiment_compound": 0.2263
        },
        {
            "id": "ha6wynb",
            "score": -6,
            "text": "Cool, send this to the dentists in the back. \n\nNever seen so many “doctors” using archaic technologies. \n“It’s cheaper!” Then why the hell does seeing a dentist cost so much? I should be paying $5 for a filling/root canal at this point.\n\nThe sooner they stop using “stitches” the faster people will be less nervous of seeing dentists.",
            "title_similarity": "0.6336902",
            "sentiment_compound": -0.7649
        },
        {
            "id": "ha6quv2",
            "score": 7,
            "text": "Damn, that’s really cool, how many $100 000 per dose?",
            "title_similarity": "0.43526453",
            "sentiment_compound": -0.0276
        },
        {
            "id": "ha877e4",
            "score": -1,
            "text": "I want to know who is the SOB that's shiving Miss Piggy. They'll need barnacle band aids",
            "title_similarity": "0.49925414",
            "sentiment_compound": -0.4648
        },
        {
            "id": "ha87dzj",
            "score": -1,
            "text": "I bet those pigs were so thankful.",
            "title_similarity": "0.42469475",
            "sentiment_compound": 0.6948
        },
        {
            "id": "ha7om9y",
            "score": 3,
            "text": "“Ask the experimenters why they experiment on animals, and the answer is, ‘Because the animals are like us.’ Ask the experimenters why it is morally okay to experiment on animals, and the answer is, ‘Because the animals are not like us.'”\n\n– Charles Magel",
            "title_similarity": "0.4306",
            "sentiment_compound": 0.316
        },
        {
            "id": "ha7p4az",
            "score": 7,
            "text": "Why are people against experimenting on animals and if they are, who do they want us experimenting on, other humans?",
            "title_similarity": "0.26529473",
            "sentiment_compound": 0.0772
        },
        {
            "id": "ha74p2r",
            "score": 3,
            "text": "Brace for r/trypophobia.",
            "title_similarity": "0.28032738",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7n9e6",
            "score": 0,
            "text": "Did you know pigs are 80% blood.",
            "title_similarity": "0.5409189",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7q945",
            "score": 0,
            "text": "But we won't see it used on humans for some silly length of time. To make sure it's super safe and works, right? Nope.\n\nIt's got less to do with safety or efficacy (as if waiting for a 99% efficacy and safety rating makes any sense for things that are amazing; like oh that drug will only help 80% of people, it's not ready) it comes down to companies that have an interest for something like this to fail. \n\nAnd you don't even need to do any research or be a conspiracy theorist to know pharmaceutical companies have a nefarious hand in the advancement of medicine. If a new drug comes out that is going to tank 9 of their current drugs, they don't want it coming out, I imagine. They will spend millions to prove that drug is dangerous.\n\nSo everytime I see stuff like this, I'm like meh, maybe.",
            "title_similarity": "0.51514596",
            "sentiment_compound": 0.987
        },
        {
            "id": "ha7u8ae",
            "score": 0,
            "text": "How long until we stick it in a gun and have to shoot our coffee mugs?",
            "title_similarity": "0.38506153",
            "sentiment_compound": -0.5859
        },
        {
            "id": "ha7wh6s",
            "score": 0,
            "text": "Is this not how cyanoacrylate was discovered in 1942?  I seem to recall hearing this in the 1980s.\n  \nTime to dive in and learn another thing today.",
            "title_similarity": "0.38288006",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8j8v5",
            "score": 6,
            "text": "Just thinking about how fucked up it is to intentionally cut pigs to test this",
            "title_similarity": "0.47720918",
            "sentiment_compound": -0.7579
        },
        {
            "id": "ha6rng7",
            "score": 59,
            "text": "[deleted]",
            "title_similarity": "-0.036914337"
        },
        {
            "id": "ha74pmh",
            "score": 68,
            "text": "Add this to the list of all those things that we will never see again. It's a long list. I'm sure this is yet another.",
            "title_similarity": "0.27118447",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha7db6d",
            "score": 1,
            "text": "Thank you for sharing this!",
            "title_similarity": "0.034452204",
            "sentiment_compound": 0.68
        },
        {
            "id": "ha7kcv7",
            "score": 1,
            "text": "And we will never see or hear about this again",
            "title_similarity": "-0.021364888",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7p3qh",
            "score": 1,
            "text": "At the risk of being a Blockbuster exec talking to a Netflix pitch, I don't think this is going to reach prime time. A few reasons:\n\n* Penetrating trauma is much rarer than blunt trauma and often much easier to manage. The biggest question is whether a patient exsanguinates before getting to an OR.\n\n* This seems to run into the same problems as other hemostatic agents: they obscure a surgical field, they are helpful for minor bleeding but not major repairs where the durability of the repair can't be contingent on a clot being disrupted or not, and pouring this into a bleeding vessel might have unintended side-effects\n\nI don't see any surgeons getting rid of their trusty suture any time soon to use this. I wonder if crow is on my menu.",
            "title_similarity": "0.5768012",
            "sentiment_compound": 0.6597
        },
        {
            "id": "ha7q9fw",
            "score": 1,
            "text": "AMA: I was the guy stabbing pigs' organs in this experiment",
            "title_similarity": "0.5149733",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7r5cf",
            "score": 1,
            "text": "So then, when can I stop using superglue?",
            "title_similarity": "0.21562216",
            "sentiment_compound": -0.296
        },
        {
            "id": "ha7tt29",
            "score": -1,
            "text": "Pig is like “I know you just injured me to fix me.  Asshole.”",
            "title_similarity": "0.51634294",
            "sentiment_compound": -0.0516
        },
        {
            "id": "ha7v3v8",
            "score": -1,
            "text": "How was your day at work honey? Well I gave a pig bottle of Aspirin than kicked him in the spleen repeatedly so we could test barnacle goo glue on his guts!",
            "title_similarity": "0.70233834",
            "sentiment_compound": 0.3382
        },
        {
            "id": "ha7wtwy",
            "score": -1,
            "text": "Welp, time to never hear about this ever again as doctor continue to use needle and thread like it’s 17 goddamn 54. \n\nDon’t even get me started on teeth…",
            "title_similarity": "0.35183322",
            "sentiment_compound": -0.1531
        },
        {
            "id": "ha85e3z",
            "score": -1,
            "text": "Imagine your job was stabbing pigs for a living to see what stops the bleeding.",
            "title_similarity": "0.600621",
            "sentiment_compound": -0.1531
        },
        {
            "id": "ha86nb6",
            "score": -1,
            "text": "Actually put this on my peen that's how I became asexual",
            "title_similarity": "0.2431508",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8aa74",
            "score": 1,
            "text": "I hope the pigs are okay",
            "title_similarity": "0.3925399",
            "sentiment_compound": 0.5859
        },
        {
            "id": "ha6tl8h",
            "score": 830,
            "text": "Uuh, 'scuze me. Haven't cyanoacrylate glues derived from barnacles been used in US Military combat first aid kids since vietnam? Keeping a tube of superglue in your first aid kit is also standard practice for backcountry campers and climbers.  I gather there's something innovative in this recently announced material; but calling it inspired by barnacle cement fails to acknowlege barncles also inspired substances that have been in use for the same purposes for over 50 years",
            "title_similarity": "0.58607763",
            "sentiment_compound": 0.7311
        },
        {
            "id": "ha7k2ib",
            "score": 16,
            "text": "Poor pigs!  Especially the ones n blood thinners!",
            "title_similarity": "0.48941058",
            "sentiment_compound": -0.5696
        },
        {
            "id": "ha6t7vr",
            "score": 9,
            "text": "Both disgusting and awesome :D",
            "title_similarity": "0.17358844",
            "sentiment_compound": 0.694
        },
        {
            "id": "ha796g1",
            "score": 2,
            "text": "This is basically biofoam-esque. Super cool!",
            "title_similarity": "0.31669664",
            "sentiment_compound": 0.7574
        },
        {
            "id": "ha7ffb1",
            "score": 2,
            "text": "This is incredibly great news for trauma medicine.",
            "title_similarity": "0.37033582",
            "sentiment_compound": 0.3804
        },
        {
            "id": "ha7ip6j",
            "score": 2,
            "text": "How is this better than the military Celox or QuikClot we got now? Would it cause chemical burns? Easily removed? How practical is it to produce and dispense it?",
            "title_similarity": "0.5743947",
            "sentiment_compound": 0.774
        },
        {
            "id": "ha7dtt9",
            "score": 4,
            "text": "[deleted]",
            "title_similarity": "-0.036914337"
        },
        {
            "id": "ha7ocrr",
            "score": 3,
            "text": "Must be a lovely life for those pigs....",
            "title_similarity": "0.3394132",
            "sentiment_compound": 0.5859
        },
        {
            "id": "ha7otb9",
            "score": 2,
            "text": ">Be a pig\n\n-\n>Scientists cram you full of blood thinners\n\n-\n>Stab you, put barnacle glue on you\n\n-\n>Refuses to elaborate\n\n-\n>Leaves",
            "title_similarity": "0.5512705",
            "sentiment_compound": -0.5859
        },
        {
            "id": "ha6z4zn",
            "score": 5,
            "text": "I thought this was superglue",
            "title_similarity": "0.19576405",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7fe0i",
            "score": 9,
            "text": "Finally! An actual good article on r/science",
            "title_similarity": "0.3305394",
            "sentiment_compound": 0.4926
        },
        {
            "id": "ha6sve6",
            "score": 347,
            "text": "Now I'm wondering which doctors are prescribing blood thinners to pigs?",
            "title_similarity": "0.5268302",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha79sx7",
            "score": 12,
            "text": "I wrote a paper a few years ago for school about this but I focused on mussel adhesive proteins. Maybe barnacle proteins work better.",
            "title_similarity": "0.47697452",
            "sentiment_compound": 0.8047
        },
        {
            "id": "ha7484r",
            "score": 51,
            "text": "> ***Abstract***\n>\n>Tissue adhesives do not normally perform well on tissues that are covered with blood or other bodily fluids. Here we report the design, adhesion mechanism and performance of a paste that haemostatically seals tissues in less than 15 s, independently of the blood-coagulation rate. With a design inspired by barnacle glue (which strongly adheres to wet and contaminated surfaces owing to adhesive proteins embedded in a lipid-rich matrix), the paste consists of a blood-repelling hydrophobic oil matrix containing embedded microparticles that covalently crosslink with tissue surfaces on the application of gentle pressure. It slowly resorbs over weeks, sustains large pressures (approximately 350 mm Hg of burst pressure in a sealed porcine aorta), makes tough (interfacial toughness of 150–300 J m−2) and strong (shear and tensile strengths of, respectively, 40–70 kPa and 30–50 kPa) interfaces with blood-covered tissues, and outperforms commercial haemostatic agents in the sealing of bleeding porcine aortas ex vivo and of bleeding heart and liver tissues in live rats and pigs. The paste may aid the treatment of severe bleeding, even in individuals with coagulopathies.\n\n\n[src](https://www.nature.com/articles/s41551-021-00769-y)",
            "title_similarity": "0.6913889",
            "sentiment_compound": 0.8746
        },
        {
            "id": "ha6vjq2",
            "score": 448,
            "text": "I used to do vascular surgery research in a pig model. While their anatomy is similar to humans, they seem to have better clotting mechanisms. This data is encouraging but obviously needs more research.",
            "title_similarity": "0.7227244",
            "sentiment_compound": 0.4854
        },
        {
            "id": "ha7avyj",
            "score": 607,
            "text": "Will shellfish allergies cause an allergic reaction with this glue?",
            "title_similarity": "0.44659424",
            "sentiment_compound": -0.296
        },
        {
            "id": "ha6r8gp",
            "score": 4971,
            "text": "This was the premise of an episode of *The Odd Couple* fifty years ago. Oscar’s dentist invents a fast-acting, super-strong dental glue based on barnacles. It works great until Oscar, talking about how great the glue works with potential investors, gets “dry mouth” from being nervous and his filling comes loose. It turns out the barnacle glue only works when wet!",
            "title_similarity": "0.6725534",
            "sentiment_compound": 0.5848
        },
        {
            "id": "ha7a82b",
            "score": 1,
            "text": "Big \"Fleidiae\" vibes off this one...",
            "title_similarity": "0.22624886",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7bqgp",
            "score": 1,
            "text": "How do people figure these things out?",
            "title_similarity": "-0.043051638",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7ghll",
            "score": 1,
            "text": "That's a lot of damage!",
            "title_similarity": "0.24616052",
            "sentiment_compound": -0.5411
        },
        {
            "id": "ha7id88",
            "score": 2,
            "text": "Ive heard of this as an epoxy alternative before",
            "title_similarity": "0.3197562",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7ip0h",
            "score": 1,
            "text": "Sounds like this could have many other uses.",
            "title_similarity": "0.14042091",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha7iqaw",
            "score": 1,
            "text": "I remember a clotting agent we learned about in army medic school that had a warning to not use on those allergic to shellfish. I wonder if this will be the same",
            "title_similarity": "0.459399",
            "sentiment_compound": -0.5574
        },
        {
            "id": "ha7j0fe",
            "score": 1,
            "text": "Anyone who's ever had to clean barnacles from a boat hull knows how strong those little bastards are.",
            "title_similarity": "0.5555012",
            "sentiment_compound": 0.3167
        },
        {
            "id": "ha7lurh",
            "score": 6,
            "text": "Barnacle penises can be eight times the length of their bodies. They have the largest reproductive organ in comparison to their size.",
            "title_similarity": "0.47678712",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7mclp",
            "score": 1,
            "text": "Let’s ask the real questions…tf is barnacle cement?",
            "title_similarity": "0.2673633",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7nn2z",
            "score": 3,
            "text": "i think these boys might be a bit late to the party. there is already a product called vetigel and the company that makes it jused closed a funding round to accelerate human trials and get FDA approval: \n\nhttps://www.prnewswire.com/news-releases/cresilon-closes-38-5-million-series-a-3-financing-to-accelerate-commercialization-of-hemostatic-gel-301264563.html\n\ni don't know which one's better, though. maybe this barnacle glue will work even better.",
            "title_similarity": "0.6156892",
            "sentiment_compound": 0.891
        },
        {
            "id": "ha7nncz",
            "score": 1,
            "text": "Imagine what cures we missed out on because we annihilated the animals they could be won from.",
            "title_similarity": "0.5530953",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha7nt0e",
            "score": 1,
            "text": "Cost: $65,000 a milligram.",
            "title_similarity": "0.311394",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7o49g",
            "score": 1,
            "text": "We’re gonna be immortal soon, prepare yourselves.",
            "title_similarity": "0.2667077",
            "sentiment_compound": 0.25
        },
        {
            "id": "ha7oauu",
            "score": 1,
            "text": "That’s incredible. Well done!",
            "title_similarity": "0.04460831",
            "sentiment_compound": 0.3989
        },
        {
            "id": "ha7ohmi",
            "score": 1,
            "text": "Sorry if I'm stupid but wouldn't the body attack the \"glue\"",
            "title_similarity": "0.34050825",
            "sentiment_compound": 0.2455
        },
        {
            "id": "ha7op8f",
            "score": 1,
            "text": "Cool! Cant wait to never hear about it ever again",
            "title_similarity": "0.10953869",
            "sentiment_compound": 0.3802
        },
        {
            "id": "ha7oqv7",
            "score": 1,
            "text": "One step closer to video-game level medgel",
            "title_similarity": "0.22568028",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7pc6s",
            "score": 1,
            "text": "One step closer to medi-gel irl?",
            "title_similarity": "0.19679956",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7phso",
            "score": 1,
            "text": "“Barnacles cling thanks to a cement of proteins secreted from glands along each animal’s “forehead.” But the secret sauce—well, more of an oil—is a cocktail of lipids that first sweep contaminants away from surfaces so the proteins can do their thing. “So basically they are terraforming the target substrate…”",
            "title_similarity": "0.638862",
            "sentiment_compound": 0.2382
        },
        {
            "id": "ha7pr05",
            "score": 1,
            "text": "The start of Medi-gel",
            "title_similarity": "0.19966777",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7ro3t",
            "score": 1,
            "text": "u/HoldRush if he goes through with the watermelon.",
            "title_similarity": "0.34593847",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7sl08",
            "score": 1,
            "text": "The first iteration of medi-gel eh?",
            "title_similarity": "0.20808336",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7su8s",
            "score": 1,
            "text": "Great. I am literally on the table right now for a vasectomy. Where are my barnacles??",
            "title_similarity": "0.51993084",
            "sentiment_compound": 0.6662
        },
        {
            "id": "ha7t822",
            "score": 1,
            "text": "I remember from reading a lot of the original Halo books in high school they referenced bio-foam which was ejected into the wound and the foam grew to seal the wound. It’s interesting to see how reality follows art. Especially when the art is self aware of its modern limitations.",
            "title_similarity": "0.6141746",
            "sentiment_compound": 0.6124
        },
        {
            "id": "ha7tjnm",
            "score": 1,
            "text": "The real question- does it work better than cocaine?",
            "title_similarity": "0.3569929",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ha7ubl2",
            "score": 1,
            "text": "Emergency HALO biofoam injections here we come!",
            "title_similarity": "0.4355791",
            "sentiment_compound": -0.4389
        },
        {
            "id": "ha7uzbg",
            "score": 1,
            "text": "How large can the wound be? What are the side effects of it getting in the blood?  How much does it cost? What are the benefits to this over a patch? How the hell do you glue multiple lacerations that intersect?",
            "title_similarity": "0.6265573",
            "sentiment_compound": -0.6072
        },
        {
            "id": "ha7v4nl",
            "score": 1,
            "text": "I don't have time to read the article atm but does it mention how long it takes to decompose and what it decomposes into.",
            "title_similarity": "0.34395954",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7vrc2",
            "score": 1,
            "text": "Roberto approves this message.",
            "title_similarity": "0.12579681",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ha7wnae",
            "score": 1,
            "text": "One step closer to UNSC Biofoam.",
            "title_similarity": "0.2908374",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7wrx3",
            "score": 1,
            "text": "Looks like we’re one step closer to Bacta tanks. Noice!",
            "title_similarity": "0.2807663",
            "sentiment_compound": 0.4199
        },
        {
            "id": "ha7x34r",
            "score": 1,
            "text": "Billions of blue blistering barnacles that's neat!",
            "title_similarity": "0.42679116",
            "sentiment_compound": 0.5093
        },
        {
            "id": "ha7x5rg",
            "score": 1,
            "text": "*Boy you bleed like a pig on blood thinners sure 'nuff*",
            "title_similarity": "0.52493393",
            "sentiment_compound": 0.5859
        },
        {
            "id": "ha7x99z",
            "score": 1,
            "text": "So this glue just created itself over time right? Wonder who found this awesome new product out in the wild.",
            "title_similarity": "0.48473388",
            "sentiment_compound": 0.783
        },
        {
            "id": "ha7xxnm",
            "score": 1,
            "text": "My pigs always take blood thinners",
            "title_similarity": "0.5897036",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7y815",
            "score": 1,
            "text": "So they derived an adhesive to seal me up…from one the things that cut me the worst in my entire life. Science is a funny thing.",
            "title_similarity": "0.5436214",
            "sentiment_compound": -0.5106
        },
        {
            "id": "ha7yj75",
            "score": 1,
            "text": "Reminds of the bio foam in the halo books",
            "title_similarity": "0.41958755",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha7zja8",
            "score": 1,
            "text": "Just a few years until hospitals start giving us Barnacle Bills.",
            "title_similarity": "0.44407818",
            "sentiment_compound": 0.34
        },
        {
            "id": "ha80cz7",
            "score": 2,
            "text": "TV commercials be like:\n“Ow my kidney!”\n“Honey, get me the SHELL GLUE!”",
            "title_similarity": "0.5079351",
            "sentiment_compound": 0.4738
        },
        {
            "id": "ha80hfs",
            "score": 3,
            "text": "Would this work for an aorta dissection?  My father bled to death from that",
            "title_similarity": "0.43186775",
            "sentiment_compound": -0.5994
        },
        {
            "id": "ha812is",
            "score": 1,
            "text": "Can we call it med-gel?",
            "title_similarity": "0.18584919",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha81rfw",
            "score": 1,
            "text": "Omg!!! I make seaweed jewelry (some with barnacles) and i had a scientist at my craft fair table telling me about how they were looking into this (maybe 4 years ago) neat to see it making headlines and that its working. He was mostly talking about using it in replace of bone adhesives … this is pretty amazing that it can also be used on soft organs!",
            "title_similarity": "0.6008288",
            "sentiment_compound": 0.9256
        },
        {
            "id": "ha81sms",
            "score": 1,
            "text": "Maybe they can find something to do with the zebra mussels in the great lakes.",
            "title_similarity": "0.37455684",
            "sentiment_compound": 0.6249
        },
        {
            "id": "ha82eda",
            "score": 1,
            "text": "“This is a load of barnacles…..”",
            "title_similarity": "0.28582442",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha82fa9",
            "score": 1,
            "text": "Ok now someone tell me why this won’t work/isn’t viable like with every other cool technological advancement headline I see",
            "title_similarity": "0.346407",
            "sentiment_compound": 0.7184
        },
        {
            "id": "ha8329m",
            "score": 1,
            "text": "Major Dede effect is , finding rocks really attractive and just clinging to them.",
            "title_similarity": "0.24333763",
            "sentiment_compound": 0.4927
        },
        {
            "id": "ha833s0",
            "score": 1,
            "text": "This is gonna disappear from the news in like a month, resurface a year later and disappear again",
            "title_similarity": "0.31945062",
            "sentiment_compound": -0.0772
        },
        {
            "id": "ha83lad",
            "score": 1,
            "text": "So basically biomedical foam from Halo?",
            "title_similarity": "0.28124622",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8510x",
            "score": 1,
            "text": "Hey I worked with synthesizing similar biomimetic adhesives 5yrs ago and they used my paper as a resource! One of like a million sources but still pretty cool",
            "title_similarity": "0.6143999",
            "sentiment_compound": 0.8516
        },
        {
            "id": "ha853jv",
            "score": 1,
            "text": "\"Are you covered bro?\". \n\n\"Nah. I'm on Barnacaid.\".",
            "title_similarity": "0.288821",
            "sentiment_compound": -0.1027
        },
        {
            "id": "ha85jx2",
            "score": 1,
            "text": "So we have bio foam now? Cool",
            "title_similarity": "0.30214208",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha87flf",
            "score": 1,
            "text": "I wouldn't be surprised if it is the old Krazy Glue formula. Can't seem to get it these days. Everything I buy you have to hold together for a while. With Krazy Glue it used to just bond immediately.",
            "title_similarity": "0.57892376",
            "sentiment_compound": -0.1695
        },
        {
            "id": "ha884ll",
            "score": 1,
            "text": "It Will probably be insanely expensive, so for most of the People It doesnt matter",
            "title_similarity": "0.3126355",
            "sentiment_compound": -0.0191
        },
        {
            "id": "ha88m1s",
            "score": 1,
            "text": "The military has been experimenting with this type of technology for at least 20 years. I remember seeing a video of a surgeon severing the aorta of a pig, and then as the pigs thoracic cavity filled with blood, another surgeon dumped a vial of powder in and immediately stopped all the bleeding. It was amazing to watch, but it made me wonder what happened to all of the extra powder.",
            "title_similarity": "0.72865856",
            "sentiment_compound": 0.0258
        },
        {
            "id": "ha88rkf",
            "score": 1,
            "text": "Just a question. What happens if they accidently glue the bits back together wrong?",
            "title_similarity": "0.33292383",
            "sentiment_compound": -0.4767
        },
        {
            "id": "ha88v2h",
            "score": 1,
            "text": "Um can I buy this to fix a leaking gasket?",
            "title_similarity": "0.41440055",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha89muy",
            "score": 1,
            "text": "Another reason we have to save nature from Climate Change! Many sea creatures have been used to cure disease like the keyhole limpet and horseshoe crab",
            "title_similarity": "0.5100423",
            "sentiment_compound": 0.7177
        },
        {
            "id": "ha89p4a",
            "score": 1,
            "text": "Does this not violate rule #2 of this subreddit???",
            "title_similarity": "0.08880097",
            "sentiment_compound": 0.4885
        },
        {
            "id": "ha8bglu",
            "score": 1,
            "text": "The article even had a video of it working, that’s pretty amazing stuff right there!",
            "title_similarity": "0.327133",
            "sentiment_compound": 0.807
        },
        {
            "id": "ha8c1xy",
            "score": 1,
            "text": "I could use this. I take blood thinners for a clotting disorder and work in a career path that could potentially lead to sever hemorrhaging. I currently carry QuikClot and Celox (developed from crustaceans for folks on thinners). I’m always looking for a good product to stop the bleed and start the breathing. For me, coworkers, or anyone else.",
            "title_similarity": "0.596475",
            "sentiment_compound": -0.25
        },
        {
            "id": "ha8dah5",
            "score": 1,
            "text": "So we’re cutting pigs open and smearing glue on em?\n\nPETA is gonna love this one.",
            "title_similarity": "0.64129984",
            "sentiment_compound": 0.5302
        },
        {
            "id": "ha8dh36",
            "score": 1,
            "text": "Unfortunately, normal people won’t readily receive this new “glue”.",
            "title_similarity": "0.35712278",
            "sentiment_compound": -0.34
        },
        {
            "id": "ha8dkpk",
            "score": 1,
            "text": "This is the premise behind Luke Cages powers in the Netflix  show",
            "title_similarity": "0.2584692",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8dwbm",
            "score": 1,
            "text": "I initially read this as \"steal\" instead of \"seal\" and was highly concerned.",
            "title_similarity": "0.35209104",
            "sentiment_compound": -0.4939
        },
        {
            "id": "ha8e0i7",
            "score": 1,
            "text": "r/biomimicry is cool af",
            "title_similarity": "0.24972127",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ha8e3at",
            "score": 1,
            "text": "Darwin would be proud. He had an obsession with barnacles",
            "title_similarity": "0.42779514",
            "sentiment_compound": 0.1779
        },
        {
            "id": "ha8elsh",
            "score": 1,
            "text": "I wonder it this is the \"secret\" ingredient the romans used to make concrete.",
            "title_similarity": "0.30513775",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8fnla",
            "score": 1,
            "text": "The testing sounds gruesome/awful",
            "title_similarity": "0.3016014",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8g4qw",
            "score": 58,
            "text": "\"If you want to solve a problem, you can probably find an animal that’s already evolved to solve it.\" \n\nThat's a way of thinking that feels so obvious, but not until I literally just read that line.",
            "title_similarity": "0.4043217",
            "sentiment_compound": 0.0258
        },
        {
            "id": "ha8gizm",
            "score": 1,
            "text": "For centuries we have had ammo and now we have health",
            "title_similarity": "0.34848797",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8h0m9",
            "score": 1,
            "text": "The phrase \"bleeding like a stuck pig\" has now lost all meaning.",
            "title_similarity": "0.3146326",
            "sentiment_compound": -0.2023
        },
        {
            "id": "ha8iqkf",
            "score": 1,
            "text": "One step closer to Medigel",
            "title_similarity": "0.028978359",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8irqw",
            "score": 1,
            "text": "Is this something that would ever be in a field kit? Or is it just for operating rooms?",
            "title_similarity": "0.27116936",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8l72o",
            "score": 1,
            "text": "It cam seal organs? SOMEONE CALL SENKU HE NEEDED THIS",
            "title_similarity": "0.27603805",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8m48i",
            "score": 2,
            "text": "How does this compare to VetiGel? It sounds like a very similar concept.",
            "title_similarity": "0.11999795",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha8m65c",
            "score": 1,
            "text": "Are... are they stabbing pigs and sealing them up with super glue?",
            "title_similarity": "0.5921043",
            "sentiment_compound": 0.5994
        },
        {
            "id": "ha8o9a3",
            "score": 1,
            "text": "Coat a tumor with it and starve it....",
            "title_similarity": "0.46401715",
            "sentiment_compound": -0.6705
        },
        {
            "id": "ha8ogms",
            "score": 1,
            "text": "Oscar Madison knew this day would come",
            "title_similarity": "0.12894493",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8oriv",
            "score": 1,
            "text": "When I first read this, the part where it said \"...it was tested on pigs...\", I imagined injured pigs being brought to the vet and this treatment being available to them. It never really occurred to me that someone is having to do the appropriate damage to these pigs, then see if this blue works :/. Maybe they put the pig under first? Maybe I'm wrong all together?  \n\n\nI know I know \"where do you think medical advances come from\". Just pointing out my own naivety, in that it never really crosses my mind when reading stuff like this. They probably mention it if I went ahead and read the article",
            "title_similarity": "0.62830645",
            "sentiment_compound": -0.782
        },
        {
            "id": "ha8pbxx",
            "score": 1,
            "text": "They don't have a ticker tho",
            "title_similarity": "0.01710621",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8q83d",
            "score": 1,
            "text": "I see so many cool things on this sub that I feel never make it to the real world",
            "title_similarity": "0.38588452",
            "sentiment_compound": 0.3774
        },
        {
            "id": "ha8r7nu",
            "score": 1,
            "text": "I can't wait to see this working in the medical field.",
            "title_similarity": "0.3758058",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8sr9v",
            "score": 1,
            "text": "Nothing new. People have known for about 200 years",
            "title_similarity": "0.10648294",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8tbke",
            "score": 1,
            "text": "[Anybody ever heard of Celox?](https://www.celoxmedical.com/na/celox-faq/) When I was with Special Operations, we would use this stuff to great effect. It's pretty old technology too, was around when we went into Iraq in 2003.",
            "title_similarity": "0.56726027",
            "sentiment_compound": 0.875
        },
        {
            "id": "ha8tol8",
            "score": 1,
            "text": "Superglue works great too",
            "title_similarity": "0.32665145",
            "sentiment_compound": 0.6249
        },
        {
            "id": "ha8ux9e",
            "score": 1,
            "text": "So they gave pigs blood thinners, what, stabbed them and gave them barnacle glue to see if it works?",
            "title_similarity": "0.63744104",
            "sentiment_compound": -0.4404
        },
        {
            "id": "ha8vwqf",
            "score": 1,
            "text": "What are all these pigs getting into? Arriving all shot up and all. Some kind of pig on pig violence, and apparently into blood thinners. Must be a pig gen z thing. \n\nGood thing for us we were able to capitalize on this opportunity in the name of medical science.",
            "title_similarity": "0.68186235",
            "sentiment_compound": 0.2617
        },
        {
            "id": "ha8wamq",
            "score": 1,
            "text": "Thank you all  unknown pigs out there for this medical breakthru .",
            "title_similarity": "0.55751973",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ha8wule",
            "score": 1,
            "text": "Why are these pigs on blood thinners?",
            "title_similarity": "0.5027588",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8xd68",
            "score": 1,
            "text": "But can it seal this motorboat entirely and keep it afloat? Even at high speeds???",
            "title_similarity": "0.40677145",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8yc18",
            "score": 1,
            "text": "Hehe seal, ocean puns",
            "title_similarity": "0.18392348",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha8ynsp",
            "score": 1,
            "text": "As someone with Vascular Elhers Danlos Syndrome this is great to hear.",
            "title_similarity": "0.22663982",
            "sentiment_compound": 0.6249
        },
        {
            "id": "ha8zdvd",
            "score": 1,
            "text": "Can I find it on Amazon? Feel like I should have it around the house.",
            "title_similarity": "0.28639764",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ha91019",
            "score": 1,
            "text": "Poor pigs - I image they were just sliced by the lab technician with out any pain killers or anything",
            "title_similarity": "0.5895185",
            "sentiment_compound": -0.8934
        },
        {
            "id": "ha91301",
            "score": 1,
            "text": "Interesting, a prof at the school I went to grad school had a military grant to make plastic explosives using synthetic barnacle glue.",
            "title_similarity": "0.5360826",
            "sentiment_compound": 0.6369
        },
        {
            "id": "ha92hk3",
            "score": 1,
            "text": "When can I be a med rep for this?",
            "title_similarity": "0.24489875",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha938xy",
            "score": 1,
            "text": "As a dentist, this is great news",
            "title_similarity": "0.34585264",
            "sentiment_compound": 0.6249
        },
        {
            "id": "ha93bwe",
            "score": 1,
            "text": "I wonder if this could be used for [cerebral spinal fluid leaks](https://spinalcsfleak.org/about-spinal-csf-leaks/)",
            "title_similarity": "0.33625865",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha94dgu",
            "score": 1,
            "text": "The culinary aspect behind this are very interesting",
            "title_similarity": "0.26148072",
            "sentiment_compound": 0.4576
        },
        {
            "id": "ha98yx5",
            "score": 1,
            "text": "When I was working at NRL (Naval Research Lab) in DC, we had a powder that we could use to immediately stop bleeding (it was designed for gaping wounds like bullet holes.  It was incredible they worked out how to get it to work, but i never got to watch it in action.  I have no clue what it was made of, but i dont think any ingredient was as natural as barnacles.  this is pretty neat.",
            "title_similarity": "0.6165701",
            "sentiment_compound": 0.872
        },
        {
            "id": "ha9aaju",
            "score": 1,
            "text": "Hey cool, one of my polymer chemistry professors in college was the one to first characterize and produce that adhesive. The story of how he started and conducted the research is pretty interesting.",
            "title_similarity": "0.38505378",
            "sentiment_compound": 0.802
        },
        {
            "id": "ha9ay4h",
            "score": 1,
            "text": "Poor freaking test pigs.",
            "title_similarity": "0.35759795",
            "sentiment_compound": -0.7096
        },
        {
            "id": "ha9c9mm",
            "score": 1,
            "text": "How do you get it off?",
            "title_similarity": "0.006909143",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha9cs51",
            "score": 1,
            "text": "How is this different from QuikClot?",
            "title_similarity": "0.038481757",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha9cy90",
            "score": 1,
            "text": "Too bad it will never be used",
            "title_similarity": "0.03297018",
            "sentiment_compound": -0.5423
        },
        {
            "id": "ha9fgei",
            "score": 1,
            "text": "People with trypophobia watching this on their home page...",
            "title_similarity": "0.3762192",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha9fjld",
            "score": 1,
            "text": "Soon I hope we will reach a stage in science, where we don't have to experiment on other living creature's. I know it's important, but it still does not feel right.",
            "title_similarity": "0.36417532",
            "sentiment_compound": 0.34
        },
        {
            "id": "ha9gbih",
            "score": 1,
            "text": "I hope Danny DeVito gets credit or at least an honorable mention for his contribution to this discovery... I'm intrigued to see what this will mean for the future of spleen operations (ruptured/lacerated) on humans.",
            "title_similarity": "0.51464856",
            "sentiment_compound": 0.8402
        },
        {
            "id": "ha9irtg",
            "score": 1,
            "text": "Concentration in platelets?",
            "title_similarity": "0.18042603",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha9itd3",
            "score": 2,
            "text": "The accompanying video is gnarly. Tl;dw: Beating rat heart is sliced open and the wound is spackled shut with goo while the heart is still beating.",
            "title_similarity": "0.5406221",
            "sentiment_compound": 0.5267
        },
        {
            "id": "ha9jsyq",
            "score": 1,
            "text": "That website is cancer.",
            "title_similarity": "0.37032238",
            "sentiment_compound": -0.6597
        },
        {
            "id": "ha9jv59",
            "score": 1,
            "text": "So this could have saved Steve Irwin ?",
            "title_similarity": "0.25803778",
            "sentiment_compound": 0.4215
        },
        {
            "id": "ha9k8xf",
            "score": 2,
            "text": "You think they knocked the pigs out before they started hacking them up?",
            "title_similarity": "0.57199055",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha9ner7",
            "score": 1,
            "text": "Watch barnacles become the new horseshoe crab.",
            "title_similarity": "0.42577052",
            "sentiment_compound": 0.0
        },
        {
            "id": "ha9nh75",
            "score": 1,
            "text": "Remember in WestWorld that guy gets his throat cut and just after they use some foam stuff to seal the wound. I always wondered if this is myth or real.",
            "title_similarity": "0.4723302",
            "sentiment_compound": -0.2732
        },
        {
            "id": "ha9nxsg",
            "score": 1,
            "text": "Fantastic! Now… cut the pig DEEPER.",
            "title_similarity": "0.49876505",
            "sentiment_compound": 0.4199
        },
        {
            "id": "ha9rmou",
            "score": 1,
            "text": "“Ceme(a)nt to ask what that substance was. \nCan this solution really stick?”",
            "title_similarity": "0.1550988",
            "sentiment_compound": 0.3869
        },
        {
            "id": "ha9xid9",
            "score": 2,
            "text": "It will take many years to implement a new product like this in hospitals. \n\n\n1.) Hospital systems like to have multiple suppliers for every item. When you only have one supplier, you risk running out of stock when that supplier has a backorder.\n\n2.) Hospitals use an outside company for Product Introduction Management. This is not a fast process. It took me 6 months to get approval for a common product that we were already utilizing via special orders. My employer uses Lumere for this.\n\n3.) Hospitals will need to stock this product in multiple sizes, and stock a solvent. Storage space limitations are important, especially in a surgical area.\n\n\nSource- Am supply chain materials coordinator for a large hospital system.",
            "title_similarity": "0.60186774",
            "sentiment_compound": 0.8591
        },
        {
            "id": "ha9yq5v",
            "score": 1,
            "text": "This would have been great for my dad a few years back when his surgeon nicked his spleen during an emergency colon surgery while he was on blood thinners and going through chemo for lymphoma. He lost his spleen as a result and had two more surgeries that were also touch and go because they had to wait until the blood thinners worked out of his system before they could operate.",
            "title_similarity": "0.61155",
            "sentiment_compound": 0.0516
        },
        {
            "id": "haa3fh4",
            "score": 1,
            "text": "That is incredible we have so much to learn from nature need to preserve species for what they can teach us just my opinion",
            "title_similarity": "0.35409248",
            "sentiment_compound": 0.0
        },
        {
            "id": "haaa5sh",
            "score": 1,
            "text": "Do you eventually become Davy Jones?",
            "title_similarity": "0.15392604",
            "sentiment_compound": 0.0
        },
        {
            "id": "haaqa0j",
            "score": 1,
            "text": "Someone tell Felix Unger",
            "title_similarity": "0.12529908",
            "sentiment_compound": 0.0
        }
    ]
}