{
    "Female police officers are less likely to search a car during a traffic stop but more likely to find contraband when they do\n": [
        {
            "id": "hbd9hj2",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.50107557",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hbdm30d",
            "score": 15,
            "text": "[removed]",
            "title_similarity": "0.08359034"
        },
        {
            "id": "hbdmodr",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.08359034"
        },
        {
            "id": "hbdwoz5",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.115674034"
        },
        {
            "id": "hbdfb1z",
            "score": -14,
            "text": "\"male officers were 272% more likely to search a car than female officers\"\n\nIt means that a male officers 3.72 times more likely to search.\n\n\"female officers uncovered contraband 41.5% of the time, while male officers uncovered contraband 29.9% of the time\"\n\n29.9*3.72/41.5=2.68\n\nMale officers 2.68 times more likely to find contraband then female officers.\n\nOne could conclude, that if your job is to remove criminals from the street and for that you need to find their contraband, than whomever finds more contraband does the better job. Not this article though.\nThis article, written by three women concludes, that female officers are better, because they cause less friction with the community and that probably leads to better community relations. Stupid policeman thought their job is to catch bad guys. Thanks to science we now know, they were wrong.",
            "title_similarity": "0.76957",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hbdpufd",
            "score": -8,
            "text": "so if they search more cars they get more contraband. come on ladies do your job",
            "title_similarity": "0.71786606",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbdu544",
            "score": -19,
            "text": "In short, female police officers respect your constitutional rights more and also do a better job when they have a warrant.",
            "title_similarity": "0.689869",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hbdwrvk",
            "score": 0,
            "text": "Nah this is not true.\n\nThe men are actually finding three times as much contraband as reported.   They just tend to keep a lot of it for their own use or to sell.   :)",
            "title_similarity": "0.53617203",
            "sentiment_compound": 0.069
        },
        {
            "id": "hbduaml",
            "score": 1,
            "text": "So female officers have higher precision (fewer false positives). Logically you would expect that if you increased your thresholds for making a search. What we don't know, however, is what their recall is (the proportion of all contraband-carrying people they stop).   \n\n\nHaving higher precision isn't necessarily beneficial if it comes at the expense of lower recall. (Not that we have evidence that female officers do have lower recall). There's a judgment to be made on the relative importances of the two.   \n\n\n  \nYou can't know how many false negatives we get, but you can make some inferences about the total number of true positives found by male and female officers based on the stats in the article.  \n\n\nMale officers were 225% and 272% more likely to make a stop, whilst females were 10% more likely to find contraband in any given stop. Please correct me if I've made a mistake in the calculations somewhere, but doesn't that leave male officers identifying roughly twice as much contraband in total (or more specifically, vehicles containing contraband) as female officers?",
            "title_similarity": "0.7479817",
            "sentiment_compound": 0.649
        },
        {
            "id": "hbdryd5",
            "score": -12,
            "text": "In other words, they follow their suspicion like a woman would, rather than arbitrarily handing out bad days, like a man in power is wont to do.",
            "title_similarity": "0.64060366",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hbdmcgf",
            "score": 0,
            "text": "No matter the cause of one sex searching cars less than the other sex, if the threshhold for triggering a \"search\" response is greater, and then still gets triggered, it simply implies the indications and circumstances that lead to the trigger are stronger than usual.  \n\n\nIt's no different than any form of discriminating sensor such a weight scale or magnetic wand.",
            "title_similarity": "0.6135763",
            "sentiment_compound": 0.4265
        },
        {
            "id": "hbdx6qb",
            "score": -5,
            "text": "It’s easier to plant contraband when you wear a bra.",
            "title_similarity": "0.47234964",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hbdq3ee",
            "score": -13,
            "text": "That’s because Ewomen are doing a job instead of being racist bullies.",
            "title_similarity": "0.58401954",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hbdu34b",
            "score": 0,
            "text": "I still don't understand how the whole searching of a car is legal. Or trying to find bigger crimes after stopping someone for a smaller crime.\n\nIf you get stopped for speeding, you should get a speeding ticket. Maybe if you see something obvious like a taillight out or not wearing seatbelts, you can write a ticket for that too, or give a warning. You shouldn't be allowed to question someone until they might commit to a crime. Or search their car or their person to find something illegal.\n\nSame with house searches. \"Your doorbell camera filmed us while we were driving past. Let me search your whole house to see if you don't have drugs, exotic pets, downloaded movies, anyone with an outstanding ticket, some antique ivory, a scary looking dog, drugs (that I planted), or anything else. Anything will do.\"",
            "title_similarity": "0.7087328",
            "sentiment_compound": -0.8591
        },
        {
            "id": "hbepnlq",
            "score": 0,
            "text": "And only 40% of it was planted.",
            "title_similarity": "0.29476917",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbdyz0g",
            "score": -2,
            "text": "Also learned last semester that female officers are much less likely to use force but also way more likely to deescalate tense situations so that force is not needed.",
            "title_similarity": "0.79107594",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hbdw9m2",
            "score": 39,
            "text": "[removed]",
            "title_similarity": "0.08359034"
        },
        {
            "id": "hbe9diu",
            "score": 0,
            "text": "So what are we saying? Women ar emote likely to plant contraband in a car?!",
            "title_similarity": "0.6285056",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbdmuvr",
            "score": -1,
            "text": "I would like some data about speed and accuracy of someone finding something hidden that did not have career implications; I am always better at finding things in our house than my husband is, and we both spend the same amount of time at home. Is it just a brain thing?",
            "title_similarity": "0.46537152",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hbeebtj",
            "score": 0,
            "text": "I bet a lot of the women grew up having to be twice as good to get half as far.",
            "title_similarity": "0.4178939",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbdz82r",
            "score": 7,
            "text": "Reminds me of my security satff at the nightclub. When we assign female security to patdown and search bag, they find a shot tonne of drugs and weapons. My male staff find some once in a blue moon",
            "title_similarity": "0.5196378",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hbe8045",
            "score": -3,
            "text": "Huh. Imagine that. More efficient AND greater accuracy.",
            "title_similarity": "0.19457796",
            "sentiment_compound": 0.7056
        },
        {
            "id": "hbdc7qe",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.083590366"
        },
        {
            "id": "hbew5hd",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.083590366"
        },
        {
            "id": "hbdx1eo",
            "score": -15,
            "text": "Otherwise known as Female Police Officers are better at their Jobs then their male counterparts",
            "title_similarity": "0.7026881",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbe2ado",
            "score": -8,
            "text": "So female police officers are more likely to be good at their jobs.",
            "title_similarity": "0.72202826",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbdv0dc",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08359034"
        },
        {
            "id": "hbdz8go",
            "score": 0,
            "text": "So they’re better at it.",
            "title_similarity": "0.2797175",
            "sentiment_compound": 0.4902
        },
        {
            "id": "hbe82e4",
            "score": -3,
            "text": "So what you’re saying is we need more women cops?",
            "title_similarity": "0.5889088",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbe7yr4",
            "score": 6,
            "text": "Sounds to me like they’re just better at not wasting time",
            "title_similarity": "0.4098157",
            "sentiment_compound": 0.7689
        },
        {
            "id": "hbdcn5y",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.083590366"
        },
        {
            "id": "hbe3fvu",
            "score": 40,
            "text": "Is that good?  \n\n\nI'd like to know the total amount of contraband found by each group.  \n\n\nIf the men found more contraband, then the women should increase search probability.  \n\n\nIf the women found more contraband, then the men should improve search criteria.  \n\n\nThis is dumb without that number (I skimmed but didn't see it in article)",
            "title_similarity": "0.6478225",
            "sentiment_compound": 0.4659
        },
        {
            "id": "hbdqeu0",
            "score": 6,
            "text": "So they only search the cars when they really think they will find something. Therefore they have a higher rate of finding something. Seems kinda obvious no?",
            "title_similarity": "0.6878035",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbe4eoi",
            "score": -4,
            "text": "So female officers are more likely to follow the law than male officers",
            "title_similarity": "0.7514161",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbe7meu",
            "score": -4,
            "text": "So… female cops are better at their jobs?",
            "title_similarity": "0.72345567",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbe852d",
            "score": -5,
            "text": "That’s a weird way to say female officers are better at their jobs\n\nTbh these studies are super important and interesting",
            "title_similarity": "0.6384846",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hbdpsrv",
            "score": 17,
            "text": "Wouldn’t they also be more likely to miss more contraband by not searching as often as well though?",
            "title_similarity": "0.7059659",
            "sentiment_compound": 0.0609
        },
        {
            "id": "hbdu3nl",
            "score": 17,
            "text": "But they are just as likely to accidentally use their gun instead of a taser",
            "title_similarity": "0.61360824",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hbdrhfn",
            "score": -4,
            "text": "My guess women have better gut instincts.",
            "title_similarity": "0.54027903",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbdsdsc",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.115674034"
        },
        {
            "id": "hbdwr49",
            "score": -7,
            "text": "[deleted]",
            "title_similarity": "0.115674034"
        },
        {
            "id": "hbe0tbs",
            "score": 6,
            "text": "Its a shame they won’t be allowed to work in Texas any more :(",
            "title_similarity": "0.40464312",
            "sentiment_compound": -0.7425
        },
        {
            "id": "hbe0f85",
            "score": -8,
            "text": "“Women are more effective in roles of power” - something that demographic trends almost always confirm",
            "title_similarity": "0.49336016",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hbe22l3",
            "score": -8,
            "text": "More succinctly:\"Women do their jobs better\"?",
            "title_similarity": "0.48098227",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbdwya3",
            "score": -1,
            "text": "In unrelated news, females have less testosterone.",
            "title_similarity": "0.5191615",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbe75lm",
            "score": 1,
            "text": "post this in /r/ProtectAndServe",
            "title_similarity": "0.17713952",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbe8snx",
            "score": 1,
            "text": "Why are they searching cars during traffic stops? They should write tickets And don’t worry about what people got in their car",
            "title_similarity": "0.60719657",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hbebu0w",
            "score": -1,
            "text": "Sigh. It seems like every time a psychological study is done about men vs women, women are more ethical/better at what they do",
            "title_similarity": "0.57575667",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hbeg7lz",
            "score": 1,
            "text": "If you only actually search when there is reasonable suspicion to do so you would be more likely to find it. That’s just my opinion though.",
            "title_similarity": "0.56009924",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hbdxlew",
            "score": -7,
            "text": "Not surprised that women are better cops than men",
            "title_similarity": "0.6402507",
            "sentiment_compound": 0.3036
        },
        {
            "id": "hbdxrdj",
            "score": -7,
            "text": "That's an interesting way to say that women make better cops.",
            "title_similarity": "0.6436764",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hbdytqe",
            "score": -6,
            "text": "Can we please just have some matriarchy already?",
            "title_similarity": "0.24566273",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hbedgep",
            "score": 5,
            "text": "> male officers were 225% more likely to search a car than female officers\n\n> female officers uncovered contraband 41.5% of the time, while male officers uncovered contraband 29.9% of the time\n\n> On average, female officers were 10% more likely than male officers to uncover contraband at a given stop\n\nUnless my math is failing me, male officers still search more cars and thus discover more contraband.\n\nAlternate title: male officers search more than double the cars and find more contraband than female officers",
            "title_similarity": "0.72496206",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hbegqhs",
            "score": 18,
            "text": "I mean, not to rain on any parade, but the second point follows directly from the first in any random testing process and doesn't at all imply an increase in accuracy or anything.\n\nif you have false positive, false negative, true negative and true positive, knowing something has a low overall positive rate (i.e. few cases where the officer thinks there might be drugs and so does a search) means that their false positive rate (does a search but doesn't find anything) is going to be super low. It doesn't mean their true negative rate is low.\n\nThe headline might as well read: men search more cars than women, let fewer drug containing cars go without searching them.\n\nboth facts are indepdendent of the accuracy and to say which one is better requires you to say something about how much you care about false negatives/false positives.",
            "title_similarity": "0.5843257",
            "sentiment_compound": 0.981
        },
        {
            "id": "hbdoazl",
            "score": -7,
            "text": "Maybe they are better at reading guilty faces, especially the moms who are cops. Moms are mind readers when it comes to juvenile malfeasance at home. No reason it can't play out on the road.",
            "title_similarity": "0.71674955",
            "sentiment_compound": -0.4829
        },
        {
            "id": "hbdroq1",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.08359034"
        },
        {
            "id": "hbdsgdy",
            "score": -2,
            "text": "Female police officers are less likely to search a car during a traffic stop, but more likely to comment on the level of interior cleanliness.",
            "title_similarity": "0.8864169",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hbe9bhj",
            "score": 2,
            "text": "If they are less likely to search a car \"probably due to not being as confrontational\" isn't that the reason they are more likely to find something because they are searching when they for sure know there is something?",
            "title_similarity": "0.7672825",
            "sentiment_compound": 0.5399
        },
        {
            "id": "hbfs386",
            "score": 3,
            "text": "So now soy redditors are pro cops\n\nHuh\n\nNeoliberalism is a brain disease",
            "title_similarity": "0.44900227",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbdhxfk",
            "score": 261,
            "text": "In other words, they're better at establishing probable cause.",
            "title_similarity": "0.4148852",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbdodhg",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.115674034"
        },
        {
            "id": "hbdwt1q",
            "score": 16,
            "text": "isn't that like saying I'm less likely to pick my nose but more likely to find a booger when I do?",
            "title_similarity": "0.6363644",
            "sentiment_compound": -0.1419
        },
        {
            "id": "hbdsdwm",
            "score": -5,
            "text": "Big fan of all female police force.",
            "title_similarity": "0.44670913",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hbdu6mu",
            "score": 3,
            "text": "How wonder what is the ratio of stop vs contraband found for female officers. If they only search the car when they see the drugs, then they have a search success rate of 100% but can let more drivers drive away with drugs. If they search 1% of the cars, then their stop to contraband ratio is 1%. A different policeman could search 4% of the cars and only find contraband in 75% of searches. Giving a stop to contraband ratio of 3%.",
            "title_similarity": "0.72437",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hbdx4bm",
            "score": -3,
            "text": "possibly because female officers arent out to stroke their own ego",
            "title_similarity": "0.69785404",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbdxcdh",
            "score": -4,
            "text": "No surprise here. My fiancé can never find anything! He paid $5k for lasik surgery and I constantly say “wasted $5k for nothing”",
            "title_similarity": "0.29046178",
            "sentiment_compound": -0.2746
        },
        {
            "id": "hbe8g6u",
            "score": -2,
            "text": "In other words, female police officers are less likely to search a car for no reason.",
            "title_similarity": "0.89541316",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbdcnu4",
            "score": 37,
            "text": "[removed]",
            "title_similarity": "0.08359034"
        },
        {
            "id": "hbdfwie",
            "score": 215,
            "text": "That's a very strange conclusion in the article? \"While it was clear that women on the force were searching fewer cars, they did not appear to be uncovering any less contraband (e.g., drugs, alcohol, illegal weapons) than male officers.\"\n\nIt can't make any sense of that when the numbers say  male officers conduct 272% more searches than female officers, and find contraband during 29.9% of searches, compared to 42.5% for females.\n\nEven if they mean male officers search at a rate of 272% that of female officers, as opposed to 272% more, it still would come out as male officers finding about 2x the amount of contraband.",
            "title_similarity": "0.8066031",
            "sentiment_compound": -0.7178
        },
        {
            "id": "hbdqgws",
            "score": 0,
            "text": "Only time Iv got basically strip searched and had to do a dui test at 9 in the freaking morning was from a woman cop. It was bizarre. She left furious that I passed the tests and she couldn't find any drugs. She actually thought I ate a bunch of drugs as she was following me, but she was undercover and I had no idea I was being followed. I was going to Walmart to get groceries.",
            "title_similarity": "0.56209296",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hbdre5q",
            "score": 0,
            "text": "Totally anecdotal, but I can’t find salad dressing in the pantry. My wife can describe where it is from the living room.",
            "title_similarity": "0.3720685",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbduei0",
            "score": 0,
            "text": "Just like while growing up, mom would find the weed stashed in the most random ass place. \"Honey while I was cleaning that obscure pirate skull piggy bank I noticed a noise when I picked it up and found THIS, what do you have to say? \" all I had to say was its a gift.",
            "title_similarity": "0.5069516",
            "sentiment_compound": 0.323
        },
        {
            "id": "hbdumgv",
            "score": 0,
            "text": "Are they more or less likely to use deadly force or beat a person because of their skin colour?",
            "title_similarity": "0.47956824",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbduvy0",
            "score": 0,
            "text": "Makes me wonder if women really do have better instincts than men at decision making",
            "title_similarity": "0.5932114",
            "sentiment_compound": 0.4877
        },
        {
            "id": "hbdwrb4",
            "score": 0,
            "text": "\"where are my keys\" (drugs in this case)\n\"they're right in front of you, in plain sight\"\n\"oh yeahhhhh huh\"",
            "title_similarity": "0.277912",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbdyd1x",
            "score": 0,
            "text": "Because they have some kind of special intuition, I just can’t think of a name for it .",
            "title_similarity": "0.32016957",
            "sentiment_compound": 0.3415
        },
        {
            "id": "hbdzjev",
            "score": 0,
            "text": "Would it be a fair inference that this is because women officers make less spurious traffic stops than their male colleagues?",
            "title_similarity": "0.84456515",
            "sentiment_compound": 0.2415
        },
        {
            "id": "hbe0b7s",
            "score": 0,
            "text": "It's that female intuition.",
            "title_similarity": "0.29116067",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbe0i7q",
            "score": 0,
            "text": "I read this as \"Policewomen better at job than policemen.\"",
            "title_similarity": "0.7199007",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbe0mkm",
            "score": 0,
            "text": "I'm sorry but you said they have better judgment in a very strange way",
            "title_similarity": "0.36711997",
            "sentiment_compound": 0.2641
        },
        {
            "id": "hbe0uyk",
            "score": 0,
            "text": "So they’re better at their jobs then?",
            "title_similarity": "0.36649573",
            "sentiment_compound": 0.4902
        },
        {
            "id": "hbe145x",
            "score": 0,
            "text": "( female officers are more cautious, better officers)",
            "title_similarity": "0.6431694",
            "sentiment_compound": 0.3581
        },
        {
            "id": "hbe1h6y",
            "score": 0,
            "text": "Hmmm. Interesting... Not sure what to extrapolate from this but it seems that maybe females are more likely to deduce that a search is warranted?\n\nAnyway, kinda makes sense.",
            "title_similarity": "0.57056105",
            "sentiment_compound": 0.0948
        },
        {
            "id": "hbe1l11",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08359034"
        },
        {
            "id": "hbe1pt9",
            "score": 0,
            "text": "Yes, just don’t search the car outta spite!",
            "title_similarity": "0.4260296",
            "sentiment_compound": -0.2481
        },
        {
            "id": "hbe1qni",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.08359034"
        },
        {
            "id": "hbe25ex",
            "score": 0,
            "text": "Hasn't it been proven that women differentiate colour better than men, and men track moving objects better than women?\n\nIt stands to reason, outside of intent or thoroughness or all of that, that a female officer would be biologically better at spotting contraband than a male one.",
            "title_similarity": "0.7334142",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hbe27s2",
            "score": 0,
            "text": "Alternative title: Female Police Officers are Better at Their Job",
            "title_similarity": "0.7154088",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbe2zlq",
            "score": 0,
            "text": "Hmm, almost like they're more discerning and less abrasive?",
            "title_similarity": "0.37566638",
            "sentiment_compound": 0.2975
        },
        {
            "id": "hbe3aai",
            "score": 0,
            "text": "I guess what this means is that they're more competent than male cops.",
            "title_similarity": "0.5553787",
            "sentiment_compound": 0.3804
        },
        {
            "id": "hbe3go5",
            "score": 0,
            "text": "So they only search when they need to and not to flex or aren’t paranoid. Got it.",
            "title_similarity": "0.41012058",
            "sentiment_compound": -0.25
        },
        {
            "id": "hbe3k3l",
            "score": 0,
            "text": "Or women cops feel like they need overwhelming evidence (reasonable evidence by our standards) in order to conduct a search.",
            "title_similarity": "0.67007744",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbe3nvv",
            "score": 0,
            "text": "Less testosterone power trip bs",
            "title_similarity": "0.3964702",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbe40tu",
            "score": 0,
            "text": "The first part is interesting. The second part is entirely expected given the first.",
            "title_similarity": "0.2278567",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hbe45q7",
            "score": 0,
            "text": "Male police officers are more likely to search a car during a traffic stop but less likely to find contraband when they do?",
            "title_similarity": "0.8578272",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hbe4837",
            "score": 0,
            "text": "I'm going to cite this study next time I can't find something and ask my wife to find it for me (which she usually does and rolls her eyes at me).",
            "title_similarity": "0.43400347",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbe4dt7",
            "score": 0,
            "text": "Aka female police officers are less likely to search a car without a really good reason",
            "title_similarity": "0.9091624",
            "sentiment_compound": -0.3865
        },
        {
            "id": "hbe508h",
            "score": 0,
            "text": "Listen, I am not sure that this could ever be considered a valid study given the number of times Police have been caught planting items in searches.  Our unscientific response to this information on women police officers is to automatically believe it must be accurate rather than suspecting that women may actually be planting things in cars during searches more than we suspect.   Any organization whose job it is to “control” some population cannot always be trusted to do things always within the rules.",
            "title_similarity": "0.7684484",
            "sentiment_compound": -0.7491
        },
        {
            "id": "hbe5tmm",
            "score": 0,
            "text": "Football coaches who challenge less often have a higher success rate. The question is, what opportunities are being missed.",
            "title_similarity": "0.5560749",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hbe6ggq",
            "score": 0,
            "text": "“Women are better at being police officers”\n\nIs the proper headline.",
            "title_similarity": "0.75494033",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbe6uqq",
            "score": 0,
            "text": "Yes! Could it be that their searches maybe followed a probable-cause!",
            "title_similarity": "0.23470034",
            "sentiment_compound": 0.508
        },
        {
            "id": "hbe71w7",
            "score": 0,
            "text": "Is no one going to acknowledge the fact that female officers are almost always partnered with a male officer? How the officers tend to assign searches between themselves is obviously going to have an effect on the outcomes, unless you believe there is absolute symmetry in how they assign responsibility for searches.",
            "title_similarity": "0.6509228",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbe7qig",
            "score": 0,
            "text": "Makes sense because they are not arbitrarily stopping and searching everybody, only those who seem suspicious.",
            "title_similarity": "0.590108",
            "sentiment_compound": -0.2631
        },
        {
            "id": "hbe9ryc",
            "score": 0,
            "text": "Fair to assume:\n\nMale cops more likely to search a car on a hunch rather than probable cause",
            "title_similarity": "0.7456258",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hbea1lc",
            "score": 0,
            "text": "How often are they overpowered when in an altercation with a violent criminal?",
            "title_similarity": "0.50795513",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hbeafzq",
            "score": 0,
            "text": "Women are better at reading emotions. So it’s easier to pick up on small signs that somethings off. while a male officers will searches vehicles even with out the total belief that something is in the car. Where I work a male deputy will search any car basically not being drove by a elderly person while the female I usually work with will only search here and there depending on the person or what she picks up on.",
            "title_similarity": "0.8147875",
            "sentiment_compound": 0.7165
        },
        {
            "id": "hbealfo",
            "score": 0,
            "text": "Honestly I can't tell if the takeaway isn't that the female officer is more likely to plant something.",
            "title_similarity": "0.6645471",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hbean41",
            "score": 0,
            "text": "Based on the numbers they give, male officers found much more contraband. \n\nFemale officers appear to be using higher standards, there’s therefore more likely to find contraband per search but find less overall. Look up crossover error rate",
            "title_similarity": "0.72713006",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hbeayo9",
            "score": 0,
            "text": "Probably because they have an actual reason to search.",
            "title_similarity": "0.24533334",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbeb5ao",
            "score": 0,
            "text": "It makes me happy that when mum used to say I had \"a boy look\" that there is now data to back her up.",
            "title_similarity": "0.3265223",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hbebz72",
            "score": 0,
            "text": "Because, follow me here, women go through life with their antenna up, there’s always a bit of caution in how they move, so they, unlike most men, have learned to maneuver through life a little bit cautious but not enough to shut them down. That feeling is something most of them can deal with, so they learn early how to push past it and focus on the details and get their jobs done. \n\nMen have fooled themselves into thinking they never have anything to fear, so when they’re physically threatened and are scared, they handle it poorly. When they’re cops people get killed. A female cop, always a bit cautious anyway, likely her entire life as a woman, typically isn’t going to overreact. So if she thinks there’s something wrong, it probably is.",
            "title_similarity": "0.7151805",
            "sentiment_compound": -0.984
        },
        {
            "id": "hbec7tk",
            "score": 0,
            "text": "Doesn't this just mean women make better cops than men?",
            "title_similarity": "0.695558",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbec8nc",
            "score": 0,
            "text": "How is this oppression and contribution to the problem of mass incarceration any better than the rest of the drug war? Because it's more successful at ruining lives and it's a woman doing it?",
            "title_similarity": "0.6422498",
            "sentiment_compound": -0.3028
        },
        {
            "id": "hbeeb6n",
            "score": 0,
            "text": "Female LEO have to battle the glass ceiling and the thin blue line. They are often top-notch cops, and less prone to violence and corruption. Hats off to good female LEOs, for sure.",
            "title_similarity": "0.6515533",
            "sentiment_compound": -0.3041
        },
        {
            "id": "hbeetm6",
            "score": 0,
            "text": "But that stills leaves them statistically *significantly* less effective.\n\nIt's the classic difference of risk-taking behavior between the genders.\n\nHowever, here the risk is minimal(to society), so it becomes a negative behavior.",
            "title_similarity": "0.60227984",
            "sentiment_compound": -0.611
        },
        {
            "id": "hbef28c",
            "score": 0,
            "text": "Does this help explain why I can't hide anything from my wife?",
            "title_similarity": "0.40597284",
            "sentiment_compound": 0.497
        },
        {
            "id": "hbei9zp",
            "score": 0,
            "text": "That’s a long way to say “they’re selective”.",
            "title_similarity": "0.1909721",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbeilzs",
            "score": 0,
            "text": "It would be interesting to see if the contraband part correlates with the cops also being moms. Those of us who tried to sneak Gameboys to say, school, will know what I mean.",
            "title_similarity": "0.6493141",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hbeixlz",
            "score": 0,
            "text": "Boy look vs girl look. Every time.",
            "title_similarity": "0.2162252",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbejmsy",
            "score": 0,
            "text": "So, female officers are more selective on who they search....and are more likely to find contraband when they do search.\n\nCurious, in terms of absolute amount of contrabands found, is it more for male or female officers?\n\nIf its more to the females, then the male officers need coaching because they really aren't effective in their selection process\n\nIf the male officers have more on average, then the females need to be coached to step up on the number of cars they search.",
            "title_similarity": "0.82307845",
            "sentiment_compound": -0.0599
        },
        {
            "id": "hbejoid",
            "score": 0,
            "text": "I find this funny because the ONE time I was pulled over by a female police officer was when I rolled through a stop sign on an empty street at 3am to just turn around because I went the wrong way.  I'm a white female.  She was too.  She searched my car, thoroughly.  No idea why.  Looked PISSED the entire time and then told me I could go after a long ass speech about how I shouldn't roll through stop signs.  She honestly sounded really mad she didn't find anything.\n\nI mean of course this has nothing to do with statistics countrywide in any country, but statistically in my own personal experience it was not a great look XD",
            "title_similarity": "0.6401688",
            "sentiment_compound": -0.5817
        },
        {
            "id": "hbel8uj",
            "score": 0,
            "text": "Yeah that just means they're more honest",
            "title_similarity": "0.2592798",
            "sentiment_compound": 0.6997
        },
        {
            "id": "hbelsjg",
            "score": 0,
            "text": "I like the hunter and gather theory to explain men and women. A caveman only had to keep his eyes on one animal during hunting. He only had to have one this on his mind. The Cavewoman had to find berries while watching cave kids while taking with all the other cave women.",
            "title_similarity": "0.4509689",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hben4t5",
            "score": 0,
            "text": "Does that mean they just plant evidence?",
            "title_similarity": "0.27623495",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbenip8",
            "score": 0,
            "text": "I wonder how that correlates with how likely female offices are to plant evidence 😅",
            "title_similarity": "0.58401537",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbeo24z",
            "score": 0,
            "text": "In my experience, women are disproportionately good at finding things (my mom always finds my cellphone or keys immediately, even if I've already spent an hour looking.",
            "title_similarity": "0.5258137",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbezvwf",
            "score": 0,
            "text": "Aren't they also more likely to shoot suspects accidentally or something?",
            "title_similarity": "0.63132596",
            "sentiment_compound": -0.7553
        },
        {
            "id": "hbf1iuk",
            "score": 0,
            "text": "Women know when people are lying",
            "title_similarity": "0.46442214",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hbf1p1s",
            "score": 0,
            "text": "Better title: female police officer actually search cars when they have a reason to",
            "title_similarity": "0.79849106",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbfcq1j",
            "score": 0,
            "text": "So blanket searching everything yields lower % of finds then selective and educated guesses.....\n\nIts almost as if its logical who would have known",
            "title_similarity": "0.490655",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbfh06q",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.115674034"
        },
        {
            "id": "hbfoeg1",
            "score": 0,
            "text": "I have a question for American police experts.\n\nWhat is the ratio between male and female police officers when it comes to needless violence and \"drama\"?",
            "title_similarity": "0.62086946",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hbfppgn",
            "score": 0,
            "text": "Very interesting in this is that female officers find just as much contraband as male ones. My initial thought was that male officers might search more cars without reason but also more with reason and thus end up finding more contraband that female officers might have let through because they don't conduct a search, but actually the only difference is that female officers simply don't search vehicles unnecessarily.",
            "title_similarity": "0.8450351",
            "sentiment_compound": 0.2492
        },
        {
            "id": "hbfqe20",
            "score": 0,
            "text": "If you think about it: lets say a male police officer searches cars 325 times and a female 100 times, the male one stil finds contraband in about 100 of these 325 searches(30%). The female in 41 out of the 100(41%). Its not like the males are wasting their time like everyone here suggests.",
            "title_similarity": "0.5952538",
            "sentiment_compound": -0.3204
        },
        {
            "id": "hbfrivm",
            "score": 0,
            "text": "I'm quite interested to know where the numbers come from, as you tend to get a lot of 'correlation = causation' with this sort of stuff...\n\nSay I search 100cars and only find drugs in 20 of them, that leaves me with a 20% success rate.  \nMy colleague searches 30cars, but also finds drugs in 20 of them, that leaves them with a 66.666r% success rate.  So of course their numbers look better than mine, despite the fact we have the same number of positive searches.\n\nObviously the person that searches more is more likely to have a greater number of negative searches than someone who doesn't search as frequently.",
            "title_similarity": "0.5351725",
            "sentiment_compound": 0.9535
        },
        {
            "id": "hbfs54i",
            "score": 0,
            "text": "The only statistic of significance here, and one we won't ever learn, is how many baddies were unknowingly let go.",
            "title_similarity": "0.3982073",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hbgghgw",
            "score": 0,
            "text": "If I were to venture a guess, there may be a higher ratio of male cops trying to \"search\" for contraband as a way of asserting dominance, and thus a higher percentage of searches that yield nothing.",
            "title_similarity": "0.7044658",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hbdgl0v",
            "score": 437,
            "text": "[removed]",
            "title_similarity": "0.08359034"
        },
        {
            "id": "hbdontw",
            "score": -9,
            "text": "So they're more likely to slack in their jobs, and will only conduct a search when they absolutely have to due to it being so obvious?",
            "title_similarity": "0.59419006",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbedk3d",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.08359034"
        },
        {
            "id": "hbdq9bl",
            "score": -6,
            "text": "Female officers **probably** limit their searches to reasonable suspicion. Male cops conduct searches as payback for not calling them sir or not liking your face or just to hold you up a little longer.",
            "title_similarity": "0.7456243",
            "sentiment_compound": -0.5938
        },
        {
            "id": "hbdzj6t",
            "score": 7,
            "text": "But do they find more contraband total?",
            "title_similarity": "0.40006405",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbdq5ht",
            "score": -6,
            "text": "Oh you mean they are better at the job???",
            "title_similarity": "0.34481984",
            "sentiment_compound": 0.533
        },
        {
            "id": "hbduttd",
            "score": 6,
            "text": "This is a simple math problem of n/m = v (n being finding contraband, m being total searches, v being success rate) as m increases v decreases. For more total searches, your success rate is more likely to decrease. And it completely makes sense the numbers they found too:  \n\n\nGoing off the florida one (because that's the one with the contraband data) we see male officers were 272% more likely to search a vehicle. They reported that female officers found contraband 41.5% of the time while males did 29.9% of the time. With 3.72x as many searches for male officers. And just basic math will show that n/(3.72m) < n/m.  \n\n\nThis isn't my opinion on this topic, but coming at it from a basic statistic standpoint.",
            "title_similarity": "0.68692946",
            "sentiment_compound": 0.4555
        },
        {
            "id": "hbdtt7g",
            "score": -1,
            "text": "Because women are good at searching for things to use against you.\n\n\nMaybe they pay attention to smaller details",
            "title_similarity": "0.6258173",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbdxvfp",
            "score": -1,
            "text": "Why can’t we have more women in charge?",
            "title_similarity": "0.45940542",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbdyooc",
            "score": -1,
            "text": "So female officers plant more fake evidence in people's vehicles?",
            "title_similarity": "0.7445996",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hbdzs65",
            "score": 1,
            "text": "I'm no expert but a more gender-balanced police force would probably be better for everyone involved on a number of levels.",
            "title_similarity": "0.6074612",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hbe349q",
            "score": -1,
            "text": "The way it's written its almost implied that a woman cop searching a car makes the car magically have contraband to find.",
            "title_similarity": "0.6953746",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbe6njg",
            "score": -1,
            "text": "Means nothing to me, honestly. I’ve seen too many body cam videos of cops planting drugs and/or discussing their fabricated story to arrest this guy.",
            "title_similarity": "0.54953706",
            "sentiment_compound": -0.5967
        },
        {
            "id": "hbe6se1",
            "score": -1,
            "text": "Better at planting evidence?",
            "title_similarity": "0.4222361",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbeccl2",
            "score": -1,
            "text": "So female cops carry drugs more often and plant drugs more often.",
            "title_similarity": "0.7331196",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbedz3n",
            "score": -1,
            "text": "women have better intuition, inherently",
            "title_similarity": "0.49508795",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbegxft",
            "score": -1,
            "text": "What is \"contraband?\" The term refers to a bunch of things, which are not all equal. We should not treat this issue in a morally uncritical way.\n\n\"Contraband\" often refers to drugs. Simply put, the police should not be searching people's cars for drugs. I don't care whether the police officer is a man or a woman. I don't even care if the police can find a way do it without being classist and racist (which in fact they frequently are). Maybe searching a cartel bigwig's car is justifiable. But that is not a typical case, by a long shot.\n\nThey should of course arrest someone who's driving while high-- but simply finding drugs in the car wouldn't usually tell them whether the driver was high, especially if the drugs are inaccessible to the driver and/or someone else is in the car. But I'm fine with treating drugs in a similar way they treat alcohol, such as by having laws banning \"open containers\" or something along these lines.\n\nSometimes \"contraband\" refers to illegal weapons. Cracking down on illegal weapons, though not entirely above board in execution either (targeting poor and nonwhite people disproportionately), is at least basically justifiable in principle. (I think there's reasonable disagreement on what the gun laws should be and how to enforce them.)\n\nAnd of course, there are many other things that can also reasonably be considered contraband. But not drugs, in general.",
            "title_similarity": "0.67548585",
            "sentiment_compound": -0.9843
        },
        {
            "id": "hbehocg",
            "score": 1,
            "text": "The article contradicts itself.\n\nMale officers find on average 80% more contraband than females, but 25% less per search.\n\nSo yes, they're less accurate, but male officers find significantly more contraband.\n\nThis is like basic common sense, the less strict your criteria is, the more false positives you get. There's nothing revolutionary in this article except for the false bias it's trying to present.\n\nWould you take 25% less accurate work if it resulted in overall 80% more throughput? Absolutely.",
            "title_similarity": "0.5992824",
            "sentiment_compound": 0.9136
        },
        {
            "id": "hbelwdu",
            "score": 1,
            "text": "In other words, male officers are less likely to actually be looking for anything, or have any reason, but are more likely to do it just to hassle people.\n\nYeah, that sounds about right. Doesn't surprise me at all.",
            "title_similarity": "0.6646782",
            "sentiment_compound": 0.1479
        },
        {
            "id": "hbffrkc",
            "score": -1,
            "text": ">female officers uncovered contraband 41.5% of the time, while male officers uncovered contraband 29.9% of the time.\n\nI guess it's good to know that female officers suck at their job less than male officers...\n\nThe word \"probable\" means that a thing is more likely than unlikely, so given that they need \"probable cause\" to search a car, they should be finding contraband in a minimum of 51% of searches. Any less than that indicates that they're conducting searches outside the authorization that the constitution grants them.",
            "title_similarity": "0.8175783",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hbggtmz",
            "score": 1,
            "text": "I think the study has several commendable points in its favor, especially the use of so many records over multiple jurisdictions.\n\n## But doesn't this also show female cops miss a lot of real contraband?\n\nRunning the numbers, in the same amount of time, this study shows women find `100 searches * 42% hitrate = 42 pieces of contraband`, but men find `225 searches * 30% hitrate = 67.5 pieces of contraband`. In terms of overall contraband off the streets, doesn't this mean the average female cop finds 37% less contraband per year than the average male?\n\n## What matters more - false positives or false negatives?\n\nThere are good arguments that many cases of contraband are low risk to broader society (e.g., cannabis). In those cases, we likely prefer to perform fewer (invasive and humiliating) searches, at the risk of \"missing out\" on the weed we could have found and removed. Conversely, if we're talking about something like human trafficking, it seems like we would almost never want to mistakenly fail to search a car.\n\n## My own experience in suicide prevention, for comparison\n\nI work in a hospital and my specialty is suicide prevention. Statistically, people who end up in the ER for what looks like accidental injury (car accident, overdose, large cut with a knife) are more likely to attempt suicide in the next year - but not guaranteed. Our suicide risk tools are not perfectly accurate. For every person we screen, there is a risk of mistakenly hospitalizing someone who would have been fine vs. mistakenly discharging someone who later ends his life. If we took the same numbers from this study and put them into the suicide context, women would look straight up negligent by missing 37% of people that men successfully saved.\n\n## My concern\n\nThis is a good study that finds women perform police searches less often than men. What is missing from this thread is a discussion of what we want our search / hitrate distribution to look like. It's hard to know whether one sex or the other is closer to optimal, without having that discussion.\n\nEDIT: to fix an arithmetic error",
            "title_similarity": "0.70333695",
            "sentiment_compound": -0.9892
        },
        {
            "id": "hbghbk4",
            "score": -1,
            "text": "Female cops also don’t seem to be assholes when they pull you over either",
            "title_similarity": "0.7823857",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hbgthly",
            "score": -1,
            "text": "Often female officers confronted armed suspects in front of timid cops",
            "title_similarity": "0.7141222",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hbdptiu",
            "score": -2,
            "text": "That just tells me that lady cops aren’t being nosy for stupid reasons, mostly using the right reasons to check it out.\n\nAside from “cause I can”\n\nI can’t help but wonder if there is something on dealing with a lady cop or a man cop.  People may be more relaxed dealing with a lady copy as opposed to a male cop.\n\nEither way, good work for the Ladies of the Law",
            "title_similarity": "0.7549493",
            "sentiment_compound": 0.8496
        },
        {
            "id": "hbdxp4z",
            "score": -2,
            "text": "Male cops are probably standing there with the door open looking right past the contraband and the female cop walks up and just picks it up and hands it to him. \"He-he, if it was a snake it woulda bit me.\"",
            "title_similarity": "0.54390806",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbe71uy",
            "score": -2,
            "text": "So…female officers plant more drugs is what I hearing here.",
            "title_similarity": "0.64171815",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbeh60e",
            "score": -2,
            "text": "I think if all cops were women it could be a good thing.",
            "title_similarity": "0.6044571",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbepmvu",
            "score": 2,
            "text": "It's almost like they're less likely to search your car as a show of aggressive dominance, but rather only when there's genuine cause, skewing the results to a higher rate.",
            "title_similarity": "0.72141707",
            "sentiment_compound": 0.1787
        },
        {
            "id": "hbewn81",
            "score": 2,
            "text": "In other words, women police officers are less likely to harass and go on power trips. They need and have a good cause to search your vehicle",
            "title_similarity": "0.890223",
            "sentiment_compound": -0.0094
        },
        {
            "id": "hbe94wf",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.08359034"
        },
        {
            "id": "hbdaf8k",
            "score": 842,
            "text": "I'd like to see them do other under-represented groups in law enforcement. When you're the minority, you *really* don't want to get it wrong, and don't take it for granted.",
            "title_similarity": "0.66439724",
            "sentiment_compound": -0.0259
        },
        {
            "id": "hbdru8q",
            "score": 12,
            "text": "Less samples you may have a higher hit rate but also a higher miss rate.",
            "title_similarity": "0.54622275",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hbdtnsb",
            "score": -4,
            "text": "Is it possible that the women are just way more likely to plant contraband? (and get away with doing so)",
            "title_similarity": "0.6734241",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbe97si",
            "score": -4,
            "text": "That means that female officers are planting more evidence, if reddit is to be believed.",
            "title_similarity": "0.6304375",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbdyc8c",
            "score": 30,
            "text": "[removed]",
            "title_similarity": "0.08359034"
        },
        {
            "id": "hbe67vq",
            "score": 23,
            "text": "If we treat the officer’s decision to search as a classification model, the female officer “model” has significantly better precision (true positives / false positives + true positives) but it seems like the male officer “model” has better recall (true positives / false negatives + true positives). This means the females are more likely to be right when they do search but males capture a greater number of the true positives. This presents a potential trade off between trust in the police and successful confiscation of all contraband.",
            "title_similarity": "0.75990474",
            "sentiment_compound": 0.9957
        },
        {
            "id": "hbdkdrc",
            "score": 944,
            "text": "Less likely to search when unnecessary = more likely to find things when necessary",
            "title_similarity": "0.551329",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbdqz7a",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.08359034"
        },
        {
            "id": "hbdb7xh",
            "score": 3481,
            "text": "Well it stands to reason that if you don't waste time searching people without just cause you'll have better stats, I mean if you're more selective and only search the very sus then you won't come up empty handed so often.  Quick maths.",
            "title_similarity": "0.64409053",
            "sentiment_compound": 0.786
        },
        {
            "id": "hbdeahb",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "0.083590366"
        },
        {
            "id": "hbddsg4",
            "score": -19,
            "text": "A perfect case for partners.\n\nMale officer decides which cars to search and female officer then searches them.",
            "title_similarity": "0.5640186",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hbdyffp",
            "score": 1697,
            "text": "[removed]",
            "title_similarity": "0.083590366"
        },
        {
            "id": "hbdb4bv",
            "score": 13973,
            "text": "It makes sense, if you have a higher threshold to search a car that the smaller, more rigorous sample is more likely to yield results.",
            "title_similarity": "0.63899696",
            "sentiment_compound": -0.3384
        },
        {
            "id": "hbdrmqi",
            "score": 1,
            "text": "Was age etc. accounted for?\n\nI'd assume that the average female police officer is a good bit younger than thte average male one.",
            "title_similarity": "0.56382626",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbdxwuv",
            "score": 1,
            "text": "What exactly is “contraband”?",
            "title_similarity": "0.19653323",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbdzvb2",
            "score": 1,
            "text": "If someone has a higher tolerance for what it takes to justifyably initiate a search, wouldn't that mean that they have a higher \"hit percentage\" no matter what?",
            "title_similarity": "0.5032772",
            "sentiment_compound": 0.2792
        },
        {
            "id": "hbe0tnf",
            "score": 1,
            "text": "Repost? I’m sure I’ve seen this article before",
            "title_similarity": "0.092314616",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hbe162g",
            "score": 1,
            "text": "How big is the sample size difference",
            "title_similarity": "0.13473311",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbe1tyi",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08359034"
        },
        {
            "id": "hbe2342",
            "score": 1,
            "text": "I think the better stat is contraband busts per stop (as a fraction). If a police officer only searches one car a year that has very obvious drugs in the car they’ll have a 100% find rate. Whereas another officer that searches 100 cars but only finds contraband in half of them has a 50% catch rate.",
            "title_similarity": "0.6025262",
            "sentiment_compound": 0.09
        },
        {
            "id": "hbe4zq1",
            "score": 1,
            "text": "makes sense that if you search less, the times you do search you tend to find more.\n\nbut the question now is who finds more overall.",
            "title_similarity": "0.50564694",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbe5ie2",
            "score": 1,
            "text": "Do they find more contraband then males in total?",
            "title_similarity": "0.49102494",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbe67il",
            "score": 1,
            "text": "Remember: never consent to a search of your person or vehicle (your 4th amendment right), never answer police questions (your 5th amendment right), and always ALWAYS film every police encounter (your 1st amendment right).",
            "title_similarity": "0.38043547",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hbeana4",
            "score": 1,
            "text": "this is weird…the numbers imply men have 80% of a higher total number of finds…yet the article says they have an equal number of finds?",
            "title_similarity": "0.33290052",
            "sentiment_compound": 0.2247
        },
        {
            "id": "hbeas3p",
            "score": 1,
            "text": "More likely to request backup, less likely to arrest a suspect, more likely to utilize a taser, etc.",
            "title_similarity": "0.69971126",
            "sentiment_compound": -0.5165
        },
        {
            "id": "hbeaxyu",
            "score": 2,
            "text": "I wonder how different cop culture would be if cops were predominantly female",
            "title_similarity": "0.7199974",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbec3bt",
            "score": 3,
            "text": "Precision-Recall tradeoff.",
            "title_similarity": "0.115160495",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbed1a0",
            "score": 1,
            "text": "either men like power-tripping, or women don't like to be intrusive. maybe a bit of both",
            "title_similarity": "0.5931089",
            "sentiment_compound": 0.1002
        },
        {
            "id": "hbef5u0",
            "score": 2,
            "text": "I can't speak about the first statement but I remember hearing about some study that females are on average better at dispersed search in the visual field than males. Males are on average better at something else that I cannot remember.",
            "title_similarity": "0.5995058",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hbegzh5",
            "score": 3,
            "text": "The precision recall tradeoff strikes again. Would be cool if they compared F-scores of female police to those of male police",
            "title_similarity": "0.68922114",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hbekal0",
            "score": 1,
            "text": "That's a pretty strange way of saying \"better than\"",
            "title_similarity": "0.2657214",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hbel25j",
            "score": 2,
            "text": "In other words, they’re better at determining probable cause?",
            "title_similarity": "0.39920574",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbemm5r",
            "score": 1,
            "text": "Female officers are more competent and less likely to be pigs",
            "title_similarity": "0.7242069",
            "sentiment_compound": 0.3804
        },
        {
            "id": "hben6fj",
            "score": 2,
            "text": "Isn’t this essentially saying women are more likely to be justified in a search of your car?",
            "title_similarity": "0.7549406",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hbenxw9",
            "score": 1,
            "text": "That’s what moms do best.",
            "title_similarity": "0.24136806",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hbeo835",
            "score": 1,
            "text": "\"Find\" the international cop way or \"find\" (place) the american way?",
            "title_similarity": "0.29009277",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbeoe8n",
            "score": 1,
            "text": "Its cus men are more likely to bend the rules than woman.",
            "title_similarity": "0.62277675",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbeojvr",
            "score": 2,
            "text": "So less likely to be assholes?",
            "title_similarity": "0.43253034",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hbeolu3",
            "score": 2,
            "text": "Weird, it's like they know what they're doing",
            "title_similarity": "0.092716694",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hbepbb9",
            "score": 2,
            "text": "\\+1 for women in authority roles.",
            "title_similarity": "0.3064317",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hbepfhj",
            "score": 1,
            "text": "Nothing are lost unless mom couldn’t find it.",
            "title_similarity": "0.39333034",
            "sentiment_compound": 0.2411
        },
        {
            "id": "hbepvsb",
            "score": 1,
            "text": "With the number of videos I've seen or a cop planting contraband I do not just assume it's because it was there. \n\nCops plant contraband because they want to nab the person and females may pull over fewer vehicles because of the chance of a physical altercation, therefore a higher percentage of their stops are people they want to nab ergo more planting. \n\nWhat I said is completely without evidence but so is the assumption that the contraband was there to begin with for all or some percentage of the stops. Cops are bad actors and muck up statistics.",
            "title_similarity": "0.7874665",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hbepw1g",
            "score": 1,
            "text": "If you're not stupid and know your rights none of them will search your car during a traffic stop no matter the gender.",
            "title_similarity": "0.59877896",
            "sentiment_compound": 0.1285
        },
        {
            "id": "hbepway",
            "score": 1,
            "text": "that's what happenss when you try to do a man's job.\n\nDon't attempt to to do what was for man to do. A man does not do a good job doing women's work. You cannot be equal to man and neither a man can be equal to women. THAT'S WHY BOTHH GENDERS ARE NECESSARY.",
            "title_similarity": "0.49405205",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hbeq2wa",
            "score": 1,
            "text": "I missed the female part at the beginning of the title and just about had a stroke trying to find the logic in posting such an obvious statement.",
            "title_similarity": "0.4811915",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbeq9ak",
            "score": 2,
            "text": "Well its eighter they have great intuition/skill or the more realistic one :  the sure ones will count at both female and male , and that will just bump up find % for those that dont check much otherwise .",
            "title_similarity": "0.49526107",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hbeqe40",
            "score": 1,
            "text": "So they’re better police officers?",
            "title_similarity": "0.56449604",
            "sentiment_compound": 0.4902
        },
        {
            "id": "hbeqmq6",
            "score": 2,
            "text": "Is an alternate interpretation of this: \"male police officers are more likely to do frivolous searches\"?",
            "title_similarity": "0.6551945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hberlyc",
            "score": 1,
            "text": "Contraband - that evil contraband.",
            "title_similarity": "0.23569356",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hbermys",
            "score": 1,
            "text": "I guess that's what happens when you only search if you have probable cause or a warrant.",
            "title_similarity": "0.3914668",
            "sentiment_compound": 0.0
        },
        {
            "id": "hberuur",
            "score": 1,
            "text": "Just imagine your car is a giant fridge and the drugs are a pot of yogurt.",
            "title_similarity": "0.22826365",
            "sentiment_compound": 0.0
        },
        {
            "id": "hberxzs",
            "score": 1,
            "text": "Probably cause they search a car only when there’s a good reason to",
            "title_similarity": "0.5584871",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbes77p",
            "score": 2,
            "text": "Sounds like they’re doing their job correctly",
            "title_similarity": "0.1450535",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbesje8",
            "score": 2,
            "text": "It's almost as if...\n\nand bear with me on this one...\n\nthe female officers more often searched when they had a legitimate reason to suspect contraband, instead of just searching anyone they would *like* to find contraband for...",
            "title_similarity": "0.8059397",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hbesto4",
            "score": 1,
            "text": "Kinda like when I tell my missus that there’s no milk in the fridge. If she doesn’t look than I’m alright. If she looks it magically appears.",
            "title_similarity": "0.4216215",
            "sentiment_compound": 0.2516
        },
        {
            "id": "hbet3yf",
            "score": 2,
            "text": "That's not a fair comparison. They aren't burdened with a penis or testosterone which frankly, from my experience,  can take over your brain.  In the case of most male police while it's true their dicks are small their brains are almost impossible to find without a scanning electron microscope.",
            "title_similarity": "0.5952296",
            "sentiment_compound": 0.476
        },
        {
            "id": "hbeta9y",
            "score": 2,
            "text": "Single reason is women cops are looked down upon and scrutinized more than a male cop,",
            "title_similarity": "0.69956756",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbetlfx",
            "score": 2,
            "text": "Perhaps the women are better at actually reading the suspect’s body language.",
            "title_similarity": "0.6894619",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbeu8t0",
            "score": 1,
            "text": "Given these numbers, men still find more contraband in total:\n\n&#x200B;\n\nUsing X as the total number of cars that could be searched and Y as the number of cars searched by the average female police officer, we get\n\n>Y/X\\*0.41 findings of contraband for the average female policer officer \n\nand\n\n>2.72 Y/X\\*0.29 = 0.788 Y/X findings of contraband for the average male police officer.\n\n&#x200B;\n\n\\-> Men find almost twice as much contraband as women, but they also over-proportionally waste people's time without finding anything.  I would say it's up to debate whether male or female officers are preferable, there is certainly no objectively right answer based on these numbers alone.",
            "title_similarity": "0.7166303",
            "sentiment_compound": -0.6655
        },
        {
            "id": "hbeucmj",
            "score": 1,
            "text": "They should be checking more often then!\n\nPs- I understand the data here :)",
            "title_similarity": "0.39399612",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hbeuep2",
            "score": 2,
            "text": "Womens intuition.\n\nThis guys ok, let him go.\n\nThis guy kinda sus, lets search.",
            "title_similarity": "0.4238389",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbeuuek",
            "score": 1,
            "text": "Studies divided by gender and race are designed to ensure you hold these specific biases. How often do short haired officers search vehicles versus long haired officers? They pick race and gender every time so that you will think in those terms.",
            "title_similarity": "0.609985",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hbeux9m",
            "score": 1,
            "text": "Cause the guys allow them to search the butthole.",
            "title_similarity": "0.2809075",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hbev5kj",
            "score": 1,
            "text": "So basically they're just better at traffic stops.",
            "title_similarity": "0.6056322",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hbev6w1",
            "score": 1,
            "text": "Would love to see further investigating on this, possibly using a signal detection task to establish whether it is a sensitivity difference or a criterion difference, or both.",
            "title_similarity": "0.2689832",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hbewnn1",
            "score": 2,
            "text": "So, I’ve always had this question. Police will commonly use various reasons to search a car. In theory, the training they’ve received tells them how to identify these situations. At what point, after many inspections that yield. I drugs or other illegal contraband, does the training get called in to question? At what point do people see that when a trained professional improperly recognizes a situation, that the training was inadequate??",
            "title_similarity": "0.65067536",
            "sentiment_compound": -0.7808
        },
        {
            "id": "hbexeay",
            "score": 1,
            "text": "Thats interesting. Also end the war on drugs!",
            "title_similarity": "0.39794102",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hbexrb4",
            "score": 1,
            "text": "Did this account for planting evidence as well? Do we know the likelihood of men Vs women planting evidence in someone's car?",
            "title_similarity": "0.597783",
            "sentiment_compound": 0.3527
        },
        {
            "id": "hbexud4",
            "score": 1,
            "text": "The cops are also less likely to call the cops on the citizens when there is evidence of drug dealing or if a citizen is resisting arrest or committing a traffic violations.",
            "title_similarity": "0.85810965",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hbexwcq",
            "score": 2,
            "text": "  \nSo they're better at the job",
            "title_similarity": "0.34834093",
            "sentiment_compound": 0.4902
        },
        {
            "id": "hbey603",
            "score": 1,
            "text": "Whenever I would fail to find something at home, my mum would always say “you had a Man Look did you?”  and she would find it instantly",
            "title_similarity": "0.35506585",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hbezj1i",
            "score": 1,
            "text": "That's a stupid headline, because males, searching everything to be an arse, or women who only search those that are likely. Guess which has a higher percentage of contraband found? Obviously, its the targeted search the ladies do, not the blanket assholeness of the male policeman. He would search your car just for something to do and to exert power over others. So yeah, I thought the headline read like The Sky Is Up, Night Is Dark, Bears Do It in The Woods Sometimes.",
            "title_similarity": "0.71693754",
            "sentiment_compound": 0.2421
        },
        {
            "id": "hbf0kab",
            "score": 1,
            "text": "I propose the fridge milk hypothesis. No context needed you all know what I mean.",
            "title_similarity": "0.17672248",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbf1s39",
            "score": 1,
            "text": "New idea. Male female units with female leading the situation. Males are basically there for defending her only. How would that not be an obvious good idea",
            "title_similarity": "0.54481065",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbf214q",
            "score": 1,
            "text": "So they're better at their jobs. Got it.",
            "title_similarity": "0.32262892",
            "sentiment_compound": 0.4902
        },
        {
            "id": "hbf22gl",
            "score": 1,
            "text": "This sounds like an onion article",
            "title_similarity": "-0.002915468",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbf33pa",
            "score": 1,
            "text": "Are trans cops a hovis best of both situation then ?",
            "title_similarity": "0.48983917",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hbf5l95",
            "score": 1,
            "text": "That is not surprising. This is perfectly explained by the receiver-operator characteristics (ROC curves if you want to google it) used in statistics and machine learning. The more you limit yourself to obvious cases, you will encounter less false positives. Hence you have a higher precision, but lower accuracy compared to searching less likely cases.\n\nAccuracy here is determined by the overall amount of positive findings while precision is the ratio between positive and false positives.",
            "title_similarity": "0.57956874",
            "sentiment_compound": 0.9643
        },
        {
            "id": "hbf5tm2",
            "score": 1,
            "text": "This makes sense as women are taught more social confidence and behaviours . Because of that I would assume women by % are more equipped to see if someone is hiding something . \nLet's teach our boys better social skills guys",
            "title_similarity": "0.5612637",
            "sentiment_compound": 0.6461
        },
        {
            "id": "hbf7894",
            "score": 1,
            "text": "More stringent criteria mean fewer false positives. The second part is not a surprise.\n\nOn the flip side, more stringent criteria also mean more false negatives.\n\nIf the cops would take it like the health professionals do, they would try to plot an ROC curve and refine their search criteria to reach the optimal trade-off point.\n\nOne can dream.",
            "title_similarity": "0.67936635",
            "sentiment_compound": 0.8265
        },
        {
            "id": "hbf8fwq",
            "score": 1,
            "text": "Female officers are also more likely to write you ticket, rather than giving you a warning.",
            "title_similarity": "0.8069844",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbf97sb",
            "score": 1,
            "text": "I’d be interested in more research to examine *why* there is a discrepancy between number of searches.\n\nLots of people here in the comments suggesting female officers are just better at correctly establishing PC, which may be true, but you don’t necessarily need PC to search a car. Consent exists. \n\nIn most states, it is perfectly acceptable by law for a cop to out-right as you if they can search your car. You are absolutely free to say “no,” but a surprising number of people, in my experience, do consent to search.\n\nBasically, I’m wondering if male officers are just more likely to ask for consent to search just for the hell of it, which is perfectly legal (in most states).",
            "title_similarity": "0.7751632",
            "sentiment_compound": 0.9796
        },
        {
            "id": "hbf9vmy",
            "score": 1,
            "text": "I think this is likely do to female officers picking up on facial queues or body language raising suspicion that the subjects were hiding something. And i'm guessing that this happens more with female officers than male because they are trying to do their jobs to the best of their ability to prove their worth. Where as the male officers are just more lax and often only act on racial biases instead of gut instinct.",
            "title_similarity": "0.7950919",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hbfcb4h",
            "score": 1,
            "text": "The headline should read, “Female police officers are less likely to search a car during a traffic stop but more likely to find pot when they do”",
            "title_similarity": "0.9367017",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hbfepbb",
            "score": 2,
            "text": "Better at searching? or better at judging which cars are more likely to have contraband?",
            "title_similarity": "0.7099253",
            "sentiment_compound": 0.7319
        },
        {
            "id": "hbff78d",
            "score": 1,
            "text": "Women also probably are less likely to search a car just as a power move over other women, unlike most male officers do to women.",
            "title_similarity": "0.87166053",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbff7o1",
            "score": 1,
            "text": "That’s one hell of a stat",
            "title_similarity": "0.00026238337",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hbfikjc",
            "score": 2,
            "text": "If that’s true then that’s pretty cool but funny at the same time. Each person with their different strengths, you know?",
            "title_similarity": "0.2630735",
            "sentiment_compound": 0.9011
        },
        {
            "id": "hbfk7is",
            "score": 1,
            "text": "Welp I would guess that male policemen searching more also leads to them finding more contraband...\n\nIf everything else is equal, a higher threshhold leads to better success rates, but less contraband.",
            "title_similarity": "0.66833156",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hbfn5jw",
            "score": 1,
            "text": "In other words, they are better at it.",
            "title_similarity": "0.33369717",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbfn8tm",
            "score": 1,
            "text": "Big part of this is females are less likely to search alone. This means that the only cars they search are the ones that are completely necessary to search. And will often have multiple officers help in searching.",
            "title_similarity": "0.8647924",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hbfnnun",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.083590366"
        },
        {
            "id": "hbfntjt",
            "score": 1,
            "text": "From my own experience I had 2 women cops request to search my car during an out tag light traffic stop. Wasted 30 minutes of my life.",
            "title_similarity": "0.6511743",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hbfoaob",
            "score": 1,
            "text": "women have better peripheral vision than men, hence why they always find things way better than men do",
            "title_similarity": "0.5602745",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hbfp7gs",
            "score": 1,
            "text": "What an odd, long winded way to say that female cops are more thorough",
            "title_similarity": "0.65384626",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hbfq0ii",
            "score": 1,
            "text": "Apparently the author can't do multiplication...\n\n\nMake officers are more than twice as likely to run a search and when they do only, suffer a ~25% reduction in effectiveness (~30% find contraband vs ~40%).... and the author has the stupid conclusion that they \"uncover just as much contraband\"\n\nEither she doesn't know math or she doesn't know English.",
            "title_similarity": "0.5834261",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hbfq0nb",
            "score": 1,
            "text": "Correction to headline: “*American* female police officers ….. “",
            "title_similarity": "0.5561776",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfqw8m",
            "score": 1,
            "text": "Yeah it’s called discretion",
            "title_similarity": "0.07997929",
            "sentiment_compound": 0.296
        },
        {
            "id": "hbfrgz3",
            "score": 1,
            "text": "Well yeah girls aren't looking for fights.",
            "title_similarity": "0.43295848",
            "sentiment_compound": 0.6765
        },
        {
            "id": "hbfrh42",
            "score": 1,
            "text": "Women are better at finding stuff.",
            "title_similarity": "0.6020396",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbfrku3",
            "score": 1,
            "text": "Makes sense. I can’t ever find something even in the fridge until my wife helps.",
            "title_similarity": "0.32091123",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hbft0rm",
            "score": 1,
            "text": "Makes sense. My husband can never find his socks in the drawer, when l look l find then straight away.",
            "title_similarity": "0.37177196",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hbft9jd",
            "score": 1,
            "text": "So, they're better at their jobs?",
            "title_similarity": "0.35842592",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbfu9r3",
            "score": 1,
            "text": "On average in my experience women have better intuition.",
            "title_similarity": "0.54878134",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbfui1l",
            "score": 1,
            "text": "So there is scientific evidence that women are more often right?",
            "title_similarity": "0.5102632",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfv0vs",
            "score": 1,
            "text": "Weird way to say they are better at their job.",
            "title_similarity": "0.37772667",
            "sentiment_compound": 0.296
        },
        {
            "id": "hbfv71u",
            "score": 1,
            "text": "Wrong. We are all equal.",
            "title_similarity": "0.12189844",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hbfv8dz",
            "score": 1,
            "text": "It’s because we’re used to finding an item right away after our husbands say they can’t find it.",
            "title_similarity": "0.48137307",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfv9nw",
            "score": 1,
            "text": "Is this trying to imply they are better, or that they are more likely to plant drugs?",
            "title_similarity": "0.5442273",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbfvjc3",
            "score": 1,
            "text": "…well yea? If you have more reason to search you are more likely to find…?",
            "title_similarity": "0.4153774",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfvnt3",
            "score": 1,
            "text": "When are the female police officers *more* likely to search a car?",
            "title_similarity": "0.7814388",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfwhkp",
            "score": 1,
            "text": "Yet more evidence that when I need to find something I've lost I should ask my wife.",
            "title_similarity": "0.4303795",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hbfwn9l",
            "score": 1,
            "text": "I read somewhere that men are more likely to locate your prostate with their penis head than women.",
            "title_similarity": "0.4967777",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfwxa8",
            "score": 1,
            "text": "They probably plant drugs on people",
            "title_similarity": "0.4225651",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfxe19",
            "score": 1,
            "text": "I think its intuitive for women . We call my daughter the finder of things lost because she is so good at funding lost stuff.",
            "title_similarity": "0.54594463",
            "sentiment_compound": 0.0364
        },
        {
            "id": "hbfxo2l",
            "score": 1,
            "text": "Female cop: \"Don't me look, cuz I know where you hide it\"",
            "title_similarity": "0.5445391",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hbfxo47",
            "score": 1,
            "text": "It’s evident they don’t participate in Gratuitous car search and possess better instincts. The women are on point.",
            "title_similarity": "0.7402587",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbfyque",
            "score": 1,
            "text": "Does this mean female cops are better at sleight-of-hand when planting \"evidence\"?",
            "title_similarity": "0.81078064",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbfyqys",
            "score": 1,
            "text": "sooo they have better judgement on when to search a car? got it.",
            "title_similarity": "0.58625466",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbfytwj",
            "score": 1,
            "text": "A lot of interesting threads here about doctors and civilian-police interaction.\n\nWhat I am interested in is whether they could measure a difference in the rate at which male cops *planted* contraband.",
            "title_similarity": "0.5282246",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hbfyv95",
            "score": 1,
            "text": "So they’re less likely to harass people to feed their egos. This is the least surprising thing I’ve read all day.",
            "title_similarity": "0.5366308",
            "sentiment_compound": -0.579
        },
        {
            "id": "hbfz97w",
            "score": 1,
            "text": "Non native english speaker here. Contraband isn't a musical instrument? Makes the headline sound kinda silly.",
            "title_similarity": "0.4044273",
            "sentiment_compound": -0.0498
        },
        {
            "id": "hbfzf7v",
            "score": 2,
            "text": "What I read is \"female police officers are less likely to perform baseless searches\"",
            "title_similarity": "0.8531618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfzjkd",
            "score": 1,
            "text": "Have they counted out planted evidence from the male cops?",
            "title_similarity": "0.52759117",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfzod3",
            "score": 1,
            "text": "Theres an idea. Make all cops women.",
            "title_similarity": "0.4799208",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbfzyl3",
            "score": 1,
            "text": "So they’re more likely to plant evidence?",
            "title_similarity": "0.43525416",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg04rs",
            "score": 1,
            "text": "So what I'm hearing is men find contraband more often in raw terms.",
            "title_similarity": "0.44671023",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg0pep",
            "score": 1,
            "text": "So the female cops don’t just pull over every car with a black person in it? Makes sense",
            "title_similarity": "0.77844125",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg0xyf",
            "score": 1,
            "text": "They are also less likely to accept bribes and get drunk on the job",
            "title_similarity": "0.718407",
            "sentiment_compound": -0.0164
        },
        {
            "id": "hbg1vyo",
            "score": 1,
            "text": "Did they account for more males than females having some degree of colorblindness? Could make a small difference.",
            "title_similarity": "0.4755478",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg22ca",
            "score": 1,
            "text": "I mean yeah when yourethe ones planting the contraband it makes it real easy to find evidence",
            "title_similarity": "0.42931902",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hbg2e3x",
            "score": 1,
            "text": "Did the male officers look behind the milk??",
            "title_similarity": "0.43197697",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg2fx1",
            "score": 1,
            "text": "So women police officers happen to be more efficient than men police officers is that what we are getting at here?",
            "title_similarity": "0.7136501",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hbg2kln",
            "score": 1,
            "text": "All together now  ... aren't women just so peachy perfect!!!",
            "title_similarity": "0.2811062",
            "sentiment_compound": 0.7054
        },
        {
            "id": "hbg2nh9",
            "score": 1,
            "text": "The headline makes male officers sound bad, but the data actually tells us the opposite. If we care about maximizing the number of people busted with contraband instead of positivity rate per search, then male officers are doing a much better job.\n\nFrom the article, male officers are 2.25 - 2.72 times more likely to search a car during a traffic stop than female officers but find contraband 29.9% of the time while female officers find contraband 41.5% of the time.\n\nSo, assuming that the number of traffic stops made by male and female officers is equal, male police officers are finding approx. 60 - 100% more people with contraband than female officers. The slightly lower positivity rate per search of the male officers is more than made up by the higher likelihood of search by the male officers.",
            "title_similarity": "0.8018909",
            "sentiment_compound": 0.9047
        },
        {
            "id": "hbg32jt",
            "score": 1,
            "text": "It’s probably because of their sense of smell. And wider peripheral vision. \n\n\nThat’s why your wife knows if you’re seeing someone and can always find things in the cupboard. \n\nAnd can tell teal from green.",
            "title_similarity": "0.49191207",
            "sentiment_compound": 0.25
        },
        {
            "id": "hbg3on1",
            "score": 1,
            "text": "So they only search with reasonable suspicion like they are supposed to",
            "title_similarity": "0.42231286",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hbg4anm",
            "score": 1,
            "text": "Thats why its hard to hide monney from your wife",
            "title_similarity": "0.46970356",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hbg4qcs",
            "score": 1,
            "text": "How about an article with all the different ways men cops are better than women?  So patronizing and hypocritical",
            "title_similarity": "0.58562994",
            "sentiment_compound": -0.0935
        },
        {
            "id": "hbg4u8f",
            "score": 1,
            "text": "They've got experience picking berries and finding grocery store items",
            "title_similarity": "0.38500893",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg5ohd",
            "score": 1,
            "text": "So uh...\n\nIs this good or bad?",
            "title_similarity": "0.16639614",
            "sentiment_compound": -0.0323
        },
        {
            "id": "hbg5vba",
            "score": 1,
            "text": ">Based on data from the Charlotte Police Department, male officers were **225%** more likely to search a car than female officers. Based on data from the Florida Highway Patrol, male officers were **272% (average 248.5%)** more likely to search a car than female officers.\n\n> While it was clear that women on the force were searching fewer cars, they did not appear to be uncovering any less contraband (e.g., drugs, alcohol, illegal weapons) than male officers. The Florida Highway Patrol records included data on whether or not contraband was confiscated during a search, and an analysis of this data found that female officers uncovered contraband **41.5%** of the time, while male officers uncovered contraband **29.9%** of the time.\n\nOverall, the male strategy is successful **79% more** often than the female strategy.",
            "title_similarity": "0.76446414",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hbg66tn",
            "score": 1,
            "text": "That just sounds like they don't do frivolous searches, or at least not as much.",
            "title_similarity": "0.48303682",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbg6w9h",
            "score": 1,
            "text": "> On average, female officers were 10% more likely than male officers to uncover contraband at a given stop\n\nThis to me is the important statistic.  Without it, it could simply be argued that the female cops are not aggressive enough with their searches.  This stat shows that they are just better at finding contraband, period.",
            "title_similarity": "0.7763065",
            "sentiment_compound": 0.1139
        },
        {
            "id": "hbg73a2",
            "score": 1,
            "text": "I follow directions all the time\n\nI even leave them in the original plastic wrapping so as to preserve for future use",
            "title_similarity": "0.24475232",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hbg7du0",
            "score": 1,
            "text": "Well if the second is just a result of the first. I wonder to what degree this difference is",
            "title_similarity": "0.2218079",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hbg7x2p",
            "score": 1,
            "text": "Makes sense; there’s a reason guys ask their wives where things are at… also the more rigorous sample size explanation",
            "title_similarity": "0.45268348",
            "sentiment_compound": -0.3384
        },
        {
            "id": "hbg8d15",
            "score": 1,
            "text": "Only time I had my car searched was by a female cop and she missed the bowl I had in my ashtray.",
            "title_similarity": "0.65514696",
            "sentiment_compound": -0.296
        },
        {
            "id": "hbg8zvg",
            "score": 1,
            "text": "\"Women less likely to do their job so they plant evidence\"\n\n\n\nWow thanks r/science!",
            "title_similarity": "0.6916603",
            "sentiment_compound": 0.7901
        },
        {
            "id": "hbg9dfo",
            "score": 1,
            "text": "Cause “momma always knows”",
            "title_similarity": "0.1227562",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg9j00",
            "score": 1,
            "text": "Female police officers are better—got it and kinda knew that.",
            "title_similarity": "0.6597726",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbg9ja3",
            "score": 1,
            "text": "Probably because they aren’t trying to measure their tiny penises by punishing black people for living as much as male cops are, so when they search they actually have valid reason",
            "title_similarity": "0.6610149",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hbg9mz6",
            "score": 1,
            "text": "It’s almost like toxic macho powertrips erode your ability to be objective…",
            "title_similarity": "0.40366352",
            "sentiment_compound": 0.5434
        },
        {
            "id": "hbgay35",
            "score": 1,
            "text": "This sounds more like, female police officers intuition is better than males. I would agree.",
            "title_similarity": "0.6756279",
            "sentiment_compound": 0.8016
        },
        {
            "id": "hbgbp8p",
            "score": 1,
            "text": "You know that moms find everything.",
            "title_similarity": "0.16002527",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgc4e7",
            "score": 1,
            "text": "I read a study one time that said that women were better than men at everything and we should just get rid of men",
            "title_similarity": "0.56355244",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbgcgbd",
            "score": 1,
            "text": "Sure sounds like they're maybe using better judgment at a higher rate then...",
            "title_similarity": "0.342188",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hbgcivu",
            "score": 1,
            "text": "There’s nothing a woman can’t find with enough time and motivation.",
            "title_similarity": "0.33603907",
            "sentiment_compound": 0.34
        },
        {
            "id": "hbgcuzj",
            "score": 1,
            "text": "My wife always finds the remote.",
            "title_similarity": "0.26240867",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgdclo",
            "score": 1,
            "text": "No way female cops plant evidence better than male cops.",
            "title_similarity": "0.7180192",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hbgdqav",
            "score": 1,
            "text": "They probably don't need to show you who is the boss in that situation and only search when they have a reason. Not Really surprising",
            "title_similarity": "0.5153977",
            "sentiment_compound": -0.2572
        },
        {
            "id": "hbgefed",
            "score": 1,
            "text": "This shouldn't be a \"but\" statement, seeing as the obvious result of less liberal searches is searching only more suspicious individuals.\nIt is also wholly expected that women woukd be less aggressive in this way.",
            "title_similarity": "0.7524226",
            "sentiment_compound": -0.631
        },
        {
            "id": "hbgg8a9",
            "score": 1,
            "text": "So female cops likely are using better reasoning to search. Like ya know having some evidence or reason to search. \n\nTo me this just says male cops are more likely to search any vehicle at any time regardless of a viable reason.",
            "title_similarity": "0.7342629",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hbghc08",
            "score": 1,
            "text": "The term \"contraband\" has not been qualified. A vehicle, once stopped, may be qualified as a crime scene. The contents, therefore, may be considered contraband. The gender of the officer does not come into play.",
            "title_similarity": "0.6477596",
            "sentiment_compound": -0.7533
        },
        {
            "id": "hbghkqd",
            "score": 1,
            "text": "And I’m more likely to ask for a warrant.",
            "title_similarity": "0.38079652",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbghtj9",
            "score": 1,
            "text": "man it’s almost like when you’ve had harmful stereotypes raised against you you’re less likely to engage in stereotyping other people",
            "title_similarity": "0.6103978",
            "sentiment_compound": 0.5177
        },
        {
            "id": "hbgi5zw",
            "score": 1,
            "text": "Makes sense. Only search when they think that they are probably holding, or have a valid reason to search. Total should read, cops that search cars when warranted find controband more often.",
            "title_similarity": "0.715212",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgic04",
            "score": 1,
            "text": "Also women generally less aggressive therefore less like to assert power when unwarranted.",
            "title_similarity": "0.6709887",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hbgiu8j",
            "score": 1,
            "text": "Well if my mom were a cop she'd be an expert and finding stuff. She has that mom gift to find stuff I've been looking for for 30 minutes in like 20 seconds tops",
            "title_similarity": "0.5488627",
            "sentiment_compound": 0.8689
        },
        {
            "id": "hbgiyax",
            "score": 1,
            "text": "Shame they wont be able to work in texas soon :(",
            "title_similarity": "0.36686057",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hbgknib",
            "score": 1,
            "text": "It is because they know when, how and where to stuff things.\n\nMen always just go for it.",
            "title_similarity": "0.26658207",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgl21q",
            "score": 1,
            "text": "Just like my mom could always find what I was looking for in the fridge, sorta",
            "title_similarity": "0.286186",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hbgl7ig",
            "score": 1,
            "text": "It's also true that black people are searched at a much higher rate than white people yet white people have contraband at an equal rate (or maybe higher... I forget).\n\nBasically if 1000 black people and 1000 white people are pulled over, they may search the vehicles of 500 black people compared to 200 vehicles of white people but end up finding contraband in 70 vehicles of either race",
            "title_similarity": "0.585159",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hbglk8t",
            "score": 1,
            "text": "Ya because they do there jobs right instead of going on power trips. That’s why male police officers search your car more because they like to feel powerful.",
            "title_similarity": "0.6755283",
            "sentiment_compound": 0.6771
        },
        {
            "id": "hbglmdw",
            "score": 1,
            "text": "I can always find the bbq sauce in the fridge. All the males I live with can't.",
            "title_similarity": "0.22798996",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgm3r2",
            "score": 1,
            "text": "Just let  women run the Police, easy solution.",
            "title_similarity": "0.5497225",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hbgmgxh",
            "score": 1,
            "text": "\"an analysis of this data found that female officers uncovered contraband 41.5% of the time, while male officers uncovered contraband 29.9% of the time.\"\n\n\"225% more likely to search a car than female officers. Based on data from the Florida Highway Patrol, male officers were 272% more likely to search a car than female officers\"\n\nIf female officers are searching a third to a fourth as much as men but only finding a third more than men then it stands to reason **they are finding 150~200% less contraband in total than men.**\n\n41.5%/3.25= 12.8%\n\n41.5%/3.72= 11.2%\n\nCompare both of those to 29.9% and it's apparent they are finding far less contraband in total than their male counterparts.\n\nWhy the article would **lie** and say this:\n\n\"While it was clear that women on the force were searching fewer cars, **they did not appear to be uncovering any less contraband** (e.g., drugs, alcohol, illegal weapons) than male officers.\"\n\nIs beyond me. I suspect they're attempting to **coax the false impression** into people that police who search cars more are doing so haphazardly and unwarranted when that's definitely not the case.\n\nEdit: Mistook \"more likely\" for \"times more likely\" fixed it.",
            "title_similarity": "0.6765752",
            "sentiment_compound": -0.5023
        },
        {
            "id": "hbgperp",
            "score": 1,
            "text": "Makes sense. Anytime I couldn't find something, my mom always would",
            "title_similarity": "0.30391043",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbgsaus",
            "score": 1,
            "text": "It’s like saying a person is less likely to take a shot at a flying bird with a gun, but when they do, they hit. \n\nYet they only shoot at giant flocks of birds.",
            "title_similarity": "0.5652549",
            "sentiment_compound": -0.4678
        },
        {
            "id": "hbgu33g",
            "score": 2,
            "text": "Better title: Female police officers don't search people's cars without good cause.",
            "title_similarity": "0.88409996",
            "sentiment_compound": 0.1265
        },
        {
            "id": "hbguuc7",
            "score": 1,
            "text": "Once again females are better at job, but ask me again if America is ready for a woman president.",
            "title_similarity": "0.59847784",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hbh0zz8",
            "score": 1,
            "text": "In other words, women are more intuitive that men, that’s nothing new.",
            "title_similarity": "0.51697123",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbh6bk8",
            "score": 2,
            "text": "Is that like when my husband insists we don’t have mustard and I walk over and find it 3 seconds? Right where I told him it would be??",
            "title_similarity": "0.3052421",
            "sentiment_compound": 0.466
        },
        {
            "id": "hbhk9i9",
            "score": 1,
            "text": "It’s that female intuition",
            "title_similarity": "0.31355715",
            "sentiment_compound": 0.0
        },
        {
            "id": "hbhq03s",
            "score": 1,
            "text": "So what you are saying is they are better officers, on average?",
            "title_similarity": "0.4274369",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbht0ju",
            "score": 1,
            "text": ">On average, female officers were 10% more likely than male officers to uncover contraband at a given stop — even after taking into account variables such as officer experience, officer race, age of the driver, and reason for the traffic stop. This finding suggests that female officers were simply more accurate when making the decision to search a car. In other words, they conducted fewer unecessary searches than their male colleagues\n\nStrongly disagree on that conclusion. When you have the ability to search a car then you search it. You don't just randomly choose when to search a car. This data to me says women are in positions where they search less cars.",
            "title_similarity": "0.8263365",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hbhv981",
            "score": 1,
            "text": "Perhaps female officers are more focused and less distracted by the testosterone coursing through their veins like their male counterparts. Female officers may also not be burdened with having to be the alpha in every situation and are thus more reasonable.",
            "title_similarity": "0.70700264",
            "sentiment_compound": 0.6751
        },
        {
            "id": "hbhxsur",
            "score": 1,
            "text": "Proof that women are better at finding things, as if that was necessary.",
            "title_similarity": "0.5465564",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hbi117f",
            "score": 1,
            "text": "Someone please correct me, but I've always recalled hearing a discussion on some AM radio station when I was younger about how men are notably worse at finding missing items (i.e. you need to leave for work and can't find your car keys) because of differences in brain development or something. Is there any truth to this?",
            "title_similarity": "0.5292704",
            "sentiment_compound": -0.5647
        },
        {
            "id": "hbiqu0j",
            "score": 1,
            "text": "Damn who dug this old news up? This was posted a couple of months ago",
            "title_similarity": "0.21174714",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hboq1f3",
            "score": 1,
            "text": "It is not safe for one woman cop by herself if she is stopping a car. It is better to have at least two women cops, one keeping an eye on the person whose car is being searched. The same applies at a residence.",
            "title_similarity": "0.83072245",
            "sentiment_compound": -0.0274
        },
        {
            "id": "hbp7w1n",
            "score": 1,
            "text": "Less likely and less often are two different things.\n\nLess often means they search cars at a lower rate.\n\nLess likely means given the same car the probability of the female offer searching it is lower.",
            "title_similarity": "0.78399086",
            "sentiment_compound": -0.5267
        }
    ]
}