{
    "mRNA cancer therapy now in human trials after shrinking mouse tumours\n": [
        {
            "id": "hc4lrv2",
            "score": -3,
            "text": "Is it sad that the thing that struck me the most about this is probably going to be cost of these \"vaccines?\"\n\nI have 0 doubt that pharma is going to mark these things up 300000%, but considering the affordability of covid vaccines so far we can potentially see significant decrease in cancer treatment.\n\nI hear about people having saved up 600k by the time their in their 50s and then going backrupt even with medical insurance because they got cancer in the states.\n\nagain, I have 0 doubt that pharama companies are probably going to charge $30000 for something that cost them $1 to make, but atleast it's not going bankrupt someone if it happens to work (not considering the possibility of booster shots, etc).",
            "title_similarity": "0.5446032",
            "sentiment_compound": -0.8993
        },
        {
            "id": "hc4v0bj",
            "score": 0,
            "text": "bUt whAt iF mRNA gIveS cAnCer?",
            "title_similarity": "0.6341312",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hc58jp4",
            "score": 2,
            "text": "Waiting for the mental somersaults from those rejecting mrna vaccines but clamoring for mrna cancer treatments.",
            "title_similarity": "0.6682892",
            "sentiment_compound": -0.8442
        },
        {
            "id": "hc4xzua",
            "score": 11,
            "text": "Doctor: It's bad news...Its Cancer. But! we have options here.\n\nPatient in 2021: \\*crying\\* OK, What are they?\n\nDoctor: Well, you can use Radiotherapy which may nearly kill you, with limited success. Chemotherapy......which again will possibly nearly kill you.....and limit discomfort, or there's a new RNA treatment, It's designed around the same biotechnology of the Covid19 Vaccine. and hasn't killed anyone, or living thing during trials. What do you think?\n\nPatient in 2021: Vaccine? I guess I'll take the radiation.",
            "title_similarity": "0.65791655",
            "sentiment_compound": -0.9552
        },
        {
            "id": "hc4rrfo",
            "score": 1,
            "text": "This is awesome and one good thing to come out of recent events",
            "title_similarity": "0.13514166",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hc58slf",
            "score": -1,
            "text": "Republicans think this is a hoax designed to control them.",
            "title_similarity": "0.2981358",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hc58f0w",
            "score": 2,
            "text": "Can't wait for antivaxxers to start using these, getting cured, and saying how they knew it all along",
            "title_similarity": "0.41161594",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc563xy",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.14778934"
        },
        {
            "id": "hc56b4n",
            "score": -17,
            "text": "[deleted]",
            "title_similarity": "0.14778939"
        },
        {
            "id": "hc594ge",
            "score": -7,
            "text": "God and my immune system will heal ma’ cancers!",
            "title_similarity": "0.62476134",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hc4p9qy",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc51nx2",
            "score": -10,
            "text": "mRNA was used almost exclusively for cancer in it's development. This isn't new. It's old. It's expensive and doesn't work as well as other treatments.\n\nSry everyone",
            "title_similarity": "0.52449393",
            "sentiment_compound": -0.7141
        },
        {
            "id": "hc4op2w",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc50gkn",
            "score": -9,
            "text": "Yep. But not for antivaxxers.   They don’t want no stinking health care.",
            "title_similarity": "0.20822236",
            "sentiment_compound": 0.8754
        },
        {
            "id": "hc4jtyu",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc4eeso",
            "score": 72,
            "text": "I don't get why this is news, *ex vivo* mRNA therapeutics have been used to treat cancer for years. It's prophylactic mRNA vaccines that are novel and were only tested on a large scale in human populations through EUAs in 2020 and 2021. All the news we see about the multi-year history of mRNA treatments are mostly about treating cancer with bespoke treatments for an individual cancer patient’s DNA and specific needs.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC6631684/",
            "title_similarity": "0.7262242",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hc53yoq",
            "score": -6,
            "text": "There's not going to be a cure for cancer.",
            "title_similarity": "0.21096578",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc4nqk2",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc6bwpb",
            "score": 3,
            "text": "Why are so many messages deleted? What are we censoring?",
            "title_similarity": "0.4045692",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc4v71p",
            "score": 1,
            "text": "I'm confused.  So, the mRNA vaccines are Gene therapy then?",
            "title_similarity": "0.64615804",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hc425oo",
            "score": 8,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.5337812",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hc53p2i",
            "score": -7,
            "text": "Don’t believe it. Need to do my research.",
            "title_similarity": "0.3421753",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5i8mm",
            "score": -4,
            "text": "This is a just a conspiracy to sell more Horse Paste Medicine.",
            "title_similarity": "0.45465416",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hc5sg2i",
            "score": -6,
            "text": "If you wear a red hat and complain about untested vaccines, you shouldn't be able to get this treatment. This is actual science making actual progress, being held back by heel-draggers. mRNA therapy looks amazing.",
            "title_similarity": "0.6079028",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hc4tmib",
            "score": -2,
            "text": "They will probably need to artificially delay it for 10 years for proper “testing” for it to be accepted.\n\nThat or package it with essential oils.\n\nI am very thankful that we are looking at novel therapeutics. Certainly won’t hurt to try different angles, seemingly less toxic options as well.",
            "title_similarity": "0.56228554",
            "sentiment_compound": 0.7346
        },
        {
            "id": "hc5hj5q",
            "score": 1,
            "text": "Republicans & Trumpers aren’t gonna like this. \n\nWe’ve been saying it forever… we could find a cure for cancer & they would STILL deny the treatment.",
            "title_similarity": "0.47603732",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hc4otoa",
            "score": 26,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc51scv",
            "score": 3,
            "text": "Just pray and hope the 1% doesn't short this therapy out of business because it will effect theirs",
            "title_similarity": "0.44765162",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hc5b1ju",
            "score": 3,
            "text": "Please, God, if you're out there, and if this treatment is actually successful in stopping cancer, please do not let it be another branch of medicine that gets overly-monetized and is prohibitively expensive.",
            "title_similarity": "0.4454453",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hc4w55l",
            "score": 5,
            "text": "Um, they have been using mRNA in humans for cancer therapy for over 3 years.",
            "title_similarity": "0.6274566",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc67eap",
            "score": 0,
            "text": "Seeing a lot of excitement about 'curing cancer', but I think it's worth adding another perspective:\n\nCuring cancer would be great, but even if we *could* cure cancer, unfortunately the effects at a population level would be more modest than you'd think. \n\nCuring cancer would only add ~2.5 years to population life expectancy due to the [Taeuber Paradox](https://en.wikipedia.org/wiki/Taeuber_Paradox). \n\nThis might seem surprising, but it is essentially because curing any single age-related disease results in rapidly diminishing returns, as the risk of death from other diseases like [Alzheimer's or heart disease also increase exponentially with age](https://imgur.com/gallery/xZQi2dr).\n\nIn fact, it seems unlikely that we'll cure cancer without addressing biological aging, because it's causatively linked to: \n\n- [increasing frequency of somatic mutations that give rise to cancer\n](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5754046/)\n\n- [immune aging \\(immunosenescence\\)](https://www.frontiersin.org/articles/10.3389/fimmu.2017.01960/full) leading to reduced immune surveillance of cancer cells that are forming in all of us as we speak\n\n- age-related inflammation (inflammaging) that provides a milieu conducive to cancer development \n\nIt's an uphill battle, which incidentally is also why cancer is an age-related disease where, in the US, median age of diagnosis is about 66 ([source: US NIH](https://www.cancer.gov/about-cancer/causes-prevention/risk/age#:~:text=According%20to%20the%20most%20recent,in%20people%20above%20this%20age.)). Cancer is clearly a disease of older people, despite the fact that congenital/childhood cancers also exist. The median is so high because older adults experience most cancers. \n\nAge is the greatest risk factor for cancer, as is for heart disease, Alzheimer’s, COVID-19 and nearly all leading causes of death and suffering worldwide. Targeting aging in animal studies delays the onset of *all* of these age-related diseases, and may be the ideal strategy to mitigating the effects of each of these major diseases of our global aging population.",
            "title_similarity": "0.57284635",
            "sentiment_compound": -0.9944
        },
        {
            "id": "hc6rjeq",
            "score": -3,
            "text": "It's nice that they removed all comments that question this. Echo chambers always produce positive results.",
            "title_similarity": "0.356093",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hc8lnfp",
            "score": 0,
            "text": "Only the rich will benefit from it! Probably have a ridiculous price on it like a million dollars!",
            "title_similarity": "0.21259832",
            "sentiment_compound": 0.8011
        },
        {
            "id": "hdamss2",
            "score": 0,
            "text": "I thought this was about Mrna, looks like it turned into liberal pushy loaded comment thread about another pandemic called socialism, no doubt spurred bi millennials commenting about how many free lunches they THINK they are entitled to from the US Government,  from yhere mommy and daddies basement couch . LITTLE REALITY BREAK LOSERS WHERE DO YOU THINK ALL THST MONEY COMES FROM?? HARD WORKING TAXPAYERS LOSERS!!",
            "title_similarity": "0.4811753",
            "sentiment_compound": -0.7031
        },
        {
            "id": "hc4io7h",
            "score": 49,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc4y13i",
            "score": -19,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc53nzx",
            "score": -13,
            "text": "Fighting cancer with cancer",
            "title_similarity": "0.509678",
            "sentiment_compound": -0.9062
        },
        {
            "id": "hc5b2qm",
            "score": -13,
            "text": "Humans =/= mice, and most translational studies **do not work** based on this simple fact. Junk science.",
            "title_similarity": "0.5144942",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc58t67",
            "score": 1,
            "text": "Don’t you just LOVE paywalls?",
            "title_similarity": "0.27885327",
            "sentiment_compound": 0.7125
        },
        {
            "id": "hc58ylw",
            "score": 1,
            "text": "Soooooo when or if this works, the anti-vax folks.  Sorry, you said you didn’t trust it.",
            "title_similarity": "0.40002024",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hc590wr",
            "score": 1,
            "text": "Can someone name an effective therapy or treatment that was first discovered in mice?",
            "title_similarity": "0.67758656",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hc5jgbn",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc5n3yh",
            "score": 1,
            "text": "Wow. Same idea as CureVac company got from the beginning.\nNothing new.",
            "title_similarity": "0.28664958",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hc6axpy",
            "score": 1,
            "text": "Fantastic news! This mRNA tech is going to help us a lot!\n\nCOVID give it a boost.",
            "title_similarity": "0.37319893",
            "sentiment_compound": 0.8619
        },
        {
            "id": "hc6hm74",
            "score": 1,
            "text": "They already have vaccines for cancer and they are not very effective, not very optimistic about this tbh.",
            "title_similarity": "0.5188366",
            "sentiment_compound": -0.8537
        },
        {
            "id": "hc6hyp9",
            "score": 1,
            "text": "Hasn’t thc been shrinking tumors? But you can’t patent that so guess people will keep dying till we find another one",
            "title_similarity": "0.5896045",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc6zeb8",
            "score": -1,
            "text": "Applaud and cheer for the fact that animal trials preceded human trials for this particular vaccine …this time.",
            "title_similarity": "0.47036844",
            "sentiment_compound": 0.743
        },
        {
            "id": "hc7ttyy",
            "score": -1,
            "text": "Well if i have cancer i dont want none of that non fda approved cure in my body. Im highly suspicious that this cancer thing is out and magically there is a cure",
            "title_similarity": "0.42135638",
            "sentiment_compound": -0.8366
        },
        {
            "id": "hc4ndoi",
            "score": 16,
            "text": "How is the mRNA implemented in this?\n\nIs it a preventative vaccine that trains the immune system? If so, what is the mRNA coding for?\n\nOr is it a therapy that paints a target on active cancer cells by having them express a marker protein?\n\nEdit: I found this [this article](https://www.mdanderson.org/cancerwise/can-mrna-vaccines-like-those-used-for-covid-19-be-used-in-cancer-care.h00-159457689.html) that outlines a possible treatment for colorectal cancer where post-surgery there is a possibility that circulating tumor DNA (ctDNA) can still be in the patient’s body. The mRNA vaccine would be tailor made to train the immune system to recognize the protein products of the mutant ctDNA.",
            "title_similarity": "0.743405",
            "sentiment_compound": -0.8053
        },
        {
            "id": "hc50ip7",
            "score": 2,
            "text": "This is a lot harder problem to solve than COVID. Delivery tech for mRNAs are largely aspecific.  LNPs distribute everywhere, and no specifically to tumors.  That's great if you are dealing with an infectious disease, but not so great if you cannot specifically target cancer cells.  IIRC, from either a conference or a paper, something like a fraction of a percent of total mRNA that's delievered is actually translated.  That's highly inefficient, and even less so if you cannot specifically target cancer.  \n\nWhile there are strategies to include targeting mechanisms to deliver to cancer cells, they simply aren't widely used.  Moderna and Biotech had big pipelines for cancer therapies way before covid.  They do have candidates in the pipeline that will be delivered intratumorally, but the rest are delivered aspecifically.   Newer ideas for mRNAs are in the works such as self amplifying mRNAs which may make for better cancer vaccines due to the efficiency issue, but they also come with newer risks.  \n\nWait and see.  Cancer is orders of magnitude more difficult to treat than covid.",
            "title_similarity": "0.5760383",
            "sentiment_compound": -0.9442
        },
        {
            "id": "hc534kt",
            "score": 2,
            "text": "Moderna has already been in clinical trials for a very similar combination of mRNAs coding for cytokines...mRNA-2752: https://ascopubs.org/doi/abs/10.1200/JCO.2020.38.15_suppl.3092\n\nEdit: here is their preclinical paper: https://www.science.org/doi/abs/10.1126/scitranslmed.aat9143",
            "title_similarity": "0.7268723",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc54sc3",
            "score": 2,
            "text": "Poof. Then you never hear about it ever again",
            "title_similarity": "0.10620895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5drkc",
            "score": 2,
            "text": "I wonder if the ppl refusing the Covid vax would also refuse this…jk they’d be all over this bc cancer isn’t politicized like Covid",
            "title_similarity": "0.5025747",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hc5hxqc",
            "score": 2,
            "text": "The idea that there are probably people unwilling to get the vaccine but willing to champion mRNA therapy to fight cancer is making me sad and irrationally angry.",
            "title_similarity": "0.5731513",
            "sentiment_compound": -0.9528
        },
        {
            "id": "hc6qu5y",
            "score": -2,
            "text": "Why didn’t they just inject it directly into humans and skip the trials?",
            "title_similarity": "0.46132773",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc6xyn4",
            "score": -2,
            "text": "I’m a 32 year old recovering alcoholic and addict in community college and taking BIO one, which is basically 7th grade science, so if anyone has any questions, lmk",
            "title_similarity": "0.49018407",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc70ghh",
            "score": -2,
            "text": "But I thought no other areas of the body are effected by the COVID-19 vaccines other than for immunity itself. Now it seems that other areas of the body can be altered, in this case it was a positive effect but it’s a bit concerning to me that it’s influencing other functions unintentionally.",
            "title_similarity": "0.42552793",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hc4z9nu",
            "score": -9,
            "text": "Oh but aren't these the evil Capitolist that make profits how evil!! You can't have these types breakthroughs without huge profits these are not altruistic companies ok they want to make money and that's how you get these Breakthroughts and Vaccines",
            "title_similarity": "0.37241733",
            "sentiment_compound": -0.6698
        },
        {
            "id": "hc4o412",
            "score": 34,
            "text": "Thank goodness for this new technology. I feel blessed to benefit from the hard work of such brilliant men and women.",
            "title_similarity": "0.22827196",
            "sentiment_compound": 0.9413
        },
        {
            "id": "hc52g8m",
            "score": 3,
            "text": "https://molecular-cancer.biomedcentral.com/articles/10.1186/s12943-021-01348-0",
            "title_similarity": "0.5989601",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc558ga",
            "score": 2,
            "text": "God, I wish humans were alike enough to mice that this would actually indicate something.",
            "title_similarity": "0.48114872",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hc58ukd",
            "score": 4,
            "text": "okay but have they even tried horse dewormer?",
            "title_similarity": "0.27919146",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hc6ftfa",
            "score": -2,
            "text": "Does the therapy come with a free Windows subscription?",
            "title_similarity": "0.29047698",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hc45zy6",
            "score": -48,
            "text": "Who's running the trials?",
            "title_similarity": "0.36278337",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc4746e",
            "score": 37,
            "text": "This is fantastic news.",
            "title_similarity": "-0.00013587065",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hc4uwnf",
            "score": 88,
            "text": "COVID, if you help cure cancer, maybe we’ll call it even you SOB.",
            "title_similarity": "0.59186214",
            "sentiment_compound": -0.6633
        },
        {
            "id": "hc5cjz9",
            "score": -4,
            "text": "If cancer is removed and there's no signs of it why wouldn't this vaccine work for that person? Is it because if you get it once you will get it again for sure? Like can someone live a long life and never see it come back?",
            "title_similarity": "0.5619993",
            "sentiment_compound": -0.5171
        },
        {
            "id": "hc6ija6",
            "score": -3,
            "text": "Ohno, not another mRNA , that's the technology behind the COVID-19 vaccine....what are these scientists and governments trying to do to us?",
            "title_similarity": "0.5106966",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc4tvfb",
            "score": 17,
            "text": "I have a pre-cancerous condition, and I've always just assumed it would turn into cancer before I'm 50 and I'd die. It's really grim, but the odds are decent.\n\nI can't even imagine being able to take a vaccine and stop worrying about it. Would be insane.",
            "title_similarity": "0.5315021",
            "sentiment_compound": -0.9245
        },
        {
            "id": "hc6ai4r",
            "score": -4,
            "text": "Isnt it crazy how a medicine for one illness can also be effective for a completely different one?",
            "title_similarity": "0.38737553",
            "sentiment_compound": 0.3476
        },
        {
            "id": "hc4hwxd",
            "score": 131,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc51igb",
            "score": -5,
            "text": "But do you have to keep taking it every 6 months? Honest question",
            "title_similarity": "0.2759375",
            "sentiment_compound": 0.6652
        },
        {
            "id": "hc5ej8r",
            "score": -7,
            "text": "Trials?  Trials???  Who needs trials????",
            "title_similarity": "0.363173",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc59tx5",
            "score": 20,
            "text": "Can’t wait for the antivax weirdos to reject a cure for cancer",
            "title_similarity": "0.5713829",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hc4sh9u",
            "score": 7,
            "text": "I wonder how long trials like this last and if it can help with metastisized colon cancer...",
            "title_similarity": "0.6344122",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hc5e2sh",
            "score": -8,
            "text": "They need to make sure there is no reason to question this as a therapy. They have to meticulously document everything and provide complete transparency with regards to data collection and methodology. If they don't, people will refuse therapy because they won't trust it.",
            "title_similarity": "0.3659855",
            "sentiment_compound": -0.1813
        },
        {
            "id": "hc5u94d",
            "score": 7,
            "text": "This is a study in mice and like many studies done in mice they usually don’t translate. It’s fine to cheer up but there are so many studies every year that never translate that one should pick up what to be really excited about.",
            "title_similarity": "0.5150102",
            "sentiment_compound": 0.7808
        },
        {
            "id": "hc4uco3",
            "score": 10,
            "text": "This is what these mRNA technologies were originally developed for. Testing this on humans and cancer goes back to 2008",
            "title_similarity": "0.69319195",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc4v80d",
            "score": 8,
            "text": "Hell yeah, if there's one thing COVID did good on was advancing mRNA research",
            "title_similarity": "0.5176811",
            "sentiment_compound": -0.128
        },
        {
            "id": "hc44nb2",
            "score": 155,
            "text": "mRNA and the protein folding solutions will evolve life to custom levels.",
            "title_similarity": "0.56136215",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hc4mwoo",
            "score": 54,
            "text": "Im skipping ahead here, but does this possibly mean a future cancer vaccine is possible?",
            "title_similarity": "0.5447127",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hc5avnz",
            "score": -12,
            "text": "And all it costed was experimentation on millions of innocent people.",
            "title_similarity": "0.47132346",
            "sentiment_compound": 0.34
        },
        {
            "id": "hc4ut18",
            "score": -11,
            "text": "I never don't use no MNRA therapy! IVERMECTIN CURES EVERYTHING",
            "title_similarity": "0.32628736",
            "sentiment_compound": -0.238
        },
        {
            "id": "hc4atc7",
            "score": 496,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc4oxa9",
            "score": 175,
            "text": "It's happening.  The medical renaissance is upon us!",
            "title_similarity": "0.37145418",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc52e9i",
            "score": 245,
            "text": "If COVID ends with a cure for cancer I'm considering all of the last 2 years a win, and I will absolutely fight for this opinion.",
            "title_similarity": "0.55404973",
            "sentiment_compound": -0.5413
        },
        {
            "id": "hc4t463",
            "score": 419,
            "text": "For the lay person…\n\nThis is likely going to be *very* long game technology when it comes to Oncology therapeutics. It’s probably going to be another 15 years before a commerically viable mRNA cancer drug makes it to the market. We’ve had success with mRNA vaccines recently but that doesn’t mean it’s going to be super quick to make it to other areas. \n\nIt took us a *very* long time to nail monoclonal antibody based therapy agents and we’ve only just scratched the surface of that technology. However these “immunotherapy” agents (broadly speaking) have been game changing in Oncology. I’ve seen so many success stories with *Keytruda* and *Kadcyla* it’s honestly been great already in the last four years.\n\ne: A lot of people are getting hung up on that 15 years number. The absolute fastest the average drug can make it through the FDA is about 7-8 years from start to finish. (Barring very special cases.) That’s *if* you have a completed drug ready to go from the start. That’s not including any set-backs or issues. This part is really difficult to explain but I recommend googling any drug that’s been patented and sold in the last 5 years for more information. \n\nAnyway, we’re not even to that particular point yet. We still need to design a drug to utilize mRNA technology. That drug needs to be sponsored and approved. That drug needs to meet manufacturing challenges. That drug needs to get support from CMS and insurance companies. Lastly that drug needs to be prescribed by oncologists which may be under very strict indications. \n\n15 years is not unreasonable for a new technology to take hold. The first mRNA vaccine technology was demonstrated in 2005. Obviously COVID lit a fire under our ass but it did take 15 years to find the perfect cause for us to make the vaccine technology official. Keytruda (the most popular MAB Anti-Neoplastic) took 8 years to approve finally ending in 2017. It took two to three years to see it widely offered in the US. 10 years total.",
            "title_similarity": "0.62371373",
            "sentiment_compound": 0.9908
        },
        {
            "id": "hc46uug",
            "score": 620,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc4r109",
            "score": 65,
            "text": "With all the supposed cancer breakthroughs that have been reported on in the past few years, this one, by FAR, has me the most hopeful for the future of cancer medicine.",
            "title_similarity": "0.5309916",
            "sentiment_compound": -0.7357
        },
        {
            "id": "hc4mc75",
            "score": 943,
            "text": "A lot of rare loss of function diseases could be treated with mRNA therapies, and since the platform is so generalisable it should be incredibly affordable in terms of development and production no matter how few people actually have it. We could be seeing the start of a movement in medicine where diseases like ~~MS~~ duchennes no longer mean an early death.\n\n&#x200B;\n\nEdit : [Except we're still a ways off](https://www.reddit.com/r/science/comments/pkkhqa/mrna_cancer_therapy_now_in_human_trials_after/hc8gypx?utm_source=share&utm_medium=web2x&context=3)",
            "title_similarity": "0.62081003",
            "sentiment_compound": -0.7162
        },
        {
            "id": "hc4s95d",
            "score": 258,
            "text": "If this allows the immune system to recognize cancer cells and destroy them, would this technology supplant CAR-T cell therapy? \n\nSounds like mRNA therapy would be a lot simpler than taking T-cells out, add chimeric receptors, and then injecting them back in.",
            "title_similarity": "0.6910392",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hc450y1",
            "score": 12465,
            "text": "People have no idea just how game changing mrna therapeutics are. The one good to come from covid was the accelerated support it received",
            "title_similarity": "0.45758533",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hc4l4hh",
            "score": 1019,
            "text": "anyone have a link to a free version of the article",
            "title_similarity": "0.17107227",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hc4ymw1",
            "score": 750,
            "text": "Curing cancer will be the greatest victory ever accomplished. We all suffer from it in some way.",
            "title_similarity": "0.41180652",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hc4qqpw",
            "score": 1981,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc4qfv9",
            "score": 2102,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc4t9ll",
            "score": 278,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc4qi19",
            "score": 10,
            "text": "I’m so happy this tech is taking off. Seems like updates for your immune system. I’m not at the age where I need a lot of medical attention but 20 years from now I probably will so it’s nice knowing I don’t have to use conventional medicine.",
            "title_similarity": "0.45826104",
            "sentiment_compound": 0.8387
        },
        {
            "id": "hc4qj3w",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc4ra1z",
            "score": 1,
            "text": "Anyone got the link / know the title and authors of this paper ? It’s behind a paywall so can’t see it.",
            "title_similarity": "0.3266305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc4rgbs",
            "score": 45,
            "text": "So I thought the problem with fighting “cancer” is that cancer isn’t just one thing.  There are lots of different types and issues and one treatment doesn’t kill all. What cancer is this treating?",
            "title_similarity": "0.54033816",
            "sentiment_compound": -0.9623
        },
        {
            "id": "hc4sl7p",
            "score": 2,
            "text": "There are a handful of non-profits that support research like this. [The Alliance for Cancer Gene Therapy](https://acgtfoundation.org/) is small but funded early research that helped develop CAR T cell therapies.",
            "title_similarity": "0.6613191",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hc4t9r0",
            "score": 1,
            "text": "Yo shoutout to my new bio teacher for talking about this in class just after our first DNA/RNA lab. \n\nVery interesting stuff.",
            "title_similarity": "0.57835746",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hc4tg4l",
            "score": 1,
            "text": "Mice and scientists are awesome, thanks mice and scientists!",
            "title_similarity": "0.4813308",
            "sentiment_compound": 0.807
        },
        {
            "id": "hc4uwu6",
            "score": 1,
            "text": "As someone with stage 4, this is VERY exciting news.",
            "title_similarity": "0.13968757",
            "sentiment_compound": 0.64
        },
        {
            "id": "hc4v134",
            "score": 1,
            "text": "Damn. I thought the horse dewormer was the cancer cure.",
            "title_similarity": "0.56230634",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hc4v478",
            "score": 1,
            "text": "Ok reddit tell me why this won’t work",
            "title_similarity": "0.32124114",
            "sentiment_compound": 0.296
        },
        {
            "id": "hc4v5dg",
            "score": 1,
            "text": "Anti-vaxxers we hardly knew ye.",
            "title_similarity": "0.17449763",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc4ve11",
            "score": 15,
            "text": "Too late for my mom but I hope this is as game changing as it sounds",
            "title_similarity": "0.3622173",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hc4vhsw",
            "score": 1,
            "text": "That and the Trump supporters dying off.  Kidding!",
            "title_similarity": "0.30093756",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hc4voua",
            "score": 1,
            "text": "Sucks for the unvaccinated",
            "title_similarity": "0.06840019",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hc4vp1o",
            "score": 1,
            "text": "Something has to be done about the tumors in the shrinking mice.",
            "title_similarity": "0.7045347",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc4vpyi",
            "score": 1,
            "text": "Always been convinced that cancer could be cured, but some people will find a reason to deny its existence.",
            "title_similarity": "0.5029381",
            "sentiment_compound": -0.6059
        },
        {
            "id": "hc4vqlj",
            "score": 1,
            "text": "Edit: Forgot I can’t make jokes here. So let’s just change my comment to… cool.",
            "title_similarity": "0.307495",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hc4vstk",
            "score": 1,
            "text": "Could be a huge step forward",
            "title_similarity": "0.03401289",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hc4vtje",
            "score": 1,
            "text": "But do we know what's in this cancer treatment!?!  I think I'd rather drink bleach because I know what that is!",
            "title_similarity": "0.5636873",
            "sentiment_compound": -0.8821
        },
        {
            "id": "hc4vzcb",
            "score": 228,
            "text": "[removed]",
            "title_similarity": "0.09645167"
        },
        {
            "id": "hc4w3a2",
            "score": 1,
            "text": "Can't wait to never hear about this again!",
            "title_similarity": "0.19301674",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc4w4qi",
            "score": 1,
            "text": "Interesting, this has potential. I made a drug candidate that cured mice 100% but it died in clinic.  Mouse models don't translate to humans often, generally you have some higher level animal models like a cyno model.",
            "title_similarity": "0.6979214",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hc4w56f",
            "score": 1,
            "text": "I have melanoma. I want this to work out.",
            "title_similarity": "0.49366808",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hc4w97m",
            "score": 1,
            "text": "I wonder how the anti-vax community will feel about this if they’re unlucky enough to get cancer?",
            "title_similarity": "0.5447869",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc4wcrn",
            "score": 1,
            "text": "Mrna vaccines started in cancer. This isn’t new in the slightest",
            "title_similarity": "0.5821986",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc4wgyt",
            "score": 1,
            "text": "Yeah, we’ve had AIDS for decades and no vaccine. Now this mRNA tech must be the Second Coming of Christ. Just hope it doesn’t fucks us up beyond salvation. Fingers crossed.",
            "title_similarity": "0.5439598",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hc4woqu",
            "score": 1,
            "text": "I'd RaThEr DiE fRoM cAnCeR tHaN gEt My DnA aLtErEd \n\nSorry, just see this happening.",
            "title_similarity": "0.5414115",
            "sentiment_compound": -0.8625
        },
        {
            "id": "hc4wqpy",
            "score": 1,
            "text": "What is the official word from vaccine deniers?",
            "title_similarity": "0.40518332",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hc4x0sy",
            "score": 1,
            "text": "They had this technology for many years. Where was the research then",
            "title_similarity": "0.31818634",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc4x2gh",
            "score": 1,
            "text": "Can someone familiar with mRNA tell me if this technology/approach was already in use before COVID? It feels as if we’re suddenly super hyphie about it.",
            "title_similarity": "0.54598594",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hc4x87m",
            "score": 1,
            "text": "Wow. This actually turns me on.",
            "title_similarity": "0.0812417",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hc4x8km",
            "score": 1,
            "text": "Glenn has the fastest mouse",
            "title_similarity": "0.29836547",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc4xdx6",
            "score": 1,
            "text": "How come this one is called cancer therapy and not cancer vaccine?",
            "title_similarity": "0.44555658",
            "sentiment_compound": -0.2225
        },
        {
            "id": "hc4xfi8",
            "score": 1,
            "text": "Can you post a link that is not 4 sentences restating the title?",
            "title_similarity": "0.2089599",
            "sentiment_compound": -0.0382
        },
        {
            "id": "hc4xljz",
            "score": 1,
            "text": "Haters will say it's fake",
            "title_similarity": "0.25700635",
            "sentiment_compound": -0.743
        },
        {
            "id": "hc4xmet",
            "score": 1,
            "text": "The full article is paywalled?",
            "title_similarity": "0.31890988",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc4xnes",
            "score": 1,
            "text": "I wonder how this would/could work for NF. I don’t have cancer, but my tumors could become cancerous or as more develop, a cancerous one could form.",
            "title_similarity": "0.56223065",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hc4xqcx",
            "score": 1,
            "text": "Remember, we standing on the shoulders of giants who stand on the shoulders of giants. We have already discovered nuclear weapons and understand the plausibility of genetically engineered weapons. This next level of technology we step onto could make or break us forever.\n\nBe careful and test test test! Debate the ethics!",
            "title_similarity": "0.44674522",
            "sentiment_compound": -0.6988
        },
        {
            "id": "hc4y1w0",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14778939"
        },
        {
            "id": "hc4y2jl",
            "score": 1,
            "text": "Can’t wait to never hear about this again",
            "title_similarity": "0.18840335",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc4y2uy",
            "score": 1,
            "text": "As man that worked with mRNA (admittedly not above master’s level) the possibilities of this tech are incredible. The stuff we’re doing now was just theory in 2013. mRNA is a modern medical miracle.",
            "title_similarity": "0.54606134",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hc4ycz3",
            "score": 1,
            "text": "Should we allow people who spread COVID mRNA vaccination misinformation on social media, and made the hate for the technology the center point of their personality during a global pandemic, access to this treatment?",
            "title_similarity": "0.5464214",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hc4yfnu",
            "score": 1,
            "text": "Just in time for me to hopefully not die from cancer if I get it from smoking for 15 years. Thanks scientists not god.",
            "title_similarity": "0.48046958",
            "sentiment_compound": 0.8872
        },
        {
            "id": "hc4yqr2",
            "score": 1,
            "text": "What’s a good mRNA company to invest some money into??",
            "title_similarity": "0.45081577",
            "sentiment_compound": 0.504
        },
        {
            "id": "hc4yquf",
            "score": 1,
            "text": "What if someone’s genome is severely damaged? Like DNA damage from smoking, drinking, UV exposure, etc. I’m a biochemistry grad and work in pharmaceutical manufacturing I haven’t gotten a consistent answer on this?",
            "title_similarity": "0.5903281",
            "sentiment_compound": -0.7882
        },
        {
            "id": "hc4ysba",
            "score": 1,
            "text": "Soon the right wing propaganda spreaders are gonna be saying “since it’s mRNA, you shouldn’t do the cancer therapy. Go die instead”. My family listens to lots of that stuff, so I know all the lies that are being spread around. Basically what these people say is that the vaccines make you spread a new “disease or variant” and other weird garbage. I just hope this therapy works for people out there.",
            "title_similarity": "0.64922416",
            "sentiment_compound": -0.8979
        },
        {
            "id": "hc4yv0m",
            "score": 1,
            "text": "They've been doing this for a while now. The article is poorly written. Which kind of cancer? Which mutations is it targeting?",
            "title_similarity": "0.599054",
            "sentiment_compound": -0.723
        },
        {
            "id": "hc4yz9o",
            "score": 1,
            "text": "Wow, that's pretty exciting. I feel like every few years you hear about something like this but nothing solid ever comes from it. Hope this is a game changer.",
            "title_similarity": "0.35296088",
            "sentiment_compound": 0.8829
        },
        {
            "id": "hc4z27h",
            "score": 1,
            "text": "https://oralee.org/\n\nJust gonna drop this link here as well. I have hopes for this research as well",
            "title_similarity": "0.46249926",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hc4z7yl",
            "score": 2,
            "text": "I think most of the work in the last decade has been on use in cancer treatment. I'm not sure, but mostly animal models. The vaccine opportunity probably only came along because of US govt support in vaccine development. I seem to recall the biggest problems were developing a lipid carrier for the RNA so that it was accepted by the body. In 2019 there was already talk of this being Nobel prize winning stuff. I hope they crack it for all of you sufferers.",
            "title_similarity": "0.68712395",
            "sentiment_compound": 0.9345
        },
        {
            "id": "hc4z89k",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14778939"
        },
        {
            "id": "hc4z98x",
            "score": 1,
            "text": "cannabis been shrinking tumors for years but nobody cares.",
            "title_similarity": "0.34230614",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hc4zm1v",
            "score": 1,
            "text": "I always thought dsrRNA was gonna do tye trick.\n\nIs it related to that?",
            "title_similarity": "0.3282581",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hc4zske",
            "score": 1,
            "text": "And…. the scientists/researchers will “disappear” momentarily",
            "title_similarity": "0.39176264",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc4zsl1",
            "score": 1,
            "text": "Will it be affordable for Americans!!!!",
            "title_similarity": "0.15063122",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc4ztmn",
            "score": 1,
            "text": "And it means nothing, cancer is big business for pharmaceutical companies, there's no way they find a cure......ever",
            "title_similarity": "0.34065217",
            "sentiment_compound": 0.3217
        },
        {
            "id": "hc4zvtn",
            "score": 1,
            "text": "So like if it works, will all the COVID vaccine haters finally admit that mRNA is OK?",
            "title_similarity": "0.62572175",
            "sentiment_compound": 0.101
        },
        {
            "id": "hc502vy",
            "score": 1,
            "text": "Finally. Man living in the past sucks!",
            "title_similarity": "0.20175579",
            "sentiment_compound": -0.4199
        },
        {
            "id": "hc50581",
            "score": 1,
            "text": "All antivaxers should be exempt from using any mRNA therapies.",
            "title_similarity": "0.3632797",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hc50cap",
            "score": 1,
            "text": "I wonder......would these people who demonize the covid vaccine because they think mRNA changes your DNA refuse to get this therapy if they have cancer that can be treated by it?",
            "title_similarity": "0.5971162",
            "sentiment_compound": -0.765
        },
        {
            "id": "hc50d1m",
            "score": 1,
            "text": "A lot of blind optimism in these comments, I would love some analysis from someone who understands what this represent. We've seen articles with supposed breakthrough in cancer for decades now, but ultimately they are often hot air and don't lead to anything concrete. mRNA is having the spotlight right now because of the covid vaccine, but how well does it really apply to cancer treatment? Is it a real big deal or just another fluff?",
            "title_similarity": "0.6331228",
            "sentiment_compound": -0.7101
        },
        {
            "id": "hc50dbn",
            "score": 1,
            "text": "This isn’t really very new.  The clinical trials for mRNA “vaccines” for cancer started a few years ago.",
            "title_similarity": "0.64331955",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc50eiv",
            "score": 1,
            "text": "mRNA is an amazing technology and I'm so glad it's being developed. Unfortunate that it took a global pandemic for humanity to finally push this technology forward. But, still a great technology and advancement",
            "title_similarity": "0.464308",
            "sentiment_compound": 0.8585
        },
        {
            "id": "hc50iol",
            "score": 1,
            "text": "Can mRNA vaccines trigger cancers?",
            "title_similarity": "0.6403154",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc50ith",
            "score": 3,
            "text": "For people seeking more information on this technology:\n\n[https://www.genentechoncology.com/development-platforms/individualized-neoantigen-specific-immunotherapy.html](https://www.genentechoncology.com/development-platforms/individualized-neoantigen-specific-immunotherapy.html)\n\nhttps://biontech.de/science/platforms\n\nand on-going clinical trials with it:\n\n[https://www.genentechoncology.com/pipeline-molecules/inest.html](https://www.genentechoncology.com/pipeline-molecules/inest.html)",
            "title_similarity": "0.662704",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc50kf9",
            "score": 1,
            "text": "I’ve discussed this with some other medical professionals and I solidly believe the use of mRNA treatment will be a revolution on par with flight, antibiotics, microchips, etc. \n\nIt’ll be a significant science discovery in a Civilization game.",
            "title_similarity": "0.6419761",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hc50m97",
            "score": 1,
            "text": "Is it gonna be affordable tho.",
            "title_similarity": "0.041327298",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc50w7f",
            "score": 1,
            "text": "I just keep thinking about my grandma and how quickly the doctors just gave up on her when she got cancer.  If she had just been given a couple years to make it this far instead of a couple days...",
            "title_similarity": "0.58056307",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc50zw2",
            "score": 1,
            "text": "Man. Bill Gates is now implanting chips in cancer patients !?! That is low.",
            "title_similarity": "0.67538947",
            "sentiment_compound": -0.7955
        },
        {
            "id": "hc511s2",
            "score": 1,
            "text": "Shout-out to the mice and other lab animals who went through these, and similar trials. I hope people think about them sometimes when taking medication or recieving treatment; they go through a lot so that we can have effective and safe pharmaceuticals.",
            "title_similarity": "0.727315",
            "sentiment_compound": 0.836
        },
        {
            "id": "hc5130l",
            "score": 1,
            "text": "queue the freedumb people that would rather have cancer",
            "title_similarity": "0.5065526",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc514bb",
            "score": 1,
            "text": "This is not new, this is actually where mrna vaccines developed from, not the other way around.",
            "title_similarity": "0.38155758",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5180v",
            "score": 1,
            "text": "All those gene therapy folks are in shambles.",
            "title_similarity": "0.37702492",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc51ccx",
            "score": 1,
            "text": "I wonder if anti vax people would be opposed to a cancer vaccine?",
            "title_similarity": "0.5080347",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hc51lfd",
            "score": 1,
            "text": "Fingers crossed on this one.",
            "title_similarity": "0.015734583",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc51rc6",
            "score": 1,
            "text": "The people who don’t like mRNA vaccines likely won’t get treatment\n\nThin the herd baby!",
            "title_similarity": "0.45947105",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hc51vew",
            "score": 1,
            "text": "Sigh. I've tried to extoll the virtues of mRNA vaccines and how lucky we are they were ready for humans recently. Without a decade+ of research into them we could still be waiting for a Covid vaccine. \n\nThe same people who swore how they didn't trust the Covid vaccine will not hesitate to take mRNA cancer vaccines in a decade, guaranteed.",
            "title_similarity": "0.6284059",
            "sentiment_compound": 0.1561
        },
        {
            "id": "hc51z3p",
            "score": 1,
            "text": "Too bad no one will take it",
            "title_similarity": "0.040319048",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hc51zxe",
            "score": 1,
            "text": "People are shitting on mRNA science, but fail to realize the research is damn near old enough to drink.\n\nOf we had to develop a Covid vaccine the traditional way, we'd be what... another year or two out?",
            "title_similarity": "0.55314213",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hc52wg9",
            "score": 1,
            "text": "Have we considered shrinking the mice and sending them in after the tumors?",
            "title_similarity": "0.7303568",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc534fg",
            "score": 1,
            "text": "Wall Street Conspiracy documentary is what I thought of when I saw this post. It’s free online so please take a look. It’s old but gold. We must protect this at all costs!",
            "title_similarity": "0.35480428",
            "sentiment_compound": 0.6639
        },
        {
            "id": "hc53lzi",
            "score": 1,
            "text": "\"Trade a tumor for a microchip?? I think not.\"  \n--Some anti-vaxxer probably",
            "title_similarity": "0.6191702",
            "sentiment_compound": -0.4515
        },
        {
            "id": "hc53mpz",
            "score": 1,
            "text": "Can’t wait to see how many people that wouldn’t get the covid vaccine will line up for this experimental gene therapy cancer treatment",
            "title_similarity": "0.70300555",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc53n2n",
            "score": 1,
            "text": "Dear Science, \n\nPlease do MS next. I would be so grateful. Sorry for interrupting this dope ass news about cancer.",
            "title_similarity": "0.6308304",
            "sentiment_compound": -0.4427
        },
        {
            "id": "hc53xgv",
            "score": 1,
            "text": "I bet no one turns this down because they “don’t know what’s in it.”",
            "title_similarity": "0.10307863",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc549sq",
            "score": 1,
            "text": "Psa: if you guys are gamers that can spare some throughput from your graphics card run [\"folding @ home.\"](https://foldingathome.org/?lng=en-US)",
            "title_similarity": "0.46594918",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc54md4",
            "score": 1,
            "text": "This is just the start..... and the advance is expected to excel as blazing speed. The question will be.... should we?",
            "title_similarity": "0.21127482",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hc54myy",
            "score": 1,
            "text": "Thank you for sharing this!",
            "title_similarity": "0.08840973",
            "sentiment_compound": 0.68
        },
        {
            "id": "hc54p1x",
            "score": 1,
            "text": "Even though for my cancer I've missed it by, well, however long until this is generally approved... good. I really hope this takes off.\n\nAnd selfishly if mine recurs this will help me so I can still be a selfish bastard here. :)",
            "title_similarity": "0.5282353",
            "sentiment_compound": 0.024
        },
        {
            "id": "hc5556k",
            "score": 3,
            "text": "I don’t have the access to read this article, can someone help me out with a summary of the highlights?",
            "title_similarity": "0.28141278",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hc55j7v",
            "score": 1,
            "text": "Well possibly the only good thing from COVID. I told my hubby just watch, this will create a lot of technological advances in medicine. We had become stagnant and we needed a push. Sad it took a pandemic.",
            "title_similarity": "0.61314005",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hc55qsn",
            "score": 1,
            "text": "Oh man, this is SICK! Gonna be awesome!",
            "title_similarity": "0.12556879",
            "sentiment_compound": 0.1658
        },
        {
            "id": "hc55vbk",
            "score": 1,
            "text": "It was all started by a mouse.",
            "title_similarity": "0.46846533",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc55yr2",
            "score": 1,
            "text": "Why does the article say, \"completely shrunk the tumor\" - to my novice ears I read this as saying the tumor isn't eradicated, it's still there, just really small (doesn't that mean it can still grow back?)",
            "title_similarity": "0.61641484",
            "sentiment_compound": -0.6666
        },
        {
            "id": "hc563r6",
            "score": 1,
            "text": "Why not just release it with minimal trials since that's what they're doing with the f'n Covid vaccines.",
            "title_similarity": "0.5199859",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5660b",
            "score": 1,
            "text": "For the love of God, please make one for liver cancer!!!!",
            "title_similarity": "0.52959275",
            "sentiment_compound": 0.6562
        },
        {
            "id": "hc567wz",
            "score": 2,
            "text": "I am very curious how this actually works.  Because yes, cancer cells are obviously bad, but in actuality they are just... our cells, multiplying out of control, right?  What does the mRNA train the immune system to recognize?\n\nAnd since we're there, could this be applied to something like... clogged arteries?  Could we get mRNA to recognize cholesterol deposits in veins and undo a huge part of heart disease?",
            "title_similarity": "0.7091169",
            "sentiment_compound": 0.9377
        },
        {
            "id": "hc569mn",
            "score": 1,
            "text": "Let's make sure Anti Vax dont ever get their hands on this drug.  blah blah blah fake vaccine. HOW CAN AN MRNA VACCINE BE CREATED SO QUICK",
            "title_similarity": "0.58297575",
            "sentiment_compound": -0.3751
        },
        {
            "id": "hc56c1s",
            "score": 1,
            "text": "And yet people still won’t take the vaccine",
            "title_similarity": "0.18931887",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc56hu4",
            "score": 1,
            "text": "www.imugene.com.au are doing excellent work in this space. I'm a long holding investor (and all the waiting had started to pay off recently) because they were doing such exciting work with cancer vaccine technology. I'm very excited to hear about other developments from other researchers and companies! \n\nThe future is going to be amazing as these new technologies become standardised.",
            "title_similarity": "0.46755213",
            "sentiment_compound": 0.8353
        },
        {
            "id": "hc56onp",
            "score": 1,
            "text": "This is how we got the Crippen virus, folks...",
            "title_similarity": "0.48882177",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc56wpa",
            "score": 1,
            "text": "How effective will they be *in humans* is the big question. There's some cancer therapies that have been trialled in mice that don't work in humans because the cancer microenvironment is different (different receptors/modes of growth/different methods of immune evasion).",
            "title_similarity": "0.7139051",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hc57i3c",
            "score": 1,
            "text": "I don’t know much about what mRNA is, can someone elaborate, and if possible, explain how it’s a better treatment overall?",
            "title_similarity": "0.52393794",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc57rck",
            "score": 5,
            "text": "Imagine being against mRNA treatments …",
            "title_similarity": "0.46976662",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc57x3n",
            "score": 1,
            "text": "So it targets fast multiplying cells?",
            "title_similarity": "0.35272536",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc57yuz",
            "score": 1,
            "text": "So this means we accelerate CRISPR progress… right?",
            "title_similarity": "0.26336992",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc582r9",
            "score": 1,
            "text": "This would be cool if we didnt get an article like this every single year about some cancer/alzheimers cure that never comes to fruition",
            "title_similarity": "0.56058013",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hc58hvb",
            "score": 1,
            "text": "Why are articles like these allowed??? By this I mean articles that say nothing and charge you. All they're doing is collecting clicks.",
            "title_similarity": "0.33566988",
            "sentiment_compound": 0.466
        },
        {
            "id": "hc58pvj",
            "score": 1,
            "text": "Did they give the mice cancer for the experiment?",
            "title_similarity": "0.7554923",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc59720",
            "score": 1,
            "text": "holy crap this will literally change everyones lives..................",
            "title_similarity": "0.22192822",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hc5989g",
            "score": 1,
            "text": "Did they say what kind of cancer?",
            "title_similarity": "0.4784665",
            "sentiment_compound": -0.6901
        },
        {
            "id": "hc59m68",
            "score": 1,
            "text": "but they keep changing the story.. at first they said cancer wasnt curable.. now they're saying it is. why do they keep lying????\n\n\n\n(said with a healthy dose of sarcasm.. for the slow ppl in the back)",
            "title_similarity": "0.5532789",
            "sentiment_compound": -0.9092
        },
        {
            "id": "hc59yfh",
            "score": 1,
            "text": "here you go: \nhttps://www.outline.com/33FMgb",
            "title_similarity": "0.15862015",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5a2kz",
            "score": 1,
            "text": "Qustion for anyone who can answer. As a chem major/bio minor i was under the impression that cancer was generally a problem with dna replication? Why would mRNA help with this issue?",
            "title_similarity": "0.7032529",
            "sentiment_compound": -0.594
        },
        {
            "id": "hc5a6sv",
            "score": 1,
            "text": "I cant wait until i can start smoking again",
            "title_similarity": "0.19944732",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5a8n4",
            "score": 1,
            "text": "Godspeed for this. Bless those hands and minds.",
            "title_similarity": "0.13236687",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hc5afgq",
            "score": 1,
            "text": "What's the chance this becomes something besides the next hype?",
            "title_similarity": "0.16149649",
            "sentiment_compound": 0.25
        },
        {
            "id": "hc5azcy",
            "score": 1,
            "text": "i’m so pessimistic that i immediately think this article is going to go the way of every r/futurology article. front page and then we’ll never hear about it again",
            "title_similarity": "0.3628899",
            "sentiment_compound": -0.4201
        },
        {
            "id": "hc5b470",
            "score": 1,
            "text": "*Wired* has a very good popular science article on the history of the development of the mRNA vaccine technology and its potential future applications: https://www.wired.co.uk/article/mrna-vaccine-revolution-katalin-kariko",
            "title_similarity": "0.52552825",
            "sentiment_compound": 0.7408
        },
        {
            "id": "hc5bdoq",
            "score": 1,
            "text": "In my head, I see mRNA like when we moved from horses to cars. \nAnd that makes me happy although I don’t know if it’s even a good analogy, but it’s about transporting something and that’s the best I can think of.",
            "title_similarity": "0.39457542",
            "sentiment_compound": 0.8968
        },
        {
            "id": "hc5bj7o",
            "score": 3,
            "text": "soooo, if you opted out of the vaccine then you don't get this treatment if it end up being amazing, right?",
            "title_similarity": "0.3538165",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hc5cgax",
            "score": 1,
            "text": "This field has lots of companies that have been working in mRNA for so many different things.  By the end of this I wonder if I’ll be able to have designer drugs created to prevent all potential ailments I’m likely to get from genetic history and exposure.",
            "title_similarity": "0.7134198",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hc5cpp2",
            "score": 9,
            "text": "Not just mRNA! There have been a lot of advances in the sciences, I personally think it’s because no one was bugging the scientists.\nLook at the leaps in CRISPR just in the last year and a half.",
            "title_similarity": "0.45775044",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hc5cr4e",
            "score": 3,
            "text": "What's the name and maker please?  Can't pay to read sorry",
            "title_similarity": "0.29940182",
            "sentiment_compound": 0.3173
        },
        {
            "id": "hc5e1cy",
            "score": 3,
            "text": "How serious/likely is this anytime soon compared to the tons of other future cancer cures that pop up on r/futurology all the time",
            "title_similarity": "0.5097268",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc5emea",
            "score": 1,
            "text": "Big pharm must be lurking waiting to these posts bc i swear nothing comes from them",
            "title_similarity": "0.24374004",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hc5fn3t",
            "score": 1,
            "text": "So the upper class is also shrinking?",
            "title_similarity": "0.19451095",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5fnfp",
            "score": 4,
            "text": "So antivaxxers are going to eschew a possible cure for cancer, too?",
            "title_similarity": "0.5489718",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc5hhje",
            "score": 1,
            "text": "bUt wE dOnT kNoW wHaTs In iT!",
            "title_similarity": "-0.0039753467",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5htkx",
            "score": 29,
            "text": "I was just diagnosed with breast cancer and find the whole thing terrifying. I enjoy reading about things like this but become a little sad when I realize how far out the treatment may really be. Having said that, I do recognize how blessed I am that we have the treatments we do.",
            "title_similarity": "0.56031144",
            "sentiment_compound": 0.1128
        },
        {
            "id": "hc5hxyo",
            "score": 1,
            "text": "Any papers published on this? Link?",
            "title_similarity": "0.20621337",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5ig7j",
            "score": 2,
            "text": "Why don’t they update COVID vaccine with new variant RNA?",
            "title_similarity": "0.58244455",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5ir54",
            "score": 2,
            "text": "Let’s see if people will still prefer bracelets, horse dewormer and prayers.",
            "title_similarity": "0.31923085",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5j45e",
            "score": 1,
            "text": "And still no cure for hair loss",
            "title_similarity": "0.20234318",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hc5jbj7",
            "score": 2,
            "text": "cancer cure for everyone!   \nI hope they don't put a huge price tag on the cure if it's proven to be efficient.   \nAll humans have the right for treatment, no matter the nationality. \n\nHUMANS > MONEY",
            "title_similarity": "0.4746832",
            "sentiment_compound": -0.2565
        },
        {
            "id": "hc5jzjk",
            "score": 1,
            "text": "Technoblade: gets cancer\nScientists:",
            "title_similarity": "0.6643472",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc5k3nh",
            "score": 4,
            "text": "Sharing this on the FB groups that have soooo many articles on the horse dewormer being used for cancer as “proof” it can work for Covid.  Then I’m deleting FB.",
            "title_similarity": "0.7071153",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hc5k4jq",
            "score": 2,
            "text": "Targeted mRNA cancer treatments were in use for years? It's hella expensive as it's individual.",
            "title_similarity": "0.4770018",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc5kdtb",
            "score": 2,
            "text": "Och boy, here we go again.",
            "title_similarity": "0.09625781",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5lazm",
            "score": 2,
            "text": "Now, imagine if we funded medical research at the level of the vaccine development response…all the time.",
            "title_similarity": "0.5050278",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5m2ra",
            "score": 2,
            "text": "I wonder if science will make an mRNA therapy for hyperthyroidism, or more specifically, Graves Disease.",
            "title_similarity": "0.6682311",
            "sentiment_compound": -0.3566
        },
        {
            "id": "hc5mkyu",
            "score": 2,
            "text": "Guys PLEASE keep track of these developments. Because...you know... Big Pharma greedy",
            "title_similarity": "0.3298142",
            "sentiment_compound": 0.186
        },
        {
            "id": "hc5mzn2",
            "score": 2,
            "text": "anti-vaxxers: mRNA WILL KILL US ALL\n\nmRNA in reality:",
            "title_similarity": "0.4834988",
            "sentiment_compound": -0.7531
        },
        {
            "id": "hc5n3dx",
            "score": 2,
            "text": "The only good thing from CoVID: Rapid advances in mRNA research.",
            "title_similarity": "0.52987266",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc5n3q3",
            "score": 1,
            "text": "Probably a silly question but; how do they find all these mice with tumors/cancer?",
            "title_similarity": "0.7159376",
            "sentiment_compound": 0.0129
        },
        {
            "id": "hc5n9q4",
            "score": 1,
            "text": "technoblade never dies",
            "title_similarity": "0.14349607",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5o6pu",
            "score": 1,
            "text": "I know I I late, but an impotnt correction to the article. BioNTech does not now test if the mRNA vaccine can be used on cancer, that is their main project for years. They used their understanding of these researches to create the covid vaccine, not the other way around.",
            "title_similarity": "0.58857787",
            "sentiment_compound": -0.6652
        },
        {
            "id": "hc5p9qv",
            "score": 1,
            "text": "Lets just make a VR wargame for all the world's wars and we  just give those  unlimited funds for medical and world problem research.",
            "title_similarity": "0.48661548",
            "sentiment_compound": -0.743
        },
        {
            "id": "hc5pfjn",
            "score": 1,
            "text": "Similar to war times, this pandemic probably brought a fuckton of scientific innovation and breakthroughs with it!",
            "title_similarity": "0.51247936",
            "sentiment_compound": -0.3802
        },
        {
            "id": "hc5pq8l",
            "score": 1,
            "text": "It has been in trials with humans for at least 4 years by BioNTech but sure it’s “new”\n\nClinicalTrials.gov Identifier: NCT01684241\n\nhttps://clinicaltrials.gov/ct2/show/record/NCT01684241?view=record",
            "title_similarity": "0.53409356",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hc5ps5f",
            "score": 1,
            "text": "So basically nothing new it's the same cancer research from 2014, just now they want to use the production/manufacturing techniques not the lab ones.\n\n  \n\n\nAgain they still haven't fixed any of the previous issues of targeting just cancer cells or stimulating a specific imune response.\n\n  \n\n\nThey think they can get around those issues by injecting it only in hard tumours, and by producing the cytokine (bomb me) markers on-site.\n\n  \n\n\nThat's why I was having a hard time with the Covid ones as well, lack of specificity for cells and dosage uncertainty.\n\n  \n\n\nI'm glad they're finding a cheaper way to make these therapies available, hope the technology continues to develop.",
            "title_similarity": "0.5966277",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hc5pxjt",
            "score": 1,
            "text": "What's the point of removing every comment in this thread? So frustrating.",
            "title_similarity": "0.24513546",
            "sentiment_compound": -0.5777
        },
        {
            "id": "hc5r6yr",
            "score": 1,
            "text": "I wonder if the anti vaccers are going to reject this too if they get cancer because it's \"experimental\"",
            "title_similarity": "0.51991045",
            "sentiment_compound": -0.8555
        },
        {
            "id": "hc5rdnu",
            "score": 1,
            "text": "Those same antivaxxers that think MRNA hasn’t been practiced until 2020 when in all reality it’s been studied since the 90’s better hope they don’t get cancer because if so they’ll probably end up with some good MRNA",
            "title_similarity": "0.64289874",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hc5rxtn",
            "score": 1,
            "text": "I'm so happy to read how many new trials are now coming after the covid vaccine, it opens really a door to a new way to cure.",
            "title_similarity": "0.5014613",
            "sentiment_compound": 0.6115
        },
        {
            "id": "hc5t2j5",
            "score": 1,
            "text": "It's interesting that this thread contains jokes about treating COVID with animal dewormer when there are so many people who are NED after using dewormers in their metabolic cancer protocols.\n\nThere's a great reason that most don't mention it to our doctors and an even greater reason why the doctors who do know are not inclined to acknowledge it.\n\nThat does not change the fact that so many \"walking dead\" have clear scans after being riddled with stage 4 cancers.",
            "title_similarity": "0.64632773",
            "sentiment_compound": 0.4472
        },
        {
            "id": "hc5t7uc",
            "score": 1,
            "text": "~~Tomorrow~~ Mice never die\n\n**BANG!** _James Bond Music start_\n\n\nEdit: Joking aside, I can’t wait to see how it goes in humans",
            "title_similarity": "0.5034737",
            "sentiment_compound": 0.6529
        },
        {
            "id": "hc5ta1r",
            "score": 1,
            "text": "Oncophage has existed for awhile",
            "title_similarity": "0.1254639",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5teo7",
            "score": 1,
            "text": "Promising,  I definetely need to read more on mRNA therapeutics. I have been affected by family memebers who have have cancer and I honestly hope that there will be a cure one day.",
            "title_similarity": "0.7699331",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hc5tkzq",
            "score": 1,
            "text": "I might be reading this incorrectly, but this appears to be an ongoing treatment method, ie a regular injection. \n\nWould that mean that it would be administered as a prevention method, that would reduce load on the health system",
            "title_similarity": "0.5143821",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5u1ha",
            "score": 1,
            "text": "Hedge fucks preparing to short tf out of any company that has stock in this",
            "title_similarity": "0.38795474",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hc5v69a",
            "score": 2,
            "text": "If this ends up working, I am curious to see if the anti-vaxx crowd will be as opposed to it as they are to mRNA vaccines, or if they will just disappear in the face of the massive medical success that it would be. Surely, no amount of misinformation could dissuade someone to take a chance at curing cancer, even if they are skeptical.",
            "title_similarity": "0.55096805",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc5x66l",
            "score": 2,
            "text": "This is huge, I really hope that this does extremely well.\n\nFrom one of the sites:\n\n>”Estimated Primary Completion Date  :\nJune 2022\nEstimated Study Completion Date  :\nJanuary 2024”\n\nI hope it also completes sooner with great results.",
            "title_similarity": "0.32232854",
            "sentiment_compound": 0.9311
        },
        {
            "id": "hc5xa3o",
            "score": 1,
            "text": "Hey we can be cured of covid, cancer, and hiv (yea I know the hiv trails were stopped in humans) within the next 5 years and they can enjoy having their insides eaten by the cancer. I feel this is kinda setting up another caste system but of their own making.",
            "title_similarity": "0.64349604",
            "sentiment_compound": -0.5789
        },
        {
            "id": "hc5xays",
            "score": 1,
            "text": "Tpl bad the public company this is likely being tested through will be shorted to oblivion and this won't see the light of day",
            "title_similarity": "0.3791263",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hc5y10o",
            "score": 1,
            "text": "Hahahaha mRNA cancer therapy has been around for decades",
            "title_similarity": "0.5054463",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc5yils",
            "score": 1,
            "text": "Waiting on those but-cancer-is-god-given-gift-for-sins-folks.",
            "title_similarity": "0.5314264",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5yw6u",
            "score": 1,
            "text": "Don't tell those anti-vax people that Covid vaccines was the beginning of the end of cancer because they will be well furious...",
            "title_similarity": "0.47248352",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hc5zcv3",
            "score": 1,
            "text": "noT ME nO wAY nOT gImMe n0 sHRinkIng mOUSe GeNE tHerApY. mY mUnE sYstEM wILL fIGht iT oFf aLl By ItseLf",
            "title_similarity": "0.58941877",
            "sentiment_compound": -0.1808
        },
        {
            "id": "hc5zn1k",
            "score": 1,
            "text": "Would this technology work on blood cancers?",
            "title_similarity": "0.5828759",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc5zrin",
            "score": 1,
            "text": "Excited for this. Real practical applications are coming and soon.",
            "title_similarity": "0.2123541",
            "sentiment_compound": 0.34
        },
        {
            "id": "hc60akw",
            "score": 1,
            "text": "Curious to see if these anti covid vaccine people are still anti-vax knowing that this cancer therapy (which uses the same technology) could also potentially save their life of they get cancer",
            "title_similarity": "0.63514787",
            "sentiment_compound": -0.8151
        },
        {
            "id": "hc616ql",
            "score": 1,
            "text": "I guess this is the silver lining to Covid-19",
            "title_similarity": "0.26326558",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc61jp6",
            "score": 1,
            "text": "mRNA gonna literally cure cancer and some folks will still be mad about “gene therapy”",
            "title_similarity": "0.698677",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hc61qut",
            "score": 1,
            "text": "Moderna is trying a personalized mRNA cancer vaccine",
            "title_similarity": "0.7405894",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc636gb",
            "score": 1,
            "text": "Honey I shrunk the cancer",
            "title_similarity": "0.539764",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc64nzf",
            "score": 1,
            "text": "That’s cool. Honestly mRNA treatments look very promising when given adequate time for development",
            "title_similarity": "0.35082024",
            "sentiment_compound": 0.8479
        },
        {
            "id": "hc64vsz",
            "score": 1,
            "text": "Kadcyla, that’s what I’m on! Halfway through treatment now. My oncologist is super excited about this stuff",
            "title_similarity": "0.49997735",
            "sentiment_compound": 0.7644
        },
        {
            "id": "hc64wuq",
            "score": 1,
            "text": "mRNA?! You mean the freedom taker?!\n\nSarcasm (which should be obvious but it’s 2021 and those people be out there)",
            "title_similarity": "0.39239043",
            "sentiment_compound": 0.4756
        },
        {
            "id": "hc671ti",
            "score": 2,
            "text": "The m in mRNA should be changed to stand for miracle, it'll help the religious understand just how fantastically good this medical technology is.\n\nWe're just sending the body a chemically encoded recipe to cook up new proteins to allow our immune systems to attack and destroy targeted problems.",
            "title_similarity": "0.6546542",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hc67vnk",
            "score": 1,
            "text": "Be Careful, hedge funds might shut down this cancer research too just like they’ve done in the past. Curing cancer isn’t profitable",
            "title_similarity": "0.54647017",
            "sentiment_compound": -0.6858
        },
        {
            "id": "hc68o95",
            "score": 1,
            "text": "If someone is on stage 4, could they ask to be a trial subject...or do laws still prevent them from trying it out?",
            "title_similarity": "0.36398298",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hc68un4",
            "score": 1,
            "text": "So can someone ELI5 this and tell us why its not really as interesting as the title says?\n\nYou know. The usual, \"yeah this is super cool, but wont be possible until 2050\" type of stuff",
            "title_similarity": "0.30493897",
            "sentiment_compound": 0.453
        },
        {
            "id": "hc6ador",
            "score": 2,
            "text": "Shhh all the idiots were *almost* entirely distracted by abortion, let them forget what mRNA is first.",
            "title_similarity": "0.4283678",
            "sentiment_compound": -0.513
        },
        {
            "id": "hc6de9x",
            "score": 1,
            "text": "I wonder if it will be free and will I get donuts with this one?",
            "title_similarity": "0.3061802",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hc6eb4a",
            "score": 2,
            "text": "Try it on my dog he’s got a fat tumor on his right arm that makes it look like a massive bicep and I don’t want my dog having bigger biceps than me",
            "title_similarity": "0.456447",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hc6f4h3",
            "score": 2,
            "text": "“Shrinking Mouse Tumors” sounds like it could be a good band name.",
            "title_similarity": "0.59253836",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hc6h5nt",
            "score": 1,
            "text": "Wonder how many using mRNA as a reason not to get covid vaxxed will step on each other to get this.",
            "title_similarity": "0.56648695",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc6h9eq",
            "score": 1,
            "text": "Before covid trump said he wanted to cure hiv. Then covid struck and the mrna vaccine stuff came out. I was like “wow this could be trumps big break” but he decided to be all stupid like usual. He couldve had cancer curing hiv curing vaccines under his watch. Oh well. \n\n[trump wants a aids vaccine](https://time.com/5522766/trump-eliminate-hiv-experts/)",
            "title_similarity": "0.57511747",
            "sentiment_compound": -0.7615
        },
        {
            "id": "hc6i4vo",
            "score": 1,
            "text": "What a great day for mice!",
            "title_similarity": "0.29359156",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hc6ivuw",
            "score": 1,
            "text": "This is how you get me to finally take the jab",
            "title_similarity": "0.37927854",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc6iwr4",
            "score": 1,
            "text": "So the mouse has a tumor that shrinks it?",
            "title_similarity": "0.66079235",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hc6k0en",
            "score": 1,
            "text": "This upcoming few years will be crazy re Biotech + gen eng r&d",
            "title_similarity": "0.47443503",
            "sentiment_compound": -0.34
        },
        {
            "id": "hc6k35c",
            "score": 1,
            "text": "Some of these experiments are already in phase 2! While it's unlikely we're going to get them at the speed of the covid vaccine. This is real stuff that if it continues to work we WILL see in the next few years!",
            "title_similarity": "0.51602906",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc6kmcr",
            "score": 1,
            "text": "Technoblade is a pig so we're not too far off",
            "title_similarity": "0.34374115",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc6l06b",
            "score": 2,
            "text": "Yeah whoopie so in about 580 years it might be available for my father.",
            "title_similarity": "0.29938596",
            "sentiment_compound": 0.296
        },
        {
            "id": "hc6l3gj",
            "score": 1,
            "text": "This sounds like great news for anyone with mouse tumors.",
            "title_similarity": "0.47573507",
            "sentiment_compound": 0.765
        },
        {
            "id": "hc6lolk",
            "score": 1,
            "text": "Two awards were given 69 times…. Niceee.",
            "title_similarity": "0.21888313",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hc6lzox",
            "score": 1,
            "text": "Ok with me if anti-vaxxers choose to die of cancer. Gotta get rid of them some way if the pandemic is to end. Or, this could be an opportunity for them to change their minds.",
            "title_similarity": "0.58170974",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hc6m2ti",
            "score": 1,
            "text": "Now cancer in red states is going to be astronomically higher than on blue ones",
            "title_similarity": "0.27881235",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc6mdp6",
            "score": 1,
            "text": "I'm not gonna let some scientist use MRNA to get rid of my cancer and make me a drone. That'll ruin my freedom.",
            "title_similarity": "0.48943955",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hc6mpki",
            "score": 1,
            "text": "QAnon supporters and anti-vaxxers are going to edit themselves out of the gene pool.\n\nMaybe Ivermectin can fill the breach?",
            "title_similarity": "0.5840633",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hc6mxnn",
            "score": 1,
            "text": "Eww I didn't even know you could get mouse tumors, I thought they just contained like cells.",
            "title_similarity": "0.56180656",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hc6mz5q",
            "score": 1,
            "text": "Is there a better article or a link to the research? That website is cancer.",
            "title_similarity": "0.641277",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hc6o7jt",
            "score": 1,
            "text": "Hey, colon cancer. This is great, I've been diagnosed with Ulcerative Colitis.",
            "title_similarity": "0.57517153",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hc6o7zv",
            "score": 1,
            "text": "I guess the anti-vax anti-mask crowd will never receive any cutting edge medical treatments again.",
            "title_similarity": "0.41982764",
            "sentiment_compound": 0.0951
        },
        {
            "id": "hc6pa2p",
            "score": 1,
            "text": "All I am saying to anybody considering science. In particular biology (including Biochemistry and Molecular Biology), this is a burgeoning field to consider. There is a lot we don't know and are still learning. It is a good, competitive career with a lot of implications in the real world. As well as a chance to make grotesquely large salaries in the commercial sector to those who have experience.",
            "title_similarity": "0.49869674",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hc6ptu6",
            "score": 1,
            "text": "Next is figuring out true causes and preventing cancer before it begins.",
            "title_similarity": "0.6046494",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hc6rmq2",
            "score": 1,
            "text": "Just wait for the anti-vax crowd to somehow turn into anti-cancer treatment fanatics",
            "title_similarity": "0.60849226",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc6sevj",
            "score": 2,
            "text": "Can’t wait to never hear anything about this again",
            "title_similarity": "0.18258035",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc6sj80",
            "score": 1,
            "text": "And people were saying big pharma wouldn't fund this because they make too much from cancer therapy",
            "title_similarity": "0.45222694",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc6tll8",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.14778934"
        },
        {
            "id": "hc6u6j4",
            "score": 1,
            "text": "Scary to be the first few",
            "title_similarity": "0.12887226",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hc6uewb",
            "score": 1,
            "text": "Watch conservatives boycott it saying that \"Those pesky scientists are injected mouse DNA into your body\" or something like that",
            "title_similarity": "0.56445396",
            "sentiment_compound": -0.25
        },
        {
            "id": "hc6ugkq",
            "score": 1,
            "text": "How long till this disappears from the news cycle with no updates ever again?",
            "title_similarity": "0.27921033",
            "sentiment_compound": -0.6059
        },
        {
            "id": "hc6ujjl",
            "score": 1,
            "text": "Looks like they are in phase II trials for one treatment and phase I for a couple others.  This article is a tacit endorsement of supply side economics, where government support can help fuel innovation.  Curing Cancer was one of Videos campaign promises it would be amazing if he fulfilled it",
            "title_similarity": "0.6364018",
            "sentiment_compound": 0.9393
        },
        {
            "id": "hc6vfmg",
            "score": 1,
            "text": "Will this one have 802.11ax?",
            "title_similarity": "0.10933413",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc6vtg5",
            "score": 2,
            "text": "After billions of dollars, decades of research we can finally start tackling a real problem in people’s lives. This disease has taken so many people young and old.",
            "title_similarity": "0.5298257",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hc6xl7a",
            "score": 1,
            "text": "Big Pharma won't like losing money over chemotherapy products...",
            "title_similarity": "0.38727465",
            "sentiment_compound": 0.0191
        },
        {
            "id": "hc6xqg9",
            "score": 1,
            "text": "Don’t worry Wall Street and the banks will find a way to kill the stock of the company",
            "title_similarity": "0.37664998",
            "sentiment_compound": -0.8225
        },
        {
            "id": "hc6yuun",
            "score": 1,
            "text": "Ok but like did the mice have cancer or did we give it to them",
            "title_similarity": "0.71651644",
            "sentiment_compound": -0.5023
        },
        {
            "id": "hc705i9",
            "score": 1,
            "text": "I can see Will Smith showing up for this one",
            "title_similarity": "0.20306927",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc709nt",
            "score": 1,
            "text": "With all the potential mRNA therapy has, I’m pretty sure the researchers that created it will get a Nobel prize eventually.",
            "title_similarity": "0.51965725",
            "sentiment_compound": 0.8689
        },
        {
            "id": "hc715cd",
            "score": 2,
            "text": "I wonder how many anti vaxx idiots will end up taking this if it comes to market and they get cancer?",
            "title_similarity": "0.60237604",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hc72hsk",
            "score": 1,
            "text": "Sounds nice but I can't access this information. Scientific information that I am not allowed to read. I don't trust it at all.",
            "title_similarity": "0.23159513",
            "sentiment_compound": -0.3925
        },
        {
            "id": "hc72ij1",
            "score": 1,
            "text": "There are mouse tumors in human beings?",
            "title_similarity": "0.58527386",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc73sym",
            "score": 2,
            "text": "\"But I don't even know what's in that!\"\n\nNow pass me the chemo.",
            "title_similarity": "0.32516247",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc744i8",
            "score": 1,
            "text": "Dude NGL if they cure cancer the first thing I'm doing is picking up a pack of Camel No9 menthols...",
            "title_similarity": "0.54871595",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hc748qw",
            "score": 2,
            "text": "why are so many comments here removed?",
            "title_similarity": "0.24101755",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc74dc9",
            "score": 1,
            "text": "Is there a peer reviewed/published paper with the mouse results? Or even a press release with the pre-clinical data?",
            "title_similarity": "0.70058775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc74jw8",
            "score": 1,
            "text": "I love science so much",
            "title_similarity": "0.24570844",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hc74v3u",
            "score": 1,
            "text": "Really hope antivaxxers don’t get any form of treatment for anything since they are always tested on humans",
            "title_similarity": "0.3851086",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hc76ki1",
            "score": 1,
            "text": "Cool, now let’s do Alzheimer’s. There have been drugs in stage 3 for 10-15 years by this point, and it’s one of the most common old age killers.",
            "title_similarity": "0.4486751",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hc774iz",
            "score": 1,
            "text": "If I had terminal cancer I'd let them test it on me i mean.  What could go wrong? Dying twice?",
            "title_similarity": "0.64556134",
            "sentiment_compound": -0.8343
        },
        {
            "id": "hc77v73",
            "score": 1,
            "text": "So we know that cancer is curable. We know that big pharma makes profits off of cancer effectively making it a death sentence.\nWe know this massive vaccine experiment is to test MRNA vaccines to help with anti aging...\nBefore this human trial is finished.. they are now advocating that it can cure cancer.\n\nOkay.",
            "title_similarity": "0.6475867",
            "sentiment_compound": -0.8934
        },
        {
            "id": "hc77wwa",
            "score": 1,
            "text": "If mRNA cures cancer every covid death was worth it and it will only take a couple years to save more lives than covid took with this treatment",
            "title_similarity": "0.53466237",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hc782si",
            "score": 1,
            "text": "Regen BioPharma Inc $rgbp Mega Runner as Biotech Moves Towards “Pink Current” & Cancer Vaccine Patent Approved\n\nhttps://www.google.com/amp/s/microcapdaily.com/regen-biopharma-inc-otcmkts-rgbp-mega-runner-as-biotech-moves-towards-pink-current-cancer-vaccine-patent-approved/132685/%3famp",
            "title_similarity": "0.5880132",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hc78788",
            "score": 1,
            "text": "This is amazing news, hope it works well for the future. \nGene therapy does sound like it will be a game changer, especially personalised gene therapy. The future is promising",
            "title_similarity": "0.47310814",
            "sentiment_compound": 0.9186
        },
        {
            "id": "hc79zwk",
            "score": 1,
            "text": "Anyone know how to get past this site's paywall?",
            "title_similarity": "0.38939035",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7axzb",
            "score": 1,
            "text": "mRNA is the next Penicillin.",
            "title_similarity": "0.48778594",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7jcbq",
            "score": 1,
            "text": "That’s it Shrinking Mouse Tumors is my new garage rock band name.",
            "title_similarity": "0.57639617",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7jqaz",
            "score": 1,
            "text": "What next ? This sounds like a hard sell",
            "title_similarity": "0.09372345",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hc7lgf8",
            "score": 2,
            "text": "Can someone tell me what happened to these comments, feels a bit scummy?",
            "title_similarity": "0.31010658",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc7pv0w",
            "score": 3,
            "text": "i can still imagine people being against this cure for cancer becuase of mRNA. too much misinformation going around now is closing peoples minds it seems. I get litterally excited when i hear about new mRNA technology",
            "title_similarity": "0.6987492",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hc7sq2e",
            "score": 2,
            "text": "Damn we’ve really been sitting on mRNA research for who knows how many years and it’s turns out to be increíble stuff!",
            "title_similarity": "0.4319657",
            "sentiment_compound": -0.4574
        },
        {
            "id": "hc7vre4",
            "score": 3,
            "text": "What the hell happened to the top 4 comments?",
            "title_similarity": "0.2268303",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hc8546u",
            "score": 2,
            "text": "My youngest son, two years old, has Stage IV Rhabdomyosarcoma, and his tumor continued to grow through the chemo cycles he just went through. He's now considered High-Risk and has been put on the strongest possible protocol for his cancer.\n\nTrials like this give me real hope that he will survive, and we can only hope he'll still be here by the time mRNA cancer therapy gets to Phase II or III trials and he can use it.",
            "title_similarity": "0.6357653",
            "sentiment_compound": -0.296
        },
        {
            "id": "hc897ap",
            "score": 1,
            "text": "It amazes me after all the Terry Fox runs and the billions of dollars poured into research all of a sudden this miracle cure appears?  Bit fishy?",
            "title_similarity": "0.5084157",
            "sentiment_compound": 0.8426
        },
        {
            "id": "hc8fdhn",
            "score": 2,
            "text": "I'm calling it, people are going to say they aren't getting this treatment (if it does come out) because it was \"made too fast\".",
            "title_similarity": "0.38230824",
            "sentiment_compound": 0.0
        },
        {
            "id": "hc8huen",
            "score": 1,
            "text": "Thought it said moose",
            "title_similarity": "0.16713414",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcazw7c",
            "score": 2,
            "text": "That's not news from today. I made a presentation about that ongoing testing about 4 months ago",
            "title_similarity": "0.4006304",
            "sentiment_compound": 0.0
        },
        {
            "id": "hcko9cn",
            "score": 1,
            "text": "Should pass the law making all the antivaxxers ineligible for this unless they pay out of pocket.",
            "title_similarity": "0.3233916",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hcqqwbd",
            "score": 1,
            "text": "Couldn't read the link but as someone who lost hope and accepted my fate \n\nIt gave me some hope that I may have chance see my daughter growth much longer",
            "title_similarity": "0.45900404",
            "sentiment_compound": 0.9231
        },
        {
            "id": "hd5oxs4",
            "score": 1,
            "text": "Bro they couldn't do this before Norm's passing??!",
            "title_similarity": "0.20077242",
            "sentiment_compound": 0.0
        },
        {
            "id": "hflc5f8",
            "score": 1,
            "text": "i would rather stay human than alter my rna or dna. also there are many things that stop cancer..... www.mycancerstory.rocks",
            "title_similarity": "0.5902271",
            "sentiment_compound": -0.765
        },
        {
            "id": "hflc82c",
            "score": 1,
            "text": "the western medical system wont \"cure\" cancer...it makes too much money at a half a mill a patient you simpletons",
            "title_similarity": "0.41169995",
            "sentiment_compound": 0.0
        }
    ]
}