{
    "Criminalizing prostitution increases risks to sex workers and makes it harder to stop underage prostitution and sex trafficking.\n": [
        {
            "id": "he8nyvc",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.5103006",
            "sentiment_compound": 0.7088
        },
        {
            "id": "he8qgke",
            "score": 16,
            "text": "It's also gives predators a market in a capitalist society. I wonder what percentage of the women on Instagram and only fans really want to be there.",
            "title_similarity": "0.6297822",
            "sentiment_compound": 0.1513
        },
        {
            "id": "he9196q",
            "score": -4,
            "text": "Tell me one good reason prostitution is illegal.",
            "title_similarity": "0.55473113",
            "sentiment_compound": -0.1779
        },
        {
            "id": "he8ztwb",
            "score": 7,
            "text": "Similarly, banning abortion increases the number of abortions that happen, and they happen under more dangerous circumstances.",
            "title_similarity": "0.79911214",
            "sentiment_compound": -0.4754
        },
        {
            "id": "he91qs9",
            "score": 23,
            "text": "It's not really about sex trafficking, it never was. It's all about puritanism. The trafficking argument is a ruse, the data has been clear for a while that prohibition does nothing to prevent pimping and slavery. It's about prudishness about sex, and particularly women's sexuality.",
            "title_similarity": "0.5558634",
            "sentiment_compound": -0.6979
        },
        {
            "id": "he9jv9c",
            "score": -6,
            "text": "And who is the one who says prostitution is bad? Self righteous religion.",
            "title_similarity": "0.5247962",
            "sentiment_compound": -0.5423
        },
        {
            "id": "he8tsbb",
            "score": -4,
            "text": "Good to see more data to show these dumb politicians that they are as usual setting about this issue.",
            "title_similarity": "0.49129266",
            "sentiment_compound": -0.1027
        },
        {
            "id": "he8s0f0",
            "score": 13,
            "text": "I mean this is the result in anything being criminalized",
            "title_similarity": "0.47591692",
            "sentiment_compound": 0.0
        },
        {
            "id": "he91izz",
            "score": 35,
            "text": "Normalizing prostitution is just creating more human trafficking, calling them sex workers makes the problems of virtually a less secure border heaven for child smugglers, I believe that kids working in the sex industry should not be arrested but placed in foster care because they are being exploited by criminal elements if there is such a middle ground like Onlyfans, even that is slowly being taken by crime syndicates and cyber pimps. Legalize prostitution but have strong regulations, tax it, do what you can to bring those numbers down, years ago Feminists would have called sex work \"exploitation\", now it's empowering, and we are seeing the numbers of human trafficking skyrocket in recent months. \n\nProstitution may be a victimless crime ....for the johns, but for the sex workers they themselves are victims",
            "title_similarity": "0.84169763",
            "sentiment_compound": -0.8101
        },
        {
            "id": "he9f7a4",
            "score": 12,
            "text": "We need to stop acting like the exploitation of women is a \"valid profession\".  These women and need psychological help, as the vast majority were abused physically, sexually, or emotionally in their childhoods and are traumatized.  They are not doing \"valid\" work, they are self-medicating for their untreated trauma.\n\nSex work is not \"empowering\", it is not \"valid\", it is not something that should be legalized.  These women and girls need to be institutionalized so that their trauma can be treated and they can return to healthy sexual function, rather than being encouraged to continue their destructive and dangerous behaviors.  Those who enable them and take advantage of them should be harshly punished.  We are throwing some of the most vulnerable of our society, those who have been damaged and neglected as children, to the wolves, and patting ourselves on the back for being such wonderful progressives for it.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC2254224/",
            "title_similarity": "0.711591",
            "sentiment_compound": -0.9482
        },
        {
            "id": "he95d2f",
            "score": 22,
            "text": "Prostitution has to be criminalized. Contrary to popular opinion, areas that legalize prostitution see more human trafficking, which undercuts the cost of the legal prostitution, which is easy to do, because, slaves",
            "title_similarity": "0.8560815",
            "sentiment_compound": 0.7351
        },
        {
            "id": "he97ims",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.0602018"
        },
        {
            "id": "he9gif0",
            "score": -2,
            "text": "Laws criminalizing prostitution have never been about safety and I've always been about puritanical moral values",
            "title_similarity": "0.39219728",
            "sentiment_compound": 0.0946
        },
        {
            "id": "he9nn1f",
            "score": 0,
            "text": "Literally 0 reason for prostitution to be illegal, only if youre an idiot christian and quote your holy story book as a reason.",
            "title_similarity": "0.5149443",
            "sentiment_compound": -0.7845
        },
        {
            "id": "he9gkel",
            "score": 2,
            "text": "Ok.  Fine with me. Prostitution is societal cancer and should not be glorified.",
            "title_similarity": "0.5620053",
            "sentiment_compound": -0.7432
        },
        {
            "id": "he9jxu7",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.0602018"
        },
        {
            "id": "he9crmx",
            "score": 5,
            "text": "we shouldn't criminalize or illegalize prostitution; we should destroy it",
            "title_similarity": "0.5821948",
            "sentiment_compound": -0.5423
        },
        {
            "id": "he9qbfo",
            "score": 0,
            "text": "It’s about control, not protecting anyone",
            "title_similarity": "0.25733328",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9ardm",
            "score": -2,
            "text": "When you think about it, what a weird thing to be a crime.",
            "title_similarity": "0.56920224",
            "sentiment_compound": -0.6369
        },
        {
            "id": "he9fhon",
            "score": 6,
            "text": "This is a joke right?\nWhat is the difference between decriminalizing and normalizing? Don’t be surprised when your children start thinking this is a good job at 10 then.",
            "title_similarity": "0.4324146",
            "sentiment_compound": 0.7476
        },
        {
            "id": "he92ao9",
            "score": -12,
            "text": "Sex worker here! That’s a feature, not a bug!",
            "title_similarity": "0.3415264",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9ag3b",
            "score": 6,
            "text": "Isn’t this misleading?\n\nThe number of sex workers decreases if sex work is criminalized. The people still in sex work have a worse time. \n\nFor example (made up to show my point):\n\nSex work is legal= 1000 sex workers with 50 of them underage. So risk of 5%\n\nSex work illegal:= 100 sex workers with 15 being trafficked or underage. So a risk of 15%\n\nSo risk increases, yeah but the number of underage and trafficed individuals is still lower",
            "title_similarity": "0.7060056",
            "sentiment_compound": -0.8338
        },
        {
            "id": "he994h3",
            "score": 0,
            "text": "Like any form of prohibition, if people want it they will get it and you create organized crime instead of actually stopping the problem.",
            "title_similarity": "0.67669135",
            "sentiment_compound": -0.4404
        },
        {
            "id": "he92zwi",
            "score": 102,
            "text": "No it doesn't. There have been tons of studies that show sex trafficking increases with legalized prostitution. And this article doesn't even research that claim.\n\nhttps://orgs.law.harvard.edu/lids/2014/06/12/does-legalized-prostitution-increase-human-trafficking/",
            "title_similarity": "0.62962383",
            "sentiment_compound": -0.296
        },
        {
            "id": "he9pxr4",
            "score": 5,
            "text": "[Failed replications in psychology don't affect the number of citations an article receives. ](https://www.reddit.com/r/psychology/comments/pv656p/failed_replications_in_psychology_dont_affect_the/?utm_medium=android_app&utm_source=share)\n\nThe Nordic model has refuted this concept with substantial evidence time and again. I've got nothing against sex workers but legalization creates a huge veil under which trafficking can operate almost openly.",
            "title_similarity": "0.5695149",
            "sentiment_compound": 0.5774
        },
        {
            "id": "he9iqyj",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.0602018"
        },
        {
            "id": "he91glm",
            "score": 76,
            "text": "This is not true, we have the Germany an Netherlands example:\n\nhttps://www.trauma-and-prostitution.eu/en/2018/06/19/the-german-model-17-years-after-the-legalization-of-prostitution/\n\nTrafficking increases.",
            "title_similarity": "0.5442973",
            "sentiment_compound": -0.3252
        },
        {
            "id": "he9jsob",
            "score": 18,
            "text": "Ok. I don’t dispute the heading. Full disclosure, I’m a middle aged, middle class, married white guy. My interaction with sex work is limited to strip clubs, in my much younger days. I don’t dispute that sex work hasn’t been the most profitable and in many cases the only way a person could survive. So, yup, legalize it. Protect the humans involved. But then, I hope we try to minimize the need for sex work. Sorry, you won’t convince me it doesn’t damage all involved.",
            "title_similarity": "0.5166125",
            "sentiment_compound": 0.0891
        },
        {
            "id": "he95ftj",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06020182"
        },
        {
            "id": "he9011s",
            "score": -6,
            "text": "What bothers me is that we talk about sex workers as though they can’t get other jobs.",
            "title_similarity": "0.7565011",
            "sentiment_compound": -0.2023
        },
        {
            "id": "he8q9ms",
            "score": 25,
            "text": "Isn't this a \"feature, not a bug\" type of thing?",
            "title_similarity": "0.0127672",
            "sentiment_compound": 0.0
        },
        {
            "id": "he8y1cb",
            "score": 131,
            "text": "I've always found it odd that somehow it's illegal to sell something that's legal to give away.",
            "title_similarity": "0.4336426",
            "sentiment_compound": -0.6597
        },
        {
            "id": "he96mm9",
            "score": -2,
            "text": "I truly don't get why this hasn't happened yet in the US. This information has been known since at least the 80s, probably longer if I had to guess",
            "title_similarity": "0.23812109",
            "sentiment_compound": 0.4404
        },
        {
            "id": "he9glhk",
            "score": 1,
            "text": "Or men could just stop harming and sex trafficking women & girls but I guess that’s too much to ask.",
            "title_similarity": "0.6804084",
            "sentiment_compound": -0.4404
        },
        {
            "id": "he97e09",
            "score": 6,
            "text": "Now apply this logic to buying firearms",
            "title_similarity": "0.29517335",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9dxsc",
            "score": 6,
            "text": "I am starting to realize that there are so many underage girls being exploited. By friends, family, pimps, etc. There are ***so*** many. It is mindblowing, and heartbreaking",
            "title_similarity": "0.7037379",
            "sentiment_compound": -0.4404
        },
        {
            "id": "he96azd",
            "score": 8,
            "text": "That's why it's better to make buying sex illegal.",
            "title_similarity": "0.63933504",
            "sentiment_compound": -0.1779
        },
        {
            "id": "he9k1t4",
            "score": 0,
            "text": "I bet UBI would go a long way to help poor women choose other means of income.",
            "title_similarity": "0.48312256",
            "sentiment_compound": -0.1027
        },
        {
            "id": "he9kp1f",
            "score": 0,
            "text": "So are we just going to act like the vast majority of prostitutes are model citizens?",
            "title_similarity": "0.5197305",
            "sentiment_compound": 0.3612
        },
        {
            "id": "he9m1qj",
            "score": 0,
            "text": "law makers don’t care about people, studies and facts do nothing to change the bigoted status quo.",
            "title_similarity": "0.3606873",
            "sentiment_compound": 0.4939
        },
        {
            "id": "he9mzut",
            "score": 0,
            "text": "It's almost like politicians would prefer to have underage prostitutes that're likely to die.",
            "title_similarity": "0.7184478",
            "sentiment_compound": -0.4005
        },
        {
            "id": "he9nlbc",
            "score": 0,
            "text": "The answer to this is to go after the sex work purchaser. The prostitute gets\nto keep the money and walk.\n\nJust change the dynamic.",
            "title_similarity": "0.6421777",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hea3flg",
            "score": 0,
            "text": "Nah, a strong border takes care of that. Keep tha crap illegal. It’s trashy.",
            "title_similarity": "0.51838666",
            "sentiment_compound": -0.0258
        },
        {
            "id": "he9ccf3",
            "score": 11,
            "text": "This is something that people who work with sex workers already knew.\n\nI'm a cop and used to work in a busy city. There was an area where the women would work. Despite it being illegal, I never pursued any legal recourse with them. They are some of the most vulnerable in society. They need protection, support and opportunities.\n\nI would go and speak to the girls to make sure they are alright. They had so much useful info. Whether it was the type of punter that would hurt the girls, or just general info. They helped us as much as we helped them.",
            "title_similarity": "0.658044",
            "sentiment_compound": 0.8289
        },
        {
            "id": "he9m67p",
            "score": 2,
            "text": "One of the great many reasons the United States should adhere to separation of church and state. I do not mind if others have religious beliefs to guide them in life, but when they impose those beliefs on others bye demanding specific public policy, I take exception to that.",
            "title_similarity": "0.45523474",
            "sentiment_compound": -0.1779
        },
        {
            "id": "he97g3c",
            "score": 39,
            "text": "The best way to curb prostitution is to give people money and housing so they don't have to do it.",
            "title_similarity": "0.5242244",
            "sentiment_compound": 0.6369
        },
        {
            "id": "he9e5r0",
            "score": 5,
            "text": "Prohibition never works for personal freedoms with your own body, all it does it create more problems.  \n\nThis study is a nice one to add to the pile of how this policy needs to change.\n\nEnding prohibition on sex working and drugs would help highlight the real problems, improve harm reduction, improve safety, allow others to help without fear of criminality repercussions, and most of all, defund organized crime to the tune of $2-3 trillion per year, which creates a whole set of other problems when they have a GDP the level of nation states and control countries and markets the way that type of money can do. It is wild that the money that is funding organized crime rarely comes into these discussions either. \n\nWith sex working, labelling everything \"trafficking\" isn't helping stop trafficking. When you legalize and regulate the actual criminal element has a spotlight on them rather than letting them be lost like a needle in the haystack.\n\nUnfortunately cartels are now at the power of nation states due to the criminality and illegality of drugs and sex working, legality always leads to more safety and one way is regulation but another is reducing cartel/mafia violence/supply controls.\n\nProhibition is anti-people, anti-health, anti-safety, but pro-authoritarian, pro-cartel and pro-violence.\n\nTake your pick:\n\n- drugs and sex all the potential benefits and problems\n\nOR\n\n- drugs and sex and all the potential benefits and problems *AND militarized cartels taking in billions and trillions across the market annually which funds violence and cartels to the power of nation states... as well as authoritarian actions and state civil forfeiture programs and massively unsafe underground drug production and synthetics*\n\nThe logical choice is pretty easy.",
            "title_similarity": "0.760604",
            "sentiment_compound": 0.7727
        },
        {
            "id": "he9nl7x",
            "score": 6,
            "text": "Sex work should be legal and regulated, no doubt. It's legitimate work and everyone involved is consenting. Harmless IMO and should be legal so these women are not only protected but also have worker's rights that other fields enjoy.",
            "title_similarity": "0.47154528",
            "sentiment_compound": 0.7312
        },
        {
            "id": "he9dp5z",
            "score": 2,
            "text": "Can someone tell America’s most ardent prostitution warrior Kamala Harris this",
            "title_similarity": "0.65888536",
            "sentiment_compound": 0.5256
        },
        {
            "id": "he9jnem",
            "score": 2,
            "text": "Just like other things legalizing prostitution doesn't mean everyone has to like it or do it.  I personally wouldn't participate but I'm all for legalization.",
            "title_similarity": "0.60783875",
            "sentiment_compound": 0.3612
        },
        {
            "id": "he9mum6",
            "score": 2,
            "text": "It reminds me of most gun control, but let me explain.  In legalizing sex work you are not making it easier for people to have sex with minors, that will still be illegal.   However all of the resources used to try to stop prostitution will now be sent back to stopping sexual abuse on minors.\n\nFurthermore if you look at places like Amsterdam’s red light district, there are social services in place to help anyone who is being pressured into that way of life.  Also the “pimps” are more like landlords who simply rent a room out to the workers and they have an active part in trying to maintain the safety/security of the workers.\n\nNow I say it reminds me of gun control because they always try to create more laws after a shooting… but if someone murders 15 people, why would creating more laws be a deterrent?  15 murders means a minimum of 375 years in prison if convicted on all counts.",
            "title_similarity": "0.79177445",
            "sentiment_compound": -0.974
        },
        {
            "id": "heawh6s",
            "score": -3,
            "text": "Legalize it!! It’s a legit business. Hard working men and women serving a community. People use their bodies to make money all the time (ballet, dancers, models) what’s a hole or two?? Sex workers deserve healthcare, 401k plan, sick days, stock options. Let’s stop pretending this doesn’t happen…it’s the worlds oldest profession!",
            "title_similarity": "0.5918113",
            "sentiment_compound": -0.7741
        },
        {
            "id": "he9h3gu",
            "score": 3,
            "text": "Someone has probably already mentioned it, but there is a third option, the one we have in Sweden: criminalize the \"customer\", but not the sex worker. It's not perfect, but it is better for the sex workers than when it's legal (at least that's what the sex workers say themselves, and that's what, att least some of the studies have found). It's also much better than to criminalize the victim.",
            "title_similarity": "0.6927002",
            "sentiment_compound": 0.422
        },
        {
            "id": "he8zzh7",
            "score": -1,
            "text": "The governments have had so many things wrong for so long. Think about how many lives they’ve destroyed with these immoral unethical policies that they still cling to",
            "title_similarity": "0.6619634",
            "sentiment_compound": -0.9163
        },
        {
            "id": "he93319",
            "score": 1,
            "text": "So maybe drugs should follow the same train of thought?",
            "title_similarity": "0.338075",
            "sentiment_compound": 0.0
        },
        {
            "id": "he98d6a",
            "score": -1,
            "text": "I thought this was common knowledge at this point? Making it illegal makes it a lot more difficult even for willing participants to report when they are victim of an actual crime.",
            "title_similarity": "0.7347368",
            "sentiment_compound": -0.8999
        },
        {
            "id": "he9af58",
            "score": -1,
            "text": "And prohibition continues to never work",
            "title_similarity": "0.28573924",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9am31",
            "score": 1,
            "text": "\"But legal prostitution allows sex traffickers to hide with legitimate prostitution\"\n\n-Human Trafficking",
            "title_similarity": "0.7254156",
            "sentiment_compound": -0.0772
        },
        {
            "id": "he9bfwh",
            "score": -1,
            "text": "Most of these women are imported from foreign countries and are sex workers in order to survive. Legalizing it exposes the illegal activities such as trafficking within the industry. It also enables them paths to citizenship and a way out. They're trapped.  If they're not free, no one is free.",
            "title_similarity": "0.7929282",
            "sentiment_compound": -0.7196
        },
        {
            "id": "he9cd8l",
            "score": -1,
            "text": "Wish laws would get onlyfans shut down. Utterly disgusting and disrespectful",
            "title_similarity": "0.5271417",
            "sentiment_compound": -0.2484
        },
        {
            "id": "he9iujh",
            "score": -1,
            "text": "Criminalizing ALL victimless actions does this.",
            "title_similarity": "0.5878668",
            "sentiment_compound": 0.1531
        },
        {
            "id": "he9jvoe",
            "score": -1,
            "text": "Wont someone please think of the children",
            "title_similarity": "0.23252876",
            "sentiment_compound": -0.2411
        },
        {
            "id": "he9kia8",
            "score": 1,
            "text": "Listen up:\n\nYou're owned and run and manipulated by pedophiles with vast amounts of wealth. Why would they allow something like this to pass?",
            "title_similarity": "0.66841614",
            "sentiment_compound": 0.6124
        },
        {
            "id": "he9loow",
            "score": -1,
            "text": "If you want to control something, make it legal because then you can license and regulate it.",
            "title_similarity": "0.36871126",
            "sentiment_compound": 0.2023
        },
        {
            "id": "he9lzn4",
            "score": 1,
            "text": "You can throw all the scientific studies at these pearl-clutching puritans in office, but they still wont ever pass any progressive laws that allow for safe management of the oldest profession. I guess all we have are these reddit posts that crop up ad nauseam.",
            "title_similarity": "0.5330915",
            "sentiment_compound": 0.7351
        },
        {
            "id": "he9mbqo",
            "score": 1,
            "text": "Crime should be about stopping people from hurting others. I see this as an invented moral crime at this point in my life.",
            "title_similarity": "0.634709",
            "sentiment_compound": -0.8834
        },
        {
            "id": "he9mhns",
            "score": 1,
            "text": "Could always just stop paying for sex like normal people. Guess that's out of the question though, since you would pay for sex.",
            "title_similarity": "0.54532206",
            "sentiment_compound": -0.0258
        },
        {
            "id": "he9mlan",
            "score": -1,
            "text": "I’m not entirely sure how criminalizing prostitution would increase underage prostitution. How exactly does that work?",
            "title_similarity": "0.712023",
            "sentiment_compound": 0.0313
        },
        {
            "id": "he9qhid",
            "score": -1,
            "text": "Decriminalizing it also makes it an easier industry for your sons and daughters to get into.",
            "title_similarity": "0.55141485",
            "sentiment_compound": 0.4215
        },
        {
            "id": "he9wpbi",
            "score": -1,
            "text": "Conservatives have left the chat",
            "title_similarity": "0.11514163",
            "sentiment_compound": 0.0
        },
        {
            "id": "heae4ub",
            "score": 1,
            "text": "Unpopular opinion nowadays: Prostitution isn’t and should not be a viable source of work for anyone. I find it extremely lazy",
            "title_similarity": "0.5463718",
            "sentiment_compound": -0.4201
        },
        {
            "id": "heb0njo",
            "score": 1,
            "text": "I know it’s an unpopular opinion, but I don’t really have that much sympathy for prostitutes, and I really don’t think legalizing this line of work is a good idea for society.",
            "title_similarity": "0.6214774",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hebydr4",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.0602018"
        },
        {
            "id": "he98813",
            "score": 2,
            "text": "There's no difference between this scientific \"epiphany\", and any other (victimless) financial crime. For example buying/selling drugs. Without rights enforcement, workers in these industries have to turn to alternative means of property protection.\n\nObviously if the activity involves crimes against person, or crimes against property that isn't the case. So murder for hire, assault for hire, or activity that involves theft, fraud, non consensual sex (including under age) should not be made legal. Everything else (victimless crimes) if made legal, would improve society.\n\nSex work is a valid profession, and doesn't violate anyone's rights. That's why we should support sex workers, as opposed to abuse them. So is gambling, selling weed, etc. Anyone who states otherwise, and considers these professions invalid, essentially just wants to impose their own personal preference on others using violence (law enforcement) from the comfort of their own couch.",
            "title_similarity": "0.7220875",
            "sentiment_compound": -0.9625
        },
        {
            "id": "he9949f",
            "score": -2,
            "text": "The issue is that legalizing anything is a government's tacit endorsement, and no one wants their government to be encouraging prostitution. If I was a guy in a bar telling a woman, \"Y'know it wouldn't be so bad if I could pay you for sex right now,\" there's a pretty well defined moral issue at hand. Legalization is the government saying that to everyone, simultaneously, all the time. Plus, some studies have shown that legalization actually led to an increase of trafficking as another user noted in this thread. All I'm saying is that there's more to an argument of legality than harm reduction. Unless you don't believe in objective morality I guess",
            "title_similarity": "0.66889054",
            "sentiment_compound": 0.2835
        },
        {
            "id": "he9alu6",
            "score": -2,
            "text": "Yeah but then how will scumbag cops have sex with sex workers through use of force?",
            "title_similarity": "0.7205622",
            "sentiment_compound": -0.7351
        },
        {
            "id": "he9b8ti",
            "score": 2,
            "text": "Yep. Same thing with drugs. The United States at least would rather make a moral statement than actually care for their citizens.",
            "title_similarity": "0.5876842",
            "sentiment_compound": 0.802
        },
        {
            "id": "he9k45i",
            "score": 3,
            "text": "But if we don’t criminalize stuff like this what are the upper class going to use to judge and belittle the poor?",
            "title_similarity": "0.6595434",
            "sentiment_compound": -0.6956
        },
        {
            "id": "he9kr6c",
            "score": 2,
            "text": "Nordic model is the best imo. \nCriminalize buying, legalize selling.",
            "title_similarity": "0.4389721",
            "sentiment_compound": 0.6369
        },
        {
            "id": "he9lzqf",
            "score": 3,
            "text": "Generally, criminalizing anything increases risk to the people continuing to profligate it…",
            "title_similarity": "0.7600294",
            "sentiment_compound": -0.2732
        },
        {
            "id": "he9qqk2",
            "score": 2,
            "text": "While there is no perfect solution here, [the Nordic Model](https://en.m.wikipedia.org/wiki/Nordic_model_approach_to_prostitution) appears to have the best outcomes based on real world research and results.",
            "title_similarity": "0.44301245",
            "sentiment_compound": 0.0618
        },
        {
            "id": "he9x12s",
            "score": 2,
            "text": "Its baffling that people don't recognise this even without studies like this and continue to shift the goalpost of \"you wouldn't want your daughter doing porn would you?,\" \"sex work isn't work,\" \"you pay to watch porn of other daughters, don't you see the hypocrisy?\" and let's not even get started with religious zealouts.\n\nLiterally none of the aforementioned points matter at all if sex work was legalised. Sex workers would have but not limited to liveable wages, **UNIONS!**, health care, legal protection/ representation etc much like any other reputable industry (and sex work really is reputable).\n\nAnd potentially even improve or shine a light on consumers mental health by way of studies (case, clinical or otherwise) which would only goes to further implement a more positive image of the human sexuality which is, in a very literal sense, only natural and would no doubt benefit/ improve other industries of the world.",
            "title_similarity": "0.71190935",
            "sentiment_compound": 0.9803
        },
        {
            "id": "he9mhr4",
            "score": 10,
            "text": "It's weird you can go to Nevada in certain cities and it's perfectly legal and you don't hear about massive crime or any additional sex trafficking due to its legal status yet the rest of the country has it illegal.  I wish our laws were more nationally recognized to make more sense.  Like marijuana. It'd make so much sense if it was just nationally legal instead of here but not there.",
            "title_similarity": "0.55874",
            "sentiment_compound": 0.4096
        },
        {
            "id": "he8xzdu",
            "score": 36,
            "text": "[removed]",
            "title_similarity": "0.06020182"
        },
        {
            "id": "he9dsrr",
            "score": 3,
            "text": "How how about nasty old men stop fiddling little boys and girls.",
            "title_similarity": "0.5203138",
            "sentiment_compound": -0.7003
        },
        {
            "id": "he9l7wk",
            "score": 5,
            "text": "Legalize it. Regulate it. Tax it. \n\nIt's how things progress in society. \n\nProstitution will always exist in some way shape or form. All anti-prostitution laws do is make it more difficult, and more importantly, make it so women can't seek legal help. \n\nWhich leads to pimps, and abuse. \n\nIt is the same argument for abortion, same argument for birth control, same argument for sex-ed in classrooms. It's all about controlling women.",
            "title_similarity": "0.76038384",
            "sentiment_compound": -0.894
        },
        {
            "id": "hea5okk",
            "score": 4,
            "text": "Legalizing prostitution and cocaine would unironically be a great thing for humanity. The gtav radio was right.",
            "title_similarity": "0.560798",
            "sentiment_compound": 0.6249
        },
        {
            "id": "he9ky2d",
            "score": 8,
            "text": "The counterpoint I've always heard for this is that human trafficking is more common in countries where prostitution is legal.",
            "title_similarity": "0.66475904",
            "sentiment_compound": 0.128
        },
        {
            "id": "he8yrz0",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.06020182"
        },
        {
            "id": "he9lrfx",
            "score": 0,
            "text": "Legalize prostitution but keep going to a prostitute a crime.  Like they do in Sweden.",
            "title_similarity": "0.7306954",
            "sentiment_compound": -0.3612
        },
        {
            "id": "he9nsrl",
            "score": 0,
            "text": "put out a fake rumor that people are getting aids",
            "title_similarity": "0.46062127",
            "sentiment_compound": -0.4767
        },
        {
            "id": "he9nxqf",
            "score": 0,
            "text": "Criminalizing degenerate behavior makes for a better society.",
            "title_similarity": "0.6068178",
            "sentiment_compound": 0.4404
        },
        {
            "id": "he9oamw",
            "score": 0,
            "text": "Legalizing makes criminals free to abuse people for money. So much better zzz.",
            "title_similarity": "0.68196034",
            "sentiment_compound": -0.5974
        },
        {
            "id": "hea2sq5",
            "score": 0,
            "text": "Women and children are still abused in the legal pornography industry. It may bring the instances of abuse down, but it will never go to zero.",
            "title_similarity": "0.70919466",
            "sentiment_compound": -0.5423
        },
        {
            "id": "heagloe",
            "score": 0,
            "text": "Maybe it shouldn't be illegal, because it won't solve the problem and sometimes may makes it even worse. But recommending it to others should be unacceptable. It should be taboo and censored from social medias, make it something that barely exist in people's head.",
            "title_similarity": "0.57339776",
            "sentiment_compound": -0.6863
        },
        {
            "id": "hebkkyb",
            "score": 0,
            "text": "This is extremely one sided.   Paying people more would also stop prostitution.",
            "title_similarity": "0.6775125",
            "sentiment_compound": -0.3535
        },
        {
            "id": "hebpawh",
            "score": 0,
            "text": "well sure but it also disempowers women.",
            "title_similarity": "0.51528496",
            "sentiment_compound": 0.296
        },
        {
            "id": "hebrmll",
            "score": 0,
            "text": "About 35 years ago in Washington state strip clubs sold alcohol so were under state supervision as well as local. Strippers had to be 21, there was no touching, 6 feet away when topless or nude. State kept upping the restrictions, then finally said, strippers means you don't have a liquor license. So the owners decided, why do we need liquor, we got naked women? So now strippers - and patrons - only have to be 18, and the burden of watching what goes on is all on local jurisdictions. That solved all the problems in one swell foop.",
            "title_similarity": "0.5021116",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hec1dyz",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06020182"
        },
        {
            "id": "hec6axh",
            "score": 0,
            "text": "As a minor it was insanely easy for me to get my hands on pot, a case of beer tho? Rare. My parents didn’t drink and drug dealers don’t make profit on booze",
            "title_similarity": "0.36347425",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hec88el",
            "score": 0,
            "text": "Yep that's why it's banned in the places it is",
            "title_similarity": "0.36818594",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hecexl9",
            "score": 0,
            "text": "Simply don’t break the law, if you do, deal with the consequences",
            "title_similarity": "0.359051",
            "sentiment_compound": 0.0
        },
        {
            "id": "hecggz9",
            "score": 0,
            "text": "I love how everyone takes a increased RISK of something as equal to it would occur to 100%.   \nJust say you love prostitution and want to defend it at all cost.",
            "title_similarity": "0.5522674",
            "sentiment_compound": 0.8388
        },
        {
            "id": "he8uduc",
            "score": 143,
            "text": "It’s aboveboard and safe for the worker and their clients here in Australia, and I don’t see prostitutes on the streets in Melbourne like I did in Oakland where it’s completely unregulated.",
            "title_similarity": "0.42029423",
            "sentiment_compound": 0.6597
        },
        {
            "id": "he95cr9",
            "score": 54,
            "text": "Kind of like how making drugs illegal means kids can buy them easier because dealer don’t card",
            "title_similarity": "0.5455618",
            "sentiment_compound": 0.1779
        },
        {
            "id": "he8zjq0",
            "score": 20,
            "text": "[removed]",
            "title_similarity": "0.0602018"
        },
        {
            "id": "he8z69y",
            "score": 121,
            "text": "I was shocked to learn that victims of sex trafficking often have trouble finding work because of arrest records.  Some states are moving to expunge the records of minors arrested for prostitution.  But minors shouldn't have been arrested for prostitution to begin with, the pimps and customers should be charged.  \n\n\nI'm in favor of decriminalizing prostitution for all ages, if only  because it makes it easier for people being coerced to get help.  But the idea that a minor could even get an arrest record for it didn't even occur to me.  \n\n\nIt's difficult enough to have to rebuild a life after that kind of trauma.  Not being able to get a good job because of an arrest that happened as an abused minor is a major injustice.",
            "title_similarity": "0.7994002",
            "sentiment_compound": -0.9509
        },
        {
            "id": "he90yno",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06020182"
        },
        {
            "id": "he99vju",
            "score": 1,
            "text": "I never understood why paying someone to have sex is illegal, but paying someone to have sex in front of a camera is legal.",
            "title_similarity": "0.58345187",
            "sentiment_compound": -0.1406
        },
        {
            "id": "he9aydk",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06020182"
        },
        {
            "id": "he9gt3o",
            "score": -1,
            "text": "I think we have a lot of everything wether we legalize it or not. It kind of is everywhere you go. So theories can be thrown for one or the other reason.",
            "title_similarity": "0.31459245",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9kmfr",
            "score": 1,
            "text": "The same applies to drugs.",
            "title_similarity": "0.26912627",
            "sentiment_compound": 0.0
        },
        {
            "id": "hea4eah",
            "score": -1,
            "text": "1) drugs leads to prostitution \n\n2) capital punishment for drug suppliers\n\n3) make it legal to marry more than one women. (man and man can marry) why can't man have more than 1 wife ? \n\n4) Also make gambling illegal \n\n5) Also crack down on big corporates who aren't paying taxes, make a law so strict that they pay taxes to stay out of jail. \n\n6) Also buy huge apatment buildings and rent it out for baseprice to people who aren't able to afford rent. \n\n7) Every family who cannot afford to buy basic necessities  should get tokens not money. These tokens can only be used for food and essentials. \n\n8) we have the technology, we have the money but we have more greed than anything else.\n\n&#x200B;\n\nGod help us all. AMEN",
            "title_similarity": "0.7550318",
            "sentiment_compound": 0.1181
        },
        {
            "id": "heabyhq",
            "score": -1,
            "text": "\\#LegalizeSexWorkers #IStandWithSexWorkers",
            "title_similarity": "0.3222954",
            "sentiment_compound": 0.0
        },
        {
            "id": "healdti",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.0602018"
        },
        {
            "id": "heatfqs",
            "score": 1,
            "text": "Legalize it. Tax it. License it. Establish enforceable standards for safety. Shut down the illicit markets. If it bothers anyone or they find it against their morals, they don’t have to become or hire a prostitute.",
            "title_similarity": "0.55033827",
            "sentiment_compound": 0.25
        },
        {
            "id": "hebo2ab",
            "score": -1,
            "text": "It's really an incomplete assessment of the situation. For example, you could imagine a world where it's still illegal with harsher penalties that makes it unimaginable that people would break these laws. Basically, it's looking at one dimension of the situation when there are many.",
            "title_similarity": "0.65942323",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hebpgxl",
            "score": 1,
            "text": "Which is exactly what sex workers have been saying for years.",
            "title_similarity": "0.24894835",
            "sentiment_compound": 0.0
        },
        {
            "id": "hebq1vq",
            "score": 1,
            "text": "This kills me.  Why after 2 centuries can we not figure out that….\na).  we can make money .  It happened with weed.  And they even legalized a way to gamble which does far more damage then a hooker.  \nB). It would put it all in one place.  Go to any city in Europe it’s on the red light not I. Your neighbor hood .  Prostitution is Ad old as sex itself.  You can’t get rid of it.  If we had a red light they would be safe pay taxes and we could better control disease.  And that’s all that could happen .  Because it’s here now anyway and it’s handling is a atrocity.  It could not be worse .",
            "title_similarity": "0.73176605",
            "sentiment_compound": -0.0101
        },
        {
            "id": "hebq47n",
            "score": -1,
            "text": "Criminalizing drinking and driving increases risk to drivers and makes it harder to stop underage drinking and driving.",
            "title_similarity": "0.87068915",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hec8ddf",
            "score": -1,
            "text": "And that’s why prostitution is illegal.",
            "title_similarity": "0.60020214",
            "sentiment_compound": -0.5574
        },
        {
            "id": "he9dg90",
            "score": 53,
            "text": "It also increases violence against women.",
            "title_similarity": "0.70532006",
            "sentiment_compound": -0.6249
        },
        {
            "id": "he9avj4",
            "score": 2,
            "text": "This is terrible. I’ve also read studies that concluded legalized prostitution increases trafficking of adult women to legalized countries. How do we fix this?",
            "title_similarity": "0.8283467",
            "sentiment_compound": -0.4767
        },
        {
            "id": "he9c9wy",
            "score": 2,
            "text": "Every other study I've seen says that trafficking is more common in areas with legalized/decriminalized prostitution, and this study doesn't contradict or even mention that. Omitting this key fact skews the article toward a more favorable impression of prostitution than is warranted, while including it would not have detracted from the researchers' results.",
            "title_similarity": "0.6526419",
            "sentiment_compound": 0.7603
        },
        {
            "id": "he9wnta",
            "score": -2,
            "text": "Government bad?  Im shocked",
            "title_similarity": "0.44064528",
            "sentiment_compound": -0.7003
        },
        {
            "id": "heafkcn",
            "score": -2,
            "text": "Prohibition never works.  Legalize, legitimize, support and embrace.",
            "title_similarity": "0.35114944",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hearm79",
            "score": -2,
            "text": "Sex work should be illegal",
            "title_similarity": "0.6107628",
            "sentiment_compound": -0.5574
        },
        {
            "id": "he9mu86",
            "score": 32,
            "text": "That’s very hard to believe looking at the Netherlands.",
            "title_similarity": "0.32463294",
            "sentiment_compound": -0.1761
        },
        {
            "id": "he9rzj4",
            "score": 3,
            "text": "Prohibition doesn't work",
            "title_similarity": "0.31769246",
            "sentiment_compound": 0.0
        },
        {
            "id": "hebvfic",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.0602018"
        },
        {
            "id": "he95t9w",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.06020182"
        },
        {
            "id": "he9kbm5",
            "score": 4,
            "text": "Criminalizing drugs does the same thing. It creates more problems than it solves. If you disagree I would be more than happy to provide information on the subject.",
            "title_similarity": "0.6986764",
            "sentiment_compound": 0.3788
        },
        {
            "id": "he8po28",
            "score": 831,
            "text": "Switch in “drugs” and my bet is it’d be the same outcome",
            "title_similarity": "0.19429788",
            "sentiment_compound": 0.0
        },
        {
            "id": "he94gr8",
            "score": -5,
            "text": "The direct counter to enabling prostitution is that it will probably correlate to increases of marital failures due to somewhat low key accessibility of people to have sex with.",
            "title_similarity": "0.8129548",
            "sentiment_compound": -0.5868
        },
        {
            "id": "he8x7i4",
            "score": -46,
            "text": "[removed]",
            "title_similarity": "0.0602018"
        },
        {
            "id": "he913ud",
            "score": 659,
            "text": "respectfully, this title is terrible.\n\nThe actual data that this *study* looked at was demand for sw and how it was affected by criminalisation. That is it. Demand included just, raw amounts of demand, and also the specific clientelle.\n\nThe only time under age prostitution and trafficking is mentioned is when theyre citing *other* sources, or when theyre making arguments that are not rooted in the data that they collected. For example,\n\n\n>In this line of reasoning it would still pay to make goods illegal if important negative externalities were involved, and in the case of prostitution, violence might be seen as one such externality. We would argue, however, that violence may increase with criminalization, not the opposite... **Criminalization of sex work also makes the detection of under-age or trafficked people more difficult. **\n\n\nFWIW, i agree that these arguments are mostly valid, and that sex work shouldnt be criminalised. But the title of this post is not a good reflection of the actual substance of this article.",
            "title_similarity": "0.7951795",
            "sentiment_compound": -0.9414
        },
        {
            "id": "he90qr3",
            "score": 1516,
            "text": "Criminalizing them exposes them to criminals. Surprisingly.",
            "title_similarity": "0.6998328",
            "sentiment_compound": -0.4588
        },
        {
            "id": "he8qfgb",
            "score": 3955,
            "text": "Not a new idea, but certainly nice to see more information pointing towards this being correct.",
            "title_similarity": "0.3115067",
            "sentiment_compound": 0.7783
        },
        {
            "id": "he966ye",
            "score": 126,
            "text": "[removed]",
            "title_similarity": "0.0602018"
        },
        {
            "id": "he95745",
            "score": 1,
            "text": "I feel the best way to kill the bad aspects of these things is to legalize them and regulate them to infinity",
            "title_similarity": "0.49845856",
            "sentiment_compound": -0.6124
        },
        {
            "id": "he98agw",
            "score": 1,
            "text": "Kinda like the death penalty.",
            "title_similarity": "0.31181338",
            "sentiment_compound": -0.6629
        },
        {
            "id": "he9awkd",
            "score": 1,
            "text": "Having complete prostitution be illegal is straight a religious thing that has no place in a society that optimize for best human happiness and rights.",
            "title_similarity": "0.53024733",
            "sentiment_compound": 0.7964
        },
        {
            "id": "he9ay8l",
            "score": 1,
            "text": "True of most things that are deemed criminal when the activity is undertaken by consenting parties. If consenting adults want to do something it should never be criminalised, sex, drugs, hell even the ending of a life when it comes to euthanasia. The concept of the government deciding what is criminal and what is not in this context is no different than antivaxers deciding it's not right for their kids to get immunised.",
            "title_similarity": "0.62760925",
            "sentiment_compound": -0.8316
        },
        {
            "id": "he9b3bm",
            "score": 1,
            "text": "Americans only understand money.\n\nLegalizing prostitution=taxing it\n\nThis is how we got pot legalized.",
            "title_similarity": "0.5482124",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9bcbb",
            "score": 1,
            "text": "I guess we haven't learned much from laws against drugs...\nLet everyone do what they want as long as it doesn't negatively affect other people... Simple",
            "title_similarity": "0.38109517",
            "sentiment_compound": 0.0772
        },
        {
            "id": "he9brla",
            "score": 1,
            "text": "Occam’s Razor suggests that that is precisely _why_ conservatives are opposed to legalizing it.",
            "title_similarity": "0.46979922",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9btgb",
            "score": 1,
            "text": "This seems to be the case for many \"vice\" crimes. Decriminalization and regulation may be preferable to prohibition, especially if the goal is harm reduction.",
            "title_similarity": "0.65463114",
            "sentiment_compound": -0.5423
        },
        {
            "id": "he9btnq",
            "score": 1,
            "text": "I too would like prostitution to be legal",
            "title_similarity": "0.50981694",
            "sentiment_compound": 0.4588
        },
        {
            "id": "he9cdoz",
            "score": 1,
            "text": "I'm sure not many politicans want to to be the known for or associated with \"decriminalizing\" prostitution, whether it be on a state or federal level.",
            "title_similarity": "0.5825993",
            "sentiment_compound": 0.2681
        },
        {
            "id": "he9cl7q",
            "score": 1,
            "text": "Oh no there is a particularly unhinged Redditor that is going to have a hard time accepting data when they feel so strongly against sex work but also loves to tell people to \"look at the data\" \n\nThey're probably going to avoid this thread and find some echo chamber or easy target to bully instead though.",
            "title_similarity": "0.66937625",
            "sentiment_compound": 0.5677
        },
        {
            "id": "he9csqc",
            "score": 1,
            "text": "\"We know dis.\" - sociologists and criminologists",
            "title_similarity": "0.2693808",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9d1d5",
            "score": 1,
            "text": "How does it make it harder to stop underage prostitution and sex trafficking? Is it ‘cause workers are more inclined to talk about it if that one section is illegal and not potentially putting their own work in jeopardy?",
            "title_similarity": "0.86308837",
            "sentiment_compound": -0.8504
        },
        {
            "id": "he9d6e4",
            "score": 1,
            "text": "Honestly, it’s crazy how it’s illegal especially in this day in age where everything is over sexualized.",
            "title_similarity": "0.60845995",
            "sentiment_compound": -0.4588
        },
        {
            "id": "he9d8qg",
            "score": 1,
            "text": "Criminalizing ___ increases risks to ___. Pick your issue, fill in the blanks. Drugs, abortions, name it.\n\nNice to see this being called out more, but let’s get to the root of the argument sooner than later.",
            "title_similarity": "0.74475694",
            "sentiment_compound": -0.4404
        },
        {
            "id": "he9d9mz",
            "score": 1,
            "text": "Its not really \"sex worker\" when its illegal. Thats like calling vigilantes \"police\". \n\nMuch the same for every other illegal act. Drug trafficking isnt a \"courier worker\" or \"mail man\".        \n\nIt needs to be made a legal taxable income job because of the nature and moral principles of the act largely coinciding with plenty of other fully recognized employments. Rather than for the sake of amnesty and safety for criminals engaging in black markets.",
            "title_similarity": "0.62392545",
            "sentiment_compound": -0.5719
        },
        {
            "id": "he9drjf",
            "score": 1,
            "text": "Shocking...\n\nIt's pretty evident that people partake in interested activities regardless of law. And that legalisation, regulation and taxation could bring benefits to all parties involved, while taking away opportunities for the criminal underworld.",
            "title_similarity": "0.531919",
            "sentiment_compound": 0.7717
        },
        {
            "id": "he9drzb",
            "score": 1,
            "text": "Just the way Gaetz likes it",
            "title_similarity": "0.019569997",
            "sentiment_compound": 0.4215
        },
        {
            "id": "he9dupk",
            "score": 1,
            "text": "So many others laws are not enforced, why enforce this one?",
            "title_similarity": "0.43771535",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9e8as",
            "score": 1,
            "text": "Yeah but it's a super convenient way to lock up primarily minority poor people so it's gonna stick around",
            "title_similarity": "0.44072402",
            "sentiment_compound": 0.4215
        },
        {
            "id": "he9eaiq",
            "score": 1,
            "text": "I wonder how many times this has to be proven before it will actually affect policies.",
            "title_similarity": "0.3355571",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9edpf",
            "score": 1,
            "text": "Sure does, but moral/religious (covertly criminal) interests prefer to keep it illegal in order to further exploit prostitutes.",
            "title_similarity": "0.7033535",
            "sentiment_compound": -0.8381
        },
        {
            "id": "he9edpz",
            "score": 1,
            "text": "The only reason it’s illegal is because people believe in an invisible sky man tells them that prostitution is bad.",
            "title_similarity": "0.60334975",
            "sentiment_compound": -0.7964
        },
        {
            "id": "he9ehop",
            "score": 1,
            "text": ">Criminalizing prostitution increases risks to sex workers and makes it harder to stop underage prostitution and sex trafficking.\n\nI don't disagree with that statement in the least. It being regulated, for the protection of everyone, would be what's best for our civilization in general.\n\nHowever I do not believe that our *entire species* has evolved enough past the primitive caveman stage to accept such a thing, *as a species*. Religious types will always refuse to accept it for various reasons. Even non-religious, 'moral objectors' will reject the notion. While I personally believe in sexual equality/womens' rights, there is no shortage of people in this world who believe that *they* know what's best for someone else, and will go to great lengths to enforce *their* belief in that, even over the objections of the people they purport to be 'protecting'. There are other obstacles as well.\n\nIf this were just a rational, purely scientific issue, there would be no question about it beyond the details of implementing it. But it's also at least 50% an *irrational, emotional* issue related to what apparently is the hardwiring of the human brain at it's current level of evolutionary development *on average*.\n\n**DISCLAIMER:** To put myself into the context of this subject: I have never paid a prostitute for sex nor have seriously considered doing so, but as previously stated, I do not have 'moral' objections' to the practice.",
            "title_similarity": "0.8039479",
            "sentiment_compound": 0.664
        },
        {
            "id": "he9etrb",
            "score": 1,
            "text": "Legalize and health code it. Illegal stuff will always still happen. But the majority will be above-board and allow for safer transactions. Real security, real financial structures that are better for the sex worker, and cleaner facilities.",
            "title_similarity": "0.6870314",
            "sentiment_compound": 0.9144
        },
        {
            "id": "he9f5he",
            "score": 1,
            "text": "Decriminalization is never a single step. It's followed by more decriminalization, and crime. Take a look at San Francisco for the misery that results.",
            "title_similarity": "0.5656309",
            "sentiment_compound": -0.8158
        },
        {
            "id": "he9f9p6",
            "score": 1,
            "text": "Criminalizing something makes it so only criminals will engage in that activity? Interesting...",
            "title_similarity": "0.6373285",
            "sentiment_compound": 0.0314
        },
        {
            "id": "he9fa91",
            "score": 1,
            "text": "some people think that porn video industry is no different than prostitution....  just look at the sheer number of men and women who are doing it for money on that P-----b website.",
            "title_similarity": "0.6844095",
            "sentiment_compound": -0.2263
        },
        {
            "id": "he9faha",
            "score": 1,
            "text": "Portland is legalizing the oldest profession known to mankind soon, everyone should, because everyone does it anyway, making it illegal simply creates opportunities for bad men to hurt ladies.",
            "title_similarity": "0.60259354",
            "sentiment_compound": -0.7783
        },
        {
            "id": "he9fkim",
            "score": 1,
            "text": "The glorification of sex work on reddit is hilarious",
            "title_similarity": "0.6413094",
            "sentiment_compound": 0.6908
        },
        {
            "id": "he9fp6k",
            "score": 1,
            "text": "And yet everyone on Reddit says the opposite.",
            "title_similarity": "0.29530776",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9fpuw",
            "score": 1,
            "text": "Wow just like drugs, who is surprised?",
            "title_similarity": "0.46847975",
            "sentiment_compound": 0.802
        },
        {
            "id": "he9fy1y",
            "score": 1,
            "text": "The same thing can be said about drugs and guns",
            "title_similarity": "0.3656957",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9g3wf",
            "score": 1,
            "text": "    \"Criminalization of i[0] increases risk of i[1] and i[2].\" for i in\n     [\n         [cannabis, contaminated drugs, kids buying],\n         [abortion, women dying in illegal operations, child-neglect and fatal labour complications],\n        [IT security analysis, unidentified sw vulnerabilities, hacker attacks]\n    ]",
            "title_similarity": "0.80366564",
            "sentiment_compound": -0.8834
        },
        {
            "id": "he9g9lx",
            "score": 1,
            "text": "the people who criminalize things without victims do NOT care about doing any good, all they care about is authority.\n\nthe drug war was never about weed, it was about obedience.",
            "title_similarity": "0.51711726",
            "sentiment_compound": 0.2105
        },
        {
            "id": "he9gi7m",
            "score": 1,
            "text": "I always point out Amsterdam when people talk about prostitution as well as drugs to show how making these legal will drastically reduce crime in many ways. Plus you can tax them and use the money for educational purposes on a vast amount of topics.",
            "title_similarity": "0.6831177",
            "sentiment_compound": -0.2263
        },
        {
            "id": "he9h444",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.08406588"
        },
        {
            "id": "he9haaz",
            "score": 1,
            "text": "This is a huge problem and one that unfortunately doesn't get much attention.",
            "title_similarity": "0.3106407",
            "sentiment_compound": -0.4215
        },
        {
            "id": "he9hm2f",
            "score": 1,
            "text": "Prositution will always be illegal because theres always going to be a man in a position of power with a prositute that knows all his secerts.",
            "title_similarity": "0.47967",
            "sentiment_compound": -0.5574
        },
        {
            "id": "he9htvw",
            "score": 1,
            "text": "I love how we all know prohibition only makes it more dangerous for everyone involved and ultimately doesn't work yet we still like to toy with the idea we can outlaw human nature.",
            "title_similarity": "0.6744017",
            "sentiment_compound": 0.5118
        },
        {
            "id": "he9hxls",
            "score": 1,
            "text": "So, to pay for the $3.5T plan in the USA, we need to legalize weed and prostitution and tax both heavily?",
            "title_similarity": "0.7004128",
            "sentiment_compound": -0.1027
        },
        {
            "id": "he9hyw8",
            "score": 1,
            "text": "And legalizing it legitimizes it",
            "title_similarity": "0.24579018",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9hz3j",
            "score": 1,
            "text": "Still don't understand why porn is legal but brothels aren't",
            "title_similarity": "0.5252309",
            "sentiment_compound": 0.0644
        },
        {
            "id": "he9i5co",
            "score": 1,
            "text": "Then look at who keeps getting caught, more often its the people making it harder to catch.",
            "title_similarity": "0.62291205",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9i5ii",
            "score": 1,
            "text": "I'm glad we have this to shove in the asses of anti-sex work propagandists.  Thank you.",
            "title_similarity": "0.5140866",
            "sentiment_compound": 0.6705
        },
        {
            "id": "he9ic6l",
            "score": 1,
            "text": "Besides weed being illegal this is the second dumbest thing that is illegal, neither hurt anyone, exactly the opposite they bring people pleasure. But guns and alcohol are just fine. Let's get drunk and shoot someone instead of chill out and blow a load.",
            "title_similarity": "0.5186758",
            "sentiment_compound": -0.7588
        },
        {
            "id": "he9id80",
            "score": 1,
            "text": "Also prostitution gives people a lot of potential for financial freedom and can make someone completely independent from being forced into the capitalist machine. America in particular hates your average joe being able to easily break out of poverty. Just look at how they are treating marijuana. Locked up minorities for it and now have a majority of farmers being white males while minority farmers sit in prison. Tacking on a bunch of operating costs and taxes to paywall the working class out.",
            "title_similarity": "0.71060205",
            "sentiment_compound": -0.7096
        },
        {
            "id": "he9idso",
            "score": 1,
            "text": "I believe these rules are intact to penalize and control sex workers. In my locale about 4 police departments have been known to run rings of underaged girls and everytime the feds bust it up it just happens again a few cities over.",
            "title_similarity": "0.6397419",
            "sentiment_compound": 0.2023
        },
        {
            "id": "he9ieex",
            "score": 1,
            "text": "Didn't sex trafficking explode in places with legal prostitution? I recall reading about how bad it got in Amsterdam",
            "title_similarity": "0.72475326",
            "sentiment_compound": -0.4588
        },
        {
            "id": "he9ijpq",
            "score": 1,
            "text": "Tough on crime laws spawns 😈 and 🐉 from Oblivion.",
            "title_similarity": "0.67511415",
            "sentiment_compound": -0.25
        },
        {
            "id": "he9iqpj",
            "score": 1,
            "text": "The point of criminalizing it isn’t to decrease the risks to “sex workers”.",
            "title_similarity": "0.6263522",
            "sentiment_compound": -0.2732
        },
        {
            "id": "he9iuxu",
            "score": 1,
            "text": "I mean, couldn't the same argument be made for anything that's criminalized? There wouldn't be drug deals gone bad if drugs were legal",
            "title_similarity": "0.5782489",
            "sentiment_compound": -0.224
        },
        {
            "id": "he9ix4g",
            "score": 1,
            "text": "I have said this for years. As someone who works with the underprivileged, I have seen this first hand.",
            "title_similarity": "0.32208812",
            "sentiment_compound": 0.4939
        },
        {
            "id": "he9j0d4",
            "score": 1,
            "text": "The New York Times has been running several anti-sex-positive editorials, none with a rebuttal. They make it sound like there will soon be a wave of youthful interest to prohibit many sex-related things such as prostitution and pornography. Yet here we see again that legalization, with regulation and education, are a far better process. So I don't know, soon I may become a cranky old guy who has what the youth perceive as backwards views, but it's tough for me not to follow the science.",
            "title_similarity": "0.6924265",
            "sentiment_compound": 0.5574
        },
        {
            "id": "he9j0yp",
            "score": 1,
            "text": "It also makes it harder to prosecute men for assaulting prostitutes or raping them. But come on you don't really care about women as long as you get your rocks off.",
            "title_similarity": "0.7815645",
            "sentiment_compound": -0.8647
        },
        {
            "id": "he9jkxs",
            "score": 1,
            "text": "Yeah prostitution should be legal. There's really no good argument against it.",
            "title_similarity": "0.50670636",
            "sentiment_compound": 0.3984
        },
        {
            "id": "he9jl53",
            "score": 1,
            "text": "Idk. This could also increase the number of divorces and paranoia in couples.\n\nEdit: Still it's a no-brainer to make a safer environment. I remember reading that the Japanese used to have prostitutes who were considered highly educated. Being a prostitute was also about helping people through therapy back then.",
            "title_similarity": "0.70728695",
            "sentiment_compound": 0.6369
        },
        {
            "id": "he9k0wg",
            "score": 1,
            "text": "The only risks that sex work incurs are to a few very old, very prurient pseudo Christian fools.",
            "title_similarity": "0.48396432",
            "sentiment_compound": -0.6486
        },
        {
            "id": "he9k4gw",
            "score": 1,
            "text": "And I've also read reports that legalized sex work increases sex trafficking. Case in point is Nevada. I'm not against sex worker's rights, just think this subject is interesting with such conflicting views.",
            "title_similarity": "0.69750595",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9k74f",
            "score": 1,
            "text": "Please add most trafficking cases these days are simple prostitution renamed to increase financial and manpower support from war on drugs failure.\n\nGreat study though. Illegal just destroys lives",
            "title_similarity": "0.78841656",
            "sentiment_compound": -0.6124
        },
        {
            "id": "he9koma",
            "score": 1,
            "text": "Everybody who has researched the topic already knows this, some people just pretend not to because they think sex is gross.",
            "title_similarity": "0.5825814",
            "sentiment_compound": -0.5423
        },
        {
            "id": "he9ksv9",
            "score": 1,
            "text": "Can someone give us the TL;DR",
            "title_similarity": "0.08530001",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9l03n",
            "score": 1,
            "text": "But Prostituting Criminals has the opposite effect.",
            "title_similarity": "0.50989795",
            "sentiment_compound": -0.7227
        },
        {
            "id": "he9l75h",
            "score": 1,
            "text": "Same thing with the war on drugs. You could literally have the death penalty and it wouldn't stop people. Let's all grow up, accept, and work with human nature already.",
            "title_similarity": "0.58838534",
            "sentiment_compound": -0.808
        },
        {
            "id": "he9lugw",
            "score": 1,
            "text": "Sex work is real work",
            "title_similarity": "0.489811",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9m4r2",
            "score": 1,
            "text": "I think it should be legal so it’s safer for everyone and is taxed",
            "title_similarity": "0.3575406",
            "sentiment_compound": 0.5542
        },
        {
            "id": "he9m4ut",
            "score": 1,
            "text": "\"Wish I could read\" - every politician which could make changes.",
            "title_similarity": "0.37881726",
            "sentiment_compound": 0.4019
        },
        {
            "id": "he9m57f",
            "score": 1,
            "text": "\"Things that should be common sense but aren't\" for 200, Mayim.",
            "title_similarity": "0.2724618",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9mbox",
            "score": 1,
            "text": "Prostitution is legal in Germany. That’s why many guys from neighboring countries come to Germany to have fun.",
            "title_similarity": "0.5567367",
            "sentiment_compound": 0.5859
        },
        {
            "id": "he9mtfi",
            "score": 1,
            "text": "Same with weed and abortions.",
            "title_similarity": "0.21538672",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9nckk",
            "score": 1,
            "text": "Get some w-2s giggolos",
            "title_similarity": "0.12493465",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9nxl7",
            "score": 1,
            "text": "We’ve known this for years. Just like outlawing abortion doesn’t prevent it from happening.",
            "title_similarity": "0.32744318",
            "sentiment_compound": 0.3818
        },
        {
            "id": "he9o2ff",
            "score": 1,
            "text": "Can't find something your not looking for.",
            "title_similarity": "0.14049652",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9o93g",
            "score": 1,
            "text": "I think the people behind this sort of study are the same ones behind making weed legal. \n\nWe will use things like medicinal weed but the main goal isn't pain or protection ( in this case) , it's making sure your hubby or son or daughter keep the supply and demand at an all time high.",
            "title_similarity": "0.44438386",
            "sentiment_compound": 0.7752
        },
        {
            "id": "he9posr",
            "score": 1,
            "text": "Same thing with drugs. Wierd how that works.",
            "title_similarity": "0.27075154",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9pugs",
            "score": 1,
            "text": "It’s like the same argument as abortion. You might not like it, but criminalizing it makes everything worse.",
            "title_similarity": "0.6818319",
            "sentiment_compound": -0.6913
        },
        {
            "id": "he9puw2",
            "score": 1,
            "text": "How about we criminalize it but target the pimps and traffickers rather than punishing the women?",
            "title_similarity": "0.75098157",
            "sentiment_compound": -0.7096
        },
        {
            "id": "he9qa5t",
            "score": 1,
            "text": "yes prohibition for nonviolent crimes doesn't work and is unnecessary.",
            "title_similarity": "0.48159605",
            "sentiment_compound": 0.4019
        },
        {
            "id": "he9qhry",
            "score": 1,
            "text": "If someone wants to sell there body for money let them. There body there choice.",
            "title_similarity": "0.44828916",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9qnvn",
            "score": 1,
            "text": "Well yeah. If the cops are pulling up to check on them and verify photo IDs and ask if they’ve had any problems with customers/pimps they’ll cooperate. It’ll be a lot harder for that 16 year old to hide/be hidden if her fellow prostitutes don’t scatter like roaches when the police come by.",
            "title_similarity": "0.72359705",
            "sentiment_compound": 0.4767
        },
        {
            "id": "he9r59m",
            "score": 1,
            "text": "Idk why prostitution is so illegal now, they really don't want people busting",
            "title_similarity": "0.6518336",
            "sentiment_compound": -0.7591
        },
        {
            "id": "he9r9dy",
            "score": 1,
            "text": "Is there a justified reason as to why prostitution should be illegal?",
            "title_similarity": "0.6381684",
            "sentiment_compound": -0.2263
        },
        {
            "id": "he9rbk7",
            "score": 1,
            "text": "and Lonely assholes like me end up stimulating the economy less too. go figure",
            "title_similarity": "0.5442067",
            "sentiment_compound": -0.2263
        },
        {
            "id": "he9s1i1",
            "score": 1,
            "text": "now do one for legalizing drugs",
            "title_similarity": "0.3184616",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9sxwk",
            "score": 1,
            "text": "Yeah it's legal in Aus and keeps the lads happy.",
            "title_similarity": "0.143479",
            "sentiment_compound": 0.7506
        },
        {
            "id": "he9t21k",
            "score": 1,
            "text": "May also put an end to all these “content” sellers. Im all for it.",
            "title_similarity": "0.3504364",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9td77",
            "score": 1,
            "text": "New Zealand has decriminalized prostitution since 2003 as an alternative to The ‘Swedish model’ in prostitution policy criminalises the purchase of sexual services in the belief that sex workers can be made safe only by ending demand.  How the hell do you end demand, \"cut every cock off\", oldest business in the world and it's still cannot be accepted as a legal business by religious zealous and bigotry.",
            "title_similarity": "0.68208224",
            "sentiment_compound": -0.7363
        },
        {
            "id": "he9tk6p",
            "score": 1,
            "text": "There’s a reason why a majority of serial killers have historically targeted the sex worker community",
            "title_similarity": "0.68911326",
            "sentiment_compound": -0.6486
        },
        {
            "id": "he9tqgm",
            "score": 1,
            "text": "Exactly why things like sex trafficking in areas where prostitution is legal seems to be higher than other areas, because the victims of sex trafficking are more likely/willing to speak up about it in those areas.      \nThey have fear instilled in them that they'll go to jail for what they've been doing, so they don't bring it up. However in places where it's legal that fear is relieved/non-existent, so it's more likely for them to speak out about it.",
            "title_similarity": "0.8244979",
            "sentiment_compound": -0.6369
        },
        {
            "id": "he9tqsc",
            "score": 1,
            "text": "I still have no idea why to this day prostitution is still illegal in the US.",
            "title_similarity": "0.5199423",
            "sentiment_compound": -0.7003
        },
        {
            "id": "he9tuj9",
            "score": 1,
            "text": "Legalize it so I don’t have to move to Nevada.",
            "title_similarity": "0.24260455",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9u171",
            "score": 1,
            "text": "Yep just like how keeping drugs illegal only causes mote problems . The solution is to legalize , educate and regulate",
            "title_similarity": "0.6181569",
            "sentiment_compound": -0.0772
        },
        {
            "id": "he9u2vw",
            "score": 1,
            "text": "Shocking. SHOCKING I say!",
            "title_similarity": "0.23903231",
            "sentiment_compound": -0.7525
        },
        {
            "id": "he9u5js",
            "score": 1,
            "text": "File this under 'things sex workers could have told you if you bothered to ask them'.",
            "title_similarity": "0.5270278",
            "sentiment_compound": -0.3182
        },
        {
            "id": "he9ucf8",
            "score": 1,
            "text": "So you’re saying that making things illegal endangers those that do them anyway?",
            "title_similarity": "0.6268406",
            "sentiment_compound": -0.5574
        },
        {
            "id": "he9uf0s",
            "score": 1,
            "text": "If you look at prohibition of anything else, and see how well it works, maybe laws against prostitution should be revisited. Everyone has needs. It’s primal and biology, baby!",
            "title_similarity": "0.6013622",
            "sentiment_compound": 0.3382
        },
        {
            "id": "he9uhdl",
            "score": 1,
            "text": "Same thing with drugs. It literally causes more problems than it \"solves\"",
            "title_similarity": "0.66027045",
            "sentiment_compound": -0.2247
        },
        {
            "id": "he9uhqs",
            "score": 1,
            "text": "There are so many laws that hinder us all as a society. Our tax dollars go towards keeping people in jail. People who may not be able to afford to pay tickets for smaller driving errors, people who smoke weed, prostitutes who are just trying to survive, and many more are really in jail. We waste so much money keeping them in there and when they get out, they now have less of a chance at becoming productive members of society with their new records. legalizing many things and ending severe actions against small mistakes would be a big step in the right direction. The laws are currently set up to waste our money on keeping people down. Instead, use that money to actually help people do better for themselves.",
            "title_similarity": "0.80018866",
            "sentiment_compound": -0.7322
        },
        {
            "id": "he9urs0",
            "score": 1,
            "text": "I thought decriminalizing prostitution made it harder to catch human traffickers?",
            "title_similarity": "0.86099887",
            "sentiment_compound": 0.0
        },
        {
            "id": "he9v6yn",
            "score": 1,
            "text": "Prostitution is for rich ppl as most things.",
            "title_similarity": "0.5443813",
            "sentiment_compound": 0.5574
        },
        {
            "id": "he9v7of",
            "score": 1,
            "text": "That study from germany says different, which is odd.",
            "title_similarity": "0.37930673",
            "sentiment_compound": -0.3182
        },
        {
            "id": "he9vkyd",
            "score": 1,
            "text": "Yea I mean I’m not personally down to go purchase sex, but it’s crazy that the government thinks it has the authority to tell two consenting adults that they’re not legally allowed to proceed with a transaction.",
            "title_similarity": "0.55560416",
            "sentiment_compound": -0.4756
        },
        {
            "id": "he9vy3n",
            "score": 1,
            "text": "I usually lean libertarian but this is one I'm not so sure about. I'm not really into the trend recently of glorifying \"sex work\". It's a terrible path to go down and I don't think we should be normalizing that. Just like drugs, I would agree with decriminalization.... but man I just an not sold on completely legalizing yet.",
            "title_similarity": "0.6195859",
            "sentiment_compound": 0.6357
        },
        {
            "id": "he9w2vd",
            "score": 1,
            "text": "How likely is it that fembots make sex workers obsolete?",
            "title_similarity": "0.60734135",
            "sentiment_compound": -0.296
        },
        {
            "id": "he9w9em",
            "score": 1,
            "text": "Make it legal so women have to compete with sex workers. What guy is going to go through the trouble of paying for dinner, movies, and vacations when he can go to a brothel and drop $200 on exactly what he's after.",
            "title_similarity": "0.65701187",
            "sentiment_compound": -0.5106
        },
        {
            "id": "he9wf3w",
            "score": 1,
            "text": "It’s still going to be illegal to have Sex with kids. So there will always be sex trafficking. It might bring it down some. Unfortunately there will always be the creeps that want underage and even pubescent.",
            "title_similarity": "0.78605956",
            "sentiment_compound": -0.6908
        },
        {
            "id": "he9wrqs",
            "score": 1,
            "text": "Basic answer is ..... Prohibit something = increased harms to the individual and society, but a payday for the people (authorities/governments) responsible for the prohibition....\n\nEg\nCannabis costs 20c per ounce pre prohibition... Make it a prohibited substance... The value shoots up 20000% on the black market... Police get more work, lawyers get more work, judges get more work, jails get more work(revenue/job creators) ... Etc... \n\nThe artificially high amount of money made still goes into legitimate banks and benefits the countries economy... It makes more money, makes more jobs keeping things illegal... \nImmoral to do that to  people but spun in a way to make the drug user the criminal rather than the immoral  system that creates criminals via their immoral laws.",
            "title_similarity": "0.6457008",
            "sentiment_compound": -0.9584
        },
        {
            "id": "he9y509",
            "score": 1,
            "text": "Which is why they stopped prosecuting in NYC… epic waste of resources. The cops couldn’t wait fir weed to be legal here btw… much more pressing issues at work",
            "title_similarity": "0.6396873",
            "sentiment_compound": -0.4939
        },
        {
            "id": "he9yaey",
            "score": 1,
            "text": "Yes because public policy isn't about science its about ideology and control. Science also isn't purely about science either.",
            "title_similarity": "0.32928368",
            "sentiment_compound": 0.4019
        },
        {
            "id": "he9yt8e",
            "score": 1,
            "text": "A 2012 study directly contradicts this, finding that legalization actually [increases human trafficking.](https://orgs.law.harvard.edu/lids/2014/06/12/does-legalized-prostitution-increase-human-trafficking/)",
            "title_similarity": "0.6582416",
            "sentiment_compound": -0.34
        },
        {
            "id": "he9z00f",
            "score": 1,
            "text": "Thats why in Sweden its not illegal to sell sex, but it is illegal to buy sex.",
            "title_similarity": "0.5414028",
            "sentiment_compound": -0.6044
        },
        {
            "id": "he9zjv8",
            "score": 1,
            "text": "The reason why prostitution is legal in most western nations, but not in the US, is because US law is not really about ensuring public safety and harmony.  It is more about about expressing an official statement of belief. \n\nIn the US, laws are developed from a place of ideology, and they are ruthlessly prosecuted to express distaste for anyone who offends those who hold the ideology. It’s also why sentencing rules are so heavy-handed. The system focuses on punishment as a vindictive response to offense, rather prevention of crime or rehabilitation or reducing recidivism. In other cultures, people might say “sadly we need prisons to keep society safer”, in the US people might say “lock them up because that person deserves it”. There’s a sort of vindictive delight toward sentencing criminals that goes hand in hand with a deeply individualistic society. \n\nIt’s no surprise that a third of all female prisoners globally are in the US, and a quarter of all prisoners overall are in the US (despite only comprising about 4% of the world’s population).",
            "title_similarity": "0.7671201",
            "sentiment_compound": -0.9609
        },
        {
            "id": "he9zo8k",
            "score": 1,
            "text": "Gee who woulda thought criminalizing something bad would make the problem even worse",
            "title_similarity": "0.6009367",
            "sentiment_compound": -0.8519
        },
        {
            "id": "he9zy3x",
            "score": 1,
            "text": "Criminalizing anything makes it more dangerous by driving it underground but I'm not okay with legalizing the sale of humans.  Drugs?  Sure.  Gambling, abortion, responsible gun ownership, etc.  Yes.  But to treat human beings like a commodity to be bought and sold for sexual slavery is not okay.  This is not a career anyone aspires to.  \n\nYou can and should still prosecute the pimps and johns while leaving the prostitutes themselves alone and offering them resources.  Legalizing will never remove the pimps from the picture entirely--they'll still be lurking in the background, pushing their girlfriends, wives and daughters to sell their bodies in this way regardless.  \n\nThis type of comment is not likely to be popular on male-dominated reddit but idc.  Men who buy sex are repugnant.  If you know anything about how and WHY women get into this business, it's never because of anything positive and they usually get in as minors.  You're buying traumatized, abused victims of trafficking even in a best-case scenario.  They don't enjoy their job and they don't like you back.",
            "title_similarity": "0.75369906",
            "sentiment_compound": -0.9325
        },
        {
            "id": "hea05f4",
            "score": 1,
            "text": "Is this true? I’ve seen Conservatives point to evidence that claims the contrary. So which is it?",
            "title_similarity": "0.32857674",
            "sentiment_compound": 0.4871
        },
        {
            "id": "hea07pw",
            "score": 1,
            "text": "I believe the entire issue behind this situation is that there ARE those that HAVE to or FEEL THEY HAVE TO to to prostitution to make a living. I believe the initial issue is constantly overlooked when discussing prostitution. It's been a form of employment for thousands of years, yet most of those thousand year old jobs have evolved to weed out human misery. Not prostitution, though. I feel that wrath, lust and pride are humanities greatest issues, and science strokes ego, constantly, so I hope the science solves the issue, not the outcome.",
            "title_similarity": "0.67010105",
            "sentiment_compound": 0.7951
        },
        {
            "id": "hea0k1t",
            "score": 1,
            "text": "I can't believe they're figuring this out now.",
            "title_similarity": "0.22774404",
            "sentiment_compound": 0.0
        },
        {
            "id": "hea16z6",
            "score": 1,
            "text": "So make it legal? Shut up!!!",
            "title_similarity": "0.27278075",
            "sentiment_compound": 0.3899
        },
        {
            "id": "hea19o9",
            "score": 1,
            "text": "Don’t know why they don’t do legalize, mandatory testing bi-weekly, taxing, and make it illegal for those not licensed.",
            "title_similarity": "0.5865406",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hea1kb6",
            "score": 1,
            "text": "What the duck is underage prostitution?",
            "title_similarity": "0.5903492",
            "sentiment_compound": 0.0
        },
        {
            "id": "hea1zjg",
            "score": 1,
            "text": "Stripping is legal and underage girls still end up doing it. I think the legalization and trafficking are two different issues, unfortunately.",
            "title_similarity": "0.67926854",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hea20um",
            "score": 1,
            "text": "Not to mention the government shouldn’t be putting people in cages for what two consenting adults do in privacy, so long as it doesn’t hurt anyone else. Also, isn’t pornography just paid sex/prostitution but somehow made legal because there’s a camera there?",
            "title_similarity": "0.62727964",
            "sentiment_compound": -0.1154
        },
        {
            "id": "hea2hmm",
            "score": 1,
            "text": "Wow do the war on drugs next. Baby steps.",
            "title_similarity": "0.49665257",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hea2pzv",
            "score": 1,
            "text": "That is the consequence perhaps, but what does legalizing it say about our virtues?",
            "title_similarity": "0.3443632",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hea2s3y",
            "score": 1,
            "text": ">Criminalizing prostitution increases risks to sex workers and makes it harder to stop underage prostitution and sex trafficking  \n  \n  \nThat's the whole idea...",
            "title_similarity": "0.98881054",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hea31gw",
            "score": 1,
            "text": "Why is this in r science?",
            "title_similarity": "0.18703666",
            "sentiment_compound": 0.0
        },
        {
            "id": "hea38em",
            "score": 1,
            "text": "What if people didn't have to sell their bodies to make money and support themselves?",
            "title_similarity": "0.40054992",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hea49ka",
            "score": 1,
            "text": "It seems like criminalizing anything just makes it ten times more dangerous than it needs to do, whether it's drugs, prostitution, or abortion. I hope that some day we do away with these pointless \"morality\" laws that do more harm than good.",
            "title_similarity": "0.7807168",
            "sentiment_compound": 0.0971
        },
        {
            "id": "hea4aje",
            "score": 1,
            "text": "All criminalists have known this for years. Nobody wants to hear the reality. Moralizing and demonizing is so much more fun.",
            "title_similarity": "0.48542207",
            "sentiment_compound": 0.5936
        },
        {
            "id": "hea4iul",
            "score": 1,
            "text": "Not cool, forcibly sex trafficked prostitutes being criminalized? Crack down on anyone involved with sex trafficking and end the problem right there, checking borders better wouldn’t hurt either. For instance maybe countries could invest in a program where if sex trafficked people were being transported from France to U.K. by plane the sex trafficked woman could declare that she was being sex trafficked and be put under some kind of protection during the investigation. An EU wide agreement on something like this would be beneficial, the sex trafficking “industry” in Europe is pretty bad. “Criminalizing prostitution increases risks to sex workers” obviously, it’s like criminalizing theft would increase risks for thieves.",
            "title_similarity": "0.7993406",
            "sentiment_compound": 0.1124
        },
        {
            "id": "hea4yex",
            "score": 1,
            "text": "criminalizing prostitution also makes the world objectively less fun.... which is arguably much more important than abstract social issues.",
            "title_similarity": "0.7710639",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hea53fd",
            "score": 1,
            "text": "Plus it would be nice to pay for sex every now and then.  Rather then insulting people left and right and telling them I just want to boink them without a relationship.",
            "title_similarity": "0.633265",
            "sentiment_compound": -0.128
        },
        {
            "id": "hea5kub",
            "score": 1,
            "text": "We need to have Government Hoes!\nY’all figure out the rest",
            "title_similarity": "0.358303",
            "sentiment_compound": 0.0
        },
        {
            "id": "hea6439",
            "score": 1,
            "text": "Criminalizing any activity makes it risky on the perpetrators. Criminalizing bank robbery is hard on bank robbers. Title not well thought out.",
            "title_similarity": "0.7325937",
            "sentiment_compound": -0.6142
        },
        {
            "id": "hea6c18",
            "score": 1,
            "text": "Anti prostitution and anti abortion...doing God's will ...if it's God's  will to endanger and disempower women.",
            "title_similarity": "0.5954511",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hea6pxc",
            "score": 1,
            "text": "Legalize, but don’t normalize. If we make this common again society will slip and women will ultimately lose personal rights again.",
            "title_similarity": "0.6014525",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hea7fij",
            "score": 1,
            "text": "Wow it’s almost like bans and prohibition don’t work",
            "title_similarity": "0.4183436",
            "sentiment_compound": 0.719
        },
        {
            "id": "hea7wj7",
            "score": 1,
            "text": "Could people stop bringing up drugs and alcohol as a comparison?\n\nSex workers are not products and they are not made in factories.",
            "title_similarity": "0.4911655",
            "sentiment_compound": -0.296
        },
        {
            "id": "hea8r0u",
            "score": 1,
            "text": "Yes. Tried to convince my old roommate of this but he wouldnt budge",
            "title_similarity": "0.34262654",
            "sentiment_compound": 0.3291
        },
        {
            "id": "hea8roa",
            "score": 1,
            "text": "Street walkers need a safe street no doubt … it ain’t going away just like drinking didn’t go away during prohibition. Regulate it and be done. And let’s be real for a moment, sure it nice to think everyone can be doctors and tech billionaires but we know that’s not true. Also not everyone is gonna be able to find love but still deserve a piece of it… even if it’s paid for. Loneliness ain’t nothing to dismiss. Keep it safe and protect it. IMO",
            "title_similarity": "0.5257199",
            "sentiment_compound": 0.921
        },
        {
            "id": "hea9229",
            "score": 1,
            "text": "If sex work is real work, you can reject communism with feminist principles. My body, my choice.",
            "title_similarity": "0.57840735",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hea9gvp",
            "score": 1,
            "text": "Really? This be new science? 🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️🤦🏻‍♂️",
            "title_similarity": "0.17401648",
            "sentiment_compound": 0.0
        },
        {
            "id": "hea9j5j",
            "score": 1,
            "text": "Similar story with drugs",
            "title_similarity": "0.36116567",
            "sentiment_compound": 0.0
        },
        {
            "id": "hea9mg4",
            "score": 1,
            "text": "Is it because when there's a legal way to do it, everyone who can do it legally will get registered, and everyone who shouldn't be doing it can't get registered, which sets them apart to be spotted more easily if they do it anyway?\n\nFor instance, right now, you'd have a brothel full of 100% unregistered workers, all doing it illegally. Some children are among them, also doing it illegally, because they can blend in since everyone's breaking the law. With sex work decriminalized, you'd have a brothel full of registered workers, doing it legally, and the children wouldn't be able to register for obvious reasons, creating trouble for the business that wants to use them.",
            "title_similarity": "0.730795",
            "sentiment_compound": 0.5413
        },
        {
            "id": "hea9ug5",
            "score": 1,
            "text": "I know it's in the name but idk if i would consider this what the sub is for. Interesting data nonetheless but i feel like it belongs in politics or something",
            "title_similarity": "0.4078436",
            "sentiment_compound": 0.7351
        },
        {
            "id": "heaa55e",
            "score": 1,
            "text": "So stop criminalizing it, you who still do.",
            "title_similarity": "0.19518568",
            "sentiment_compound": -0.3597
        },
        {
            "id": "heaa909",
            "score": 1,
            "text": "The people pushing to keep criminalizing it don’t care.",
            "title_similarity": "0.5340189",
            "sentiment_compound": 0.4939
        },
        {
            "id": "heaa9h8",
            "score": 1,
            "text": "if this is true explain Inda to me where underage sex is illegal but prostitution is law, and most prostitutes or kids",
            "title_similarity": "0.6752558",
            "sentiment_compound": -0.1027
        },
        {
            "id": "heac3n7",
            "score": 1,
            "text": "so from my experience with legal prostitution was that it's safer (in terms of being a criminal victim) for everyone involved, both the client and worker, but especially the worker. As a client you know you won't get scammed and potentially victimized (if you go to a reputable location) and that it will be like a service as any other. For the worker they can feel safe knowing they can document the interaction and report to the police, if they're a victim, and not get arrested for it.",
            "title_similarity": "0.60559887",
            "sentiment_compound": 0.5394
        },
        {
            "id": "heac7pv",
            "score": 1,
            "text": "The real reason these anti prostitution laws exist is so that the politicians who pass these laws have access to inexpensive prostitutes. If it were legalized, it would be taxed and that would drive up the costs.",
            "title_similarity": "0.7095072",
            "sentiment_compound": -0.3182
        },
        {
            "id": "heacazx",
            "score": 1,
            "text": "I'm all for it. Would have made my single life between wives much cheaper.",
            "title_similarity": "0.39165437",
            "sentiment_compound": 0.0
        },
        {
            "id": "heacct5",
            "score": 1,
            "text": "Criminalize buying sex. Jail the John’s.",
            "title_similarity": "0.63987887",
            "sentiment_compound": 0.0
        },
        {
            "id": "heaco8h",
            "score": 1,
            "text": "We’ve known this forever. Prohibition ALWAYS makes things worse",
            "title_similarity": "0.519681",
            "sentiment_compound": -0.4767
        },
        {
            "id": "heacpp6",
            "score": 1,
            "text": "Thereby making it easier for pedophiles and human traffickers.\n\nGoal achieved.",
            "title_similarity": "0.5507146",
            "sentiment_compound": 0.4215
        },
        {
            "id": "heacpsv",
            "score": 1,
            "text": "And decriminalizing it encourages sex trafficking, as they found out in the Netherlands.",
            "title_similarity": "0.67383707",
            "sentiment_compound": 0.4404
        },
        {
            "id": "heacx5b",
            "score": 1,
            "text": "“Making murder illegal increases risk to murderers and makes it harder to stop underage killings and hit men”",
            "title_similarity": "0.8919647",
            "sentiment_compound": -0.9698
        },
        {
            "id": "headdg9",
            "score": 1,
            "text": "Here in Sweden it is legal to sell sex but illegal to buy sex. I think it’s because not punishing the woman when she’s already in need of help.",
            "title_similarity": "0.63507545",
            "sentiment_compound": 0.4188
        },
        {
            "id": "headdsu",
            "score": 1,
            "text": "This doesn't surprise me. If you criminalize it, people are gonna find ways of doing it but in more risky and dangerous ways.",
            "title_similarity": "0.6274448",
            "sentiment_compound": -0.8221
        },
        {
            "id": "heaepg6",
            "score": 1,
            "text": "I work for a domestic violence resource center and a big part of what we do centers on helping trafficking survivors. When we criminalize sex work, oftentimes the people who face criminal consequences are the survivors and not their traffickers. Because of the power imbalance and level of control traffickers hold over the people they trafficking, survivors are often incredibly afraid of sharing who they are being trafficked by or cannot name that person because they do not use their real name.\n\nDecriminalization is needed to protect voluntary sex workers and better protect people from being trafficked. It's not a perfect solution but we see far too many people in trouble with the law for something they are forced to do for fear of losing their lives.",
            "title_similarity": "0.8387595",
            "sentiment_compound": -0.946
        },
        {
            "id": "heaesl3",
            "score": 1,
            "text": ">In the UK\n\nThe title misses the most important. You need an extremely well knit rule of law system to make legal prostitution “work” and even *then* there will be problems where civil society and state need to work together (see Amsterdam)",
            "title_similarity": "0.64853626",
            "sentiment_compound": 0.0992
        },
        {
            "id": "heaeyuq",
            "score": 1,
            "text": "Prohibition doesn't work.",
            "title_similarity": "0.32758206",
            "sentiment_compound": 0.0
        },
        {
            "id": "heafgy9",
            "score": 1,
            "text": "But what does it do the family structure?   Shattered homes that kids these days come from does the most damage",
            "title_similarity": "0.6017366",
            "sentiment_compound": -0.8717
        },
        {
            "id": "heafhim",
            "score": 1,
            "text": "The only laws specifically governing prostitution should involve sexually transmitted infection testing and prevention, consent & Nothing else. All other worker protection and taxing law should Carry over.",
            "title_similarity": "0.4565246",
            "sentiment_compound": 0.2263
        },
        {
            "id": "heafoec",
            "score": 1,
            "text": "Apprently the problem is that there are not prostitutes so even jurisdictions with legal prostitution have trafficking.  Might help if the profession was respected more.",
            "title_similarity": "0.64833975",
            "sentiment_compound": 0.5574
        },
        {
            "id": "heagczq",
            "score": 1,
            "text": "“Laws make it harder for people who break them *morally* to be safe about it”",
            "title_similarity": "0.7485318",
            "sentiment_compound": 0.4404
        },
        {
            "id": "heagda4",
            "score": 1,
            "text": "Make marriage easy and allow polygamy, there will be no prostitution.",
            "title_similarity": "0.33248442",
            "sentiment_compound": 0.3818
        },
        {
            "id": "heagh3y",
            "score": 1,
            "text": "The second claim seems interesting.  Criminalizing anything increases the risk for those who engage in what’s been criminalized.",
            "title_similarity": "0.7521318",
            "sentiment_compound": 0.4588
        },
        {
            "id": "heahsvc",
            "score": 1,
            "text": "Sounds about right. Criminalizing any social behavior has never, ever worked. Prove me wrong.",
            "title_similarity": "0.39943668",
            "sentiment_compound": -0.4767
        },
        {
            "id": "heaif6s",
            "score": 1,
            "text": "It's strange, but sex seems to be the only thing that society demands has to be given away for free. There's not anything else i can think of that also fits that criteria",
            "title_similarity": "0.44841725",
            "sentiment_compound": 0.6187
        },
        {
            "id": "heaije1",
            "score": 1,
            "text": "When I wrote a paper about that in college everybody hated me",
            "title_similarity": "0.44672593",
            "sentiment_compound": -0.6369
        },
        {
            "id": "heaimto",
            "score": 1,
            "text": "Perhaps, but legalizing it still won’t do anything either. \nThere’ll still be pimps and chances for infection and everything else.",
            "title_similarity": "0.45676744",
            "sentiment_compound": 0.296
        },
        {
            "id": "heairzz",
            "score": 1,
            "text": "That has always been true, and we have always known it is true. The people who criminalize prostitution don't care about women or children, they only care about controlling and punishing women.",
            "title_similarity": "0.5899717",
            "sentiment_compound": 0.3761
        },
        {
            "id": "heajpr4",
            "score": 1,
            "text": "For profit prison systems\n\n\"oh no....\"",
            "title_similarity": "0.4033463",
            "sentiment_compound": -0.1027
        },
        {
            "id": "heak845",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0602018"
        },
        {
            "id": "heal5ar",
            "score": 1,
            "text": "It would also be great for de-stigmatizing it",
            "title_similarity": "0.40664658",
            "sentiment_compound": 0.6249
        },
        {
            "id": "healj31",
            "score": 1,
            "text": "This just seems to be a general trend. If you make something Illegal, demand for it rises.",
            "title_similarity": "0.6397904",
            "sentiment_compound": -0.6249
        },
        {
            "id": "healq4m",
            "score": 1,
            "text": "Why can’t the feds just legalize it and collect tax revenue off it",
            "title_similarity": "0.43415567",
            "sentiment_compound": 0.0
        },
        {
            "id": "heam5s7",
            "score": 1,
            "text": "America is sadly a \"sex is bad\" country. One of the few things I really dislike about this nation.",
            "title_similarity": "0.5580039",
            "sentiment_compound": -0.8479
        },
        {
            "id": "heamju5",
            "score": 1,
            "text": "Less chance getting a std  going to a brothel in Australia than picking up a stray",
            "title_similarity": "0.55244666",
            "sentiment_compound": 0.1796
        },
        {
            "id": "heanlf4",
            "score": 1,
            "text": "Good, maybe we can steer women away from being escorts",
            "title_similarity": "0.41694143",
            "sentiment_compound": 0.4404
        },
        {
            "id": "heanw1z",
            "score": 1,
            "text": "Sure but the religious right has a vice grip on America’s nuts so at least here in the US we stand no chance of the sensible thing being done.",
            "title_similarity": "0.52115345",
            "sentiment_compound": -0.5283
        },
        {
            "id": "heao1te",
            "score": 1,
            "text": "I don't understand their correlation between legal prostitution and reduced underage prostitution",
            "title_similarity": "0.68930984",
            "sentiment_compound": 0.128
        },
        {
            "id": "heaoxfp",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.0602018"
        },
        {
            "id": "heaperl",
            "score": 1,
            "text": "Makes sense to me. You can make money pounding your back from picking up boxes all day, why not from pounding your box with bodies?",
            "title_similarity": "0.60115063",
            "sentiment_compound": 0.0
        },
        {
            "id": "heaqnbf",
            "score": 1,
            "text": "We have known this for far more than 50 years now and still it remains idiotically illegal in most countries. It's obviously about religious repression and is clearly a law rooted in religion. If it were about keeping people safe and solving problems, it would have been fully legalized decades ago. This is how I feel about the drug war as well, though that atrocity is more about racism, classism and greed. Government will always cause more problems than it will ever portend to solve.",
            "title_similarity": "0.65512145",
            "sentiment_compound": -0.9181
        },
        {
            "id": "heaqwtk",
            "score": 1,
            "text": "Weird that criminalizing things makes it secret and not an above board and regulated business.",
            "title_similarity": "0.518139",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hear4cr",
            "score": 1,
            "text": "Oh so the countries who legalized prostitution have the least trafficking and underaged victims?",
            "title_similarity": "0.51522267",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hearewy",
            "score": 1,
            "text": "No it doesnt. Mandatory Military service for girls, and doctorate level education for all eliminates the problem.",
            "title_similarity": "0.3020497",
            "sentiment_compound": -0.6276
        },
        {
            "id": "hearl1n",
            "score": 1,
            "text": "Legalize prostitution, make it safe and criminalize the dangerous John’s instead. *voila*",
            "title_similarity": "0.6835681",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hearvzh",
            "score": 1,
            "text": "Because the only people who have the means to fight against sex trafficking are the rich and powerful. They make it easier for others to do so.",
            "title_similarity": "0.6222041",
            "sentiment_compound": 0.765
        },
        {
            "id": "heas5go",
            "score": 1,
            "text": "I mean if it’s ok to send women money for naked pictures videos etc then can’t see what’s wrong with paying for sex.",
            "title_similarity": "0.59062314",
            "sentiment_compound": -0.2263
        },
        {
            "id": "heasy3p",
            "score": 1,
            "text": "I just somehow have a feeling that these activities would still be going on in private with slaves no matter the commercial end of it. Some rich folk don’t want to be known and they don’t want you to know their hobbies.",
            "title_similarity": "0.49940866",
            "sentiment_compound": 0.6834
        },
        {
            "id": "heatag1",
            "score": 1,
            "text": "Shame that this is not obvious when thinking through the issues in a game-theoretic way. Inability to think of consequences is probably why we have many stupid laws. Criminalisation of prostitution also increases police corruption, which is the main reason New South Wales decriminalised prostitution some 30 years ago.",
            "title_similarity": "0.8057555",
            "sentiment_compound": -0.8481
        },
        {
            "id": "heaw9gv",
            "score": 1,
            "text": "I understand and agree, but is everything considered science now?",
            "title_similarity": "0.1576824",
            "sentiment_compound": 0.1901
        },
        {
            "id": "heawp2g",
            "score": 1,
            "text": "That seems like the point....",
            "title_similarity": "-0.11503793",
            "sentiment_compound": 0.3612
        },
        {
            "id": "heay6nz",
            "score": 1,
            "text": "How does decriminalizing it stop trafficking of underage girls?",
            "title_similarity": "0.72637475",
            "sentiment_compound": -0.296
        },
        {
            "id": "heaymvg",
            "score": 1,
            "text": "Decreasing border security facilitates human trafficking, yet here we are",
            "title_similarity": "0.69186336",
            "sentiment_compound": 0.34
        },
        {
            "id": "heayp9x",
            "score": 1,
            "text": "Yea but it being illegal is half the fun for the religious conservatives.",
            "title_similarity": "0.5158826",
            "sentiment_compound": -0.1154
        },
        {
            "id": "heb27ob",
            "score": 1,
            "text": "The paper provides little to no evidence for any of the conclusions presented. It's vapour.",
            "title_similarity": "0.27893537",
            "sentiment_compound": -0.2315
        },
        {
            "id": "heb2scz",
            "score": 1,
            "text": "I don't like the abstract. What is the conclusion?\n\nAlso, they don't seem to provide any reason (or cite any source) to believe their assertion \"Criminalization of sex work also makes the detection of under-age or trafficked people more difficult.\" Y'know, the bit in the title here.\n\nI don't know. They might be right, but I don't see a good argument being made.",
            "title_similarity": "0.7007966",
            "sentiment_compound": -0.8321
        },
        {
            "id": "heb42gb",
            "score": 1,
            "text": "John: Now you’re sure these girls are OVER 18 right? I’m just looking to get laid, not land on some high school the musical criminal investigation.\n\nPimp: “Yes sure of course. I looked at their school IDs myself”",
            "title_similarity": "0.516009",
            "sentiment_compound": 0.0516
        },
        {
            "id": "heb4b2c",
            "score": 1,
            "text": "Well, when all the people who make the laws are pedophiles it makes for an easier transfer of children to your private island.",
            "title_similarity": "0.53363895",
            "sentiment_compound": 0.5994
        },
        {
            "id": "heb4tau",
            "score": 1,
            "text": "criminalizing a lot of things that are is high demand just makes things worse...but we'll have to keep leaning this lesson...",
            "title_similarity": "0.6910994",
            "sentiment_compound": -0.128
        },
        {
            "id": "heb4yt8",
            "score": 1,
            "text": "Criminalizing almost anything cause this (see historical statistics)",
            "title_similarity": "0.54115105",
            "sentiment_compound": 0.0
        },
        {
            "id": "heb6x18",
            "score": 1,
            "text": "This has been know for a long time by doing different kind of studies in multiple countries.\n\nIt is not called the \"The oldest profession in the world\" for no reason. Like drugs, it will exist with or without legalization, at-least when its legal, it allows the women to seek help if needed without the fear of persecution.",
            "title_similarity": "0.4234848",
            "sentiment_compound": 0.3649
        },
        {
            "id": "heb7t2t",
            "score": 1,
            "text": "I was JUST thinking about this today when I saw an ad about \"be watchful for human trafficking\" on a bus from the government",
            "title_similarity": "0.4609899",
            "sentiment_compound": 0.0
        },
        {
            "id": "heb9aou",
            "score": 1,
            "text": "It's been about 90 years since reefer madness..... still haven't legalized that....\nCurrently limiting women's rights on pregnancy .\nThe good olde USA will never fully legalize sex work.",
            "title_similarity": "0.40755567",
            "sentiment_compound": 0.0
        },
        {
            "id": "hebalv1",
            "score": 1,
            "text": "Banning things doesn’t work except abortion apparently.",
            "title_similarity": "0.39790833",
            "sentiment_compound": 0.0
        },
        {
            "id": "hebbvtv",
            "score": 1,
            "text": "Thank you. Legalize and regulate.",
            "title_similarity": "0.12122008",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hebc9gu",
            "score": 1,
            "text": "Criminalizing stuff is always the problem, or just a way to amend some society problem.",
            "title_similarity": "0.7103952",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hebevaa",
            "score": 1,
            "text": "Anyone who has spent time in/around the sex industry knows this tbh. Glad to see it coming from other sources too, now.",
            "title_similarity": "0.4842466",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hebg34t",
            "score": 1,
            "text": "I thought this was obvious? I mean... criminalizing something that  a lot of people do won't stop people from doing it, it will just make people do it illegally and without any regulations. Ban the consumption of alcoholic beverages, and you get bootleg liquor that can make you blind and gangsters.",
            "title_similarity": "0.6735072",
            "sentiment_compound": 0.276
        },
        {
            "id": "hebgcts",
            "score": 1,
            "text": "Unfortunately the type of people that want to criminalise it don't actually care about the safety of sex workers.",
            "title_similarity": "0.6407314",
            "sentiment_compound": -0.233
        },
        {
            "id": "hebgfpr",
            "score": 1,
            "text": "You know what really helps?\n\nMake it an offence to buy, not sell.",
            "title_similarity": "0.5269363",
            "sentiment_compound": 0.1761
        },
        {
            "id": "hebgien",
            "score": 1,
            "text": "I've long held the belief that prostitution should be legal but pimping should be illegal and any 'security services' should be limited to a set rate/percentage of their income like a 5% cap. I'm not a prostitute but its the only way that makes sense to stop the victimization of these women/children and hopefully help curb the rampant drug problems in those communities.",
            "title_similarity": "0.64179474",
            "sentiment_compound": -0.6542
        },
        {
            "id": "hebgiow",
            "score": 1,
            "text": "I was reading one journal that said the opposite. That overall the economics of demand increases after legalization and that makes sex traffiking proportionally less common but on an absolute basis, more common.",
            "title_similarity": "0.60247886",
            "sentiment_compound": -0.0644
        },
        {
            "id": "hebgud3",
            "score": 1,
            "text": "Nothing has ever been made safer by handing its distribution solely in to the hands of criminals.",
            "title_similarity": "0.48762512",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hebixym",
            "score": 1,
            "text": "When you see the outpouring of violence that unleashed against Amnesty International when they said they would support legalization of sex work, it is truly scary…",
            "title_similarity": "0.7729872",
            "sentiment_compound": 0.128
        },
        {
            "id": "hebj1de",
            "score": 1,
            "text": "This is true for all \"vice crimes\" making them illegal just makes them more dangerous because criminals fill the need and there's no regulation. If only we made policy decisions based on scientific research.",
            "title_similarity": "0.71321833",
            "sentiment_compound": -0.8849
        },
        {
            "id": "hebl2p8",
            "score": 1,
            "text": "Do it like Germany, where prostitution is legal, fully regulated and taxed.",
            "title_similarity": "0.41094947",
            "sentiment_compound": 0.4588
        },
        {
            "id": "heblw5r",
            "score": 1,
            "text": "And the war on drugs creates more issues. Won’t change things unfortunately.",
            "title_similarity": "0.66756445",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hebmrp7",
            "score": 1,
            "text": "This study fails to point out that not criminalising main streams prostitution which brings along more problems.",
            "title_similarity": "0.5721969",
            "sentiment_compound": -0.6997
        },
        {
            "id": "hebol5i",
            "score": 1,
            "text": "Is there a study here that doesn't agree with what ypur average redditor thinks?",
            "title_similarity": "0.41942206",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hebpmln",
            "score": 3,
            "text": "In Australia it's legal in a brothel but streetwalking prostitution is illegal",
            "title_similarity": "0.5540578",
            "sentiment_compound": -0.6858
        },
        {
            "id": "hebs387",
            "score": 1,
            "text": "Drugs won the war on drugs, and sex has won the war on sex.\n\nJust legalize it, our society is completely and totally corrupt and bankrupt here in the states, the fact they think that prostitution is somehow the source of many bad things is silly.\n\nDrug addicts turning tricks are doing it legal or illegal to feed an addiction, which shockingly enough is also illegal.  You create the beast with which you want to hinder.",
            "title_similarity": "0.82357645",
            "sentiment_compound": -0.9345
        },
        {
            "id": "hebsrav",
            "score": 1,
            "text": "Any thoughts on the (recent?) change in Sweden aiming at making prositution sort of illegal by charging clients rather that prostitutes?\nThey seem to think it is sort of best of both worlds by having it illegal and not damaging the workers.",
            "title_similarity": "0.6863626",
            "sentiment_compound": -0.3058
        },
        {
            "id": "hebu0q8",
            "score": 1,
            "text": "Just like weed criminalisation",
            "title_similarity": "0.46191096",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hebvi21",
            "score": 1,
            "text": "Australia does it right.",
            "title_similarity": "0.11372599",
            "sentiment_compound": 0.0
        },
        {
            "id": "hebx8qn",
            "score": 6,
            "text": "It’s confusing to me that the (highly-regulated, above-board) Porn industry is allowed in our country, but prostitution/sex work is not. Kind of like how seatbelts are a hard rule in cars, but helmets on motorcycles are optional in many states. 🤷",
            "title_similarity": "0.5841775",
            "sentiment_compound": -0.6315
        },
        {
            "id": "hebznkx",
            "score": 2,
            "text": "I personally don't like prostitution, but if it helps keep those women and men safe: I'm fine with it.",
            "title_similarity": "0.50287426",
            "sentiment_compound": 0.8358
        },
        {
            "id": "hec0txn",
            "score": 1,
            "text": "They should get a liveable wage and not be dependend on tips or customers",
            "title_similarity": "0.33820328",
            "sentiment_compound": 0.0
        },
        {
            "id": "hec388m",
            "score": 1,
            "text": "What makes it so hard to legalize it? Turkey and Kurdistan, muslim majority countries allow both prostitution and abortion, it’s just morally and religiously wrong, we religious people do not (and should not) judge others and leave it to god (allah) to judge them.\n\nWhy is it such a huge problem in the west?",
            "title_similarity": "0.6077802",
            "sentiment_compound": -0.4453
        },
        {
            "id": "hec3ik9",
            "score": 1,
            "text": "Same with any vice, very much so in the war on drugs. Total failure.",
            "title_similarity": "0.5042597",
            "sentiment_compound": -0.8297
        },
        {
            "id": "hec4psg",
            "score": 1,
            "text": "Next you’ll be telling me the war on drugs is a bad idea",
            "title_similarity": "0.6378491",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hec5d62",
            "score": 1,
            "text": "This seems like the exact same thing that happens with criminalising abortion and drugs.",
            "title_similarity": "0.4220786",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hec5m59",
            "score": 1,
            "text": "Time to make buying illegal instead of selling",
            "title_similarity": "0.4495425",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hec73kz",
            "score": 1,
            "text": "Anything deemed “illegal” automatically skyrockets the price, thus tempting more people to sell",
            "title_similarity": "0.6725667",
            "sentiment_compound": 0.0
        },
        {
            "id": "hec7j7t",
            "score": 1,
            "text": "Not like the people who can change it will care. But good data is always nice.",
            "title_similarity": "0.38871312",
            "sentiment_compound": 0.844
        },
        {
            "id": "hec7otg",
            "score": 1,
            "text": "What is the world's oldest profession?\n\nProstitution should be legal.\n\nIs there any place in the world where death penalty is given for prostitution?",
            "title_similarity": "0.5652634",
            "sentiment_compound": -0.7757
        },
        {
            "id": "hec822g",
            "score": 1,
            "text": "Same goes for drugs, guns [in the right socio-economic circumstances(Switzerland and Czech Republic as prime examples)] etc.",
            "title_similarity": "0.47008768",
            "sentiment_compound": 0.0
        },
        {
            "id": "hec8zby",
            "score": 1,
            "text": "I think by this point it should be obvious that prohibition is bad universally",
            "title_similarity": "0.40781158",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hec9nt0",
            "score": 1,
            "text": "I’m from Australia where prostitution is legal. It’s so weird that now I live in “the land of the free” and they tell you what you can do with your body in so many ways…",
            "title_similarity": "0.4691968",
            "sentiment_compound": -0.1263
        },
        {
            "id": "hecc66l",
            "score": 1,
            "text": "De-criminalizing prostitution makes it harder for the police to know which are doing it willingly and which are being sex-trafficked and want to get out",
            "title_similarity": "0.871926",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hecd2l4",
            "score": 1,
            "text": "Gee it's almost like making something illegal just because you disagree with it has unforseen negative consequences on society",
            "title_similarity": "0.61858",
            "sentiment_compound": -0.8268
        },
        {
            "id": "hecpcga",
            "score": 1,
            "text": "Sex work is a consensual transaction between 2 informed, connecting adults. No 3rd party should have any business in it, government included. It's absurd that this is illegal. \n\nNot to mention that all the rules of dating have changed recently and now 27% of men under 30 haven't had sex in over a year. 27% of all young men are now incels. That situation is cruel, completely unnecessary and dangerous. Large groups of young men without reproductive hope are drawn to extremist movements. Until we legalize sex work, we're going to have a large destabilizing population to contend with. \n\nAnd of course, legalizing sex work helps sex workers' safety and legally opens up a job type that is preferable to some women. \n\nThere are plenty of good reasons to legalize sex work. Are there any good reasons to keep it illegal? \"My religion says so\" \"it feels icky to me\" and 'we've always done it that way\" are not good reason.",
            "title_similarity": "0.63678133",
            "sentiment_compound": -0.8964
        },
        {
            "id": "hecy59o",
            "score": 1,
            "text": "Same Problem with drugs, criminalizing just makes ist harder to control",
            "title_similarity": "0.799262",
            "sentiment_compound": -0.4019
        },
        {
            "id": "heczxnn",
            "score": 1,
            "text": "File this under list of things we've know for decades",
            "title_similarity": "0.054216746",
            "sentiment_compound": 0.0
        },
        {
            "id": "hed43w1",
            "score": 1,
            "text": "Legalizing it will create a profit incentive for corporations to exploit our bodies.",
            "title_similarity": "0.6110439",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hek4zng",
            "score": 1,
            "text": "You've gotten your title from things the authors tacked on at the end that they didn't even cite any other research for. The study was to assess whether the amount of clients changed after the legislature, it didn't, but they are using more women.\n\n>All in all, although of course we cannot establish causal links we can certainly observe that after the policy changes culminating in 2009 demand has not changed significantly, and the profile of clients has changed to one who paid for many partners, that also have a risky profile that raises concerns \n\nPaying for novelty is part of what increases trafficking. Look at Germany -- https://www.trauma-and-prostitution.eu/en/2016/11/02/the-german-model-is-producing-hell-on-earth/",
            "title_similarity": "0.64669216",
            "sentiment_compound": 0.0387
        },
        {
            "id": "heo801f",
            "score": 1,
            "text": "France criminalizes sollicitation which also drives it  underground in basements and untaxed, secretive organizations.... i was about to write \"what about criminalizing sollicitation\"  but i figure it's also counter productive.",
            "title_similarity": "0.6913005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hexx68z",
            "score": 1,
            "text": "I’m genuinely curious, how does criminalizing prostitution make it harder to track underage girls?",
            "title_similarity": "0.8334599",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hga6raj",
            "score": 1,
            "text": "r/science should really be science™️… politics",
            "title_similarity": "0.29985836",
            "sentiment_compound": 0.0
        }
    ]
}