{
    "Children today will live through three times more climate disasters than their grandparents, study suggests\n": [
        {
            "id": "hegv4t5",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.34370142",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hehj4nv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.060133323"
        },
        {
            "id": "heho44v",
            "score": 20,
            "text": "When youre working outside in 200°f heat, just think of how cool Bezos must have felt in space for 3 minutes. Now its alllllll worth it.",
            "title_similarity": "0.5620301",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hehxyqx",
            "score": 5,
            "text": "“Study suggests” these people are so shameless with their fear mongering",
            "title_similarity": "0.26833633",
            "sentiment_compound": -0.7973
        },
        {
            "id": "heh5jwr",
            "score": 47,
            "text": "The worldwide death rate from weather happenings has dropped over 98 percent since the 1920s\n\nhttps://reason.org/news-release/extreme-weather-kills-fewer-people/\n\nThe fact is less people due from \"climate disasters\" than ever before in human history. The reason more damage (in $) and more people are affected is because there is more physical infrastructure and more people present to be affected.",
            "title_similarity": "0.7298868",
            "sentiment_compound": -0.9254
        },
        {
            "id": "hei0qgl",
            "score": 1,
            "text": "Sorry future generations. Old white men who rule the world don’t care about you.",
            "title_similarity": "0.290672",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hehm89f",
            "score": -19,
            "text": "[deleted]",
            "title_similarity": "-0.0028480273"
        },
        {
            "id": "hehr9r9",
            "score": 5,
            "text": "Hence why until we see signs of reversal, IF we can even get signs of reversal at this point, I think it is extremely selfish to have children. Why would you want to give birth to a kid just for them to suffer in a world that is being killed by the human race? You want them to go through that hell? You don't feel slightly bad about it?",
            "title_similarity": "0.3594978",
            "sentiment_compound": -0.936
        },
        {
            "id": "hehmhjt",
            "score": -24,
            "text": "I have an 11 year old and it pisses me off boomers chose profits over the long term benefits of their gran kids. Damn greedy bastards had we acted in the 60s and 70s when we first knew the situation we could gave reversed this outcome.",
            "title_similarity": "0.5393194",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hei3kp4",
            "score": 10,
            "text": "sometimes i think the world would be better off without reddit. so much doom and gloom in here. so much cynicism and alarmism and predictions cited as fact. \n\nbut then i remember reddit is such a small portion of humanity. and you have this nice echo chamber of people reinforcing your biases and predictions.\n\nbut.. you’re here. and maybe that’s best. maybe it’s best you’re all here just whining on the internet and predicting the end of the world among yourselves. \n\nyou’re safe here. and the rest of the world is safe from you. this is probably best.",
            "title_similarity": "0.37186766",
            "sentiment_compound": 0.9811
        },
        {
            "id": "hehcurr",
            "score": 34,
            "text": "And yet we're gonna die about 98% less than our grandparents through 1/3 of the disasters",
            "title_similarity": "0.77873564",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hehmo25",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "-0.060133375"
        },
        {
            "id": "heh209z",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.060133375"
        },
        {
            "id": "hehtkha",
            "score": 0,
            "text": "Yeah so stop eating meat now!!!",
            "title_similarity": "0.14311507",
            "sentiment_compound": -0.289
        },
        {
            "id": "hehwpdk",
            "score": 3,
            "text": "Well, Millennials have *already* suffered through two once-in-a-century economic calamities before the age of 40. Two more than their Baby Boomer parents ever did at that age.\n\nWhy’s not three, or four, or even five more cataclysmic human environmental events (e.g. climate change, overpopulation) as well!",
            "title_similarity": "0.7708976",
            "sentiment_compound": 0.0
        },
        {
            "id": "hehu1zy",
            "score": 6,
            "text": "maybe it’s because we are constantly on social media and watching some form of news so we’re more aware of climate disasters going on around the world. I’ve never had a climate disaster affect me nor anyone close to me",
            "title_similarity": "0.45379904",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hehlhhl",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.060133323"
        },
        {
            "id": "hehp4wl",
            "score": -2,
            "text": "This is Mother Nature counter punching.",
            "title_similarity": "0.23233777",
            "sentiment_compound": 0.0
        },
        {
            "id": "hehfbaf",
            "score": 34,
            "text": "[removed]",
            "title_similarity": "-0.060133375"
        },
        {
            "id": "hehukkd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.060133375"
        },
        {
            "id": "hehy68s",
            "score": 3,
            "text": "This angers me... yet again they have failed to mention that if we controlled our animal agriculture output we could actually fight this climate change. Yet no one in the system wants to make personal sacrifices for our earth's wellbeing, but love to preach and throw the responsibility on companies when they are just responding to our consumerism. Here they are giving us numbers yet not specifying WHAT'S CAUSING THEM. \n\n\nWhy is animal agriculture bad for the environment?\n\nIn 2006, the United Nations stated[1]: \n\n“The livestock sector emerges as one of the top two or three most significant contributors to the most serious environmental problems, at every scale from local to global. The findings of this report suggest that it should be a major policy focus when dealing with problems of land degradation, climate change and air pollution, water shortage and water pollution, and loss of biodiversity.”\n\nAnd then four years later, they warned that a global shift towards a vegan diet is vital to save the world from hunger, fuel poverty and the worst impacts of climate change.[2]\n\nSo why exactly is animal farming bad for the environment?\n\nGlobally, 26 per cent of all the world’s ice-free land[3] surface is given to grazing animals and in total animal agriculture uses 83 per cent of all agricultural land[4], yet it provides less than 20 per cent of the calories consumed and less than 40 per cent of the protein[5] that is consumed.\n\nIn the UK, it is estimated that 85 per cent[6] of the land that is used for agriculture is just for animals, which is almost 50 per cent of the entire landmass of the UK.[7] And in the US, 41 per cent of the entire landmass is for animal farming compared to four per cent[8] which is used to grow plants directly for humans, with half of all agricultural land in the US being used specifically for beef production even though it makes up only three per cent of dietary calories.[9]\n\nAnimal farming is the leading cause of rainforest deforestation[10], the single largest driver of habitat loss[11] in general and agriculture, which also includes the farming of fish, is listed as being a threat to 24,000 of the 28,000 species[12] that are currently facing extinction.\n\nAnd when it comes to the Amazon specifically, cow ranching is reportedly responsible for 80 per cent of rainforest loss in the Brazilian Amazon[13], with a recent investigation by the Bureau of Investigative Journalism showing that in 2019, fires in the Amazon were three times more common[14] in areas where there is cattle ranching. When it comes to soy, it is estimated that around 90 per cent of all of the soy that is produced in Brazil is used as animal feed, and globally 75 per cent of all the soy[15] that is produced is used for animal feed, with only 6 per cent of whole soybeans that are produced being used to produce plant-based products like tofu, soy milk and plant-based alternatives. \n\nAs for emissions, a University of Oxford report stated that even if the use of fossil fuel was ended immediately, the emissions produced by the agricultural sector[16] alone would make it impossible to limit warming to 1.5 degrees celsius and would even make it difficult to not hit two degrees. This means changes to our food system are essential if we want to avoid making the coral reefs disappear, creating more extreme heatwaves, water scarcities, droughts and food shortages for hundreds of millions more people, forcing them to be climate refugees. It is also vital if we want to avoid the continuing demise of the world’s biodiversity, increasing rates of dead zones and species extinction and the rising of sea levels causing the flooding of major cities such as Mumbai, Shanghai, Miami and New York and the potential for islands in the South Pacific \n\nAnimal agriculture is responsible for producing between 14.5 and 18 per cent[17] of total greenhouse gas emissions (GHG), which makes it responsible for more emissions than the combined exhausts of all transport globally. The fishing method of bottom trawling alone is responsible for producing the same amount of emissions as the entire aviation industry.\n\nSwitching to a plant-based diet can reduce agricultural emissions by as much as 73 per cent[19] in high-income nations and a study, published in the journal Science of The Total Environment, that analysed 313 different potential food systems[20] discovered that the highest GHG emissions were found in the food systems that included a high meat demand, especially if focused on ruminant meat and milk, and the lowest emissions were from the vegan diets.",
            "title_similarity": "0.45701092",
            "sentiment_compound": -0.9874
        },
        {
            "id": "hehwf5v",
            "score": -7,
            "text": "Anyone saying they won't have kids due to climate change is being hysterical.",
            "title_similarity": "0.443452",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hei2f5y",
            "score": -7,
            "text": "Thanks, rampant capitalism.",
            "title_similarity": "0.17589818",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hehjn5k",
            "score": 3,
            "text": "I think we can see the effects already. Im from India and cyclone are starting to become a regular thing. My parents say there used to be like one incidence of a cyclone an year but now multiple low pressure regions are formed in the sea leading to cyclone every year.",
            "title_similarity": "0.62375665",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hehpxnv",
            "score": 1,
            "text": "Those boomers had it so easy, no big wars, lowest house pricing its insane.",
            "title_similarity": "0.22730348",
            "sentiment_compound": -0.0292
        },
        {
            "id": "hehq0m9",
            "score": 1,
            "text": "The odds of having your house destroyed by a climate disaster is still very very low.",
            "title_similarity": "0.4190231",
            "sentiment_compound": -0.8742
        },
        {
            "id": "hehfhes",
            "score": 8,
            "text": "> Between 1895 to 2020, the Bay State had a warming rate of 0.3 degrees Fahrenheit per decade, totaling 3.75 degrees Fahrenheit in the last 125 years, based on a best-fit trend line.\n\nIIRC the effects of AGW could not have been detected prior to the mid 20th Century, so they're including about half a century of natural warming in that sentence.",
            "title_similarity": "0.73691046",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hehs9bh",
            "score": 0,
            "text": "Oh, neat. Can't wait for that.",
            "title_similarity": "-0.005147651",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hei622m",
            "score": 0,
            "text": "Children today are going through a lot more than their grandparents did, personal experience suggests.",
            "title_similarity": "0.6912558",
            "sentiment_compound": 0.0
        },
        {
            "id": "heicri6",
            "score": 0,
            "text": "Bor-riiinnnnnggggggggg!",
            "title_similarity": "0.1598848",
            "sentiment_compound": 0.0
        },
        {
            "id": "hehfv34",
            "score": 207,
            "text": "[deleted]",
            "title_similarity": "-0.0028480273"
        },
        {
            "id": "hehymn5",
            "score": -3,
            "text": "There’s that ambiguous “ studies show” again.",
            "title_similarity": "0.08992445",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei0r0f",
            "score": 5,
            "text": "Solution... Stop having children! only one allowed",
            "title_similarity": "0.19390848",
            "sentiment_compound": 0.1007
        },
        {
            "id": "hehtjh6",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.060133375"
        },
        {
            "id": "hehqvk8",
            "score": 17,
            "text": "Isn’t it because our grand parents burnt too much coal and cut down trees in the name of Industrial revolution?",
            "title_similarity": "0.46809262",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hehmhvx",
            "score": 11,
            "text": "In the last 20 years I've lived through more economic crashes than my parents did in the previous 50.",
            "title_similarity": "0.77387846",
            "sentiment_compound": 0.0
        },
        {
            "id": "hej4qs0",
            "score": 6,
            "text": "1. 1967: Dire Famine Forecast By 1975\n2. 1969: Everyone Will Disappear In a Cloud Of Blue Steam By 1989 (1969)\n3. 1970: Ice Age By 2000\n4. 1970: America Subject to Water Rationing By 1974 and Food Rationing By 1980\n5. 1971: New Ice Age Coming By 2020 or 2030\n6. 1972: New Ice Age By 2070\n7. 1974: Space Satellites Show New Ice Age Coming Fast\n8. 1974: Another Ice Age?\n9. 1974: Ozone Depletion a ‘Great Peril to Life (data and graph)\n10. 1976: Scientific Consensus Planet Cooling, Famines imminent\n11. 1980: Acid Rain Kills Life In Lakes (additional link)\n12. 1978: No End in Sight to 30-Year Cooling Trend (additional link)\n13. 1988: Regional Droughts (that never happened) in 1990s\n14. 1988: Temperatures in DC Will Hit Record Highs\n15. 1988: Maldive Islands will Be Underwater by 2018 (they’re not)\n16. 1989: Rising Sea Levels will Obliterate Nations if Nothing Done by 2000\n17. 1989: New York City’s West Side Highway Underwater by 2019 (it’s not)\n18. 2000: Children Won’t Know what Snow Is\n19. 2002: Famine In 10 Years If We Don’t Give Up Eating Fish, Meat, and Dairy\n20. 2004: Britain will Be Siberia by 2024\n21. 2008: Arctic will Be Ice Free by 2018\n22. 2008: Climate Genius Al Gore Predicts Ice-Free Arctic by 2013\n23. 2009: Climate Genius Prince Charles Says we Have 96 Months to Save World\n24. 2009: UK Prime Minister Says 50 Days to ‘Save The Planet From Catastrophe’\n25. 2009: Climate Genius Al Gore Moves 2013 Prediction of Ice-Free Arctic to 2014\n26. 2013: Arctic Ice-Free by 2015 (additional link)\n27. 2014: Only 500 Days Before ‘Climate Chaos’\n28. 1968: Overpopulation Will Spread Worldwide\n29. 1970: World Will Use Up All its Natural Resources\n30. 1966: Oil Gone in Ten Years\n31. 1972: Oil Depleted in 20 Years\n32. 1977: Department of Energy Says Oil will Peak in 1990s\n33. 1980: Peak Oil In 2000\n34. 1996: Peak Oil in 2020\n35. 2002: Peak Oil in 2010\n36. 2006: Super Hurricanes!\n37. 2005 : Manhattan Underwater by 2015\n38. 1970: Urban Citizens Will Require Gas Masks by 1985\n39. 1970: Nitrogen buildup Will Make All Land Unusable\n40. 1970: Decaying Pollution Will Kill all the Fish\n41. 1970s: Killer Bees!\n42. 1975: The Cooling World and a Drastic Decline in Food Production\n43. 1969: Worldwide Plague, Overwhelming Pollution, Ecological Catastrophe, Virtual Collapse of UK by End of 20th Century\n44. 1972: Pending Depletion and Shortages of Gold, Tin, Oil, Natural Gas, Copper, Aluminum\n45. 1970: Oceans Dead in a Decade, US Water Rationing by 1974, Food Rationing by 1980\n46. 1988: World’s Leading Climate Expert Predicts Lower Manhattan Underwater by 2018\n47. 2005: Fifty Million Climate Refugees by the Year 2020\n48. 2000: Snowfalls Are Now a Thing of the Past\n49.1989: UN Warns That Entire Nations Wiped Off the Face of the Earth by 2000 From Global Warming\n50. 2011: Washington Post Predicted Cherry Blossoms Blooming in Winter",
            "title_similarity": "0.58359313",
            "sentiment_compound": -0.9808
        },
        {
            "id": "hehwyhn",
            "score": 4,
            "text": "I’ve been hearing climate change hysterics for my entire life. So far I’ve got yet to see the predicted outcome of any of them come true. I’ve also become very skeptical of climate “science” as it has become so political. Instead of all the doom and gloom we should be celebrating that [deaths due to natural disasters are dropping](https://www.gapminder.org/questions/gms1-7/) .",
            "title_similarity": "0.5323522",
            "sentiment_compound": -0.7425
        },
        {
            "id": "hehzj2c",
            "score": -2,
            "text": "Isnt 3 times 0 still 0?",
            "title_similarity": "0.29497826",
            "sentiment_compound": 0.0
        },
        {
            "id": "hehsfao",
            "score": -1,
            "text": "Only 3 times more? Now I feel better. I honestly thought that by the time my kids have kids, the planet won't be able to sustain life as ee know it.",
            "title_similarity": "0.7202152",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hehwg4t",
            "score": 1,
            "text": "What climate disasters have their grandparents (me) lived through?",
            "title_similarity": "0.5075672",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hehz0z9",
            "score": 1,
            "text": "Prior to hurricane Harvey we hadn't had a hurricane in my area in over 30 years.  Now we've had three weather disasters in four years (Harvey, Hannah, the Texas winter storm) and had a near miss with hurricane Ida last month.  We also flood every spring now which has only been the norm for the last maybe 8 years.",
            "title_similarity": "0.7208551",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hehz7hl",
            "score": 1,
            "text": "Children today will live through the least climate related deaths of any children generations before them.",
            "title_similarity": "0.5700381",
            "sentiment_compound": 0.0
        },
        {
            "id": "hehzjy6",
            "score": 1,
            "text": "There must have been none before humans",
            "title_similarity": "0.1353653",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei1h4o",
            "score": 1,
            "text": "Not if we all die in thirty years.",
            "title_similarity": "0.46238983",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hei2l5j",
            "score": 1,
            "text": "Ah yes, another \"social science\" article that no doubt is based on divisive politics. This sub isn't science it's garbage.",
            "title_similarity": "0.19476512",
            "sentiment_compound": 0.5873
        },
        {
            "id": "hei2ruj",
            "score": 1,
            "text": "That sounds bad and all, but how fulfilled are we now that Musk, Bezos and that other hyper wealthy white dude made it all the way to space? *Totally* worth it.",
            "title_similarity": "0.36307955",
            "sentiment_compound": 0.8171
        },
        {
            "id": "hei370y",
            "score": 1,
            "text": "Humanity in general is a disaster. Plague of locusts.",
            "title_similarity": "0.30503625",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hei79cu",
            "score": 1,
            "text": "They don’t go outside…so they won’t notice",
            "title_similarity": "0.01506717",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei86jf",
            "score": 1,
            "text": "Old folks voting for petroleum and coal company employee's for higher office, because they are republican.  Corporate power could never have guessed how easy it would have been to get these fools to vote against their own interests.",
            "title_similarity": "0.48018178",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hei951v",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.0028480273"
        },
        {
            "id": "hei9x06",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.0028480273"
        },
        {
            "id": "heh1hhe",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.060133375"
        },
        {
            "id": "hei1pd6",
            "score": 7,
            "text": "Probably doing them a favour getting taken out by a natural disaster as opposed to a lifetime of misery and suffering working a terrible job just to pay a greedy landlord and telecoms, not being able to have savings or ever own anything yourself. I'll take the disaster!",
            "title_similarity": "0.4174072",
            "sentiment_compound": -0.9493
        },
        {
            "id": "heht4le",
            "score": 2,
            "text": "Did hurricanes, wildfires, and floods exists before humans started burning coal?\n\nI believe we should burn less and help the planet, but it seems we are at a point where any natural disaster is deemed to be caused by human made climate change which seems dishonest.",
            "title_similarity": "0.42609048",
            "sentiment_compound": -0.8289
        },
        {
            "id": "hehy4o3",
            "score": 2,
            "text": "Y'all need to look up historical records to see the frequency and level of destruction caused by natural disasters in the past.",
            "title_similarity": "0.5206316",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hehz779",
            "score": -2,
            "text": "\"IF (variable occurs)\" is not the same as \"WILL\"",
            "title_similarity": "0.1173013",
            "sentiment_compound": 0.0
        },
        {
            "id": "hehzabf",
            "score": 2,
            "text": "Yeah but the boomers got theirs and owned the libs so it’s all good",
            "title_similarity": "0.20861048",
            "sentiment_compound": 0.7046
        },
        {
            "id": "hehztl4",
            "score": -3,
            "text": "It’s ok, children today never go outside anyway",
            "title_similarity": "0.12889612",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei0pnw",
            "score": -1,
            "text": "Wow the planet changes? Fascinating",
            "title_similarity": "0.22038229",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hei56ea",
            "score": 1,
            "text": "Only x3? Think we're being a little optimistic here don't you think?",
            "title_similarity": "0.23622029",
            "sentiment_compound": 0.3328
        },
        {
            "id": "hei77se",
            "score": 2,
            "text": "I’m 27, lifelong CA resident. These fires have dramatically gotten much much worse and frequent.",
            "title_similarity": "0.58770305",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hehirdu",
            "score": 47,
            "text": "This seems to be deliberately limiting \"climate disasters\" to \"climate disasters that would be attributable to climate change.\" Hell, it even created the term \"climate disaster\" so it could selectively choose from natural disasters to get the numbers right.",
            "title_similarity": "0.31328535",
            "sentiment_compound": -0.9517
        },
        {
            "id": "hei2voe",
            "score": 19,
            "text": "This. This is why I’ve opted to not have kids. \n\nThere is nowhere to live anymore that won’t be constantly ravaged by Earth telling us to “get fucked”, never mind in 20-30 years from now.",
            "title_similarity": "0.3717325",
            "sentiment_compound": 0.0
        },
        {
            "id": "hegx242",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "-0.060133375"
        },
        {
            "id": "hehgsbg",
            "score": -4,
            "text": "That's actually a little heartening, I would've assumed way more than that",
            "title_similarity": "0.15456612",
            "sentiment_compound": 0.0
        },
        {
            "id": "hehsdiu",
            "score": -4,
            "text": "I was told by some politicians on TV we only have 10 years left, so todays children won't grow up to be very old adults if that's the case.",
            "title_similarity": "0.56524444",
            "sentiment_compound": 0.0
        },
        {
            "id": "hehmakd",
            "score": -7,
            "text": "3x a very low number is still a very low number.  That's a relief.",
            "title_similarity": "0.20483261",
            "sentiment_compound": 0.1206
        },
        {
            "id": "hehpfbs",
            "score": -6,
            "text": "Three times zero is still zero.",
            "title_similarity": "0.2892706",
            "sentiment_compound": 0.0
        },
        {
            "id": "hehfj9v",
            "score": 32,
            "text": "not to mention the million more tons of deception, manipulation and general misinformation in their everyday lives thanks to social media",
            "title_similarity": "0.47194996",
            "sentiment_compound": -0.5809
        },
        {
            "id": "hehpqgv",
            "score": 0,
            "text": "Global-warming situation is really alarming to our world",
            "title_similarity": "0.36033058",
            "sentiment_compound": -0.2006
        },
        {
            "id": "hehwmn0",
            "score": -4,
            "text": "I've been hearing this my whole life.   Prediction after prediction. All wrong.  I'm 51.",
            "title_similarity": "0.46213484",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hehx6to",
            "score": 0,
            "text": "Well we will live trough them thats the point isint it.",
            "title_similarity": "0.1200317",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hei0tda",
            "score": 0,
            "text": "Uf my grandparents lived through zero climate disasters so that is good.",
            "title_similarity": "0.35255867",
            "sentiment_compound": -0.1119
        },
        {
            "id": "hei36a7",
            "score": 5,
            "text": "Baby boomers sure fucked the planet good. Gj testing nukes 100's of times.",
            "title_similarity": "0.54795486",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hei7hlj",
            "score": 0,
            "text": "Good. That'll toughen up those softies",
            "title_similarity": "0.15548114",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hei7swk",
            "score": 0,
            "text": "That would be a fascinating metric for environmental damage.  The number of climate/ecological disasters for a generation, starting back at the beginning of industrialization and projecting forward to the next 1 or 2 generations.",
            "title_similarity": "0.5161947",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hei7u1x",
            "score": 0,
            "text": "What a bunch of fear mongering  BS",
            "title_similarity": "0.18998155",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hei8owi",
            "score": 0,
            "text": "That’s interesting, considering the fact that we’re living through less climate disasters in 2021 than our grandparents did.",
            "title_similarity": "0.5662435",
            "sentiment_compound": -0.1585
        },
        {
            "id": "heicjij",
            "score": 0,
            "text": "How's that pipeline project coming along?\n\nMore pipelines = more money = more funding to fight climate change !!! Makes total sense!",
            "title_similarity": "0.4913828",
            "sentiment_compound": -0.6164
        },
        {
            "id": "heicm8w",
            "score": 0,
            "text": "Only 3x? I guess past that we’ll just be all dead.",
            "title_similarity": "0.45912117",
            "sentiment_compound": -0.6486
        },
        {
            "id": "heicqtt",
            "score": 0,
            "text": "At least they could be making a ton of memes about it, like they’re grandparents couldn’t.",
            "title_similarity": "0.47182375",
            "sentiment_compound": 0.3612
        },
        {
            "id": "heid6lg",
            "score": 0,
            "text": "Plus a once in a century plague and at least a few more big ole recessions. \n\nPlus some of the nastiest US elections since…Jefferson? And even Adams admitted he lost.",
            "title_similarity": "0.5770077",
            "sentiment_compound": -0.6486
        },
        {
            "id": "heidn80",
            "score": 0,
            "text": "Learn to drink your own pee folks because their a high percentage we all be doing that. I still can't believe people are still paying for water blows my mind.",
            "title_similarity": "0.5319111",
            "sentiment_compound": 0.0
        },
        {
            "id": "heiek9t",
            "score": 0,
            "text": "Only the ones who live through them",
            "title_similarity": "0.12561867",
            "sentiment_compound": 0.0
        },
        {
            "id": "heiewtq",
            "score": 0,
            "text": "Wow thats horrible. Time to so some amazom shopping",
            "title_similarity": "0.11698605",
            "sentiment_compound": 0.0772
        },
        {
            "id": "heif5q5",
            "score": 0,
            "text": "I’m not old, and I know recency bias impacts us all. However, I definitely notice more frequent extreme whether where I live, and have also noticed it more in the news happening around the world. \n\n\nThis is really happening.",
            "title_similarity": "0.4565403",
            "sentiment_compound": 0.3182
        },
        {
            "id": "heigklf",
            "score": 0,
            "text": "Where’s the ice age I was promised as a kid?",
            "title_similarity": "0.42669818",
            "sentiment_compound": 0.3612
        },
        {
            "id": "heimlmp",
            "score": 0,
            "text": "MORONS… \n\nhttps://710wor.iheart.com/featured/mark-simone/content/2019-10-08-the-list-of-120-years-of-climate-scares-by-scientists/",
            "title_similarity": "0.44112274",
            "sentiment_compound": 0.0
        },
        {
            "id": "heiu14l",
            "score": 0,
            "text": "Well if you change the definition of “Climate Disaster”, what do you expect?",
            "title_similarity": "0.3189682",
            "sentiment_compound": 0.2732
        },
        {
            "id": "heiuzkv",
            "score": 0,
            "text": "Predicting the weather?\n\nGood luck",
            "title_similarity": "0.16822278",
            "sentiment_compound": 0.7096
        },
        {
            "id": "heixw33",
            "score": 0,
            "text": "so studies predict the future.",
            "title_similarity": "0.17233221",
            "sentiment_compound": 0.0
        },
        {
            "id": "hej9urx",
            "score": 0,
            "text": "Mine lived and died in ww2 so I’m mildly ok with that. As long as I don’t have to bayonet someone in the chest it’s been a good day.",
            "title_similarity": "0.30777895",
            "sentiment_compound": 0.1935
        },
        {
            "id": "hejfu7j",
            "score": 0,
            "text": "Personally I think it's one continuous event. Saying there are multiple makes it seem like you can isolate them in time brackets. Can you measure the time of the flood etc...? Sure but it's not like all kinds of crap isn't leading to that situation in the first place.",
            "title_similarity": "0.4051929",
            "sentiment_compound": -0.6206
        },
        {
            "id": "hejidv8",
            "score": 0,
            "text": "Northern flowing Rivers were a means of travel as well as moving agriculture",
            "title_similarity": "0.2510107",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hejr1ps",
            "score": 0,
            "text": "Just like think if any of this was true we would all be dead by now. Pushing fear to further an agenda is so  precovid!",
            "title_similarity": "0.375616",
            "sentiment_compound": -0.5411
        },
        {
            "id": "hejrr53",
            "score": 0,
            "text": "No, they'll just hear about three times as many disasters because they have greater access to media and catastophists will tell them about more - making a song and dance about things that most people wouldn't have even known happened with less pervasive technology.\n\nJust because the climate changes doesn't mean Earth turns into a Michael Bay film.",
            "title_similarity": "0.682104",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hek05wu",
            "score": 0,
            "text": "Just the cycle of nature right? There can be no way that the explosion of one species as dominant as humans can have any effect on the climate. Right? I mean the world was once all an ocean and then all ice right? Well that’s just the way it is. Humans aren’t Speeding it up. I know this because I listen to alt right psychos who think that the weather is man made. \n\nNope it’s not man made, but your can bet your life that such an explosion in population of a species that has raped the planet and verified holes in the ozone, will effect the climate to CHANGE. So think about it. The sun is stronger, the air is warmer, water is warmer. Storms feed off of warm water, there will be bigger more intense storms. Hence 9 inches of rain in 3 hours in New Jersey. \n\nBut no, no way this is a threat to humans and no way it was caused by us. Come on, please get with the program and try you climate change deniers. Read some books about weather on earth, and the effects of the industrial revolution. It’s when things started to change",
            "title_similarity": "0.41979796",
            "sentiment_compound": -0.7684
        },
        {
            "id": "hekblgt",
            "score": 0,
            "text": "They'll certainly see more media coverage.",
            "title_similarity": "0.27328625",
            "sentiment_compound": 0.34
        },
        {
            "id": "hekkulw",
            "score": 0,
            "text": "Corporate greed is at fault",
            "title_similarity": "0.23255807",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hf3aj3s",
            "score": 0,
            "text": "This is nonsense propaganda. \"Climate disasters\" are a made up thing",
            "title_similarity": "0.21450236",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hehfskl",
            "score": -14,
            "text": "Didn't read the article, but hopefully because life expectancies will be three times as long",
            "title_similarity": "0.6858072",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hehw6sz",
            "score": 5,
            "text": "\"Live\" sounds optimistic",
            "title_similarity": "0.12067545",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hehgt1u",
            "score": 160,
            "text": "That must be per year or something... the number of climate change related emergencies is now constant. Just look at the west coast, the fires and droughts are now a yearly occurrence which was never a thing a couple/several decades ago. And just thinking of the number of \"once in a century\" storms I have had  in the last few years.   This study must be massively underreporting the trajectory of climate related disasters.",
            "title_similarity": "0.7024537",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hehrszj",
            "score": 21,
            "text": "You walked through hundreds of miles of snow? Yeah?\n\nGuess what, I walked through a snow storm AND two hurricanes. Beat that grandparents.",
            "title_similarity": "0.5642867",
            "sentiment_compound": 0.3736
        },
        {
            "id": "heh8e43",
            "score": 1283,
            "text": "The problem isn't the number but the scale.\nClimate change is gonna make WW2 look like a minor incident.",
            "title_similarity": "0.34633446",
            "sentiment_compound": 0.3158
        },
        {
            "id": "hehoj6g",
            "score": -1,
            "text": "It will also be the fault of their grandparents.",
            "title_similarity": "0.3317706",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hehpm8k",
            "score": -1,
            "text": "Ahh yes gone are the days of predictable seasons and that Norman Rockwell life.",
            "title_similarity": "0.25002515",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hehqvlc",
            "score": 1,
            "text": "That is a worry, how many will their children live through given the logarithmic advancement of the climate problem, and their grandchildren.",
            "title_similarity": "0.6667259",
            "sentiment_compound": -0.6808
        },
        {
            "id": "heht1r5",
            "score": 1,
            "text": "uh. \"three times more climate disasters\" is a pretty low estimate considering I'm 34 and have already lived through endless climate catastrophe events that my grandparents did not......",
            "title_similarity": "0.7693764",
            "sentiment_compound": -0.8008
        },
        {
            "id": "hehtwq1",
            "score": -1,
            "text": "Playtimes over children. On the plus side you’ll finally be able to outdo those grand parents who walked to school through 6 feet of snow when you’re walking to school through flash floods, tornadoes, satanic cows and acid rain.",
            "title_similarity": "0.5406384",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hehv02m",
            "score": 1,
            "text": "Out biggest enemy is war and dumb politics.  We need investment in education so that the public can demand good, competent leaders and hold them accountable, instead of debating whether the earth is flat on Facebook.\n\n If nations come together under the banner of science and problem-solving, the future is bright.  We were all supposed to starve to death in the 1960s, but we innovated our way out of that easily.  Electric transport is ramping up fast.  We are headed at a population crash next century, and that will need to be fixed too, so really this is just a hump in a bumpy road.  I expect governments to start heavily subsidizing childbirth within a couple of decades.",
            "title_similarity": "0.51210296",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hehvew6",
            "score": -1,
            "text": "Maybe it’d easier to just start celebrating days where something fucked up *doesn’t* happen, instead of grieving the days they do?",
            "title_similarity": "0.28835434",
            "sentiment_compound": -0.296
        },
        {
            "id": "hehzpu9",
            "score": 1,
            "text": "Sure glad I’m not a child today",
            "title_similarity": "0.06349029",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hei1gvq",
            "score": 1,
            "text": "And children not yet born will live on only the tallest landmasses",
            "title_similarity": "0.46018097",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei1l9t",
            "score": 1,
            "text": "And the grandparents will never take ownership of the problem they caused aka Congress!!\n\nEdit (shortened)",
            "title_similarity": "0.2916167",
            "sentiment_compound": -0.508
        },
        {
            "id": "hei2fpq",
            "score": 1,
            "text": "So I'm going to live long enough to see my children become impoverished and my grandchildren murder eachother over a slice of bread. Great.",
            "title_similarity": "0.47539502",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hei31di",
            "score": -1,
            "text": "Cool bring it on we’re not worth it",
            "title_similarity": "-0.027447082",
            "sentiment_compound": 0.1615
        },
        {
            "id": "hei3434",
            "score": -1,
            "text": "Yeah sure but the stock market tho.",
            "title_similarity": "0.13404162",
            "sentiment_compound": 0.3071
        },
        {
            "id": "hei5lwc",
            "score": -1,
            "text": "Look on the bright side …. They will live through it.",
            "title_similarity": "0.18401265",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hei6h8f",
            "score": 1,
            "text": "Gee i fuckin wonder why that might be",
            "title_similarity": "-0.017728018",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei6pcc",
            "score": -1,
            "text": "There is far too much questioning in this thread about climate change. Yeah the numbers might be skewed. Who even cares we know it's happening anyway. Why does the number matter at that point so much?",
            "title_similarity": "0.3798638",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hei7bhi",
            "score": 1,
            "text": "Instant, non-appealable death penalty for climate change deniers. Verified through social media.\n\nNo other choice now.",
            "title_similarity": "0.35955492",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hei8kp9",
            "score": 1,
            "text": "Science is like magic, but real.",
            "title_similarity": "0.17123553",
            "sentiment_compound": 0.1901
        },
        {
            "id": "heiaez2",
            "score": 1,
            "text": "Children today will never grow up to graduate from high school much less from college. There is no future for them. \n\nThere, I fix the tittle for you.",
            "title_similarity": "0.42476243",
            "sentiment_compound": -0.296
        },
        {
            "id": "heiavd6",
            "score": 1,
            "text": "You can thank climate deniers for this.",
            "title_similarity": "0.175849",
            "sentiment_compound": 0.1027
        },
        {
            "id": "heibv57",
            "score": 1,
            "text": "And yet, adults want to keep carrying on with bringing more and more into this world.",
            "title_similarity": "0.21039586",
            "sentiment_compound": 0.0772
        },
        {
            "id": "heick4g",
            "score": 1,
            "text": "> 2.5 times more crop failures\n\nIn the 1960s, 17 million people died from crop failure / famines. In the past decade, 250,000.\n\nThe authors of this \"study\" are jokers.",
            "title_similarity": "0.65604854",
            "sentiment_compound": -0.8801
        },
        {
            "id": "heidc9f",
            "score": 1,
            "text": "Hows is this true? We have lived through over 10 once-in-5-hundred-year-storms in the 5 years. It wont be 3x climate disasters, it will be *hundreds of times* more",
            "title_similarity": "0.6735764",
            "sentiment_compound": -0.09
        },
        {
            "id": "heidjvq",
            "score": -1,
            "text": "Only if they are lucky :)",
            "title_similarity": "0.018824343",
            "sentiment_compound": 0.7003
        },
        {
            "id": "heiskgy",
            "score": 1,
            "text": "Thanks to the greatest generation.",
            "title_similarity": "0.24110508",
            "sentiment_compound": 0.7964
        },
        {
            "id": "heiwjz6",
            "score": 1,
            "text": "Mighty optimistic of them to assume they’ll live through those",
            "title_similarity": "0.20440945",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hej47l3",
            "score": -1,
            "text": "The climate is one thing. It's fucked to hell already, and the only people really doing anything about it are the anti-vaxxers who are dying in droves from covid. Thank you, you dumb ass fucks for buying us another generation.",
            "title_similarity": "0.4028759",
            "sentiment_compound": -0.9545
        },
        {
            "id": "hej75k2",
            "score": 1,
            "text": "That's because their grandparents weren't stupid enough to keep building in areas prone to yearly fires or building on flood plains... and that's a natural cycle, NOT climate changes....",
            "title_similarity": "0.38497317",
            "sentiment_compound": 0.6458
        },
        {
            "id": "hej89h7",
            "score": 1,
            "text": "First time grandpa checking in.\n\nI’m loving the little guy so very much, he’s nothing but everything I would expect him to be at the ripe old age of 2. \n\nHe’s not the one I worry about, but his kids , and I’m afraid my worry is too late, and I’m trying to absorb his worry now, so hopefully he won’t have to.\n\nVote for tomorrow, vote for the generations to come. Vote because the future depends on it.",
            "title_similarity": "0.4314661",
            "sentiment_compound": -0.7278
        },
        {
            "id": "hej974r",
            "score": -1,
            "text": "No they won’t but they’ll be told so.",
            "title_similarity": "0.042856954",
            "sentiment_compound": -0.1531
        },
        {
            "id": "heja1v0",
            "score": -1,
            "text": "Redit is extreme left",
            "title_similarity": "0.018795736",
            "sentiment_compound": 0.0
        },
        {
            "id": "hejfikx",
            "score": -1,
            "text": "Thanks boomers! Joe Biden is gonna fix this country and turn it all around I just know! #bestpresidentever GO DEMOCRATS!!!",
            "title_similarity": "0.36422753",
            "sentiment_compound": 0.6209
        },
        {
            "id": "hek6s54",
            "score": -1,
            "text": "Disasters that have been made up and created by globalist.",
            "title_similarity": "0.3882436",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hei1g89",
            "score": -7,
            "text": "This article is sort of sneaky and makes an ageist inception by blaming older generations.\n\nSensationalism sells apparently.",
            "title_similarity": "0.31558704",
            "sentiment_compound": -0.659
        },
        {
            "id": "hehikr2",
            "score": 36,
            "text": "[removed]",
            "title_similarity": "-0.060133375"
        },
        {
            "id": "hehpm0j",
            "score": 2,
            "text": "Even thought they will experience more disasters, they have a better chance of surviving them. Crazy.",
            "title_similarity": "0.42963082",
            "sentiment_compound": -0.0498
        },
        {
            "id": "hehvdyv",
            "score": -2,
            "text": "The first generation who will actually have it harder than past generations",
            "title_similarity": "0.47473264",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei5q1y",
            "score": -2,
            "text": "So my grandad told the stories about how it was tough to get to school. Now my children will do the same. Thanks.",
            "title_similarity": "0.48446137",
            "sentiment_compound": 0.34
        },
        {
            "id": "hei60sf",
            "score": 2,
            "text": "Earth is not here for so many people, and certanaly to be used like this.. The lifespan however short it might ve been tens of thousands of years ago it was probably more worth it than 500 years alive on whatever it is to come of this planet",
            "title_similarity": "0.49421304",
            "sentiment_compound": 0.7425
        },
        {
            "id": "hei6bhv",
            "score": 2,
            "text": "Optimistic of them to assume we’ll “live” through them",
            "title_similarity": "0.19851969",
            "sentiment_compound": 0.3182
        },
        {
            "id": "heibsn9",
            "score": 2,
            "text": "Just another reason not to have so many. Best thing you can do for the environment.",
            "title_similarity": "0.17620257",
            "sentiment_compound": 0.6682
        },
        {
            "id": "hejeobk",
            "score": -2,
            "text": "Keyword: suggests. You can suggest anything and perform whatever mental gymnastics it takes to get there",
            "title_similarity": "0.18094526",
            "sentiment_compound": 0.0
        },
        {
            "id": "hehqgrv",
            "score": 4,
            "text": "To the children I say, You're Welcome",
            "title_similarity": "0.07198877",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hehzab2",
            "score": -3,
            "text": "This will probably bring people together",
            "title_similarity": "0.08754107",
            "sentiment_compound": 0.0
        },
        {
            "id": "heif7rg",
            "score": 4,
            "text": "Have these suggestions historically been accurate?",
            "title_similarity": "0.09244396",
            "sentiment_compound": 0.0
        },
        {
            "id": "heistmv",
            "score": 2,
            "text": "And they still won’t be able to afford a house.",
            "title_similarity": "0.28579664",
            "sentiment_compound": 0.0
        },
        {
            "id": "hej9ds7",
            "score": 3,
            "text": "Yeah but I can google any celebrities butthole on a whim",
            "title_similarity": "0.251533",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hejvmuo",
            "score": 2,
            "text": "Yes yes, and atm the entire coast is suppose to be underwater... \nI bet when this is wrong they just say Science and say it will be 30 years later and when thats wrong science and another 30. \nYou know at some point you just have to stop being fooled by this fear pron.",
            "title_similarity": "0.46399754",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hehig93",
            "score": 95,
            "text": "And then what, it gets progressively worse until the world, as we know it, ends? (Genuine question)",
            "title_similarity": "0.27311802",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hehmrq4",
            "score": -4,
            "text": "but significantly less world wars so thats something :p",
            "title_similarity": "0.24293093",
            "sentiment_compound": -0.3791
        },
        {
            "id": "hehoimq",
            "score": -3,
            "text": "Good. Maybe this will help cull the human race",
            "title_similarity": "0.20778745",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hehrope",
            "score": 4,
            "text": "Don't have to live through more disasters if you die in the first one.\n\n\\*taps forehead\\*",
            "title_similarity": "0.37971532",
            "sentiment_compound": -0.8313
        },
        {
            "id": "hei503z",
            "score": 5,
            "text": "Hence why my husband and I have decided to not have children.  We would rather do our best to help the children in existence now.  They're going to need it.",
            "title_similarity": "0.2874996",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hei5hdt",
            "score": 5,
            "text": "I honestly don't understand why people choose to have kids these days. Why bring more innocent lives into this world to suffer alongside us while simultaneously contributing to the factors that got us here in the first place?\n\nYet, if you try to tell someone this, you'll get called out for one stupid reason or another.",
            "title_similarity": "0.40378967",
            "sentiment_compound": -0.2975
        },
        {
            "id": "hei6vb0",
            "score": 4,
            "text": "It won't matter because they won't have homes to destroy.",
            "title_similarity": "0.036267072",
            "sentiment_compound": -0.5535
        },
        {
            "id": "heiely5",
            "score": 5,
            "text": "Per capita less are dying from natural disaster than ever before, and more are currently dying from cold than heat.",
            "title_similarity": "0.68873066",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hei3irm",
            "score": 4,
            "text": "“Sure, but I’ll be rich and dead” - the people with the power to change this",
            "title_similarity": "0.35417426",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hei02yl",
            "score": 69,
            "text": "And my family wonders why I don’t want to have kids.",
            "title_similarity": "0.35195547",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hehnn66",
            "score": 8,
            "text": ">The research suggested that children today will live through twice as many wildfires, 1.7 times as many tropical cyclones, 3.4 times more river floods, 2.5 times more crop failures and 2.3 times as many droughts as someone born in 1960, according to the Washington Post.\n\nIs this all due to climate change, or also due to people encroaching on forests, river beds, and engaging in massive crops to support our ever growing population?\n\nThe population grew dramatically from 1960 to current times, and yet that little detail, our occupation of space and direct exploitation of natural resources, seems to be ignored in this.\n\nWe have a population and consumption problem, but the solution is not for people in aged zones to stop having children.",
            "title_similarity": "0.79410684",
            "sentiment_compound": 0.0415
        },
        {
            "id": "hehs2uk",
            "score": 6,
            "text": "And their grandparents don't care! \"I'll be dead by then.\" Ug!",
            "title_similarity": "0.35394004",
            "sentiment_compound": -0.8182
        },
        {
            "id": "hehwisq",
            "score": 58,
            "text": "not to say this is not something to be aware of or even upset about, but i think the time has come when it would be more useful to publish articles on how we are going to live with this new reality (houses underground, fireproof houses, floodproof houses, natural cooling systems, water desalination, re-evaluating nuclear power, etc). but maybe those don't get the clicks, i dunno.",
            "title_similarity": "0.30774093",
            "sentiment_compound": 0.7743
        },
        {
            "id": "heh0jc3",
            "score": 50,
            "text": "[removed]",
            "title_similarity": "-0.060133375"
        },
        {
            "id": "hehniyk",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "-0.060133375"
        },
        {
            "id": "hegvuam",
            "score": 90,
            "text": "[removed]",
            "title_similarity": "-0.060133375"
        },
        {
            "id": "hehzntx",
            "score": 825,
            "text": "Are there any redditors that are not having children because they don’t want to take the risk of their children being born into climate hell?",
            "title_similarity": "0.3639288",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hehghse",
            "score": 2138,
            "text": "[removed]",
            "title_similarity": "-0.060133375"
        },
        {
            "id": "hehddl1",
            "score": 181,
            "text": "[removed]",
            "title_similarity": "-0.060133375"
        },
        {
            "id": "heiww7t",
            "score": 23,
            "text": "But it's the consumers fault.- the mega Corp.",
            "title_similarity": "0.26691455",
            "sentiment_compound": -0.5499
        },
        {
            "id": "heisw4f",
            "score": 28,
            "text": "disasters those same grandparents helped create...how cruel and utterly ironic",
            "title_similarity": "0.3796246",
            "sentiment_compound": -0.8479
        },
        {
            "id": "heicjlm",
            "score": 351,
            "text": "\"As the climate gets worse in the future, people in the future will have a worse climate as a result.\"\n\nGroundbreaking.",
            "title_similarity": "0.44276357",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hehmo5y",
            "score": 2158,
            "text": "I know it says they'll live through these disasters, but how many will die as a result?",
            "title_similarity": "0.56222576",
            "sentiment_compound": -0.8248
        },
        {
            "id": "hehf6r8",
            "score": 244,
            "text": "[removed]",
            "title_similarity": "-0.060133375"
        },
        {
            "id": "hehpr2a",
            "score": 1,
            "text": "This is assuming they kept records on all the things we call disasters now",
            "title_similarity": "0.4263751",
            "sentiment_compound": -0.5574
        },
        {
            "id": "heht8my",
            "score": 1,
            "text": "Climate “disasters” defined as what?",
            "title_similarity": "0.2963993",
            "sentiment_compound": 0.0
        },
        {
            "id": "hehtcsx",
            "score": 1,
            "text": "How many have their grandparents lived through? I got some advanced math to do",
            "title_similarity": "0.4384244",
            "sentiment_compound": 0.25
        },
        {
            "id": "hehu83u",
            "score": 1,
            "text": "This fails to take into account how kids today won't live for very much longer. They'll probably live through just as many, but in one third the time.",
            "title_similarity": "0.6098368",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hehugra",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.060133375"
        },
        {
            "id": "hehv0cm",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.060133323"
        },
        {
            "id": "hehv96v",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.060133323"
        },
        {
            "id": "hehxqru",
            "score": 1,
            "text": "All right an optimistic article about the climate. Most paint such a gloomy picture that I figured children today aren't going to be living through very much, so good to hear such a positive spin on whats happening. The doom scrolling on reddit has finally ended!!",
            "title_similarity": "0.44961303",
            "sentiment_compound": 0.805
        },
        {
            "id": "hehxswd",
            "score": 1,
            "text": "Caused by said grandparents amd their peers",
            "title_similarity": "0.3534366",
            "sentiment_compound": 0.0
        },
        {
            "id": "hehzcj8",
            "score": 1,
            "text": "A gift that will last a lifetime!",
            "title_similarity": "0.29719785",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hehzfa0",
            "score": 1,
            "text": "Live through? That's presumptious",
            "title_similarity": "0.08759954",
            "sentiment_compound": 0.0
        },
        {
            "id": "hehzjbt",
            "score": 1,
            "text": "As disasters become more regular, they just become life.\n\n\nBring out the guile.\n\nIt's about tine.",
            "title_similarity": "0.3123166",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hehzku0",
            "score": 1,
            "text": "and it’s all due to people their grandparents age",
            "title_similarity": "0.41250145",
            "sentiment_compound": 0.0
        },
        {
            "id": "hehztjw",
            "score": 1,
            "text": "It's amazing how often in the last 20 years I've heard storms, fires, heatwaves, flooding events etc described as.... \"a once in a generation/lifetime event....\" followed a few years later by another \"once in a generation event\".. And another, and another..",
            "title_similarity": "0.6633239",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hei08xt",
            "score": 1,
            "text": "\"Study suggests \" think just looking out the window suggest that these days",
            "title_similarity": "0.2526033",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei0937",
            "score": 1,
            "text": "World is changing…very very fast.",
            "title_similarity": "0.31204742",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei09u5",
            "score": 1,
            "text": "Yes they will , sadly",
            "title_similarity": "0.041501425",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hei0b9k",
            "score": 1,
            "text": "Is it a disaster if it happens every year right on cue?",
            "title_similarity": "0.60795844",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hei0bx9",
            "score": 1,
            "text": "Specifically the last one anyone will ever experience",
            "title_similarity": "0.1971507",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei0f05",
            "score": 1,
            "text": "I understand all the gloom and doom media clickbait and fear mongering, but the young people need to see it as an opportunity to move from the old ways and established cities, to build new cities and new infrastructure for the future of humanity, new jobs, new designs, new materials, better everything, built with the future in mind, the young people should not be afraid, they should be looking forward to greater things, better design for the betterment of society as a whole.",
            "title_similarity": "0.4095393",
            "sentiment_compound": 0.875
        },
        {
            "id": "hei0p0w",
            "score": 1,
            "text": "ONLY 3 times?! That’s a lot less terrible than I assumed.",
            "title_similarity": "0.49472392",
            "sentiment_compound": -0.4765
        },
        {
            "id": "hei0pv5",
            "score": 1,
            "text": "And not live through, too.",
            "title_similarity": "0.045794576",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei0u70",
            "score": 1,
            "text": "This is r/science and it reads like r/collapse. I think that's the most terrifying thing.",
            "title_similarity": "0.28872302",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hei1j0q",
            "score": 1,
            "text": "Before we get serious about planning for more frequent “climate disasters” we ought to take a good hard look at how prepared we are for those disasters in the first place. Our infrastructure can hardly handle a normal frequency of natural disasters, and the best prepared areas are only that way because of past disasters exposing massive flaws.",
            "title_similarity": "0.5147045",
            "sentiment_compound": -0.296
        },
        {
            "id": "hei1o11",
            "score": 1,
            "text": "This will only make them stronger.",
            "title_similarity": "0.18180476",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hei1o7b",
            "score": 1,
            "text": "Only 3? Lower then I thought.",
            "title_similarity": "0.3251778",
            "sentiment_compound": -0.296
        },
        {
            "id": "hei1r2h",
            "score": 1,
            "text": "That's the modern human being for you!",
            "title_similarity": "0.11671711",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei1rih",
            "score": 1,
            "text": "As long as we living through them",
            "title_similarity": "0.0650703",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei1spq",
            "score": 1,
            "text": "We need to stop remembering our hot months as \"the hottest month to date\" and accept that for the rest of our lives the reality is we are currently living in the \"coldest month\" that we will experience for the rest of our lives.",
            "title_similarity": "0.5405748",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hei2dgp",
            "score": 1,
            "text": "Hell, a lot of them probably won’t",
            "title_similarity": "0.16082616",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hei2fba",
            "score": 1,
            "text": "Well, it’s good to know that the world isn’t ending in twelve years then.",
            "title_similarity": "0.3415081",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hei2vfv",
            "score": 1,
            "text": "The future is now old man.",
            "title_similarity": "0.19231424",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei2ykt",
            "score": 1,
            "text": "Impossible! My grandfather walk to school everyday in the snow, up-hill both ways, his entire childhood.",
            "title_similarity": "0.5089736",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei33kj",
            "score": 1,
            "text": "News media cover weather events three times more than they used to, study suggests.\n\nI accept the reality about global warming. But every incidence of extreme weather is not caused by global warming. They had extreme weather before.",
            "title_similarity": "0.7541187",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hei34zh",
            "score": 1,
            "text": "Well, someones got to make all the tablets for these kids.",
            "title_similarity": "0.35686907",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hei3ex1",
            "score": 3,
            "text": "I like how they are optimistic that the first one won’t take them out.",
            "title_similarity": "0.1330769",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hei3zqb",
            "score": 1,
            "text": "Yeah I don't think any of them are going to have to deal with the dust bowl 2.0, let's not be dramatic",
            "title_similarity": "0.0326033",
            "sentiment_compound": 0.296
        },
        {
            "id": "hei41d4",
            "score": 1,
            "text": "Three times if they are lucky.",
            "title_similarity": "0.5043645",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hei428t",
            "score": 1,
            "text": "Eh I want kids but do I want kids?",
            "title_similarity": "0.18134066",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hei44e9",
            "score": 1,
            "text": "Ok ok I’m listening. Pretty cool prediction. If they don’t though can we stop listening to the news then?",
            "title_similarity": "0.1838266",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hei490s",
            "score": 1,
            "text": "And less wars. Hopefully",
            "title_similarity": "0.037606858",
            "sentiment_compound": -0.2228
        },
        {
            "id": "hei4g26",
            "score": 1,
            "text": "The world is going to end in 10 years! -1940, 1950, 1960, 1970, 1980, 1990, 2000, 2010\n\nNot saying climate change doesnt exist (that's a separate discussion) but doomsayers re: climate change are the intellectual equivalent of Qanon and thus do not help in providing solutions.",
            "title_similarity": "0.42139745",
            "sentiment_compound": 0.0913
        },
        {
            "id": "hei4jk5",
            "score": 1,
            "text": "You can’t even get tomorrow’s weather right. Why are we writing articles about the weather 70 years from today?",
            "title_similarity": "0.4639855",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei4jwt",
            "score": 1,
            "text": "So they'll have to walk through the snow, uphill all 6 ways?",
            "title_similarity": "0.3094049",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei4oel",
            "score": 1,
            "text": "What an amazingly poor choice of words in that headline.",
            "title_similarity": "0.095128",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hei4taw",
            "score": 1,
            "text": "I mean, my freshman year of college was marked by a huge wildfire that shut down all the colleges and schools in the area, and a mudslide from intense rains a few weeks after. The next year a similar thing happened. I’d say.",
            "title_similarity": "0.61905706",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hei4ufb",
            "score": 1,
            "text": "My spouse and I live in Colorado, and our state supplies a lot of water to the surrounding areas. We know this is going to drain water reserves. We are trying to decide where to buy a house at, and I just don’t know if Colorado is best, or if we need to move to another state in the future. \n\nOur parents and grandparents’ generations didn’t have to worry about that…. That’s kind of annoying.\n\nCurse the families of those that work(ed) to stop any reforms that could have kept our planet healthy!",
            "title_similarity": "0.51648396",
            "sentiment_compound": -0.6105
        },
        {
            "id": "hei4uvx",
            "score": 1,
            "text": "But back in their days they had to walk 15 miles through 7 ft. of snow just to pick up the mail.",
            "title_similarity": "0.51405513",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei4uw8",
            "score": 1,
            "text": "I lived through one tropical storm in 20 years, my nephew and niece have lived through 5 in 18 yrs since then. Same with Blizzards.",
            "title_similarity": "0.6463641",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei59lr",
            "score": 1,
            "text": "But far fewer will die than in their grandparents day. \n\nWe are much better at mitigating against climate related deaths.",
            "title_similarity": "0.573981",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hei5pdt",
            "score": 1,
            "text": "Does this also mean we should be saying Thank you Grandparents?",
            "title_similarity": "0.23565564",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hei681q",
            "score": 2,
            "text": "Remember kids, always buy flood insurance",
            "title_similarity": "0.40468156",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei6afr",
            "score": 1,
            "text": "The by product of natural selection.",
            "title_similarity": "0.08916797",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hei6y4s",
            "score": 1,
            "text": "They will also live through at LEAST one less world war, cold war or racial segregation",
            "title_similarity": "0.33349898",
            "sentiment_compound": -0.8187
        },
        {
            "id": "hei72tl",
            "score": 1,
            "text": "Going by that rubric, we literally have one more generation left",
            "title_similarity": "0.37185574",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei761y",
            "score": 1,
            "text": "Only three times more?",
            "title_similarity": "0.5120003",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei77c1",
            "score": 1,
            "text": "When I was your age I had to walk through tornadoes and hurricanes twice as many today!",
            "title_similarity": "0.70176566",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei7eq2",
            "score": 1,
            "text": "Lucky Bastards, but not there great grandparents",
            "title_similarity": "0.26379994",
            "sentiment_compound": -0.722
        },
        {
            "id": "hei85in",
            "score": 1,
            "text": "Pretty optimistic headline unless they experience one so horrendous it wipes us all out.",
            "title_similarity": "0.36677957",
            "sentiment_compound": -0.0941
        },
        {
            "id": "hei8ai5",
            "score": 1,
            "text": "Only three times?  You gotta pump those numbers up, those are rookies numbers.",
            "title_similarity": "0.65810263",
            "sentiment_compound": 0.0
        },
        {
            "id": "hei8qmv",
            "score": 2,
            "text": "thanks to their grandparents\\*",
            "title_similarity": "0.3341072",
            "sentiment_compound": 0.4404
        },
        {
            "id": "heiac0s",
            "score": 1,
            "text": "Oh that’s not that much since their grandparents didn’t live through many climate disasters in the first place.",
            "title_similarity": "0.48490998",
            "sentiment_compound": -0.5574
        },
        {
            "id": "heiapxq",
            "score": 1,
            "text": "They also get Playstation though",
            "title_similarity": "0.15054397",
            "sentiment_compound": 0.0
        },
        {
            "id": "heibmj2",
            "score": 1,
            "text": "I can't even read the study to examine it.",
            "title_similarity": "0.13030037",
            "sentiment_compound": 0.0
        },
        {
            "id": "heibujb",
            "score": 1,
            "text": "Feels like quantity is less important than quality here.",
            "title_similarity": "0.11524584",
            "sentiment_compound": 0.4601
        },
        {
            "id": "heie1yb",
            "score": 3,
            "text": "How do we define a climate disaster?",
            "title_similarity": "0.27880305",
            "sentiment_compound": -0.6249
        },
        {
            "id": "heifjyy",
            "score": 1,
            "text": "They've been warning us this would happen consistently since mid eightys. Only NOW are people beginning to realize that climate change (specifically the warming part of it) doesn't mean less snowfall in the winter. More than one local bible thumper said its \"hogwash\" because it snowed in his backyard last year and that there is nothing in the bible about climate change.",
            "title_similarity": "0.5506318",
            "sentiment_compound": -0.2023
        },
        {
            "id": "heifm96",
            "score": 1,
            "text": "Luckily they will live through a whole lot less starvation and war",
            "title_similarity": "0.35454482",
            "sentiment_compound": -0.0865
        },
        {
            "id": "heig47z",
            "score": 1,
            "text": "Poor choice of word.. they will not \"live\" but **survive**. Thise kids will be surviving through hell because people wanted the new shinny things they've been told they needed..",
            "title_similarity": "0.39626685",
            "sentiment_compound": -0.7684
        },
        {
            "id": "heigbuc",
            "score": 1,
            "text": "Cool have fun. Nothing will stop humanity from killing itself. See covid.",
            "title_similarity": "0.21773021",
            "sentiment_compound": 0.2705
        },
        {
            "id": "heigfcn",
            "score": 1,
            "text": "Number of people dying from climate related natural disasters have declined for decades, but now it'll suddenly increase? Sure...",
            "title_similarity": "0.6965527",
            "sentiment_compound": 0.6705
        },
        {
            "id": "heigjds",
            "score": 1,
            "text": "*cause by their grandparents",
            "title_similarity": "0.33315572",
            "sentiment_compound": 0.0
        },
        {
            "id": "heigz2h",
            "score": 1,
            "text": "Boomers don’t give a F, it’s an issue for those damn millennials and the tiktok’s post-millennials to worry about.",
            "title_similarity": "0.31174636",
            "sentiment_compound": -0.6808
        },
        {
            "id": "heihcwp",
            "score": 3,
            "text": "People should focus on changing their government before having kids. Otherwise they’re just going to doom them.",
            "title_similarity": "0.40445906",
            "sentiment_compound": -0.4019
        },
        {
            "id": "heihovm",
            "score": 1,
            "text": "I live in Northern California, we already are over here",
            "title_similarity": "0.23288389",
            "sentiment_compound": 0.0
        },
        {
            "id": "heij0kv",
            "score": 1,
            "text": "Makes sense. I've already lived through way too many natural disasters. I just lost my apartment and 90% of my belongings to hurricane Ida last month.",
            "title_similarity": "0.710388",
            "sentiment_compound": -0.5267
        },
        {
            "id": "heij2qd",
            "score": 1,
            "text": "Isn't climate going to mainly affect third world countries?",
            "title_similarity": "0.4037014",
            "sentiment_compound": 0.0
        },
        {
            "id": "heijo36",
            "score": 1,
            "text": "And those kids in developed nations are going to asked their grandparents why they didn't do enough to stop it when they've known their whole lives it was coming.",
            "title_similarity": "0.5483577",
            "sentiment_compound": -0.296
        },
        {
            "id": "heik303",
            "score": 1,
            "text": "Republicans apparently think those are rookie numbers",
            "title_similarity": "0.3635412",
            "sentiment_compound": 0.0
        },
        {
            "id": "heikaf4",
            "score": 1,
            "text": "so I lived through may 4 hurricanes, my grandkids will live through 7? truthfully that's not too bad if that is all there is. better engineered homes and cities can make huge headways there.",
            "title_similarity": "0.62505376",
            "sentiment_compound": 0.8735
        },
        {
            "id": "heiktaq",
            "score": 1,
            "text": "Well, at least they'll have a counter argument to:\n\n\"When I was your age I walked to school with snow up to my armpits, uphill both ways.\"",
            "title_similarity": "0.45665893",
            "sentiment_compound": -0.1027
        },
        {
            "id": "heil3zu",
            "score": 1,
            "text": "I think it'll be plenty more than that",
            "title_similarity": "0.23434925",
            "sentiment_compound": 0.0
        },
        {
            "id": "heil62q",
            "score": 1,
            "text": "They'll walk to school uphill both ways through dust storms, murder Hornet swarms in a drought.",
            "title_similarity": "0.43368194",
            "sentiment_compound": -0.6908
        },
        {
            "id": "heil65b",
            "score": 1,
            "text": "I dont think so , I was born in the 70, we lived through the mini ice age, acid rain, global warm, global cooling, climate change , h1n1,all the other hyped up viruses,  and it all turn out to false. The big lie. Remember Al Gore , we all should be under water by now from global warming.  The elite keep buying houses at the beach.",
            "title_similarity": "0.5832353",
            "sentiment_compound": 0.3612
        },
        {
            "id": "heilc01",
            "score": 1,
            "text": "When i was a kid, on valentines day weekend we had enough snow to build a snowman. On my kids valentine's day weekend we had enough snow to knockout the Texas power grid that we went 4 days without power.",
            "title_similarity": "0.67383814",
            "sentiment_compound": 0.0
        },
        {
            "id": "heili0i",
            "score": 1,
            "text": "Its called gen z cause its going to be the last generation",
            "title_similarity": "0.34108937",
            "sentiment_compound": 0.0
        },
        {
            "id": "heim2yj",
            "score": 1,
            "text": "Until they start targeting the large corporations who make up the overwhelming majority of emissions then I won’t take climate change seriously.",
            "title_similarity": "0.5145538",
            "sentiment_compound": -0.1779
        },
        {
            "id": "heim42v",
            "score": 1,
            "text": "Consider me shocked. But not really.",
            "title_similarity": "-0.04404853",
            "sentiment_compound": -0.1655
        },
        {
            "id": "heimmch",
            "score": 1,
            "text": "key words \"live through\"",
            "title_similarity": "0.13022497",
            "sentiment_compound": 0.0
        },
        {
            "id": "heimyi5",
            "score": 1,
            "text": "And their grand parents will tell them to pick themselves up from their boot straps",
            "title_similarity": "0.41366625",
            "sentiment_compound": 0.4588
        },
        {
            "id": "heinmxz",
            "score": 1,
            "text": "Yeah, their grandparents haven't lived through any have they?",
            "title_similarity": "0.31049252",
            "sentiment_compound": 0.296
        },
        {
            "id": "heio8bi",
            "score": 1,
            "text": "So if your grandparents didn't live through any climate disasters, you're golden!  Yay!",
            "title_similarity": "0.5392337",
            "sentiment_compound": -0.1984
        },
        {
            "id": "heiod5d",
            "score": 1,
            "text": "Grandparents 401k were lit tho",
            "title_similarity": "0.3630649",
            "sentiment_compound": 0.0
        },
        {
            "id": "heiorep",
            "score": 1,
            "text": "And that is why I don’t want kids of my own",
            "title_similarity": "0.12795839",
            "sentiment_compound": 0.0772
        },
        {
            "id": "heiox5r",
            "score": 1,
            "text": "Maybe so, but will they have to go uphill both ways through them? Otherwise still not as bad",
            "title_similarity": "0.28212085",
            "sentiment_compound": 0.5824
        },
        {
            "id": "heip1f4",
            "score": 1,
            "text": "that's a sobering thought... will make for a very uncertain and unstable future, moving countries even several times in their lifetimes... Wow, that is unprecedented probably.",
            "title_similarity": "0.52440804",
            "sentiment_compound": -0.3086
        },
        {
            "id": "heipf5n",
            "score": 1,
            "text": "All I can hope for at this point is some driverless car to hit me before we get the worst of it.",
            "title_similarity": "0.26520956",
            "sentiment_compound": -0.296
        },
        {
            "id": "heipktj",
            "score": 1,
            "text": "Disasters is a weird word for natural occurrences that effect people",
            "title_similarity": "0.3156343",
            "sentiment_compound": -0.4215
        },
        {
            "id": "heipq0f",
            "score": 1,
            "text": "And this is why I’m not having any.  Well, that and several other reasons, but this is the primary reason.",
            "title_similarity": "0.1622973",
            "sentiment_compound": -0.1045
        },
        {
            "id": "heiq0n2",
            "score": 1,
            "text": "If your from The gulf coast this is normal and you know your grandparents lived through the worst one so far. \n\nSource I’m fixing my hurricane battered home right now.",
            "title_similarity": "0.47805429",
            "sentiment_compound": -0.6249
        },
        {
            "id": "heiqc4i",
            "score": 1,
            "text": "yeah, but their grandparents didn't have seat belts, so yeah",
            "title_similarity": "0.29963568",
            "sentiment_compound": 0.6597
        },
        {
            "id": "heiqcim",
            "score": 1,
            "text": "I really wish this were for life expectancy-related reasons, that’s a much happier version of the future than the one we inhabit",
            "title_similarity": "0.3881726",
            "sentiment_compound": 0.7501
        },
        {
            "id": "heiqd79",
            "score": 1,
            "text": "So basically, we're stronger.",
            "title_similarity": "0.16291705",
            "sentiment_compound": 0.4336
        },
        {
            "id": "heiqfzp",
            "score": 1,
            "text": "I would like to see the model that was used to come up with that data.",
            "title_similarity": "0.029138599",
            "sentiment_compound": 0.3612
        },
        {
            "id": "heiqvnq",
            "score": 1,
            "text": "I don't remember living through a climate disaster when i was young.  Places 2 hours away would get tornados on occasion but nothing happened where we lived.",
            "title_similarity": "0.46355146",
            "sentiment_compound": -0.3716
        },
        {
            "id": "heir1ef",
            "score": 1,
            "text": "Everything from here on out is a climate disaster.",
            "title_similarity": "0.36161658",
            "sentiment_compound": -0.6249
        },
        {
            "id": "heir7r0",
            "score": 1,
            "text": "This is my problem with headlines:\n\nThis is exactly like saying \"Children today will live through three times more iOS updates than their grandparents\" \n\nLike..... yeah no sh\\*\\*",
            "title_similarity": "0.8275565",
            "sentiment_compound": 0.3182
        },
        {
            "id": "heirslq",
            "score": 1,
            "text": "Those (radical changes opposing) grandparents will be the most hated generation of all of mankind.",
            "title_similarity": "0.4432657",
            "sentiment_compound": -0.6697
        },
        {
            "id": "heirzjc",
            "score": 1,
            "text": "A large portion, of those living now or born after today, won't live til 2030, possibly, 2035. We're fucked.",
            "title_similarity": "0.5692879",
            "sentiment_compound": -0.6597
        },
        {
            "id": "heisbay",
            "score": 1,
            "text": "I’ve already lived through 9/11, global economic crash, tsunami and nuclear meltdown, housing crisis, COVID, 20 years and billions of tax dollars wasted in Afghanistan, and the looming environmental disaster.",
            "title_similarity": "0.6473548",
            "sentiment_compound": -0.9393
        },
        {
            "id": "heisczz",
            "score": 1,
            "text": "And hopefully 3x less wars",
            "title_similarity": "0.5143039",
            "sentiment_compound": -0.1548
        },
        {
            "id": "heisl2x",
            "score": 1,
            "text": "Maybe *some* of them will live...",
            "title_similarity": "0.11984377",
            "sentiment_compound": 0.0
        },
        {
            "id": "heitdg3",
            "score": 1,
            "text": "Not unless the first one kills them.",
            "title_similarity": "0.25154448",
            "sentiment_compound": -0.5423
        },
        {
            "id": "heite9d",
            "score": 1,
            "text": "My dad left me climate disasters in the bathroom every morning growing up. I'll be fine.",
            "title_similarity": "0.45913213",
            "sentiment_compound": -0.2732
        },
        {
            "id": "heitimk",
            "score": 1,
            "text": "\"Live through\" is quite optimistic for what the article suggests.",
            "title_similarity": "0.23507014",
            "sentiment_compound": 0.3804
        },
        {
            "id": "heitx1q",
            "score": 1,
            "text": "Will happen maybe. That’s what the title says… I hate it. Most likely sure.",
            "title_similarity": "0.18788859",
            "sentiment_compound": -0.2782
        },
        {
            "id": "heiu09k",
            "score": 1,
            "text": "Boy oh boy can’t wait for more tornadoes (tho for okies moore will take most of them)",
            "title_similarity": "0.44912076",
            "sentiment_compound": 0.0
        },
        {
            "id": "heivdfz",
            "score": 1,
            "text": "Children? How about millennial adults?",
            "title_similarity": "0.33268443",
            "sentiment_compound": 0.0
        },
        {
            "id": "heiwi3t",
            "score": 1,
            "text": "So what's the average? \nI survived the blizzard of 92' (TN)\nThe flood of 94'(GA) \nThe draught in 96.. (GA)\n\nThose are the three big events I remember from my childhood.",
            "title_similarity": "0.67949617",
            "sentiment_compound": 0.5106
        },
        {
            "id": "heiz38s",
            "score": 1,
            "text": "Is this optimistic or pessimistic?",
            "title_similarity": "0.016851647",
            "sentiment_compound": -0.0516
        },
        {
            "id": "heiz3rn",
            "score": 1,
            "text": "Many of them might not live through them, actually.",
            "title_similarity": "0.24218819",
            "sentiment_compound": 0.0
        },
        {
            "id": "heizl7w",
            "score": 1,
            "text": "As a parent I refuse for this to be true.\n\nNot as in “I refuse for this to be true and I reject the evidence” but as in “I don’t want to let that happen and I don’t know what I can do to contribute preventing that”.",
            "title_similarity": "0.15224923",
            "sentiment_compound": 0.0129
        },
        {
            "id": "hej0rpv",
            "score": 1,
            "text": "I don't know man. My grandpa always said he walked through a lot of snow to school everyday. Hell he even lived in Louisiana. Must have been crazy weather back then.",
            "title_similarity": "0.53450227",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hej19nw",
            "score": 1,
            "text": "Salmon river does as well at least until it hits the Columbia and heads west",
            "title_similarity": "0.34237638",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hej1sve",
            "score": 1,
            "text": "Can someone provide for me an example of a “climate disaster” that has already occurred?",
            "title_similarity": "0.35790154",
            "sentiment_compound": 0.0
        },
        {
            "id": "hej28aj",
            "score": 2,
            "text": "Like I get it... we are all fucked. Humans broke the world and we allow ourselves to just continue right on breaking it.",
            "title_similarity": "0.25709882",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hej2k16",
            "score": 1,
            "text": "Is that partly because advances in medicine and health care allow children today to have longer life spans than their grandparents?",
            "title_similarity": "0.5881412",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hej3gcb",
            "score": 1,
            "text": "\"Some of you may die, but that's a sacrifice we're willing to make.\"\n\n-Boomer Corporate CEOs",
            "title_similarity": "0.39674085",
            "sentiment_compound": -0.3506
        },
        {
            "id": "hej5ja3",
            "score": 1,
            "text": "\"But why won't they buy more diamonds?!?!\"\n\n-Boomer news headline",
            "title_similarity": "0.379981",
            "sentiment_compound": 0.0
        },
        {
            "id": "hej5mpm",
            "score": 1,
            "text": "Children in areas where ignorant/prideful parents force them to live you mean.",
            "title_similarity": "0.3808122",
            "sentiment_compound": 0.0
        },
        {
            "id": "hej5w56",
            "score": 1,
            "text": "Finally, some exciting news.",
            "title_similarity": "0.14671028",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hej67s4",
            "score": 1,
            "text": "AHAHAH! r/UpliftingNews \"the world’s biggest carbon-removal plant switches on\".",
            "title_similarity": "0.45807904",
            "sentiment_compound": 0.0
        },
        {
            "id": "hej6sht",
            "score": 1,
            "text": "Only because the 4th one is generally fatal.",
            "title_similarity": "0.26454097",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hej6wfg",
            "score": 1,
            "text": "Maybe,  but 3 to 5 times less wars",
            "title_similarity": "0.528811",
            "sentiment_compound": -0.6663
        },
        {
            "id": "hej7va9",
            "score": 1,
            "text": "their boomer grandparents don't mind, particularly the conservative ones that don't believe in all that fancy climate change stuff.",
            "title_similarity": "0.3120438",
            "sentiment_compound": 0.0
        },
        {
            "id": "hej898b",
            "score": 1,
            "text": "If Steven pinker is right then less and less are dying in these disasters. That's not to say disregard them but it's not factual to assert that more will die, even though that's logical.",
            "title_similarity": "0.31145808",
            "sentiment_compound": -0.8253
        },
        {
            "id": "hej8vjq",
            "score": 1,
            "text": "\"back in my day, we had to walk to school in....\"\n\nGrampa, it was 2 foot of snow when I left. Floods by lunch, and now it's 42c right now....also the ocean is on fire.",
            "title_similarity": "0.5549867",
            "sentiment_compound": -0.34
        },
        {
            "id": "hej9d7y",
            "score": 1,
            "text": "Their grandparents dealt with way more wars than this generation will have to deal with.",
            "title_similarity": "0.7108145",
            "sentiment_compound": -0.5984
        },
        {
            "id": "hej9ku6",
            "score": 1,
            "text": "Whatever you say Al Gore!!!!!",
            "title_similarity": "0.11090718",
            "sentiment_compound": 0.0
        },
        {
            "id": "hejas8c",
            "score": 1,
            "text": "This is a pretty dumb metric for measuring climate change. The worst effects of it are gradual and constant, got nothing to do with big newsworthy storms. Frankly this headline reads like Republican propaganda because 3x doesn’t seem that bad and it leaves out a lot of other stuff",
            "title_similarity": "0.37103736",
            "sentiment_compound": -0.802
        },
        {
            "id": "hejbs9w",
            "score": 1,
            "text": "Hopefully we dont have to live through another world war as well.",
            "title_similarity": "0.27797312",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hejbv3z",
            "score": 1,
            "text": "My kids survived a Texas freeze with no power for 3 days and floated down the Bronx Expressway in a rental car in a hurricane which forced us to wade down an onramp and enter the partially flooded subway.  My daughter is 1 and son is 3.",
            "title_similarity": "0.61275864",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hejd5zy",
            "score": 1,
            "text": "People don’t care and won’t change anything unless it happens to them. \nClimate change is real but the day it starts affecting the people in power it will not matter to them.",
            "title_similarity": "0.25099066",
            "sentiment_compound": 0.2474
        },
        {
            "id": "hejdo2y",
            "score": 1,
            "text": "Any Vegas books where I can I bet the over?  No way it's only 3 times ...I bet it's 30 times, or more.",
            "title_similarity": "0.6190824",
            "sentiment_compound": -0.296
        },
        {
            "id": "heje77x",
            "score": 1,
            "text": "Wait, \"live through\"?\n\n.. that's a questionable assumption.\n\nMost people aren't going to die from the severe weather patterns, people are going to die from other people who are desperate due to the effects of climate change. E.g., there isn't much a man wouldn't do to protect / save the lives of his family. Once climate change creates worldwide famine.. it's all over. Again, most people won't starve, they will be killed by starving people.\n\nGive me a lion in the jungle over a desperate human any day. At least the lion may spare me because it isn't hungry, whereas the human would store my meat for later.",
            "title_similarity": "0.52717286",
            "sentiment_compound": -0.8926
        },
        {
            "id": "hejf4q0",
            "score": 1,
            "text": "Our children are going to curse our selfishness.",
            "title_similarity": "0.32277715",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hejfapg",
            "score": 1,
            "text": "Yeah, but if they're not walking to school through it, uphill both ways, does it really count?",
            "title_similarity": "0.3742943",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hejfnlx",
            "score": 2,
            "text": "I'm sure I'll be labeled a tin foil hat wearing idiot for saying this, but I really think that if you live anywhere near the coast and have an opportunity to move significantly farther inland you should take it. Better now (relatively) than when there's a mad dash later.",
            "title_similarity": "0.39852935",
            "sentiment_compound": 0.4118
        },
        {
            "id": "hejfxbe",
            "score": 1,
            "text": "We barely survived the acid rain.",
            "title_similarity": "0.33949524",
            "sentiment_compound": 0.4601
        },
        {
            "id": "hejg5ty",
            "score": 1,
            "text": "So basically everywhere will be Florida",
            "title_similarity": "0.043204933",
            "sentiment_compound": 0.0
        },
        {
            "id": "hejg8mk",
            "score": 1,
            "text": "Back in my time... oh wait",
            "title_similarity": "0.0654867",
            "sentiment_compound": 0.0
        },
        {
            "id": "hejg99y",
            "score": 1,
            "text": "Back in my time... oh wait",
            "title_similarity": "0.0654867",
            "sentiment_compound": 0.0
        },
        {
            "id": "hejgc0n",
            "score": 1,
            "text": "Haha. “Three times”? So optimistic… this must have been written to keep the children today from revolting.",
            "title_similarity": "0.63394535",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hejhqdu",
            "score": 1,
            "text": "The reason lots of people aren’t having kids is because lots of those children won’t live through them",
            "title_similarity": "0.47715077",
            "sentiment_compound": 0.0
        },
        {
            "id": "hejjuvs",
            "score": 1,
            "text": "Not bad considering my kid’s grandparents lived through none. Except horrific winters I guess.",
            "title_similarity": "0.45089644",
            "sentiment_compound": 0.7481
        },
        {
            "id": "hejk4ii",
            "score": 1,
            "text": "It's okay because the rich people made more of the monies. \n\nThat evens out right?",
            "title_similarity": "0.3476181",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hejkwh9",
            "score": 1,
            "text": "*\"natural disasters\" would be way more fitting to make the comparison. climate disaster is used way more often to describe the whole situation with climate change",
            "title_similarity": "0.5341835",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hejl8um",
            "score": 1,
            "text": "And the old ones will come up with thousands of ideas how this is our fault cause it wasn't like that when they were young",
            "title_similarity": "0.55502045",
            "sentiment_compound": -0.5873
        },
        {
            "id": "hejlt8o",
            "score": 1,
            "text": "their grandparents burning fossil fuels are the reason why the climate is so bad anyway",
            "title_similarity": "0.4362716",
            "sentiment_compound": -0.6696
        },
        {
            "id": "hejm0u3",
            "score": 1,
            "text": "How much of this is because of human beings able to send information at the blink of an eye, or travel the planet easily..\n\nLeaders killed more people because the news didn't travel faster than their own feet could carry them, a horse could travel, or others",
            "title_similarity": "0.52429676",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hejncxm",
            "score": 1,
            "text": "i guess that's it for \"back in my day, we had to walk to school, uphill, both ways, in the snow etc\"\n\nhahahahaaahahahaaa aahhh this sucks.",
            "title_similarity": "0.39444876",
            "sentiment_compound": -0.4357
        },
        {
            "id": "hejnfo8",
            "score": 2,
            "text": "I live in a crippling state of anxiety thinking about my nieces and nephews (age 3-6) living through this. Myself too. But mostly them.",
            "title_similarity": "0.5289143",
            "sentiment_compound": -0.09
        },
        {
            "id": "hejogt7",
            "score": 1,
            "text": "Bold to assume they live through it.",
            "title_similarity": "0.17645735",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hejpdw4",
            "score": 1,
            "text": "Oh I bet they will just like the 2 generations before were promised....oh wait",
            "title_similarity": "0.2958091",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hejq1zp",
            "score": 2,
            "text": "i really honestly feel sad for children and new babies. what a shitpile to inherit",
            "title_similarity": "0.3583036",
            "sentiment_compound": -0.0183
        },
        {
            "id": "hejqbb8",
            "score": 3,
            "text": "Reminds me of the Simpsons were Homer says \" every generation has it's struggles. Yours is living with a collapsing economy and fire tornadoes\"",
            "title_similarity": "0.56496906",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hejqbmv",
            "score": 1,
            "text": "You're not gonna slow it heaven knows you tried",
            "title_similarity": "-0.01640784",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hejqxr5",
            "score": 1,
            "text": "Masslive.com looks just like NJ.com. \n\nI suspect it’s not a coincidence. (Sorry if everyone already knows this).",
            "title_similarity": "0.17157233",
            "sentiment_compound": 0.1336
        },
        {
            "id": "hejrbn0",
            "score": 1,
            "text": "Thanks Great Grand and Grand parents.",
            "title_similarity": "0.27225417",
            "sentiment_compound": 0.9186
        },
        {
            "id": "hejrf4p",
            "score": 1,
            "text": "Someone born in 1960 did nothing and made all this worse.",
            "title_similarity": "0.24095371",
            "sentiment_compound": -0.561
        },
        {
            "id": "hejry6u",
            "score": 1,
            "text": "Damn it I have to *live* through them. Ugh it's just gonna be harder to get to work :/",
            "title_similarity": "0.32126844",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hejs9ff",
            "score": 1,
            "text": "Climate change is and has been the norm on our planet since the beginning of time.  Droughts have happened before. And they will happen again. Is it humans influence only or are there other factors? Like solar, pole shift, and activist ambition? Sea levels have changed by hundreds of feet in the past. And will again in the future. If you want to curate the environment rather than let it do its own thing, plant more trees, fish less.",
            "title_similarity": "0.6270573",
            "sentiment_compound": 0.4871
        },
        {
            "id": "hejse7b",
            "score": 3,
            "text": "How is this possible? My grandparents walked uphill to school both ways in 6’ of snow in July!",
            "title_similarity": "0.48487318",
            "sentiment_compound": 0.0
        },
        {
            "id": "hejsmjo",
            "score": 2,
            "text": "Kids are going to be telling their grandparents how they walked up a hill in the snow to get to school.",
            "title_similarity": "0.4594883",
            "sentiment_compound": 0.0
        },
        {
            "id": "hejtfai",
            "score": 1,
            "text": "I am actually surprised it took this long! I personally thought that this would have hit (the world) in a the late ‘90’s- 00’s\n\nI was off by 20 years, and am still off!",
            "title_similarity": "0.6001904",
            "sentiment_compound": 0.3578
        },
        {
            "id": "hejtjsa",
            "score": 2,
            "text": "And grand parents don’t give a fuckkkk",
            "title_similarity": "0.21050027",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hejujy1",
            "score": 1,
            "text": "So how do they know kids will live to 300 years old now? Seems a bit far fetched.",
            "title_similarity": "0.546914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hejv45y",
            "score": 1,
            "text": "Don't forget about economic recessions too :)",
            "title_similarity": "0.3035509",
            "sentiment_compound": 0.567
        },
        {
            "id": "hejvkcx",
            "score": 1,
            "text": "So glad I don’t have kids.",
            "title_similarity": "0.096401766",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hejwjzf",
            "score": 1,
            "text": "So, how many climate disasters does the average person think they've lived through?",
            "title_similarity": "0.6523135",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hejx9g3",
            "score": 1,
            "text": "Have you heard about the October rent strike?",
            "title_similarity": "0.2397532",
            "sentiment_compound": -0.128
        },
        {
            "id": "hejxh8y",
            "score": 1,
            "text": "That's OK. They will be inside on their iPads anyway.",
            "title_similarity": "0.122641936",
            "sentiment_compound": 0.0
        },
        {
            "id": "hejy8v9",
            "score": 2,
            "text": "Im shocked the number is that low.",
            "title_similarity": "0.1069776",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hejy980",
            "score": 2,
            "text": "Aaannnnd this is why I'm not having kids!",
            "title_similarity": "0.14340883",
            "sentiment_compound": 0.0
        },
        {
            "id": "hejyuci",
            "score": 1,
            "text": "Thanks grandpa's generation",
            "title_similarity": "0.24662863",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hejz3wq",
            "score": 1,
            "text": "Those kids will not live to the age their grandparents are now.",
            "title_similarity": "0.47041923",
            "sentiment_compound": 0.0
        },
        {
            "id": "hejzugs",
            "score": 1,
            "text": "Dammit grandma i told you you had it easier you hoe.",
            "title_similarity": "0.34588212",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hejzwtz",
            "score": 1,
            "text": "I’ve seen Katrina and Ida devastate and I’m in my 20s",
            "title_similarity": "0.5261657",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hek0dfd",
            "score": 1,
            "text": "Masslive.com used to be hilarious before they shut down the comments section.",
            "title_similarity": "0.36740613",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hek0f35",
            "score": 3,
            "text": "Generation before me got 3 houses purchases in a lifetime. I got 3 recessions in my lifetime. Next one gets 3 climate disasters. As is tradition.",
            "title_similarity": "0.830665",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hek1u87",
            "score": 1,
            "text": "Does widespread reporting inflate the numbers at all? I mean you didn't hear about something very far away unless it was truly worthy before the internet",
            "title_similarity": "0.42082947",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hek4bx4",
            "score": 1,
            "text": "The variables in these 2 data sets are insanely large and abundant",
            "title_similarity": "0.2709756",
            "sentiment_compound": 0.0
        },
        {
            "id": "hek4pma",
            "score": 1,
            "text": "Bold of you to assume any of us are going to survive.",
            "title_similarity": "0.21614486",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hek5t88",
            "score": 2,
            "text": "r/antinatalism\n\nBreak the cycle.",
            "title_similarity": "0.23489818",
            "sentiment_compound": 0.0
        },
        {
            "id": "hek6jnw",
            "score": 1,
            "text": "And still, people are out here intentionally choosing to have more bio children because they want play things. Even though the risks of their suffering go up every day (of which climate change is only one of the ways); even though adoption exists; even though literally so much suffering is likely. But noooo I mUsT mAkE fAmLy, cUz mY LiFe hAZ no MeAnInG wItHouT mY dNA sKin PeTs\n\nSigh.",
            "title_similarity": "0.5591296",
            "sentiment_compound": -0.6797
        },
        {
            "id": "hek6nfb",
            "score": 1,
            "text": "Think about what that means for a second. Not 3 more, 3 times more. Imagine going through Hurricane Katrina 3 times",
            "title_similarity": "0.6771486",
            "sentiment_compound": 0.0
        },
        {
            "id": "hek6qt5",
            "score": 1,
            "text": "Can’t wait until we all burn!",
            "title_similarity": "0.24669138",
            "sentiment_compound": 0.0
        },
        {
            "id": "hek70p3",
            "score": 1,
            "text": "Those kids in the picture aren’t wearing masks though so they’ll be dead soon anyways right?",
            "title_similarity": "0.35058093",
            "sentiment_compound": -0.6771
        },
        {
            "id": "hek71gm",
            "score": 1,
            "text": "Yeah okay... remember when Biden committed a war crime killing a whole family a couple weeks ago??? Let’s not forget his prior treason... That’ll be fun day when he’s given the proper reward listed in the constitution for committing treason",
            "title_similarity": "0.52824265",
            "sentiment_compound": -0.7162
        },
        {
            "id": "hek7b1z",
            "score": 1,
            "text": "* if they live through it",
            "title_similarity": "0.14518471",
            "sentiment_compound": 0.0
        },
        {
            "id": "hek834g",
            "score": 1,
            "text": "It’s always “study suggests” instead of “empirical evidence proves”",
            "title_similarity": "0.23021768",
            "sentiment_compound": 0.0
        },
        {
            "id": "hek88aj",
            "score": 1,
            "text": "Sucks to be them!\n\n* crack open Monster can *",
            "title_similarity": "0.2285343",
            "sentiment_compound": -0.4199
        },
        {
            "id": "hek8t5q",
            "score": 1,
            "text": "Good thing their grandparents are dieing due to COVID before they can describe how different it was.",
            "title_similarity": "0.49100897",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hek9qdj",
            "score": 1,
            "text": "Just 3? In what perfect world? Shits gonna get fucked real fast. Famine fucked.",
            "title_similarity": "0.5609672",
            "sentiment_compound": -0.8611
        },
        {
            "id": "hekau3e",
            "score": 1,
            "text": "Huh so our grandparents way of going to school is going to become more prevalent",
            "title_similarity": "0.44358122",
            "sentiment_compound": 0.0
        },
        {
            "id": "hekavq9",
            "score": 1,
            "text": "Yet antinatalism is still frowned upon.",
            "title_similarity": "0.10665482",
            "sentiment_compound": 0.0
        },
        {
            "id": "hekc9rs",
            "score": 1,
            "text": "Kids growing up will now go through about 24 lifetimes rather than the initial 12.",
            "title_similarity": "0.5306965",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hekevj2",
            "score": 2,
            "text": "\"worst day in your life SO FAR\"",
            "title_similarity": "0.28114653",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hekeyhb",
            "score": 1,
            "text": "Empirically, this is a hypothesis that is observable over time; I sincerely hope the scientists behind the study compare apples to apples, and don’t move goalposts to shape a narrative that fits their agenda.",
            "title_similarity": "0.26748914",
            "sentiment_compound": 0.7184
        },
        {
            "id": "heki40w",
            "score": 1,
            "text": "They ever have to blow a Nintendo cartridge though?!!",
            "title_similarity": "0.2198958",
            "sentiment_compound": 0.0
        },
        {
            "id": "hekizuc",
            "score": 1,
            "text": "So you mean to say in 50 years people will be telling their kids how they had to walk uphill in 8ft of snow both ways to get to and from school?",
            "title_similarity": "0.5856428",
            "sentiment_compound": 0.0
        },
        {
            "id": "hekj46k",
            "score": 1,
            "text": "You could've just said \"three times as many disasters\" not like it's just the climate we have to worry about.",
            "title_similarity": "0.72262955",
            "sentiment_compound": -0.8229
        },
        {
            "id": "heklbam",
            "score": 1,
            "text": "I wonder if we just didn't know about some of them.\n\nGrowing up a tsunami was mythical thing, now we have warning systems for example.\n\nAnd sink holes in remote towns, I think before we'd not have heard about them.\n\nNo doubt we have a climate crisis, but I think we're also better at reporting what's going on.",
            "title_similarity": "0.4866721",
            "sentiment_compound": 0.3622
        },
        {
            "id": "hekp4rn",
            "score": 1,
            "text": "\n Find another person. Individually add up how much it costs to sustain you and/or your lifestyle and combine what’s left over with them and have them do the same. Each taking turns in spending every other payday.\r  \n\r  \nYour jobs will provide the income and the combined surplus will make it easier to pursue hobbies or climb the societal ladder. Including more and more people will add to the over all supply that each person in the network will have access to, thereby compounding the process.\r  \n\r  \nFor added security (insurance) have each person in the network find others to rely on. With that you’ll have overlapping security.\r  \n\r  \nSupplant anything of value to you personally for the “income” portion and as long as you’re covering for yourself first and foremost, all goods (including for luxury) will get distributed across a wider system in accordance to how you relate to other people. Use cost cutting measures to increase any holdings and share information.\r  \n\r  \nWith that added insurance, use any and all surplus to invest in people most capable of bringing about change, including local chapters and environmental projects. Tell them about this process and aid them in building up a web of support and you can scale up any system, company or self-governance.",
            "title_similarity": "0.456041",
            "sentiment_compound": 0.9485
        },
        {
            "id": "hel1yv6",
            "score": 1,
            "text": "So i live in iowa and all the corn should have been harvested by now yet a see fields upon fields acres or more full of dried out corn, you could throw a match in and the fileds would catch fire.. why even grow?? Sorry i have the mindset of a teen, bit slow...",
            "title_similarity": "0.45720774",
            "sentiment_compound": -0.4696
        },
        {
            "id": "hel3mae",
            "score": 1,
            "text": "Climate change hurr durr",
            "title_similarity": "0.288892",
            "sentiment_compound": 0.0
        },
        {
            "id": "hel3xi0",
            "score": 1,
            "text": "Climate disaster ? What a joke just a bunch of green propaganda.  50 years ago if you live through a hurricane you were lucky now it was a climate disaster.",
            "title_similarity": "0.50568694",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hel5biu",
            "score": 1,
            "text": "Weather modification has been in existence since at least the Vietnam war.",
            "title_similarity": "0.2745136",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hel6xlw",
            "score": 1,
            "text": "My 12 year old cousin is having a major existential crisis because she's scared of the world dying and it's really sad. When I was 12 I just wanted my next Bionicle toy :/",
            "title_similarity": "0.5594373",
            "sentiment_compound": -0.9197
        },
        {
            "id": "helbb0j",
            "score": 1,
            "text": "So it seems that the generation grandparents will harass their grandkids with stories  that 'life on earth was sooo simple back in the days, we had water, food, functioning internet, cable tv, and cars.... Now you have floods, and famine and death. We had it hard, we only saw those things on tv. '",
            "title_similarity": "0.5337322",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hemtc3e",
            "score": 1,
            "text": "It's a sad world we're leaving to our children.",
            "title_similarity": "0.29870993",
            "sentiment_compound": -0.4767
        },
        {
            "id": "henxcnx",
            "score": 1,
            "text": "Children today may live through a corrupt government using weather and fear to grab authoritarian power. \n\nMay live is the important part.",
            "title_similarity": "0.48424846",
            "sentiment_compound": -0.34
        },
        {
            "id": "hgame1l",
            "score": 1,
            "text": "We all contributed to the issue sadly",
            "title_similarity": "0.2268546",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hhq74kr",
            "score": 1,
            "text": "If anyone wants to take part in addressing climate change then I suggest that you check out r/climateoffensive to get started",
            "title_similarity": "0.2981726",
            "sentiment_compound": 0.0
        }
    ]
}