{
    "Psychedelics might reduce internalized shame and complex trauma symptoms in those with a history of childhood abuse. Reporting more than five occasions of intentional therapeutic psychedelic use weakened the relationship between emotional abuse/neglect and disturbances in self-organization.\n": [
        {
            "id": "heubloc",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.42358467",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hev8okz",
            "score": -1,
            "text": "Science is catching up to ancient wisdom. Good for science.",
            "title_similarity": "0.29830718",
            "sentiment_compound": 0.743
        },
        {
            "id": "heuoskp",
            "score": 25,
            "text": "This study seems pretty shaky. Who knows what could be leading that group to report decreased symptomology. Also I could be wrong in my understanding, but asking if participants have taken psychedelic substances to heal childhood traumas seems like a bit of a confound? \n\nMaybe interesting qualitative findings would come from this, but imo this is not the kind of study the field of psychedelic-assisted psychotherapy needs right now.",
            "title_similarity": "0.72393763",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hevhuei",
            "score": 0,
            "text": "I will take 3 boxes to go please!  I hope this is avail soooon",
            "title_similarity": "0.3095077",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hevr8rh",
            "score": 0,
            "text": "LSD helped with my depression",
            "title_similarity": "0.6491545",
            "sentiment_compound": -0.5719
        },
        {
            "id": "heuki58",
            "score": 11,
            "text": "I'd be curious to see the extent of it's reach - especially when unpacking trauma of people of colour.\nWhether it's deep-rooted or the implications of figuring one's cultural identity in a western atmosphere.",
            "title_similarity": "0.45539355",
            "sentiment_compound": -0.1689
        },
        {
            "id": "heuj3d9",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "hevqerk",
            "score": -8,
            "text": "I can’t believe people think this works, but if they believe it then I suppose it’s good for them. I really feel like it’s a placebo…",
            "title_similarity": "0.41205293",
            "sentiment_compound": 0.8185
        },
        {
            "id": "hew8d8e",
            "score": 1,
            "text": "Don’t drug people because you don’t have time to actually help them make them stronger by showing them how to do it",
            "title_similarity": "0.33427632",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hev065s",
            "score": 6,
            "text": "I wonder if shrooms destroy some other connections in brain, besides \"bad\" ones.\nI suspect psilocybin couldn't decide, which neuron structures is bad and which is good.",
            "title_similarity": "0.63115954",
            "sentiment_compound": -0.8689
        },
        {
            "id": "hevjgln",
            "score": 3,
            "text": "Psychedelics is like knowing a 2nd language. It enables you to see life through a different perspective.",
            "title_similarity": "0.41739273",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hevhclb",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.115812205"
        },
        {
            "id": "hev3q39",
            "score": 5,
            "text": "Its too bad the social stigma had been so well ingrained that this thing that might help people get over trauma and live a better would be rejected by those patients because \"drugs\" and \"hippies\"",
            "title_similarity": "0.6343577",
            "sentiment_compound": -0.3091
        },
        {
            "id": "heuvwh3",
            "score": 4,
            "text": "Glad to see scientific evidence backing up my anecdotal experiences.",
            "title_similarity": "0.27357262",
            "sentiment_compound": 0.4767
        },
        {
            "id": "heve96g",
            "score": 2,
            "text": "And yet... I got fined for using them.",
            "title_similarity": "0.3816808",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevm9dh",
            "score": 1,
            "text": "Helped me overcome the anxiety I got from being bullied in middle school. \n\nHelped me see the intricate value of my own perspective and imagination- self appreciation increase of 50x fold. \n\nAlso helped/helps me be a better son, lover, friend, family member and stranger. \n\nExpand yo threshold for everything and you will know joy. It will only get better if you follow your own intuition and stop self sabotaging.",
            "title_similarity": "0.60978657",
            "sentiment_compound": 0.9612
        },
        {
            "id": "hevsn7p",
            "score": -1,
            "text": "How does one get into a trial?",
            "title_similarity": "0.23494092",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevg5ic",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "heuworo",
            "score": 18,
            "text": "This is why I am a huge proponent for more studies on how psilocybin interacts with the 5HT-2B receptor. Activation of this receptor is what caused Phen-Fen to be withdrawn from the market. Activating this receptor can lead to cardiac valvulopathy resulting from an overgrowth of collagen in the valves.\n\nWhy this isn't being studied is beyond me when millions of dollars are being put into potential therapeutic benefit. I think that benefit is null if it leads to cardiovascular problems.\n\nEspecially microdosing\n\nhttps://ecfes.net/science/why-chronic-microdosing-might-be-risky-to-the-heart/",
            "title_similarity": "0.5816783",
            "sentiment_compound": 0.6808
        },
        {
            "id": "heurcxn",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.115812205"
        },
        {
            "id": "hev7asx",
            "score": -3,
            "text": "So in other words drugs make you feel good",
            "title_similarity": "0.4356714",
            "sentiment_compound": 0.4404
        },
        {
            "id": "heviz2f",
            "score": -5,
            "text": "I regret doing this therapy. It made me a lot less aggressive when I NEED to be aggressive.",
            "title_similarity": "0.55115974",
            "sentiment_compound": -0.5729
        },
        {
            "id": "hevdjd6",
            "score": -3,
            "text": "help escape, but not cured :'(",
            "title_similarity": "0.381508",
            "sentiment_compound": 0.685
        },
        {
            "id": "hevuauq",
            "score": 3,
            "text": "I think it's a really slippery slope to give people with trauma and abuse in their past psychedelics. Speaking from experience I nearly lost myself in my inner demons during my LSD use, had a psychotic break. After a long break my DMT experiences were miraculous, I came back from the sick place I was in and actually became stable emotionally out of nowhere, and decided to get sober because alcoholism was destroying my life.\n\nHowever, I think my success with those experiences were really hit or miss. My LSD use nearly destroyed my mind. DMT was wildly rewarding. It's these extremes that can either greatly benefit your life or send you down a terrible path you might not be able to return from. My dad was abusive to me growing up and he told me later he is a person who's psychedelic experiences really destroyed him for a long time, I'm not sure he ever will be the same.",
            "title_similarity": "0.7020873",
            "sentiment_compound": -0.9624
        },
        {
            "id": "hev1izv",
            "score": 20,
            "text": "MDMA therapy saves lives.",
            "title_similarity": "0.50563717",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevjjh7",
            "score": 3,
            "text": "It worked for me. A few years ago my dad killed himself and it left me feeling depressed and hollow since up until a few months ago. I've had a lot more LSD than most people should probably ever take, but after getting to this headspace I don't regret it for a second. I don't hate the simple act of existing. And if I'm ever starting to feel like I'm going down that road again, a microdose of LSD helps me recenter.",
            "title_similarity": "0.65625995",
            "sentiment_compound": 0.8749
        },
        {
            "id": "hewpm0z",
            "score": 0,
            "text": "They've been saying variations of this for years. If it were true, at least one drug company would be making billions selling shrooms to the mentally ill. They would have plenty of money to pay off politicians to make it legal.",
            "title_similarity": "0.5211959",
            "sentiment_compound": 0.0258
        },
        {
            "id": "heusa34",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "heugxqh",
            "score": 384,
            "text": ">Most of the people in the world who are healing themselves with psychedelics are taking them in naturalistic settings — in nature, with friends, at home, at a rave\n\nA rave? Naturalistic?",
            "title_similarity": "0.53231734",
            "sentiment_compound": 0.5362
        },
        {
            "id": "hevjj1n",
            "score": 1,
            "text": "I’ve always wanted to try but I’m too afraid",
            "title_similarity": "0.2548868",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevqhcx",
            "score": 1,
            "text": "Dropping lsd a few times helped me overcome my childhood trauma and crippling anxiety and really let me be the narcissist I was always meant to be. Feels great.",
            "title_similarity": "0.6176634",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hewx3zr",
            "score": -1,
            "text": "Yeah that’s because you’re tripping\n\nHeroin also makes your stress disappear",
            "title_similarity": "0.6338384",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hev1ryj",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.115812205"
        },
        {
            "id": "hev8efg",
            "score": 2,
            "text": "Best to have real science behind the dosage because let me tell you… it might be the exact opposite if you take too much in a bad setting…",
            "title_similarity": "0.44823217",
            "sentiment_compound": 0.1779
        },
        {
            "id": "heviqa2",
            "score": 2,
            "text": "Looking forward to trying it tbh",
            "title_similarity": "0.1152484",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevj2a2",
            "score": 2,
            "text": "Seen here: why I’m moving to Colorado next year.",
            "title_similarity": "0.1893602",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevr0s9",
            "score": -2,
            "text": "okay, okay, here's your fix...",
            "title_similarity": "0.09450422",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hevt8sf",
            "score": 2,
            "text": "Psychedelics have so much to offer, we could utilise them very well if the law allows it. \nThe ban on psychedelic substances in this day and age is holding mankind back.",
            "title_similarity": "0.53205615",
            "sentiment_compound": -0.2975
        },
        {
            "id": "hev7xcn",
            "score": 2,
            "text": "Pros: more self aware\nCons: overthinking",
            "title_similarity": "0.30088493",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevimah",
            "score": 2,
            "text": "I know the ecstasy and acid i did back in the day really helped when I look back 20 yrs for alot of trauma and didn't realize it till lately",
            "title_similarity": "0.62761486",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hevce2d",
            "score": -6,
            "text": "So give them to child soldiers?  This is able to be weaponized, like all inventions.",
            "title_similarity": "0.22271176",
            "sentiment_compound": 0.3612
        },
        {
            "id": "heuiydw",
            "score": 55,
            "text": "Here's 5 instances where we did this on purpose..\n\nHow many were not on purpose, and how many were on purpose but didn't work?",
            "title_similarity": "0.6567026",
            "sentiment_compound": 0.0
        },
        {
            "id": "heuwr74",
            "score": 921,
            "text": "Forgive my laymen's take here; as far as I can tell, psychedelics tend to augment neuroplasticity - which can be very helpful in breaking-up unhelpful patterns. \n\nIt can also help burn them in or help make new unhelpful patterns just as easily - like any strong psychiatric tool, there is *significant* danger in misuse to compliment the near miraculous utility of careful, measured, supervised medical use.",
            "title_similarity": "0.6637906",
            "sentiment_compound": 0.9577
        },
        {
            "id": "hev53vk",
            "score": 130,
            "text": "I'm not discounting the potential benefits of psychedelics as a treatment for mental health disorders, but this study is not the home run a lot of people are suggesting it to be. The author himself says it is not enough to be causal. \n\nAs a user of occasional psychedelics myself I fully believe that there are many benefits and that we absolutely need to be doing more research of the therapeutic effects. However, as a scientist, asking 166 people if they used psychedelics and felt better about their childhood trauma afterwards hardly suggests any relationship. There are too many other variables that are uncontrolled. \n\nI'd love to see a study where they actually treat people with low dose of psilocybin and CBT over a number of sessions and then measure the propensity for disassociating shame and PTSD symptoms from childhood trauma.",
            "title_similarity": "0.64816546",
            "sentiment_compound": 0.4854
        },
        {
            "id": "heuunkt",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "heuxjyg",
            "score": 8,
            "text": "Question: what exactly causes the reduction in symptoms? I'm curious if it's like a \"mindblock\" or is it some suburb revelation your mind reaches that allows your brain to process it for what it is?",
            "title_similarity": "0.5596567",
            "sentiment_compound": 0.6553
        },
        {
            "id": "hevjo0g",
            "score": 8,
            "text": "Psychedelic drugs have amazing properties that are not necessarily dose dependent. So called microdosing has the potential for those who are resistant to SSRIs, cannot or chose not to adhere to a daily intake for months or years, for those who do not wish to have severe side effects related to SSRIs, those who would normally not seek therapy, etc. Even at subperceptual doses and even non-psychoactive psychedelics have been shown to have (immense) potential as anxiolytics, antidepressants, anti-addictives and generally marvellous for mental health. Perceptual doses are absolutely dangerous to people with underlying mental issues and can precipitate illness which would or would not come about later. They can be totally safe to use recreationally or they can cause severe HPPD or worse. They are extremely powerful and have an absolutely massive potential for all types of mental issues. They are in fact too powerful for their own good, and it will be a while until we see prescriptions for psychedelics. Since the 2010s when research into psychedelics became easier to apply for, there has been a huge output of (small) trials and studies looking at their benefits.\n\nThey have quite a wide therapeutic window for some but are completely out of the question for others. However, those who would benefit from psychedelics are often a difference Slice of the population than those who would benefit from SSRIs or therapy, or both.\n\n\nIn my opinion, no other class of substances has more potential to help with depression, anxiety and addiction than psychedelics in those who would otherwise reject treatment with traditional drugs.\n\nThey are also by FAR the most powerful tool to understand yourself, reality, empathy and ones own worth - but only if you are a good candidate and know how to respect the drugs for what they are - extremely powerful, potentially harmful tools.\n\nI did my masters in psychoactive drug chemistry and have taken a boat load of them, and every single trip, whether good or bad, has made me a better person in my own eyes. No regrets, and so much more to explore. \n\nI think a year without a trip is a year when I lose contact with who I want to be, and who I know I can become, and how I want to treat others. \n\nDo NOT take these drugs recreationally without researching them thoroughly, your own mental health, being sure of exactly what drug you have (if you don’t have access to an mass spectrometer or an NMR….be careful). \n\nThey can save you or they can destroy you. \n\n\nThey are also unknowable, so it is no use trying to understand WHAT they do to you until you’ve experienced it. What you should think about are the dangers, not how fun it is. Ultimately psychedelics are not fun, to me. They are useful.\n\nBe careful but be curious :)",
            "title_similarity": "0.7229445",
            "sentiment_compound": 0.9811
        },
        {
            "id": "hev73od",
            "score": 47,
            "text": "Was at my all time low this summer and was having a lot of issues constantly reflecting on my childhood and associating those moments to the things that went wrong for me this pandemic. Just non stop intrusive thoughts that I could not control. Started taking 0.1 grams of psilocybin every 3 days and was able to finally get out of my own head and start making productive choices with my day. I did that for a month and don't feel I need them anymore as I now have a few hobbies to invest my emotions in to.",
            "title_similarity": "0.5651448",
            "sentiment_compound": -0.7506
        },
        {
            "id": "heurshb",
            "score": -8,
            "text": "I would think it could amplify inferiority complex by revealing heretofore unnoticed or imagined insufficiencies",
            "title_similarity": "0.44679484",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hev2lx1",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.115812175"
        },
        {
            "id": "hevd378",
            "score": 13,
            "text": "I'm not sure if this is the place to ask, but does anyone know how one would go about finding a therapist trained in the use of psychedelics?",
            "title_similarity": "0.4878632",
            "sentiment_compound": -0.1232
        },
        {
            "id": "hev2wtb",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "0.115812205"
        },
        {
            "id": "heukw6h",
            "score": 98,
            "text": "[removed]",
            "title_similarity": "0.115812205"
        },
        {
            "id": "hevbkot",
            "score": 73,
            "text": "Sadly An online survey is not good enough methodology to infer causation (I am a psychologist) so this study is an example of the reasons why psychology is having a replication crisis .",
            "title_similarity": "0.49739558",
            "sentiment_compound": -0.8521
        },
        {
            "id": "heushh7",
            "score": 32,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "heutaov",
            "score": 700,
            "text": "looking forward to seeing more studies about this and potential medicinal uses. I only took shrooms once and had a bad trip, but clearly it has benefit that needs to be looked at",
            "title_similarity": "0.5816387",
            "sentiment_compound": 0.743
        },
        {
            "id": "heux5qb",
            "score": 57,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "hev83f4",
            "score": 600,
            "text": "They need to fast-track some of these treatments. I'm afraid I don't have another 5 to 10 years of mental stamina in the tank.\n\nAnd unfortunately it seems like Ketamine treatments have become money grabs for those administering them.\n\nEdit: Thank you everyone for the absolute wealth of information/advice. I appreciate you all.",
            "title_similarity": "0.6438673",
            "sentiment_compound": 0.8658
        },
        {
            "id": "heulkjc",
            "score": 534,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "heuphnh",
            "score": 332,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "heuqx63",
            "score": 105,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "heuympc",
            "score": 2268,
            "text": "Psychedelics *can helpfully reshuffle one’s deck\n\nedit - *not necessarily will",
            "title_similarity": "0.55608577",
            "sentiment_compound": 0.5106
        },
        {
            "id": "heut0nh",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "heux9km",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "heuxse5",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "heuyl6o",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "heuyz8c",
            "score": 2,
            "text": "Ohhhh yeah that makes a lot of sense.",
            "title_similarity": "-0.003491085",
            "sentiment_compound": 0.296
        },
        {
            "id": "hev1dwx",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "hev2be6",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "hev3ebu",
            "score": 2,
            "text": "This is really interesting",
            "title_similarity": "0.027491366",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hev43la",
            "score": 1,
            "text": "What is process of reducing trauma by mushrooms? I mean, scientifically speaking. Does it mean that mushrooms chemically alter some stuff in brain (?) that people are starting to react differently on trauma?",
            "title_similarity": "0.5829789",
            "sentiment_compound": -0.7303
        },
        {
            "id": "hev5erp",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.115812205"
        },
        {
            "id": "hev7oo6",
            "score": 189,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "hev8apu",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "hev8f1r",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "hevcefk",
            "score": 9,
            "text": "I took a neuropsychopharmacology module in uni and a lot of current researchers are backing up the potential benefit of controlled therapeutic psychedelic use.\n\nSeveral clinical trials have shown a reduction in anxiety and depression months on from a therapeutic experience with psychedelics.\n(Https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5509636/)\n\nI had a lecturer who suggested a link between distrupting the Default mode network (DMN) and observed benefits of psychedelic use. The DMN is basically what happens in your mind when you're not actively focusing on the world outside of you.\nIt can be linked to anxious or depressive \"spiraling\" thoughts, or as mentioned here, the shame and negative self perception linked to CPTSD. Totally worth looking into!\n\nIt's all very interesting, but should definitely not be taken as a green flag to go experiment wildly!",
            "title_similarity": "0.7273354",
            "sentiment_compound": 0.1769
        },
        {
            "id": "heve6se",
            "score": 1,
            "text": "I agree, psychedelics have enough power to do bad just as good.\n\nThey can bring up deep suppressed issues/memories within your psyche that can manifest negative emotions/experienced.\n\nI believe one should develop mental evenness  and emotional stability with meditation before embarking on any psychedelic trip\n\nPeace and love my Friends",
            "title_similarity": "0.6862273",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hevfb0x",
            "score": 1,
            "text": "Me and wife have been trying microdosing mushrooms, nothing to noticeable yet, its been about a month and half, might have to amp up the dosage.",
            "title_similarity": "0.5520069",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevfcl4",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.1158122"
        },
        {
            "id": "hevfju3",
            "score": 1,
            "text": "cool where can i get one?",
            "title_similarity": "0.07611388",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hevg6qi",
            "score": 1,
            "text": "I’d love to see an IAMA from a scientist/doctor or patient about these studies.",
            "title_similarity": "0.37981808",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hevgvy9",
            "score": 1,
            "text": "I've lived my whole life traumatized, I cannot trust anyone and I indirectly push away everyone that comes close to me. I really want to think this is due to the fact that I dislike people and that's what I tell everyone, but the reality is actually that I'm too scared to deal with other people and experience the good and bad emotions that accompany relationships. Also, I really struggle to have conversations and I only feel relatively calm and confident when I have them on recreational drugs.\nI've thought several times about taking psychodelics, as I have been told they can help me immensely. My problem is that they really scare me, I've hear stories of people that went insane after taking mushrooms or LSD and they now believe that someone wants to kill them or that aliens are everywhere. I've spent really bad moments getting uncontrolable thoughts after smoking cannabis and cannabis is nothing compared to those psychodelics, so I don't know how they would affect me.\nDo you guys have some recommendations or opinions?  Thank you if you did read the whole post, that means a lot for me.",
            "title_similarity": "0.554639",
            "sentiment_compound": -0.9747
        },
        {
            "id": "hevhebk",
            "score": 1,
            "text": "Programming the human Biocomputer - John c. Lily. \nThis guy did some great research back in the day. If you're interested how it works you should check out the book. \nAfter having experiences tripping I personally loved the book as it shed a lot of light on the subject.",
            "title_similarity": "0.43252736",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hevipvs",
            "score": 3,
            "text": "Yeah until I have a bad trip and get trapped in an infinite thought loop and becoming even more traumatized from the experience",
            "title_similarity": "0.51256526",
            "sentiment_compound": -0.8268
        },
        {
            "id": "hevj0cn",
            "score": 1,
            "text": "Is it true that your experience with shrooms has a lot to do with the current state you are in and the overall  outlook before the trip? \n\nLike if you into it with a positive attitude and optimistic, you’re most likely to have a good trip but you are scared shitless & reluctant that it won’t work the odds of a bad trip are greater ? \n\nI read that so where and I was curious as I’ve never taken psychedelics before.",
            "title_similarity": "0.58886784",
            "sentiment_compound": -0.2523
        },
        {
            "id": "hevk08k",
            "score": 1,
            "text": "I honestly need this but want to go through a psych evaluation I fear I may be predisposed for boarderline personality judging from my parents.",
            "title_similarity": "0.5387162",
            "sentiment_compound": -0.431
        },
        {
            "id": "hevksrg",
            "score": 1,
            "text": "i knew it i had to take lsd",
            "title_similarity": "0.18431139",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevl33y",
            "score": 1,
            "text": "Through personal experience, I can attest to this",
            "title_similarity": "0.16757527",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevlegz",
            "score": 1,
            "text": "Great lets make them all strictly illegal and let billion dollar drug companies push useless antidepressants",
            "title_similarity": "0.39651912",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hevlhkg",
            "score": 1,
            "text": "I tripped on Friday and I feel like I untied a mountain of weight that was shame from mistakes I’ve made. It’s been a much better week as I am much kinder in the way I talk to myself.",
            "title_similarity": "0.49873704",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hevly8v",
            "score": 1,
            "text": "Any idea where one could participate in such a medical trial?",
            "title_similarity": "0.32393602",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevm8p6",
            "score": 1,
            "text": "Micro dosing definitely helps.",
            "title_similarity": "0.25805658",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hevmgm7",
            "score": 4,
            "text": "Ritalin does this for me. If this stuff were to reduce my lifespan by 20 years id still take it",
            "title_similarity": "0.5597409",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevmpeo",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.115812205"
        },
        {
            "id": "hevmqr7",
            "score": 1,
            "text": "I micro dosed mushrooms after I had my baby, I had PPD pretty bad and didn’t want to take Zoloft or something like that. Seemed to work really well.",
            "title_similarity": "0.5990818",
            "sentiment_compound": 0.5984
        },
        {
            "id": "hevn3n0",
            "score": 1,
            "text": "I like the idea of this and I believe that psychedelics have the potential to be useful therapeutically, however I am pretty skeptical of this study. It claims to be a clinical study, yet  it's entirely self reported which will introduce a lot of biases.",
            "title_similarity": "0.5916365",
            "sentiment_compound": 0.743
        },
        {
            "id": "hevn581",
            "score": 1,
            "text": "Oh so that’s what these people need cause I took a lot of these things and ever since that day years ago I’ve just always been happy. I mean sure the car breaks down it sucks, but when there’s no Major problems which is most of the time, life is good",
            "title_similarity": "0.42867064",
            "sentiment_compound": 0.7668
        },
        {
            "id": "hevnkm3",
            "score": 1,
            "text": "Ok this is in a controlled setting anything can be good under a controlled setting i can see many ways this can go wrong outside the controlled settings",
            "title_similarity": "0.28440377",
            "sentiment_compound": 0.25
        },
        {
            "id": "hevo4cy",
            "score": 1,
            "text": "So all I ever hear is that psychedelics should probably be tested/researched more frequently and that they're probably really damn good for most humans.",
            "title_similarity": "0.4308206",
            "sentiment_compound": 0.0478
        },
        {
            "id": "hevoloq",
            "score": 1,
            "text": "This seems to be hitting a little close to home, but I'm the last person on Earth that needs drugs",
            "title_similarity": "0.39166984",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevooqv",
            "score": 1,
            "text": "These articles are so irresponsible. People see this and think its okay to experiment with them on their own and end up suffering as a result. Psychedelics drugs are not something to be taken lightly and can trigger mental illness and depression.",
            "title_similarity": "0.6180763",
            "sentiment_compound": -0.907
        },
        {
            "id": "hevq3q3",
            "score": 1,
            "text": "But where do I start? Do I join a tourist-trap tour to South America and drink some Ayahuasca? Do I do some random shrooms from the bloke down the pub? Do I go to the rave and drop some acid? Pretty sure those wouldn't have the same effect on my childhood trauma...",
            "title_similarity": "0.48146152",
            "sentiment_compound": 0.6868
        },
        {
            "id": "hevqnpz",
            "score": 1,
            "text": "Ok but can someone who has done this and succeeded explain to me what they did exactly??\n\nI took a decent amount of shrooms. Played clash royale for a bit and thought the wizard fireball looked cool. And looked at some walls",
            "title_similarity": "0.53079665",
            "sentiment_compound": 0.8936
        },
        {
            "id": "hevtar7",
            "score": 1,
            "text": "Would it help me separate myself from the emotional damage of a public school life full of bullying and isolation? ill do it in a heartbeat",
            "title_similarity": "0.54950017",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hevu1z4",
            "score": 1,
            "text": "I thought they knew that micro dosing helped with PTSD quite awhile ago? we talked about it in my psychology class 5 years ago",
            "title_similarity": "0.70824236",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevu4pb",
            "score": 1,
            "text": "Never done any psychedelics but I am looking forward for my first experience when I'm ready and educated about the potential good/bad trips...to da moon!",
            "title_similarity": "0.31845203",
            "sentiment_compound": 0.5487
        },
        {
            "id": "hevunlx",
            "score": 1,
            "text": "too bad they’re not very available",
            "title_similarity": "0.20773056",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hevuojd",
            "score": 1,
            "text": "I wish the east coast was more experimental with psychedelics.  I go in soon for ketamine infusions to deal with my fucked up brain. In my research,  preferred the psychedelics as they seem to work better (never got to try them). Hoping the east coast catch up on this research and treatment.",
            "title_similarity": "0.64776653",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hevv4wg",
            "score": 1,
            "text": "Psychedelics should be thought of as a way to shave back all of the barriers and defenses people subconsciously put up to avoid trauma, and through that vulnerability is the chance to rebuild yourself from the ground up.\n\nIt essentially allows therapy to really work and influence you.",
            "title_similarity": "0.5625098",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hevvgq1",
            "score": 1,
            "text": "I need to get in on some of these trials",
            "title_similarity": "0.2367631",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevvo0c",
            "score": 1,
            "text": "The psychedelic therapies that they offer in my city are so expensive there’s no way I could afford them even though I would benefit from them greatly as a childhood sex abuse survivor and three time severe concussion survivor $3000-$6000 who can afford that",
            "title_similarity": "0.5334353",
            "sentiment_compound": -0.3102
        },
        {
            "id": "hevvvnm",
            "score": 1,
            "text": "Ayahuasca is one (if not THE) most healing (emotionally!!) medicine I have ever tried. I wish instead of prescription drugs Ayahuasca ceremonies were as popular. - then REAL healing would take place in society.",
            "title_similarity": "0.56555384",
            "sentiment_compound": 0.7256
        },
        {
            "id": "hevw90j",
            "score": 1,
            "text": "I wish I could try mushrooms in a clinical setting with a therapist but it's illegal in my country. \n\nWe have a private Ketamine clinic but the expense it very high for a full, proper course. I have never taken anything like that so I have absolutely no sign as to how I would react. Somehow, (albeit probably erroneously) mushrooms seem more integrative, especially if microdosing.",
            "title_similarity": "0.47347128",
            "sentiment_compound": -0.8737
        },
        {
            "id": "hevx491",
            "score": 1,
            "text": "also a gateway for entity attachment iykyk",
            "title_similarity": "0.086654246",
            "sentiment_compound": 0.296
        },
        {
            "id": "hevx63x",
            "score": 1,
            "text": "Shrooms helped me get through a lot of self imposed limitations.",
            "title_similarity": "0.3966036",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hevx648",
            "score": 1,
            "text": "How does one even begin on this?  What's a good source to buy ?",
            "title_similarity": "0.18917331",
            "sentiment_compound": 0.504
        },
        {
            "id": "hevxdtd",
            "score": 1,
            "text": "Too bad these treatments are far too expensive for me, running to over $1000 a session",
            "title_similarity": "0.3324019",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hevxhqn",
            "score": 2,
            "text": "How does one get this magic?",
            "title_similarity": "0.17993027",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevxojb",
            "score": 2,
            "text": "Shrooms and mdma both helped me connect with parts if my brain I kept locked up",
            "title_similarity": "0.5332773",
            "sentiment_compound": 0.0
        },
        {
            "id": "hevxro3",
            "score": 2,
            "text": "I really, really want to do this.",
            "title_similarity": "-0.021628344",
            "sentiment_compound": 0.2195
        },
        {
            "id": "hevy2td",
            "score": 1,
            "text": "BUT it is possibly unsafe for people with a history of mental illness in their family, especially schizophrenia and bipolar disorder. Not trying to discourage anyone from exploring, but psychedelics should be treated with the same fear and respect as a gun.",
            "title_similarity": "0.65524554",
            "sentiment_compound": -0.8101
        },
        {
            "id": "hevydi3",
            "score": 1,
            "text": "Is this going to put mental health care workers out of work? Great for society, bad for my student loan repayments",
            "title_similarity": "0.54175436",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hevyffn",
            "score": 1,
            "text": "I really hope these become mainstream approved psychiatric treatment. I'm someone who suffered abuse growing up and suffers from anxiety. Anything to can help with improving quality of life would be amazing.",
            "title_similarity": "0.6920388",
            "sentiment_compound": 0.5849
        },
        {
            "id": "hevygmu",
            "score": 1,
            "text": "They definitely reinforce a sense of self confidence. The belief that ones internal vision or thoughts have power or value is an important lesson often skipped in the lives of the abused. It always starts with grooming that one’s internal dialogue is unimportant, so it can be ignored while the abuse occurs.",
            "title_similarity": "0.4815933",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hevys9z",
            "score": 1,
            "text": "Damn. That’s the first I’ve heard of a psych med that treats the underlying cause rather than just the symptoms. As a lifelong sufferer of depression, I need these to get FDA approved.",
            "title_similarity": "0.63901997",
            "sentiment_compound": -0.765
        },
        {
            "id": "hevz6hb",
            "score": 1,
            "text": "I would definitely try it if I had my doses closely monitored and controlled by a professional.\n\nI don't really trust myself to try it diy.",
            "title_similarity": "0.39334464",
            "sentiment_compound": -0.0564
        },
        {
            "id": "hew0mtb",
            "score": 1,
            "text": "I wonder if it’d be more effective when the person has had time to adjust to this trauma beforehand. I don’t imagine using this on someone who’s at their lowest lows and self destructive behaviors and expecting good results.",
            "title_similarity": "0.58609366",
            "sentiment_compound": -0.655
        },
        {
            "id": "hew13te",
            "score": 1,
            "text": "That’s great news! Now I just need to find some…",
            "title_similarity": "0.08811149",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hew156e",
            "score": 2,
            "text": "If you could see yourself from Google earth's point of view and let all sorrows move away while zooming out, psychedelics could be a way to find yourself whole again.",
            "title_similarity": "0.50589013",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hew170h",
            "score": 2,
            "text": "Neuroplasticity is the name of the game",
            "title_similarity": "0.2432222",
            "sentiment_compound": 0.0
        },
        {
            "id": "hew1tkh",
            "score": 2,
            "text": "Always a good idea to look at the original research, rather than commentary about such a finding, its\n\nHealy CJ, Lee KA, D’Andrea W. Using Psychedelics With Therapeutic Intent Is Associated With Lower Shame and Complex Trauma Symptoms in Adults With Histories of Child Maltreatment. Chronic Stress. January 2021. doi:10.1177/24705470211029881\n\nin which you find\n\n>\"An online survey was completed by 166 participants and included measures of maltreatment exposure and severity, history of intentional therapeutic psychedelic use, posttraumatic stress symptoms, internalized shame, and facial emotion recognition.\"  \n>  \n>{and}  \n>  \n>Volunteer participants were recruited online via the social networking websites Reddit and Facebook as well as by word of mouth. Inclusion criteria were that participants be 18 years or older, fluent in English, and endorse a history of CM. No compensation was provided to participants.\n\n\"an online survey\" is cause for some concern . . . and \"volunteer participants\" is a cause for a lot of concern about any such finding.\n\nHumans are remarkably tricky experimental subjects -- what you think you are measuring, may not be what you're measuring at all.\n\nTry this again with some other recruitment and evaluation mechanism, see if you get consistent results. There's a huge problem with repeatability in the behavioral sciences (\"the replication crisis\"), and this is one of those results where I'd be inclined to say \"until I've seen a different team do it again in a different way, I really can't say anything much more than 'that's interesting\".",
            "title_similarity": "0.7472267",
            "sentiment_compound": -0.9158
        },
        {
            "id": "hew25fu",
            "score": 2,
            "text": "42 years old PTSD anxiety and schizoaffective. All stemming from continuous childhood and early adulthood abuse. Just started psilocybin use last year. Literally the only thing that has helped the PTSD and anxiety. Life saver. Legalize it everywhere.",
            "title_similarity": "0.6640874",
            "sentiment_compound": -0.765
        },
        {
            "id": "hew2fva",
            "score": 1,
            "text": "The pharmaceutical industry, FDA, and lawmakers will try to convince you it's dangerous for you.",
            "title_similarity": "0.45416567",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hew2ofo",
            "score": 1,
            "text": "This is why I want so bad to take a small dose of shrooms. But have no idea where to acquire any. On the east coast, I know nobody who has them",
            "title_similarity": "0.38094297",
            "sentiment_compound": -0.6592
        },
        {
            "id": "hew42pc",
            "score": 1,
            "text": "Shrooms are the ONLY thing that made me feel like a normal person. They helped me reevaluate a lot of things.",
            "title_similarity": "0.34684247",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hew4bmq",
            "score": 1,
            "text": "Whenever I see stuff like this I always worry about what else psychedelics help disconnect.",
            "title_similarity": "0.49714646",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hew57gm",
            "score": 1,
            "text": "Psychedelics have done a lot for me. It was always helpful, but it wasn’t always pleasant",
            "title_similarity": "0.4525274",
            "sentiment_compound": 0.7469
        },
        {
            "id": "hew58z5",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.115812205"
        },
        {
            "id": "hew5cac",
            "score": 1,
            "text": "Its good to know this, but what about people who experience shame for an actual reason. I mean I know most would deserve it, its just that they are still humans ya know. Ah who cares nevermind. Still posting this because I feel like it has to be put out there.",
            "title_similarity": "0.42275733",
            "sentiment_compound": 0.6187
        },
        {
            "id": "hew5oqg",
            "score": 1,
            "text": "Idk man. The single most harrowing experience of my life was psychadelics. Looking back. I believe it fucked me up more than anything else I went through before the age of 20. Both parents simultaneously having cancer, me needing surgery, the fights, the loneliness. Before the trip I just dealt with all that. But after... my emotions have never quite been the same.",
            "title_similarity": "0.5998688",
            "sentiment_compound": -0.81
        },
        {
            "id": "hew608l",
            "score": 2,
            "text": "This would help so many of my friends if they didn’t self medicate to a harmful degree.",
            "title_similarity": "0.5635746",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hew60ej",
            "score": 2,
            "text": "That deep brain plasticity is magic",
            "title_similarity": "0.29084954",
            "sentiment_compound": 0.0
        },
        {
            "id": "hew6eal",
            "score": 2,
            "text": "Yeah, but how do I get my doctor to tell me how much to take?",
            "title_similarity": "0.40854818",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hew7mjd",
            "score": 2,
            "text": "Legalize this stuff for Christ sakes. The outcomes of this treatment with side affects less than pharmacy drugs is to good to not use as a treatment for depression.",
            "title_similarity": "0.58926976",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hew7v3t",
            "score": 2,
            "text": "I can personally attest to this. Literally life saving.",
            "title_similarity": "0.15112858",
            "sentiment_compound": 0.0
        },
        {
            "id": "hew8fev",
            "score": 3,
            "text": "I was thinking about this today, I am 31 and spent 26-29 doing a fair amount of psychedelics and wish I  had done more sooner.  \nI am for the first time in a good place, fairly happy and let so much trauma go. I am happy to say doing drugs massively improved my life.   \nI would keep doing them if I knew safe places to find it and the only thing stopping me now, but the effects have lasted me years now.  \n  \nYou can tell yourself so many times things were not your fault but till you believe it, let it go and move past it they are only words you are telling yourself.",
            "title_similarity": "0.58901465",
            "sentiment_compound": 0.8933
        },
        {
            "id": "hew9jnt",
            "score": 2,
            "text": "Damn, this sounds exactly like what I need",
            "title_similarity": "-0.011711923",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hew9jy7",
            "score": 2,
            "text": "Lsd is part of my therapy regimen. I have taken it every weekend for over a decade to help with my mental health. It literally is a lifesaver.",
            "title_similarity": "0.47058347",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hew9u9k",
            "score": 2,
            "text": "I wish I could do this so much...",
            "title_similarity": "0.23882496",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hewafb3",
            "score": 2,
            "text": "Always good to clear out the cobwebs every once in a while",
            "title_similarity": "0.3031116",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hewak3e",
            "score": 2,
            "text": "People these days have no shame in the first place…",
            "title_similarity": "0.100243",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hewarg2",
            "score": 2,
            "text": "As a bonus, they are fun as hell.",
            "title_similarity": "0.21414934",
            "sentiment_compound": 0.296
        },
        {
            "id": "hewarw2",
            "score": 2,
            "text": "True. But it’s kind of like leaving behind hell to travel through a desert. It’s sometimes easier to just go back. And if you can trip again, then why not go back and use it as a catalyst for change later? So it becomes a cycle unto itself. My ticket out of hell is to take a trip and then I end up back in hell over time.",
            "title_similarity": "0.4266527",
            "sentiment_compound": -0.9412
        },
        {
            "id": "hewcaft",
            "score": 1,
            "text": "Psys helped me understand that my childhood abuse had given me a guilt complex for being alive at all, that all my self loathing stemmed from this feeling, and that it was given to me by my abusers, not born as a result of my own failure as a human being, and that it's okay for me to be okay and do what is necessary to heal. It was because of this realization that I began the process of freeing myself from the horrors of my past and continuing abuse.\n\nThey 100% have the ability to work in this way if used correctly, and I believe the fact they were ever illegal is a crime against humanity that will one day be looked at in disbelief and ridicule.",
            "title_similarity": "0.57512367",
            "sentiment_compound": -0.9763
        },
        {
            "id": "hewd2x3",
            "score": 2,
            "text": "Well GD. Where do I go to receive such wondrous therapy? Take my money, gimme the pills and cure me!",
            "title_similarity": "0.49039376",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hewe6hh",
            "score": 2,
            "text": "I take psychedelics and this is absolutely true. I went into it purely for the medical benefits. I don't have the normal stressors that to used to have for years like social anxiety and I can actually keep eye contact with people now without feeling guilty",
            "title_similarity": "0.56551695",
            "sentiment_compound": 0.6548
        },
        {
            "id": "hewejnf",
            "score": 1,
            "text": "Just don't use it if your a schizophrenic.",
            "title_similarity": "0.35140938",
            "sentiment_compound": 0.0
        },
        {
            "id": "heweupb",
            "score": 1,
            "text": "How do I do these without getting a panic attack",
            "title_similarity": "0.34717909",
            "sentiment_compound": -0.1022
        },
        {
            "id": "hewfrov",
            "score": 1,
            "text": "I always wondered if this would be helpful for me, I have seen so many studies on this. But I have disagnosed mental issues and worry something like that would screw me up personally. Also I’m 32 and drugs like that are not readily accessible and I have a job so I can’t just be flying around doing drugs",
            "title_similarity": "0.55809534",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hewg17p",
            "score": 1,
            "text": "Does the psychedelic do this alone, or is some type of directed psychotherapy needed while under the influence?  Also, couldn’t this be useful for other types of emotional trauma?",
            "title_similarity": "0.67176425",
            "sentiment_compound": -0.2287
        },
        {
            "id": "hewgehs",
            "score": 1,
            "text": "god, i want to try this.",
            "title_similarity": "0.05967143",
            "sentiment_compound": 0.34
        },
        {
            "id": "hewhvgg",
            "score": 1,
            "text": "I cant ever get over feeling uncomfortable n nauseous when I come up.",
            "title_similarity": "0.41022837",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hewjfzb",
            "score": 1,
            "text": "How how how does one access these therapeutics?!",
            "title_similarity": "0.33558887",
            "sentiment_compound": 0.0
        },
        {
            "id": "hewjxg5",
            "score": 1,
            "text": "They scare me. But i have major depression. I wonder if having depression so severe (and medicated) would be a good trip or bad.",
            "title_similarity": "0.6558536",
            "sentiment_compound": -0.9642
        },
        {
            "id": "hewkmh9",
            "score": 1,
            "text": "I got hppd from acid so there not all good",
            "title_similarity": "0.44653308",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hewlcxz",
            "score": 1,
            "text": "A huge turning point in my life was doing acid. I cried the entire time because I was able to see just how DEEPLY I hated myself and how sad that was. I finally felt like I didn't deserve all the abuse I went through and was just very unlucky to be born into the situation I was. \"I deserve to take up space\" isn't an original idea but it's what came to me during that trip and I use it to remind myself that I'm here living in this body and I deserve to take care of my body and my emotions.",
            "title_similarity": "0.47590625",
            "sentiment_compound": -0.3222
        },
        {
            "id": "hewlneo",
            "score": 1,
            "text": "This explains heaps for me and my circumstances. After going through a shooting at uni and having an ‘interesting’ childhood, my wife and I still muse as to how normal I am. Normal being a relative concept. Thanks mushrooms",
            "title_similarity": "0.5284869",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hewm085",
            "score": 1,
            "text": "It's wild how a mushroom trip can make you reevaluate your life and become a better and more loving person because it allows you to see new perspectives, but if you get caught with the smallest amount you get put in a cage longer than if you raped or killed someone.",
            "title_similarity": "0.5476676",
            "sentiment_compound": -0.9022
        },
        {
            "id": "hewnoqi",
            "score": 1,
            "text": "Without going into too much details, psychedelics definitely weakened that association for me. The experience itself was an cathartic roller-coaster. \n\nSo to whomever gathers data and compiles medical research: +1 on count of subjects helped.",
            "title_similarity": "0.60779536",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hewnp9r",
            "score": 1,
            "text": "The war on drugs is a man made cancer, not a policy, certainly not a real \"law\".  That crap has destroyed so much of this country.",
            "title_similarity": "0.49565136",
            "sentiment_compound": -0.9445
        },
        {
            "id": "hewnxw5",
            "score": 1,
            "text": "Where can I get some? I have no connections (50+ yo)",
            "title_similarity": "0.28709006",
            "sentiment_compound": -0.296
        },
        {
            "id": "hewo61h",
            "score": 1,
            "text": "I remember in college I tried LSD with some friends. \n\nI had a good time and did some trippy finger painting and one of my friends realized that he had been repressing his homosexuality because of his abusive father.",
            "title_similarity": "0.6100496",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hewogdi",
            "score": 1,
            "text": "We made a short (5min) [Psychedelica](https://vimeo.com/thinknice/psychedelica) documentary with the leading researchers in the UK on this topic. Fingers crossed that continued research will pave the way for this natural medicine.",
            "title_similarity": "0.5867253",
            "sentiment_compound": 0.4357
        },
        {
            "id": "hewovqr",
            "score": 1,
            "text": "I’d like to know where and when these studies are conducted. And like, where do I sign up?",
            "title_similarity": "0.18573856",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hewoynn",
            "score": 1,
            "text": "Okay sure, where do I get some",
            "title_similarity": "0.046210624",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hewphm6",
            "score": 1,
            "text": "I’ve done mushrooms a handful of times in recent years, all the memories are still there but the affect they have on me is much different than before shrooms. I look forward to another dose in a year or two.",
            "title_similarity": "0.48924717",
            "sentiment_compound": 0.0
        },
        {
            "id": "hewpw2x",
            "score": 1,
            "text": "I want this so bad however past experiences with psychedelics has made me scared of it. :/",
            "title_similarity": "0.5543135",
            "sentiment_compound": -0.8313
        },
        {
            "id": "hewr3qa",
            "score": 1,
            "text": "they also make you look at a white wall for 6 hours straight",
            "title_similarity": "0.34250963",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hewsrz9",
            "score": 1,
            "text": "Really good article with an interesting outcome. I look forward to the longitudinal study results and I especially look forward to whether the results can be reproduced within a predominantly African American sample.",
            "title_similarity": "0.3790207",
            "sentiment_compound": 0.7089
        },
        {
            "id": "hewu5qe",
            "score": 1,
            "text": "Yeah im gonna stick to r/microdosing, a macrodose of a psychedelic needs to be every 3-4 months to continue the effects and MD is just much safer.",
            "title_similarity": "0.59032947",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hewukg4",
            "score": 1,
            "text": "Makes sense why I always felt happy when I was high. Like everything was sparkling",
            "title_similarity": "0.1771394",
            "sentiment_compound": 0.8126
        },
        {
            "id": "heww5i6",
            "score": 1,
            "text": "I have PTSD and am wanting to eventually use mushrooms to help with it but I have a hard time finding anything like this locally because I don't trust many people. I know where to get them in another state I think but not where I live.",
            "title_similarity": "0.45956856",
            "sentiment_compound": -0.0137
        },
        {
            "id": "hewwi1t",
            "score": 1,
            "text": "ketamine therapy saved my life",
            "title_similarity": "0.49156177",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hewxxkk",
            "score": 1,
            "text": "From a real world perspective and having trauma from childhood abuse, those who relied on drugs whether it be psychedelics or otherwise did not fair as well as those who, like myself, stayed away from self medicating and instead took years and years and years to come to grips with it and then move beyond it. While most who used drugs or currently use drugs to cope end up never dealing with it because the drugs offer a temporary escape meaning the desire for more drugs",
            "title_similarity": "0.6793338",
            "sentiment_compound": -0.5962
        },
        {
            "id": "hewyka7",
            "score": 1,
            "text": "Someone get me one of these mushrooms things. Where do I go? A cow farm?",
            "title_similarity": "0.21583302",
            "sentiment_compound": 0.0
        },
        {
            "id": "hex1mf6",
            "score": 1,
            "text": "Is it like you take it once and your good or do you have to actively work on it while your on psys?",
            "title_similarity": "0.36171585",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hex1xne",
            "score": 1,
            "text": "How does one acquire 'phychadelics' I wanna die and I'm sick of thinking about it.",
            "title_similarity": "0.3733214",
            "sentiment_compound": -0.802
        },
        {
            "id": "hex4801",
            "score": 1,
            "text": "As someone with panic disorder, I really want to try a controlled  micro dose.",
            "title_similarity": "0.53971064",
            "sentiment_compound": -0.6605
        },
        {
            "id": "hex4oks",
            "score": 1,
            "text": "How does one go about getting this kind of treatment? Or is this just for science?",
            "title_similarity": "0.3070293",
            "sentiment_compound": 0.0
        },
        {
            "id": "hex54cf",
            "score": 1,
            "text": "Kids these days call it \"Ego Death\"",
            "title_similarity": "0.4062444",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hex6ui0",
            "score": 1,
            "text": "They do! Speaking from my own experience.",
            "title_similarity": "0.08188506",
            "sentiment_compound": 0.0
        },
        {
            "id": "hex73rx",
            "score": 1,
            "text": "I wonder what they mean by intentional therapeutic use? It doesn't look like this followed any sort of protocol...",
            "title_similarity": "0.37933934",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hex8ej0",
            "score": 1,
            "text": "It doesn’t work for everyone but I know SO many people who swear that psychedelics, mostly ayahuasca,  has changed their lives forever or allowed them to see what they need to do to change their lives. For others, it might not do anything. Myself, I had a traumatic past that had messed me up for life but lsd/shrooms have really been helpful to my quality of life",
            "title_similarity": "0.65668505",
            "sentiment_compound": -0.6522
        },
        {
            "id": "hex8gac",
            "score": 1,
            "text": "It's not like a deck of cards at all, that's a bad analogy. It's more like a web that gets stronger, where the bands in the web get strung like a guitar and it comes out better and more secure when done correctly. And perhaps the 'neuro-knots' that form from early trauma fall to the wayside as usually the fear and angst are nothing more than false apparitions in your head. Clinical psilocybin treatments will be the cornerstone of ptsd/trauma patients in the future. Mark my words",
            "title_similarity": "0.6103067",
            "sentiment_compound": 0.2206
        },
        {
            "id": "hex8nw9",
            "score": 1,
            "text": "Psychedelics should be legalized!",
            "title_similarity": "0.32891005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hex96be",
            "score": 1,
            "text": "I'm desperate to try microdosing mushrooms for tinnitus",
            "title_similarity": "0.38217062",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hex9930",
            "score": 1,
            "text": "It’s annoying how hard it is to find psychedelics. It’s the only thing that truly pulls me out of an extreme depressive episode",
            "title_similarity": "0.56567144",
            "sentiment_compound": -0.4754
        },
        {
            "id": "hex99za",
            "score": 1,
            "text": "I've been curious about trying legal mushrooms. Where can I legally obtain them? (legally, that is)",
            "title_similarity": "0.3919561",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hex9ico",
            "score": 2,
            "text": "I quieted my mind for the first time in my life on shrooms. It was silent and I was happy. I’ve never been that happy before. It was wild. I can still almost feel it.",
            "title_similarity": "0.36347505",
            "sentiment_compound": 0.1783
        },
        {
            "id": "hex9mfi",
            "score": 1,
            "text": "Psilocybin saved my life: https://www.reddit.com/r/shroomstocks/comments/lc3c5j/a\\_different\\_kind\\_of\\_dd/",
            "title_similarity": "0.52147686",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hex9my0",
            "score": 1,
            "text": "My take: \n\nThe real trick is reactivate (aka reexperience) the stored memory (or its elements or activation pattern) - without the activation and negative affect.  You need to do this accurately and/or repeatedly enough to reduce or neutralise the memory trace.   The real risk is retraumatisation: activating the memory will connect to a network of negative affect and other memories and may strengthen it.\n\nIt's tough.  Psychedelics aren't a magic solution because lack of psychedelics is not the problem.  But, they may be a way of reexperiencing in alternate context that is felt as safe or is even just distracting from the usual trauma response.  They may even give you a protective enduring belief is some thing.  \n\nThere are options other than psychedelics, like other drugs, CBT sessions, EMDR, mediation, going for a run, a glass of wine and a chat, plus 2000 other things, whatever works.  Memories aren't single objects, they are potential activation patterns, encoded in multiple locations and what works with one part of the encoding may not work with another part of the pattern.  There's no generic solution, it's a matter of finding what works with something, improving that, and moving along to battle with what's next.  Expecting a single mode or event to produce a solution is likely to be discouraging and counter-productive when if it doesn't magically work.  Personally, I like to think of an ongoing process with different elements and ups and downs, a scattered but purposeful, staying on task.",
            "title_similarity": "0.5588367",
            "sentiment_compound": -0.7427
        },
        {
            "id": "hex9noj",
            "score": 1,
            "text": "I had a mild psychosis that lasted almost a year from to frequent and too high of mushroom doses.",
            "title_similarity": "0.5863402",
            "sentiment_compound": 0.0
        },
        {
            "id": "hex9t8u",
            "score": 1,
            "text": "They might also cause a complete mental breakdown and insanity.",
            "title_similarity": "0.48924452",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hex9tln",
            "score": 1,
            "text": "Ayahuasca, guided can do wonders for trauma",
            "title_similarity": "0.4555184",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hexa0qx",
            "score": 1,
            "text": "I wanna take a small dose right now.",
            "title_similarity": "0.3247156",
            "sentiment_compound": 0.0
        },
        {
            "id": "hexacg6",
            "score": 1,
            "text": "My son works for a tech company that delivers psychedelic experience via VR",
            "title_similarity": "0.38977024",
            "sentiment_compound": 0.0
        },
        {
            "id": "hexcqnf",
            "score": 1,
            "text": "Serious question: how does one get in on these studies?",
            "title_similarity": "0.2090171",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hexdyud",
            "score": 2,
            "text": "I think that there's a lot more potential in these drugs than a lot of people are overlooking because of the whole war on drugs rhetoric. I'd love for psychedelics to become decriminalized and legal (for now) for researchers. It could really do some good for people.",
            "title_similarity": "0.55050325",
            "sentiment_compound": 0.6077
        },
        {
            "id": "hexeuv3",
            "score": 1,
            "text": "Petition to rename this the “ride or die psilocybin sub”",
            "title_similarity": "0.31940165",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hexev2w",
            "score": 1,
            "text": "This is why I invested in shroom stocks",
            "title_similarity": "0.28956848",
            "sentiment_compound": 0.0
        },
        {
            "id": "hexezzp",
            "score": 1,
            "text": "Welp, guess I’ll do some shrooms later",
            "title_similarity": "0.32862628",
            "sentiment_compound": 0.0
        },
        {
            "id": "hexfdlp",
            "score": 1,
            "text": "I’ve done more psychedelics than I care to admit, and a lot of it was throughout a pretty abusive and traumatic period in my young adult life (did a LOT of LSD starting at 14 and my stepdad put me in the hospital twice, once at 13 and once at 15). Went on to go to a LOT of raves, so the psychedelics were flowing. I’ve done everything on on that list in abundance, with the most recent being DMT…and weirdly enough, I’ve always been at peace with my upbringing. I’ve even forgiven my stepdad (although I haven’t seen him since the second time I was hospitalized). This study really hit home. I’d love to talk to the researcher, as some of the doses I’ve done are what the kids call “hero” doses, and I think they’d probably be interested.",
            "title_similarity": "0.6276288",
            "sentiment_compound": 0.8779
        },
        {
            "id": "hexfpln",
            "score": 1,
            "text": "Is there anyone legit doing this in Virginia. I think it could really help my brother.",
            "title_similarity": "0.35468256",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hexfsz8",
            "score": 1,
            "text": "And here I am over here, bipolar and taking SNRIs & TCAs . . . Meh",
            "title_similarity": "0.31163517",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hexgaix",
            "score": 1,
            "text": "Correlation does not indicate causation.\n\n“As is often the case with cross-sectional, survey-based studies such as these, causality can’t be determined: we can’t say whether the psychedelic use is causing the symptom reduction or, for instance, that people with lower symptoms are for some reason more likely to take psychedelics,” Healy explained. \n\nSo interesting results. But not that meaningful.",
            "title_similarity": "0.58510834",
            "sentiment_compound": -0.0251
        },
        {
            "id": "hexgl7q",
            "score": 1,
            "text": "I mind med is a good long term investment, lets get this on the market",
            "title_similarity": "0.23097882",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hexhhiu",
            "score": 1,
            "text": "So putting certain chemicals that mimic signals in your brain, can permanently alter your brain's chemistry. Who woulda thought?",
            "title_similarity": "0.4424932",
            "sentiment_compound": 0.3353
        },
        {
            "id": "hexj7tu",
            "score": 1,
            "text": "this is probably true, after a bit of lsd use when i was 25 a lot of the coping mechanisms id learned as a result of my trauma gradually disappeared.",
            "title_similarity": "0.754395",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hexl77c",
            "score": 1,
            "text": "Everyone will no doubt see this as good. But I'm still very skeptical of the miraculous cures of tripping your nuts off. \n\nSo this can weaken side effects of emotionally traumatic experiences? Fair enough. But what else can it weaken that we're not running studies to look into? \n\nAnd I'm not wholesale against it. I could maybe be described as net good agnostic. I've known people who have had powerful and lifelong ramifications from hallucinogenic drugs so that certainly plays into my leary outlook.\n\nI'm definitely excited that these things are being studied. As much as I'm unsure, I do believe that the potential to help with people suffering from psychological trauma makes it worth looking into.",
            "title_similarity": "0.5770861",
            "sentiment_compound": 0.2006
        },
        {
            "id": "hexou3x",
            "score": 1,
            "text": "I wonder if this would be effective for Generalized Anxiety Disorder,  not caused by abuse but other reasons that lead someone to anxiety and depression, hopefully.",
            "title_similarity": "0.6282655",
            "sentiment_compound": -0.3645
        },
        {
            "id": "hexplr8",
            "score": 1,
            "text": "You do need to do the research but just ask anyone who has had good trips and they will tell you everything the research will discover",
            "title_similarity": "0.33262265",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hexq4vl",
            "score": 1,
            "text": "I can absolutely agree that psychedelics helped restructure my trauma to a manageable amount. I started being abused around 6 by a male pedophile (I am CIS male). Within weeks of beginning psychedelics (age 26, without understanding what was happening) I began to see restructuring of my self-hatred/externalized hatred. By the time I was 30 I had been able to come to terms with the abuse and recover to the point where I feel FREE to discuss and address the issues I had with ANYONE. I would not necessarily recommend this to anyone/everyone. These chemicals are heavily impactful to the psyche (ego/id/superego), and often cause much confusion or despair, as awareness of these portions of your personal psyche become more apparent to you, even without experience of abuse. Not all people use them under guidance and they can result in extreme harm (without that guidance). However, I would proffer the idea that psilocybin is fairly innocuous and far more helpful than harmful. LSD is far more difficult to deal with as a whole.",
            "title_similarity": "0.6846563",
            "sentiment_compound": -0.9247
        },
        {
            "id": "hexr0tu",
            "score": 1,
            "text": "How do i get the drugs bruh",
            "title_similarity": "0.39905858",
            "sentiment_compound": 0.0
        },
        {
            "id": "hexs8kz",
            "score": 1,
            "text": "Ah yes, more drugs for everybody.",
            "title_similarity": "0.24489886",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hexsabh",
            "score": 1,
            "text": "Where was this when Voldermort was growing up?",
            "title_similarity": "0.21392868",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hext968",
            "score": 1,
            "text": "I’m a medical Ketamine Patient, AMA 🤷🏻‍♂️",
            "title_similarity": "0.42802623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hexto9t",
            "score": 1,
            "text": "I know that marijuana made a huge impact on my own self understanding and acceptance. I never thought that I would ever come to know and make peace with so many parts of myself. I am so excited to microdose psychs.",
            "title_similarity": "0.38977772",
            "sentiment_compound": 0.8983
        },
        {
            "id": "hexuut2",
            "score": 1,
            "text": "From personal experience my first trip cured my childhood PTSD and the recurring trauma of maladaptive socialisation. I didn't hallucinate at all I just sat there and thought about my life.",
            "title_similarity": "0.5354071",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hexuwu3",
            "score": 1,
            "text": "Why is everyone acting like these aren't the best thing to do?  All I'm reading about is how it's not gonna work. Try them.  You'll question everything about your life and the world around you.   That's why they are illegal.  They don't want people thinking like that.",
            "title_similarity": "0.41563022",
            "sentiment_compound": -0.4922
        },
        {
            "id": "hexxvdx",
            "score": 1,
            "text": "I wouldn't be where I am today, as happy and free as I am, without the help of psychedelics and therapy. I remember the first time being overwhelming, but then as time went on I was able to navigate my experiences and really work through things. It was like having a pile of tangled wire and sitting there slowly unraveling and getting it back to being untangled. Like, every wire had a purpose, it represented something, and it begin somewhere; so, I would follow that wire from beginning to end and by the end of it I would feel like my chest was less tight, I wasn't as anxious, and I was genuinely happier feeling (which it has stuck and WILL stick as I recall my experiences anytime I feel like I am under pressure). I honestly felt like how it would feel to be a kid again if we could go back - I didn't have a care in the world, and I felt in control. It was a very intense process some sessions, but I have had my eyes opened. I see how beautiful the world really is, and I am glad I got help because to feel happy is all I think any of us ever really wish for at the end of the day. I basically had my wish come true thanks to psychedelics, the universe, and a dedicated effort to find resolve. Life really *is* beautiful, and sometimes we just need help when we've suffered from trauma or traumatic events and our brains have been rewired. Untangle those wires, folks. You and your happiness are worth it.",
            "title_similarity": "0.5256031",
            "sentiment_compound": 0.997
        },
        {
            "id": "hexy3q0",
            "score": 1,
            "text": "The best antidepressant",
            "title_similarity": "0.38776234",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hexyktv",
            "score": 1,
            "text": "> Lead scientist Dr. Dogg encourages continued human trials to further study these effects.",
            "title_similarity": "0.3271405",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hey0q7t",
            "score": 1,
            "text": "For anyone interested, DMT the spirit molecule book covered this type of research a long time ago",
            "title_similarity": "0.32033673",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hey0suh",
            "score": 1,
            "text": "Except when you find out, after all the hype psychs get, and hope you feel to finally find out why you are so broken... You find out psychedelics don't actually work for everyone and no one talks about it. I don't mean life changing positive effects \" I mean for some people like me... They literally don't do anything, or if certain psychs do have effects theta te very very minimal \n\nVery upsetting I wish we knew why",
            "title_similarity": "0.58098423",
            "sentiment_compound": 0.4966
        },
        {
            "id": "hey1q7h",
            "score": 1,
            "text": "So until now you assumed that people with trauma take drugs just for fun?",
            "title_similarity": "0.5447539",
            "sentiment_compound": 0.128
        },
        {
            "id": "hey35ot",
            "score": 1,
            "text": "Now let doctors treat patients with them",
            "title_similarity": "0.35761356",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hey4bbi",
            "score": 1,
            "text": "Please note the term \"intentional therapeutic psychedelic use\"- it's important.\n\nGoing on a trip outside of a therapy setting with the intent to solve your trauma on your own may go seriously wrong.",
            "title_similarity": "0.5743525",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hey55qo",
            "score": 1,
            "text": "Other news in science:\n\nFears rooted in insecurities of social acceptance may be replaced by a love for purple gnomes. While researchers agree on the individual benefit in terms of psychological well-being, questions have been raised concerning the overall societal benefit. More research is needed.",
            "title_similarity": "0.55288196",
            "sentiment_compound": 0.8779
        },
        {
            "id": "hey65xu",
            "score": 1,
            "text": "You know, I'm a big fan of internalized shame. I'll keep mine. I think it's very useful.",
            "title_similarity": "0.2741379",
            "sentiment_compound": 0.3384
        },
        {
            "id": "hey6bfw",
            "score": 1,
            "text": "No trauma here, but I always feel ‘lighter’ after some mushrooms with me mates",
            "title_similarity": "0.31355473",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hey6leq",
            "score": 1,
            "text": "Problem: Child abuse.\nSolution: Tripping balls.",
            "title_similarity": "0.5400918",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hey6s44",
            "score": 1,
            "text": "they can be helpful for many things at the right doses and in the right situations, ive recently been experimenting with light dose LSD and gaming, many may think thats a combo that would never work but ive found around 30-50ug will very significantly improve my abilities. ive tried just about every nootropic or stimulant you could name but none come close to the leg up i get in accuracy and reaction speed from acid",
            "title_similarity": "0.59415233",
            "sentiment_compound": 0.8256
        },
        {
            "id": "hey7hms",
            "score": 1,
            "text": "Sorry to say but the study absolutely doesn't prove anything. It's based on a survey, with few samples. It transforms weak correlation into causality.",
            "title_similarity": "0.39080995",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hey7iw0",
            "score": 1,
            "text": "Psychodeics are the new psychotherapy. Can be dangerous tho",
            "title_similarity": "0.50887716",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hey7xwf",
            "score": 1,
            "text": "I know a thing or 2 about trama and drugs.\n\nKeeping people high and lucid will not help the problem.",
            "title_similarity": "0.53450245",
            "sentiment_compound": 0.0
        },
        {
            "id": "hey8lhu",
            "score": 1,
            "text": "I am open to the idea that these drugs may have genuine medicinal uses. But please don’t go out there and make it seem like they are cure-alls. They are dangerous if used wrong, and not everyone can handle them. Be careful.",
            "title_similarity": "0.510836",
            "sentiment_compound": -0.296
        },
        {
            "id": "heyb6ib",
            "score": 1,
            "text": "I'd really be open to trying this sort of therapy, I've been following the usage of psychedelics for mental health for a good while now and so far it's results are amazing.",
            "title_similarity": "0.5186569",
            "sentiment_compound": 0.7717
        },
        {
            "id": "heyd5rj",
            "score": 1,
            "text": "Trust me, I know haha.",
            "title_similarity": "-0.014459531",
            "sentiment_compound": 0.743
        },
        {
            "id": "heydyjw",
            "score": 1,
            "text": "Well this is promising. No wonder they’re my favorite, and always have their way of finding me. Even better-- virtually abuse-proof. Less is more forsure. I usually don’t feel inclined to overdo them. \n\nI consider ketamine to be a psychedelic, and it’s been the best so far at treating PTSD and major depression. I’ve heard of MDMA working for that too, but I can’t possibly roll as frequently as I can do K. I’m not a huge fan of rolling, although the right occasions it’s fun. I usually have more energy to dance all night without it though.",
            "title_similarity": "0.61942816",
            "sentiment_compound": 0.818
        },
        {
            "id": "heyeuwx",
            "score": 1,
            "text": "See this or similar here everyday. Yes, we get it, make it happen, get on with is. Show us how to easily easily make shrooms and legalize it.",
            "title_similarity": "0.17622994",
            "sentiment_compound": 0.7579
        },
        {
            "id": "heyf46g",
            "score": 1,
            "text": "I think this surprises no one if you've been following psychedelic research for a while. I can absolutely see and relate in my head to how that could help me and others.\n\nBut you never know. It would have to be done in a controlled environment and like any medication/therapy wouldn't be 100% effective, I'm no scientist but I have no doubt they'd be more successful than the current throw-SSRI's-at-everyone approach.\n\nI just hope the funding is there for more (bigger, credible) studies and governments don't pull the trigger on the research. It's already a no-go for most countries even if things have started to get better.",
            "title_similarity": "0.52738357",
            "sentiment_compound": 0.9426
        },
        {
            "id": "heyfm0q",
            "score": 1,
            "text": "And still.... because there are federal prohibitions these treatment options remain entirely out of reach for any vets... where PTSD is prevent. Frustrating!",
            "title_similarity": "0.3793243",
            "sentiment_compound": -0.4075
        },
        {
            "id": "heygeqv",
            "score": 1,
            "text": "Let's just keep shoving SSRIs and Xanax down people's throats instead, mkay?",
            "title_similarity": "0.38883504",
            "sentiment_compound": 0.0
        },
        {
            "id": "heyoc5h",
            "score": 1,
            "text": "I’d rather not take the risk and would just rather see a therapist.",
            "title_similarity": "0.3026698",
            "sentiment_compound": 0.2057
        },
        {
            "id": "heyp8zz",
            "score": 1,
            "text": "I have never had a drink or done any drugs in my 48 years, but psychedelics intrigue me.  I have spent a lot of time meditating and trying other ways to deal with my childhood trauma, but the reactions I have to situations are just automatic and nothing has worked on that piece.",
            "title_similarity": "0.45384938",
            "sentiment_compound": -0.5719
        },
        {
            "id": "heyrimx",
            "score": 1,
            "text": "Psychedelics cured me of my anxiety, insomnia and low self worth. They have also given me more compassion for myself, opened me up to loving myself with kinder thoughts and removed my negative thoughts about myself. \n\nWhen done with respect, specific intentions and safe environment, and you surrender to the feeling of dying (never fight psychedelics just surrender) they will improve your life",
            "title_similarity": "0.6035167",
            "sentiment_compound": 0.9467
        },
        {
            "id": "heyspes",
            "score": 1,
            "text": "I'm tired of hearing how psychedelics can help people with childhood trauma and not being a part of the study.\n\nDoes anyone know how I can get into one of these studies?",
            "title_similarity": "0.73173463",
            "sentiment_compound": -0.4588
        },
        {
            "id": "heyt6fr",
            "score": 1,
            "text": "To be clear.. I grow shrooms for microdosing.\n\nAnd there absolutely positive effects. No doubt... but the thing that bothers me is how this is usually touted as almost risk free. It isn't. \n\nThere's a subset of people around 6 to 9% who end up with A WORSE mental health outcome after doing this stuff even in a medical environment. Let Alone at home with people who have no real idea what they're doing. \n\nSo as great as this is and I'm glad it's talked about.. I wish they would give the caveat that it doesn't work for everyone. It just doesn't. Be aware of the risks.",
            "title_similarity": "0.7020734",
            "sentiment_compound": 0.77
        },
        {
            "id": "heyx716",
            "score": 1,
            "text": "would love to give this a go and see what it does for me, like many of you, my childhood was less then ok",
            "title_similarity": "0.5312425",
            "sentiment_compound": 0.8235
        },
        {
            "id": "hezc73k",
            "score": 1,
            "text": "Yep! You have reset yourself! Ever feel like the day following your trip is an exceptionally clear and bright one? That’s why;)",
            "title_similarity": "0.23095971",
            "sentiment_compound": 0.8844
        },
        {
            "id": "hf1ru1n",
            "score": 1,
            "text": "This was helpful for me to wrestle with a past emotionally-abusive relationship and recognize how healthy my current relationship is. I didn’t realize how much my ex was hurting me back then, and how that was feeding into massive insecurities I had about myself. It made me want to change literally everything about my physical appearance and be someone I wasn’t.  he even used to login on my social media account and post what he wanted me to look like. I used to lean into it too, wanting to make him happy and thinking I was ‘worthy of love’ if I was these things. I haven’t thought about this in a long time, but recent events have brought me back to thinking about it and I remember how sad and full of self-loathing I used to feel (I don’t want to stay in the mental space of thinking about it anymore though, since I successfully moved on). \n\nIt was a long long time ago, but when I started my current relationship, I didn’t realize how much baggage I was carrying around from it. I felt so lucky to find my husband, because instead of judging me or shaming me for it, he loved me enough to help me unwind all of that. He showed me how to really love myself and that he finds me pretty great just the way I am. \n\nI’m happy now, and happy to not think about this anymore.",
            "title_similarity": "0.5734586",
            "sentiment_compound": 0.9939
        },
        {
            "id": "hf8tasq",
            "score": 1,
            "text": "It works for sure. Get in a safe place and have someone sober be there. 5 grams is the dose and there will be times when you can’t walk or have to vomit. Try to be outside if possible. Weed is good but alcohol is bad during this",
            "title_similarity": "0.6604542",
            "sentiment_compound": -0.296
        },
        {
            "id": "hfgieq6",
            "score": 1,
            "text": "this sounds useful if I could find a way to undergo the process safely and legally. I’ve heard of all these studies where psychedelics are used to treat patients with trauma and other various issues, but it seems like a long shot away from being commonly available. I experienced a fair amount of trauma as a child and also trauma later in my life due to psychedelics. at this point I wonder how this form of therapy would turn out for me. the thought of tripping easily onsets panic, but microdosing does seem reasonable.",
            "title_similarity": "0.74657094",
            "sentiment_compound": -0.09
        },
        {
            "id": "hir7mdc",
            "score": 1,
            "text": "A few more solid studies and I'm in.",
            "title_similarity": "0.21595469",
            "sentiment_compound": 0.2247
        }
    ]
}