{
    "Intramuscular injections can accidentally hit a vein, causing injection into the bloodstream. This could explain rare adverse reactions to Covid-19 vaccine. Study shows solid link between intravenous mRNA vaccine and myocarditis (in mice). Needle aspiration is one way to avoid this from happening.\n": [
        {
            "id": "hfgw1db",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.5601814",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hfh2ujs",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfgyh89",
            "score": 13,
            "text": "Seriously? Even when vaccinating animals we are taught to aspirate first. Why wouldn’t they be advised to do so for people?!",
            "title_similarity": "0.57513",
            "sentiment_compound": -0.3296
        },
        {
            "id": "hfgwebt",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.06758888"
        },
        {
            "id": "hfgwmdl",
            "score": -19,
            "text": "Needle aspiration should be standard practice for ALL medical professionals giving an intramuscular injection.",
            "title_similarity": "0.43355036",
            "sentiment_compound": 0.34
        },
        {
            "id": "hfh5kqu",
            "score": 55,
            "text": "[removed]",
            "title_similarity": "0.06758888"
        },
        {
            "id": "hfgybi3",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.06758888"
        },
        {
            "id": "hfh7qba",
            "score": 4,
            "text": "Shouldn't those administering the injections have already known this? What with their vast and extensive knowledge amassed in school and in the field? Or perhaps their supervisors/admins would have advised them before hand? Seems like this would have been discovered a lot sooner like when they were 'testing' the efficacy of the products. Oh well glad the due diligence was done before administering the safest most fully vetted injection ever derived by man.",
            "title_similarity": "0.52197313",
            "sentiment_compound": 0.9386
        },
        {
            "id": "hfh6jeb",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfh705r",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfhi5a3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfhjepq",
            "score": -1,
            "text": "I really don't understand why they advise against aspiration. I was taught to self-inject estradiol for my HRT and was told to always aspirate to avoid injecting into a blood vessel. Aspiration seems like common sense to me.",
            "title_similarity": "0.66145957",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hfgx75o",
            "score": 76,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfgz4w3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfhidnz",
            "score": -2,
            "text": "It's curious how people are citing reasons why NOT to aspirate, but none of them are anywhere near equivalent to the danger of myocardial inflammation.\n\n I'm seeing people say \"it takes longer\" - 3 seconds?\n Someone saying \"it causes muscle damage\" - how often has it been done?  How?\n Someone else \"people's hands shake, they can cause (x number of obscure problems).\n\n For something that used to be done routinely, and only takes a few seconds longer to do - in the context of a minor \"medical procedure\" one presumes done by a \"professional\" - I'm not seeing anything convincing as an argument against it.  It kind of explains the only above-baseline side effect (myocardial inflammation), and given the number of shots given seems about right vs. what I've read about the chances of hitting a vein.  \n\n \"You'll probably be fine\" is a sort of sketchy reason to not do it, and given the 50/50 mix of professionals on the fence... yeah, Dr. Campbell seems correct.",
            "title_similarity": "0.5774759",
            "sentiment_compound": -0.925
        },
        {
            "id": "hfgxcuw",
            "score": -12,
            "text": "Imagine going through medical school and not knowing how to just hit muscle instead of a vein.",
            "title_similarity": "0.4925956",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhe43h",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfhbif3",
            "score": 1,
            "text": "It's the way to make sure you're not in a vessel. Taught in nursing schools. Stick, pull back plunger,  make sure you don't get blood before injecting.",
            "title_similarity": "0.6477326",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hfjexlw",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfgzg0a",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfhvuzl",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfha0sm",
            "score": 1,
            "text": "gotta pull back a little, if you see blood then it's a no-go",
            "title_similarity": "0.39853573",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfh0nx8",
            "score": -3,
            "text": "Very interesting to know, and it makes sense.",
            "title_similarity": "0.12064998",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hfhe8r4",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfh5281",
            "score": 8,
            "text": "To break it down for others that don’t really know what it says:\n\nPoor injection technique and lack of training by those that were deployed to carry out injection is the reason behind one of the extremely rare Sid effects of the vaccine. \n\nA few example: army was being utilised to carry out injection and most only had a few days training.\nOverworked and overwhelmed individuals didn’t pay too much attention during injection. \n\nThese are just a few example that was seen worldwide.",
            "title_similarity": "0.57884884",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hfhpnjq",
            "score": 22,
            "text": "So these people didn't take that into account... and now we're supposed to trust them again? How many lives have to be wasted for you to understand the dangers of mass, compulsory medical procedures? If the vaccine protects you, you're fine. If not, stop bothering others. This is beyond healthcare; this is political.",
            "title_similarity": "0.6798092",
            "sentiment_compound": 0.5318
        },
        {
            "id": "hfh9ak2",
            "score": -5,
            "text": "I suspect this happened to a friend of mine. (for the record, nearly everyone I know is vaccinated, and only one person had a bad reaction). She had to go to the hospital after her second shot and had kidney issues and a high heart rate. She's recovered now. I think she was fine a couple of days later. I don't know if the kidney issues were unrelated. It makes sense though. Wherever the MRNA fragments go is going to be a target for inflammation. She said she was puking uncontrollably shortly after the second shot. \n\nEven with this in mind, it still makes sense to get the vaccine. We used to give out cow pox as a vaccine for small pox. 1 in a million died from that vaccine and 52 in a million had life threatening reactions. These are super low odds. What happened to my friend was probably just that the injection hit a vein, but even then, it was still a good idea. Covid might have led to lifelong complications or killed her.",
            "title_similarity": "0.6130864",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hfhabku",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfhj4pb",
            "score": 10,
            "text": "And yet the cdc recommended no aspiration\n\nThe malice in covid policy is the real disease",
            "title_similarity": "0.50213075",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hfhenfq",
            "score": 0,
            "text": "I remember many many years ago my maths teacher telling a story like this. He was getting a jab to go abroad and said he was very lucky to have hung around for a chat before leaving because he only got as far as the front door before dropping like a rock. He told us that the doc had hit a vein and not the muscle and it stopped his heart, and if he'd gone straight to his car and left he'd have probably died. As it was the doc sorted him out and he ended up torturing me in maths as the universe wanted I guess.",
            "title_similarity": "0.59269404",
            "sentiment_compound": 0.5709
        },
        {
            "id": "hfhnbfl",
            "score": 0,
            "text": "Or you could just use the best option, pills.",
            "title_similarity": "0.47226435",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hfiicie",
            "score": 0,
            "text": "JFC… Every IV drug user knows to aspirate a syringe . They might not know what it’s called. This is injection 101 info. If the person who’s giving you your vaccine doesn’t know this, something is very wrong.",
            "title_similarity": "0.7029387",
            "sentiment_compound": -0.2484
        },
        {
            "id": "hfh5s6z",
            "score": 0,
            "text": "Dr Rhonda Patrick discussed this on her latest q&a and it was very informative/anxiety inducing",
            "title_similarity": "0.39278537",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfh8vco",
            "score": 3,
            "text": "Aspiration was included in the official vaccination technique in my country.",
            "title_similarity": "0.39675295",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhdvew",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.100317046"
        },
        {
            "id": "hfh22nf",
            "score": -7,
            "text": "Needle aspiration is standard procedure in Nursing, at least in Portugal we were taught in nursing school to always do that, and in interships our supervisers always made sure we did that",
            "title_similarity": "0.39030948",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfhebbx",
            "score": -2,
            "text": "Which is why it's standard practice to aspirate IM injections...",
            "title_similarity": "0.430211",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfh7b5e",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfh8ygb",
            "score": 1,
            "text": "Yea I noticed the first pharmacist who did mine aspirated, the second skipped it.  I had no issues luckily besides fatigue.",
            "title_similarity": "0.42966342",
            "sentiment_compound": -0.7097
        },
        {
            "id": "hfhajhz",
            "score": -1,
            "text": "You know I thought it was odd when I took the vaccination class. As a paramedic I always aspirate on IM injections but as I was told “inoculations are different, for instance you never aspirate them”. That was at least the excuse to keep us from giving them. Lasted like a week.",
            "title_similarity": "0.5801419",
            "sentiment_compound": 0.7311
        },
        {
            "id": "hfhhkvp",
            "score": 0,
            "text": "This is how I learned to aspirate before injecting testosterone (pituitary tumor, not for gainz). Hit a vein once and had a very fun couple of days.",
            "title_similarity": "0.56709427",
            "sentiment_compound": 0.2484
        },
        {
            "id": "hfhsci7",
            "score": 1,
            "text": "Could this be a reason I fainted after 2nd vaccine? And I've never fainted before in my 30 years.",
            "title_similarity": "0.38797832",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi0rey",
            "score": 0,
            "text": "Oh boy. Another reason to not get it",
            "title_similarity": "0.23626146",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi27rn",
            "score": 2,
            "text": "The \"rare adverse reactions\" that you get banned for mentioning?",
            "title_similarity": "0.54416114",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hfi6qpj",
            "score": 2,
            "text": "\"This could explain\" ... Aka the vaccine was rushed as they don't even know if that's the case or not. If they don't know about such a \"simple\" thing what else will they find out further down the line?",
            "title_similarity": "0.60695684",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhkbh6",
            "score": 0,
            "text": "Well, that seems like an easy fix to an already rare problem.",
            "title_similarity": "0.2522042",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hfhkys6",
            "score": 0,
            "text": "I think this happened to my friend (or something similar).\n\nHe went from able to beat me arm wrestling to barely being able to use his arm as a result.",
            "title_similarity": "0.40524256",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hfhq2mz",
            "score": 0,
            "text": "Another indication the actual vaccine is even more safe. It will be interesting how this is spun.",
            "title_similarity": "0.51988316",
            "sentiment_compound": 0.7089
        },
        {
            "id": "hfiadkn",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfihqzb",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfh213h",
            "score": -3,
            "text": "Aspirating is standard practice in US veterinary medicine for all injections. It's practically second nature at this point. I'm surprised it isn't more common in human medicine.",
            "title_similarity": "0.610901",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hfh92ej",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfhhfdo",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfh9rvt",
            "score": -2,
            "text": "I got my shingles and pneumonia vaccines from a pharmacist.  I was an Army medic and an EMT before becoming a physician assistant.  Aspiration was a critical part of my intramuscular injection training at every step.  But this pharmacist, who went into my deltoid with both shots, did not aspirate.  I was concerned enough to ask and he claimed they don't teach it anymore!",
            "title_similarity": "0.6216817",
            "sentiment_compound": -0.2363
        },
        {
            "id": "hfhn4sx",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfia2x5",
            "score": 1,
            "text": "Dr John Campbell flagged this MONTHS ago and was ignored by British MPs when he reached out with the concerns. Great to see a study somewhat solidifying his suspicions.",
            "title_similarity": "0.48588547",
            "sentiment_compound": 0.2415
        },
        {
            "id": "hfhacg9",
            "score": -6,
            "text": "Needle aspiration is like the first thing you learn in Hospital Corpsman A school... when I was 19 ffs, if a 19 year old kid with 3 months in the Navy can do do this correctly no one has an excuse.",
            "title_similarity": "0.40656942",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hfikvb1",
            "score": 4,
            "text": "When a Pfizer employee accidentally says that you’d have better immunity to Covid if you got Covid instead of getting the vaccine, but you bozos are still on board with vaccinations.",
            "title_similarity": "0.7432122",
            "sentiment_compound": 0.0644
        },
        {
            "id": "hfhsnlr",
            "score": 3,
            "text": "To all of the armchair nurses in this thread I say; grab a stethoscope and suit up. We certainly need the help.",
            "title_similarity": "0.39308208",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hfhj4cc",
            "score": 6,
            "text": "Before nursing when I was a medical assistant, they changed the recommendation to NOT aspirating for IM injections.  I had gotten so used to doing it that I never stopped.  I had solid technique so I didn't worry about dislodging my needle placement.\n\n19 year old athletic woman comes in for an annual and a flu shot.  Placed the shot, casually aspirated, and for the first time in probably a couple hundred IM injections the syringe filled up with blood with no resistance.",
            "title_similarity": "0.5697278",
            "sentiment_compound": 0.2109
        },
        {
            "id": "hfhhm9w",
            "score": -3,
            "text": "Former paramedic here. Regardless of recommendations it's good practice to always aspirate before injecting IM medications.\n\nThe only time I didn't aspirate was when I was sneaking up on angry/delusional crack or meth users to sedate them with ativan or versesd which if a vein was hit by chance it would just work much faster than an IM route injection.",
            "title_similarity": "0.6867174",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hfhix5w",
            "score": 2,
            "text": "So if perfomed improperly you can get heart inflamation. Neat, love a good mandatory health gamble. Like driving on a donut, it probably won't blow, probably.",
            "title_similarity": "0.68713456",
            "sentiment_compound": 0.9524
        },
        {
            "id": "hfhr313",
            "score": 4,
            "text": "You mean to say that the trainee dentist who gave me my vaccination had no idea what they were doing? Nooooo",
            "title_similarity": "0.55046415",
            "sentiment_compound": -0.296
        },
        {
            "id": "hfh8k2f",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfhefzf",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfhicto",
            "score": 1,
            "text": "Maybe these shots should have been given at your doctors office instead of your local pharmacy.",
            "title_similarity": "0.6052989",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhii9r",
            "score": 1,
            "text": "Seems like this article could’ve come out a long time ago",
            "title_similarity": "0.13447668",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfhjyx9",
            "score": -1,
            "text": "this makes so much sense",
            "title_similarity": "-0.002390068",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhl1zy",
            "score": 1,
            "text": "Maybe that’s why I was bed ridden with a fever of 103 for a couple of days",
            "title_similarity": "0.36380064",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhmbef",
            "score": -1,
            "text": "Aspirating when doing an IM was the first thing I was taught. I noticed the covid vaccine was given with a small sub cut needle, similar to an insulin one.",
            "title_similarity": "0.5740714",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hfhmnug",
            "score": 1,
            "text": "So basically some health care professionals make mistakes and aren’t infallible. I wonder what else they’ve been mistaken about",
            "title_similarity": "0.55402094",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hfhqi4f",
            "score": 1,
            "text": "Is this why I nearly died after my first covid shot?",
            "title_similarity": "0.4891764",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hfhxpd5",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfi3kra",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfiir44",
            "score": -1,
            "text": "I'm a veterinary technician, and in my line of work we administer a lot of injections, subcutaneous, intramuscular, intravenous, etc.  The standard procedure we do to make sure we are or are not in a vein is to aspirate (draw back on the syringe plunger) to see if we get blood.  We do this for every kind of injection we give, vaccines, anesthetics, antibiotics, etc.",
            "title_similarity": "0.57595146",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfh4mnr",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.100317046"
        },
        {
            "id": "hfhfggj",
            "score": -3,
            "text": "\"Needle aspiration is one way to avoid it happening\"\nIn the US you are taught this in school. (Healthcare field). Who, tf, is NOT doing this?",
            "title_similarity": "0.5657639",
            "sentiment_compound": -0.296
        },
        {
            "id": "hfho0vr",
            "score": 4,
            "text": "Dr John Campbell has been saying this for months",
            "title_similarity": "0.027874567",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhert2",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.06758888"
        },
        {
            "id": "hfh3ys6",
            "score": -9,
            "text": "Isn't apiration standard practice in every injection?",
            "title_similarity": "0.284",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfh4u31",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfhaguh",
            "score": -4,
            "text": "We always do needle aspirations when we put any kind of injectable in a human body. We have done it for decades.",
            "title_similarity": "0.32086772",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhc8z6",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfhoxch",
            "score": -3,
            "text": "As someone who takes IM shots every week: yeah. Do this. Every time. Why aren’t they??",
            "title_similarity": "0.15473278",
            "sentiment_compound": 0.3736
        },
        {
            "id": "hfh4nrs",
            "score": -7,
            "text": "There is a way we as nurses avoid this.Befor  we inject we aspirate to see if we get blode,if we dont you are good to go.Only bad technique can create this risk factor nothing else.",
            "title_similarity": "0.662982",
            "sentiment_compound": -0.8116
        },
        {
            "id": "hfhdlcm",
            "score": 1,
            "text": "On my first dose, I didn't even notice the shot going in. No pain, and I was fine after, the worse it got was that I felt like I'd been punched in the shoulder a little bit the next day, no big deal. The second one hurt like a sonofabitch when it went in, followed by a crazy Charlie horse like pain through my neck and shoulder for like 24 hours, and more tired than I have ever been. The day after that I felt amazing though, but that may be because I slept for 16 hours. My wife had no issues whatsoever. Super strange how you can have totally different reactions, and I suspected that it had something to do with the manner of injection because the second shot hurt so badly, so maybe that does hold some water.",
            "title_similarity": "0.5067444",
            "sentiment_compound": -0.8759
        },
        {
            "id": "hfhgdle",
            "score": 3,
            "text": "I think this happened to me getting allergy tested once. They did a histimine control and within about 10 seconds I felt adrenaline rush and started sweating. Doctor seemed really confused and thought I panicked about the needle.",
            "title_similarity": "0.58206934",
            "sentiment_compound": -0.6801
        },
        {
            "id": "hfilsqy",
            "score": 4,
            "text": "Aspirating is redundant now i thought? Even swabbing the skin before injecting is redundant unless the skin is visibly dirty according to WHO. \n\nAlso intramuscular injections are 9/10 times in places far away from major veins or nerves.",
            "title_similarity": "0.6125251",
            "sentiment_compound": -0.552
        },
        {
            "id": "hfjwkzm",
            "score": 2,
            "text": "Well we've went from the vaccine is the safest thing of all time and anyone mentioning an adverse effect must be immediately banned to this at least, so that's a step in the right direction.",
            "title_similarity": "0.5142309",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hfh53s5",
            "score": -6,
            "text": "This science has been well known for a long-long time to anyone trained in administering intramuscular injections.",
            "title_similarity": "0.2948861",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hfh8s88",
            "score": -8,
            "text": "RN here. Needle aspiration to verify placement of a IM injection is standard practice. Those who don’t do it aren’t trained appropriately.",
            "title_similarity": "0.68614614",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhu5l3",
            "score": 52,
            "text": "Doctor here \n\nY'all have no clue.  1) you don't aspirate when doing IM injections  2) The deltoid area, when properly done has no major blood vessels or arteries, unless you aim right at the base of it",
            "title_similarity": "0.5115077",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hfhbup0",
            "score": -4,
            "text": "This is basic technique taught to us in school, also, placement is important so as not to hit nerves or bones.",
            "title_similarity": "0.44682473",
            "sentiment_compound": 0.2723
        },
        {
            "id": "hfhdweg",
            "score": 4,
            "text": "*gets jabbed with vaccine*    \nPharmacist: \" wo0oah! You're bleeding! Did your drink or take any blood thinners?\"    \nMe: \"no!!\"    \n\nFirst time my arm bled (a lot) and had the nastiest looking bruise from a shot but that dude liiike stabbed me tf    \nThis was back in April, no reactions from the vax itself that I know of",
            "title_similarity": "0.61514354",
            "sentiment_compound": -0.8324
        },
        {
            "id": "hfhgtgn",
            "score": 0,
            "text": "Needle too small to do that!",
            "title_similarity": "0.1920086",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhkkln",
            "score": -3,
            "text": "This has been my biggest pet peeve with all the mass vaccinations I've seen on tv and elsewhere. Literally no one aspirates the needle. Of all the b-footage I've seen on tv, probably .1% aspirated.\n\nWhen I got mine at a military drive, they didn't do it. If you point it out, you look like an asshole.\n\nBut apparently, it's not necessary according to some posts here so idk.",
            "title_similarity": "0.55784583",
            "sentiment_compound": -0.2845
        },
        {
            "id": "hfhqms5",
            "score": 0,
            "text": "Was the injection not meant to go into the bloodstream?",
            "title_similarity": "0.52234524",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhrr9q",
            "score": 0,
            "text": "Wow reddit your like from page of internet these studies came in the summer.",
            "title_similarity": "0.20926684",
            "sentiment_compound": 0.743
        },
        {
            "id": "hfhstzf",
            "score": 0,
            "text": "Why don’t we have more intranasal vaccines?  I read a combination of studies showing this to be more effective for certain virus, including Covid where it replicates quickly in the nostrils",
            "title_similarity": "0.72015214",
            "sentiment_compound": 0.6962
        },
        {
            "id": "hfht5ck",
            "score": 0,
            "text": "This is the reassuring massage that everyone needs to know!",
            "title_similarity": "0.19922724",
            "sentiment_compound": 0.4574
        },
        {
            "id": "hfhtdx0",
            "score": 0,
            "text": "Yeah this is basic stuff they teach nurses and paramedics and pretty much anyone that gives IM injections. Always aspirate.",
            "title_similarity": "0.42940652",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hfhu84l",
            "score": 0,
            "text": "They don't pull back before injecting? That's stupid.",
            "title_similarity": "0.46559566",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hfhy0xw",
            "score": 0,
            "text": "Also not getting the j and j will help after all that leaked footage was released.",
            "title_similarity": "0.557387",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hfhyk9a",
            "score": 0,
            "text": "Practicing medical workers are trained to aspirate IM injections already, I would know I’m a paramedic. This is stupid",
            "title_similarity": "0.60519993",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hfi1wpc",
            "score": 0,
            "text": "Everyone in /r/Steroids knows this already",
            "title_similarity": "0.124414764",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi1z0q",
            "score": 0,
            "text": "Yup!\n\nLearned this from my steroid use days.\n\nVery important.\n\nBut when I got my vaccine they just jabbed it quick and definitely didn’t aspirate",
            "title_similarity": "0.60560596",
            "sentiment_compound": 0.6585
        },
        {
            "id": "hfi4ybg",
            "score": 0,
            "text": "Maybe don’t trust The sschmuck at your local pharmacy?\n\nIt’s my understanding that the spike proteins don’t stay in the area they were injected and cause only a Localized response (like other vaccines). That the spike proteins travel throughout the body so does this make a difference?",
            "title_similarity": "0.7388406",
            "sentiment_compound": 0.7319
        },
        {
            "id": "hfi63pe",
            "score": 0,
            "text": "Wait who does not aspirate before injection?!",
            "title_similarity": "0.35772324",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi6498",
            "score": 0,
            "text": "That's funny because as a nursing student I was taught this but then like five years into practicing, they stopped teaching that as standard practice. Oooopsies",
            "title_similarity": "0.4865597",
            "sentiment_compound": 0.431
        },
        {
            "id": "hfi6vho",
            "score": 0,
            "text": "So what I gather is adverse side effects from the Covid-19 vaccine is largely due to Healthcare worker negligence or ignorance?",
            "title_similarity": "0.7021347",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hfi7xie",
            "score": 0,
            "text": "I was right , i knew it. I love being validated like this.",
            "title_similarity": "0.10496595",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hfi9ioo",
            "score": 0,
            "text": "Yeah I just started giving Covid/ flu shots for the first time this week and we were specifically taught not to aspirate the needles. For a deltoid injection I’d rather spend my time making sure I actually do everything else properly and in the right place. \n\nAlso I would rather give myself the shot in my foot than have to aspirate it on someone else and waste my time when I don’t have any to waste.",
            "title_similarity": "0.6464412",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hficcdv",
            "score": 0,
            "text": "Standard practice dude ,before any im injection ,.. its actually basic dudes. ..",
            "title_similarity": "0.22341019",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfidkmi",
            "score": 0,
            "text": "What is \"Needle Aspiration\"????",
            "title_similarity": "0.28627545",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfidxn5",
            "score": 0,
            "text": "But nurses are trained where to inject?",
            "title_similarity": "0.4408325",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfie2xh",
            "score": 0,
            "text": "Inhale my needle after being stabbed, got it.",
            "title_similarity": "0.43879855",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hfiemrs",
            "score": 0,
            "text": "I mean I aspirate when I …play with supplements, have never drew blood and have still got a vein. Man that’s a weird feeling. It’s happened maybe twice and immediately it felt like my breath was sucked outta my lungs and I couldn’t stop coughing for a solid 5 minutes.",
            "title_similarity": "0.45910957",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hfifkse",
            "score": 0,
            "text": "what does the needle has to aspire to be? a doctor? or a fireman perhaps?",
            "title_similarity": "0.4072559",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjncxi",
            "score": 3,
            "text": "I never thought of this but I wonder if it might just be the answer I have been looking for. I am otherwise healthy and young(er), but I had a stroke caused by a blood clot just 11 days after my first poke. \n\nNo one has been able to track down a cause as of yet and it has been 6 months and countless tests. I wonder if an inadvertent jab into a vein may have caused an issue that eventually led to my stroke. Would actually love it if that is what it was, would mean everything else is working like it should. \n\nI am in no way anti-vax, even after a stroke 11 days after first shot I still got my second shot on time. Currently waiting about another two weeks and will be getting my booster as well. Even if it did cause it still better off that I got the shots.",
            "title_similarity": "0.5657886",
            "sentiment_compound": 0.9382
        },
        {
            "id": "hfjs7wn",
            "score": 0,
            "text": "The purposely IV injected mice. How is this possibly connected to potential accidental IV injection during IM delivery such that a recommendation for aspiration(unnecessary potentially damaging) is being offered. This conclusion is an outrageous reach.",
            "title_similarity": "0.84348714",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hfkfd1f",
            "score": 0,
            "text": "Its a bs story to cover up the fact that 25% of vaccinated people get side effects with many leading to death. Dont take it. Respect your body",
            "title_similarity": "0.627125",
            "sentiment_compound": -0.7546
        },
        {
            "id": "hfkfkrr",
            "score": 0,
            "text": "Imagine firing mass amounts of nurses,  and having the remaining nurses that can't inject a needle... what tf.",
            "title_similarity": "0.41657126",
            "sentiment_compound": -0.34
        },
        {
            "id": "hfkj3nd",
            "score": 0,
            "text": "And this is why I'm against the damn shot. They have not gone over everything 100 times yet. It's understandable. It takes a long time to find out all of the side effects. How can they be so positive there are not long term effects when \"the long term\" hasn't happened yet?",
            "title_similarity": "0.48317212",
            "sentiment_compound": 0.4435
        },
        {
            "id": "hfhgklc",
            "score": 21,
            "text": "Given the overall odds of hitting a vein when handing out literally billions of shots, I'd say those accidents have happened.",
            "title_similarity": "0.4859714",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hfi52f2",
            "score": 9,
            "text": "Nurse here for twenty one years now. I always aspirate my plunger before I push just in case I hit a vein. I was able to aspirate blood ONE time out of the buffers or maybe thousands of jabs I’ve done in my lifetime and am really grateful that I did it that one time. It was a tetanus shot for a 10 year old kid.",
            "title_similarity": "0.5463326",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hfgz5h8",
            "score": 56,
            "text": "Aspiration of the needle means, put the needle into the patient, pull the plunger out a bit, if blood comes into the chamber of the needle then discard as you've accidentally gone intravenous instead of intramuscular. Otherwise, continue with the injection.",
            "title_similarity": "0.6993796",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hfhlzzz",
            "score": 12,
            "text": "A 4000% increase can NOT be explained by this minor issue.",
            "title_similarity": "0.26512545",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfhugu0",
            "score": 13,
            "text": "Aspiration is very specifically not recommended for deltoid covid shots.",
            "title_similarity": "0.39163104",
            "sentiment_compound": -0.2157
        },
        {
            "id": "hfh8flp",
            "score": -1,
            "text": "Hitting myofascial trigger points can too cause problems. See it quite often as a Myotherapist after someone has recently had a jab.",
            "title_similarity": "0.5912035",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hfh8i8c",
            "score": 1,
            "text": "This is only with the mRNA vaccines or that's all the study included?",
            "title_similarity": "0.4571014",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhdq1h",
            "score": -1,
            "text": "Are we supposed to blast n’ cruise these vaccinations? Or are we supposed to cycle it? \n**coughs in Tren**",
            "title_similarity": "0.5481626",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhg33y",
            "score": 1,
            "text": "If I were responsible for understanding some of the adverse reactions, I would look into the mechanism that's leading to blood clots. These blood clots are causing further issues and they don't appear to be rare",
            "title_similarity": "0.68241024",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hfhguyf",
            "score": -1,
            "text": "Or just use that new vein finder scope to be sure you don’t hit a vein.",
            "title_similarity": "0.61012584",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfhho3n",
            "score": 1,
            "text": "Seems like some misinformation if you ask me",
            "title_similarity": "0.27911735",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hfhhxz9",
            "score": -1,
            "text": "Dr John Campbell has been suggesting this since the blood clot issue was first being reported last spring.",
            "title_similarity": "0.34637105",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhhypy",
            "score": 1,
            "text": ".001 goes down to .000001 and antivaxxers still unimpressed.",
            "title_similarity": "0.22292376",
            "sentiment_compound": -0.34
        },
        {
            "id": "hfhlc3k",
            "score": -1,
            "text": "Before anybody runs around spreading lies, protocol is to always do aspiration, if blood comes in the syringe you throw everything away and start all over again.",
            "title_similarity": "0.5055976",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hfhlhmu",
            "score": -1,
            "text": "Considering how veiny i am i would be surprised if thats why it fucked me up. I swear to god, its been years but i could hit myself up better then these people.",
            "title_similarity": "0.48826134",
            "sentiment_compound": 0.4678
        },
        {
            "id": "hfhmb84",
            "score": -1,
            "text": "Bodybuilders everywhere laughing",
            "title_similarity": "0.10512821",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hfhn0h9",
            "score": 1,
            "text": "I've had experience with this with testerone,  my wife injected me and didn't check for blood and that stuff went straight to my lungs , I thought she killed me",
            "title_similarity": "0.5775659",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hfhn5b8",
            "score": -1,
            "text": "I was a medic in the army back in the 60s, and this was the first thing we were taught when doing injections.",
            "title_similarity": "0.3820154",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhnvop",
            "score": 1,
            "text": "Do you know how stupid you have to be to make that happen?",
            "title_similarity": "0.38282102",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hfho5hy",
            "score": -1,
            "text": "Aspiration is standard practice for any IM injection.",
            "title_similarity": "0.32876396",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhpswv",
            "score": -1,
            "text": "That's like the only thing you have to remember...",
            "title_similarity": "0.030009033",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfhpv3o",
            "score": -1,
            "text": "This is what I think happened to my brother who got menangitis symptoms days after getting the menangitis vaccine. He showed no sign of it in his body but several of the symptoms. He was in the hospital for three weeks.\n\nThis is what I think happened to my brother who got meningitis symptoms days after getting the meningitis vaccine. He showed no sign of it in his body but several of the symptoms. He was in the hospital for three weeks.",
            "title_similarity": "0.47994563",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hfhqest",
            "score": -1,
            "text": "Like,  I always kinda thought they did this so they didn't hit something crucial...",
            "title_similarity": "0.3997305",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfhqt5r",
            "score": 1,
            "text": "Can anyone explain what acute myopericarditis is?",
            "title_similarity": "0.40516168",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhrakf",
            "score": -1,
            "text": "All drug users/former drug users(ME - in recovery!) know this! I wasn’t an intravenous user but most know somebody who has/does. We are pushing for the opposite here, hoping no blood appears vs when ppl use drugs intravenous they need to find that vein.",
            "title_similarity": "0.5464374",
            "sentiment_compound": 0.3578
        },
        {
            "id": "hfhwjdv",
            "score": 1,
            "text": "Why wouldn’t they have been doing this all along?  I use to give injections all day, every day, and we always took the millisecond to pull the syringe back to check for blood.  Very easy to do, and was just safety 101.",
            "title_similarity": "0.47322768",
            "sentiment_compound": 0.7178
        },
        {
            "id": "hfhy3vs",
            "score": 1,
            "text": "So dr John Campbell was right",
            "title_similarity": "0.13211048",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi34x6",
            "score": 1,
            "text": "Dr John Campbell’s been saying this for literal months now!",
            "title_similarity": "0.084681354",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi4jyq",
            "score": 1,
            "text": "Is there a similar explanation as to why they don't work past 6 months and require frequent boosters unlike other vaccines that confer lifelong immunity?",
            "title_similarity": "0.644351",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi5a6a",
            "score": 1,
            "text": "Paramedic here, they spent a week teaching us how to do I im injections with the aspiration part and if you failed the skill (like other skills) three times in a row you were kicked out of the entire program never to return. My friend who worked at CVS became a vaccine giver because she had a high school diploma, and if she didn't sign up for extra work she would only be given 30 hours a week.",
            "title_similarity": "0.47834757",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hfi7tfk",
            "score": 1,
            "text": "wait? there are adverse reactions to the covid vaccine? ive been shaming people and trying to force them to take it. AITA?",
            "title_similarity": "0.683735",
            "sentiment_compound": -0.466
        },
        {
            "id": "hfi8pl3",
            "score": 1,
            "text": "Finally some arising evidence, when i took the vaccine i asked them to aspirate the needle, they refused and said it was wasnt needed.\n\nLuckily these type of adverse effects are rare, but why not just aspirate just to give people a peace of mind?? It doesnt take more than a extra second to check for blood in a aspirated needle.",
            "title_similarity": "0.70167196",
            "sentiment_compound": 0.4421
        },
        {
            "id": "hfi9l51",
            "score": 1,
            "text": "Are we sure it has nothing to do with the spiked protein breaking off and going throughout the body?",
            "title_similarity": "0.5022038",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfiamif",
            "score": 1,
            "text": "We were alway taught to aspirate before administration of meds.",
            "title_similarity": "0.4415907",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfib9u7",
            "score": 1,
            "text": "this isn't new and was already brought up to those who administer the shots, a lot are still arrogant and insist that they don't and will not aspirate",
            "title_similarity": "0.3890252",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hficd7u",
            "score": 1,
            "text": "Thought this was basic knowledge…yikes.",
            "title_similarity": "0.13363996",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfid8yg",
            "score": 1,
            "text": "I have been giving vaccines for years and always drawback before injecting. I see a lot on TV that never do that Dangerous practise",
            "title_similarity": "0.49414843",
            "sentiment_compound": 0.6065
        },
        {
            "id": "hfid9m4",
            "score": 1,
            "text": "So if I got my booster the other day and I had a small drop of blood drip am I in trouble???",
            "title_similarity": "0.63118464",
            "sentiment_compound": -0.6531
        },
        {
            "id": "hfidads",
            "score": 1,
            "text": "This makes sense. I was taught to aspirate when self-injecting my estradiol for basically the same reasons. Of course, I have to inject into my *leg*, and that's an area with a lot larger veins that more easily be hit.",
            "title_similarity": "0.53984904",
            "sentiment_compound": 0.4005
        },
        {
            "id": "hfidoq8",
            "score": 1,
            "text": "And this is Rule Number 1 for nurses training to do IM injections. Sanitise site, stretch skin, insert needle at 90 degrees, ***draw back***, inject. Source: am a nurse.",
            "title_similarity": "0.44915628",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hfiec7o",
            "score": 1,
            "text": "We don’t aspirate intramuscular injections anymore. Just don’t miss and landmark appropriately and you’re good",
            "title_similarity": "0.45674962",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hfieio7",
            "score": 1,
            "text": "Stop pretending like theyre sticking some 25ga needle into someones vein at such a high and unprecedented rate suddenly in the decades of im injections. Covid probably came from a wild bat too right?",
            "title_similarity": "0.56721914",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hfif393",
            "score": 1,
            "text": "I'm late to the party, but this happened to me once with the Flu vaccine, and I cannot possibly describe how sick I got- it was excruciating. That said, I know what caused it, and still have gotten vaccinated since.",
            "title_similarity": "0.60744524",
            "sentiment_compound": -0.9319
        },
        {
            "id": "hfihuxi",
            "score": 1,
            "text": "So basically, if they miss the mark, you can die and that’s why people have been having issues",
            "title_similarity": "0.5110042",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hfile96",
            "score": 1,
            "text": "You are going to know really fast if you hit a vein or muscle by the amount of blood that shoots out",
            "title_similarity": "0.40904748",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfilwk5",
            "score": 1,
            "text": "Yup now blame it on nurses and a practice which has been going on for decades. Just don't say anything about vaccine. Covaxin and Sputnik does not have this problem.",
            "title_similarity": "0.45358372",
            "sentiment_compound": -0.6731
        },
        {
            "id": "hfiuscb",
            "score": 1,
            "text": "They’ve stopped recommending aspiration of needles for IM injections in nursing for a while now. \n\nSource: Nurse for 12+ years.",
            "title_similarity": "0.49329406",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hfiw4km",
            "score": -1,
            "text": "Oh, but the people who decided to wait to get the vaccine who’s decision could have potentially saved them having this done to them, are stupid and menaces to society by not getting the vaccine exactly when you said right?",
            "title_similarity": "0.64904106",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hfiw4u1",
            "score": 1,
            "text": "I’m an RN who was taught to always aspirate before giving an IM injection. A lot of comments here are that it is no longer best practice. However this study supports the opposite. Seriously what is the harm in aspirating first?",
            "title_similarity": "0.6209297",
            "sentiment_compound": -0.7067
        },
        {
            "id": "hfiys5j",
            "score": -1,
            "text": "They'll say absolutely anything to try to push this untested vaccine and say it's \"safe\" while people are literally dying from it. Disgusting",
            "title_similarity": "0.61100173",
            "sentiment_compound": -0.128
        },
        {
            "id": "hfj94w9",
            "score": 1,
            "text": "it's nursing 101, right?\n\nall IM injections need to be aspirated...RIGHT?",
            "title_similarity": "0.42373234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfj97p9",
            "score": 1,
            "text": "So Biden's booster was injected without the needle aspiration. Sort of crazy that a study like this exist and the president isn't protected fully.\n\nSounds like SS needs some industrial hygienist on staff.",
            "title_similarity": "0.64382195",
            "sentiment_compound": 0.0463
        },
        {
            "id": "hfj9ifr",
            "score": 1,
            "text": "This has been common knowledge in the medical world literally as long as there have been injections. Why did we need a paper on this???",
            "title_similarity": "0.40872458",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfj9mjr",
            "score": 1,
            "text": "That’s standard of care for injections- aspirate \nIf blood- remove needle and try again.",
            "title_similarity": "0.5447513",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hfja3zd",
            "score": 1,
            "text": "Aspiration should be happening every time anyone injects anything.",
            "title_similarity": "0.21421856",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjag2t",
            "score": 1,
            "text": "People are already supposed to do that when giving IM injections.",
            "title_similarity": "0.4711362",
            "sentiment_compound": 0.34
        },
        {
            "id": "hfjf35v",
            "score": 1,
            "text": "When I was in nursing school we were taught to not aspirate during any injections. And no IMs in the gluteals because of risk of hitting the sciatic nerve\n\nETA: we did do z track though.",
            "title_similarity": "0.6188272",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hfjgjvb",
            "score": 1,
            "text": "Nurse here, this basically the same with any medication ever injected. I have no idea why someone thought they needed to write a new study on it.",
            "title_similarity": "0.42178735",
            "sentiment_compound": -0.296
        },
        {
            "id": "hfjkd83",
            "score": 1,
            "text": "So basically the vaccines are just as safe as we thought, if not more, and the very rare improper administration of them is exposed and amplified when an inoculation campaign is conducted on such a massive and rapid scale.",
            "title_similarity": "0.64835894",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hfjte85",
            "score": -1,
            "text": "all for a virus that has a 99%+ survival rate.",
            "title_similarity": "0.20209682",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfh3get",
            "score": 9,
            "text": "People who aspirate. How often do you hit a blood vessel in the delt?",
            "title_similarity": "0.47767532",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhbi5q",
            "score": 37,
            "text": "How far along are we on the 'nasal' vaccine? I remember this was talked about a lot a few months ago then... nothing. \n\nI feel like a lot of 'vaccine hesitant' people are just afraid of injections and if they had to snort it instead they might be more willing.",
            "title_similarity": "0.68166924",
            "sentiment_compound": -0.4784
        },
        {
            "id": "hfhhz4f",
            "score": 17,
            "text": "This is old old old. Needle aspiration is not best practice.",
            "title_similarity": "0.39176136",
            "sentiment_compound": -0.5216
        },
        {
            "id": "hfhtxlt",
            "score": 17,
            "text": "Old school nurses aspirate. New nurses do not. the risk is so low of any issues the experts/researchers determined not worth the extra time and potential pain to aspirate. But wonder if the recommendation will change to aspirate with Covid vaccine since possible risk is detected",
            "title_similarity": "0.72614956",
            "sentiment_compound": -0.5751
        },
        {
            "id": "hfh7suy",
            "score": 2,
            "text": "My first shot of Pfizer hit a vein pretty good. Had to use duct tape after a few hours since nothing could hold back the flow while working. Luckily, no adverse reactions. Was a bit sore for a while and still a bit bruised for my second.",
            "title_similarity": "0.54949653",
            "sentiment_compound": 0.8406
        },
        {
            "id": "hfh8bo6",
            "score": -2,
            "text": "I am a pharmacist and you have to be utterly incompetent to do that.",
            "title_similarity": "0.40663368",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hfhaut4",
            "score": 2,
            "text": "I do IM injections regularly as an MRI technologist, and I have been taught to aspirate to check that we are not injecting inside a blood vessel. The problem is that in 5 years, I have never had blood come back when I aspirate, even a single time. Yet, when I inject, sometimes it bleeds more than others.          \n\nCould aspirating be inefficient as a way to check, perhaps because the blood vessels are so small inside the muscle?",
            "title_similarity": "0.66222",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hfhf1n2",
            "score": -2,
            "text": "I'm a former IV drug user.  That doesn't give me authority, necessarily, but IM injections still bypass the useful skin barrier that protects us from most bacteria.   \n\n\nI think most of the adverse reactions are protein allergies because that would be consistent with what we understand about such things.",
            "title_similarity": "0.7556837",
            "sentiment_compound": 0.3168
        },
        {
            "id": "hfhlpvy",
            "score": -2,
            "text": "Really?! You are going to try to blame the nurses who do injections everyday and blame them for myocardits? They are trained to check for that when injecting, whether they do it always or not, well, it would be obvious to the patient, they would have major bruising, you hit a vein and that is an \"any idiot can see\" problem.",
            "title_similarity": "0.6303811",
            "sentiment_compound": -0.9055
        },
        {
            "id": "hfhpnkd",
            "score": 2,
            "text": "News just in!\n\n**Something** *could* cause **something else**!\n\nLet's bet all we have on this being true!",
            "title_similarity": "0.25591162",
            "sentiment_compound": 0.5684
        },
        {
            "id": "hfhs1k4",
            "score": 2,
            "text": "I bet there will be a lot of people directing medical professionals based on this internet research.",
            "title_similarity": "0.3966141",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhtf21",
            "score": 2,
            "text": "Aww so yer telling me the Adam’s Family looking jackasses in the pop up vax clinic in the vacant lot next to the weed dispensary may not have perfect needle technique?",
            "title_similarity": "0.56803423",
            "sentiment_compound": -0.7781
        },
        {
            "id": "hfhtk8j",
            "score": 2,
            "text": "Just FYI needle aspiration hurts like hell -a nurse",
            "title_similarity": "0.4319206",
            "sentiment_compound": -0.5672
        },
        {
            "id": "hfi13bw",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfi1lr1",
            "score": 2,
            "text": "Per CDC, aspiration not necessary for vaccines. \n\n Aspiration before injection of vaccines or toxoids (i.e., pulling back on the syringe plunger after needle insertion but before injection) is not necessary because no large blood vessels are present at the recommended injection sites, and a process that includes aspiration might be more painful for infants ([22](https://www.cdc.gov/vaccines/hcp/acip-recs/general-recs/administration.html#ref22)).",
            "title_similarity": "0.68332595",
            "sentiment_compound": -0.1919
        },
        {
            "id": "hfi5aad",
            "score": 2,
            "text": "If the guy who gave me my first dose said, \"I've never seen one bleed like that before,\" and my arm bled a lot, does that mean he hit a vein?",
            "title_similarity": "0.5033954",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfi7b1z",
            "score": 2,
            "text": "I wonder how much of these intravenous injections are due to the fact that they have been recruiting healthcare providers who traditionally have not done injections to help with the vaccinations.",
            "title_similarity": "0.66970575",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hfihjve",
            "score": 2,
            "text": "This is why long term studies are necessary BEFORE mass rollout. Crazy how asking for more data is seen as being anti-vax.",
            "title_similarity": "0.57539284",
            "sentiment_compound": -0.34
        },
        {
            "id": "hfje6aa",
            "score": 2,
            "text": "I got jabbed in the summer and both times I got them to aspirate the shot even though it's not called for. At the time it was based on Scandinavian studies that were suggesting this might be an issue. I'll admit I felt a little bit like an arse since one of them didn't know what that was or how to do it, but seeing things like this now I'm glad I did.",
            "title_similarity": "0.5119195",
            "sentiment_compound": 0.8504
        },
        {
            "id": "hfju5lb",
            "score": -2,
            "text": "Proof that scientists are just as easy to buy as politicians are",
            "title_similarity": "0.31821084",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfjw166",
            "score": 2,
            "text": "So you mean Melissa from cvs who has no medical training could be causing these reactions…… weird how non medical professionals seem to be doing medical procedures…..",
            "title_similarity": "0.5764493",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hfhgwxu",
            "score": 70,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfhtmnb",
            "score": 18,
            "text": "I'm a relatively newer nurse (about 5 years now) and in 2014 the practice we were taught was to never aspirate. It's just not a safe or standard practice anymore.",
            "title_similarity": "0.3911285",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hfh1u4x",
            "score": 165,
            "text": "As someone who donates blood regularly, I can attest that different people definitely have different skill levels when it comes to needles haha.",
            "title_similarity": "0.48246464",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hfh2qzz",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.067588836"
        },
        {
            "id": "hfhay3i",
            "score": -2,
            "text": "“We’ve been getting vaccines for ages. What’s there to be afraid of”",
            "title_similarity": "0.44086426",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhb9ls",
            "score": 3,
            "text": "Grated. I haven’t read through all of these comments, however research is showing that in order to show blood return from aspiration you need to maintain negative pressure for anywhere from 5-10 seconds. Unfortunately I am having trouble linking the studies on my phone, but you can search for them with NCBI, PubMED, etc by searching for keywords “aspiration with IM injections 10 seconds”. \nThe problem with this is, as a nurse, typically an injection is one of many duties that need to be performed in a short period of time and patients are not going to tolerate sitting still for the 5-10 seconds while you maintain negative pressure. Many people will complain about the injection itself or the shift you need to do for a second or two of negative pressure. \nI’ve been a licensed nurse since 2012 and was a medical assistant for 4 years prior so I’ve been giving shots for 13 years. In that time I’ve hit a superficial vein causing a “squirt” of blood 3 times- and two of those were during emergency situations when IV access was not yet established. If the literature for a specific medication requires aspiration I will and have no issue doing so, otherwise I’m following best practice and not aspirating for 5-10 seconds.",
            "title_similarity": "0.65286267",
            "sentiment_compound": -0.9747
        },
        {
            "id": "hfhx0se",
            "score": 4,
            "text": "This can apply to many scenarios wherever intramuscular injections are employed. Should be efforts to identify this early on if this occurs in order to mitigate the negative adverse reactions when/if they present themselves.",
            "title_similarity": "0.59126997",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hfj5wc6",
            "score": 2,
            "text": "Finally someone addressing some legitimate concerns, open discussion should always be part of science. This will help dispel concerns by giving clarity to real risks and how to avoid them.",
            "title_similarity": "0.51527876",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hfh336h",
            "score": 92,
            "text": "Why is it mostly affecting young males then?",
            "title_similarity": "0.2430391",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfh939m",
            "score": 29,
            "text": "This was suggested as a potential cause of the astrazeneca clotting issues back in March",
            "title_similarity": "0.43334934",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfh6bh8",
            "score": 65,
            "text": "Any explanation for why this happens more after the 2nd dose and with younger males if it's an accidental vein injection?",
            "title_similarity": "0.60266054",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hfhxum1",
            "score": 15,
            "text": ">Needle aspiration is one way to avoid this from happening\n\n\"I'm going to be the very best needle I can. The best ever!\"",
            "title_similarity": "0.43164098",
            "sentiment_compound": 0.831
        },
        {
            "id": "hfh6mbx",
            "score": 274,
            "text": "Aspiration isn't best practice anymore. As long the person giving the injection is landmarking properly they shouldn't be hitting any blood vessels. Source: I give a lot of needles as a psych nurse.",
            "title_similarity": "0.67569196",
            "sentiment_compound": -0.2425
        },
        {
            "id": "hfhky0w",
            "score": 9,
            "text": "Anyone else feeling woozy just by reading the post and comments?",
            "title_similarity": "0.42101455",
            "sentiment_compound": 0.128
        },
        {
            "id": "hfhgchf",
            "score": 7,
            "text": "Aspirstion is so out dated",
            "title_similarity": "0.18801618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhw4kl",
            "score": 13,
            "text": "Worth noting that this study gave mice .25 micrograms of mRNA per gram of bodyweight, or 5 micrograms per mouse on average.\n\nHumans get 30 micrograms of mRNA in the Pfizer vaccine per dose, which is the one used in this study. Given an average bodyweight of around 80 kg (~180 pounds) for men in the US, that comes out to humans getting 0.0004 micrograms (Pfizer) of RNA per dose, compared to the 0.25 mice are getting. \n\nThese mice are thus getting proportionally more than a 600x higher dose than your average US adult male in terms of mRNA content (the volume the vaccine is delivered in is similarly disproportionately large in mice). \n\nDosing for mice and humans doesn't always scale linearly, but this is a pretty massive difference. People should interpret these results with caution.\n\nIt's also worth noting that BALB/c mice, the strain used in this paper, famously has lesions of background calcification or mineralization of the heart. This issue is very well known and frequently pointed out by pathologists when submitting samples to them for analysis.",
            "title_similarity": "0.5601589",
            "sentiment_compound": 0.9493
        },
        {
            "id": "hfhw8zl",
            "score": 14,
            "text": "A few weeks ago I had to get a numbing injection on one of my fingers. Two shots, one on each side of the finger just past the knuckle. Halfway through the second one I feel like I got punched in the chest. I look down at my fitbit and watch my heart rate go from mid-80s to mid-50s in just a few seconds. Told the doc what I was feeling, and he just says \"oh, so I probably got some of this in your bloodstream. I'm not concerned, but the next ten to fifteen minutes is not going to be pleasant for you.\"\n\nSure enough, weight got heavier, I got drowsy, my fingers turned a nice dark purple-black. \n\nFifteen minutes later I was back to normal. 2/10, would not recommend.",
            "title_similarity": "0.59896815",
            "sentiment_compound": 0.9097
        },
        {
            "id": "hfh5dix",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "0.06758888"
        },
        {
            "id": "hfhw9wr",
            "score": 17,
            "text": "Why is it predominantly one group and the same group around the globe (young males)?",
            "title_similarity": "0.083110094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfh5bi3",
            "score": 1800,
            "text": "ER nurse here. I was trained to not aspirate with IM injections. It isn't a reliable indicator for whether you're in a vein. You may be in a vein and not aspirate blood. You may aspirate blood and not be in a vein at all. It's a useless test, and can cause increased pain with the injection. \n\nFar more important to know your landmarks for your injection sites so you don't end up near a vein in the first place.",
            "title_similarity": "0.7103479",
            "sentiment_compound": -0.4417
        },
        {
            "id": "hfh7mzn",
            "score": 220,
            "text": "some discussion about this paper on pubpeer:\nhttps://pubpeer.com/publications/6DB19C2CE523B3BAEAA8A8A3DCCC7D",
            "title_similarity": "0.37881148",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfh4vdl",
            "score": 750,
            "text": "Aspirating with injections used to be standard nursing practice for IM injections— that’s what I learned to do in school. But newer data showed that it’s not good practice because aspiration isn’t a reliable way to know whether you’re in a vein and the only thing it accomplishes is more discomfort for the person getting the shot.",
            "title_similarity": "0.71217823",
            "sentiment_compound": -0.5717
        },
        {
            "id": "hfh1j8w",
            "score": 6386,
            "text": "The [CDC](https://www.cdc.gov/vaccines/hcp/acip-recs/general-recs/administration.html) currently does NOT advise the use of aspiration during vaccination - particularly in the deltoid where the COVID vaccine is usually given. A lot of people in this thread seem to be blaming healthcare workers for not aspirating. It used to be standard practice when giving IM injections but the recommendations have changed over time.",
            "title_similarity": "0.70124066",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hfgyfkn",
            "score": 4383,
            "text": "What does it mean to aspirate a needle?",
            "title_similarity": "0.31711763",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfh1uei",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.06758888"
        },
        {
            "id": "hfh4uk1",
            "score": 1,
            "text": "What does \"Brief withdrawal of syringe plunger to exclude blood aspiration may be one possible way to reduce such risk\" actually mean?",
            "title_similarity": "0.6625793",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hfhaevf",
            "score": 18,
            "text": "Serious question:  if a medicine is not going into a vein, how does it circulate throughout the body for its intended purpose?",
            "title_similarity": "0.60967004",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hfhc4go",
            "score": 1,
            "text": ">Injections given for routine immunizations are different from injections for medications. The minimal risk of side effects combined with defined sites for immunization form one basis of the existing recommendations for eliminating aspiration during immunization. The fact that most AD devices currently in use do not allow for aspiration also appears to have been a major factor in the decision to eliminate aspiration as an essential step prior to IM or SC injection of vaccines. We argue that clinical needs should dictate the development of new devices and not the other way around. Relevant recommendations must be evidence-based and ISO guidelines must be modified to reflect evolving needs. This would drive the device industry to meet the criteria laid down based on scientific rationale.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC5333604/",
            "title_similarity": "0.73902965",
            "sentiment_compound": -0.6329
        },
        {
            "id": "hfhd6zw",
            "score": 1,
            "text": "I inject IM 2x per week, mainly in glute and thigh. I was advised by my doctor not to aspirate prior to injection and can say in the 2 years of injections I have hit a vein twice. It was incredibly painful in the moment and bled profusely, but I never felt the need to add it to my injection routine.",
            "title_similarity": "0.5465447",
            "sentiment_compound": -0.2724
        },
        {
            "id": "hfhgieb",
            "score": 1,
            "text": "This makes me anxious as I am going to start a treatment where I have to inject myself once a week, around the belly area. Can this happen?",
            "title_similarity": "0.4572531",
            "sentiment_compound": -0.25
        },
        {
            "id": "hfhhxzn",
            "score": 1,
            "text": "I have to give my self IM injections multiple times a week for the past 3 years and I’ve never once aspirated. I was taught not to do it",
            "title_similarity": "0.30585",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhi5j3",
            "score": 1,
            "text": "Was the rate higher or lower than the average rate of this happening with other similar injections?",
            "title_similarity": "0.38952988",
            "sentiment_compound": -0.296
        },
        {
            "id": "hfhiww7",
            "score": 1,
            "text": "Is it easier to target intramuscular injections when the person being injected has large arm muscles?",
            "title_similarity": "0.4921234",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hfhjo8w",
            "score": 1,
            "text": "Can someone explain to a layperson how bad it would be if the vaccine is injected IV instead of IM? Are we just talking worse side effects than the general population or serious/long-term health complications?",
            "title_similarity": "0.7378418",
            "sentiment_compound": -0.7882
        },
        {
            "id": "hfhlass",
            "score": 1,
            "text": "Wouldn’t this be the case for all intramuscular injections, not just the covid vaccine?",
            "title_similarity": "0.6009598",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhlcj7",
            "score": 1,
            "text": "I have nothing but the utmost respect for the science community!! I'm a peanut brain when could barely pass basic biology so I have no clue what they are doing but I know it's dangerous, yet important work!",
            "title_similarity": "0.5127681",
            "sentiment_compound": -0.4351
        },
        {
            "id": "hfhohvl",
            "score": 3,
            "text": "Why is the headline editorialized?",
            "title_similarity": "0.19771898",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhrjmb",
            "score": 1,
            "text": "This is fascinating.  I effing love science.",
            "title_similarity": "0.25993833",
            "sentiment_compound": 0.8399
        },
        {
            "id": "hfhrk96",
            "score": 1,
            "text": "All I know is they stuck that sucker so far into my arm, I thought it might have had a chance to come out on the other side.",
            "title_similarity": "0.58200157",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hfhrl44",
            "score": 1,
            "text": "Whenever I inject testosterone in my deltoid I have to remember to do this. One time I hit a vein and passed the fuck out",
            "title_similarity": "0.5484898",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hfhryod",
            "score": 2,
            "text": "worse than it’s a link...",
            "title_similarity": "0.21122223",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hfhs393",
            "score": 2,
            "text": "I'm not a nurse but hold a title that lets me give shots for certain facilities.  I work in psych and unfortunately it can be difficult to aspirate when you are having people hold a fighting patient to give a B52 or the like.  But it can cause adverse reactions for all shots.  Just like anything entering/cutting your skin.",
            "title_similarity": "0.703716",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hfhsfe8",
            "score": 1,
            "text": "My mom said she had an intense burning pain when she had her injection. J&J",
            "title_similarity": "0.46814102",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hfhszbf",
            "score": 1,
            "text": "Besides side effects, does the vaccine still work if injected into a vein?",
            "title_similarity": "0.69655704",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhtj85",
            "score": 1,
            "text": "I believe my second dose was injected into a vein by accident - the guy who administered it was surprised by how much blood there was afterwards. Ever since that day 6 months ago the pain in my arm near the injection site feels like a bad sunburn. It’s kind of a bummer!",
            "title_similarity": "0.63183486",
            "sentiment_compound": -0.8553
        },
        {
            "id": "hfhtmgq",
            "score": 1,
            "text": "I have to give myself IM shots once a week and can say for sure that hitting a vein is more common than you would think. For me the side effects are near instant nausea, hot flashes, vertigo and a hot burning feeling that spreads quickly all over my body. These feelings subside over about 15 mins but the nausea tends to stick around a few hours.\n\nI have found that the best muscle to hit is the outer middle thigh muscle, not many veins and it's a big target so little worry about not going deep enough or too deep.",
            "title_similarity": "0.51716924",
            "sentiment_compound": 0.5956
        },
        {
            "id": "hfhtxpb",
            "score": 1,
            "text": "Now is the time to be researching [jet injectors](https://www.cdc.gov/flu/prevent/jet-injector.htm).",
            "title_similarity": "0.49832582",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhum7a",
            "score": 2,
            "text": "When I got my first Moderna shot, the provider hit a vein. I had blood running down my arm and had to go in the bathroom to clean it off. No side effects other than a sore arm and tiredness for a day or so.",
            "title_similarity": "0.54769474",
            "sentiment_compound": -0.25
        },
        {
            "id": "hfhutbk",
            "score": 1,
            "text": "This is interesting, but it would be hard to do on those afraid of needles. I've given hundreds of vaccines (covid and otherwise) and I can remember plenty of cases where this would be damn near impossible unfortunately.",
            "title_similarity": "0.6302978",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hfhv2mb",
            "score": 1,
            "text": "Now think what will happen if spike proteins get into blood flow. Long term effects. And they eventually will if you revaccinate many times",
            "title_similarity": "0.42302918",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhv3ak",
            "score": 2,
            "text": "I've had a dead arm for 3 months since second jab. It's only noticeable when I try to lift.",
            "title_similarity": "0.27204502",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hfhv8hn",
            "score": 1,
            "text": "We do this for IM injections in horses. I never considered the hows and whys (or not) for injecting humans.",
            "title_similarity": "0.4759096",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhvf2e",
            "score": 1,
            "text": "Nurse here. We are taught to aspirate before injection every time. Basically, after you stick the needle in,, pull back slightly on the plunger before pressing it down; if nothing comes back when you pull and it makes a little vacuum bubble, you are good to go and should give the shot; if you pull back on the plunger and red blood comes back, you have hit a vein/artery and should abort and try again in a different spot. It is super easy, chances are 99% of your injections the person giving the shot did this and you just don't notice. Anyone who is giving a shot and skips this step is just lazy, borderline negligent. I have never given a shot, aspirated, and seen red, it is pretty rare to hit these spots. That being said, lancing the vein and going completely through it is probably more common. You won't see the red if that happens, but it gives the medication or whatever you are injecting much easier access to your bloodstream.",
            "title_similarity": "0.6157749",
            "sentiment_compound": 0.9042
        },
        {
            "id": "hfhvf3p",
            "score": 1,
            "text": "I inject myself with hormones intramuscularly every 2 weeks...really hope the adverse effects dont apply to all intramuscular injections",
            "title_similarity": "0.5514958",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hfhvhbp",
            "score": 1,
            "text": "Fairly certain that the administrator didn't aspirate to verify 😰",
            "title_similarity": "0.3147236",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hfhvojj",
            "score": 1,
            "text": "Would this not be an issue for other IM vaccines as well or is it specific to mRNA vaccines?",
            "title_similarity": "0.6028",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hfhvox1",
            "score": 1,
            "text": "Needle aspiration is standard in vet med, I don’t see why we don’t do it in humans",
            "title_similarity": "0.5787829",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhvrzb",
            "score": 3,
            "text": "What counts as a rare adverse reaction? I got pretty horrible hives for around 2 months after getting my vaccine. So I wonder if this could be the reason. I don't regret getting the vaccine, of course, and will get a booster when I need to, but the hives were pretty rough.",
            "title_similarity": "0.6820977",
            "sentiment_compound": 0.6207
        },
        {
            "id": "hfhwcmi",
            "score": 1,
            "text": "I wondered why doctors and pharmacists never aspirated the needle.... We did it EVERY time in the veterinary field. Damn.",
            "title_similarity": "0.40606165",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hfhwua2",
            "score": 1,
            "text": "In my 32 years of practice I have only drawn back and saw blood once so I believe this occurrence is pretty rare.",
            "title_similarity": "0.44751236",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hfhwvdh",
            "score": 1,
            "text": "This isn't an aspiration issue it's placement. Rotator cuff injuries from going too high and hitting veins when we can pretty reliably at where they will be",
            "title_similarity": "0.5545744",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hfhwznz",
            "score": 1,
            "text": "When I was 12-14 yo and my father explained me intramuscular injections, aspirating the needle was the first thing he explained me. I am baffled that any professional wouldn’t do that check",
            "title_similarity": "0.51981676",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhxdla",
            "score": 1,
            "text": "Hey this happened to me! I did have a serious adverse reaction on my initial injection and most symptoms looked like an allergic reaction but the feeling of it circulating in my system like the MRI dye and concentrating in my chest lead the nurses to the conclusion that it must have hit a capillary. Hitting a vein is very rare, almost impossible with intramuscular deltoid injections but capillaries are the more likely culprit.",
            "title_similarity": "0.7526065",
            "sentiment_compound": 0.5681
        },
        {
            "id": "hfhxnc3",
            "score": 1,
            "text": "Is this why my hurt for a week?",
            "title_similarity": "0.20453116",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hfhxnx8",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.06758888"
        },
        {
            "id": "hfhxvbs",
            "score": 1,
            "text": "Makes sense ... Thank you",
            "title_similarity": "0.030001298",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfhyhst",
            "score": 1,
            "text": "I Inject weekly and hitting a vein is so rare that it hasn’t happened to me yet.",
            "title_similarity": "0.3313849",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhyjqe",
            "score": 1,
            "text": "There seems to be a lot of experienced shot givers on this thread. Where do you recommend someone going to get the vaccine by an experienced shot giver? As a child I had a nurse break the needle off in my arm and have gone into panic mode any time I need a shot. I’m not against the vaccine and actively want to get it, I just have a huge fear of the actual shot process.",
            "title_similarity": "0.68008876",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hfhyyyq",
            "score": 1,
            "text": "They didn't do this for Biden booster shot in the media stage they showed.",
            "title_similarity": "0.3876075",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfhzc5c",
            "score": 1,
            "text": "Interesting. Then in theory if someone bleeds a bit after injection its likely it hit a vein. When I hadf my jab I did not have any blood whatsoever. Wonder if thats a good indicator no vein was hit.",
            "title_similarity": "0.6073499",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hfhzfmc",
            "score": 1,
            "text": "I drove to 10 different vaccination sites asking for someone who would aspirate but nobody would. Decided to get my booster anyway but wasn’t happy about it.",
            "title_similarity": "0.5226798",
            "sentiment_compound": 0.7227
        },
        {
            "id": "hfhzinn",
            "score": 1,
            "text": "Even when you aspirate the syringe, you always have a very good chance to knick a vessel when pulling the needle out of the injection area.",
            "title_similarity": "0.46944335",
            "sentiment_compound": 0.6674
        },
        {
            "id": "hfi0cia",
            "score": 1,
            "text": "They probably should have been injecting the vaccine in the thigh.also I believe it actually says on the instructions how to deliver it to deliver in the muscle and not in a blood vessel.",
            "title_similarity": "0.68512535",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi0sxp",
            "score": 1,
            "text": "I think I've seen Dr Campbell on YT advocating this for a year now. I asked for it when I went to get my two shots- the first time they said ok (but I really don't know if they did it or not, it was fast) and the second time they told me they wouldn't do it. Curiously, the first time I had a little blood into the bandaid after and second time I didn't.  \nVery little vaccine side effects for me though, just shoulder pain and that's it.",
            "title_similarity": "0.5876759",
            "sentiment_compound": -0.5927
        },
        {
            "id": "hfi0ut5",
            "score": 1,
            "text": "Is there a better way to deliver Vaccines that we aren't practicing yet? Like is one big fat dose all in one spot the most beneficial?  \n\nWhat about a sort of patch with micro abrasive or micro needles that you just kind of slap on and leave on for 5 or 10 mins which delivers the dose?  \n\nDoes it need to go really deep into the muscle to be effective?",
            "title_similarity": "0.6705951",
            "sentiment_compound": 0.8462
        },
        {
            "id": "hfi0xgq",
            "score": 1,
            "text": "dude, didn't even know there was an IV one",
            "title_similarity": "0.35565615",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi0yt7",
            "score": 1,
            "text": "I suspected that this may be a realistic possibility. I wonder if that not only explains adverse reactions, but I wonder if it affects the ability to create spike protein for your immune system to recognize. \n\nI wonder if something like an mRNA vaccine would break down before it could make its way to a cell that could reliably make spike protein...or is the problem that the spike protein is being made in high concentrations in the blood, so rather than being concentrated in a muscle cell for your immune system to do its thing, it instead is all over, including the heart, where the immune system attacks, thus giving an inflammatory response.\n\nAlso - has this been studied in other conventional vaccines?",
            "title_similarity": "0.75396806",
            "sentiment_compound": 0.9575
        },
        {
            "id": "hfi181j",
            "score": 1,
            "text": "That's actually pretty interesting",
            "title_similarity": "0.10667435",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hfi19ni",
            "score": 1,
            "text": "Needle aspiration is unreliable.",
            "title_similarity": "0.3396303",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi19nr",
            "score": 1,
            "text": "My second shot (many months ago) bled, needed pressure on it for a few seconds to stop. Should I be worried?",
            "title_similarity": "0.4994177",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hfi1rdl",
            "score": 1,
            "text": "If you bleed after the shot, does it necessarily mean they hit a vein?\n\nEdit:  thanks for the answers!  I bled for a few minutes from the third shot a couple months ago.  Didn’t think twice about it then, and there were no complications.  I love learning :)",
            "title_similarity": "0.53395045",
            "sentiment_compound": 0.8478
        },
        {
            "id": "hfi21k7",
            "score": 1,
            "text": "What's the IM injection site with the least likelihood of this occurring?",
            "title_similarity": "0.45545137",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi2xgl",
            "score": 1,
            "text": "Wouldn't this be a side effect of all IM injections then?",
            "title_similarity": "0.65051496",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi36mj",
            "score": 1,
            "text": "Pharmacist hit a vein or blood vessel when I had my vax. The injection site wouldn’t stop bleeding…. it was slightly disconcerting.",
            "title_similarity": "0.73984575",
            "sentiment_compound": -0.296
        },
        {
            "id": "hfi3jyf",
            "score": 2,
            "text": "I may be misremembering some details, but I remember watching a video a while back of a British doctor calling out some British health expert or some health department because they said there was no risk of this happening at all. And then he pulled out his textbook from medical school and literally showed the vein where it was. If someone could find that video it would be nice, it was a while back.",
            "title_similarity": "0.6290162",
            "sentiment_compound": 0.7114
        },
        {
            "id": "hfi3q3v",
            "score": 1,
            "text": "we pretty much always do this but I have noticed some administer it without doing this.",
            "title_similarity": "0.31507075",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hfi4kyp",
            "score": 1,
            "text": "Isn’t this generally best practice?",
            "title_similarity": "0.17006972",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hfi4snc",
            "score": 1,
            "text": "This came out right after project veritas video on pfizer, sus.",
            "title_similarity": "0.2938097",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi5c8f",
            "score": 1,
            "text": "I work in the veterinary field and it is standard and expected to aspirate prior to giving ANY kind of injection. I’m honestly shocked this is not the same in human medicine.",
            "title_similarity": "0.54004407",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hfi6o5q",
            "score": 1,
            "text": "good nurses are important - hopefully few people suffer",
            "title_similarity": "0.4636527",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfi6t6w",
            "score": 1,
            "text": "While I am vaccinated and believe everyone over 18 should take the jab, this document and other science based articles detailing the potential, albeit low, dangers of vaccination do give some credence to those who aren’t comfortable getting vaccinated.\n\nWe have become too quick to chastise these people.",
            "title_similarity": "0.7103605",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hfi6vqw",
            "score": 1,
            "text": "i always thought everything eventually went into the bloodstream. how else is the medicine suppose to get to the right place?",
            "title_similarity": "0.4577401",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi7cs4",
            "score": 1,
            "text": "I'm surprised this isn't more common advice in the medical field. I take an injectable medication that can produce major problems if introduced directly into the bloodstream, aspiration is always step one once that needle is in the target zone. \n\nI imagine a LOT of IM medications have similar troubles if injected into a bloodstream.",
            "title_similarity": "0.72576904",
            "sentiment_compound": -0.624
        },
        {
            "id": "hfi7nhg",
            "score": 1,
            "text": "Okay, I was only an EMT-Basic, but who the hell isn't taught to aspirate the needle before injection? \n\nThat is standard practice, everyone is supposed to do it, unless you're using an autoinjector.",
            "title_similarity": "0.5333392",
            "sentiment_compound": -0.7876
        },
        {
            "id": "hfi7nla",
            "score": 1,
            "text": "This article reminded me how much I hate animal testing, how pervasive it is, and terrifying it must be for the animals.",
            "title_similarity": "0.43652433",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hfi8b8y",
            "score": 1,
            "text": "Always gotta pull back a bit to check before you push",
            "title_similarity": "0.35889894",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi8c6q",
            "score": 1,
            "text": "Well, three different nurses spent about an hour and a half trying to hit my veins on purpose the last time I needed an IV so my chances are looking good",
            "title_similarity": "0.5027618",
            "sentiment_compound": 0.7251
        },
        {
            "id": "hfi8ndq",
            "score": 1,
            "text": "Interesting. In nursing school, in nursing school only five years ago I was taught needle aspiration is outdated and not evidence based. \n\nI love that science is about learning and changing methods based on new knowledge.",
            "title_similarity": "0.5327591",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hfi96sl",
            "score": 1,
            "text": "Get bigger muscles u wimps",
            "title_similarity": "0.05637509",
            "sentiment_compound": -0.25
        },
        {
            "id": "hfi9cfe",
            "score": 1,
            "text": "I'm a nurse and I don't know if my education was old (graduated 2009) or not but I thought all IM injections were supposed to be aspirated because of that - you hit a vein and suddenly your IM is now an IV push. I've gotten IM shots over the years from different places and providers and not everyone aspirates.",
            "title_similarity": "0.6030201",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfi9m4k",
            "score": 1,
            "text": "They don’t do this every time? I was a veterinary nurse, and you do it every single injection.",
            "title_similarity": "0.3446324",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfic39r",
            "score": 1,
            "text": "So this explains the heart problems I had post Moderna….",
            "title_similarity": "0.46647346",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfidjig",
            "score": 1,
            "text": "I’ve been IM in my thigh for over 6 years and aspirate every time and have never seen blood.",
            "title_similarity": "0.2353356",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfiei56",
            "score": 1,
            "text": "Fun fact, if you take testosterone as an IM injection and push it into a vein you’ll know when you have a violent coughing fit pretty immediately as the oil suspending the T clogs up your lungs. \n\nUsually not fatal.",
            "title_similarity": "0.63104606",
            "sentiment_compound": 0.7876
        },
        {
            "id": "hfieq5d",
            "score": 1,
            "text": "I don’t know if this fits here, but this report from Pfizer tracked where the lipid nano particle ended up travelling and congregating over a 48hour period after intramuscular injection.\n\n[link](https://i.imgur.com/abYlR1J.png)",
            "title_similarity": "0.56323326",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfieqht",
            "score": 1,
            "text": "We do that with animals before giving a vaccination I’m surprised it doesn’t really travel into human medicine.",
            "title_similarity": "0.6106263",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hfifjwf",
            "score": 1,
            "text": "Wow what a misleading title:\n\"This study provided in-vivo evidence that inadvertent intravenous injection of COVID-19 mRNA-vaccines may induce myopericarditis.\"\n\nIs completely different than what you said.",
            "title_similarity": "0.78099227",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hfifo95",
            "score": 1,
            "text": "So, to a layman, this would mean that when injected correctly; ergo not into a vein, the covid vaccine is largely safe, allergies notwithstanding.",
            "title_similarity": "0.6278302",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfigutv",
            "score": 1,
            "text": "As someone who pins daily, I am told not to aspirate: its a old technique. It can cause more harm to you by aspirating then not and hitting a vein.",
            "title_similarity": "0.5915245",
            "sentiment_compound": -0.5849
        },
        {
            "id": "hfigxer",
            "score": 1,
            "text": "Here I am learning they don’t want a vein. I know they don’t check for a being, like with a blood draw, but I assumed it made its way into the blood through the muscle. So they just want the vaccine in the tissue? Why is that?",
            "title_similarity": "0.69324934",
            "sentiment_compound": 0.4776
        },
        {
            "id": "hfih25e",
            "score": 1,
            "text": "Well, Tha m you for giving the anti vaxxers a reason for not getting the shot",
            "title_similarity": "0.55667937",
            "sentiment_compound": 0.296
        },
        {
            "id": "hfihh9o",
            "score": 1,
            "text": "What ever happened to those air gun thingies they used back in the day?",
            "title_similarity": "0.3836245",
            "sentiment_compound": -0.34
        },
        {
            "id": "hfihksa",
            "score": 1,
            "text": "I asked my doctor if I need to aspirate when doing IM test c, but he said no.",
            "title_similarity": "0.56336844",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfihy7o",
            "score": 1,
            "text": "I’m a vet and I aspirate before every injection. I have never once seen a human healthcare professional do this.",
            "title_similarity": "0.27970985",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfiiklw",
            "score": 1,
            "text": "Damnit! I’ve been saying not one person on tv is pulling back the plunger to check before injecting. That is nursing 101 and taught to absolutely everyone giving injections. Come on people!",
            "title_similarity": "0.47391728",
            "sentiment_compound": -0.3195
        },
        {
            "id": "hfiiuta",
            "score": 1,
            "text": "Hm, when I got my first dose I'm pretty sure they hit a vein.  So much blood spurted out that it ruined my shirt.  The bruise on my shoulder was so bad the nurse noticed it three weeks later when I was getting my second dose.  \n\nNo adverse effects though -- not even the mild ones -- from either dose.",
            "title_similarity": "0.58148587",
            "sentiment_compound": -0.2456
        },
        {
            "id": "hfij21z",
            "score": 1,
            "text": "I've done this with trenbalone acetate. I thought I was gonna die.",
            "title_similarity": "0.49650714",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hfijli6",
            "score": 1,
            "text": "1- I have to self Inject and do this every time \n\n2-would thigh injections make it easier to avoid this outcome?",
            "title_similarity": "0.58160615",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hfijmts",
            "score": 1,
            "text": "That is why they need pull plunger before pushing in.",
            "title_similarity": "0.375642",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfijwcv",
            "score": 1,
            "text": "I really hope this is true.",
            "title_similarity": "0.10984671",
            "sentiment_compound": 0.7178
        },
        {
            "id": "hfik29x",
            "score": 1,
            "text": "Before you could actually give that advice, you’d have to do a study where you group gets aspirated and the other isn’t and then compare the frequency of adverse events between the two groups.",
            "title_similarity": "0.60872066",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hfikg3d",
            "score": 1,
            "text": "Is this a common thing for nurses and medical staff to not aspirate? I'm a vet nurse and they drill it in HARD to staff to always aspirate when we do injections.",
            "title_similarity": "0.5785798",
            "sentiment_compound": -0.2808
        },
        {
            "id": "hfikve4",
            "score": 1,
            "text": "Could this also explain adverse reactions to other IM injections?",
            "title_similarity": "0.6742519",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hfimd5k",
            "score": 1,
            "text": "Literally taught this in nursing school. Most things shouldn’t be injected into bloodstream",
            "title_similarity": "0.5565561",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfimes2",
            "score": 1,
            "text": "Vaccinations arent suppose to go into the bloodstream?",
            "title_similarity": "0.5095862",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfimh5y",
            "score": 1,
            "text": "I want my hypospray now, damnit!",
            "title_similarity": "0.3592469",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hfimi7r",
            "score": 1,
            "text": "This is how it should be done. \n\nNow if only the nhs's green book didn't instruct otherwise. \n\nit literally says not to do that.\n\nI reckon it was a burocratic choice ( time vs risk factor ), in favour of saving time.\n\nWell, let's hope nhs revisit their regulations",
            "title_similarity": "0.55084",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hfimio9",
            "score": 1,
            "text": "I am self-injecting Copaxone for MS subcutaneously and it is a well-known effect that if you hit a large enough blood vessel and the medicine gets into bloodstream, you may get an immediate systemic reaction - which is not dangerous, but it's reportedly quite scary. For some reason it has never happened to me but now I think I have been \"aspirating\" unknowingly as I tend to always adjust the needle a bit before injecting.",
            "title_similarity": "0.76053125",
            "sentiment_compound": -0.6076
        },
        {
            "id": "hfimpbb",
            "score": 1,
            "text": "And this ladies and gentlemen is why I DO NOT LIKE NEEDLES...",
            "title_similarity": "0.4596792",
            "sentiment_compound": -0.3924
        },
        {
            "id": "hfimpz7",
            "score": 1,
            "text": "Can this explain the disproportionate amount of young males among patients with myo/pericarditis?",
            "title_similarity": "0.45787007",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfimvoe",
            "score": 1,
            "text": "Are they not supposed to get into the bloodstream? I thought that's how these things worked.",
            "title_similarity": "0.5630293",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfimzlv",
            "score": 1,
            "text": "If it hurts a lot afterwards it means it hit went into the muscle rather than the vein?",
            "title_similarity": "0.5183767",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hfin6x1",
            "score": 1,
            "text": "Oh so that was what she was doing… glad to know I had a competent nurse",
            "title_similarity": "0.29413372",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hfinjok",
            "score": 1,
            "text": "Interesting theory, but it still doesn’t explain why the primary affected age group of mycorditis is adolescent males",
            "title_similarity": "0.41574502",
            "sentiment_compound": -0.0129
        },
        {
            "id": "hfinvha",
            "score": 1,
            "text": "Wait, when we give IM shots to horses, we pull back to make sure no blood comes back for this reason. Do they do this with people as well to avoid this? I never watch when I get a shot so I have no idea.",
            "title_similarity": "0.5457256",
            "sentiment_compound": -0.3535
        },
        {
            "id": "hfinzka",
            "score": 1,
            "text": "I'm in the nursing program currently and we're learning about injections.",
            "title_similarity": "0.4488876",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfioo2l",
            "score": 1,
            "text": "This can happen with any injection",
            "title_similarity": "0.13084768",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfip0no",
            "score": 1,
            "text": "Wouldn’t this be the case for any vaccine, not just the COVID vaccine?",
            "title_similarity": "0.5525671",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfip5v4",
            "score": 1,
            "text": "I assumed this was still standard practice in the UK.",
            "title_similarity": "0.1898671",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfipemw",
            "score": 1,
            "text": "Aspiration is the most basic thing taught to anyone training to do ANY IM or SQ injection. If they're not doing it they are negligent and should be corrected immediately. There are some medication that should NOT EVER be injected into a vein or artery.",
            "title_similarity": "0.6073402",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfipr7b",
            "score": 1,
            "text": "Interesting theory.\n\nI've heard that the vaccine was supposed to stay in the muscle, but they found that it was entering the bloodstream sometimes. Accidentally hitting a vein would certainly explain how it got there.",
            "title_similarity": "0.7969817",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hfipskz",
            "score": 1,
            "text": "Maybe these injections would go better if the people giving them had, you know, medical training.\n\nThis is literally the FIRST THING you are taught when you are taught about giving injections. There she be literally ZERO instances of this ever happening in the real world.",
            "title_similarity": "0.5462661",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hfiqfan",
            "score": 1,
            "text": "I hate anti-vaxxers, and I shouldn’t. Because they’re just stupid. And nothing is morally wrong with being stupid. But being WILLFULLY IGNORANT is a completely different story.",
            "title_similarity": "0.45134574",
            "sentiment_compound": -0.8282
        },
        {
            "id": "hfiqlxa",
            "score": 1,
            "text": "But I was told this isn’t possible. Okay. At least we have more information as we go along. This is useful.",
            "title_similarity": "0.31752592",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hfiqrmn",
            "score": 1,
            "text": "Got damn it. Did they not know this before. Seems obvious to me.",
            "title_similarity": "0.18680683",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hfirjjk",
            "score": 1,
            "text": "Paramedic here. When you do an IM injection, any IM injection, you're always supposed to pull back on the plunger (aspirate) to see if you get blood return, as it's a sign you've inadvertantly gone into a blood vessel. If people had been doing it right all along, this wouldn't have been a problem.",
            "title_similarity": "0.7157668",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hfirmbh",
            "score": 1,
            "text": "This should have been known before the vaccine was approved for human use.",
            "title_similarity": "0.49433434",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hfirsl9",
            "score": 1,
            "text": "17 years ago when I was working as a veterinarian/kennel technician was when I learned about pulling back on the syringe before an injection.\n\nI nearly died from fear when I realized they aren't doing that in common practice anymore and thanked my bulky deltoids for potentially protecting me.",
            "title_similarity": "0.65504944",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hfis0fv",
            "score": 1,
            "text": "You know what infuriates me? The conclusion is something really easy that any nurse could do but I'm pretty sure that in my country (canada) nobody care enough to tell this detail to the healthcare workers working in vaccine centers. Now, after reading the  conclusion of this study, I have irrational anxiety that I'm going to be the unlucky one who gets shot in a vein when I get a booster.",
            "title_similarity": "0.6388523",
            "sentiment_compound": 0.8018
        },
        {
            "id": "hfis29i",
            "score": 1,
            "text": "Nurses are taught to pull back the plunger of a syringe before administering the med, if you see blood you don't inject, you discard.  In my 28 years as a Registered Nurse I've had it happen once.  Even with a subcu injection I'll do it.",
            "title_similarity": "0.6240133",
            "sentiment_compound": 0.1877
        },
        {
            "id": "hfis5pc",
            "score": 1,
            "text": "So there is no way it gets into the blood stream even if they don’t initially hit a vein?",
            "title_similarity": "0.43821558",
            "sentiment_compound": -0.3535
        },
        {
            "id": "hfit6e8",
            "score": 1,
            "text": "Vaccine Koolaid bad, good to know.",
            "title_similarity": "0.52478683",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hfiufmk",
            "score": 1,
            "text": "They hit a vein when they did my first dose a few months ago. Lots of blood. Any medics here? Do I need to be worried?",
            "title_similarity": "0.56976724",
            "sentiment_compound": -0.3736
        },
        {
            "id": "hfivh1x",
            "score": 1,
            "text": "On my 2nd shot the guy said he hit a vein.  I didn't have any adverse reactions.",
            "title_similarity": "0.41795713",
            "sentiment_compound": 0.2755
        },
        {
            "id": "hfivzrk",
            "score": 1,
            "text": "Ok, I know the term \"aspirate\" in the context of inhaling something you're not supposed to. I had no idea, until now, that the term has other applications as well and by golly I wish I'd known that before reading this title.",
            "title_similarity": "0.5378703",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hfiw17w",
            "score": 1,
            "text": "A reason to replace needles with microneedle patches for vaccines, they hurt less and can't hit any large veins.",
            "title_similarity": "0.66086155",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hfiw35v",
            "score": 1,
            "text": "I'll be honest, I have never considered the administration of an IM injection withotu the needle aspiration happening as it is unsafe on whatever you are trying to inject given the risk of going intravenously.\n\nAre we considering that people are appropriately trained on how to administer an IM injection?(speaking in the UK at least)",
            "title_similarity": "0.6683804",
            "sentiment_compound": 0.296
        },
        {
            "id": "hfiw3th",
            "score": 1,
            "text": "I do daily intramuscular injections for trt. Thousands of injections with no aspiration and I've never injected into a vein. My doctor explained it one time that the likelihood of completing an injection at that angle and managing to stay inside the vein is very very difficult to do.",
            "title_similarity": "0.4447824",
            "sentiment_compound": -0.6453
        },
        {
            "id": "hfiwxq3",
            "score": 2,
            "text": "I decided to bite the bullet and go in to get my first AZ jab 2 months ago after having read something similar. I brought it up with the doctor while waiting for my needle and she was nice enough to talk me through the process while she was doing it. I didn't die.",
            "title_similarity": "0.57537985",
            "sentiment_compound": 0.7137
        },
        {
            "id": "hfix3j5",
            "score": 1,
            "text": "IV injections are so unlikely in the deltoid muscle and aspiration is an outdated technique. If there’s bleeding it’s likely you are hitting blood vessels, when you poke someone with a needle, you might have someone bleed. If someone is having a cardiac reaction to this vaccine, it’s unlikely it’s the method.",
            "title_similarity": "0.7489536",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfixj7x",
            "score": 1,
            "text": "I dont get it. I thought the purpose of vaccines was to get into the bloodstream? Also if this happens with covid vaccines for sure it can happen with other vaccines. What are the consequences of injecting for ex. Tetanus vax into a vein?",
            "title_similarity": "0.7863133",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hfiypal",
            "score": 1,
            "text": "\"In mice\" AKA \"in humans\"",
            "title_similarity": "0.3879513",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfiyyf5",
            "score": 1,
            "text": "I always thought this was a likely potential cause of the astra zenica blood clotting",
            "title_similarity": "0.449612",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfizew0",
            "score": 1,
            "text": "I think this happened to me, not with the covid vaccine, but with a testosterone shot. My lungs got fucked up almosy instantly, like while the nurse was still injecting. It's a slow injection, you gotta do it over several minutes, but it can't have been more than a minute before i felt it. I started coughing uncontrollably, like I couldn't stop.\n\n I'm sure some of that oily testosterone hitched a ride in a vein and got to my lungs.",
            "title_similarity": "0.61778724",
            "sentiment_compound": -0.6074
        },
        {
            "id": "hfizjxr",
            "score": 1,
            "text": "They warn us of that when we get injections (trans hormone therapy).",
            "title_similarity": "0.5753975",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hfizs3y",
            "score": 1,
            "text": "The way to prevent that is after inserting the needle, but before depressing the plunger, pull back on the plunger to see if it returns blood. If it does, do not inject. move to another location and repeat. people giving covid vaccine injections should be trained to know this.",
            "title_similarity": "0.74113137",
            "sentiment_compound": -0.0644
        },
        {
            "id": "hfj0ifa",
            "score": 1,
            "text": "Always aspirate. There’s been a few times where if I had just straight injected I would’ve hit veins during IM injections. It’s safety precaution that takes just a moment to do.",
            "title_similarity": "0.6830917",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hfj3xv3",
            "score": 1,
            "text": "Yea I do this every time I shoot my testosterone.",
            "title_similarity": "0.08008539",
            "sentiment_compound": -0.34
        },
        {
            "id": "hfj4g6u",
            "score": 1,
            "text": "This should always be done. Has anyone watched Dr. Campbell, a British doctor? Very informative and seemingly non-bias",
            "title_similarity": "0.3688218",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfj59m8",
            "score": 1,
            "text": "Aspirating the needle is LITERALLY one of the steps. This is a user error.",
            "title_similarity": "0.5533782",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hfj5y4i",
            "score": 1,
            "text": "Does anyone know if this is also applies to testosterone Injections? If you hit a vein and inject testosterone into the bloodstream. Could this cause adverse effects? Or would your body metabolize the testosterone much quicker and done?",
            "title_similarity": "0.5552268",
            "sentiment_compound": -0.466
        },
        {
            "id": "hfj6cgd",
            "score": 1,
            "text": "Vet nurse here. That’s standard practice in animal medicine. Surprised it’s not in human med",
            "title_similarity": "0.5422929",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hfj6gn0",
            "score": 1,
            "text": "Imagine being a doctor and not knowing you need aspiration with intramuscular injections",
            "title_similarity": "0.6271381",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfj6q1c",
            "score": 1,
            "text": "Why has this taken so long this was proposed on Dr John Campbell a YouTube creator and nhs of England general practice doctor channel months a go.\n\nI don't remember exactly go check his channel out \n\nbut I believe it was the virus the mrna vaccine is put in to (which is completely harmless) unless there's a way it can transfer from where it's supposed to be and dump straight in to the vain.\n\nApparently there is scientific data that shows in mice the virus alone that is used to transfer vaccine is injected it caused stroke and death.\n\nPlease check out his channel for the correct information I do believe this is but im a random on Reddit like all of us",
            "title_similarity": "0.75574744",
            "sentiment_compound": -0.6663
        },
        {
            "id": "hfj7n75",
            "score": 1,
            "text": "This used to be taught as the proper way to give shots in the muscles but then the recommendation was dropped in many countries because it was so rare. However, the rare occurrences add up when you are attempting to  vaccinate the whole population.",
            "title_similarity": "0.68666697",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfj89v3",
            "score": 1,
            "text": "I bleed almost every time I get a shot!",
            "title_similarity": "0.28083575",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfj8tx5",
            "score": 1,
            "text": "Dr John was saying this month's ago on YouTube....",
            "title_similarity": "0.2362056",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfj8uch",
            "score": 1,
            "text": "Study shows?\n\nSeems like this study should have been seen way earlier before a billion+ shots were injected.",
            "title_similarity": "0.4263543",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfj8vfr",
            "score": 1,
            "text": "Isn't this the reason why my pfizer shot was a tiny tiny needle? I think it was only a cm in length.",
            "title_similarity": "0.41097212",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfj9kvu",
            "score": 1,
            "text": "I wonder if there is an equivalent for hitting the nerve or close to the nerve.  I have had pain and numbness in that darn nerve that runs near the injection site since.  A month after the injection started having pain very similar to when I first got the injection.  Went away for a few weeks then came back with a vengeance complete with numbness all the way down to my thumb.  I can't help but wonder if all the foreign junk the vaccine induced my body to produce didn't cause some kind of inflammatory response.",
            "title_similarity": "0.61497116",
            "sentiment_compound": -0.7209
        },
        {
            "id": "hfja6oa",
            "score": 1,
            "text": "I did this once with a testosterone injection.  Apparently the brand I used was alcohol based.  Instantly drunk for a couple hours.",
            "title_similarity": "0.36642593",
            "sentiment_compound": -0.34
        },
        {
            "id": "hfjb01m",
            "score": 1,
            "text": "Keep trying to explain why they’re forcing a dangerous product",
            "title_similarity": "0.4768359",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hfjbjtj",
            "score": 1,
            "text": "I've been on TRT for 16 years now and aspirate every time I inject IM. I've only drawn back blood twice, but boy it would have sucked to have IV'd oil!",
            "title_similarity": "0.48851255",
            "sentiment_compound": -0.6476
        },
        {
            "id": "hfjc48i",
            "score": 1,
            "text": "It’s not common to aspirate in this area, most nursing schools including my own taught to only aspirate on the glut site. It’s good practice to do it anyway but I don’t blame the nurses for not aspirating as it’s not common practice nor recommended by the CDC.",
            "title_similarity": "0.59523803",
            "sentiment_compound": -0.4657
        },
        {
            "id": "hfjd87h",
            "score": 1,
            "text": "**THANK YOU** for putting the important caveat in the Reddit headline. The journal article title does *not* make this clear.",
            "title_similarity": "0.52315694",
            "sentiment_compound": 0.7925
        },
        {
            "id": "hfjdfmh",
            "score": 1,
            "text": "they got 500 times the recommended dose... of course it caused problems",
            "title_similarity": "0.32654744",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hfjdhms",
            "score": 1,
            "text": "How does this study compare to the n=6million study showing that the mRNA vaccines don't have severe side effects? I'm hoping someone else recalls the details of that study, I just scrolled past the headline this morning.",
            "title_similarity": "0.6285463",
            "sentiment_compound": 0.6103
        },
        {
            "id": "hfjdjws",
            "score": 1,
            "text": "35 years of I/M inj as a psyche nurse and always did the ‘drawback’ , seems some staff need to be educated",
            "title_similarity": "0.38541186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjdnpo",
            "score": 1,
            "text": "This is news?\n\nI thought in the 80 year history of modern vaccines we would know this?",
            "title_similarity": "0.40022457",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjdntk",
            "score": 1,
            "text": "other than nurses,\nand even among nurses,\nmany health professionals administer IM injections inappropriately.",
            "title_similarity": "0.6233239",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjee3z",
            "score": 1,
            "text": "I do injections into the leg once a week. I would think anyway does this.\n\nHaven't ever \"hit\" a vein technically but I knocked one pulling the needle out. Didn't hurt but a lot of blood drained out for a bit.",
            "title_similarity": "0.52742594",
            "sentiment_compound": 0.1063
        },
        {
            "id": "hfjep08",
            "score": 1,
            "text": "Would happen less if injections were done in ventral glute",
            "title_similarity": "0.51100457",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjfrqw",
            "score": 1,
            "text": "Had to aspirate with allergy shots. You get to eat a sheet cake if you hit a vein with Insulin.",
            "title_similarity": "0.6176138",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjg3jr",
            "score": 1,
            "text": "This is the cause of any intermuscular shot but aspiration is no longer a thing with injections. Some ppl still do them but it's recommended not to for some reason.",
            "title_similarity": "0.6218599",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hfjgeh7",
            "score": 2,
            "text": "I’m in animal medicine and I know this. Isn’t this like a 101 level tidbit?",
            "title_similarity": "0.38888663",
            "sentiment_compound": 0.4357
        },
        {
            "id": "hfjgkig",
            "score": 1,
            "text": "Out of curiosity, has there been any examination of the muscle development of adolescent males when it comes to deltoid muscles…?",
            "title_similarity": "0.3501441",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjhuzy",
            "score": 1,
            "text": "Sorry I'm a bit confused -- the vaccine is *not* supposed to be injected into a vein? I thought it was supposed to go into the bloodstream?",
            "title_similarity": "0.6644653",
            "sentiment_compound": -0.4515
        },
        {
            "id": "hfjimxc",
            "score": 1,
            "text": "Needle aspiration is taught as part of the technique for giving IM injections. That’s not new information, I learned about it thirty years ago in paramedic school.",
            "title_similarity": "0.50358707",
            "sentiment_compound": 0.34
        },
        {
            "id": "hfjivmc",
            "score": 1,
            "text": "does it make the vaccine less effective if they hit a vein ?",
            "title_similarity": "0.70553195",
            "sentiment_compound": 0.4228
        },
        {
            "id": "hfjixlv",
            "score": 1,
            "text": "Sorry I’m super lazy. What is a “solid link?” What was the association?",
            "title_similarity": "0.28574306",
            "sentiment_compound": 0.3527
        },
        {
            "id": "hfjjcnd",
            "score": 1,
            "text": "I learned to aspirate in nursing school.  And moved away from aspiration in the 2010s because best practice indicated the risk for tissue damage and trauma Aoutweighed the risk of hitting a vein, with proper IM placement. Aspirating during injections was really hard to stop.  Like not testing Foley balloon by inflating before insertion is no longer recommended.  Things change as we learn more, even things that make sense.",
            "title_similarity": "0.7061299",
            "sentiment_compound": -0.8151
        },
        {
            "id": "hfjkd57",
            "score": 2,
            "text": "So does this mean we should inject the vaccine into the ass to reduce the chances of this?",
            "title_similarity": "0.69424856",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hfjkemo",
            "score": 2,
            "text": "As someone who does weekly intramuscular injections, thanks for reminding me (also aaaaaaa)",
            "title_similarity": "0.38878065",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfjl61b",
            "score": 2,
            "text": "Yeah I do this for all my subcutaneous injections.",
            "title_similarity": "0.28401145",
            "sentiment_compound": 0.296
        },
        {
            "id": "hfjm67r",
            "score": 1,
            "text": "I remember when I got my 2nd vaccine, as the needle went in right at the end it felt like it \"thunked\" and my arm tensed up and if hurt like hell. My arm felt weird and sore for ages afterwards, I wonder if they hit a nerve or something?\n\nI know it's not completely relevant to the topic but still, I guess I'm curious anyone knows what the feeling may have been.",
            "title_similarity": "0.6357258",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hfjmngd",
            "score": 1,
            "text": "You need large superficial veins and an IV inserted at nearly the same angle the vein runs to get access into a vein. An IM injection with a much smaller needle at ninety degrees means that you would have to not only hit a vein,  but you would have to stop EXACTLY on a large enough vein to only puncture one part of the vein wall and not another. \n\nGive nurses who are exceptional at starting IVs the same size needle and tell them to inject an IV medication into an unaccessed vein at ninety degrees and see just how impossible it is.",
            "title_similarity": "0.6849289",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hfjmtt3",
            "score": 1,
            "text": "There's a lot of vaccine pictures and video clips out there that show improper technique. To give an IM injection one has the squeeze and pull the portion of the muscle, then inject. I see a lot of injections that look like timid subcutaneous (SQ) injections. Just saying...",
            "title_similarity": "0.71820897",
            "sentiment_compound": 0.128
        },
        {
            "id": "hfjn77n",
            "score": 1,
            "text": "Good to know thanks. \nI don’t like to watch injections, but I’ll be sure to ask in the future and monitor",
            "title_similarity": "0.6008516",
            "sentiment_compound": 0.765
        },
        {
            "id": "hfjnhu6",
            "score": 2,
            "text": "If you drill a deep hole near the base of a tree, you’ll most likely hit a root. Our tissue vascular structure is no different. This is something that seems obvious & sensible, why did we ‘need statistics’ to confirm it?",
            "title_similarity": "0.41911203",
            "sentiment_compound": -0.296
        },
        {
            "id": "hfjnlgk",
            "score": 1,
            "text": "Rrrrrrrrriiiiiiiiiiiiiiigggggggghhhhhhhttttt",
            "title_similarity": "0.22497189",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjo2b8",
            "score": 2,
            "text": "From someone that knows a thing or two about injecting stuff intramuscular. You always pull the plunge and check for blood. When you pull it if it comes a bubble of air you're good to go. If you end up pulling blood then you might be hitting or have hit a vein, the recommendation is to try another spot. I wonder why they don't pull first on shoulder intramuscular. I don't remember any nurse ever doing that. Maybe they do.. Btw I'm 100% Pro vaccination. With or without aspiration.",
            "title_similarity": "0.640247",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfjoce5",
            "score": 1,
            "text": "Question: is aspirating a needle NOT common practice?\n\nIm not medical, don't have a higher ed degree, but was a K9 handler...we were always taught to aspirate IM injections to ensure we didn't hit a vein, as well as to aspirate IV catheters to ensure we did hit the vein.\n\nHow exactly is this common practice for basic veterinary training for people with barely a 2 year degree, but not technicians giving injections in people?",
            "title_similarity": "0.6850604",
            "sentiment_compound": 0.805
        },
        {
            "id": "hfjoel3",
            "score": 1,
            "text": "Not aspirating was recommended by the manufacturers so as to “cause less pain” according to a report by Jimmy Dore",
            "title_similarity": "0.5876553",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hfjofur",
            "score": 1,
            "text": "This is pretty much the standard way to give an IM injection. I'm having trouble imagining giving an injection without aspirating.",
            "title_similarity": "0.6428306",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfjoswi",
            "score": 1,
            "text": "Shouldn’t this have been obvious from the start?",
            "title_similarity": "0.105442554",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjoxlm",
            "score": 1,
            "text": "Does anyone have any information on taking the vaccine IM vs directly into the vein?\n\nI’m curious as to how that would change efficiency and side effects",
            "title_similarity": "0.7016963",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hfjp12b",
            "score": 1,
            "text": "Motherfucker. I hope I forget that accidentally getting an injection into my bloodstream is a possibility before I need a shot cuz shots are one of the few things I *don't* have anxiety about.",
            "title_similarity": "0.722692",
            "sentiment_compound": -0.6686
        },
        {
            "id": "hfjpkib",
            "score": 1,
            "text": "Has this ever been an issue with other vaccines?",
            "title_similarity": "0.49285495",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjpsnn",
            "score": 1,
            "text": "Following\n 6 Oct 2021",
            "title_similarity": "0.039203413",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjr2pa",
            "score": 1,
            "text": "Or just give the shot in the buttock or thigh…",
            "title_similarity": "0.25235495",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjr5yz",
            "score": 1,
            "text": "Can't have adverse reactions if you don't take the vaccine. It's big brain time.",
            "title_similarity": "0.589446",
            "sentiment_compound": 0.2755
        },
        {
            "id": "hfjrhag",
            "score": 1,
            "text": "Alternate suggestion: Make everyone pull down their pants and get the injection into their ass. Problem solved.",
            "title_similarity": "0.43998644",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hfjtlyi",
            "score": 1,
            "text": "Would this also be the case for botox in the masseter muscle?",
            "title_similarity": "0.56942695",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjufgm",
            "score": 1,
            "text": "Bwahahaha!  The moon is Swiss Cheese too.  Anything to avoid the truth.",
            "title_similarity": "0.42789817",
            "sentiment_compound": 0.1007
        },
        {
            "id": "hfjuj1c",
            "score": 1,
            "text": "Could this be one of those \"lets study it\" points the cautious vaxxers were questioning?",
            "title_similarity": "0.4738396",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hfjumsy",
            "score": 1,
            "text": "Yah \"rare adverse reactions\",so rare the Government set up \"VAERS\"",
            "title_similarity": "0.5647369",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hfjv3wq",
            "score": 1,
            "text": "This. Makes. So. Much. Sense.\n\nMy wife had an immediate reaction to her first dose.\n\nEdit-accidentally sent before finishing…\n\nAs soon as the nurse touched the plunger, she immediately said, something is wrong, i can taste it.\n\nShe thought she was going to pass out, and throw up at the same time. They took her back on the cot and monitored her for about 45 minutes, but she started feeling better and went home. No issues on the second shot.\n\nCrazy.",
            "title_similarity": "0.5705967",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hfjvbao",
            "score": 1,
            "text": "Keywords COULD EXPLAIN... they have no idea what's going on... This vaxxx will lower future population... soft kills",
            "title_similarity": "0.5016885",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hfjvd81",
            "score": 1,
            "text": "This does not hurt if anyones wondering",
            "title_similarity": "0.1576314",
            "sentiment_compound": 0.4168
        },
        {
            "id": "hfjvgj2",
            "score": 1,
            "text": "Soooo the news works but not my home.. hm",
            "title_similarity": "0.3707457",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjvtlr",
            "score": 1,
            "text": "Can someone about to be vaccinated request the professional aspirate them?",
            "title_similarity": "0.5136966",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjvvh3",
            "score": 1,
            "text": "You mean doing that thing we’re supposed to do before any injection.",
            "title_similarity": "0.3440784",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjvx4i",
            "score": 1,
            "text": "There are a few reasons why aspiration is not done.  The main one being that a nurse will inject into the muscle, (far from major blood vessels) so it is highly unlikely that they would be able to aspirate the needle correctly, resulting in more pain or discomfort for the patient.  Some other reasons are:  \n\n\n1. AD syringes (single-use syringes typically used for covid-19 vaccination) do not allow aspiration for the recommended 5-10 seconds.  This is by design, to eliminate possible contamination to the one administering the vaccine.\n2. Aspiration can result in wastage of the vaccine.\n3. Aspiration prolongs the time that the needle is inside the patient, thus increasing the pain experienced by the recipient.\n4. Given the size of the needle and the angle at which you inject the vaccine, it is difficult to enter a vessel without rupturing it and even more difficult to actually deliver the vaccine intravenously. \n5. It is more difficult to train to aspirate.  This could potentially reduce the speed at which covid-19 injects are given.\n\nTL;DR: It's difficult to mess up an IM injection but if they do, it is unlikely to cause any issues because they're injecting into mainly muscle.",
            "title_similarity": "0.77910686",
            "sentiment_compound": -0.8874
        },
        {
            "id": "hfjvzqu",
            "score": 1,
            "text": "It’s not recommended practice these days to aspirate a needle.",
            "title_similarity": "0.36775404",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hfjw87u",
            "score": 1,
            "text": "This is why I give myself most injections.  I learned how bad most people are at giving injections when a veterinarian was “training” the lab I was in, as an undergraduate, how to give rats different injections. I was compelled to intervene and give the rats injections, showing the vet how to do it (an old wise scientist taught me young)—for the sake of the rats.",
            "title_similarity": "0.643865",
            "sentiment_compound": 0.296
        },
        {
            "id": "hfjws70",
            "score": 1,
            "text": "It’s not needed current procedural methods of a deltoid IM injection are fine. If you hit a vein go play the lottery because the chance of you accidentally doing it is slim to none!",
            "title_similarity": "0.6288395",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hfjwvdm",
            "score": 2,
            "text": "I trained as a nurse\n\nFirst thing you are taught when giving an IM (intra muscular) injection is to draw back (aspirate) on the syringe before injecting.\nIf you draw back blood you are in a vein and you stop and start again with a new dose",
            "title_similarity": "0.5940983",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hfjx7cj",
            "score": 2,
            "text": "Any nurse knows to do this.",
            "title_similarity": "0.14937003",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjxao2",
            "score": 2,
            "text": "Just think of the amount of headache that could have been saved if aspirated the needle from the beginning with the Covid shots.",
            "title_similarity": "0.65957487",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hfjxe3m",
            "score": 1,
            "text": "I take insulin. Why can’t they just inject it in the fat of the arm vs the muscle.",
            "title_similarity": "0.5277388",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfjy86m",
            "score": 1,
            "text": "mods who are censoring people - you are going to regret picking the side youre on. mark my words. enjoy your power/money while it lasts.",
            "title_similarity": "0.4262852",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hfjz6pd",
            "score": 1,
            "text": "There is conflicting info regarding aspiration when administering IM injections so much so that some nursing schools have phased it out of curriculum while others haven’t. That’s why my instructors taught “a bit askew from center” (meaning based on anatomical landmarks avoid ‘dead center’ of a large muscle mass esp. in the legs). Pinpoint the center of a large muscle and move ½ of a hair left or right to avoid many nerve and blood vessel compartments. This is also know as “z-track method”. This allows for vaccines/medications to be absorbed into the bloodstream and keeps you from stabbing through nerves/vessels.\n\nTLDR: Studies have conflicting info about aspiration (pulling back on the plunger of the syringe) of IM injections. Avoid ‘dead center’ of muscles by using the z-track method.",
            "title_similarity": "0.78787947",
            "sentiment_compound": -0.875
        },
        {
            "id": "hfk005j",
            "score": 1,
            "text": "Not to mention muscular torsion can release material that is toxic to the body.",
            "title_similarity": "0.5467978",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfk0v1q",
            "score": 1,
            "text": "I doubt all of the cases were due to improperly trained staff",
            "title_similarity": "0.33611375",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hfk2mkc",
            "score": 1,
            "text": "Yeah I’m sure the lady at Safeway is taking great care of me when I go for my second jab",
            "title_similarity": "0.39238983",
            "sentiment_compound": 0.8957
        },
        {
            "id": "hfk313y",
            "score": 1,
            "text": "So does this phenomenon explain the J&J blood clotting issues too, maybe? Would seem to make sense?…",
            "title_similarity": "0.60970557",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfk3h2t",
            "score": 1,
            "text": "What can happen if your flu shot does this? I'm pretty sure mine did this year.",
            "title_similarity": "0.51656365",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfk4g9i",
            "score": 1,
            "text": "Anyone who ever experienced Tren cough either themselves or by proxy understands what is said in this article lolol.",
            "title_similarity": "0.29882312",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfk5du4",
            "score": 1,
            "text": "As a kid, my physician uncle would flushot the whole family every Thanksgiving. He would pull up the skin and create a \"bubble\" of the injection just under the skin that would get absorbed. Was this bad? Safer? Ineffective? Would it still work or did it only work with the old larger needles??\n\nIt definitely gave my sister a fear of needles.",
            "title_similarity": "0.62029094",
            "sentiment_compound": -0.4914
        },
        {
            "id": "hfk5wr9",
            "score": 1,
            "text": "What adverse reactions???",
            "title_similarity": "0.22693178",
            "sentiment_compound": -0.466
        },
        {
            "id": "hfk76ne",
            "score": 1,
            "text": "Pretty amazing that jocks in a locker room know how to aspirate but not people \"qualified\" to give vaccinations.",
            "title_similarity": "0.56125057",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hfk804i",
            "score": 1,
            "text": "I shoot twice a week. It’s almost impossible to hit a vein in your shoulder when administering vaccine. Seems like they are reaching for something to blame other than the vaccine.",
            "title_similarity": "0.5648645",
            "sentiment_compound": -0.128
        },
        {
            "id": "hfk8pa2",
            "score": 1,
            "text": "Op, just found out we landed on the moon.\nYou people can't wait to regurgitate anything you find out huh.",
            "title_similarity": "0.312779",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfk93u9",
            "score": 1,
            "text": "I was told by the agency I gave vaccinations for that the mRNA lipid nano particles are extremely fragile and haven’t been tested in low pressure environments, so they did not want us aspirating for fear of damaging the vaccine",
            "title_similarity": "0.6969134",
            "sentiment_compound": -0.8756
        },
        {
            "id": "hfkaetx",
            "score": 1,
            "text": "I wonder if this could also be part of why there's some breakthrough cases - 'higher serum cytokine/chemokine levels were found in IM group at 1 to 2 days post-injection' vs the IV misses. Possible that the breakthroughs could be partially caused by an initial lack of immune response after improper vaccination? That Figure 6 is pretty telling as far as this goes...",
            "title_similarity": "0.72223634",
            "sentiment_compound": 0.296
        },
        {
            "id": "hfkb30u",
            "score": 1,
            "text": "Or you can just train the nurses and doctors to inject it correctly.",
            "title_similarity": "0.55805874",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfkbf35",
            "score": 1,
            "text": "Wow this makes perfect sense. Aspirating the needle is very out of practice",
            "title_similarity": "0.4691866",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hfkbloi",
            "score": 1,
            "text": "Wonder if this could explain what happened the first and only time I ever got a flu shot. It sent me into the wall within a few seconds I was in so much pain, I thought I was going to faint, and I'm a masochist with a pain tolerance to match. \n\nDidn't agreed to any shot again for almost a decade until this year when I went and got my COVID vaccine, and I was terrified it was going to happen again. I braced myself and held my eyes shut, and I didn't even realize when they did it. Opened my eyes and the nurse was getting already getting my S.O.'s ready.",
            "title_similarity": "0.58475345",
            "sentiment_compound": -0.923
        },
        {
            "id": "hfkc0rd",
            "score": 1,
            "text": "If we could sort out that problem, I might actually get the vaccine.\n\nBecause until it's completely safe, it frankly isn't worth the risk, due to incredibly low risk covid possesses for me.",
            "title_similarity": "0.7073535",
            "sentiment_compound": -0.482
        },
        {
            "id": "hfkcerz",
            "score": 1,
            "text": "Well, I was almost convinced to take the vax, turns out aspiration is actually a bad thing, and that young men are the most likely to have complications, basically the only group.\n\nAs a young man, yeah, I think I'll take my chances with getting covid a third time.",
            "title_similarity": "0.5850949",
            "sentiment_compound": 0.4601
        },
        {
            "id": "hfkcot4",
            "score": 1,
            "text": "So my background is veterinary medicine but WHAT KIND OF IDIOT ADMINISTERS ANY TYPE OF INJECTION WITHOUT ASPIRATING TO CHECK THE LOCATION FIRST?!?!",
            "title_similarity": "0.61927044",
            "sentiment_compound": -0.8374
        },
        {
            "id": "hfkdeo0",
            "score": 1,
            "text": "This could be huge for how rns give vaccines. When I was in school they did teach us to aspirate first. Now it’s considered old practice",
            "title_similarity": "0.59532773",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfke7s4",
            "score": 1,
            "text": "I am not a nurse. But i wonder if all the vaccine centres really have trained personnel. Those where i took my vaccine seems to be competent. (Non-american here)\n\nI wonder what is everyone's experiences.",
            "title_similarity": "0.56178296",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hfkgzu1",
            "score": 1,
            "text": "Needle aspiration has not been recommended for IM injections for years now.",
            "title_similarity": "0.39614666",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hfkk8ul",
            "score": 1,
            "text": "This is basic practice. Flu vaccines, etc. any IM shot, you pull back before plunging.",
            "title_similarity": "0.61953807",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hfkko6s",
            "score": 1,
            "text": "Needle aspiration is a process that is not used any more cause it does more harm than good. The place where they inject the vaccine has no significant veins near, just one big as nerve that if you wanted to hit probably couldn't so I'm calling  BS on this theory!",
            "title_similarity": "0.60208833",
            "sentiment_compound": -0.3639
        },
        {
            "id": "hfkkzv1",
            "score": 1,
            "text": "We were told to NOT aspirate when I went and gave vaccines. It was the buzz around the hospital amongst nursing staff bc you always aspirate IM so you know it's in muscle not a vessel.",
            "title_similarity": "0.5848219",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfkl310",
            "score": 1,
            "text": "God dammit, we don’t deserve modern medicine anymore",
            "title_similarity": "0.3410787",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hfklkre",
            "score": 1,
            "text": "Uh.. this has me kind of worried now. My first jab was given to me by my pharmacist, and there was no blood. \n\nMy booster was given to me by one of the other helpers behind the counter and blood gushed out after she gave me the booster.",
            "title_similarity": "0.5875929",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hfkn29a",
            "score": 1,
            "text": "Pharmd here. I’ve probably given roughly 4-5k Covid shots. I haven’t met a single patient that had any crazy adverse reaction from the 1st, 2nd or booster shot. Only thing I can think of is maybe a rash? I was never taught the aspiration method and talking to the older rphs they’ve never heard of it either",
            "title_similarity": "0.46817443",
            "sentiment_compound": -0.765
        },
        {
            "id": "hfkn9iu",
            "score": 1,
            "text": "It’s being used by the anti vax mob but based on bugger all evidence               https://pubpeer.com/publications/6DB19C2CE523B3BAEAA8A8A3DCCC7D#2",
            "title_similarity": "0.5701022",
            "sentiment_compound": -0.1655
        },
        {
            "id": "hfkndd4",
            "score": 1,
            "text": "It CANNOT accidentally inject into a vein if you know what you're doing.",
            "title_similarity": "0.4297072",
            "sentiment_compound": 0.2584
        },
        {
            "id": "hfko1qj",
            "score": 1,
            "text": "Just one of many things we still need to learn about the covid immune boost shot. I’m comfortably waiting another 5-10 years before I would consider getting it.",
            "title_similarity": "0.4238",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hfkomwf",
            "score": 1,
            "text": "They should just inject it into the ass. The fat layer is thicker and absorbs more slowly. Less large veins.",
            "title_similarity": "0.4350376",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hfkoqyc",
            "score": 1,
            "text": "Not if you draw back on the needle first and make sure no blood backs into the syringe… This is bloodwork 101. Quit wasting our time and money with BS studies a vet tech can answer!",
            "title_similarity": "0.6515366",
            "sentiment_compound": -0.4106
        },
        {
            "id": "hfkotr6",
            "score": 1,
            "text": "My dad is a doctor and he told me exactly this months ago.",
            "title_similarity": "0.23587732",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfkotyc",
            "score": 1,
            "text": "Isn't it common knowledge in medicine that IM should be aspirated",
            "title_similarity": "0.49683338",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfkpn5c",
            "score": 1,
            "text": "Pretty sure my second shot was in a vein, I could feel the cold vaccine spreading through my whole left side and the nurse said: \"oh, boy! Your a gusher!\" ... That's when I started sweating profusely and almost passed out.",
            "title_similarity": "0.6007864",
            "sentiment_compound": 0.7256
        },
        {
            "id": "hfkqiap",
            "score": 1,
            "text": "Weird. I never aspirate on a needle injection, I make sure it's going into the muscle and have never had a problem. Aspiration is kind of outdated.",
            "title_similarity": "0.4356321",
            "sentiment_compound": 0.4325
        },
        {
            "id": "hfkqv5n",
            "score": 1,
            "text": "So... \n\nWe should probably stop drug store pharmacy techs that have had like 6 months of training with no medical degree jab people? Or are we still just so desperate to jab everyone that we don't care?",
            "title_similarity": "0.5729661",
            "sentiment_compound": -0.7832
        },
        {
            "id": "hfkqxsf",
            "score": 1,
            "text": "This reminds me of the BBL procedure (Brazilian butt lift surgery). Except when they remove fat and inject it, if they hit a vein, it can cause a fat embolism, instantly killing someone. Hence, why BBLs are so dangerous. I’ve read it can be done nearly blindly but surgeons use ultrasound to help them in the “danger zone” of the butt.\n\nI’m not 100% sure I repeated this accurately but is it the same concept ? (except this would be with fat)?",
            "title_similarity": "0.7378519",
            "sentiment_compound": -0.5344
        },
        {
            "id": "hfkratw",
            "score": 1,
            "text": "Cue a bunch of idiots thinking they are smart and asking healthcare workers to aspirate before giving the shot.",
            "title_similarity": "0.54422045",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hfkshyg",
            "score": 1,
            "text": "And that’s why IM needs to be aspirated before injecting",
            "title_similarity": "0.38767406",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfktkrb",
            "score": 1,
            "text": "Needle aspiration is supposed to be done with all intramuscular injections. That is the first thing taught when learning how to do them",
            "title_similarity": "0.46074158",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfku0jx",
            "score": 1,
            "text": "So it's down to technique rather than the product?",
            "title_similarity": "0.20147182",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfkuji9",
            "score": 1,
            "text": "No wonder Kyrie doesn't want to get vaccinated.\n\nThey use big words and the world is flat.",
            "title_similarity": "0.4966893",
            "sentiment_compound": -0.3447
        },
        {
            "id": "hfkvef9",
            "score": 1,
            "text": "Aspiration is supposed to be standard procedure for any injection. I have always done it regardless of the injection type, to verify that I've hit correctly.\n\nAre vaccinators not aspirating?!",
            "title_similarity": "0.46264398",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfkxnr4",
            "score": 1,
            "text": "Anyone giving an injection should know to always aspirate the needle before pressing the plunger.",
            "title_similarity": "0.41525322",
            "sentiment_compound": 0.34
        },
        {
            "id": "hfl0n63",
            "score": 1,
            "text": "I don’t believe it.  Cover story",
            "title_similarity": "0.14007749",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfl4u9v",
            "score": 1,
            "text": "So the guy on Jimmy Dore was right.",
            "title_similarity": "0.20802855",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfl9yeh",
            "score": 1,
            "text": "How many more comments do we need telling us that aspiration is outdated? It's not even the focus of the article.",
            "title_similarity": "0.33853856",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfld9ij",
            "score": 1,
            "text": "YOU LIARS WILL BLAME ANYONE BUT the murder elements and junk science.",
            "title_similarity": "0.43940842",
            "sentiment_compound": -0.9039
        },
        {
            "id": "hflo6ww",
            "score": 1,
            "text": "Someone please help me out…I am living with two anti-vaxxers who have told me that scientists have put HIV into the Covid-19 vaccine. They have also told me that it weakens the immune system to any other viruses that invade and that I am not allowed to get my son vaccinated. That they would supposedly quit their job to stay home with him if it came down to it. This is getting absolutely insane to live with.",
            "title_similarity": "0.67370224",
            "sentiment_compound": 0.228
        },
        {
            "id": "hflp5vu",
            "score": 1,
            "text": "I noticed that the person giving my my shot did not aspirate.  I was given the shot in my shoulder.",
            "title_similarity": "0.35610753",
            "sentiment_compound": 0.34
        },
        {
            "id": "hfm8feu",
            "score": 1,
            "text": "Good thing they're sending out the d teams to administer these in many cases",
            "title_similarity": "0.307576",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfmgjdb",
            "score": 1,
            "text": "If blood is seen in the needle, then what? Adjust depth, aspirate again? Repeat until no blood? How could the vaccine serum avoid finding its way into a punctured blood vessel? Seems like blood vessels aren’t immediately self sealing, otherwise we wouldn’t get bandaids after injections … I don’t see a clear way to ensure the serum doesn’t enter the blood stream in any case here.",
            "title_similarity": "0.7340438",
            "sentiment_compound": 0.644
        },
        {
            "id": "hfnvygw",
            "score": 1,
            "text": "This is why you pull back on the plunger to look for a blood flash when you give an IM.",
            "title_similarity": "0.5566987",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfo2j1s",
            "score": 1,
            "text": "Needle aspiration and ztracking is supposed to be standard practice for IM injections.",
            "title_similarity": "0.5800723",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0ufwe",
            "score": 1,
            "text": "I do an IM self-injection regularly (into my quad), and the nurse who taught me to self inject explained the need to pull back to confirm blood doesn't come into the syringe. This was only 2 years ago. It's curious why this isn't a standard practice.",
            "title_similarity": "0.6409303",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hhb9ldi",
            "score": 1,
            "text": "This is what happens when pop up tents for covid vaccines run amuck. I'm sorry but I'd rather have it done in a sanitary medical office with professionals. Sometimes some of these people who administer vaccines look like they took a 4 week course on vaccine administering and was sent off.",
            "title_similarity": "0.64582086",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hj841we",
            "score": 1,
            "text": "what i dont get, if the needle goes in your body, and you pull it a back a little, wouldnt that prevent stuff from going into the bloodstream?",
            "title_similarity": "0.6511047",
            "sentiment_compound": 0.0489
        },
        {
            "id": "hl3ezf7",
            "score": 2,
            "text": "Honestly look at all the videos and media you see with covid injections. I personally haven't seen a single one where they pull back and check for blood. If that's the standard then that might be why we're seeing so many adverse events. Is aspiration not required in some settings?",
            "title_similarity": "0.61394954",
            "sentiment_compound": 0.0571
        },
        {
            "id": "hnalrr1",
            "score": 2,
            "text": "The nurse who gave me my booster changed my bandaid right away because she she must have injected into my blood vessel :( she said that back in the day they’d have aspirated but now they learned it isn’t an issue if it hits a vessel. But now I’m so scared I could cry :( I have anxiety so if anyone sees this and knows otherwise, can you please let me know. I’m really scared now to get a clot",
            "title_similarity": "0.7072111",
            "sentiment_compound": -0.961
        },
        {
            "id": "hu4m58n",
            "score": 1,
            "text": "Does anyone know if you can reuse the fluid if you draw blood while aspirating?",
            "title_similarity": "0.5284846",
            "sentiment_compound": 0.0
        }
    ]
}