{
    "A chemotherapy drug derived from a Himalayan fungus has 40 times greater potency for killing cancer cells than its parent compound.\n": [
        {
            "id": "hfydcli",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.4133304",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hfykf8m",
            "score": 25,
            "text": "Cancer cells are very similar to normal cells. Did they bother to check if the drug isn't also 40 times better at killing normal cells?",
            "title_similarity": "0.81877315",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hfynrul",
            "score": -5,
            "text": "If this fungus can be grown cheaply and eaisly then the pharmaceutical companies will lobby the government to ban it right away..  It will be labeled as a schedule 1 narcotic in no time..",
            "title_similarity": "0.58442825",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hfyoxwh",
            "score": 7,
            "text": "40 times greater than 0 is 0. No context makes me hate this headline.",
            "title_similarity": "0.5083606",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hfym4kj",
            "score": 17,
            "text": "If they can't secure or enforce a monopoly right over the chemical using a patent, nobody will fund the clinical trials to get regulatory approval, because governments don't pay for off-patent drugs or nutraceuticals.\n\nFor example, US Government agreed to pay $1.2 billion for Merck's new patented COVID-19 drug molnupiravir, that allegedly reduces hospitalisation by 50%, and could generate $7 billion in revenue due to Merck charging $712 for a 5-day course. Compare this to its estimated $17.74 cost to the company and the fact that it is a result of $29m of public funding provided to Emory University, with Merck only funding the last stages of development. Also, as it is a new drug, we are still not sure about its long-term safety.[https://www.independent.co.uk/news/world/americas/us-merck-covid-pill-cost-b1933100.html](https://www.independent.co.uk/news/world/americas/us-merck-covid-pill-cost-b1933100.html)\n\nMeanwhile, L-arginine, a low cost, safe and effective amino-acid, was found to have similar efficacy against Covid by reducing hospitalisation in a Phase 2 randomised controlled trial published in the world's leading medical journal, the Lancet.\n\n[https://www.thelancet.com/journals/eclinm/article/PIIS2589-5370(21)00405-3/fulltext](https://www.thelancet.com/journals/eclinm/article/PIIS2589-5370(21)00405-3/fulltext)\n\nHowever, there are almost no private financial incentives to repurpose off-patent drugs and nutraceuticals/dietary supplements to treat new diseases because it is not possible or very difficult to enforce a monopoly price using patents by preventing off-label competition - the \"tragedy of the commons.\"\n\nIf payers could back a pay for success contract with only 1% of what the US govt agreed to pay for molnupiravir, this would solve the tragedy of the commons. By creating a $12m reward to incentivise a private company to fund the Phase 3 clinical trials required to repurpose an off-patent drug or nutraceutical to achieve regulatory approval, it would help millions of people have access to additional low cost, safe and effective therapeutics.",
            "title_similarity": "0.61402416",
            "sentiment_compound": 0.9501
        },
        {
            "id": "hfyk580",
            "score": 17,
            "text": "[removed]",
            "title_similarity": "-0.040633418"
        },
        {
            "id": "hfyq9w3",
            "score": 3,
            "text": "Why don't we test all traditional medicines for their supposed effects? I'm sure the majority will be quack, but there has to a few with a grain of truth like this one right? That sounds like it's worth the effort.",
            "title_similarity": "0.49433118",
            "sentiment_compound": 0.9154
        },
        {
            "id": "hfytppo",
            "score": -2,
            "text": "But it's all natural it can't be good for you.",
            "title_similarity": "0.023717951",
            "sentiment_compound": 0.0364
        },
        {
            "id": "hfymwhj",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "-0.040633418"
        },
        {
            "id": "hfykbqm",
            "score": -9,
            "text": "The Chinese drink tea with this already",
            "title_similarity": "0.27071664",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfyjdvb",
            "score": 21,
            "text": "[removed]",
            "title_similarity": "-0.040633418"
        },
        {
            "id": "hfylt9h",
            "score": 43,
            "text": "It’s a parasite.  Becoming quite rare to find now as it lives in a moth before breaking out of it.  Also costs a fortune in China and due to heavy metals in the ground due to pollution, it can be toxic.  I used to live in China.",
            "title_similarity": "0.6064195",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfyyxqj",
            "score": 1,
            "text": "Again and again early announcements lead to nothing. We need a rating system for likelihood or level of validity. Mods hurry up and fix science, stop the sensationalist articles getting by, ie this article is rated a r=0.25 (preliminary study, no human trials). Let the people who know argue over the final r value. r being “realness”. \nJust a thought. I’ve been disappointed so many times with fantastic claims.",
            "title_similarity": "0.49263608",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hfyox9c",
            "score": 243,
            "text": "40 times greater than 0 is 0. No context makes me hate this headline.",
            "title_similarity": "0.5083606",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hfz0m6a",
            "score": 7,
            "text": "It's huge in Chinese medicine, but very pricey because of over harvesting and criminals in the business. It uses to be a common soup ingredient amongst southern Chinese. Lots of anecdotal support. My wife used in when she had nasopharyngeal cancer. More as an energy immune system builder. The Polytech U in Hong Kong was behind a lot of research. Seems to have some proven pedigree. It's the used shell of a bug, much like a butterfly pupae.",
            "title_similarity": "0.64602435",
            "sentiment_compound": 0.0376
        },
        {
            "id": "hfyt47n",
            "score": 37,
            "text": "Gathering this wierd fungus that only grows on a certain species' dead caterpillar (if I remember right) is completely screwing up some of the wildest and most beautiful parts of the Himalaya, Dolpo for example. \n\nThere is a \"fungus rush\" to find and dig up these fungi that are worth huge amounts, compared to local incomes. This is for Chinese traditional medecine.",
            "title_similarity": "0.6971686",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hfyl9lf",
            "score": 2,
            "text": "There are people who make a living picking mushrooms from the mountains and they are saying it is harder to find I wonder if this one will get wiped out as well",
            "title_similarity": "0.48959932",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hfynxe7",
            "score": 2,
            "text": "So when do we get it?",
            "title_similarity": "-0.14289552",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfys96y",
            "score": 2,
            "text": "Will this make chemotherapy 40x more effective?",
            "title_similarity": "0.7284266",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hfyy42x",
            "score": 2,
            "text": "That's great! Too bad I won't ever hear about it again. Kind of like the nano-gold treatment, or the concentrated vitamin C that both showed great promise during trials. They made it to a regulatory body and poof, gone forever",
            "title_similarity": "0.54636526",
            "sentiment_compound": 0.8933
        },
        {
            "id": "hfyhhp1",
            "score": 289,
            "text": "Thermite is 100% effective in killing cancer cells",
            "title_similarity": "0.7639959",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hfyskik",
            "score": 2,
            "text": "It's interesting when the scientific method intersects with natural remedies. Come to think of it, I'm not sure the two are distinguishable. The primary issue is whether potential treatments and cures are subjected to scientific rigor.",
            "title_similarity": "0.36987603",
            "sentiment_compound": 0.5003
        },
        {
            "id": "hfz9r6c",
            "score": 3,
            "text": "Does anyone feel like they read miracle drug coming soon articles every month for the last 20 years and then never hear about it again?",
            "title_similarity": "0.4539936",
            "sentiment_compound": 0.743
        },
        {
            "id": "hfyp7z0",
            "score": 5,
            "text": "Another great new cancer treatment? I know what sub I'm on, on r/science I see a revolutionary new cancer treatment every 48h. Do we ever hear about any of them again? No",
            "title_similarity": "0.6032591",
            "sentiment_compound": -0.8053
        },
        {
            "id": "hfz8aze",
            "score": 7,
            "text": "I have a feeling I will never hear about this Himalayan fungus again, but fingers crossed",
            "title_similarity": "0.3213358",
            "sentiment_compound": 0.0644
        },
        {
            "id": "hfylymg",
            "score": -10,
            "text": "Can't get a patent on it.... won't use it",
            "title_similarity": "0.032897174",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfyj2h3",
            "score": 136,
            "text": "Is this just marketing on reddit for a new drug? Or is it actually revolutionary as they're making it sound?",
            "title_similarity": "0.489078",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfyugwo",
            "score": 12,
            "text": "Please remember that the vast vast majority of drugs to go into the first clinical trial testing stage don't move on to the second stage, for a multitude of reasons.",
            "title_similarity": "0.4636789",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfywtkn",
            "score": 45,
            "text": "[removed]",
            "title_similarity": "-0.040633418"
        },
        {
            "id": "hfyjl74",
            "score": 3867,
            "text": "Shouldn't the chemotherapy drug be compared to the efficacy of other chemo drugs instead of the centuries old herbal medicine?",
            "title_similarity": "0.58982354",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfyvyso",
            "score": 1002,
            "text": "Killing cancer cells is easy. \n\nKilling cancer cells without killing the patient as well is hard.",
            "title_similarity": "0.5734451",
            "sentiment_compound": -0.9097
        },
        {
            "id": "hfytjpl",
            "score": 99,
            "text": "I saw a documentary where they goto find these fungi in Nepal. it takes like a week to get to some certain field through some crazy rocks and cliffs. and you need to crawl all day looking for these. it's seriously insane.",
            "title_similarity": "0.5589682",
            "sentiment_compound": -0.296
        },
        {
            "id": "hfyezwr",
            "score": 3208,
            "text": "_The naturally-occurring nucleoside analogue known as Cordycepin (a.k.a 3’-deoxyadenosine) is found in the Himalayan fungus Cordyceps sinensis and has been used in traditional Chinese medicine for hundreds of years to treat cancers and other inflammatory diseases. However, it breaks down quickly in the blood stream, so a minimal amount of cancer-destroying drug is delivered to the tumour. In order to improve its potency and clinically assess its applications as a cancer drug, biopharmaceutical company NuCana has developed Cordycepin into a clinical therapy, using their novel ProTide technology, to create a chemotherapy drug with dramatically improved efficacy._",
            "title_similarity": "0.7191894",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hfyqq83",
            "score": 3,
            "text": "Here's a related paper from the NIH on Cordyceps so people can get a better understanding on it.  \nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC3121254/  \nI'm a bit skeptical but will keep an open mind.",
            "title_similarity": "0.23540252",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hfyrxiy",
            "score": 2,
            "text": "Please define the parent compound",
            "title_similarity": "0.016883794",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfyuqj2",
            "score": 2,
            "text": "Cordycepin is used in molecular biology labs routinely to inhibit transcription. There are many other drugs that do the same with small differences in precisely how they inhibit transcription. None of these will cure cancer by themselves, but in a chemo cocktail they might have some benefit.",
            "title_similarity": "0.59394354",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hfyv0j6",
            "score": 2,
            "text": "This comment may be removed and that’s fine. But why is it that in this sub, a “cure” or “huge” breakthrough in cancer treatment/research is posted?",
            "title_similarity": "0.53655916",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hfyv50a",
            "score": 2,
            "text": "Correct me if I sound like an idiot but does this title effectively say: “cancer drug is 40 times more effective at treating cancer than naturally occurring fungus”?",
            "title_similarity": "0.8673111",
            "sentiment_compound": 0.2357
        },
        {
            "id": "hfyvrmr",
            "score": 2,
            "text": "It's wild to me that this article makes no mention of the fact that this is a parasitic fungus that grows out from caterpillars. They even went as far as to include a photo of a bunch of dead, fungus-infested caterpillars - and not a word!",
            "title_similarity": "0.44776124",
            "sentiment_compound": -0.7777
        },
        {
            "id": "hfyw4l9",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.0037047202"
        },
        {
            "id": "hfyw80d",
            "score": 2,
            "text": "$9,000 USD per pound wow",
            "title_similarity": "0.45715332",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hfyw883",
            "score": 23,
            "text": "Yarshagumba.\nEvery year locals go in numbers of hundred to thousands to pick it up in the hills of Nepal.",
            "title_similarity": "0.47049317",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfyxlk2",
            "score": 2,
            "text": "Suddenly the fungus kills itself",
            "title_similarity": "0.4561514",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hfyy0v3",
            "score": 2,
            "text": "It's a shame most of these discoveries are made in partnership with private firms now. Feels like the source of new knowledge has been captured, and little escapes free to the public.",
            "title_similarity": "0.2889226",
            "sentiment_compound": 0.3876
        },
        {
            "id": "hfyyvqq",
            "score": 2,
            "text": "Always knew those monks held things the western world could use as medicine",
            "title_similarity": "0.27612615",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfyyxyf",
            "score": 3,
            "text": "A little side note, but this is why it's important to protect our biodiversity.\n\nWhat if there was a cure for covid in Amazon jungles but some idiot just bulldozed the last standing tree?",
            "title_similarity": "0.43187448",
            "sentiment_compound": 0.296
        },
        {
            "id": "hfyzg0y",
            "score": 1,
            "text": "Let me guess we are never gonna hear about it again",
            "title_similarity": "-0.028967826",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfyzr6o",
            "score": 1,
            "text": "Can you take it just to precautionary rid your self of would be cancer ?",
            "title_similarity": "0.44253913",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hfyzsu8",
            "score": 1,
            "text": "can't wait to watch this get lost and forgotten in time like the all other cures",
            "title_similarity": "0.31853235",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hfz0pku",
            "score": 1,
            "text": "I hope they don't do the classic for-profit human thing and ravage the wilds of the Himalayas, taking all of the precious fungus until there is nothing but a vast wasteland left.",
            "title_similarity": "0.4796737",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hfz1b6t",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.040633418"
        },
        {
            "id": "hfz1isy",
            "score": 1,
            "text": "What if you’re allergic to fungus like penicillin?",
            "title_similarity": "0.41297188",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hfz1vok",
            "score": 1,
            "text": "Is it also 40 times more potent at killing the patient?",
            "title_similarity": "0.807914",
            "sentiment_compound": -0.6872
        },
        {
            "id": "hfz21ry",
            "score": 1,
            "text": "Well you can say that about cyanide also.",
            "title_similarity": "0.25750467",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hfz24p0",
            "score": 1,
            "text": "Can't wait for this to get squashed because it makes way less money than chemo.",
            "title_similarity": "0.4500109",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfz29yq",
            "score": 1,
            "text": "Fungus are so interesting",
            "title_similarity": "0.28025508",
            "sentiment_compound": 0.541
        },
        {
            "id": "hfz2cuk",
            "score": 1,
            "text": "Tune in next week when Anti-Vaxxers have discovered bathmat funguses are a home remedy for Covid-19.\n\nTo be clear, I'm not mocking this article. Just the idiots that will undoubtedly see this and attempt rudimentary applications of the concept to everything that ails them.",
            "title_similarity": "0.5142048",
            "sentiment_compound": 0.5938
        },
        {
            "id": "hfz3064",
            "score": 1,
            "text": "But still a million times less potent than modern medicine!",
            "title_similarity": "0.51133907",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfz359k",
            "score": 1,
            "text": "Cant it be combined with nano transporters to get to the tumour and work there rather than breaking down before reaching the tumour",
            "title_similarity": "0.42825025",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hfz35w2",
            "score": 1,
            "text": "All I know is that I don’t love mushrooms, but cordyceps are really yummy with a quick pan fry… and they can grow on rice rather than caterpillars…",
            "title_similarity": "0.3592818",
            "sentiment_compound": 0.8243
        },
        {
            "id": "hfz37sy",
            "score": 1,
            "text": "I was wondering why this fungus mildly resembled caterpillars until I saw that it was a cordycep fungus.",
            "title_similarity": "0.43199387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfz3bql",
            "score": 1,
            "text": "[Recent review](https://www.sciencedirect.com/science/article/abs/pii/S1087184520301225) on how to make cordycepin without dead caterpillars... Behind a paywall, but abstract and figures are already interesting.",
            "title_similarity": "0.44522852",
            "sentiment_compound": 0.6976
        },
        {
            "id": "hfz3qx5",
            "score": 1,
            "text": "Will non-millionaires and non-billionaires ever get to benefit from it?",
            "title_similarity": "0.24483757",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hfz4chy",
            "score": 1,
            "text": "Can we just go straight to the current compounds grandchild compound?",
            "title_similarity": "0.17118776",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hfz4fns",
            "score": 1,
            "text": "Drug derived from the coca plant 40 times more effective than just chewing on the leaves!  Drug derived from poppy flowers...\n\nThis reads like a description of how all drug processing and concentration work.",
            "title_similarity": "0.7727989",
            "sentiment_compound": 0.7339
        },
        {
            "id": "hfz4ih1",
            "score": 1,
            "text": "They always have the best stuff up there don't they?",
            "title_similarity": "0.17746395",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hfz4tuh",
            "score": 1,
            "text": "Can this cross the blood brain barrier?",
            "title_similarity": "0.23349619",
            "sentiment_compound": -0.128
        },
        {
            "id": "hfz4wyu",
            "score": 1,
            "text": "Are there any concentrated efforts to investigate ancient medicinal herbs just like this fungus? I mean like a fully comprehensive examination of these herbs for useful properties. There should be a decent amount of herbs that we haven't fully examined yet for properties like this.",
            "title_similarity": "0.56142235",
            "sentiment_compound": 0.8932
        },
        {
            "id": "hfz57om",
            "score": 1,
            "text": "You know how rare and expensive the real Cordyceps are? People kill for this.",
            "title_similarity": "0.5148839",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hfz6x38",
            "score": 1,
            "text": "Now i am keen as to what ancient cultures used them.",
            "title_similarity": "0.15879318",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfz7bl4",
            "score": 1,
            "text": "This is another reason why biodiversity is so important. We're killing future cures when we kill our planet.",
            "title_similarity": "0.5223667",
            "sentiment_compound": -0.8401
        },
        {
            "id": "hfz7lf3",
            "score": 1,
            "text": "How does it only kill cancer cells? How does it distinguish between healthy and tumourous tissue?",
            "title_similarity": "0.6647942",
            "sentiment_compound": -0.8299
        },
        {
            "id": "hfz7v0u",
            "score": 1,
            "text": "And it’ll get shelved",
            "title_similarity": "0.0024746354",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfz8zn8",
            "score": 1,
            "text": "Hey!  Lets maybe preserve the environment.  Good stuff found here.   Vote!",
            "title_similarity": "0.15089653",
            "sentiment_compound": 0.5399
        },
        {
            "id": "hfz99ir",
            "score": 1,
            "text": "What else does it kill?",
            "title_similarity": "0.16767085",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hfzabau",
            "score": 1,
            "text": "Cordyceps will save us all!",
            "title_similarity": "0.12782237",
            "sentiment_compound": 0.5411
        },
        {
            "id": "hfzajhe",
            "score": 1,
            "text": "Is this the fungus from the DW documentary? Locals are gathering so much of this fungus to sell them that the thing is starting to disappear.",
            "title_similarity": "0.49034205",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hfzams8",
            "score": 1,
            "text": "Sanjeevani, i guess",
            "title_similarity": "-0.083394684",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzbove",
            "score": 1,
            "text": "wait... what kind of title is this? Its parent compound? So if I turn sugar into alcohol, and alcohol kills cells, would I have made a drug thats 100x greater potency for killing cancer than its parent compound? I wouldnt mind someone helping me understand this.",
            "title_similarity": "0.7701023",
            "sentiment_compound": -0.9221
        },
        {
            "id": "hfzcfvd",
            "score": 1,
            "text": "Fungi to the rescue again. It's not about where it can't go or what it can't do. It everywhere and do everything.!",
            "title_similarity": "0.26155338",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hfzctrn",
            "score": 1,
            "text": "Just another reminder that we still very much rely on the natural world. Conserving that world for future generations is an ethical responsibility, but also a practical one.",
            "title_similarity": "0.19529864",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfzdcbz",
            "score": 1,
            "text": "Think of all the potentinal we're destroying everyday in the amazon in terms of potential medicine",
            "title_similarity": "0.5584902",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hfzdi9g",
            "score": 1,
            "text": "Sounds like shite:\n\nhttps://clincancerres.aacrjournals.org/content/early/2021/09/08/1078-0432.CCR-21-1652.full-text.pdf\n\n\n* Requires micromolar concentrations in petri dish to kill cancers cells - stinks\n\n* Half life of less than 1h when large quantities where IV infused in dogs - stinks\n\n* Would likely require grams worth of drug to be constantly administered to humans - stinks\n\n* In fact they did do a preliminary study in humans with doses that approached 1g/administration.  It was tolerated, but because the focus was on safety, you can bet your ass even higher dose levels are going to be required to have any hope for efficacy in cancer patients. \n\n* Caused changes to liver and bone marrow in dogs.  Dose levels given to dogs repeatedly (everyday for 5 days w/2 day cessation = 1 cycle, for a total of 4 cycles)were  5, 10, and 20 mg/kg/day.  Authors state 10 mg/kg/day was HNSTD.  The tox results reported basically provided no detail, so you can probably assume they may have observed significant liver and bone marrow tox at 20 mg/kg/day and possibly even saw dogs dying in the 20 mg/kg/day group.\n\nDo the extrapolation from dogs: beagle = ~10 kg.  Max safe dose IDed for dogs in g= 10 mg/kg/day * 10 kg = 100 mg/day.  A human is about 70 kg. Thus the reasonably safe dose to start in humans is about 700 mg/day......which they did test in the clinic..  They will probably need more than that to see actual efficacy due to poor PK and micromolar efficacy.  But then you run risks of the reported liver and marrow tox. \n\nDef would not get excited over molecules with micromolar activities, poor PK, and large doses required to see activity.  I've been around cancer research a looking time.  There are always companies and researchers hyping cancer drugs derived from natural resources, but they overwhelmingly never go anywhere because of virtually no efficacy due to poor pharmacology and low potency",
            "title_similarity": "0.6986011",
            "sentiment_compound": -0.9879
        },
        {
            "id": "hfzeom2",
            "score": 1,
            "text": "They look like caterpillars",
            "title_similarity": "0.19159713",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hfzeqkr",
            "score": 1,
            "text": "And this is the last we'll ever hear of it",
            "title_similarity": "0.018346297",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzer4c",
            "score": 1,
            "text": "This is literally a big nothing burger. “New compound made of previous compound better than old compound.”",
            "title_similarity": "0.52863044",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfzgik8",
            "score": 1,
            "text": "Could you ingest the fungus in its natural state and receive similar benefits",
            "title_similarity": "0.38636926",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hfzgnqy",
            "score": 1,
            "text": "Does something with increased cancer killing properties also have increased normal cell killing properties?",
            "title_similarity": "0.6866393",
            "sentiment_compound": -0.9001
        },
        {
            "id": "hfzgz5y",
            "score": 1,
            "text": "See this in what 50 years...maybe in mice...",
            "title_similarity": "0.24817589",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzhl2a",
            "score": 1,
            "text": "Better get that fungus before the ecosystem is gone.",
            "title_similarity": "0.4097626",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hfzhme1",
            "score": 1,
            "text": "Wait is this what grows in Yara?",
            "title_similarity": "0.081859365",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzjhmp",
            "score": 1,
            "text": "And you’ll never hear about it again.",
            "title_similarity": "0.016390726",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzkhsy",
            "score": 1,
            "text": "Is this the fungus that infects a caterpillar and grows out of its body?",
            "title_similarity": "0.4530424",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzkowu",
            "score": 1,
            "text": "I didn’t even need to read the article to know it’s about Cordyceps.  Everybody needs to consume cordycep, reishi and lions mane.",
            "title_similarity": "0.34629443",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzla3l",
            "score": 1,
            "text": "Potency in killing cancer is less important than not killing cells that aren't cancer.  A blowtorch has 100% potency for killing cancer cells.",
            "title_similarity": "0.7624216",
            "sentiment_compound": -0.9014
        },
        {
            "id": "hfzlwc9",
            "score": 1,
            "text": "But how can we patent a naturally occurring fungus? Surely there’s no money to be made here so it’ll be scrapped.",
            "title_similarity": "0.3984877",
            "sentiment_compound": 0.2617
        },
        {
            "id": "hfzly3p",
            "score": 1,
            "text": "This is hardly news. This is how all drug development works. You find a drug that has activity, modify it, and find other compounds with similar to much, much higher potency. This happens all day every day. Likely very little special about this particular example.",
            "title_similarity": "0.41024292",
            "sentiment_compound": 0.399
        },
        {
            "id": "hfzm4i5",
            "score": 2,
            "text": "This is yartsa gunbu in Tibetan (Literally: summer-grass, winter-bug)\n\nIt goes for huge prices in China. One of the main sources of cash revenue for many Tibetan families, some of whom get crazy rich from the sale of it. It's also the cause of a lot of hard feelings in Tibetan communities as well - villages can fight over who has rights to the lands where it grows, and it also creates great wealth inequality, etc.",
            "title_similarity": "0.55307174",
            "sentiment_compound": 0.9001
        },
        {
            "id": "hfzmdod",
            "score": 1,
            "text": "Cordyceps are not new...and they're a VERY corrupt industry.",
            "title_similarity": "0.36337072",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzmoi2",
            "score": 1,
            "text": "Can the comments tell me why this isn’t exciting and never going to come out as per usual.",
            "title_similarity": "0.11880911",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hfzmtll",
            "score": 1,
            "text": "I lived in a city on the Tibetan Plateau once and the Chinese there would put these into bottle of liquor to mellow out the flavor. It was still awful.\n\nFascinating organism though. https://en.m.wikipedia.org/wiki/Ophiocordyceps_sinensis",
            "title_similarity": "0.5465038",
            "sentiment_compound": 0.128
        },
        {
            "id": "hfzmw1d",
            "score": 1,
            "text": "So what? If it works it will be bought and hidden from the world since con men run the planet",
            "title_similarity": "0.3700775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfznzm9",
            "score": 1,
            "text": "Comparison to an obscure parent compound’s efficacy is not an especially helpful comparison.",
            "title_similarity": "0.19942234",
            "sentiment_compound": -0.3713
        },
        {
            "id": "hfzovtp",
            "score": 1,
            "text": "Whats happening is that humans are rediscovering the natural medicines that have always existed just forgotten.",
            "title_similarity": "0.34974504",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hfzq60q",
            "score": 1,
            "text": "Cordyceps also increases your aerobic capacity. It’s like legal doping for endurance athletes. [True Story.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5236007/)",
            "title_similarity": "0.5529274",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hfzqifn",
            "score": 1,
            "text": "Cool, when can we see this in action?",
            "title_similarity": "-0.105575465",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hfzqkba",
            "score": 6,
            "text": "Waiting for my fellow indians to claim their ancestors knew this thousands of years ago",
            "title_similarity": "0.29085982",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzr70s",
            "score": 1,
            "text": "Regardless of the efficacy of this drug, that headline is completely meaningless.  It sounds like something impressive until you realize you have no frame of reference, and that there's a hell of a lot more to cancer treatment than just killing cancer cells.",
            "title_similarity": "0.6263387",
            "sentiment_compound": -0.9621
        },
        {
            "id": "hfzs0y9",
            "score": 1,
            "text": "Aren’t cordyceps mushrooms the ones that zombify ants? Is this cancer med how we end up in that will smith movie?",
            "title_similarity": "0.62699854",
            "sentiment_compound": -0.7657
        },
        {
            "id": "hfzu5nl",
            "score": 2,
            "text": "If anyone's interested, cordyceps militaris is a similar species researchers have had success cultivating. We are not dependent on the wild type Himalayan fungus to support large scale rollout of cordyceps-based medicines.",
            "title_similarity": "0.41875082",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hfzvfod",
            "score": 1,
            "text": "Really wish the headline was better.",
            "title_similarity": "0.29264116",
            "sentiment_compound": 0.7089
        },
        {
            "id": "hfzwfgk",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.0037047202"
        },
        {
            "id": "hfzwh6q",
            "score": 1,
            "text": "I was about to grow Cordyceps militaris in lab before pandemic. Himalayan Cordyceps is found in upper hills of Nepal, Bhutan and India.",
            "title_similarity": "0.5102284",
            "sentiment_compound": 0.0
        },
        {
            "id": "hfzzbbc",
            "score": 1,
            "text": "Cool, now tell me why we cant use it",
            "title_similarity": "-0.022899223",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hg00h9q",
            "score": 1,
            "text": "I'm not religious at all but I read somewhere that there's a theory about god putting everything on earth that we will ever need. ASA comes to mind, as an example, so does this fungus. Maybe it's in the bible. I've read the Old Testament but can't remember seeing that. I hope this fungus helps people.",
            "title_similarity": "0.4381152",
            "sentiment_compound": 0.872
        },
        {
            "id": "hg00hdp",
            "score": 1,
            "text": "Didn't know of its real-world purpose, but I remember Cordyceps being a food item in The World Ends With You (+50 BRV), and thought the cover image looked familiar when I first saw this post. Neat!",
            "title_similarity": "0.3738113",
            "sentiment_compound": 0.6476
        },
        {
            "id": "hg01f4c",
            "score": 1,
            "text": "that Himalayan worm mushroom is p great, huh.",
            "title_similarity": "0.45621994",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hg01p96",
            "score": 1,
            "text": "Isn't the main problem with cancer medicine that the medicine somehow has to be able to distinguish between cancer cells and normal cells, which is very hard?\n\nHow would some fungus chemical be so \"smart\"? If it has this mechanism of action, shouldn't it be quite easy to synthezise and aplly to some other drug?",
            "title_similarity": "0.62439156",
            "sentiment_compound": -0.475
        },
        {
            "id": "hg067vl",
            "score": 1,
            "text": "I'm sure if thus ever gets approved and sold in the US it will cost more than your house to get treated....I hate this country.",
            "title_similarity": "0.49614978",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hg0azy9",
            "score": 1,
            "text": "I hope someone is already starting a conservation effort for that fungus, before it becomes a health fad.",
            "title_similarity": "0.4075665",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hg0b6bp",
            "score": 1,
            "text": "Kills what sort of cancer cells?\n\nThis is encouraging, sure, but \"kills cancer cells\" is only a little bit more specific than saying \"cures disease\".\n\nEven the article doesn't say.",
            "title_similarity": "0.66484064",
            "sentiment_compound": -0.9337
        },
        {
            "id": "hg0eshi",
            "score": 1,
            "text": "To everyone complaining about the “40 times greater” part of the title, it’s important to note that that was the literal goal of this study. The parent compound has established anti-cancer properties, but gets degraded in humans before it can really kill the cancer cells. The point of this study was the protect it from being degrading so that it can successfully reach cancer cells and trigger their death. So they were just try to make the parent compound actually effective. They aren’t making sweeping claims about how this will be the best cancer drug on the market, so there wasn’t a need to compare it to other cancer therapies. It’s just a new way of treating cancer that is being explored and seeing progress, and I think that’s great.",
            "title_similarity": "0.66584283",
            "sentiment_compound": -0.9848
        },
        {
            "id": "hg0gw6g",
            "score": 1,
            "text": "But what *kind* cancer? There's a lot of different types of cancer that respond to treatments differently.",
            "title_similarity": "0.5445007",
            "sentiment_compound": -0.8625
        },
        {
            "id": "hg0h47d",
            "score": 1,
            "text": "fuckin cordyceps man, the future is fungi.",
            "title_similarity": "0.32824868",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0i72p",
            "score": 1,
            "text": "Aren't all drugs made from something that already exists?",
            "title_similarity": "0.2819353",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0l8pu",
            "score": 1,
            "text": "This is a really popular (and expensive) medicine in China. They sell it everywhere, even regular old grocery stores",
            "title_similarity": "0.5207753",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hg0maym",
            "score": 1,
            "text": "Oh man this is a big deal",
            "title_similarity": "0.13443616",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg0n8ql",
            "score": 1,
            "text": "So much money to be made in Cancer treatment. I don't think we will every have a cure for it.",
            "title_similarity": "0.5846267",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hg0taag",
            "score": 1,
            "text": "Can this be synthesized via a synthetic biology program?",
            "title_similarity": "0.26084352",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg10rvo",
            "score": 1,
            "text": "Looks like patents already done, so this was likely known many years ago within mainstream traditional allopathic medicine within academic circles. It was known for literally thousands of years in Ancient China, India and throughout the Himalayan regions.\n\nWhat this report gets incorrect is that there is a reason why this medicine - usually imbibed as a tonic goes into the blood. When it is present in the blood it prevents cancer to spread via the lymph glands and metastasize throughout the body. Blood cancer is something that results from not looking at this holistically in cancer treatment in many cases. This can also treat blood cancer when used in the *traditional* way it has been used for thousands of years.",
            "title_similarity": "0.6783588",
            "sentiment_compound": -0.9337
        },
        {
            "id": "hg16me3",
            "score": 1,
            "text": "isnt that just aged ginseng?",
            "title_similarity": "0.3264016",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1dzvw",
            "score": 1,
            "text": "It's the fuckin Himalayan wine mixer",
            "title_similarity": "0.40935194",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg1moc0",
            "score": 1,
            "text": "Aren’t cancer cells… y’know… human cells? Cyanide is pretty great at killing cancer cells to, it just takes a lot of you with it",
            "title_similarity": "0.7352724",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hg1om46",
            "score": 1,
            "text": "In Nepal, we call them \"yarshagumba\".It is half plant and half insect. Its medicinal importance is known for many years. It is so much expensive even in raw form that collecting yarshagumba has become seasonal job for people of at least 5 districts.Since we are so goddamn awful at everything most of the yarsagumbas are exported to India illegally.",
            "title_similarity": "0.61282986",
            "sentiment_compound": -0.6975
        },
        {
            "id": "hg1p0hm",
            "score": 1,
            "text": "I should save this post for later",
            "title_similarity": "-0.013823347",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hg1pr5d",
            "score": 1,
            "text": "On earth, there’s a plant/fungus to cure every disease known to man.",
            "title_similarity": "0.522719",
            "sentiment_compound": 0.0
        },
        {
            "id": "hg21b2n",
            "score": 1,
            "text": "Wait I've seen my grand parents drinking this regularly as a broth since childhood. It's an ingredient commonly used in Chinese medicine. Can't remember what benefits it provides though.",
            "title_similarity": "0.47694653",
            "sentiment_compound": 0.2062
        },
        {
            "id": "hg21xa6",
            "score": 1,
            "text": "This is what is so heartbreaking about species loss and deforestation, so many potential medical applications lost to slash and burn, cattle grazing, resource exploitation... sigh.",
            "title_similarity": "0.47140688",
            "sentiment_compound": -0.8579
        },
        {
            "id": "hg282b4",
            "score": 1,
            "text": "This is sad, but I have no doubt it will happen. If this is true it will go away. Billions is made on cancer treatments and research. The powers that be don't want a cure.",
            "title_similarity": "0.5394211",
            "sentiment_compound": -0.4798
        },
        {
            "id": "hg2alr4",
            "score": 1,
            "text": "*poof* it will never see the light of day or any chance at approval fr medical use. You can't keep billing cured patients, and I think pharmaceutical companies have made it very clear they could care less if we live or die as long as we keep paying them.",
            "title_similarity": "0.3876255",
            "sentiment_compound": 0.7425
        },
        {
            "id": "hg2cfwi",
            "score": 1,
            "text": "Great, I can't wait to hear absolutely nothing about this ever again because it is yet another nothing in the scheme of things.",
            "title_similarity": "0.14660276",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hg2pgmk",
            "score": 1,
            "text": "It's the product Tibetan exports the most of like 70% of their economy",
            "title_similarity": "0.54990935",
            "sentiment_compound": 0.4173
        },
        {
            "id": "hg2w9nw",
            "score": 1,
            "text": "Next Nobel?\nTu Youyou won in 2015 for her findings on malaria drug again researching on traditional medicines.",
            "title_similarity": "0.6120474",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hg4a74x",
            "score": 1,
            "text": "and we will never see or hear about this fungus / miracle cure again.",
            "title_similarity": "0.27473605",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hg4d7ao",
            "score": 1,
            "text": "So another potential cancer treatment that we’ll never hear about again.",
            "title_similarity": "0.36943585",
            "sentiment_compound": -0.6872
        },
        {
            "id": "hgaz4ac",
            "score": 1,
            "text": "Well we the people of himalayan Region knew this many many years ago.",
            "title_similarity": "0.28136444",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hgi0c6w",
            "score": 1,
            "text": "Mushrooms are the answer!",
            "title_similarity": "0.2924511",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgno5ri",
            "score": 1,
            "text": "Any chemical compound can kill cancer cells but how you administer it matters since collateral damage matters too. That’s the real issue with these “cures” how to get them to target the right cells and not massacre everything else in its path",
            "title_similarity": "0.5936277",
            "sentiment_compound": -0.8608
        }
    ]
}