{
    "News avoidance during the COVID-19 pandemic is associated with better mental well-being\n": [
        {
            "id": "hgsgrkf",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.5204218",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hgt7pji",
            "score": 1,
            "text": "I bet burying your head in the sand has a similar effect, but what of the consequences of being ignorant when wilful ignorance of current events is significantly responsible for the severity of current events? Yes, ignorance is bliss, but you need to give this caveat or be responsible for increasing ignorance even more.",
            "title_similarity": "0.6583988",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hgstcy1",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgt5cos",
            "score": 11,
            "text": "Sure but it does nothing to keep you informed. People checking out and not paying attention is exactly why we are where we are.",
            "title_similarity": "0.43102723",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hgsvhqg",
            "score": 2,
            "text": "And why is that idiot wearing a mask with a valve",
            "title_similarity": "0.3245666",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hgsxqx7",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgsy2cs",
            "score": -15,
            "text": "During the Trump era it was stressful. Trump and COVID",
            "title_similarity": "0.33092308",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hgt6qx3",
            "score": -15,
            "text": "Yea, avoiding anything bad, anything negative does \\*indeed\\* reduce stress. Its also a immature cop-out and something that should \\*not\\* be encouraged...",
            "title_similarity": "0.7249882",
            "sentiment_compound": -0.9261
        },
        {
            "id": "hgsgyrp",
            "score": 19,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgt8bzo",
            "score": 1,
            "text": "I tried to avoid the initial news on COVID when it began to expand out of Wuhan. Wanted to avoid the stress, but it became inevitable. Watched all the horror stories in Italy, enough to take it seriously and keep my family safe/informed, now only keep an eye out for any mandates or vaccine booster info, but back to ignoring most COVID news for my stress",
            "title_similarity": "0.5765833",
            "sentiment_compound": -0.9501
        },
        {
            "id": "hgt91je",
            "score": 7,
            "text": "Nurses heroes last year now getting fired... yikesssssssss",
            "title_similarity": "0.37714484",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hgt53cw",
            "score": -35,
            "text": "We have a responsibility to stay informed. Blissful ignorance is not worth it. Knowing the truth is more important than your mood.",
            "title_similarity": "0.61303556",
            "sentiment_compound": 0.6282
        },
        {
            "id": "hgtey6n",
            "score": -4,
            "text": "The \"Bad things cant effect me if I don't know they're happening\" response some people in this thread are having is really stupid. Literally choosing to be ignorant because it's easier.",
            "title_similarity": "0.66363525",
            "sentiment_compound": -0.7574
        },
        {
            "id": "hgsxij6",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgsv3r0",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgsmp2v",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.21614832"
        },
        {
            "id": "hgt6vg1",
            "score": 53,
            "text": "The pandemic has nothing to do with it.  Okay maybe a bit, but only the pandemic-related news.  The rest of the news would be soul-crushing at any other time. To think that America is about to Thelma and Louise itself over a cliff is plenty disheartening without the covid issues.  I honestly believe I have nothing to look forward to.",
            "title_similarity": "0.5070334",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hgt7fsa",
            "score": -1,
            "text": "I can attest to this, I got into crypto this year.",
            "title_similarity": "0.28999513",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtnnst",
            "score": 6,
            "text": "Social media exasperated this pandemic.  (Hint: if you can fire healthworkers, it's not a pandemic)\n\nWe didn't see this mass masteria with H1N1",
            "title_similarity": "0.5828834",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hgt6plq",
            "score": -5,
            "text": "I did that, then I tuned back in and realized the earth was dying faster than I thought. Ignorance is bliss. Awareness is suicide.",
            "title_similarity": "0.6370919",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hgt3m0t",
            "score": 40,
            "text": "On the other hand the BBC in the uk has almost given up on reporting on the pandemic and they have amongst the worst infection and death numbers in the world.  \n\nSo what I'm saying is don't obsess but also don't be ignorant of the very present danger.",
            "title_similarity": "0.60544837",
            "sentiment_compound": -0.7451
        },
        {
            "id": "hgt6p7c",
            "score": 1,
            "text": "Crap, well I fucked up by reading this news article",
            "title_similarity": "0.44278994",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hgtnki5",
            "score": 2,
            "text": "It’s literally the only thing they talk about it. It’s like they don’t want us to forget about it or something. **scratches head**",
            "title_similarity": "0.40612438",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hgt7dr9",
            "score": -6,
            "text": "I get my news from reddit at this point. If its big enough to matter I'll hear about it",
            "title_similarity": "0.45208865",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hgsgxio",
            "score": 35,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgt6obp",
            "score": 11,
            "text": "I literally deleted my news app and it's improved my life a lot. Information i need to know gets passed along by family and friends, so i really don't feel any less informed.",
            "title_similarity": "0.6059449",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hgt6jde",
            "score": 26,
            "text": "I got vaccinated and stopped paying attention. I couldn’t handle it anymore.",
            "title_similarity": "0.4024987",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hgtaoch",
            "score": 3,
            "text": "Never thought I'd say this, but listening to Russel Brand has been enlightening. Independent news analyst, an0maly is legendary energy.",
            "title_similarity": "0.5416106",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hgtg2x2",
            "score": -3,
            "text": "ah yes, the ol' head in the sand maneuver.  It may prove beneficial to one's sense of security in the short term, but i'm skeptical it provides any benefit beyond that...",
            "title_similarity": "0.6207329",
            "sentiment_compound": 0.6757
        },
        {
            "id": "hgtd5y9",
            "score": 7,
            "text": "The news: The world is ending and it’s your political enemy’s fault!!!!!!!!",
            "title_similarity": "0.4476034",
            "sentiment_compound": -0.5951
        },
        {
            "id": "hgt9xsd",
            "score": 0,
            "text": "yeah I mean. Ignorance is bliss I guess",
            "title_similarity": "0.48758847",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hgta3tm",
            "score": 0,
            "text": "I’ve avoided the news for the past couple of months and feel much better because of it. I also left Facebook because a bunch of people (my father included) decided to spout their own ideas about the virus. I agree with this post. Just play COD warfare and forget about all the other stuff.",
            "title_similarity": "0.60246617",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hgtbjvk",
            "score": 4,
            "text": "This is true. At the start at the BLM protests after George floyds death, i got super political. I would only make friends who shared my same views and I looked at everyone solely on politics. One day I realized how problematic it was. Everytime I saw news pop up on YouTube, I'd just tell YouTube to stop recommending it and after a week my YouTube had no politics. It's also why I don't go on reddit too much because so much of it is politics. This sounds like bad advice but don't be too informed. It's for your own good",
            "title_similarity": "0.4796229",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hguf72b",
            "score": 0,
            "text": "Wow. I would have never guessed that having reports all day every day just scream death, death, death in my face would negatively impact my mental health. Who would have thunk?",
            "title_similarity": "0.54770195",
            "sentiment_compound": -0.891
        },
        {
            "id": "hgunx6t",
            "score": 0,
            "text": "i wonder what the study says for people like me who avoid 24/7 news but have religiously watched daily show (both stewart and noah) every day it’s aired since at least 2000.\n\nit’s been a great way to get my news. it’s real stuff and sometimes depressing but the sprinkled in humor throughout makes it a great way for me to digest my news daily",
            "title_similarity": "0.50201",
            "sentiment_compound": 0.9136
        },
        {
            "id": "hgszsf9",
            "score": 5,
            "text": "For positive news that's not just feel-good stories about rescued kittens or small individual acts of kindness, check out https://futurecrun.ch/goodnews . It's an aggregator for systemically good news!",
            "title_similarity": "0.58502674",
            "sentiment_compound": 0.9117
        },
        {
            "id": "hgt8o8f",
            "score": 5,
            "text": "For me it was social media avoidance that kept me sane throughout. And now that I’ve done without it I don’t really know if I care to return.",
            "title_similarity": "0.56526935",
            "sentiment_compound": 0.128
        },
        {
            "id": "hgtbgvl",
            "score": 4,
            "text": "I liked Bill Burr's take on it.  Check the news each week to see if it's masks or no masks, then ignore until next week",
            "title_similarity": "0.53739727",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hgsz90s",
            "score": 15,
            "text": "[deleted]",
            "title_similarity": "0.24809143"
        },
        {
            "id": "hgsyv22",
            "score": -5,
            "text": "Yep. Because you can count on one hand the countries that are putting lives ahead of money.\n\nEven then you'd have to listen to the morons protesting and refusing to listen to the rules.",
            "title_similarity": "0.49536467",
            "sentiment_compound": -0.34
        },
        {
            "id": "hgt6lua",
            "score": 7,
            "text": "Richard Stallman was right again.\n\nhttps://stallman.org/articles/dont-watch-covid-tv.html",
            "title_similarity": "0.5064875",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgsyzxz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgt6qz4",
            "score": 1,
            "text": "The pandemic led to sudden career change and two mental health stays during the course, but ultimately has given me the step back I’ve clearly needed to get my physical and mental health due attention. It’s a whole other world since this started, for worse and better. That’s a vague description, but it’s very complicated. It’s feels like ten years in only under two years. 2020 and recovering from it in 2021 has been crazy. Last year went full Girl, Interrupted bad. I just want the selfish antivaxxers  to end the crazy and get with it. But, I’m glad there’s a protest getting underway in labor work and opening up better opportunities and conditions. I’ll leave a salaried career and “benefits” for service positions easily if they pay fairly for it. The small businesses and franchise owners just don’t like they’ve been called bull on and whine “people just don’t want to work”. 15-20 an hour, or minimum wage plus tips. It’s that simple. It’s still bull to rely on tips at all, but potentially leads to good income beyond standard if the business isn’t poorly run.",
            "title_similarity": "0.5763056",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hgt6vib",
            "score": 1,
            "text": "Hmmm yes, the floor here is made out of floor. \nBut really, the same could be said even before covid, looking at the news always gave me a sense of dread due to how bleak it always was.",
            "title_similarity": "0.40505165",
            "sentiment_compound": -0.4854
        },
        {
            "id": "hgt7m35",
            "score": 1,
            "text": "Six months after the pandemic hit I was plagued with the most dreadful anxiety that I have ever  experienced. After lots of work and a number of lifestyle changes I can now say I’m nearly anxiety free, without the use of prescription drugs. Through this I learned by totally cutting it out that news consumption contributed to my anxiety more than anything else. I never wanted to stay away from the news because I never wanted to be ill-informed or ignorant. This way of thinking has totally changed. I am now proud that I am able to tune out news reports and the happenings of today. At times I will feel an urge to get caught up, I may take a gander, but I will never allow it to trigger me or cause an emotional response. Not only is news bad for your mental health, it’s pointless. It’s a reel of lies, deceit and bias confirmation, on both sides. Find a hobby cut the news!",
            "title_similarity": "0.596848",
            "sentiment_compound": -0.9582
        },
        {
            "id": "hgt8edc",
            "score": 1,
            "text": "I feel like a more accurate conclusion, which is also less sensational and more obvious, is “news obsession is associated with worse mental well-being”",
            "title_similarity": "0.8141621",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hgt9zs8",
            "score": -1,
            "text": "Oh yea let’s all avoid the news so that politicians and rich people can lie to us more.",
            "title_similarity": "0.4412282",
            "sentiment_compound": 0.34
        },
        {
            "id": "hgta5dg",
            "score": 1,
            "text": "I used to just read NPR for news but had to stop because my anxiety surrounding covid was so high. I feel much better without the news. I still peek at it once in a while, but I feel my anxiety spike almost immediately. I’m a RN so I feel like I’m in the know about covid. I am curious about other things in the world, but covid news really hits me hard, especially now that I have a newborn. It feels like he’s so vulnerable.",
            "title_similarity": "0.5854279",
            "sentiment_compound": 0.6137
        },
        {
            "id": "hgtaeml",
            "score": 1,
            "text": "We present to you, Today in “Duh”",
            "title_similarity": "0.19575667",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtbno4",
            "score": 1,
            "text": "Ignorance is bliss, yes.",
            "title_similarity": "0.4823656",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hgtsx4b",
            "score": -1,
            "text": "Well, yes, this is why denial is a thing. It may or may not be adaptive but it does reduce distress.",
            "title_similarity": "0.73669326",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hgtt7tw",
            "score": -1,
            "text": "And less knowledge on how to protect your family. It wasn't fun, but i don't regret the 100s of hours i spent researching. Looking back I grade myself 99/100. Learning how to protect my family from covid19 was one of my proudest achievements.",
            "title_similarity": "0.5651508",
            "sentiment_compound": 0.9052
        },
        {
            "id": "hgvbf01",
            "score": -1,
            "text": "I’d like to see how that is compared with physical health of the same people.  Your mental health is going to probably be wrecked if you catch covid or have a spouse die from it.  It may have an effect similar to putting things on the back burner.  No issues short term but when you get hit, it’s really bad.  \n\nSurely there is a happy medium between them.  Did they say where that is?",
            "title_similarity": "0.72715616",
            "sentiment_compound": 0.4268
        },
        {
            "id": "hgski9x",
            "score": 57,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgsn6sh",
            "score": 39,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgtakjs",
            "score": 8,
            "text": "That coronavirus sub was nice in the beginning of the pandemic but quickly became almost a fear porn sub. I feel bad for people who hang out on that sub regularly",
            "title_similarity": "0.63373464",
            "sentiment_compound": -0.8286
        },
        {
            "id": "hgt74sj",
            "score": 2,
            "text": "It would be awesome if half of the news wasn’t covid related.",
            "title_similarity": "0.540774",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hgt8xhe",
            "score": 2,
            "text": "The news sells anger, fear and hate and their consumers are addicts.",
            "title_similarity": "0.49552912",
            "sentiment_compound": -0.891
        },
        {
            "id": "hgtcgr8",
            "score": 2,
            "text": "Time for r/NoNewsNovember :)",
            "title_similarity": "0.29007378",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hgtfwj7",
            "score": 2,
            "text": "News is mostly fake anyways",
            "title_similarity": "0.43960282",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hgtfwrs",
            "score": 2,
            "text": "Of course, because you don't have everyone telling you to be afraid of everything, and you get to just live your life.",
            "title_similarity": "0.46136713",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgslgtb",
            "score": 16,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgt6qpd",
            "score": 265,
            "text": "News isn’t designed to improve your life. It’s designed to get you to consume more news.",
            "title_similarity": "0.5863557",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hgt8noo",
            "score": 2,
            "text": "Obviously, they have been posting death numbers for the past, I don’t even remember how long and expecting people not to envision a death clock.",
            "title_similarity": "0.3042714",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hgt94bo",
            "score": 3,
            "text": "Dam all removed post pro nurses???",
            "title_similarity": "0.3110445",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgt9ko6",
            "score": -3,
            "text": "I went almost 3 months without anything. Even stayed off after RBG died. That was tough. But even through that (also I was laid off that whole time and then some) I stayed away. After Trump got Covid though I couldn’t stay away. \n\nOf course I’m talking social media. If we got news more from places without comments sections, that might help.",
            "title_similarity": "0.44123495",
            "sentiment_compound": 0.25
        },
        {
            "id": "hgte9no",
            "score": 2,
            "text": "I'd like to know the impact of watching the news but doing your own research on the side. I can understand people who take the news/government seriously being extremely stressed about covid, believing their healthy children are at risk etc. But man, people's stresses could have been so easily tampered by just doing a little bit of their own research. I'll never understand why people are so resistant to it, especially when they're experiencing legitimate mental stress from something.",
            "title_similarity": "0.6290628",
            "sentiment_compound": -0.7554
        },
        {
            "id": "hgthbwz",
            "score": 3,
            "text": "News avoidance is better for mental health period.",
            "title_similarity": "0.8615843",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgsqgsm",
            "score": 25,
            "text": "These are reported numbers without a breakdown of news sources. I'd really like to see the difference between social media and forum based news (reddit), vs. cable news vs. less biased news (reuters, AP, etc.)",
            "title_similarity": "0.59811664",
            "sentiment_compound": 0.2467
        },
        {
            "id": "hgtcg3w",
            "score": 13,
            "text": "I just want the facts, no “opinion pieces”, or journos interviewing each other about what they think. I’m highly intelligent, well-educated, and don’t need my opinion pre-wrapped for me. Just give me the facts and I’ll make my own conclusions.",
            "title_similarity": "0.43725735",
            "sentiment_compound": 0.3384
        },
        {
            "id": "hgtdai7",
            "score": 13,
            "text": "Messaging from the top political leader in a crisis is critical to either calming people or creating panic.\n\nWe had the worst circus on TV and Twitter every single day (sometimes multiple times a day) for a year.\n\nAnd the media didn't help by running 24/7 banners about COVID.\n\nThe very nature of a novel virus means that you don't know much about it. Facts don't change day to day.\n\nOther than infection stats, all the speculation about Lysol for everything and toilet paper shortages made the misinformation problem worse. People want instant answers and there is no satisfaction or Nielsen ratings in \"we don't have any updates for a week or two\".\n\nIt's a paradox because it's important to be aware of current events but there's a toxic threshold people have whose hobby is watching the news.",
            "title_similarity": "0.47594726",
            "sentiment_compound": -0.8493
        },
        {
            "id": "hgskmj2",
            "score": 220,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgt110h",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgtd6j2",
            "score": 4,
            "text": "This combined with the fact that the media was basically used to \"choose\" the last sitting US President by their opponent, has led me to stop tuning into anything other than alternative media.\n\nOne person, you can vet, learn opinions and where they diverge. It's why I like who I watch.",
            "title_similarity": "0.5477624",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hgtl2d7",
            "score": 4,
            "text": "My personal view is that negative information is useful if it spurs you into productive and useful action to impact the situation.\n\nIf you're sitting there consuming information that makes you feel impotent, small, powerless and fearful in a world you can't influence, that's going to have a negative impact on your mental health.",
            "title_similarity": "0.72063136",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hgt29ub",
            "score": 74,
            "text": "One thing I have noticed and one thing I think that the media and government has been terrible at is contradictory messaging. You can find literally contradictory things said in news and press releases in the same day. \n\nThat’s why I’ve preached not reacting to every study and finding that gets a news story. Use common sense (washing hands, not touching mucus membranes, wearing a mask when in crowded areas, getting vaxxed, etc) and let the science work itself out on other stuff. Just because you see one day that masks are effective and the next day that they may not be as effective that doesn’t mean you need to react right away. Give it some time, let things settle and be peer reviewed and time tested. Otherwise you do nothing but stress yourself out and potentially fall into an filter bubble. It’s OK to not know everything.",
            "title_similarity": "0.6048416",
            "sentiment_compound": 0.5748
        },
        {
            "id": "hgt3bb4",
            "score": 36,
            "text": "News should play an important role, as it has for centuries. The problem now is for-profit news media, and almost no oversight by journalistic standards orgs.",
            "title_similarity": "0.47730199",
            "sentiment_compound": -0.1045
        },
        {
            "id": "hgsk5sv",
            "score": 62,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgtdspr",
            "score": 9,
            "text": "That's because the \"news\" is typically extremely bias fear mongering that (IMO intentionally) does not give you key components of the picture.",
            "title_similarity": "0.5814822",
            "sentiment_compound": -0.7379
        },
        {
            "id": "hgt6qv1",
            "score": 2041,
            "text": "I used to not read the news. Was constantly made to feel like an idiot. I was happy, care free, and a pleasure to be around.\n\nI got into my 30s and started reading the news regularly. I hold my own in conversations and generally command more respect. \n\nBut I am less happy, more bitter, and the world is less shiny in my eyes.\n\nI miss being more ignorant and silly.",
            "title_similarity": "0.60113716",
            "sentiment_compound": 0.7326
        },
        {
            "id": "hgta4xt",
            "score": 154,
            "text": "Everything is just SO dramatically over-sensationalized. I understand that some things that have happened the past few years HAVE been dramatic, but news reporting shouldn't have emotion in it. The facts should be reported, and people come to their own conclusions based on it.\n\nEven the picture for the article given in this post- close up of man with a mask on, eyes wide, dark foreboding colors in the background, accented by images of a virus looming dangerously.\n\nIt's all designed to provoke you and make you feel and react how the source wants you to feel and react. It's all an agenda.",
            "title_similarity": "0.5866668",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hgsmffn",
            "score": 150,
            "text": "[removed]",
            "title_similarity": "0.21614832"
        },
        {
            "id": "hgspwl5",
            "score": 535,
            "text": "If you avoid the news your mental health well-being will be better. Depending on which stations you watch this will also drastically affect your mental well-being. \n\nBack in 2011 I had family members that were in the news and watching how they skewed everything I have not watched since and I will not again. They have agendas and narratives for this they twist and turn things to cater to the viewing audience. They don't care about your well-being.",
            "title_similarity": "0.66325945",
            "sentiment_compound": -0.233
        },
        {
            "id": "hgsmb5m",
            "score": 207,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgsjibf",
            "score": 1671,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgt6m2d",
            "score": 4675,
            "text": "I like being informed, but the 24/7 network news cycle is worth avoiding",
            "title_similarity": "0.7155598",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgspels",
            "score": 165,
            "text": "Full Text available:\nhttps://www.tandfonline.com/doi/full/10.1080/21670811.2021.1957967",
            "title_similarity": "0.22314408",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgt6wt0",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgt7vuv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgt7wh2",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgt91x2",
            "score": 3,
            "text": "Now look at social media",
            "title_similarity": "0.1893788",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgt973n",
            "score": 2,
            "text": "I used to turn on the local news every morning to at least watch the weather and traffic while I got ready to leave for work. But then,   one day, for some reason, I didn't.  So my daughter (then 3 years old) asked why we weren't watching the \"who died show\".  Whoa.. It me like a metric fuckton of bricks. I haven't turned it on since. She's 16 now. I don't think I'll ever watch the \"news\" again.",
            "title_similarity": "0.35636735",
            "sentiment_compound": -0.25
        },
        {
            "id": "hgt9dic",
            "score": 1,
            "text": "I decided to dive into history so I had a better perspective on news today when I wanted to take a dive into it. It vastly improved my life.",
            "title_similarity": "0.6139565",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hgt9g35",
            "score": 2,
            "text": "So many removew around here.. did another snap happen",
            "title_similarity": "0.26042387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgt9mdh",
            "score": 1,
            "text": "I mean, ignorance is bliss?",
            "title_similarity": "0.47178662",
            "sentiment_compound": 0.296
        },
        {
            "id": "hgt9owj",
            "score": 2,
            "text": "News avoidance 24/7 is even better.",
            "title_similarity": "0.71061945",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgt9p6h",
            "score": 17,
            "text": "Gee, it’s almost like fear and anxiety are great tools. Who owns the news?",
            "title_similarity": "0.63874584",
            "sentiment_compound": 0.399
        },
        {
            "id": "hgt9pyd",
            "score": 1,
            "text": "Are you sure? You've only had like 2 1/2 years to study this.\n\nI think the covid distinction isn't really relevant. The news should b e avoided because it has become capitalism.",
            "title_similarity": "0.4848269",
            "sentiment_compound": 0.34
        },
        {
            "id": "hgt9qrh",
            "score": 2,
            "text": "And the award for most obvious headline goes to........",
            "title_similarity": "0.33686858",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hgt9qyp",
            "score": 1,
            "text": "I'm not watching the news. I'm not emotionally well.",
            "title_similarity": "0.34385937",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hgt9v5d",
            "score": 3,
            "text": "After 2016, I made a big effort to be informed and knowledgeable. Now? I’m not wealthy, powerful or influential enough to do much. Having a lot of knowledge for current events does nothing but make me miserable. It reminds me how powerless I am to change things.\n\nI scaled back on my news consumption and I feel better for it. I vote, I’m vaxxed, and I listen to Up First most days. I know enough",
            "title_similarity": "0.59035826",
            "sentiment_compound": -0.7202
        },
        {
            "id": "hgta23d",
            "score": 1,
            "text": "Ignorance is bliss, as they say.",
            "title_similarity": "0.51612425",
            "sentiment_compound": 0.296
        },
        {
            "id": "hgta97v",
            "score": 1,
            "text": "Laughs sarcastically, goes back to job in newsroom",
            "title_similarity": "0.42093894",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hgtadi9",
            "score": 1,
            "text": "I’m so mentally fit I didn’t even read this",
            "title_similarity": "0.30312687",
            "sentiment_compound": 0.4173
        },
        {
            "id": "hgtag8a",
            "score": 3,
            "text": "Because news media suck",
            "title_similarity": "0.43070424",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hgtakwr",
            "score": 1,
            "text": "Also find Facebook avoidance is good too",
            "title_similarity": "0.6277385",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgtalkr",
            "score": 1,
            "text": "I cut myself off from news at the beginning of the pandemic. I only looked at official sources for what the new regulations were each week. \nWhile everyone seemed stressed out I just focused on work and went hiking a lot. Working from home and taking breaks to play with the dog or chickens rather than read the news like I did in the office was great. I honestly felt less depressed last year than I had in a long time. I still avoid reading too much news.",
            "title_similarity": "0.47712344",
            "sentiment_compound": 0.7089
        },
        {
            "id": "hgtao8x",
            "score": 1,
            "text": "This made me realize I haven’t been on the Coronavirus sub in a long time. It’s been nice to take a break.",
            "title_similarity": "0.5416501",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hgtavox",
            "score": 1,
            "text": "I’ve had 1 coworker die of Covid, but he died from complications from antibody treatment. But I have had 2 take their lives. I’ve been asking people more often how are you and when they respond I respond with no really how are you doing if they need to talk they will if not then I just look dumb and that’s ok.",
            "title_similarity": "0.50091076",
            "sentiment_compound": -0.9393
        },
        {
            "id": "hgtb08s",
            "score": 1,
            "text": "That's what I've noticed here.",
            "title_similarity": "0.2120299",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtb15f",
            "score": 1,
            "text": "You can strike the words \"during the COVID-19 pandemic\"\n\nNews avoidance is and always has been good for you.",
            "title_similarity": "0.7036817",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hgtb8ji",
            "score": 1,
            "text": "My wife and I drastically downgraded our exposure to news and talk shows most of 2020 to preserve some sanity.  Watching too much news (which is mostly negative) is depressing as hell.\n\nIt’s a delicate balance of being informed but not to the point where it impacts mental health.",
            "title_similarity": "0.674262",
            "sentiment_compound": -0.705
        },
        {
            "id": "hgtb95x",
            "score": 1,
            "text": "So my instincts were right!",
            "title_similarity": "0.36733943",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtba4t",
            "score": 1,
            "text": "No cable tv for years and been off fb for months. I feel better than I have for a while",
            "title_similarity": "0.32437858",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hgtbiu7",
            "score": 1,
            "text": "Haha I haven't turn my tv on (to watch free to air tv) since March and I'm not even sure if that is March 2020 or March 2021",
            "title_similarity": "0.2074505",
            "sentiment_compound": 0.6529
        },
        {
            "id": "hgtbiwo",
            "score": 1,
            "text": "But are you reading this news?",
            "title_similarity": "0.3792646",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtbnq2",
            "score": 1,
            "text": "I think this is true, but not knowing what’s happening makes me even more worried. At such a pivotal time, I want to be well informed. I probably have engaged in it too much though, which has resulted in some mental discomfort.",
            "title_similarity": "0.6024542",
            "sentiment_compound": 0.1557
        },
        {
            "id": "hgtbqv5",
            "score": 1,
            "text": "News avoidance is associated with better mental well-being",
            "title_similarity": "0.86112726",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgtbs3y",
            "score": 1,
            "text": "I bet people without Facebook are generally happier too.",
            "title_similarity": "0.61066335",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hgtbsj7",
            "score": 1,
            "text": "I think news avoidance overall during any time would probably be better for mental well-being.",
            "title_similarity": "0.7892455",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgtbubz",
            "score": 1,
            "text": "How bout all the time",
            "title_similarity": "0.033735216",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtbyxj",
            "score": 1,
            "text": "News avoidance is very crucial to good mental well being in general, even before the pandemic. The whole purpose of news is to produce an emotional response and cause you to be more engaged, thus a perfect target for marketing. News (especially cable news) is there to make a profit first, don’t ever forget that. Same applies to nearly every online news publication. \n\nDuring the rare times my household does partake in news of any kind, it will be through our local stations who do not feel the need to embellish things so badly to generate the aforementioned emotion. Nice and boring, as news should be.",
            "title_similarity": "0.6675314",
            "sentiment_compound": 0.8949
        },
        {
            "id": "hgtc02x",
            "score": 1,
            "text": "Is this a trick. Don't know if I'm supposed to read it or avoid it.",
            "title_similarity": "0.4000587",
            "sentiment_compound": -0.34
        },
        {
            "id": "hgtc3sn",
            "score": 1,
            "text": "*news avoidance in general",
            "title_similarity": "0.42351758",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hgtc5jp",
            "score": 2,
            "text": "Because what was yesterdays news is often todays propaganda.",
            "title_similarity": "0.46363318",
            "sentiment_compound": -0.25
        },
        {
            "id": "hgtc71q",
            "score": 1,
            "text": "I have never watched any news channel except for a bit on Election Day last year and I think I am much better for it.",
            "title_similarity": "0.35661334",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hgtc95a",
            "score": 1,
            "text": "Man it’s almost as if not being bombarded by depressing events in the world makes people happier \n\nIt’s important to stay educated tho take the hit",
            "title_similarity": "0.74871534",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hgtcalu",
            "score": 1,
            "text": "I have avoided the news all my life. I am glad their are studies to back up my decision. My grandmother always puts on the news first thing in the morning and considers it so important it drives me crazy. She always want's me to come over but when I do she is more interested in the news alot of the time and I come there to visit her and make her happy. I have other things I would much rather do but I go visit her instead. For the past year I have not been following politics or news and I don't regret it even mildly. When you stop caring about those two you realize how unimportant it was.",
            "title_similarity": "0.49147755",
            "sentiment_compound": 0.9165
        },
        {
            "id": "hgtcfgc",
            "score": 1,
            "text": "So you’re saying the floor IS made of floor??",
            "title_similarity": "0.22920515",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtct1b",
            "score": 1,
            "text": "TBH news is over rated imo. I have like 10 fucks to seriously give a day, and I do so much better when I give them to things I am directly involved in and which contribute to my personal and communal well being/progress. News has little place in that for me personally. \n\nThe more I've unplugged from things I cannot affect, and which ultimately don't change any of the major responsibilities I am engaged in in my life, the better my life gets. The better I perform in my roles as well. \n\nNews is over rated, I am open to hearing why other disagree however.",
            "title_similarity": "0.62240267",
            "sentiment_compound": 0.8744
        },
        {
            "id": "hgtcudv",
            "score": 1,
            "text": "Unless you live in a country like Taiwan \"200 days without a local case\", \"cluster case, here's some money\", \"ok we are back to 0 local cases here's another stimulus\"",
            "title_similarity": "0.32578722",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hgtcvc9",
            "score": 1,
            "text": "Does CNBCs Mad Money count? Haha",
            "title_similarity": "0.36606786",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hgtd5uw",
            "score": 1,
            "text": "Obviously. They're not news; talk shows is a better representation.",
            "title_similarity": "0.6475456",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hgtd99e",
            "score": 1,
            "text": "Vice News is the Best",
            "title_similarity": "0.48620832",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hgtdajn",
            "score": 1,
            "text": "Lack of awareness in general about the horrors of the world is associated with better mental well being.",
            "title_similarity": "0.85143113",
            "sentiment_compound": -0.25
        },
        {
            "id": "hgtdc29",
            "score": 1,
            "text": "I follow the science and will no longer care about news.",
            "title_similarity": "0.4102187",
            "sentiment_compound": -0.5897
        },
        {
            "id": "hgtdctb",
            "score": 1,
            "text": "I want to become a hermit. Any exposure to the world right now just fucks you up. I wanna go hide in a mountain and wait for the seas to rise.",
            "title_similarity": "0.38954937",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hgtdeiv",
            "score": 1,
            "text": " News avoidance period",
            "title_similarity": "0.38731098",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hgtdi13",
            "score": 1,
            "text": "In the past several years I've found myself stuck in a constant internal struggle of wanting and feeling like I have an obligation to stay informed and aware of what is going on in the world and trying to regulate my news intake for the sake of my mental health. It's a very fine line.",
            "title_similarity": "0.5033098",
            "sentiment_compound": 0.2006
        },
        {
            "id": "hgtdith",
            "score": 1,
            "text": "I feel like i need to with all the crazies. I have mixed race marriage in Tennessee.  Don't want to wake up one day with police or gangs hunting us. Have diabetes so being informed is important with mutating virus. News makes me feel bad but im protecting family",
            "title_similarity": "0.516294",
            "sentiment_compound": -0.0544
        },
        {
            "id": "hgtdivk",
            "score": 1,
            "text": "So avoid clicking on this article?",
            "title_similarity": "0.2678786",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hgtdk8k",
            "score": 1,
            "text": "500\n\nWe were unable to complete your request.\nPlease try again later, or return to Postlight Mercury.",
            "title_similarity": "0.3464802",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hgtdmzo",
            "score": 1,
            "text": "People see too much of it anymore. Somethings are just best left unseen by the masses.",
            "title_similarity": "0.44736722",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hgtdpn2",
            "score": 1,
            "text": "It’s also associated with a better understanding of the science of Covid-19.",
            "title_similarity": "0.61930096",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hgtdsad",
            "score": 1,
            "text": "Idk. I just keep monitoring news just to see if politicians go idiots or ego monsters using this chance, or if it is and it's quite irreversible, if I should move to another country.",
            "title_similarity": "0.52210677",
            "sentiment_compound": -0.0626
        },
        {
            "id": "hgtdsie",
            "score": 1,
            "text": "But fear porn drives my ever decision!",
            "title_similarity": "0.4206624",
            "sentiment_compound": -0.68
        },
        {
            "id": "hgtduuy",
            "score": 1,
            "text": "Hi, welcome to GameStop where real life is a simulation.\n\nHODL",
            "title_similarity": "0.33006972",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hgtdwgt",
            "score": 1,
            "text": "Why be informed? Being constantly reminded of all the different ways the world is fucked and how you're powerless to help doesn't serve anyone.",
            "title_similarity": "0.36325118",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hgte0jj",
            "score": 1,
            "text": "News avoidance leaves you better informed and in a better mental well-being. What’s your point",
            "title_similarity": "0.8231673",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hgte2n4",
            "score": 1,
            "text": "24/7 News avoidance anytime is better for mental health.",
            "title_similarity": "0.79636085",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgte37l",
            "score": 1,
            "text": "Ignorance is bliss, unless you’re trying to predict the world and invest… then ya, you need to know.",
            "title_similarity": "0.6253699",
            "sentiment_compound": 0.296
        },
        {
            "id": "hgte88m",
            "score": 1,
            "text": "Well, there's a reason we say \"ignorance is bliss.\"  Staying informed does not always make you happy in a direct way, but the goal of life isn't always happiness.",
            "title_similarity": "0.6435649",
            "sentiment_compound": -0.0992
        },
        {
            "id": "hgtea9c",
            "score": 1,
            "text": "I was a news hound when I was twelve.  I knew exactly what was happening all around the world.  I especially loved the human interest stories and watched the news hoping for a lot of human interest stories.  \n\nOne day I decided to watch the local and world news and categorize exactly what type of stories they showed.  Disasters, crime, politics, entertainment, weather, traffic, sports, and one human interest story.  \n\nThat day i realized that I was wasting my time watching depressing or uninteresting stories and so I gave up watching the news entirely.  Haven't missed it once and I'm happier for not watching it.",
            "title_similarity": "0.47716767",
            "sentiment_compound": 0.8992
        },
        {
            "id": "hgteeak",
            "score": 1,
            "text": "This does not surprise me at all and not just during this pandemic. The press will go to great lengths to present nothing but bad news.  It is manipulative fear mongering. You can always look up what you want to know without subjecting yourself to a constant barrage of things wrong on the planet. As Stephen King once commented when asked how he found frightening things to write about. \"Just look at the newspapers! You are supposed to be afraid of everything.\"",
            "title_similarity": "0.58280236",
            "sentiment_compound": -0.8712
        },
        {
            "id": "hgteh3g",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgtei1r",
            "score": 1,
            "text": "Ignorance is bliss I guess.",
            "title_similarity": "0.5026119",
            "sentiment_compound": 0.296
        },
        {
            "id": "hgtej0r",
            "score": 1,
            "text": "Is this a surprise to anyone?",
            "title_similarity": "0.2874159",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hgterzy",
            "score": 1,
            "text": "This is completely consistent with my personal experience even before Covid.  After two months of foreign travel during which every day was a joy, I reflected on the main differences from my home life.  One big difference was virtually no TV, because it was in languages I do not speak.\n\nI began limiting my TV watching at home, particularly the news, but also by muting during commercials, which are even more manipulative and propagandizing than most news media.  I noted that I usually became agitated watching, and had fewer stressful, and more happy days when I didn’t turn on the TV.  Now if I watch anything, which I don’t most days, I watch comedies primarily and occasionally a film or a cooking/gardening/nature show.\n\nMy life is less stressful and I spend more time being physically active and doing the things I enjoy.  I still keep up with major current events via The New York Times, BBC and to a lesser extent, Reddit, all on my phone.\n\nI don’t need to know how these events change hour-to-hour or even day-to-day.  A big picture, broader perspective does not have the breathless urgency that screaming headlines use to capture consumers.  My mood is much better most of the time and I have a fuller life.",
            "title_similarity": "0.51101565",
            "sentiment_compound": 0.7703
        },
        {
            "id": "hgtf3t5",
            "score": 1,
            "text": "Maybe mental health is not the hill to die on here. Maybe the survival of the nation and planet matter more.",
            "title_similarity": "0.6806311",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hgtf6hk",
            "score": 1,
            "text": "So...ignorance truly is bliss, eh?",
            "title_similarity": "0.52158284",
            "sentiment_compound": 0.765
        },
        {
            "id": "hgtff7p",
            "score": 1,
            "text": "I was avoiding news long before COVID.",
            "title_similarity": "0.36593652",
            "sentiment_compound": -0.34
        },
        {
            "id": "hgtffy6",
            "score": 1,
            "text": "The type of comments I see in Reddit makes me even more depressed",
            "title_similarity": "0.47193468",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hgtfh7o",
            "score": 1,
            "text": "I remember when the news was 30 minutes at dinner time.  And that was plenty",
            "title_similarity": "0.27292067",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtfi72",
            "score": 1,
            "text": "The real world is so awful all we can do is try to distract ourselves away from it.",
            "title_similarity": "0.46399528",
            "sentiment_compound": -0.7241
        },
        {
            "id": "hgtfkdb",
            "score": 1,
            "text": "Fact.  I quit the news for a while.  I decided that even if the world was ending I sure as hell didn’t want to hear about it on the news.",
            "title_similarity": "0.45476758",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hgtfmjv",
            "score": 1,
            "text": "Yep, learned this mid summer last year. I get the info I need but then I’m out. I’ve been way happier.",
            "title_similarity": "0.46760973",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hgtfqwp",
            "score": 1,
            "text": "I haven’t watched the news regularly since just after 9-11, I get the general gist as needed, I find that following tv personalities that all of an agenda now does nothing but add gas to the fire of what’s happening now.  Before I stopped watching and listening to political radio, I was constantly stressed out and angry, best decision I ever made to become less “informed”. 24/7 doom And gloom, political football will make you crazy.",
            "title_similarity": "0.47139776",
            "sentiment_compound": -0.9542
        },
        {
            "id": "hgtfs66",
            "score": 1,
            "text": "PBS Newshour\n\nBBC News on PBS \n\nFrontline on PBS",
            "title_similarity": "0.29661572",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtftvt",
            "score": 1,
            "text": "Believe me when I say. Who tf watches the news? That’s all they talk about! Go live your life!",
            "title_similarity": "0.3919533",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtfzfs",
            "score": 1,
            "text": "How could you need science to verify this? It’s common sense",
            "title_similarity": "0.43069136",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtg3oq",
            "score": 1,
            "text": "I have no idea what’s going on and I’m happy as a clam",
            "title_similarity": "0.37971258",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hgtgad3",
            "score": 1,
            "text": "I’ve been avoiding the news for the last decade. Covid has nothing to do with it.",
            "title_similarity": "0.28356862",
            "sentiment_compound": -0.34
        },
        {
            "id": "hgtgbdb",
            "score": 1,
            "text": "This is one of the reasons I like the filtering possible here on the Reddit News section. I only do science and world news, and can scroll quickly through the headlines. Most of the news is easily characterizable through headlines. I tend to skip the stuff that is highly situational, like, “one guy did this one thing, oh, what a calamity” and pay attention to major world events. It’s been effective to help not get too emotionally consumed. \n\nOf course the science, even though often about small studies that don’t seem to bear fruit, is more rational and less hype. It does have the effect of leaving me a little more optimistic about the world (or at least it tends to fend off the hysteria).\n\nEdit: I try to stay away from all other sources of news. It keeps me coherent enough to participate in meaningful discussions, but has left me feeling a little more healthy, overall.",
            "title_similarity": "0.66108227",
            "sentiment_compound": 0.8938
        },
        {
            "id": "hgtgbfx",
            "score": 1,
            "text": "You got that right. After September last year I stopped worrying too much about it. I sleep better and sometimes I forget we're on a pandemic.\n\nIf positivity brought ratings to news stations we'd be ecstatic to leave the house.",
            "title_similarity": "0.6686302",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hgtgc7e",
            "score": 1,
            "text": "This is why I finally deleted my Facebook 3 months ago. Should have done so long before",
            "title_similarity": "0.4058404",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtgdmu",
            "score": 1,
            "text": "Twitter and Facebook newsfeeds are criminal.\n\nReddit as well. Is a cesspool of doom posts equally bad but obviously doesn't have the same reach.",
            "title_similarity": "0.533365",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hgtggts",
            "score": 1,
            "text": "Media avoidance at any time, esp. for profit media.",
            "title_similarity": "0.35157797",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgtghao",
            "score": 1,
            "text": "covid? i havent watched the news since trump was elected. my mental health is blooming.",
            "title_similarity": "0.44259095",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtgina",
            "score": 1,
            "text": "News avoidance in general is better for mental health\n\nI grew up in the 50s and 60s. We had one hour of TV news a night, and didn't always watch it.\n\nToday, it's possible to get a steady stream of very disturbing news every waking hour",
            "title_similarity": "0.5400373",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hgtgmiv",
            "score": 1,
            "text": "I’m sure this would stand with all new avoidance because it is all garbage.",
            "title_similarity": "0.40560427",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hgtgsq3",
            "score": 1,
            "text": "Well of course avoiding the fear mongering media would lead to a better mental well being.",
            "title_similarity": "0.8245976",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hgtgtsl",
            "score": 1,
            "text": "Ya I mean, being ignorant can really help you feel better. Still ignorant.",
            "title_similarity": "0.7285493",
            "sentiment_compound": 0.4005
        },
        {
            "id": "hgtgv7s",
            "score": 1,
            "text": "Generally speaking news avoidance is better for your mental well-being no matter what. I stay informed by going to bing or google and searching for \"news\" then read headlines. I usually avoid the overly partisan stuff and try to see what's going on without commentary",
            "title_similarity": "0.7073164",
            "sentiment_compound": -0.2672
        },
        {
            "id": "hgtgvzj",
            "score": 1,
            "text": "I had so much anxiety around it I had to filter it off my home/all on Reddit, helped a lot.",
            "title_similarity": "0.48125613",
            "sentiment_compound": -0.2449
        },
        {
            "id": "hgtgvzt",
            "score": 1,
            "text": "Ignorance is bliss. Who knew the saying holds true.\n\nTo bad this crummy article doesn’t clarify what “better mental well-being” means.",
            "title_similarity": "0.6239605",
            "sentiment_compound": 0.128
        },
        {
            "id": "hgtgx0w",
            "score": 1,
            "text": "Coulda told you that for free",
            "title_similarity": "0.34865642",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hgtgx2d",
            "score": 1,
            "text": "\"BUT AVOIDING THE NEWS IS PRIVILEGE!!!\"\n\nThe happy medium is you realize you cannot change what is happening or how others respond/act. Then you just read through to be informed and move on with your life. This carries over to interacting with other people which, unlike the news, can't be avoided. The truth is there is no reason to develop a toxic environment for yourself of news consumption just because society pressures you to be informed 24/7 (or guilty you into being miserable, because if you aren't miserable, you must be privileged, and if you are privileged, you are part of the problem). Just do things healthy for you and screw anyone telling you otherwise.",
            "title_similarity": "0.6912524",
            "sentiment_compound": 0.8545
        },
        {
            "id": "hgtgyr1",
            "score": 1,
            "text": "I block every spam bot I see who just post clickbait news articles. Makes their own titles and always embellish the truth. I want to see cats and funny stuff. Not 'were all going to die and the world is a terrible place news.'",
            "title_similarity": "0.40181646",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hgtgzdf",
            "score": 1,
            "text": "I'll bet this tracks during other times as well...",
            "title_similarity": "0.31820035",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hgth07k",
            "score": 1,
            "text": "News avoidance is associated with better mental well-being.",
            "title_similarity": "0.85437953",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgthg7i",
            "score": 1,
            "text": "I do this. That's not surprising. News today are PR for a doomsday cult, they can't seem to stop talking about how fucked up everyone is and how scared you should be.",
            "title_similarity": "0.5386453",
            "sentiment_compound": -0.9006
        },
        {
            "id": "hgthj94",
            "score": 1,
            "text": "(Not only during a pandemic.)\n\nStay up-to-date, but set your limits.",
            "title_similarity": "0.67078054",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgti1rk",
            "score": 1,
            "text": "As we all scroll through the news…",
            "title_similarity": "0.22757572",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgti25k",
            "score": 1,
            "text": "The number of posts here that boil down to “don’t read the news, you’ll just get depressed” is, well, frankly depressing.\n\nYeah, the state of the planet today is pretty depressing unless you’re a billionaire who thinks you can buy your way out of anything, but not knowing about it and not advocating to change it is no solution.  \n\n“Fat, drunk, and stupid is no way to go through life, son.”\n—Dean Wormer",
            "title_similarity": "0.500837",
            "sentiment_compound": -0.9031
        },
        {
            "id": "hgti2gg",
            "score": 1,
            "text": "And watching less news is also associated with absorbing much less propaganda.",
            "title_similarity": "0.6746692",
            "sentiment_compound": -0.1796
        },
        {
            "id": "hgti4bb",
            "score": 1,
            "text": "That includes reddit. I was shocked by how different my real-life dealings with covid were compared to what I saw on the news/reddit. Media was trying as hard as it could to convince us the world was ending meanwhile every single person I knew in real life who got covid never even got very sick and there were never lockdowns or mask reqs where I live, it was like two completely different worlds.",
            "title_similarity": "0.46281934",
            "sentiment_compound": -0.4201
        },
        {
            "id": "hgti978",
            "score": 1,
            "text": "I’ve been avoiding the news for years. Occasionally I read articles online, and if it’s important enough, I’ll hear it from someone else. It definitely increases my happiness. Most “news” is actually propaganda, not factual, and designed to incite fear and paranoia. No thank you.",
            "title_similarity": "0.6021941",
            "sentiment_compound": -0.3839
        },
        {
            "id": "hgtidky",
            "score": 1,
            "text": "I did this, and it works. The constant information of cases and deaths grind your mentality slowly.",
            "title_similarity": "0.5157762",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtiezr",
            "score": 1,
            "text": "Yes.  Let's all put our heads in the sand.  Can't imagine how that would backfire.",
            "title_similarity": "0.33643958",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hgtig1i",
            "score": 1,
            "text": "I am not surprised in the slightest. News is, and has always been negative to get a reaction.",
            "title_similarity": "0.5024773",
            "sentiment_compound": -0.656
        },
        {
            "id": "hgtilqi",
            "score": 1,
            "text": "given all the fear mongering and hate speech against the unvaccinated this is not surprising.",
            "title_similarity": "0.5271241",
            "sentiment_compound": -0.8595
        },
        {
            "id": "hgtinwf",
            "score": 1,
            "text": "I get all the news I need from the weather report.",
            "title_similarity": "0.23764655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtip2p",
            "score": 1,
            "text": "Reading QAnon nonsense isn’t the “news” though",
            "title_similarity": "0.48146743",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hgtir7d",
            "score": 1,
            "text": "I’m sorry I wasn’t paying attention.",
            "title_similarity": "0.37783903",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hgtizqn",
            "score": 1,
            "text": "Well, yeah, that’s why I stopped watching….",
            "title_similarity": "0.40160197",
            "sentiment_compound": 0.34
        },
        {
            "id": "hgtj30m",
            "score": 1,
            "text": "I want to avoid news but everyone around me likes to talk about economics, politics etc.",
            "title_similarity": "0.44346762",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hgtj3ht",
            "score": 1,
            "text": "I finally did something right :)",
            "title_similarity": "0.30465025",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hgtj5f3",
            "score": 1,
            "text": "How is it associated with physical well-being?",
            "title_similarity": "0.4272254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtj600",
            "score": 1,
            "text": "Ignorance is bliss, we already knew that. Did this really need to be studied?",
            "title_similarity": "0.5381913",
            "sentiment_compound": 0.296
        },
        {
            "id": "hgtj6g2",
            "score": 1,
            "text": "Miss the news and you're uninformed, watch the news and you're misinformed",
            "title_similarity": "0.515358",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hgtj7cy",
            "score": 1,
            "text": "\"During covid 19 pandemic\" is redundant.....",
            "title_similarity": "0.499657",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtj82o",
            "score": 1,
            "text": "Hmm someone had told us about this not too long ago…",
            "title_similarity": "0.28403816",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtjdkd",
            "score": 1,
            "text": "Especially when news outlets deliberately present the most doom and gloom to get click $ \n\nhttps://www.wbur.org/hereandnow/2021/04/05/news-media-negative-coronavirus",
            "title_similarity": "0.5455863",
            "sentiment_compound": -0.7818
        },
        {
            "id": "hgtjfp5",
            "score": 1,
            "text": "Its just blasting clickbait headlines so im just going through ps4 exclusives happy as can be",
            "title_similarity": "0.45839942",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hgtjhid",
            "score": 1,
            "text": "The media has had an absolute hay day, over covid 19. They love the chaos, and they profit from it, to our detriment. No wonder, avoiding the news will eye your mental stress, this is not rocket science at all.",
            "title_similarity": "0.5971525",
            "sentiment_compound": 0.1119
        },
        {
            "id": "hgtjie8",
            "score": 1,
            "text": "In a related study, murder victims were 100% calmer when they never saw it coming.",
            "title_similarity": "0.55818266",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hgtjl6p",
            "score": 1,
            "text": "Avoiding the news in general tbh",
            "title_similarity": "0.40180188",
            "sentiment_compound": -0.34
        },
        {
            "id": "hgtjszl",
            "score": 1,
            "text": "I shut it down three months ago and haven't looked back",
            "title_similarity": "0.20871408",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtk1w8",
            "score": 1,
            "text": "The news wants to make you scared so that you don't go out... and stay inside watching more news.",
            "title_similarity": "0.5702075",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hgtkk9s",
            "score": 1,
            "text": "It's a sad day when my mental stability is considered \"better\".",
            "title_similarity": "0.6798005",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hgtklux",
            "score": 1,
            "text": "I can attest to this. Often times I only scan the headlines online, & my entire outlook changes. I've even seen glimmers of my list sense of humor that's been missing since 2019.",
            "title_similarity": "0.3793114",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hgtknh4",
            "score": 1,
            "text": "So I see playing 500+ hours of Animal Crossing in the first two months of quarantine was a good thing",
            "title_similarity": "0.3828287",
            "sentiment_compound": 0.6077
        },
        {
            "id": "hgtkryw",
            "score": 1,
            "text": "Hearing about a highly contiguous virus and suddenly having to wash my hands extremely regularly while I'm a binmen where every second I had another resident wheelie bin in my hands felt awful hell every single day I went to work, I found it hard to breathe, turns out every morning when I left me home I was suffering a Panic attack when going in to work and kept having trouble with breathing all day\n\n\nNever in my life did I suffer a panic attack, I had no idea what it was and assumed I had Covid and it affected my breathing, I had access to testing kits and they back negative, but that means nothing when the news in the UK came out saying they got the result wrong.",
            "title_similarity": "0.38129258",
            "sentiment_compound": -0.9718
        },
        {
            "id": "hgtktut",
            "score": 1,
            "text": "After the election I completely tuned out to the average news and it's been so nice. No more arguments, no more fear mongering, no more freakouts. I just read interesting news from around the world and keep up with important stuff and that's it.",
            "title_similarity": "0.5189296",
            "sentiment_compound": 0.7574
        },
        {
            "id": "hgtkwwk",
            "score": 1,
            "text": "Of course being unaware of the daily tragedies that are blasted all over the news daily will make for a healthier outlook. Until log course you have to deal with sed outside world.",
            "title_similarity": "0.71986425",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hgtl6tb",
            "score": 1,
            "text": "Ignorance is blisssssssssss",
            "title_similarity": "0.45268673",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hgtlbm9",
            "score": 1,
            "text": "With the constant lying, fear mongering, and intentional flaming the flames of hysteria, does this surprise anyone?",
            "title_similarity": "0.4152216",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hgtldbl",
            "score": 1,
            "text": "Not surprising. The world is fucked up. Doesn't mean we should bury our heads in the sand, though. If the choice is knowledge or happiness, i choose knowledge. Anything else is cowardly and selfish. The problems don't dissapear just because you refuse to know of them.",
            "title_similarity": "0.6158644",
            "sentiment_compound": -0.9045
        },
        {
            "id": "hgtmarb",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.21614835"
        },
        {
            "id": "hgtmhzc",
            "score": 3,
            "text": "\"News avoidance ~~during the COVID-19 pandemic~~ is associated with better mental well-being\"",
            "title_similarity": "0.9633768",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgtmji4",
            "score": 1,
            "text": "News avoidance in general is associated with better mental health well-being.  If it’s on the TV, turn it off, if it’s on Facebook, ignore it.  If it has some weird web address (e.g. trueamericanews.net [maybe made up?], ignore it. \nAnd if it’s on anything f Facebook owns, for the love of the god people pretend to love, ignore it and report it.",
            "title_similarity": "0.74903286",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hgtmyie",
            "score": 1,
            "text": "\"The world sucks and those who ignore its problems feel less stress.\" There are three type of people: those who engage in the news cycle and feel constant anxiety over the state of the world. Those who ignore the news cycle because they understand that their mental health wouldn't be able to survive it, and the result would render them incapable of living a healthy life. And then you have the type of people who still don't understand how to open a Web browser without asking their progeny. As much as I hate staying informed in defiance of type-threes, it brings me comfort to know that, hopefully, in twenty years, everybody will understand the world better and work towards fixing it rather than fixation on their own bubbles.",
            "title_similarity": "0.626634",
            "sentiment_compound": -0.7584
        },
        {
            "id": "hgtmz8y",
            "score": 2,
            "text": "Makes sense. In my 30’s and I stopped watching the news in like middle school, it just seemed so depressing and depending on the channel it was all just their personal bias. Baffles my mind that people pretty much torture themselves with that garbage.",
            "title_similarity": "0.5129081",
            "sentiment_compound": -0.5949
        },
        {
            "id": "hgtn1w3",
            "score": 1,
            "text": "Yeah it's all just theater",
            "title_similarity": "0.1456812",
            "sentiment_compound": 0.296
        },
        {
            "id": "hgtnaqj",
            "score": 1,
            "text": "Sighing whilst working in a news room...",
            "title_similarity": "0.27069488",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtnjis",
            "score": 1,
            "text": "Used to have the news in the background while I cooked dinner. I realized it was making my kids anxious even though they weren’t watching it- just overhearing it.",
            "title_similarity": "0.50023705",
            "sentiment_compound": -0.25
        },
        {
            "id": "hgtnmln",
            "score": 1,
            "text": "I rang up my dentist and wanted to book in a checkup/cleaning and they gave me a far off date of 30th of October. I watch the news so rarely that I did not even realize that 26th October was the theoretical lockdown lift.",
            "title_similarity": "0.36507717",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtnue8",
            "score": 1,
            "text": "Twitter with selective search is better for me, as most rags have a paywall.",
            "title_similarity": "0.6036145",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hgtnuvm",
            "score": 1,
            "text": "And then there are people like me who work for a TV News station and have to endure the news for 40 hours a week....",
            "title_similarity": "0.18262768",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hgtnwck",
            "score": 1,
            "text": "I used to love Rising/Breaking Points but, man, this constant bombardment of terrible news and alarmist attitude was making me miserable. I've not only reduced my news intake, but increased the quality of the sources. Any free news site is full of speculation and nothingburgers. Luckily I am comfortable enough financially to pay for better news sources, but that may not be true for everyone. \n\nThere's a balance to be had between being informed and happy. Now that Trump is out of office it allows me to take a breath and separate from all this.",
            "title_similarity": "0.6455578",
            "sentiment_compound": 0.9473
        },
        {
            "id": "hgto0c0",
            "score": 1,
            "text": "News avoidance in general is better for mental health",
            "title_similarity": "0.8548076",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgto1kl",
            "score": 1,
            "text": "News avoidance in general is healthier. We don’t have news anymore...",
            "title_similarity": "0.7270466",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hgto6zb",
            "score": 1,
            "text": "Well of course because every newscast was, DEATH, FEAR , DEATH , YOUR NEIGHBORS ARE TRYING TO KILL YOU, DEATH, FEAR, FEAR, FEAR.",
            "title_similarity": "0.31627852",
            "sentiment_compound": -0.9891
        },
        {
            "id": "hgtoi1d",
            "score": 1,
            "text": "Too bad I’ll never see this article because I’m too busy avoiding the news.",
            "title_similarity": "0.35415572",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hgtonpn",
            "score": 1,
            "text": "It’s like no one knew the phrase “ignorance is bliss”",
            "title_similarity": "0.41715994",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hgtoo57",
            "score": 1,
            "text": "Yes, because it is all scare tactics, and everything is exaggerated. Fear gets clicks/views.",
            "title_similarity": "0.43858856",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hgtotq3",
            "score": 1,
            "text": "Was this actually something you guys needed to hear? Its a no brainer.",
            "title_similarity": "0.37151718",
            "sentiment_compound": -0.296
        },
        {
            "id": "hgtoxup",
            "score": 1,
            "text": "I'd say this is the case in general...",
            "title_similarity": "0.23662949",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtoy74",
            "score": 1,
            "text": "Me rn yeah, I was told during the day when I was out that we broke a new record in my state for covid cases and I went huh wow spooky and resumed to not pay attention",
            "title_similarity": "0.44218394",
            "sentiment_compound": 0.5417
        },
        {
            "id": "hgtp6f7",
            "score": 1,
            "text": "This is obvious to anyone who knows people who watch news all day.",
            "title_similarity": "0.22647865",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtp9gg",
            "score": 1,
            "text": "Ignorance is bliss!?!? Holy crap, no kidding.  Frankly, I'm loving it.",
            "title_similarity": "0.52389234",
            "sentiment_compound": 0.6307
        },
        {
            "id": "hgtpfp0",
            "score": 1,
            "text": "There's a healthy mix between the two. I'm vaccinated but recently went to an amusement park for the first time in 2 years and while I took all the proper safety precautions I had a blast. I went home and checked the news and the narrative was either covid was a hoax or gathering in large spaces with more than 3 people means you're a super spreader and an awful person.\n\nNobody in my group got sick, we all had fun. Sometimes you just have to listen to the science but turn off the news.",
            "title_similarity": "0.4918138",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hgtphhm",
            "score": 1,
            "text": "Funny thing is if one of our opponents said they avoid news for their well being, we'd be like \"oh yeah, the stick your head in the sand technique, why am I not surprised?\"",
            "title_similarity": "0.5933372",
            "sentiment_compound": 0.7035
        },
        {
            "id": "hgtpl5p",
            "score": 1,
            "text": "Because it's all propaganda.",
            "title_similarity": "0.2936242",
            "sentiment_compound": -0.25
        },
        {
            "id": "hgtppy0",
            "score": 1,
            "text": "You're damn right it is.\nCovid or non-covid, the News is nothing but negativity, and emotionally draining nonsense that has nothing to do with you. (Aside from covid)\nShed that one 10 years ago. Don't regret it at all.\nAnd even better, now that we have the Internet. You don't need television or cable news to stay informed anymore.",
            "title_similarity": "0.55817395",
            "sentiment_compound": 0.7185
        },
        {
            "id": "hgtpuvv",
            "score": 1,
            "text": "The news is entertainment. They want to report things in the most sensational ways to get you to click. They know how to play people's emotions",
            "title_similarity": "0.55853415",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hgtpysx",
            "score": 1,
            "text": "I figured this out 15 years ago.",
            "title_similarity": "0.16318242",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtq75l",
            "score": 1,
            "text": "News is a business. The truth is in books.",
            "title_similarity": "0.42886215",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hgtqcq4",
            "score": 1,
            "text": "Amen. I spent way too much time in 2020 invested in the news.  My drinking got out of control. 2021 has been much better",
            "title_similarity": "0.5845155",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hgtqnu4",
            "score": 1,
            "text": "It’s worked for me.\n\nI wish I could find an unbiased news source where I could quickly pick up the most important tidbits of the day in as unbiased form as possible, but that just isn’t realistic. These days you have to ingest several sources and weigh them all together in order to approach the truth, and frankly, I don’t have the time or energy for that.",
            "title_similarity": "0.5317042",
            "sentiment_compound": 0.7843
        },
        {
            "id": "hgtqtcb",
            "score": 1,
            "text": "So ignorance is bliss then.",
            "title_similarity": "0.50107914",
            "sentiment_compound": 0.2893
        },
        {
            "id": "hgtqwmg",
            "score": 1,
            "text": "I avoid the news and I am pretty happy. This is good news.",
            "title_similarity": "0.6345229",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hgtr0wy",
            "score": 1,
            "text": "Gee, guys, and religious people are happier than non-religious people!  I guess we'd better go pick up our favorite flavor of mythos and start lobbing those stones!  For happiness!",
            "title_similarity": "0.6274191",
            "sentiment_compound": 0.9297
        },
        {
            "id": "hgtr8t4",
            "score": 1,
            "text": "Same problem with organic farming where you can.",
            "title_similarity": "0.33241183",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hgtre35",
            "score": 1,
            "text": "the drama of the news hits your dopamine receptors and can be addictive.",
            "title_similarity": "0.5918541",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtrfcb",
            "score": 1,
            "text": "True, here in Mexico the government officially ended the pandemic this week, they don't talk about it anymore, media barely mentions it and all safety measures are now optional.\n\nWe have no vaccines, no hospitals and no meds, people die by the thousands daily but at least we are better mentally.",
            "title_similarity": "0.39896643",
            "sentiment_compound": 0.5337
        },
        {
            "id": "hgtrnbm",
            "score": 1,
            "text": "Denzel Washington said recently if you avoid the news you're uninformed, if you read the news your misinformed",
            "title_similarity": "0.62556523",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hgtrrd1",
            "score": 1,
            "text": "I've been avoiding the news. I read random stuff I see on here and avoid the news articles my phone populates. I'd rather see stories about nature and lots of subjects than bombard myself with Covid news. We all know how we should act, what to do, what the symptoms are. I don't need death counts or scary stories about how it could get worse.",
            "title_similarity": "0.5291709",
            "sentiment_compound": -0.7753
        },
        {
            "id": "hgtsd08",
            "score": 1,
            "text": "All news is crap? IMO... Just maybe we are better off not engaging for a few weeks at a time.",
            "title_similarity": "0.51442176",
            "sentiment_compound": -0.1867
        },
        {
            "id": "hgtse1g",
            "score": 1,
            "text": "I'd imagine news avoidance in general is associated with better mental well-being.",
            "title_similarity": "0.87203014",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgtsfdz",
            "score": 1,
            "text": "Same problem with organic farming where you can.",
            "title_similarity": "0.33241183",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hgtsir3",
            "score": 1,
            "text": "It's one thing to inform yourself but another if you're hooked to the screen like an addict",
            "title_similarity": "0.60238266",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hgtsnt1",
            "score": 2,
            "text": "Ya think? Ya think? It's true overall, avoid it all because it's all paid programming.",
            "title_similarity": "0.4704408",
            "sentiment_compound": 0.2406
        },
        {
            "id": "hgtssbq",
            "score": 1,
            "text": "Looks like I've had mental well-being my whole life then",
            "title_similarity": "0.33268732",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hgtsxcv",
            "score": 1,
            "text": "As a New York Jets fan, the news about my football team during COVID didn’t help either (sorry if this is too much of an r/nyjets inside joke but I couldn’t resist)",
            "title_similarity": "0.51874506",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hgtszw6",
            "score": 1,
            "text": "Avoiding a combination of lies and depressing truths can improve my mental health? \n\nRemember when articles said things we didn't already know?",
            "title_similarity": "0.807492",
            "sentiment_compound": -0.3527
        },
        {
            "id": "hgtt8nm",
            "score": 3,
            "text": "News avoidance all the time leads to even better health.",
            "title_similarity": "0.69085145",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgttgoh",
            "score": 1,
            "text": "I wouldn't even know there was a pandemic if it wasn't for the news. Nothing around here ever changed.",
            "title_similarity": "0.4469391",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgttjr6",
            "score": 1,
            "text": "Curiously, the pandemic also coincided with the Trump presidency, so one could instead argue that avoidance of the daily crises of his presidency provided a better mental wellbeing than for those who tuned in every goddamn day.",
            "title_similarity": "0.6960263",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hgtto73",
            "score": 1,
            "text": "That aint true bro. I never watch the news, and my mental well-being is fakked..",
            "title_similarity": "0.35735303",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hgttqpl",
            "score": 1,
            "text": "I was laid off and started working at a retirement home in March on 2020. There was a noticeable difference in the residents that didn’t watch the news and the ones that did. They ones that did watched it *all day* and they were always so anxious! The ones that didn’t were much more manageable and waaaaay less anxious.",
            "title_similarity": "0.4407321",
            "sentiment_compound": -0.5596
        },
        {
            "id": "hgttx9i",
            "score": 1,
            "text": "I myself tend to stick more of the financial news outlets as they take out a lot of the emotion in fear and only really look at it from an objective point of money in the economy. There is some fear based in there but when you’re dealing with institutional money and investors those guys tend to be more even keeled in regards to their emotions.",
            "title_similarity": "0.5335295",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hgtu28e",
            "score": 1,
            "text": "Unfortunately the news in general, is very negative. Even Covid19 aside, it makes sense that avoiding the news would make you better mentally.\n\nIts unfortunate that negative news is the money maker for news networks.",
            "title_similarity": "0.7164291",
            "sentiment_compound": -0.9117
        },
        {
            "id": "hgtu9le",
            "score": 1,
            "text": "So...ignorance is bliss?",
            "title_similarity": "0.47157872",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hgtuk06",
            "score": 1,
            "text": "I think my biggest concern is that the news is political. The news should just be the news, that’s it. We’ve got a system that is messed up and the people in charge benefit, so it so it continues. It’s a real shame.",
            "title_similarity": "0.60513127",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hgtut2r",
            "score": 1,
            "text": "Covid is the least of the problems right now tho",
            "title_similarity": "0.5022701",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hgtuy22",
            "score": 1,
            "text": "If you avoided the news, how would you know there’s a pandemic?",
            "title_similarity": "0.5751523",
            "sentiment_compound": -0.34
        },
        {
            "id": "hgtuz29",
            "score": 1,
            "text": "Makes you wonder about the mental health of anchors, editors, producers, reporters, etc.\n\nA lot of them don’t have the option to just turn off the news.",
            "title_similarity": "0.47577232",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtuzbm",
            "score": 1,
            "text": "Wikipedia’s front page is an extremely neutral source of world news",
            "title_similarity": "0.507136",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtv9cf",
            "score": 1,
            "text": "News avoidance in general has done wonders to my mental health. I stopped reading ALL news two years ago and my life has been much better since then. I have not observed any negatives.",
            "title_similarity": "0.63393795",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hgtvp0o",
            "score": 1,
            "text": "And in a related story, news avoidance is associated with better mental well-being.",
            "title_similarity": "0.8805517",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgtvypm",
            "score": 1,
            "text": "I would think news avoidance at ALL TIMES would be associated with better mental well-being :)",
            "title_similarity": "0.75520927",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hgtwas3",
            "score": 1,
            "text": "That’s me. Next up, Twitter and Reddit avoidance",
            "title_similarity": "0.34080333",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hgtwenb",
            "score": 1,
            "text": "When delta stuck India. Even if you turn off news, the phones or messages or whatsapp would keep up of some one suffering or dying.\n\nDying because they could not get into hospital. \n\nThat was the worst phase 2021 April to August.",
            "title_similarity": "0.51392424",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hgtwjoy",
            "score": 1,
            "text": "Watching the news doesn't make you informed...it makes you mis-informed.",
            "title_similarity": "0.53718615",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtwl67",
            "score": 1,
            "text": "I've been doing this for months now, my mornings were horrible... I now know all about Australias border policies though...",
            "title_similarity": "0.34126228",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hgtwzy4",
            "score": 1,
            "text": "news avoidance always, it will never help your mental attitude it's not designed to.",
            "title_similarity": "0.38183957",
            "sentiment_compound": -0.607
        },
        {
            "id": "hgtx5i9",
            "score": 1,
            "text": "Ha! That’s why I stick to only NFL news!\n\n*NYT bombshell drops*",
            "title_similarity": "0.42960396",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtxdzg",
            "score": 1,
            "text": "Probably so is not watching a train wreck. Or rubber necking on the highway. Checking the death counter in the early days of the pandemic felt out of my control",
            "title_similarity": "0.5059166",
            "sentiment_compound": -0.7783
        },
        {
            "id": "hgtxejy",
            "score": 1,
            "text": "Waaaaay ahead of you.  To quote Paul Simon. “I get all the news I need from the weather report.”",
            "title_similarity": "0.32783335",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgtxhmu",
            "score": 1,
            "text": "For now. Then we all stop paying attention until someone like Trump comes back and then we’re all glued to the news again stressed out. We need to pay some attention or else we will repeat our mistakes",
            "title_similarity": "0.45775056",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hgtxiyt",
            "score": 1,
            "text": "There is no news anymore. It’s all biased media. Long gone are the days of a trusted reporter giving you the facts, in context, and without opinion.",
            "title_similarity": "0.47551298",
            "sentiment_compound": 0.296
        },
        {
            "id": "hgty45z",
            "score": 1,
            "text": "This seems obvious to me, the overwhelming amount of negativity the media shoves down our throats is not healthy for anyone. I've been avoiding the news for several years now because I just can't seem to turn it on without hearing something negative, either shootings or lawsuits or people being offended or whatever else. I'm already the type of person that seems to subconsciously find the negative in things before the positive so I certainly don't need news saturation on top of that.",
            "title_similarity": "0.49668252",
            "sentiment_compound": -0.4908
        },
        {
            "id": "hgtybvl",
            "score": 1,
            "text": "I did that. I reduced to watching the the calm and trustworthy 15min of Tagesschau and getting tweets of my city with current stats. Before that I was constantly playing the news channel etc.",
            "title_similarity": "0.34844112",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hgtye8v",
            "score": 1,
            "text": "Yeap, not just new but social media too. Ever since i got out of FB, twitter, instagram in 2012 i became happier and not bothered by other people.",
            "title_similarity": "0.5090772",
            "sentiment_compound": 0.7931
        },
        {
            "id": "hgtymzn",
            "score": 1,
            "text": "News avoidance in general is good for mental health",
            "title_similarity": "0.7936094",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgtyprs",
            "score": 1,
            "text": "Relevant quote from the film Harvey (1950). \n\nElwood P. Dowd: *Years ago my mother used to say to me, she'd say, \"In this world, Elwood, you must be\" - she always called me Elwood - \"In this world, Elwood, you must be oh so smart or oh so pleasant.\" Well, for years I was smart. I recommend pleasant. You may quote me.*\n\nhttps://www.imdb.com/title/tt0042546/quotes?item=qt0420610",
            "title_similarity": "0.47622767",
            "sentiment_compound": 0.9559
        },
        {
            "id": "hgtyqyy",
            "score": 1,
            "text": "News avoidance ~~during the COVID-19 pandemic~~ is associated with better mental well-being",
            "title_similarity": "0.9712132",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgtyrda",
            "score": 1,
            "text": "*Also associated with worse physical well-being.",
            "title_similarity": "0.5175598",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hgtz3o7",
            "score": 2,
            "text": "This correlates with the bad mental health of the religiously virtue signaling left.",
            "title_similarity": "0.6077024",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hgtz5sd",
            "score": 1,
            "text": "Ignorance is truly bliss",
            "title_similarity": "0.4671805",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hgtzkj6",
            "score": 1,
            "text": "Well when you don’t read anything past its headline and take it at face value. \n\nAs well as watching a fair amount of news channels without double checking sources is gonna make that happen",
            "title_similarity": "0.64875853",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hgu00md",
            "score": 1,
            "text": "Makes lot of sense.  I was glued to the news for the first few months, mostly because I wanted to know what was going on, and because this whole thing is basically history in the making and at first was kind of \"interesting\" if that's the right word. Same feeling as when 9/11 happened in a way.  You just kind of get sucked in because of how crazy this event is.    But when it started to hit a few months, and started to become more and more political, I checked out.    I feel much better if I go a day without seeing news or anything to do with covid.  Ironicly I'm on Reddit and Facebook most of the time if I'm not doing anything productive...  but on days where I actually do something productive and find myself less on the computer I actually feel better.",
            "title_similarity": "0.5471148",
            "sentiment_compound": 0.7878
        },
        {
            "id": "hgu0ib3",
            "score": 1,
            "text": "British government was pretty open about the extent to which they deliberately inculcated fear in the populace to encourage compliance with NPIs.\n\n> inb4 \"conspiracy theory\": no, open admissions from SAGE or whoever\n\nUK gov propaganda was of the same kidney as the propaganda everywhere else, so it seems pretty clear that it was operating under the same logic\n\nSo this study basically vindicates behavioural psychology, is the point I'm trying to make",
            "title_similarity": "0.6144631",
            "sentiment_compound": 0.6771
        },
        {
            "id": "hgu0o90",
            "score": 1,
            "text": "Yea, I stopped caring about covid since I got vaccinated. And it feels better. I don't care how many new cases are detected. Only thing is local govs shutting down restaurants and pools even for vaccinated in some regions, because they measure positive cases and not hospitalizations.",
            "title_similarity": "0.5740152",
            "sentiment_compound": 0.7329
        },
        {
            "id": "hgu170e",
            "score": 1,
            "text": "Just don’t notify the people, It might cause a PaNdeMic",
            "title_similarity": "0.51124066",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgu18b1",
            "score": 1,
            "text": "That's why I use Internet Explorer",
            "title_similarity": "0.30765486",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgu1eh8",
            "score": 2,
            "text": "\nNews avoidance during life is associated with better mental well-being.",
            "title_similarity": "0.8624704",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgu1g6m",
            "score": 1,
            "text": "I think we could have saved a few words in that headline by saying \"News avoidance is associated with better mental well-being.\"",
            "title_similarity": "0.860185",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hgu287e",
            "score": 1,
            "text": "My partner only watches local news in the morning for the weather and traffic. Every now and then she asks me what is happening in the world. She's much better off for it. Her job has enough emotional stress as it is.",
            "title_similarity": "0.5137208",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hgu2b9v",
            "score": 1,
            "text": "It’s a real knife fight out there",
            "title_similarity": "0.18829829",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hgu2cma",
            "score": 2,
            "text": "Life is good with no news. Reddit IG and FB can still drag me down, but I’m pretty good at taking breaks when needed.",
            "title_similarity": "0.5864338",
            "sentiment_compound": 0.8422
        },
        {
            "id": "hgu2qvu",
            "score": 1,
            "text": "Oh yes, let's all ignore the rising authoritarian fascism in the Republican party.",
            "title_similarity": "0.4364297",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hgu3ber",
            "score": 1,
            "text": "It’s always the same like every generation thinking they discovered sex",
            "title_similarity": "0.24088487",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hgu3nxk",
            "score": 1,
            "text": "Never watch the news.\n\nI call it the depression show.\n\nAny TV in the day is depressing.",
            "title_similarity": "0.34873343",
            "sentiment_compound": -0.743
        },
        {
            "id": "hgu3tsi",
            "score": 1,
            "text": "Doesn't it always? I wish there was some place that just ignored small impact crime since it does not matter (yet another mass shooting being the threshold it should surpass). Happy news on the low level would be fine.\n\nBeing informed about the big stuff and becoming a happier person should be the goal of reading news.",
            "title_similarity": "0.74634206",
            "sentiment_compound": 0.5612
        },
        {
            "id": "hgu4gw9",
            "score": 1,
            "text": "We know this by now, there’s simply too much information for us to be healthily informed about anything.\n\nIt’s plausible these days for two similarly politically leaning people to read different articles about the same story but feel differently about the event simply because of the narrative of each article.",
            "title_similarity": "0.5216494",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgu4lfh",
            "score": 1,
            "text": "I completely pulled out of mainstream news for about 6 months and have only really been looking for a minute or two at a time since. It is toxic",
            "title_similarity": "0.31733888",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgu4nko",
            "score": 1,
            "text": "I mean you could rephrase this by saying ignorance is bliss, right?",
            "title_similarity": "0.6148657",
            "sentiment_compound": 0.296
        },
        {
            "id": "hgu4pau",
            "score": 1,
            "text": "I mean to be fair... those antivaxers who have no clue...often seem pretty happy. \n\nUntil they catch covid at least.",
            "title_similarity": "0.61441773",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hgu4x15",
            "score": 1,
            "text": "It's bizarre that some people are still not aware of that...",
            "title_similarity": "0.3362634",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hgu53xd",
            "score": 1,
            "text": "That’s why CNN took their COVID death count after Biden won",
            "title_similarity": "0.47372577",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hgu56id",
            "score": 1,
            "text": "Being in denial is in general great.",
            "title_similarity": "0.5229471",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hgu5w9d",
            "score": 1,
            "text": "Ignorance is bliss\n\nUntil your very ignorance causes you to get hit by a bus. Let's not associate ignorance with better mental well-being because\n\n1. mental wellness cannot be clumped up as a single state where it can only be polar good or polar bad. Most people are in-between and that is good \n\n2. You may be well mentally but your ignorance will cause you & others harm. Will cause, not may cause.",
            "title_similarity": "0.6616398",
            "sentiment_compound": -0.5635
        },
        {
            "id": "hgu6q5q",
            "score": 1,
            "text": "And if you stick your head in the sand you won't need sunglasses.",
            "title_similarity": "0.3822738",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgu6ra5",
            "score": 1,
            "text": "Cause what you don't know can't hurt you.",
            "title_similarity": "0.39837325",
            "sentiment_compound": -0.3213
        },
        {
            "id": "hgu6xm1",
            "score": 1,
            "text": "New has a short half-life. Read books.",
            "title_similarity": "0.38736326",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgu76ew",
            "score": 1,
            "text": "Listening to propaganda is bad for you.",
            "title_similarity": "0.49522573",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hgu7f2o",
            "score": 1,
            "text": "When it was all first licking off and quickly getting worse each day, I was obsessed with reading every news outlet I could. I even started getting a lot of neck pains from looking down at my phone 5X more than I normally would. I was also an anxious mess all day everyday. I eventually had to force myself to stop reading things.",
            "title_similarity": "0.3422405",
            "sentiment_compound": -0.9062
        },
        {
            "id": "hgu7gng",
            "score": 1,
            "text": "It seems obvious but I’m glad it was confirmed to an extent. If you couple the fact that we’re wired to look for potential threats to our lives with the fact that media profit is driven by views then it would seem natural that news coverage would be mainly negative and there would be a lot of it. Early humans who paid attention to a pretty butterfly over the rustling in the bushes got eaten, so because the ones who survived were the ones who focused on potential threats we (their descendants) are naturally going to look for more negative news. However, our ancestors didn’t have the constant upload of information and the vastness of information we have today. These days we have too many potential threats that we have the capacity to be aware of all at once which I imagine could lead to sense of anxiety from lack of control or a sense of helplessness and potentially depression thereafter. It doesn’t mean you should remain wholly ignorant of what’s going wrong in the world but moderation and context are key. So maybe watch local news every so often but not on a daily basis and certainly not throughout each and every day.",
            "title_similarity": "0.66883206",
            "sentiment_compound": -0.9538
        },
        {
            "id": "hgu83e0",
            "score": 1,
            "text": "To bad you can't get away from the news anywhere you go there's a news article about everything. Including Google itself",
            "title_similarity": "0.30779013",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hgu83ww",
            "score": 1,
            "text": "Its not dodging covid news that is making you happy its not watching tv",
            "title_similarity": "0.5094361",
            "sentiment_compound": 0.6119
        },
        {
            "id": "hgu86r4",
            "score": 1,
            "text": "This is true especially for older people.\n\nMy best friend and my bf have crazy moms bc of the news. My bf’s mom thinks the vaccine makes you infertile and is paranoid. My best friends mom said if he took a train to a restaurant we wanted to visit she would force him to stay in his bedroom for a week to quarantine because he’s selfish\n\nSo… yeah",
            "title_similarity": "0.44097096",
            "sentiment_compound": 0.9217
        },
        {
            "id": "hgu8x5k",
            "score": 1,
            "text": "Is that a verbose way to say \"ignorance is bliss\"?",
            "title_similarity": "0.5280678",
            "sentiment_compound": 0.296
        },
        {
            "id": "hgu91d3",
            "score": 1,
            "text": "Its true however I know people who know nothing about covid due to this.",
            "title_similarity": "0.43418783",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hgu9e2l",
            "score": 1,
            "text": "I'm pretty sure that was the case before Covid.  Have you seen the news?  Shits fucked.",
            "title_similarity": "0.42941612",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hgu9qns",
            "score": 1,
            "text": "i wonder if \"people should care about their mental health over being informed\" is a bi-partisan view?",
            "title_similarity": "0.6139452",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hguayxh",
            "score": 1,
            "text": "Well you lot went the distance then didn’t you?",
            "title_similarity": "0.32647282",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hgub1fs",
            "score": 1,
            "text": "its almost as if people are being manipulated by the media or something, really strange",
            "title_similarity": "0.43850872",
            "sentiment_compound": -0.5709
        },
        {
            "id": "hgub2ug",
            "score": 1,
            "text": "I'd make the argument that this is true in general, unrelated to covid. And I don't make this argument based on some plebian attitude towards news media, but rather the fact that \"negative information\" has a larger news value due to our inherent disposition towards loss/threat/death aversion.\n\nI'd also argue that the tendency to avoid news is largely due to wanting to escape the anxiety brought by being constantly bombarded by the reports of potential threats.\n\nI'd argue that there is no linear causal direction; rather that negative information may cause threat focus/fear, but threat focus/fear also cause us to seek out negative information. As far as I know, studies have shown that we have different neurological disposition towards being triggered into such threat focus/fear pattern.",
            "title_similarity": "0.7007277",
            "sentiment_compound": -0.9939
        },
        {
            "id": "hgubaak",
            "score": 1,
            "text": "I wonder if it's also better associated with Ignorance, Ignorance from all the good news of Vaccines, Ignorance from the Dangers of Tyrants that walk and control our lives, Tyrants who don't want people knowing they're controlled, Priviledge of those who have wealth and stability to continue living in bliss, while others starve and suffer, Priviledge of Ignoring those who starve amd suffer under the toil to keep their Priviledge for them. Bliss for those who see that this \"scientific\" article encourages Faith and Blindness of being Kept in the dark.\n\nBecause lest we know the suffering that surrounds us, we might want to do something. For those who don't want us to know, can keep us in the toil. Gods, Mortal and Laws of Nature/Physics alike, Tyrants everywhere.\n\nEmbedded into the fabric of reality. We are the food, and Reality finds its nourishment in our toil.",
            "title_similarity": "0.6401311",
            "sentiment_compound": -0.7464
        },
        {
            "id": "hgubh02",
            "score": 1,
            "text": "I know, that’s what I did.",
            "title_similarity": "0.16039425",
            "sentiment_compound": 0.0
        },
        {
            "id": "hguc9v8",
            "score": 1,
            "text": "I feel shorten news segments have heavily helped my mental health while still being informed. Like a 10 min podcast or read a summary email. I try to get different sources but limiting the amount I take in both with news and social media has been extremely helpful.",
            "title_similarity": "0.69557774",
            "sentiment_compound": 0.7086
        },
        {
            "id": "hguck8f",
            "score": 1,
            "text": "Ah yes, ignorance is bliss",
            "title_similarity": "0.47626734",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hgucq7y",
            "score": 1,
            "text": "Anecdotally I concur. I have shrunk my world over the last few years to include mainly just things I can control, and things I enjoy. There’s nothing wrong with keeping up with world events, but I don’t see the use agonizing over events which are far beyond my control and/or don’t affect me in any meaningful way.",
            "title_similarity": "0.6065633",
            "sentiment_compound": -0.0575
        },
        {
            "id": "hgud7tr",
            "score": 1,
            "text": "The news is attention harvesting for profit.   It’s not the “press” anymore and should no longer be granted the same 1st amendment protections until they change their revenue model or accept public funding.",
            "title_similarity": "0.54009664",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hgud8g4",
            "score": 1,
            "text": "I don't watch broadcast news anymore after ditching my TV license and it does make a big difference to mental health.",
            "title_similarity": "0.5916419",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgue0s3",
            "score": 1,
            "text": "Since I deleted the BBC News app from my phone last year I have definitely been way less anxious about covid. I still keep up with and follow all the guidelines, but yeah not seeing a daily infection rate and death count certainly helps my mood. Who da thunk?",
            "title_similarity": "0.629828",
            "sentiment_compound": 0.5341
        },
        {
            "id": "hgue38s",
            "score": 1,
            "text": "You mean not constantly having it reaffirmed how terrible life is actually makes you happier? No shiii.",
            "title_similarity": "0.6792873",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hguebpi",
            "score": 1,
            "text": "I deleted my Reddit account/app, switched off my news push notifications and stopped watching BBC news about 2 months into the first lockdown and damn my outlook on life got so much better so quickly!",
            "title_similarity": "0.4556109",
            "sentiment_compound": -0.1812
        },
        {
            "id": "hguf18h",
            "score": 3,
            "text": "Breaking:\n\nExaggerated fear mongering and panicking is bad for your mental health.\n\nColour me shocked!",
            "title_similarity": "0.55497044",
            "sentiment_compound": -0.9245
        },
        {
            "id": "hgufd5c",
            "score": 1,
            "text": "~~News~~ Media avoidance ~~during the COVID-19 pandemic~~ is associated with better mental well-being.",
            "title_similarity": "0.9376614",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgufk4e",
            "score": 1,
            "text": "Ignoring that the world is fucked is good for mental health, how shocking!\n\nOn a more serious note, most news sources are a terrible way to educate yourself.",
            "title_similarity": "0.64997417",
            "sentiment_compound": -0.8976
        },
        {
            "id": "hgufqgf",
            "score": 1,
            "text": "One of the few top level Reddit headlines I can agree with outright",
            "title_similarity": "0.4816923",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hgug0fb",
            "score": 1,
            "text": "I was having legit panic attacks during the lockdowns because of things like rent and food so..yeah.",
            "title_similarity": "0.4414372",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hgug0xq",
            "score": 1,
            "text": "I have come to the realization that the need to feel informed about current events is consistently pushed by media.",
            "title_similarity": "0.3465407",
            "sentiment_compound": 0.0
        },
        {
            "id": "hguh14m",
            "score": 1,
            "text": "politics is intentionally toxic. social contagion spreading psychosis. And all them folks convinced themselves they’re sane",
            "title_similarity": "0.6419676",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hguh61n",
            "score": 1,
            "text": "Probably cheaper since the original is satire",
            "title_similarity": "0.63696486",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hguh69v",
            "score": 1,
            "text": "Bless up animal crossing",
            "title_similarity": "0.29853165",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hguhkhn",
            "score": 1,
            "text": "That says all you need to know about what media has become. Just get it out of your life asap.",
            "title_similarity": "0.34704027",
            "sentiment_compound": 0.0
        },
        {
            "id": "hguht54",
            "score": 1,
            "text": "The school I work at just received an unsolicited shipment of about thirty 200-page booklets for teachers titled \"COVID-19 and Your Mental Health.\" You know what would help our mental health? Not teaching in unsafe conditions during a global pandemic and not having even more reading and homework to do during that time.",
            "title_similarity": "0.45005327",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hguiagj",
            "score": 1,
            "text": "I mean ignorance is bliss",
            "title_similarity": "0.4952288",
            "sentiment_compound": 0.296
        },
        {
            "id": "hguidx7",
            "score": 1,
            "text": "I'm not surprised with this at all. I tend to avoid 95% of all news sites and stations. Cannot stand all the negativity and violence.",
            "title_similarity": "0.3786723",
            "sentiment_compound": -0.8825
        },
        {
            "id": "hguijul",
            "score": 1,
            "text": "It got a lot easier to avoid when I didn't have to nervously check that my world leader wasn't threatening nuclear war on a country over twitter every day.",
            "title_similarity": "0.61392176",
            "sentiment_compound": 0.7885
        },
        {
            "id": "hguiw51",
            "score": 1,
            "text": "I don't even have cable, but all of my coworkers do their own research, so I've got that going for me. Fml",
            "title_similarity": "0.19658089",
            "sentiment_compound": 0.0
        },
        {
            "id": "hguja7u",
            "score": 1,
            "text": "I feel always better without news, covid or not",
            "title_similarity": "0.543798",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hgujy2e",
            "score": 1,
            "text": "Worked well before covid too.",
            "title_similarity": "0.38855037",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hgujyc6",
            "score": 1,
            "text": "All news avoidance is",
            "title_similarity": "0.24311534",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hgukjn6",
            "score": 1,
            "text": "Since when is supporting people burying their heads in the sand scientific?",
            "title_similarity": "0.32151657",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hgukufy",
            "score": 1,
            "text": "Maybe if the news was a actually about truth, not left agenda or right agenda. News should be unbiased facts. Now it’s just a laughable questionable source. Where we actually have to look up if that news article is truth or lies.",
            "title_similarity": "0.5822021",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hgul7gr",
            "score": 1,
            "text": "I never watched the news. I don’t care about any of you or what happened.",
            "title_similarity": "0.17752373",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hgul9hc",
            "score": 1,
            "text": "During the first few weeks of Covid I had to work 24/7, as being responsible for moving all of our company assets from the office to the cloud, so I had barely any time to watch the news. As much as the pandemic was worrisome, I felt fine, mentally stronger than ever, and am still riding that effect. \n\nMy then partner was out of work and constantly on the 24/7 news cycle, and her mental health was deteriorating almost day by day. That was probably the last straw that broke our relationship for good. I've heard similar stories from other people I know, and they all match the same pattern.",
            "title_similarity": "0.46260196",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hguli5c",
            "score": 1,
            "text": "Very true. And I find that at least in my immediate area, things are almost never as bad as what’s portrayed in the media anyways. I read articles if I need to. The 24/7 news cycle sucks",
            "title_similarity": "0.57683647",
            "sentiment_compound": 0.4904
        },
        {
            "id": "hgulj6x",
            "score": 1,
            "text": "Hell yeah, I was going crazy from climate change articles when they were spamming them, then I just stopped looking at them and ignoring them , been a few months since I fell down that hole again",
            "title_similarity": "0.40036106",
            "sentiment_compound": -0.91
        },
        {
            "id": "hgulsq2",
            "score": 1,
            "text": "Ignorance is bliss.also they don’t want working people to understand how many of us are dying to keep the rich comfortable during this pandemic.",
            "title_similarity": "0.66717887",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hgulux4",
            "score": 1,
            "text": "I think it’s a coincidence, but I basically stopped watching the news in 2020 due to the election and the virus. It was just constant fear, panic and nonsense. You’d get 5% important information and 95% talking heads saying whatever they need to say to make their bases love them. It’s stupid and serves no purpose.\n\nSo I took the 60 a month in TV expenses and bought books instead. Was a worthwhile transition and I do not miss that garbage.",
            "title_similarity": "0.49770927",
            "sentiment_compound": -0.8829
        },
        {
            "id": "hgum6m7",
            "score": 1,
            "text": "Deleted my Facebook and cleaned out my phone contacts and wow does it feel amazing.",
            "title_similarity": "0.50072235",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hgun7ee",
            "score": 1,
            "text": "I keep informed so as to not be totally out of the loop. At 73 I know which certain publications and news sources are toxic. I think it’s an effort to say current and correctly informed. Human nature seems to be set (internationally) on sliding into an intentional worldview that pits ppl against one another. We need champions who will help us all reach our higher angels. Carpe Diem. Right now the planet is getting eaten up with more and more ppl. Combine that with climate change and political unrest and wealth discrepancies for an ominous “cocktail” of tragedy.",
            "title_similarity": "0.6434937",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hgundvb",
            "score": 1,
            "text": "So, knowing this, is watching the news an act of self harm?",
            "title_similarity": "0.5894904",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hguntxy",
            "score": 1,
            "text": "I haven't watched the news in probably 10 years. \n\nI'll occasionally read the local news headlines on my way to the online classifieds, but that's it..",
            "title_similarity": "0.36518496",
            "sentiment_compound": 0.0
        },
        {
            "id": "hguoa6p",
            "score": 1,
            "text": "Brainwashers won’t like this .",
            "title_similarity": "0.4517526",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hguocvx",
            "score": 1,
            "text": "Good to know, thank you.\n\nGoodbye, Reddit.",
            "title_similarity": "0.46162352",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hguox4h",
            "score": 1,
            "text": "Reddit has also been relentless with the panic porn.",
            "title_similarity": "0.446566",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hguoym4",
            "score": 1,
            "text": "Ignorance is bliss. It also unfortunately means that people get to make up whatever they think is true about current situation from vague recollections or Memes that they still happen to see.",
            "title_similarity": "0.61748934",
            "sentiment_compound": 0.296
        },
        {
            "id": "hgupsf4",
            "score": 1,
            "text": "blissful ignorance.\n\nit’s those people you talk to who are happy but have no idea about anything going on…\n\nit’s also the people who tell you you shouldn’t wear a mask and do you own research…",
            "title_similarity": "0.505318",
            "sentiment_compound": 0.0644
        },
        {
            "id": "hguqg9f",
            "score": 1,
            "text": "Wow, not reading about the global spread of the deadly virus keeps you sane, great job finding it out, scientists.",
            "title_similarity": "0.7104168",
            "sentiment_compound": 0.836
        },
        {
            "id": "hgur2r7",
            "score": 1,
            "text": "Damn straight. Since the election ended, I haven't watched a minute of cable news. My life is way better",
            "title_similarity": "0.42331606",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hgur9xl",
            "score": 1,
            "text": "I'd bet all my bitcoins stocks the house and everything that the same can be said for not wearing a mask and getting vaxxed too. \"what global pandemic? Never heard of it\"",
            "title_similarity": "0.38948214",
            "sentiment_compound": 0.0
        },
        {
            "id": "hguraht",
            "score": 1,
            "text": "News avoidance period",
            "title_similarity": "0.38731098",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hgurex4",
            "score": 1,
            "text": "most news has turned into sensationalist fearmongering insanity - read upliftingnews. Oh wait, that's just sensationalist cancer treatments that are atill 45 years off.",
            "title_similarity": "0.42032984",
            "sentiment_compound": -0.8442
        },
        {
            "id": "hgus88g",
            "score": 2,
            "text": "I find the more news I read, the more depressed I feel. The question is, how does one stay informed and avoid the news?",
            "title_similarity": "0.5358387",
            "sentiment_compound": -0.6997
        },
        {
            "id": "hguu38w",
            "score": 1,
            "text": "Actually, news avoidance began when Trump started to campaign for President the first time, and only ended when Biden beat him.",
            "title_similarity": "0.40036795",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hguv2i7",
            "score": 1,
            "text": "So avoiding lies, misinformation, and hate is better for you?",
            "title_similarity": "0.6859996",
            "sentiment_compound": -0.8456
        },
        {
            "id": "hguvczi",
            "score": 1,
            "text": "I used to keep news on in my office while at work. These days I keep it firmly stuck to the weather channel or FX",
            "title_similarity": "0.2766276",
            "sentiment_compound": -0.25
        },
        {
            "id": "hguvdqo",
            "score": 1,
            "text": "So News Avoidance forever then? Or until authoritarianism is replaced with something else",
            "title_similarity": "0.46489152",
            "sentiment_compound": -0.4549
        },
        {
            "id": "hguvk2g",
            "score": 1,
            "text": "Except those that died from Covid",
            "title_similarity": "0.39049092",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hguvsl2",
            "score": 1,
            "text": "This is also true before the pandemic",
            "title_similarity": "0.5306915",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hguxsdo",
            "score": 1,
            "text": "I wouldn’t say being completely uninformed is beneficial. However, removing Facebook so you don’t see your cousin posting about doing her own research and about those living in fear, that does significantly improve your mental health.",
            "title_similarity": "0.7451544",
            "sentiment_compound": 0.4336
        },
        {
            "id": "hguy14y",
            "score": 1,
            "text": "Before you read something think “how is this supposed to make me feel?” And if the answer is anxious or scared then just ignore it!",
            "title_similarity": "0.47522396",
            "sentiment_compound": -0.7712
        },
        {
            "id": "hguz5wd",
            "score": 1,
            "text": "My mother watches the news on TV every day and it's unbelievable to me how every single day, the news seems to fill at least half an hour with talk of Covid.  It's enough to drive some people crazy I think.",
            "title_similarity": "0.28545588",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hguzflr",
            "score": 1,
            "text": "Duck the news, all doom and gloom and strikes nothing but fear and anxiety into our people.",
            "title_similarity": "0.4788671",
            "sentiment_compound": -0.3628
        },
        {
            "id": "hguzt0m",
            "score": 1,
            "text": "Science confirms: ignoring the propaganda is healthy for you! \n\nWho woulda thunk?",
            "title_similarity": "0.6893393",
            "sentiment_compound": -0.3164
        },
        {
            "id": "hguzwer",
            "score": 1,
            "text": "If you watch the news, we're all gonna die from covid. If you don't, it's Saturday - have a nice day.",
            "title_similarity": "0.52913654",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hgv01gg",
            "score": 1,
            "text": "Because the comments section of each article is filled with Conspiracies and Qanon trolling.\n\n\"wHeRe aRe aLl tHe pEoPle whO sUpPoRt tHis?\"\n\nAt work, or at school. You know... What normal people usually do.",
            "title_similarity": "0.35028446",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hgv0ep9",
            "score": 1,
            "text": "News avoidance is associated with better well being.",
            "title_similarity": "0.80593336",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hgv0qte",
            "score": 1,
            "text": "Yeah, not reading about how fucked earth is now is presumably good for you. Who would’ve guessed?",
            "title_similarity": "0.6838907",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hgv14hw",
            "score": 1,
            "text": "I went from checking my news apps first thing in the morning and then multiple times a day, to checking them a few times a week, if that. \n\nThese days I would say I check most days but I don't obsessively read everything like I used to. I'm much happier. \n\nI like to be informed but I don't need endless details about everything. It's not good for you ...",
            "title_similarity": "0.5287514",
            "sentiment_compound": 0.8568
        },
        {
            "id": "hgv1e5l",
            "score": 1,
            "text": "Following the news literally destroys my mental health, as soon as I read it I go back into a spiral of hopelessness. \n\nLiving in ignorance is bliss and it's the only way I can live a healthy life. Outside my own bubble I view the world as bleak.",
            "title_similarity": "0.566839",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hgv1s47",
            "score": 1,
            "text": "Ignorance may be bliss, but it’s unproductive to not talk about our world’s problems. The problem tho is that “news” is more interested in being “entertainment” than an actual honest resource for global awareness, progress, and truth.",
            "title_similarity": "0.6400547",
            "sentiment_compound": 0.8621
        },
        {
            "id": "hgv1wts",
            "score": 1,
            "text": "Plus we know stress negatively impacts the immune system, how could we let this happen?",
            "title_similarity": "0.61145663",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hgv21zr",
            "score": 1,
            "text": "news from almost any source is bunk these days.  the government says ridiculous things,  one news source will go down with the the ship praising it and the other will sensationalize things the opposite way.  things are too polarized anymore.   if you read the so called \"neutral sites\", it's still mainly slanted to one side but not quite as blatantly.",
            "title_similarity": "0.57989466",
            "sentiment_compound": 0.128
        },
        {
            "id": "hgv279j",
            "score": 1,
            "text": "My father has cancer and completely stopped watching all news this past year.  In spite of his illness, he is the happiest I’ve ever seen him.",
            "title_similarity": "0.38073522",
            "sentiment_compound": -0.8173
        },
        {
            "id": "hgv3lll",
            "score": 1,
            "text": "I was at my calmest during lockdown, not happiest. I was stressed at work, I work at a hard hit hospital in the US. The new stress of working with covid patients plus the looming stress of hospital downsizing due to lack of elective procedures and out patients. But at home just cooking, hanging out in the backyard, and talking to friends and family on the phone was so peaceful. No plans and no schedules, it was a glimpse of a simpler life.",
            "title_similarity": "0.46396336",
            "sentiment_compound": -0.0457
        },
        {
            "id": "hgv49mz",
            "score": 1,
            "text": "I don't think I've watched the news more the two or three times since early 2020.",
            "title_similarity": "0.26330948",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgv4cj0",
            "score": 1,
            "text": "I stopped watching news at all after the start of covid. So pointless to digest all this info. If its important itll pop up on reddit or somewhere else",
            "title_similarity": "0.38040787",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hgv5tai",
            "score": 1,
            "text": "I think it is always associated with better mental health. Can we have the Weather Channel that played smooth jazz 24/7 again?",
            "title_similarity": "0.6670673",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hgv6f1l",
            "score": 1,
            "text": "It can also keep you misinformed if you avoid the news. This is not a good recommendation at all.",
            "title_similarity": "0.55037844",
            "sentiment_compound": -0.7356
        },
        {
            "id": "hgv7u68",
            "score": 1,
            "text": "I avoid the News and politics in general, ignorance is bliss as they say.",
            "title_similarity": "0.48123622",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgv885q",
            "score": 1,
            "text": "Wait so doom scrolling is bad?",
            "title_similarity": "0.43809277",
            "sentiment_compound": -0.7574
        },
        {
            "id": "hgv8u38",
            "score": 1,
            "text": "I've personally completely unplugged myself from the news. The only time I hear of anything is if my family mentions it or I scroll through the general reddit feed.\n\nMy opinion is I don't need to know. I don't care what's happening in politics because past voting I can't change anything. I don't need to hear all the doom and gloom news because again I can't change anything.\n\nHmu if a hurricane is heading my way, that and when the next cold front is coming so I can plan a camping trip.",
            "title_similarity": "0.4122966",
            "sentiment_compound": -0.8372
        },
        {
            "id": "hgvbcff",
            "score": 1,
            "text": " News avoidance period is associated with better mental well-being",
            "title_similarity": "0.86482656",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgvbig8",
            "score": 1,
            "text": "Because our news is over saturated with exaggerated claims on both the right and left.",
            "title_similarity": "0.3844298",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hgvbjzw",
            "score": 1,
            "text": "News avoidance is better for mental health.\n\nCOVID or not.",
            "title_similarity": "0.84400976",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgvcemi",
            "score": 1,
            "text": "as someone who has become entirely engrossed in this pandemic, the misinformation, the political slants, etc., i am walking proof of this.  my mental well being has went straight down the tubes and i'm mad at just about everybody on both sides these days.",
            "title_similarity": "0.43118703",
            "sentiment_compound": -0.1548
        },
        {
            "id": "hgvec5c",
            "score": 2,
            "text": "But how will I find out about this week's latest variant and that the vaccine is potentially 1% less effective against it?",
            "title_similarity": "0.4919876",
            "sentiment_compound": 0.5734
        },
        {
            "id": "hgvepf5",
            "score": 2,
            "text": "For real. My grandma is 91 and just watches the news and reads the paper all day. Every week I get an update on what or who is going to kill, rob, or ruin me.",
            "title_similarity": "0.27297288",
            "sentiment_compound": -0.9201
        },
        {
            "id": "hgvgezx",
            "score": 1,
            "text": "So what does that headline say about *The Front Page of the Internet?* The doom-scrolling is obviously not good for anyone’s mental state, but whacky, crazy, mean, confounding, depressing, futile, surreal and unbelievably irrelevant and eye-popping human activities and political scandals seem to be in the “news” feed-glut as soon as we open our browsers…\n\nJung’s collective subconscious has us all spinning-out as soon as we begin to communicate or absorb information. Is there even such thing as a “scandal” anymore when outrage and conflicting headlines slam into us like endless crashing waves on our desensitized beaches of thought? Is the only escape left to us an ‘all or nothing’ unplugged reality?",
            "title_similarity": "0.49565285",
            "sentiment_compound": -0.975
        },
        {
            "id": "hgvhx0n",
            "score": 1,
            "text": "I always know when it’s time to hit the snooze button on certain Facebook friends when I start seeing memes/long rants that are obviously references to some stupid crap going on in the news, that I wouldn’t normally know about if I also stuck to the same 24/7 news cycle that they did \n\nNews content, today, is basically just an organization of people who sit around a table and talk about *what will ruffle people’s feathers.* \n\nThey put out content that isn’t to inform, but rather, gets their blood pressure up… they know those people are going to get in the comments and fight with each other, and give them engagement.  they know they’re gonna share it to their own page and get other people engaging with that content.  And when their blood pressure is *still* up… those same news orgs are going to spit out another story like \n\n> can you BELIEVE this entitled liberal/conservative did this on TikTok?\n\nAnd the cycle continues.  Why would you want to participate in that?\n\nBeing informed is one thing, but being STUCK on things like this is just nuts.  And yes, I could delete those friends but I don’t want to.  Sometimes I like watching their hissy fits",
            "title_similarity": "0.5245336",
            "sentiment_compound": 0.9499
        },
        {
            "id": "hgviala",
            "score": 1,
            "text": "TL:DR - Ignorance is bliss",
            "title_similarity": "0.50716615",
            "sentiment_compound": 0.296
        },
        {
            "id": "hgvlywv",
            "score": 1,
            "text": "Should read “News avoidance in general is associated with better mental well-being”",
            "title_similarity": "0.87427294",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hgvmi5y",
            "score": 1,
            "text": "As I am on my 1st / 5 hours on reddit for today",
            "title_similarity": "0.18037549",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgvmp5g",
            "score": 2,
            "text": "I've found that muting a lot of these topics on Twitter has made my life 1000x better.",
            "title_similarity": "0.43420827",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hgvmstg",
            "score": 3,
            "text": "Seeing less negative makes me less negative.\nWho would've thought.\nWe live in a society.",
            "title_similarity": "0.64025605",
            "sentiment_compound": -0.7791
        },
        {
            "id": "hgvq5ny",
            "score": 2,
            "text": "Remember that while politicians lie most of the time, journalists lie ALL the time.",
            "title_similarity": "0.37141487",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgvsvqd",
            "score": 2,
            "text": "I didn’t watch single tv news since February 2021 best thing I ever done,",
            "title_similarity": "0.20973569",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hgvtrnu",
            "score": 2,
            "text": "2020 taught me how to really embrace apathy and avoidance",
            "title_similarity": "0.5134921",
            "sentiment_compound": -0.3788
        },
        {
            "id": "hgvtul3",
            "score": 2,
            "text": "I read an article about the many and varied reasons why covid has not afflicted many African countries anywhere near as badly as 'Western' countries. Lots of things about sparse population, lots of sunshine and some more, much more convoluted, BS-sounding reasons to do with transmission vectors and what-not.\r  \n\r  \nThen, I read that it was because they don’t get CNN.",
            "title_similarity": "0.49874523",
            "sentiment_compound": 0.2982
        },
        {
            "id": "hgw1ky0",
            "score": 2,
            "text": "100% agree. What the hell is this pandemic you guys won’t shut up about?",
            "title_similarity": "0.5283117",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hgw7mbn",
            "score": 1,
            "text": "Ignorance is bliss, but I want to hear the klaxons.",
            "title_similarity": "0.57339156",
            "sentiment_compound": 0.2617
        },
        {
            "id": "hgw8bg6",
            "score": 1,
            "text": "How about we do a study on the mental benefits of Facebook avoidance",
            "title_similarity": "0.5545849",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hgx1trp",
            "score": 1,
            "text": "Doomscrolling is bad for your mental health. Got it.",
            "title_similarity": "0.6174412",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hgxgeav",
            "score": 1,
            "text": "I read on a social media website, and posted this reply without reading the article.\n\nUnironically.",
            "title_similarity": "0.277945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hgya9p5",
            "score": 1,
            "text": "If I’m reading this …I’m fucked aren’t I ?",
            "title_similarity": "0.41372627",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hgyg1z0",
            "score": 1,
            "text": "I am really dumbfounded that this is news, like its a recent discovery. Come on people, wow.",
            "title_similarity": "0.44143313",
            "sentiment_compound": 0.5279
        },
        {
            "id": "hgyxlnl",
            "score": 1,
            "text": "You mean the industry designed to generate and capitalize on fear and insecurity in people is bad for your mental health? Huh…",
            "title_similarity": "0.5934433",
            "sentiment_compound": -0.8591
        },
        {
            "id": "hgz2t6t",
            "score": 1,
            "text": "Original article posted on [https://www.tandfonline.com/doi/full/10.1080/21670811.2021.1957967](https://www.tandfonline.com/doi/full/10.1080/21670811.2021.1957967)   \nCan anybody confirm this domain?",
            "title_similarity": "0.27572215",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hh7ooui",
            "score": 1,
            "text": "News avoidance? Isn't everyone refreshing charts of of covid cases and bitcoin prices?",
            "title_similarity": "0.5057099",
            "sentiment_compound": -0.4696
        }
    ]
}