{
    "Americans' love for individual billionaires affects their views on economic inequality -- and makes them less likely to support wealth taxes on the super-rich, a new study finds.\n": [
        {
            "id": "hh56766",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.518516",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hh5h6h6",
            "score": -4,
            "text": "Who the fck loves billionaires?  Anyone holding up people like Bezos, Jobs, Musk, even Gates as anything other than dragons sitting on treasure that they are too greedy to share with the people that helped them get the treasure are delusional.",
            "title_similarity": "0.7139945",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hh5fm0w",
            "score": 4,
            "text": "People are stupid, but don't discount the weaponized propaganda machines the Capitalist class has access to.  Personalizing the rich isn't an accident, any less than personalizing the military.  Powerful people pay whole armies of media/PR/comms teams to manipulate public opinion in their favor.",
            "title_similarity": "0.79594535",
            "sentiment_compound": 0.9038
        },
        {
            "id": "hh5o0jj",
            "score": 2,
            "text": "I wish the world would wake up to the fact that the rich hate us.",
            "title_similarity": "0.7209743",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hh5kpni",
            "score": 0,
            "text": "land of the delusional",
            "title_similarity": "0.18132341",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5qujr",
            "score": -6,
            "text": "I don’t get it. Is the average American really that fukin dim?",
            "title_similarity": "0.50324994",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5kwew",
            "score": -17,
            "text": "It's called boot licking.",
            "title_similarity": "0.078183115",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5ipxs",
            "score": -8,
            "text": "I think the problem is that taxes are used to fund apartheid countries that steal land from people in the Middle East, such as Israel. Also, taxes are used to propagandize Americans, steal oil in the forever-war in the Middle East, fund regulators that get captured by industries etc. Corruption is why Americans don't want anyone taxed anymore.",
            "title_similarity": "0.77095366",
            "sentiment_compound": -0.8527
        },
        {
            "id": "hh62wnm",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.078881934"
        },
        {
            "id": "hh5mnrs",
            "score": 1,
            "text": "This is because Americans have been led to believe taxes are a punishment for success.",
            "title_similarity": "0.77513963",
            "sentiment_compound": 0.128
        },
        {
            "id": "hh5prct",
            "score": 1,
            "text": "Who the f*ck loves individual billionaires? I would easily vote to tax the f*ck out of them for a lark.",
            "title_similarity": "0.74043375",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hh5g867",
            "score": 7,
            "text": "I still don't get this worship. The billionaires don't know you exist, or care in any way shape or form, so just forget about them. Form unions, force companies to give you a bigger slice of the pie, and lobby the government to tax the rich and corporations who dodge their responsibilities every year.",
            "title_similarity": "0.71068597",
            "sentiment_compound": 0.8032
        },
        {
            "id": "hh5qrpf",
            "score": 0,
            "text": "Most Americans consider themselves to be temporarily inconvenienced millionaires.",
            "title_similarity": "0.6838198",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh656p3",
            "score": -1,
            "text": "TIL Americans apparently love billionaires.  It seems nigh impossible to me for a billionaire to earn that kind of money while ethical to their employees and/or the planet and society.",
            "title_similarity": "0.8097837",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hh651g5",
            "score": 3,
            "text": "I don’t understand why anyone would even care about income inequality.  That’s just a political tactic meant to distract and divide people.\n\nYou’re either comfortable or not.  I’m comfortable; therefore, I don’t care if Oprah has more money than me.  She can have all of the money she wants and it won’t affect my outcome.  It’s much better than everyone being poor and struggling, which is the only outcome that will guarantee income equality.",
            "title_similarity": "0.7420096",
            "sentiment_compound": 0.5856
        },
        {
            "id": "hh65yfw",
            "score": 0,
            "text": "It’s reasonable to me that someone can become a millionaire in a fair system, but the existence of billionaires is a clear sign that the system is not fair.",
            "title_similarity": "0.77491736",
            "sentiment_compound": 0.3832
        },
        {
            "id": "hh5k769",
            "score": -22,
            "text": "[removed]",
            "title_similarity": "0.078881934"
        },
        {
            "id": "hh5qad1",
            "score": -1,
            "text": "Not me! I hate money, capitalism, rich people/billionaires. Humanity badly needs to move beyond all this harmful BS.",
            "title_similarity": "0.7142948",
            "sentiment_compound": 0.5845
        },
        {
            "id": "hh5ooz8",
            "score": 33,
            "text": "[removed]",
            "title_similarity": "0.078881934"
        },
        {
            "id": "hh5g68u",
            "score": -28,
            "text": "I don't understand why anybody would like someone who is hoarding more money than they could ever spend.\n\nClosest I got is that they want to feel like part of the moneyed class, so if they latch on enough it'll almost be like being part of it.",
            "title_similarity": "0.71085584",
            "sentiment_compound": 0.7595
        },
        {
            "id": "hh5ezun",
            "score": -36,
            "text": "AKA, Americans are idiots.",
            "title_similarity": "0.46057296",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5gchu",
            "score": -5,
            "text": "Because they worship them.",
            "title_similarity": "0.09399593",
            "sentiment_compound": 0.296
        },
        {
            "id": "hh5j456",
            "score": -8,
            "text": "Out of all the things to criticize us for, this is the thing I dislike most about Americans. Conservatives have been convincing the masses that instead of massive income inequality, that other races and cultures are the real enemies for decades. And it worked. They have people voting against their best interests so that they can save money and build excessive wealth. It worked.",
            "title_similarity": "0.83561707",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hh5n9u9",
            "score": -5,
            "text": "Billionaires accomplish more as well as do more for charity and the advancement of humanity. The bottom 50% accomplish little, give little, and contribute virtually nothing in the way of taxes. Why would we support the latter group at greater levels?",
            "title_similarity": "0.7305927",
            "sentiment_compound": 0.9355
        },
        {
            "id": "hh5md0f",
            "score": -7,
            "text": "As an American I say tax the rich and eat their Gucci slippers.",
            "title_similarity": "0.6060849",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hh5jgtl",
            "score": -14,
            "text": "Americans have trouble thinking for themselves and rely on people in flashy clothing to tell them what to do. The flashier the more likely to listen and obey.\n\nNot just Americans of course.",
            "title_similarity": "0.6371741",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hh5m6ta",
            "score": 1,
            "text": "See... let Covid happen long enough and even the science gets stupid by doing stupid studies that correlate staring at bellybuttons and swirling clouds of scented smoke. Stupidest damn article I've read this week. ... I'm sure a contender will come along shortly but currently this is the stupidest damn article.",
            "title_similarity": "0.60956764",
            "sentiment_compound": -0.9287
        },
        {
            "id": "hh65uh5",
            "score": 0,
            "text": "Democrats claim to want to make the rich to pay their share....\n\nHave the house and senate and the white house....do nothing to tax the rich...\n\nInstead weaponize the IRS to go after lower/middle class americans who can't affort an army of tax lawyers to protect themselves.....\n\nOddly enough the those same Democrats took in huge amounts of money for the last few elections from these very same extremely wealthy people that they claim they are going to go after......\n\nAnd no this doesn't make the Republican party any less guilty of this BS....just pointing out to the super pro-democrat users of reddit the very obvious truth that most of them refuse to see because, well you know, they think THEIR party is the good team....",
            "title_similarity": "0.81249005",
            "sentiment_compound": 0.9775
        },
        {
            "id": "hh5jx3k",
            "score": 2,
            "text": "TIL Americans support billionaires?   I do?",
            "title_similarity": "0.5920038",
            "sentiment_compound": 0.4696
        },
        {
            "id": "hh5oxdy",
            "score": -4,
            "text": "John Steinbeck once said that socialism never took root in America because the poor see themselves not as an exploited proletariat but as temporarily embarrassed millionaires.",
            "title_similarity": "0.77614707",
            "sentiment_compound": -0.5514
        },
        {
            "id": "hh5ggkr",
            "score": 4,
            "text": "Is this made better or worse by the fact that the commonly beloved billionaires are awful people with bad ideas but good PR?",
            "title_similarity": "0.77366066",
            "sentiment_compound": 0.3919
        },
        {
            "id": "hh5kopf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.078881934"
        },
        {
            "id": "hh5m37o",
            "score": -1,
            "text": "An American friend of mine once told me: Americans vote as if they are already millionaires.",
            "title_similarity": "0.6047537",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hh64cgb",
            "score": 6,
            "text": "I may not like billionaires very much, but I don’t think stealing is more acceptable just because somebody is rich… so i cant support some kind of huge wealth tax. But I definitely *can* and *do* support taxing the corporations that generate billions of dollars for them. Like, a billionaire and I should pay a flat tax rate… but Amazon should be paying many many *millions* in taxes. Right now, I pay Amazon’s taxes. Literally. They pay zero dollars *and* I pay taxes.",
            "title_similarity": "0.8493656",
            "sentiment_compound": 0.8524
        },
        {
            "id": "hh5mwog",
            "score": -4,
            "text": "\"This is going to be me someday\"\n\n\"I can relate to them, they are just like me\"\n\nA) No, it's not going to ever going to be you\n\nB) They don't even know who you are (or care)",
            "title_similarity": "0.3942122",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hh5qekt",
            "score": -5,
            "text": "Not me. I say tax the living crap out of ALL of them...( for the record, i think they're slimy parasites past $100 million or so...)",
            "title_similarity": "0.6100943",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hh5hwkk",
            "score": 20,
            "text": "I don't get this stupidity.  Even the billionaires (or at least the ones who understand economics) say that you should be taxing them more.  if you idolize them, then you should listen to them when they say that!!",
            "title_similarity": "0.7824838",
            "sentiment_compound": -0.6071
        },
        {
            "id": "hh5q7r4",
            "score": 0,
            "text": "Look let's just make it easy, everyone pays 19.5% of their income in  taxes. If you claim zero dependents on your w2 its similar rate.",
            "title_similarity": "0.5015537",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hh629bd",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.09543335"
        },
        {
            "id": "hh64jkl",
            "score": 0,
            "text": "F’in bbq them all. I won’t shed one tear.",
            "title_similarity": "0.15619937",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6s23e",
            "score": 0,
            "text": "Because Americans have bought into the myth of the American Dream so hard that they think they'll be one of those billionaires someday.",
            "title_similarity": "0.75540674",
            "sentiment_compound": 0.0345
        },
        {
            "id": "hh6sb1o",
            "score": 0,
            "text": "The rich already pay 80% of the taxes. How much should they pay? 100%?",
            "title_similarity": "0.5182007",
            "sentiment_compound": 0.4871
        },
        {
            "id": "hh7i2bw",
            "score": 0,
            "text": "I've had numerous conversations in which I've stated my personal belief that the existence of billionaires is a societal failure to regulate the amount of power a single person can amass, only to be countered with anecdotes of the philanthropic acts of some billionaires, completely disregarding the inherent cruelty and inequality that is required to become a billionaire.",
            "title_similarity": "0.7897608",
            "sentiment_compound": -0.8553
        },
        {
            "id": "hh5uz66",
            "score": -1,
            "text": "This is one of a few social behaviours that I find fascinating.\n\nPeople will defend the super rich when they are basically just a resource to be used by that same rich person.\n\nI had two people at a family gathering on Sunday have an argument with me when I said that Elon, Jeff, etc should only be allowed $1 billion and the rest should either be justified by investments in things that will benefit our current dire situation or just be taxed.\n\nThese people who argued with me earn less than I do and have leached off of me and other family members.\n\nI was just stunned.\n\nI just don't understand that zealous fight for these ultra rich by the average person.",
            "title_similarity": "0.74599254",
            "sentiment_compound": 0.9264
        },
        {
            "id": "hh6madf",
            "score": 2,
            "text": "America is a nation comprised of temporarily embarrassed billionaires.",
            "title_similarity": "0.6620873",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hh60nmc",
            "score": -10,
            "text": "Americans you are some dumb motherfuckers.",
            "title_similarity": "0.5523544",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hh60fea",
            "score": 5,
            "text": "Tax all the poor scum living off government that are able bodied",
            "title_similarity": "0.6586827",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hh66k45",
            "score": 4,
            "text": "Who. Cares. Taxes should be figured out by economists. Not emotional people.",
            "title_similarity": "0.5835781",
            "sentiment_compound": 0.3728
        },
        {
            "id": "hh5pwqv",
            "score": -2,
            "text": "Or, and this might sound crazy, they like living in a first world nation with many luxuries, and they realize the only thing that putting exorbitant taxes on the rich does is make them pack up and move to a different country, taking their technology, jobs and immense tax they already pay with them.",
            "title_similarity": "0.7766782",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hh64dj2",
            "score": -2,
            "text": "John Steinbeck: “Socialism never took root in America because the poor see themselves not as the exploited proletariat but as temporarily embarrassed millionaires.\"",
            "title_similarity": "0.7770334",
            "sentiment_compound": -0.5514
        },
        {
            "id": "hh5q2r2",
            "score": 5,
            "text": "This was explained in a book called \"The Politics of Envy\" written by Anne Hendershott in the 1950s. The political and media establishment gain support for re-distributive tax policies by playing on toxic envy which leads to resentment of others success, violence, cancel culture, and dysfunctional political systems. \n\nThe abstract for this cited paper is saying that when inequlity is presented to people as a collectivist dynamic (i.e. \"the rich\") instead of individuals who have become wealthy, the support for redistribution policy increases. When the object of the envy is some nameless, faceless collective of people, the support to steal from them increases. Politicians have know this for decades",
            "title_similarity": "0.7807171",
            "sentiment_compound": 0.802
        },
        {
            "id": "hh5vm4g",
            "score": 2,
            "text": "This makes me really sad",
            "title_similarity": "0.2702781",
            "sentiment_compound": -0.5256
        },
        {
            "id": "hh5y4vw",
            "score": 0,
            "text": "Problem is simply taxing the super rich isn't going to cut it anymore. My friend who's been climbing the wealth ladder is able to hire better accountants and place his wealth in hedge funds where he pays less taxes than before (percentage wise) and gets an annual guaranteed 5% return on his total wealth. Which is like an extra 80k a year.\n\nThe super rich, can hire even better accountants and their wealth can snowball even more.\n\nRaising taxes on income is only hurting the middle class at this point.",
            "title_similarity": "0.78696865",
            "sentiment_compound": 0.9899
        },
        {
            "id": "hh63tl1",
            "score": -2,
            "text": "It’s not love. We like to invest in their idea / company to profit along with them. Capitalism.",
            "title_similarity": "0.7226814",
            "sentiment_compound": -0.3773
        },
        {
            "id": "hh6rkod",
            "score": 0,
            "text": "“Study finds Americans are idiots with tunnel vision”\n\nNo news here.",
            "title_similarity": "0.6224998",
            "sentiment_compound": -0.296
        },
        {
            "id": "hh5rbqc",
            "score": -5,
            "text": "Am I wrong in thinking that you've either got to be super rich or stupid to vote against wealth taxes?",
            "title_similarity": "0.8000802",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh5n11a",
            "score": 0,
            "text": "\"Some Americans have accepted the propaganda fed to them, and asked for seconds - study finds\"",
            "title_similarity": "0.5280169",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hh6qxat",
            "score": 0,
            "text": "So how does this study factor in lobbying and overall corruption?\n\nSeems like they are saying it's poor people's fault wealth taxes don't succeed. When it's blatantly due to corruption.",
            "title_similarity": "0.81773734",
            "sentiment_compound": -0.4639
        },
        {
            "id": "hh5fi5h",
            "score": 58,
            "text": "[removed]",
            "title_similarity": "0.078881934"
        },
        {
            "id": "hh5d4d5",
            "score": 33,
            "text": "[removed]",
            "title_similarity": "0.078881934"
        },
        {
            "id": "hh5qpbv",
            "score": -2,
            "text": "I wish we could do 2 things. \n\n1) drastically shrink down our federal government as it’s absolutely insane the amount of money they are taking and the disappointment on both sides of the political spectrum the federal government has on the population as a whole. \n\n2) enact a reasonable no BS no exemption flat tax. You sell stocks you pay it, you sell assets such as a house or land, you pay it, you also pay it on the income you collect. This would drastically shrink the complexity of our stupid and overly abused tax law.",
            "title_similarity": "0.8004633",
            "sentiment_compound": -0.9023
        },
        {
            "id": "hh64l5d",
            "score": 1,
            "text": "I feel like right now it more of a Pyramid scheme.\n\nThe person at the bottom doesn't want the billionaire taxed because the influencer they follow loves the millionaire celebrity podcaster that is sucking up to the billionaire.\n\nNone of these asshole would lose the quality of life the have right nowbif they were properly taxed but the \"one day\" morons have to defend them.",
            "title_similarity": "0.79418737",
            "sentiment_compound": -0.205
        },
        {
            "id": "hh6385j",
            "score": -5,
            "text": "I don't love billionaires, I hate them. And as long as I pay more taxes than them I will continue to hate them.",
            "title_similarity": "0.7553822",
            "sentiment_compound": -0.9036
        },
        {
            "id": "hh5fyik",
            "score": 7,
            "text": "Who loves billionaires?",
            "title_similarity": "0.55671036",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hh662u1",
            "score": -7,
            "text": "\"*If we taxed 99% of Elon's wealth he'll only have $2 billion to live on for the rest of his life. That's not fair to him. And who needs universal healthcare anyway*?\" - morons",
            "title_similarity": "0.671666",
            "sentiment_compound": -0.016
        },
        {
            "id": "hh5n12q",
            "score": -5,
            "text": "What gets me is the people most critical of billionaires tend to LOVE and celebrate trillionaires.\n\nSo I don't have much sympathy.\n\nIf you help manage something worth over a billion dollars (NOBODY keeps that in cash, but even if they did...), cool. And thanks, probably.",
            "title_similarity": "0.7585138",
            "sentiment_compound": 0.9014
        },
        {
            "id": "hh5pd30",
            "score": 29,
            "text": "[removed]",
            "title_similarity": "0.078881934"
        },
        {
            "id": "hh64dpb",
            "score": 29,
            "text": "[removed]",
            "title_similarity": "0.078881934"
        },
        {
            "id": "hh5p1e4",
            "score": 1,
            "text": "It’s no mistake that the billionaires own the media… Got to somehow spin their space hobbies as cool and a greater good for society.",
            "title_similarity": "0.5919948",
            "sentiment_compound": 0.8288
        },
        {
            "id": "hh5puxk",
            "score": 1,
            "text": "I think even the hate for individual, public billionaires hurts issues. Seems like Elon and Bezos and Branson are big distractions for the billionaires and megacorporations that are doing just as bad, if not worse, things.\n\nIt’s so much easier to hate on Bezos than it is a faceless board of directors",
            "title_similarity": "0.8333085",
            "sentiment_compound": -0.8346
        },
        {
            "id": "hh5rawh",
            "score": 1,
            "text": "America's love for the wealthy has always been with us. We admire what we can never have: All the money, property and family history that the wealthy enjoy.\n\n\n“John Steinbeck once said that socialism never took root in America because the poor see themselves not as an exploited proletariat but as temporarily embarrassed millionaires.”\n\n― Ronald Wright, A Short History of Progress",
            "title_similarity": "0.7434001",
            "sentiment_compound": 0.8121
        },
        {
            "id": "hh5whe3",
            "score": 1,
            "text": "I just don't want to take their money. It's not my money. It's not your money either",
            "title_similarity": "0.41484722",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hh606jv",
            "score": 1,
            "text": "Have you considered that instead, maybe wealth taxes are just a bad idea, a poor way to generate revenue, generates far less revenue than projected, has diminishing returns, and in the long run reduces your tax base and revenue?\n\nBecause that's the conclusion that nearly 20 European countries came to while abolishing their wealth taxes over the past 30 years.  Or we can ignore the top economists from a dozen developed countries, many of which have the robust social welfare systems Americans want, to live out a self defeating dream of a \"wealth tax\".\n\nI couldn't care less of Bezos had to pay 95% tax rate on every dollar he spent or earned.  But essentially levying a property tax on their property (money at rest), can only serve to harm long term economic output.",
            "title_similarity": "0.8024174",
            "sentiment_compound": -0.6771
        },
        {
            "id": "hh6r9wt",
            "score": -1,
            "text": "Because not all billionaires are bad. They are people just like us. Some do a lot of good with their wealth while others don’t.",
            "title_similarity": "0.6421094",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hh6wios",
            "score": -1,
            "text": "No it doesn’t. Tax ‘em. Tax ‘em hard.",
            "title_similarity": "0.48636907",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hh7hrz6",
            "score": 1,
            "text": "I hate billionaires. Tax those greedy fucks double.",
            "title_similarity": "0.7114221",
            "sentiment_compound": -0.8442
        },
        {
            "id": "hh5pbqp",
            "score": -7,
            "text": "Anyone that loves Bill Gates is a sucker, pure and simple. With the possible exception of his family.",
            "title_similarity": "0.4481172",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hh5fg7p",
            "score": 123,
            "text": "Its almost like a poor mans Stockholm syndrome",
            "title_similarity": "0.4111873",
            "sentiment_compound": -0.1604
        },
        {
            "id": "hh5utyz",
            "score": 14,
            "text": "Or, you know, the fact that wealth taxes have worked out terribly in the past. If you want to tax wealth, institute highly progressive consumption taxes. When they're actually using that wealth is when you can capture it.",
            "title_similarity": "0.7735182",
            "sentiment_compound": 0.743
        },
        {
            "id": "hh5ertk",
            "score": 366,
            "text": "[deleted]",
            "title_similarity": "0.09543335"
        },
        {
            "id": "hh5y25n",
            "score": 4,
            "text": "It's not about \"defending billionaires\".  I do not support new taxes, period.  Who would theoretically be taxed is totally irrelevant.\n\n**The government spends 18 billion dollars every single day.  It does not need more money.**",
            "title_similarity": "0.59865844",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hh5i6vo",
            "score": 35,
            "text": "Heavily flawed conclusion. \n\nThe methodology draws observations from individuals believing named billionaires should earn more proportionally than unnamed billionaires, but that doesn't have any bearing on how people support or oppose wealth taxes.",
            "title_similarity": "0.8363116",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hh5hhhi",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.078881934"
        },
        {
            "id": "hh6yqbo",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.078881934"
        },
        {
            "id": "hh57crm",
            "score": 409,
            "text": "The idea of \"personal responsibility\" in every facet of American life is some convincing propaganda.",
            "title_similarity": "0.4895004",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hh6fp2b",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "0.078881934"
        },
        {
            "id": "hh5csb4",
            "score": 72,
            "text": "It’s disturbing, even a cult of personality for some people.",
            "title_similarity": "0.3956555",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hh5blha",
            "score": 292,
            "text": "What's the point of a wealth tax when they don't even enforce the taxes we have now? It's us non millionaires and billionaires getting taxed.",
            "title_similarity": "0.8003727",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hh7hjpm",
            "score": 2,
            "text": "What a stupid baselesss article.",
            "title_similarity": "0.29597184",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hh5piap",
            "score": 7,
            "text": "Yes, surely Americans' love for individual billionaires is the reason why the plutocracy doesn't want to tax themselves. It must be the commoners' faults.",
            "title_similarity": "0.85374737",
            "sentiment_compound": 0.7564
        },
        {
            "id": "hh5mtb1",
            "score": 0,
            "text": "i’m sorry i think i missed the last meeting… who in the us likes billionaires? as far as i new all the people who did were dying off",
            "title_similarity": "0.64845157",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hh5n7o8",
            "score": 0,
            "text": "We love individual billionaires? I hate them with a passion...",
            "title_similarity": "0.70812607",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hh5qy8g",
            "score": 0,
            "text": "We don’t love them. We are owned by them",
            "title_similarity": "0.4347546",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh5s6sh",
            "score": 0,
            "text": "So, if you think a rich guy is good, you're less likely to hate him?  Thanks science.",
            "title_similarity": "0.7360118",
            "sentiment_compound": 0.7152
        },
        {
            "id": "hh5s7gp",
            "score": 0,
            "text": "Yea, we call those people bootlickers.",
            "title_similarity": "0.16029686",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5sc52",
            "score": 0,
            "text": "Americans love famous people, as if they know them.",
            "title_similarity": "0.48004034",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh5sda9",
            "score": 0,
            "text": "If you aren't their friend or their kid, you mean absolutely nothing to them pal.",
            "title_similarity": "0.36222485",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hh5sdsj",
            "score": 0,
            "text": "Bunch of fkn useless chuds",
            "title_similarity": "0.2023435",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hh5shiy",
            "score": 0,
            "text": "it's because of the myth that they, if things had gone a bit different from them, could also be a billionaire",
            "title_similarity": "0.6234027",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5smh9",
            "score": 0,
            "text": "This is not surprising. USA is overwhelmingly a country of wannabe billionaires. Our world view is very skewed.",
            "title_similarity": "0.70983535",
            "sentiment_compound": -0.3213
        },
        {
            "id": "hh5snrp",
            "score": 0,
            "text": "The whole prosperity gospel bs that is still going strong in American might contribute to this.\nObviously if you have more that means god loves you more?!?",
            "title_similarity": "0.47498223",
            "sentiment_compound": 0.8755
        },
        {
            "id": "hh5ssh0",
            "score": 0,
            "text": "“We can’t tax the rich because when I’m super rich, that means *I’ll* be taxed more” \n\nThe greatest lie ever told was the American dream",
            "title_similarity": "0.7698832",
            "sentiment_compound": 0.9538
        },
        {
            "id": "hh5subc",
            "score": 0,
            "text": "Tax the rich! There’s my new study.",
            "title_similarity": "0.5930652",
            "sentiment_compound": 0.5983
        },
        {
            "id": "hh5swgl",
            "score": 0,
            "text": "Fuxking us. We think that if we like them we might one day be rich also. Ha fat chance. Tax the rich",
            "title_similarity": "0.72258735",
            "sentiment_compound": 0.9201
        },
        {
            "id": "hh5t9kk",
            "score": 0,
            "text": "TLDR: Poor idiots think they’ll be that rich somehow someday but in the meantime will live vicariously thru these greedy fucks and lick their boots clean.",
            "title_similarity": "0.63535273",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hh5tset",
            "score": 0,
            "text": "Yeah, the other thing that keeps people from supporting high taxes on the ultra rich is the fallacy that they hold in their heads that they might be that ultra rich person someday. Fantasy. Pure fantasy.",
            "title_similarity": "0.8191944",
            "sentiment_compound": 0.9062
        },
        {
            "id": "hh5u272",
            "score": 0,
            "text": "Dumb people being dumb",
            "title_similarity": "0.34207278",
            "sentiment_compound": -0.765
        },
        {
            "id": "hh5ucqq",
            "score": 0,
            "text": "I don't know of anyone that loves a Billionaire. The majority of people have a point-of-view that they had to unethically not pay their fair share in wages, benefits, community support, taxes, and so forth while gaining this exorbitant wealth. They abused a system designed to allow the wealthy to stay rich and help them to increase their net worth that the average citizen can't utilize.",
            "title_similarity": "0.83707595",
            "sentiment_compound": 0.9761
        },
        {
            "id": "hh5uovs",
            "score": 0,
            "text": "Living the American through them",
            "title_similarity": "0.2519436",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5urkb",
            "score": 0,
            "text": "Pfft... Billionaires are food, not friends.",
            "title_similarity": "0.60341746",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hh5uung",
            "score": 0,
            "text": "Nobody ever defines how these wealth taxes will work. That's why I don't support this idea. We have a bunch of taxes that should be bringing in a ton of money from the ultra rich. They don't, I don't have faith that adding another tax will do anything other than give another way to tax people who can't afford to legally avoid taxes",
            "title_similarity": "0.7513096",
            "sentiment_compound": 0.1813
        },
        {
            "id": "hh5uxus",
            "score": 0,
            "text": "There’s nothing more cucked than being a fan of a billionaire. They literally work against your interest to build and hold wealth.",
            "title_similarity": "0.7204908",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hh5vvhj",
            "score": 0,
            "text": "Because they see themselves in these people. In their mind a tax on the rich is a tax on themselves.",
            "title_similarity": "0.71566033",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hh5w3o8",
            "score": 0,
            "text": "Yes, we're idiots.\n\n\nNews at 11.",
            "title_similarity": "0.33652794",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hh5w4qt",
            "score": 0,
            "text": "God. We are idiots. As a group, we suck.",
            "title_similarity": "0.37325877",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hh5w5lh",
            "score": 0,
            "text": "I'm sorry, who loves billionaires other than losers?",
            "title_similarity": "0.70942473",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5wcdj",
            "score": 0,
            "text": "'He's such a likable billionaire. Cant tax him for that. It's unfortunate my elderly neighbor can't afford food or medicine.'",
            "title_similarity": "0.7159235",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hh5wgss",
            "score": 0,
            "text": "I remember hearing about a proposed max tax bracket of 90% for income over 10 million. A friend of mine was very much against it and fought tooth and nail over it even though it has never and will never apply to him. His best argument was, \"how would you like to pay 90% every pay check?\" Basic lack of understanding of tax brackets.",
            "title_similarity": "0.6133086",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hh5wnwb",
            "score": 0,
            "text": "It’s because Americans are delusional. They also suck at math and probability. They don’t want to make it harder to be a billionaire bc some tiny part of us thinks “hey that could be me one day.”  In reality they have a better chance of getting struck by lightning twice. Billionaires have the ultimate freedom. They beat the game of life.",
            "title_similarity": "0.79648674",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hh5x5s1",
            "score": 0,
            "text": "Someday I might be rich. And then people like me better watch their step.",
            "title_similarity": "0.5220821",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hh5y02o",
            "score": 0,
            "text": "“Socialism never took root in America because the poor see themselves not as an exploited proletariat but as temporarily embarrassed millionaires.”\n\n-John Steinbeck",
            "title_similarity": "0.7592354",
            "sentiment_compound": -0.5514
        },
        {
            "id": "hh5yj4h",
            "score": 0,
            "text": "Well, it's clearly known Americans are some of the dumbest people.",
            "title_similarity": "0.5233007",
            "sentiment_compound": 0.128
        },
        {
            "id": "hh5yvfh",
            "score": 0,
            "text": "Why not just do a flat tax rate with simplistic tax codes. Get rid of then loopholes and tax everyone the same. 15℅ of 10milliom is a lot more than 10,000.",
            "title_similarity": "0.6476792",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh62p55",
            "score": 4,
            "text": "I’m against raising tax and but for closing tax loopholes.",
            "title_similarity": "0.563928",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh63h7b",
            "score": 0,
            "text": "Yeah they use to call them kings and queens. Humanity doesn't deserve freedom.",
            "title_similarity": "0.5542003",
            "sentiment_compound": -0.2887
        },
        {
            "id": "hh65r8v",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.078881934"
        },
        {
            "id": "hh67h21",
            "score": 0,
            "text": "Yeah, so? People also buy lottery tickets to fantasize about a better life. It's the normal American dream thing. Wealth taxes on the super-rich won't pay for every social program Americans think they deserve.",
            "title_similarity": "0.8195106",
            "sentiment_compound": 0.8623
        },
        {
            "id": "hh6wxax",
            "score": 0,
            "text": "The problem with billionaires is that they will get the wealth taxed away back from us regardless. So they don't care. Tax amazon billionaires and they will just raise their fees, and fire 50k people. They dont care about you, this country, or anyone other than their own wealth.",
            "title_similarity": "0.7990215",
            "sentiment_compound": -0.5772
        },
        {
            "id": "hh6xbmx",
            "score": 0,
            "text": "I love Bill Gates, I never used to but since I got the vaccine I just really like him for some reason.\n\nStill wanna see billionaires get taxed fairly though",
            "title_similarity": "0.6196947",
            "sentiment_compound": 0.7422
        },
        {
            "id": "hh6yrtv",
            "score": 0,
            "text": "You can't impose high tax on the riches, or they will tuck their money away in offshore companies, which they already have. You need to lower the tax rate down equally for everyone. It's a win win for everybody.",
            "title_similarity": "0.7677574",
            "sentiment_compound": 0.8931
        },
        {
            "id": "hh7drj8",
            "score": 0,
            "text": "The average American is an idiot and this shouldn't be a surprise to anyone.",
            "title_similarity": "0.5797575",
            "sentiment_compound": -0.6266
        },
        {
            "id": "hh7lox7",
            "score": 0,
            "text": "Or maybe a wealth tax is just not a very good idea.",
            "title_similarity": "0.649406",
            "sentiment_compound": 0.1474
        },
        {
            "id": "hh7qzuy",
            "score": 0,
            "text": "Sounds like something a billionaire would say .. and buy a newspaper company to spread the lie",
            "title_similarity": "0.63095963",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh83t03",
            "score": 0,
            "text": "I don’t support wealth taxes because I love billionaires, I don’t support wealth taxes because government is irresponsible with money. I’d rather have billionaires supporting the economy with it than government hurting the economy. \n\nFor a wealth tax, billionaires would have to sell parts of their companies to pay off the tax, which would slow down the economy.",
            "title_similarity": "0.89183617",
            "sentiment_compound": 0.9442
        },
        {
            "id": "hh8ajw1",
            "score": 0,
            "text": "Do the billionaires pay my bills? No? I support wealth taxes on super-rich",
            "title_similarity": "0.7348884",
            "sentiment_compound": 0.7059
        },
        {
            "id": "hh5pwt3",
            "score": 14,
            "text": "Just look at the PR firms the 1% uses and their tactics. It's really enlightening. The entire world is a show, who can act the best?",
            "title_similarity": "0.43039337",
            "sentiment_compound": 0.8313
        },
        {
            "id": "hh5rqmu",
            "score": -1,
            "text": "most americans are dumb, and were raised that way by their government.",
            "title_similarity": "0.55122733",
            "sentiment_compound": -0.552
        },
        {
            "id": "hh5rylp",
            "score": -1,
            "text": "Its hilarious how many of my friends support the ultra rich billionaires.",
            "title_similarity": "0.5832869",
            "sentiment_compound": 0.9022
        },
        {
            "id": "hh5seb4",
            "score": 1,
            "text": "Who the hell loves these billionaires??",
            "title_similarity": "0.562277",
            "sentiment_compound": -0.3094
        },
        {
            "id": "hh5sj5c",
            "score": 1,
            "text": "Have no love for any billionaires and I still think taxation is theft.\n\nWhy? Because every single apparatus in the history of mankind made to collect taxes has been immoral, inefficient and horribly corrupt. Without exception. \n\nNow what?",
            "title_similarity": "0.65663075",
            "sentiment_compound": -0.8787
        },
        {
            "id": "hh5tos8",
            "score": 1,
            "text": "Not me, tax those guys.",
            "title_similarity": "0.4213691",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5trk3",
            "score": 1,
            "text": "I call BULLLLLLSHITTTTTT",
            "title_similarity": "0.03449727",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5u5dl",
            "score": 1,
            "text": "Republicans: thank god these billionaires dont need to pay taxes.",
            "title_similarity": "0.663926",
            "sentiment_compound": 0.5988
        },
        {
            "id": "hh5vivk",
            "score": -1,
            "text": "Stockholm Syndrome at its most destructive and most accurate\n\nhttps://www.britannica.com/science/Stockholm-syndrome",
            "title_similarity": "0.3796829",
            "sentiment_compound": -0.6478
        },
        {
            "id": "hh5wzl6",
            "score": -1,
            "text": "Most people know that tax money is not spent very well.",
            "title_similarity": "0.52313495",
            "sentiment_compound": -0.2572
        },
        {
            "id": "hh5z54s",
            "score": 1,
            "text": "Imagine supporting a \"wealth tax\" 🤣",
            "title_similarity": "0.5253235",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hh6pw8o",
            "score": 1,
            "text": "It’s more so the American’s love for opportunity to make a fortune which will be harder to do if the government is actively trying to even out everyones income and benefits.",
            "title_similarity": "0.8015365",
            "sentiment_compound": 0.9035
        },
        {
            "id": "hh6qa84",
            "score": -1,
            "text": "Higher taxes isn't the answer. Government will just have more money to mismanage. They need to lower taxes for everyone, and then increase the minimum wage for companies with more than 75 employees.",
            "title_similarity": "0.7968486",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hh6wcry",
            "score": 1,
            "text": "OR maybe Congress should lower our tax rate while also raising the top earners %. would it be so difficult to then properly explain this? It sounds so simple yet will never ever happen…",
            "title_similarity": "0.74558794",
            "sentiment_compound": -0.5634
        },
        {
            "id": "hh7hyje",
            "score": 1,
            "text": "\"I'd rather die in debt, than making someone who will never notice me pay their fair share\" - some dude probably.",
            "title_similarity": "0.6778388",
            "sentiment_compound": -0.3826
        },
        {
            "id": "hh7j4rg",
            "score": 1,
            "text": "Who are these people that love billionaires?? Must be all those \"temporarily embarrassed millionaires\" who keep voting against their own interests.",
            "title_similarity": "0.79154575",
            "sentiment_compound": 0.6199
        },
        {
            "id": "hh7mb8d",
            "score": 1,
            "text": "And they’re all idiots.",
            "title_similarity": "0.23582509",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh85jl5",
            "score": 1,
            "text": "\"I have never understood why it is \"greed\" to want to keep the money you have earned but not greed to want to take somebody else's money.\"\n\nThomas Sowell,",
            "title_similarity": "0.6472765",
            "sentiment_compound": 0.2153
        },
        {
            "id": "hh9hkv5",
            "score": 1,
            "text": "Billionaires should not exist.\n\nNobody can \"work 100,000 times harder\" than a \"normal\" person. Nobody's \"idea\" is pulled off single-handedly without the labor input and other ideas of tens of thousands in their team. Many others likely had it too, they just weren't in the right place or time and with the right skills. And every single last one of them has benefitted from policies that are at the expenses of the majority.\n\nDon't get me wrong; I do believe that if a leader is truly the hardest working person on the team (and they should be, I also believe), then they should be paid accordingly. Having a team where the leader is paid 20x more than the lowest-paid person is OK to me so long as the former both really *is* working harder (so that the pay is earned both by work and skill), *and* the latter is also being paid the *entire* complement of their need (food, water, shelter, and medicine), *and* the team has enough members that the extra would mean little if divided amongst them.\n\nBut more than that? Much less, a \\*\\*\\*\\*ing billionaire? All the excuses they make is just BS to hide all the bodies they stepped on to get there.\n\n**Billionaires should not exist.**",
            "title_similarity": "0.6513394",
            "sentiment_compound": 0.5652
        },
        {
            "id": "hh5ge1h",
            "score": -2,
            "text": "Who tf likes the billionaires? What kind of science is this?",
            "title_similarity": "0.6153786",
            "sentiment_compound": 0.4871
        },
        {
            "id": "hh5lxbi",
            "score": -2,
            "text": "Sometimes I wonder how much they actually put out, it must cost millions a day to run the companies? I mean having a billion dollars is just crazy, there’s no other way to put it, but I wonder if he stopped making money rite now, how long could his money continue to keep the companies alive.",
            "title_similarity": "0.73677933",
            "sentiment_compound": -0.0644
        },
        {
            "id": "hh633tf",
            "score": -2,
            "text": "so this didn't happen 20 years ago because Bill Gates and Warren Buffet didn't have fan girls?  gimmeafuckinbreak",
            "title_similarity": "0.5008599",
            "sentiment_compound": -0.2411
        },
        {
            "id": "hh66ofx",
            "score": -2,
            "text": "I am in the group of people who think we should get pitch forks and torches and storm the richest neighborhoods. \n\nOr maybe just put them all in a gladiator pit and the last billionaire standing loses everything and gets to work in a Waffle House after church gets out.",
            "title_similarity": "0.52557534",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hh62b66",
            "score": -3,
            "text": "I love billionaires so much I don't want all their assets seized by the government, nor do them executed.. I want that and their entire blood lines ended.",
            "title_similarity": "0.6751187",
            "sentiment_compound": 0.7165
        },
        {
            "id": "hh63tdw",
            "score": -3,
            "text": "Based wealth taxes are dumb and don’t work",
            "title_similarity": "0.56369066",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hh56hbu",
            "score": 148,
            "text": "Open-access study in PNAS:\n\n[https://www.pnas.org/content/118/43/e2100430118](https://www.pnas.org/content/118/43/e2100430118)",
            "title_similarity": "0.129564",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7gnsx",
            "score": 4,
            "text": "If you scroll down far enough you find the billionaire white knights it’s fascinating",
            "title_similarity": "0.5308595",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hh5qur8",
            "score": 917,
            "text": "You just discovered WHY Musk spends a bunch of time being an epic meme guy.  \n\n\nIt's called PR.",
            "title_similarity": "0.47718757",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5d1bb",
            "score": 28,
            "text": "[removed]",
            "title_similarity": "0.078881934"
        },
        {
            "id": "hh56rze",
            "score": 282,
            "text": "[removed]",
            "title_similarity": "0.078881934"
        },
        {
            "id": "hh5m92n",
            "score": 201,
            "text": "Reminds me of how every one thinks Congress is terrible, but they think their own Congress person is doing a good job.\n\nOr how if someone likes their doctor on a personal level, they will refuse to sue them for malpractice.\n\nhttps://www.bookbrowse.com/excerpts/index.cfm/book_number/1521/page_number/10/blink",
            "title_similarity": "0.63868785",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hh56wgm",
            "score": 379,
            "text": "[removed]",
            "title_similarity": "0.078881934"
        },
        {
            "id": "hh578kc",
            "score": 259,
            "text": "**Abstract**\n\nDespite the ever-growing economic gap between the very wealthy and the rest of the population, support for redistributive policies tends to be low. This research tested whether people’s tolerance of inequality differs when it is represented in terms of a successful individual versus a group of people at the top of the economic ladder. We propose that drawing people’s attention to wealthy individuals undermines support for redistribution by leading people to believe that the rich person’s wealth is well deserved. Across eight studies (n = 2,800), survey participants rated unequal distributions of resources as more fair when presented with an individual, rather than a group, at the top of the distribution. Participants also expressed lower support for redistributive policies after considering inequality represented by successful individuals compared to groups. This effect was driven by people’s different attributions for individual versus group success. Participants thought that individuals at the top were more deserving of their successes and, in turn, were less likely to support redistribution when inequality was represented by individual success. These findings suggest that support for inequality, and policies to reduce it, may depend on who people are led to consider when they think about the top of the economic distribution.\n\n[Original source](https://www.pnas.org/content/118/43/e2100430118)",
            "title_similarity": "0.88047427",
            "sentiment_compound": 0.9933
        },
        {
            "id": "hh5j93t",
            "score": 1440,
            "text": "Who are these people? \n\nI just wanna talk",
            "title_similarity": "0.12462926",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5gz13",
            "score": 4995,
            "text": "People vote for policies that would affect the person who they want to be, not who they really are.",
            "title_similarity": "0.5970937",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hh5jqwy",
            "score": 7814,
            "text": "\"I don't know that guy, but man do I love him!\" Is a funny way to be.",
            "title_similarity": "0.39269614",
            "sentiment_compound": 0.8988
        },
        {
            "id": "hh6oypn",
            "score": 50,
            "text": "A lot of people are forgetting that the wealth \"no tax\" applied to celebrities as well.",
            "title_similarity": "0.67152834",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hh5lult",
            "score": 1,
            "text": "Who are all these people that love billionaires?",
            "title_similarity": "0.58162373",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh5m9s6",
            "score": 2,
            "text": "Celebretarianism is a strange religion.",
            "title_similarity": "0.2922291",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hh5pmjk",
            "score": 1,
            "text": "I just question efficacy. \n\nWealthy have the option to hide it everywhere. I think that we need to find a way to tax at the source before people get any kind of compensation or increase in wealth. Don’t know how to do that without an international agreement with the countries people would most likely try to hide in.",
            "title_similarity": "0.7590418",
            "sentiment_compound": 0.4537
        },
        {
            "id": "hh5qebv",
            "score": 1,
            "text": "Only for half of us. The other half are upset that it hasn't happened yet.",
            "title_similarity": "0.41289735",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hh5r1h8",
            "score": 1,
            "text": "Paid for by a billionaire :)",
            "title_similarity": "0.4902197",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hh5r8fg",
            "score": 2,
            "text": "I can't even understand what the title is saying!?",
            "title_similarity": "0.15832096",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5rbig",
            "score": 1,
            "text": "This definitely isn't an accident.",
            "title_similarity": "0.010595778",
            "sentiment_compound": 0.6433
        },
        {
            "id": "hh5rkun",
            "score": 1,
            "text": "*\"I love playing against the house even when I know the game is rigged!\"*",
            "title_similarity": "0.39315903",
            "sentiment_compound": 0.5848
        },
        {
            "id": "hh5s86b",
            "score": 1,
            "text": "Just remember. If you're worth less than 10 million you're in the same group as barter economy tribes in  the amazon.   \n\nYou have more in common with uncontacted tribes than with billionaires. And they live like it too.",
            "title_similarity": "0.6411704",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hh5s9fy",
            "score": 1,
            "text": "This sounds like common sense. Of course views would be affected by your personal opinion on the relevant people.",
            "title_similarity": "0.36902526",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hh5smyh",
            "score": 1,
            "text": "Dare to dream. Social media doesn’t help either",
            "title_similarity": "0.3571551",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hh5stp0",
            "score": 1,
            "text": "Manipulated by tv, Facebook, foxnews, and many more.",
            "title_similarity": "0.16917215",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hh5szyc",
            "score": 1,
            "text": "It’s almost like their self aggrandizing via media conglomerates they own is for the purpose of further self enrichment or something.",
            "title_similarity": "0.57730746",
            "sentiment_compound": 0.2975
        },
        {
            "id": "hh5tiqf",
            "score": 1,
            "text": "That altered carbon show is really coming true",
            "title_similarity": "0.2751543",
            "sentiment_compound": 0.4728
        },
        {
            "id": "hh5tzjn",
            "score": 1,
            "text": "I mean we elect the super rich into government positions, doesn’t matter what Americans love or hate we are controlled by the wealth and Democrats seems to be the most gullible. “Tax the rich” dresses and then introduce a bill that allows the government to monitor any account over $600, yea really going after the rich there.",
            "title_similarity": "0.75748515",
            "sentiment_compound": 0.9202
        },
        {
            "id": "hh5u42s",
            "score": 1,
            "text": "I'm sorry which Americans love billionaires? Like genuinely, who wakes up in the morning and thinks, you know that guy who has more money than most people make in a hundred lifetime and is activly destroying my life and my country, he's a swell guy? Like what? Even most rich people I know think higher taxes on them makes sense, it would bairly effect them anyway?",
            "title_similarity": "0.7969717",
            "sentiment_compound": 0.8794
        },
        {
            "id": "hh5u8yx",
            "score": 1,
            "text": "I got lost at \"Americans' love for individual billionaires\". This is a thing? They're like, known personalities and people _love_ them?",
            "title_similarity": "0.7264175",
            "sentiment_compound": 0.8738
        },
        {
            "id": "hh5v1zs",
            "score": 1,
            "text": "I don’t believe this. The Kardashians were jammed down ppls throats bc television producers weren’t creative enough to come up with anything else to scam ppl with. It was all downhill from there with the cheap “reality” that wasn’t reality. I don’t think the average American gives a damn about billionaires. In fact, the assholes going into space right now should find a way to not come back here. They’re useless.",
            "title_similarity": "0.63070965",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hh5v3qo",
            "score": 1,
            "text": "We are so dang stupid.",
            "title_similarity": "0.24139583",
            "sentiment_compound": -0.5688
        },
        {
            "id": "hh5v6ac",
            "score": 1,
            "text": "John Steinbeck once said that socialism never took root in America because the poor see themselves not as an exploited proletariat but as temporarily embarrassed millionaires (or billionaires).",
            "title_similarity": "0.77652085",
            "sentiment_compound": -0.5514
        },
        {
            "id": "hh5v7hd",
            "score": 1,
            "text": "This study definitely do NOT ask me my opinion for sure!  This American wants them to pay at least the same percentage of income/wealth that I’m paying. Tired of half my paycheck being gone after healthcare and taxes.",
            "title_similarity": "0.75679874",
            "sentiment_compound": 0.2481
        },
        {
            "id": "hh5v7zb",
            "score": 1,
            "text": "No sh*t this has been the problem for americans forever. We think can become that guy and willing to have others suffer for it.",
            "title_similarity": "0.5848519",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hh5vclr",
            "score": 1,
            "text": "I have never understood this at all",
            "title_similarity": "0.07900381",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5vdpn",
            "score": 1,
            "text": "Who wrote this the rich?",
            "title_similarity": "0.46512794",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hh5vh46",
            "score": 1,
            "text": "Imagine admiring someone sheerly based on their perceived wealth.",
            "title_similarity": "0.52179205",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hh5vjs3",
            "score": 1,
            "text": "The only reason billionaires are looked at favorably in the press is because their wealth and power buys that. Behind many billionaires is a lot of anti-social greedy behavior.",
            "title_similarity": "0.811663",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hh5vq3v",
            "score": 1,
            "text": "Who loves billionaires??",
            "title_similarity": "0.5682597",
            "sentiment_compound": 0.6199
        },
        {
            "id": "hh5vrz3",
            "score": 1,
            "text": "Sounds like a made up story for when the rich don't get taxed there is something to point at.",
            "title_similarity": "0.65978795",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hh5vzz4",
            "score": 1,
            "text": "“Social sciences continue to ignore fundamental fallacies, demonstrating unique preference to assume correlation when convenient, a new study finds.”",
            "title_similarity": "0.5130465",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hh5welb",
            "score": 1,
            "text": "I love them with a side of beans and rice",
            "title_similarity": "0.19621417",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh5wiqt",
            "score": 1,
            "text": "I wonder if this also holds up if you anonymise the billionaires and prime the participant with a story about what a given billionaire is doing with their money. There could be an element of them being happy with wealth inequality if it yields specific results; compared to a government which may spend the additional taxes inefficiently or be replaced with an opposition not supported by the participant down the road (i.e. spending the money against their interests).\n\nedit: I'm not suggesting that government spending is inherently inefficient, just that someone might think that",
            "title_similarity": "0.8536226",
            "sentiment_compound": 0.7869
        },
        {
            "id": "hh5wmtf",
            "score": 1,
            "text": "Should eat 'em.\n\nThe rich, I mean.",
            "title_similarity": "0.44726682",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hh5x1uv",
            "score": 1,
            "text": "Title should read. US citizens deep throat the boot.",
            "title_similarity": "0.27439058",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5x2ty",
            "score": 1,
            "text": "I thinks this happen all over the world",
            "title_similarity": "0.07730754",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5x52g",
            "score": 1,
            "text": "A bot farm isn't that expensive I guess.I bet there is a bit on the cheapest social engineering service. I would do that if I would be super rich, but still a pretty strange thought",
            "title_similarity": "0.6512772",
            "sentiment_compound": 0.7814
        },
        {
            "id": "hh5xbrs",
            "score": 1,
            "text": "\"Why would i vote for something that will hurt me when i become a billionaire?\"",
            "title_similarity": "0.72509265",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hh5xce6",
            "score": 1,
            "text": "This is why I have never idolized anyone my whole life. True story!\n\n I always found it odd when someone said  I want to be like this person or that person. They only wanted to be them because they were filthy rich. I’ve always wanted to be myself because with the little I have always had, I always tried to use it to help others. I find that one way or another it comes back to me :)\n\nBtw, grew up super poor but now I’m doing middle-class just fine! The other day I was so happy because I was moving to a different state (remote job and want to buy a house) that I gave a homeless woman $20 bucks because she wanted some potato wedges at the super market. She looked like she was blind also so I hope the money helps out. \n\nSigh, I wish I could fix everyone’s problems.",
            "title_similarity": "0.6147304",
            "sentiment_compound": 0.9854
        },
        {
            "id": "hh5xd8e",
            "score": 1,
            "text": "I just hate taxes as a whole man.",
            "title_similarity": "0.5510818",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hh5xegz",
            "score": 1,
            "text": "“I don't mind stealin' bread from the mouths of decadents,\nBut I can't feed on the powerless when my cup's already overfilled”",
            "title_similarity": "0.5460062",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hh5xf12",
            "score": 1,
            "text": "“love for individual billionaires”?  What a terrible headline.",
            "title_similarity": "0.6838821",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hh5xnye",
            "score": 1,
            "text": "Why does this subreddit post this garbage? Its so clearly a study with a buzz headline agenda.",
            "title_similarity": "0.48859158",
            "sentiment_compound": 0.541
        },
        {
            "id": "hh5xp8a",
            "score": 1,
            "text": "I’m in America. Show me an “American” and I’ll consider the findings",
            "title_similarity": "0.29382354",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5xssd",
            "score": 1,
            "text": "What's even far worse is the cult of Hollywood celebrities. Billionaires tend to at least be intelligent, unlike actors who often preach incredibly dumb and dangerous ideas.",
            "title_similarity": "0.75073624",
            "sentiment_compound": -0.7939
        },
        {
            "id": "hh5xu7d",
            "score": 1,
            "text": "Wealth tax is hard to collect on when billionaires can just move themselves and their wealth out of a country. I prefer a tax on land value. Just tax the land. It's a lot harder to dodge that.",
            "title_similarity": "0.7768443",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hh5xwzk",
            "score": 1,
            "text": "Similar to the effect that people tend to hate Congress, but like their Congressperson.",
            "title_similarity": "0.68168694",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hh5y31x",
            "score": 1,
            "text": "As an American I can say with absolute, 100% pure disgust we do not love the mega wealthy. Hell, don’t even like em!",
            "title_similarity": "0.70019436",
            "sentiment_compound": -0.8466
        },
        {
            "id": "hh5y8hk",
            "score": 1,
            "text": "I hate how much our culture and country idolize millionaires and billionaires. It disgusts me so much: we think they're so much better than us, we think they can do no wrong, we want to be them or become like them, we put them on pedestals and worship them. But the vast majority of them couldn't be further from the truth.\n\nMost are horrible human beings who care about nothing except for their wealth, comfort, and themselves. They hoarde wealth that's beyond reason and dosge taxes while the rest of the world scrambles for what's left and still foot the bills. They own the world's resources while billions go without and die due to their greed. They live and \"work\" in comfort while working everyone else to their bones and encourage laws that police everyone else's lives.ather than sharing what's available with everyone. They wax haughtily but profess humbly, and sell us the idea that we can achieve what they have because they were like us and worked their ways up; but the game was practically rigged from the start and 99% were born to wealth or connections that have been kept closed off to the rest of us for centuries.",
            "title_similarity": "0.81387496",
            "sentiment_compound": 0.9864
        },
        {
            "id": "hh5y8rn",
            "score": 1,
            "text": "Oh man, we’re such a bunch of suckers.",
            "title_similarity": "0.33580983",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hh5yc98",
            "score": 1,
            "text": "Maybe not representative but I spend precisely zero time thinking about billionaires.  Time on Reddit has given me the impression there is no love for billionaires, only hate (that part I believe is quite representative)",
            "title_similarity": "0.6459829",
            "sentiment_compound": -0.8501
        },
        {
            "id": "hh5ycwe",
            "score": 1,
            "text": "Hard to have an issue with somebody that built a billion dollar company from the ground up that is providing a universal benefit to everybody in some way. Quite another to have their non-performing and sometimes deadbeat beneficiaries controlling the economic and political strings to the detriment of society because they were left a bottomless stash of cash.",
            "title_similarity": "0.791762",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hh5ydeb",
            "score": 1,
            "text": "Saw this quote somewhere here on reddit:\n\n\"Working class americans don't see themselves as the exploited, but as the future billionaires yet to become.\"",
            "title_similarity": "0.79524136",
            "sentiment_compound": -0.25
        },
        {
            "id": "hh5ye6y",
            "score": 1,
            "text": "So hate all rich people. Got it. Good. I’m on it.",
            "title_similarity": "0.5799442",
            "sentiment_compound": 0.4158
        },
        {
            "id": "hh5yjut",
            "score": 1,
            "text": "Pretty sure this is old science. Like, cited in “Dude, where’s my country?”",
            "title_similarity": "0.2903425",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hh5yqsg",
            "score": 1,
            "text": "It's really just another form of celebrity worship",
            "title_similarity": "0.388453",
            "sentiment_compound": 0.296
        },
        {
            "id": "hh5yr0c",
            "score": 1,
            "text": "That's pretty disgusting.Reminds me of stockholm syndrome.\n\nlove your captors.",
            "title_similarity": "0.44203824",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hh5yr58",
            "score": 1,
            "text": "Medieval kings were said to be devine and blessed by god. Funny how that happens",
            "title_similarity": "0.38252038",
            "sentiment_compound": 0.836
        },
        {
            "id": "hh5ywod",
            "score": 1,
            "text": "what if people just detached their kissers from the big money boys’ nutsacks so we can fund green energy please and thank you",
            "title_similarity": "0.60311043",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hh5z375",
            "score": 1,
            "text": "People want to be a billionaire themselves someday. So they support every avenue for someone else to become one. \nThey fail to realize they will die middle class like the rest of us.",
            "title_similarity": "0.7187531",
            "sentiment_compound": -0.3862
        },
        {
            "id": "hh5z37m",
            "score": 1,
            "text": "I would say that \"love\" for a billionaire is just bizarre as hell but these days people are also \"fans\" of corporations and politicians so I guess it makes sense.",
            "title_similarity": "0.7314112",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hh5z3sl",
            "score": 1,
            "text": "_why should I pay millionaires' tax, I'm a billionaire_",
            "title_similarity": "0.6630994",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hh5z4mr",
            "score": 1,
            "text": "Well, I’m glad Bezos is an asshole helping break stereotypes out here",
            "title_similarity": "0.4980594",
            "sentiment_compound": 0.743
        },
        {
            "id": "hh5z7vm",
            "score": 1,
            "text": "Haha, no surprise here. Success breeds admiration.",
            "title_similarity": "0.27862975",
            "sentiment_compound": 0.855
        },
        {
            "id": "hh5z9cf",
            "score": 1,
            "text": "it doesn't help that most media coverage of billionaires is either positive or extremely softball if it's negative.. makes them look like kooky regular people who \"worked hard\" and are \"reaping the rewards\".",
            "title_similarity": "0.6916199",
            "sentiment_compound": 0.4295
        },
        {
            "id": "hh5za71",
            "score": 1,
            "text": "I would like to go on record to say I do not love any individual billionaires.",
            "title_similarity": "0.60832834",
            "sentiment_compound": -0.2187
        },
        {
            "id": "hh5zfde",
            "score": 1,
            "text": "I don't love billionaires but I question whether the Government can spend the money better. And it is their money.",
            "title_similarity": "0.8226639",
            "sentiment_compound": 0.3952
        },
        {
            "id": "hh5zix7",
            "score": 1,
            "text": "Taxing billionaires that aren't corporations im fine with but if you tax big business 9 times out of 10 the consumers have to pay for it. Hence one of the reasons why inflation is so bad right now.",
            "title_similarity": "0.8166376",
            "sentiment_compound": -0.8455
        },
        {
            "id": "hh5zkot",
            "score": 1,
            "text": "Everytime I lament the wealthy and talk about how they're destroying the world and society, there's always that one person who goes \"yeah, what about Bill Gates?\" Like he's some saint. \n\nIt's infuriating.",
            "title_similarity": "0.6733135",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hh5zp69",
            "score": 1,
            "text": "Are these the same Americans taking horse dewormer and used to drink bleach a year ago?",
            "title_similarity": "0.3965739",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5zrlj",
            "score": 1,
            "text": "Psychology? Subjective metrics? Highly political subject? Run by politically motivated undergrads?\n\nOh boy, wonder what methodological and interpretive skeletons these papers have in their closets...",
            "title_similarity": "0.63013804",
            "sentiment_compound": 0.6072
        },
        {
            "id": "hh5zrsj",
            "score": 1,
            "text": "A society of sycophants.",
            "title_similarity": "0.19461595",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5zwgt",
            "score": 1,
            "text": "I always forget who wrote this, but:\n\n“Americans don’t see themselves as poor or middle class, but as temporarily embarrassed millionaires”. \n\nI probably butchered it, but you get the idea.",
            "title_similarity": "0.76752377",
            "sentiment_compound": -0.8338
        },
        {
            "id": "hh5zxu9",
            "score": 1,
            "text": "The bathtub economics model is something I'll never forget. The water from the tap is income and drain is the expenses. The water in the tub is supposed to be wealth. However it's missing something, I think the billionaires have drilled a hole on the side and attached a giant hose so that money leaves the system and siphons out to their  pool. We're all trying to have bubble baths in 2\" of water while they're having pool parties. The government has given up and just goes to their house to shower.",
            "title_similarity": "0.6285206",
            "sentiment_compound": 0.656
        },
        {
            "id": "hh5zy51",
            "score": 1,
            "text": "I wish more people understood this",
            "title_similarity": "0.2052332",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hh5zyx2",
            "score": 1,
            "text": "If you make $100,000.00 a year it will take you 10,000 years to become a billionaire. So do you really think those guy do Ten Thousand times more work then you do in a year?",
            "title_similarity": "0.55009407",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh5zz2c",
            "score": 1,
            "text": "Now here comes the blame for the poor American who has been indoctrinated by corporate media to admire billionaires in the first place. Has anyone read manufacturing consent?",
            "title_similarity": "0.8014645",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hh606dq",
            "score": 1,
            "text": "It’s simple for me. I dislike government more than I dislike billionaires. Billionaires add value to my life, the government ruins everything it touches. \n\nThey don’t even know how to properly tax billionaires anyways. Most proposals I see. Just ends up hitting low to middle class people than anything else. Unforeseen consequences, look it up!\n\nThere’s also a big difference between net worth and liquid assets. This seems to be lost on many people. \n\nAt the end of the day. I don’t really care about billionaires one way or another. But they pay way more tax than people realize, there is more to “paying your fair share” than income tax.",
            "title_similarity": "0.8727709",
            "sentiment_compound": 0.1297
        },
        {
            "id": "hh60akz",
            "score": 1,
            "text": "did a billionaire write this article?",
            "title_similarity": "0.50484407",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh60as2",
            "score": 1,
            "text": "And the rest of the world suffers for it.",
            "title_similarity": "0.36200976",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hh60awz",
            "score": 1,
            "text": "This is interesting, but unscientific.",
            "title_similarity": "0.22001678",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hh60ct7",
            "score": 1,
            "text": "[Here's a list](https://www.bloomberg.com/billionaires/) of many of the people who are oppressing you and me.\n\nBut, don't think this list is definitive. There are a many people who refuse to be listed and make it so known to the people who publish these types of lists. I have no doubt there are at least a few people richer than those listed at the top of this list and don't want to be mentioned.",
            "title_similarity": "0.7516345",
            "sentiment_compound": 0.7455
        },
        {
            "id": "hh60gxr",
            "score": 1,
            "text": "Who funded that study, the Pol Pot Institute?",
            "title_similarity": "0.36796197",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh60gzc",
            "score": 1,
            "text": "Sad we could be so dumb",
            "title_similarity": "0.39663386",
            "sentiment_compound": -0.8096
        },
        {
            "id": "hh60l76",
            "score": 1,
            "text": "study was funded by the bill and melinda gates foundation.",
            "title_similarity": "0.3586248",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh60o97",
            "score": 1,
            "text": "Look at the billionaires you know. They all have small penises. End of discussion.",
            "title_similarity": "0.44398373",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh60z3d",
            "score": 1,
            "text": "Not fair that the middle class pays most of the taxes (US).",
            "title_similarity": "0.7133093",
            "sentiment_compound": -0.2411
        },
        {
            "id": "hh6111a",
            "score": 1,
            "text": "This has been the way for over 100 years. I remember the \"temporarily embarassed millionaire\" thing",
            "title_similarity": "0.27170286",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh611cd",
            "score": 1,
            "text": "It's \"fan worship\" that these pathetic simps have for billionaires.",
            "title_similarity": "0.6348182",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hh612hy",
            "score": 1,
            "text": "As an American,  I am 100% in favor of taxing billionaires excessively.",
            "title_similarity": "0.5909233",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hh613ym",
            "score": 1,
            "text": "Love for billionaires is a funny ass sentence",
            "title_similarity": "0.60266834",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hh61801",
            "score": 1,
            "text": "Who’d you talk to because I can’t stand super rich people. Smug pricks",
            "title_similarity": "0.73402697",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hh61chs",
            "score": 1,
            "text": "I don't like any billionaires that are openly against taxation of the super-rich.",
            "title_similarity": "0.780249",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hh61hk3",
            "score": 1,
            "text": "And yet I don't see the 99% supporting the new $600 bank auditing scheme that only the super rich are backing.\n\nI don't see any conclusive evidence whatsoever suggesting public support has a meaningful role in our politicians decision making.",
            "title_similarity": "0.7206469",
            "sentiment_compound": 0.9382
        },
        {
            "id": "hh61kv7",
            "score": 1,
            "text": "I mean, sure, study it, but did we not see this coming after the study that said that people hate “the government” but love their individual representatives?",
            "title_similarity": "0.75068283",
            "sentiment_compound": 0.34
        },
        {
            "id": "hh61ld7",
            "score": 1,
            "text": "Well, the concept of economic inequality is conflicted at best.   If it is so important, then we should be all taxed at 90% and send all those money to 3rd world country.  I don't see people rushing to support that.\n\nWe are not the billionaires in USA, but we are the billionaires if you count the whole world.    So, we are on the opposite 2 sides in these 2 cases.",
            "title_similarity": "0.76341224",
            "sentiment_compound": 0.6891
        },
        {
            "id": "hh61x0a",
            "score": 1,
            "text": "\nThis sticker is dangerous and inconvenient, but I do love Fig Newtons.",
            "title_similarity": "0.4639771",
            "sentiment_compound": 0.6187
        },
        {
            "id": "hh6208n",
            "score": 1,
            "text": "I’m an American.  I wasn’t aware that I was supposed to love billionaires.  I have no problem taxing them.  Maybe not “taxing the hell out of them” but they should pay at least the same percentage as the average joe-on-the-street pays.  If that amounts to taxing the hell out of them, then so be it.",
            "title_similarity": "0.741228",
            "sentiment_compound": -0.5329
        },
        {
            "id": "hh6225j",
            "score": 1,
            "text": "Well that's great.  If you decide, for whatever reason you want normal spheres top off the mold about 45 minutes after putting them in.  I had the same problem.",
            "title_similarity": "0.32893193",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hh626ev",
            "score": 1,
            "text": "Americans are pretty stupid",
            "title_similarity": "0.4845333",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hh627rc",
            "score": 1,
            "text": "Wealth tax doesn't make sense.",
            "title_similarity": "0.5626205",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hh62d21",
            "score": 1,
            "text": "I basically told someone at the park:\n\n\"I hope one of those rocket ships full of billionaires explodes, the world will be a better place for it.\"\n\nAnd got shocked pikachu faces.\n\nLike... those people not only wouldn't care if you died, they'd actively kill you for profit.",
            "title_similarity": "0.6213555",
            "sentiment_compound": 0.4775
        },
        {
            "id": "hh62dz1",
            "score": 1,
            "text": "I respect the wealthy who worked for it... but i also support whatever wealth tax can relieve the burden of my measly earnings to keep this country afloat",
            "title_similarity": "0.6503903",
            "sentiment_compound": 0.8765
        },
        {
            "id": "hh62jwn",
            "score": 1,
            "text": "That 'love' has been cultivated by guess who.",
            "title_similarity": "0.24119827",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh62kb5",
            "score": 1,
            "text": "Not at all. Just tax the billionaires. No one making less than a million feel this way.",
            "title_similarity": "0.5705521",
            "sentiment_compound": -0.296
        },
        {
            "id": "hh62nsy",
            "score": 1,
            "text": "Another piece of anecdotal evidence that Americans are a special type of stupid.",
            "title_similarity": "0.53970367",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hh62nt1",
            "score": 1,
            "text": "Translation: we are stupid enough to think that if we try hard enough we can be billionaires too.",
            "title_similarity": "0.70243996",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hh62pvu",
            "score": 1,
            "text": "And who funded the study, the super rich just to make you believe you love them.",
            "title_similarity": "0.68397397",
            "sentiment_compound": 0.9136
        },
        {
            "id": "hh62vu7",
            "score": 1,
            "text": "Jeff Bezzos bought the Washington post in 2013.",
            "title_similarity": "0.28439456",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6300n",
            "score": 1,
            "text": "I don't know anyone who loves a billionaire? Feels like a study and article like this is written explicitly to get me as the reader, to accept that this is an accepted truth, without questioning that it actually isn't.\n\nI think many regular people are delusional enough to believe that they will be billionaires themselves in their lifetime. They worry that speaking ill of the existing members of their \"inevitable\" clubhouse might hurt their chances down the line.",
            "title_similarity": "0.71711946",
            "sentiment_compound": 0.7715
        },
        {
            "id": "hh630wj",
            "score": 1,
            "text": "\"and makes them less likely to support wealth taxes\" seems like a biased metric, no?",
            "title_similarity": "0.7509128",
            "sentiment_compound": 0.7216
        },
        {
            "id": "hh633a5",
            "score": 1,
            "text": "I don't think I've ever met someone who loved individual billionaires. Like there are people who may like a celebrity who just happens to be a billionaire (I'm generally pro-Musk, Kanye, and Gates myself) but \"love\"? That's strange. \n\nBut like with a lot of studies, this seems somewhat self-explanatory. Someone who loves the rich would be less likely to want to tax them. In the same way as my general pro-teacher & pro-farmer attitudes may make me less likely to support stuff that'd make their lives harder.",
            "title_similarity": "0.82456374",
            "sentiment_compound": 0.9798
        },
        {
            "id": "hh63als",
            "score": 1,
            "text": "It's almost like the propaganda issued by media owned and operated by the ultra rich and designed to put a positive spin on plutocrats works. \n\nTIL.",
            "title_similarity": "0.6476763",
            "sentiment_compound": 0.8258
        },
        {
            "id": "hh63at9",
            "score": 1,
            "text": "Donnie's Hillbilly Dunces LOVE a rapey lying NYC \"Billionaire.\" Weird.",
            "title_similarity": "0.5948125",
            "sentiment_compound": 0.2103
        },
        {
            "id": "hh63pdr",
            "score": 1,
            "text": "Then the decades of propaganda worked.",
            "title_similarity": "0.25170958",
            "sentiment_compound": -0.25
        },
        {
            "id": "hh63wy4",
            "score": 1,
            "text": "It might also be hating the government. Also idk if this has been studied, but rhetoric to tax billionaires often resulting in taxes that do nothing but nail the upper middle class, or the perception that that is what is going to happen.",
            "title_similarity": "0.8648396",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hh63y28",
            "score": 1,
            "text": "Head over to the Tesla sub. See those cksuckers",
            "title_similarity": "0.2292284",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh63ym8",
            "score": 1,
            "text": "The future is bleak, folks. They put guns on those robot dogs. It's gonna make massacring poor people so much more efficient.",
            "title_similarity": "0.57350886",
            "sentiment_compound": 0.0661
        },
        {
            "id": "hh63zcx",
            "score": 1,
            "text": "I would assume this would be the case any where not just America. I understand since the study was done in America. But I think the title is a misgiving. I am not American but isn't this like common sense thing? Are we surprised ? I don't understand the purpose of this kind of studies.",
            "title_similarity": "0.58994836",
            "sentiment_compound": -0.6359
        },
        {
            "id": "hh6414c",
            "score": 1,
            "text": "I’d be really good at being rich.",
            "title_similarity": "0.45981112",
            "sentiment_compound": 0.7778
        },
        {
            "id": "hh641vw",
            "score": 1,
            "text": "It's almost like if you find yourself willing to run screaming off a cliff in defense of a corrupt narcissist you might want to take a step back and ask yourself why...fascinating stuff.",
            "title_similarity": "0.53914833",
            "sentiment_compound": 0.1045
        },
        {
            "id": "hh647vu",
            "score": 1,
            "text": "If only it worked the other way around ...",
            "title_similarity": "0.1589327",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh64bkm",
            "score": 1,
            "text": "Americans spilled blood by the thousand to overthrow a monarchy and institute a republic where all men are created equal. Ever since then we've been trying to create a \"monarchy\" of our own. We simply replaced a dynasty based on supposed God-given nobility with dynasties based on inherited money.\n\nI mean, take the Kennedys, for example. They all get pushed straight to the top of the social ladder, with an army of people practically begging them to run for president. We're even cool with calling their family home \"Camelot\". It's absurd.",
            "title_similarity": "0.6494892",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hh64er4",
            "score": 1,
            "text": "... who actually \"loves\" these guys? I don't think I know *anyone* who has any warm fuzzies for any specific billionaire...",
            "title_similarity": "0.5268733",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hh64g5i",
            "score": 1,
            "text": "They should have interviewed me.",
            "title_similarity": "0.19545391",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh64jzl",
            "score": 1,
            "text": "As dumb is, so dumb does.",
            "title_similarity": "0.2690847",
            "sentiment_compound": -0.7841
        },
        {
            "id": "hh64nxc",
            "score": 1,
            "text": "Crazy how idolizing someone makes you less likely to do disagree with them in areas where you probably should.\n\nWhich is the same reason that idolizing politicians needs to be looked upon the same way. Don’t give credit where credit isn’t due.",
            "title_similarity": "0.7486131",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hh64oye",
            "score": 1,
            "text": "I love him, please give him a tax break and cut my pay.",
            "title_similarity": "0.53581476",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hh64v9s",
            "score": 1,
            "text": "Americans are stupid. What’s new ?",
            "title_similarity": "0.4797348",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hh650u3",
            "score": 1,
            "text": "🤦🏽‍♂️ freakin Americans never cease to amaze me. And the funny thing is, I’m American. Land of the sheep, home of the lame 😒",
            "title_similarity": "0.4716534",
            "sentiment_compound": -0.4118
        },
        {
            "id": "hh656uq",
            "score": 1,
            "text": "I think it's more so that these people think they're going to be rich at some point in life.",
            "title_similarity": "0.5708765",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hh65aq2",
            "score": 1,
            "text": "> These findings suggest that support for inequality, and policies to reduce it, may depend on who people are led to consider when they think about the top of the economic distribution.\n\nWhat I can read of the paper seems to portray you are either for or against income inequality but they fail to explore tax inequality which I think is what the real disconnect is at. That is probably more at the heart of \"well that individual earned it\" mentality because they don't want to penalize someone they would not feel comfortable paying taxes for themselves. Just because someone doesn't want to soak the rich solely because they are rich doesn't mean there aren't flaws in the tax code that they want to be addressed.",
            "title_similarity": "0.8314154",
            "sentiment_compound": 0.9243
        },
        {
            "id": "hh65bai",
            "score": 1,
            "text": "I’m not religious at all - but maybe there’s something to be said about not worshiping people.",
            "title_similarity": "0.318174",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hh65byt",
            "score": 1,
            "text": "This is the reason why billionaires invest so much money into their image. It takes a lot of spin to justify their own existence in today's world, and without it the masses may just eat them alive. \n\nBut by hiring the best PR firms in the world and creating a likeable image, they can continue to exploit the masses.",
            "title_similarity": "0.7730812",
            "sentiment_compound": 0.93
        },
        {
            "id": "hh65f8g",
            "score": 1,
            "text": "News media take note: don’t talk about billionaires as being individual people. Only refer to them as a group. It’s much easier to dehumanize them that way!",
            "title_similarity": "0.71322197",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh65kbr",
            "score": 1,
            "text": "If there was a sentient pile of cash, us americans would fawn over it",
            "title_similarity": "0.6815995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh65nvq",
            "score": 1,
            "text": "The propaganda made up by all of the think tanks these wealthy individuals contribute to, tax exempt, of course, really does work…",
            "title_similarity": "0.56483066",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hh65xy6",
            "score": 1,
            "text": "If this seems bizarre to you, the same phenomenon happens with fans of sports figures.  Despite these people making millions or 10's of millions/year if they are fined, fans will try to pay the fine.",
            "title_similarity": "0.7022484",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hh663dp",
            "score": 1,
            "text": "That’s Bc avoiding taxes, stepping on the little man and telling poor people to work harder has become the American dream.",
            "title_similarity": "0.6671802",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hh668po",
            "score": 1,
            "text": "Is that why? I always assumed it was because people were delusional thinking they will one day be rich and wouldn't want to lose money when they are.",
            "title_similarity": "0.6866604",
            "sentiment_compound": 0.6844
        },
        {
            "id": "hh66gaj",
            "score": 1,
            "text": "The phrase “Turkeys voting for Christmas” springs to mind.",
            "title_similarity": "0.28615344",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh66mj6",
            "score": 1,
            "text": "‘I’m just a little birthday boy. You wouldn’t tax a little birthday boy would you???’ Musk, Bezos, every billionaire ever",
            "title_similarity": "0.5267062",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh66mmu",
            "score": 1,
            "text": "I'm not an American but my Mom is. She explained this attitude like so.\n\n\"Large portions of the America population, even when dirt poor still think they're going to become a millionaire. Somewhere in their lives someone convinced them that the American Dream could be a reality for literally everyone in America when it's something that you only end up with if you're lucky.\"\n\nMany American's refuse to rail against the rich because they think they might still become rich in the future and therefore don't want to be hamstrung when they \"finally make it\".",
            "title_similarity": "0.80656326",
            "sentiment_compound": 0.9248
        },
        {
            "id": "hh66oaw",
            "score": 1,
            "text": "I love Elon and taxes",
            "title_similarity": "0.34753844",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh66vys",
            "score": 1,
            "text": "Americans don't love billionaires, they just reject the narrative that soaking them for more of their wealth is going to improve their situation, or the situation of others and that the problems this country has (policing, inflation, housing, drug crisis) are not ameliorated by collecting a few more billion dollars from the ultra-wealthy.",
            "title_similarity": "0.8416084",
            "sentiment_compound": -0.7582
        },
        {
            "id": "hh674wv",
            "score": 1,
            "text": "Americans are stupid, that's why. No ability to think for themselves or for the future. My countrymen are screwed by their own idiocy.",
            "title_similarity": "0.64129484",
            "sentiment_compound": -0.8206
        },
        {
            "id": "hh6760i",
            "score": 1,
            "text": "How can you love someone you don’t know?",
            "title_similarity": "0.33022037",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh676yg",
            "score": 1,
            "text": "Just visit /r/space and you'll see the billionaire worship",
            "title_similarity": "0.38817877",
            "sentiment_compound": 0.296
        },
        {
            "id": "hh67crz",
            "score": 1,
            "text": "This isn’t very science-y.",
            "title_similarity": "0.17095244",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh67izi",
            "score": 1,
            "text": "Who loves billionaires (except maybe themselves)?  You seen one narcissist, you've seen 'um all...",
            "title_similarity": "0.6124648",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hh67n53",
            "score": 1,
            "text": "Yeah they're fuckin stupid",
            "title_similarity": "0.2069329",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hh67ren",
            "score": 1,
            "text": "Nope taxes billionaires to the hilt.",
            "title_similarity": "0.59070665",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh67siq",
            "score": 1,
            "text": "That is odd. I can love Jay-Z and his music but still want him to pay more in taxes.",
            "title_similarity": "0.6967716",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hh680uq",
            "score": 1,
            "text": "That must be the ‘dumb’ Americans. I work a trade (physical labor) and I know I probably worker harder (physically) than billionaires. I’m tired at the end of the day. My body aches the next morning. I take a half hour lunch, if that. I have no love for these people. Yes Amazon is nice and convenient (as I hate physically shopping) but I mean come on. invest in roads, schools, public servants, public housing.",
            "title_similarity": "0.65409374",
            "sentiment_compound": -0.4374
        },
        {
            "id": "hh686no",
            "score": 1,
            "text": "Which of you dicks “loves billionaires?”",
            "title_similarity": "0.59288317",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6876p",
            "score": 1,
            "text": "What a horrible headline. No where in the article did it say love the upper rich, but rather admire.\n\nAnd I dislike the apples to oranges idea it presented.\nLooking at one person growing their wealth is vastly different than AN ENTIRE GROUP. \n\n Think about it. If a group grew like that, clearly they were disproportionately paid compared to others. Where as if a single person did that, MAYBE  they just had a good opportunity.  \n\nApples and oranges.",
            "title_similarity": "0.82806957",
            "sentiment_compound": 0.9735
        },
        {
            "id": "hh687pr",
            "score": 1,
            "text": "I’m American. And I truly don’t understand why anyone would idolize any of those criminals. God, we’re truly fucked.",
            "title_similarity": "0.5968763",
            "sentiment_compound": -0.296
        },
        {
            "id": "hh68ar9",
            "score": 1,
            "text": "The way that dude holds his wine glass makes me irrationally angry.",
            "title_similarity": "0.47217014",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hh68c3b",
            "score": 1,
            "text": "Its all aspirational. \"Hey! (Insert Billionaire Here) can do it, so can I!\" or \"They got theirs, good for them!\"",
            "title_similarity": "0.4125627",
            "sentiment_compound": 0.5826
        },
        {
            "id": "hh68f5y",
            "score": 1,
            "text": "Deified resource hoarders. Sounds familiar.",
            "title_similarity": "0.22508463",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh68iqd",
            "score": 1,
            "text": "Well those people are idiots aren't they",
            "title_similarity": "0.3403926",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hh68nno",
            "score": 1,
            "text": "If there are any redditors that expect to find actual science on this subreddit. You won’t.",
            "title_similarity": "0.40476963",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh68ovp",
            "score": 1,
            "text": "I have quite a few billionaire and millionaires that I personally like and find interesting in a good way, none of them are openly calling for less taxes on themselves that I’ve heard.",
            "title_similarity": "0.5871799",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hh68t1v",
            "score": 1,
            "text": "Maybe this is why Disney emphasizes its characters so much.\n\nDon't want to take Micky's Haunted Mansion away in a wealth tax.",
            "title_similarity": "0.66930085",
            "sentiment_compound": -0.0991
        },
        {
            "id": "hh68vz5",
            "score": 1,
            "text": "This isn't a big, its a feature. John D Rockefeller did this over a hundred years ago. He hired a publicist and had movies made and stories written about his generosity when he found out he was universally despised and the government was about to tax him.",
            "title_similarity": "0.66664916",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hh68yao",
            "score": 1,
            "text": "So in other words, people are stupid.",
            "title_similarity": "0.3496495",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hh69136",
            "score": 1,
            "text": "Who loves billionaires?",
            "title_similarity": "0.55671036",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hh691iz",
            "score": 1,
            "text": "That’s why celebrity worship culture is a stain. It’s for those whom have a very low value of themselves.",
            "title_similarity": "0.67515343",
            "sentiment_compound": 0.3581
        },
        {
            "id": "hh691na",
            "score": 1,
            "text": "Who loves these fucks",
            "title_similarity": "0.31273592",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hh691tc",
            "score": 1,
            "text": "Stupid is as stupid does.  The rich know this and take advantage of it at every turn...which is how they can stay so rich.",
            "title_similarity": "0.5836936",
            "sentiment_compound": 0.5293
        },
        {
            "id": "hh6932c",
            "score": 1,
            "text": "As a not billionaire, I can tell you this data is incorrect.",
            "title_similarity": "0.40821213",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh695o4",
            "score": 1,
            "text": "Americans love for billionaires…is that specifically cited as the reason?",
            "title_similarity": "0.7133588",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh69anq",
            "score": 1,
            "text": "Everyone who looks or responded here should read \"Break em Up\" by Zephyr Teachout. She's badass.",
            "title_similarity": "0.3799173",
            "sentiment_compound": 0.34
        },
        {
            "id": "hh69fge",
            "score": 1,
            "text": "You can raise the tax as high as you like, but as long as the loopholes and tax deductions exist, they will be paying the same amount now.",
            "title_similarity": "0.5139151",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hh6a0k6",
            "score": 1,
            "text": "America's prosperity gospel has got us into this mess. Where if you're rich you're 'blessed by God' or this person worked so hard for their wealth that's why they're a billionaire. Some Americans don't want to face the ugly truth that working yourself to death will not make you wealthy or in some cases simply stabilize your finances.  \n\n\nNot to mention the types of people who are billionaires are rarely the philanthropic types because you have to use and abuse people (and the tax system) to climb to that amount of obscene wealth. Despite being able to solve world hunger AT ANY TIME or climate change AT ANY TIME. These people would rather shoot themselves into space. This is why my generation is soured by capitalism. It just produces the worst kinds of people on top of obscene wealth inequality.",
            "title_similarity": "0.84900236",
            "sentiment_compound": -0.8879
        },
        {
            "id": "hh6a0ot",
            "score": 1,
            "text": "Look, billionaires have a devine right to their wealth and that generated by their serfs. It's a law of nature.",
            "title_similarity": "0.6219153",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hh6a4pv",
            "score": 1,
            "text": "Yeah I don’t like/care about one single one of them. Let’s tax",
            "title_similarity": "0.48787042",
            "sentiment_compound": 0.296
        },
        {
            "id": "hh6ackf",
            "score": 1,
            "text": "ElOn BiG cHuungoS sMoKe Weed FuNy No coBaLt MiNes",
            "title_similarity": "0.37013063",
            "sentiment_compound": -0.296
        },
        {
            "id": "hh6ad2y",
            "score": 1,
            "text": "Humanizing billionaires makes people less likely to want to steal from them.  more at 11",
            "title_similarity": "0.81248164",
            "sentiment_compound": -0.4877
        },
        {
            "id": "hh6aedf",
            "score": 1,
            "text": "Seriously... are so many of the middle class people this dumb..?",
            "title_similarity": "0.508386",
            "sentiment_compound": -0.6783
        },
        {
            "id": "hh6aio9",
            "score": 1,
            "text": "Another study from The Institute of Stating the Obvious, they're really working overtime these days.",
            "title_similarity": "0.33864594",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6aiqr",
            "score": 1,
            "text": "but it's the politicians who vote on tax laws. why is it on the regular folk to fix the issues we elect people to fix? this has the same energy as when companies say to stop using plastic straws",
            "title_similarity": "0.6904408",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hh6an0b",
            "score": 1,
            "text": "It's like how people worship elon or trump.",
            "title_similarity": "0.33424333",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hh6ao2a",
            "score": 1,
            "text": "So many fuckin’ losers.",
            "title_similarity": "0.32765967",
            "sentiment_compound": -0.5667
        },
        {
            "id": "hh6aobd",
            "score": 1,
            "text": "I guess I’m not American. Omg, Who am I.",
            "title_similarity": "0.1986515",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6aolf",
            "score": 1,
            "text": "Social media is weird.  It basically breaks our brain.",
            "title_similarity": "0.49733853",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hh6at4j",
            "score": 1,
            "text": "That’s because we are morons apparently",
            "title_similarity": "0.32471395",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hh6awif",
            "score": 1,
            "text": "There are a couple multi-billionaires I don’t hate, but I’d tax some humility/charity/government-mandated-philanthropy/whatever in all of them at the drop of a hat.",
            "title_similarity": "0.712044",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hh6b2sm",
            "score": 1,
            "text": "They are brain washed by the media and we all know who owns the media.. Some billionaire guys. \n\nWe see it from the outside. They don't because they were born in to the system.  It's sad.",
            "title_similarity": "0.66081554",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hh6b8xx",
            "score": 1,
            "text": "And this is not an accident.",
            "title_similarity": "-0.020864083",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hh6bcj9",
            "score": 1,
            "text": "I wonder what billionaire funded this study",
            "title_similarity": "0.5751138",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6beti",
            "score": 1,
            "text": "Why aren't redditors eating them yet? I haven't even seen a single guillotine on wall st or in DC.",
            "title_similarity": "0.2657454",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6bgkq",
            "score": 1,
            "text": "Americans knowledge of the wastefulness of bureaucrats and the black hole that is government spending has them hesitant to raise taxes on anyone and further feed the beast that needs to be constrained and not allowed to grow larger.",
            "title_similarity": "0.73932946",
            "sentiment_compound": -0.34
        },
        {
            "id": "hh6bk2m",
            "score": 1,
            "text": "As an American, if your endeavors net you a billion dollars to spend how you please, I don’t think you need anymore. If you do, you’re a part of the problems that promote so much greed.",
            "title_similarity": "0.7969857",
            "sentiment_compound": -0.197
        },
        {
            "id": "hh6bl6d",
            "score": 1,
            "text": "People hate Congress, but love their Congressman.\n\nPeople tend to respond differently if they can relate to a person, even in the abstract. That's harder to do with groups in general. \n\nThis isn't special, nor does it show the \"problem\" with support or lack therof for wealth taxes",
            "title_similarity": "0.8013841",
            "sentiment_compound": 0.6011
        },
        {
            "id": "hh6blbu",
            "score": 1,
            "text": "morons. elon suckling morons",
            "title_similarity": "0.3015892",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hh6blku",
            "score": 1,
            "text": "It should come as no surprise that someone would feel less inclined to negatively impact someone else that they idolize based on nothing other than the fact that they like said individual, even if it would be fair and proper to do.\n\nIt's kind of how we elect politicians these days - supporters want nothing but immunity and detractors want nothing but punishment.\n\nWhat this study says to me is humans are still human.",
            "title_similarity": "0.65538985",
            "sentiment_compound": 0.7897
        },
        {
            "id": "hh6bmdi",
            "score": 1,
            "text": "Good lord. The ROI on social media posting is insane.",
            "title_similarity": "0.45506722",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hh6bmhd",
            "score": 1,
            "text": "This study is not the first show how easily manipulated the human mind can be. I feel this has driven the psychological manipulation of mass media since the 50s. The wealthy have long used media indoctrination to shape the opinions of the masses. Free your mind and your ass will follow.",
            "title_similarity": "0.70788306",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hh6bn5e",
            "score": 1,
            "text": "Yes, Americans are gullible.",
            "title_similarity": "0.34077743",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hh6bt2h",
            "score": 1,
            "text": "\n \"Research has shown that countries with greater economic inequality tend to have higher homicide rates, greater infant mortality, lower well-being and lower commitment to democratic institutions.\"",
            "title_similarity": "0.75147945",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hh6bv3n",
            "score": 1,
            "text": "I don’t know anyone that loves a billionaire",
            "title_similarity": "0.43415827",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hh6c2vl",
            "score": 1,
            "text": "This is why all the hero worship of Musk strikes me as so bizarre.",
            "title_similarity": "0.45002308",
            "sentiment_compound": 0.0795
        },
        {
            "id": "hh6c31u",
            "score": 1,
            "text": "But... even if they pay more taxes, they will still be billionaires. They will still have about a million times more money than a person would need to retire with no wants until the end of his days.",
            "title_similarity": "0.6655072",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hh6c3ci",
            "score": 1,
            "text": "The great sage said it best. Half of all people are below average intelligence",
            "title_similarity": "0.46759194",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hh6c7cd",
            "score": 1,
            "text": "As a socialist American who hates billionaires, this does make sense.",
            "title_similarity": "0.7188331",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hh6cawb",
            "score": 1,
            "text": "I definitely don’t love any billionaires and I’m fine with taxing them correctly",
            "title_similarity": "0.5319087",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hh6cf5m",
            "score": 1,
            "text": "Oh man Americans... I can't believe it.",
            "title_similarity": "0.32062566",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6chmr",
            "score": 1,
            "text": "The effects of The Fabulous Life of the Rich and Famous on early 2000's VH1",
            "title_similarity": "0.38555905",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hh6cufe",
            "score": 1,
            "text": "It makes sense since America never had a working-class, proletariat revolution and has always been a place where wealthy aristocrats have reigned supreme.",
            "title_similarity": "0.5032177",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hh6d2jr",
            "score": 1,
            "text": "Wealth taxes will never work. For example, let us say that the CEO of Lockheed Martin has to submit to a wealth tax, which causes him to dump shares, which state based actors like Russia and China can buy with nearly infinite money. This would lead to major national defense issues.",
            "title_similarity": "0.7705364",
            "sentiment_compound": 0.8511
        },
        {
            "id": "hh6d9x0",
            "score": 1,
            "text": "The politicians aren’t ever going to tax the rich because the leadership are some of the richest people in the country.",
            "title_similarity": "0.7351804",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hh6dbx5",
            "score": 1,
            "text": "Okay fellow Americans…who is your favorite billionaire that you apparently love?",
            "title_similarity": "0.61637455",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hh6ddzb",
            "score": 1,
            "text": "X Bias leads to Y Behavior, news at eleven.",
            "title_similarity": "0.3796637",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hh6dgst",
            "score": 1,
            "text": "Just when I think we can’t get any dumber, we do!",
            "title_similarity": "0.26836222",
            "sentiment_compound": -0.4199
        },
        {
            "id": "hh6dhr8",
            "score": 1,
            "text": "Everyone pay their fair share!",
            "title_similarity": "0.1883487",
            "sentiment_compound": 0.5255
        },
        {
            "id": "hh6dnwo",
            "score": 1,
            "text": "Excellence should never be penalized.",
            "title_similarity": "0.27274567",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hh6dq6y",
            "score": 1,
            "text": "Elon could come out tomorrow and be like \"yeah dude we should be worth like 5 trillion\" and the market would quickly adjust them to a 2 trillion market cap",
            "title_similarity": "0.5319015",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hh6dz6g",
            "score": 1,
            "text": "If you steal all the money from all the billionaires right now, you might get one years worth of GDP. It's called limit spending. I know, it's difficult to understand, but it needs to be done.",
            "title_similarity": "0.72157454",
            "sentiment_compound": -0.34
        },
        {
            "id": "hh6e5l5",
            "score": 1,
            "text": "What a weird way to blame the individual for such a large systemic issue...",
            "title_similarity": "0.49422294",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hh6eb47",
            "score": 1,
            "text": "Sounds like something a billionaire would have published. Very fishy....",
            "title_similarity": "0.5204096",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh6ebaz",
            "score": 1,
            "text": "Whenever i talk about taxes my friends complain about taxing their hard earn money. Im like....i know your salaries this is why the super wealthy barely pay taxes. Everyone so worried they are in the 1%. Its scary",
            "title_similarity": "0.76921374",
            "sentiment_compound": 0.1095
        },
        {
            "id": "hh6efux",
            "score": 1,
            "text": "Because Americans  are the only people daft enough to firmly believe that one day soon they will be the next billionaire...... source: american",
            "title_similarity": "0.60268635",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6egcw",
            "score": 1,
            "text": "Oh, you mean those weren't fluff pieces of the \"philanthropist, everyman, Playboy, genius\"?!",
            "title_similarity": "0.46494472",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6ei7s",
            "score": 1,
            "text": "~~I think I remember either Ryan Grimm or some Journalist or analyst say that most Americans tend to view themselves as temporary embarrassed future millionaires or billionaires~~\n\nUpdate: I was way off\n\n\"John Steinbeck once said that socialism never took root in America because the poor see themselves not as an exploited proletariat but as temporarily embarrassed millionaires\"\n\nIt doesn't need to be socialism. Even something as sensible as social democracy with a strengthen welfare system often won't pass cause people don't want to pay too many taxes when they reach millionaire tax bracket or even $500k tax bracket. That's unfortunately the mentality here in the US",
            "title_similarity": "0.8348946",
            "sentiment_compound": -0.6368
        },
        {
            "id": "hh6ekpk",
            "score": 1,
            "text": "Every looser thinks they will become one. And they don't want to be taxed.",
            "title_similarity": "0.4637699",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hh6exsj",
            "score": 1,
            "text": "Last time I checked everyone hates them",
            "title_similarity": "0.349437",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hh6eyee",
            "score": 1,
            "text": "I think its more of thinking the individual worked to that point vs the group pulling each other to that point.\nI can recognize the fact that bezos built an empire and still detest his business practices, but recognize he made his own wealth",
            "title_similarity": "0.7285154",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hh6f1z3",
            "score": 1,
            "text": "Caucasians love for individual Billionaires...fixed??",
            "title_similarity": "0.5577923",
            "sentiment_compound": 0.6767
        },
        {
            "id": "hh6f236",
            "score": 1,
            "text": "They’re already taxed more than anybody else.",
            "title_similarity": "0.36205664",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6f8lt",
            "score": 1,
            "text": "American non-billionaires are all paying more taxes now. It’s called “inflation” and was created by the Fed.",
            "title_similarity": "0.7075585",
            "sentiment_compound": 0.25
        },
        {
            "id": "hh6fa0l",
            "score": 1,
            "text": "I would love to be a billionaire. I want to pay as little in taxes as I can, because the money I earn should be in my pocket, and not in the hands of a government that doesn’t care about any of us except their own special interest.",
            "title_similarity": "0.70024145",
            "sentiment_compound": 0.9186
        },
        {
            "id": "hh6fabf",
            "score": 1,
            "text": "These people should not be idolized. Tax them their rightful amount and you would see major changes as long as all the corrupt politicians don’t get take a slice of the pie for themselves.",
            "title_similarity": "0.7391668",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6fbfi",
            "score": 1,
            "text": "The BS that passes for science these days I’ll never understand.",
            "title_similarity": "0.3533877",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6fbnb",
            "score": 1,
            "text": "Cuz they really think they could be billionaires one day if \"tHeY wOrK hArD\"... they really have dreaming this fantasy since the day theyre born...",
            "title_similarity": "0.48857075",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hh6fdda",
            "score": 1,
            "text": "How would “wealth tax” work anyway? Has it been tried anywhere successfully?",
            "title_similarity": "0.4913633",
            "sentiment_compound": 0.5514
        },
        {
            "id": "hh6fho9",
            "score": 1,
            "text": "Who loves billionaires? I hate millionaires and am jealous of thousandaires",
            "title_similarity": "0.7429784",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hh6g54b",
            "score": 1,
            "text": "Americans americaning hard",
            "title_similarity": "0.38192376",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hh6g6ji",
            "score": 1,
            "text": "Americans intelligence has been on a decline for years, and billionaires know this. Reality stars know it. Politicians know it too. I'm afraid Democracy will know it soon also.",
            "title_similarity": "0.71052015",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hh6gdhb",
            "score": 1,
            "text": "Which is why I make it a point to hate each and every one of them for a specific reason rather than grouping them together.",
            "title_similarity": "0.4542981",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hh6gf3w",
            "score": 1,
            "text": "Who the f is out there loving billionaires?",
            "title_similarity": "0.58017707",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hh6ggn3",
            "score": 1,
            "text": "Lovable billionaires. Snort",
            "title_similarity": "0.39900714",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hh6gkfn",
            "score": 1,
            "text": "Where do they come up with this I can name very few people who have any love for these dragons of our age.",
            "title_similarity": "0.40045822",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh6gx7e",
            "score": 1,
            "text": "As an American I can say I'll gladly build a guillotine out of a rusty car door and some barn lumber for them to use anytime we can get our hands on them out here in the country.",
            "title_similarity": "0.38021898",
            "sentiment_compound": 0.34
        },
        {
            "id": "hh6h5k6",
            "score": 1,
            "text": "Come on now. Don’t be that guy or gal.",
            "title_similarity": "0.20080544",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6hd4t",
            "score": 1,
            "text": "I have love for some in the billionaire class and I am not opposed to the wealth tax per se, but I do have concerns about the implications of a poorly executed policy and do not actually see how one can do so without triggering capital flight.\n\nHow does one tax ones wealth if it is in the stock market? What about crypto?\n\nIf one forces the billionaire to liquidate assets according to “on paper earnings”, the sell off will impact the price of the stocks or crypto they are selling and would likely reduce their tax load by reducing their wealth.\n\nIf the tax is done on an arbitrary day based on an arbitrary metric, then why that particular point of time or that particular metric?\n\nPerhaps I am ignorant, but I don’t see very much evidence that a wealth tax would actually work in practice when every place that has implemented one ended up stopping it. (this could be my ignorance)",
            "title_similarity": "0.8745557",
            "sentiment_compound": 0.9245
        },
        {
            "id": "hh6hqur",
            "score": 1,
            "text": "I'm pretty libertarian, lean to the right a little come election time. \n\nI don't think it is moral to take more from a rich person because they have \"enough.\" It isn't the governments place to decide that. \n\nThe rich already pay most taxes, plus manage the vehicle by which most other labor generated tax revenue is gathered. The idea of a hundred-thousandaire, millionaire, or billionaire does not change when wealth is scaled upwards. It you earned it, you earned it. \n\nThe government doesn't have a right to 50% to 80% of revenue over a certain dollar amount just because it is deemed excessive. That is stealing and immoral if the wealth was legally gained.",
            "title_similarity": "0.7939052",
            "sentiment_compound": 0.8789
        },
        {
            "id": "hh6htlk",
            "score": 1,
            "text": "PsYcoLoGY! \n\n~another busted study funded and skewed by bleached buttholes",
            "title_similarity": "0.5609091",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6i2kn",
            "score": 1,
            "text": "This is absolutely leaving out factors. People on the right tend to be older and don’t idolize celebrities. Meanwhile a young post-modernist now has what a 75% chance of liking the kardashians?\n\nDemocrats have way more celebrity endorsement; nearly all of Hollywood is on the left, same goes for the music industry. I legitimately don’t understand how many republicans are loving celebrities or mentioning billionaires out of respect? Seems skewed considering the left constantly uses celebrity endorsement and has shown much more admiration for them",
            "title_similarity": "0.75865227",
            "sentiment_compound": 0.9624
        },
        {
            "id": "hh6i853",
            "score": 1,
            "text": "What taxes on the super rich?  Was there a vote? Try us - We'll def support it!",
            "title_similarity": "0.7112501",
            "sentiment_compound": 0.8968
        },
        {
            "id": "hh6i8co",
            "score": 1,
            "text": "Everytime we get rid of royalty, we allow it back with new names. Billionaires, companies, senators, presidents, stars... We need true equality, no more excuses.",
            "title_similarity": "0.52337503",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh6i9x9",
            "score": 1,
            "text": "Perhaps some Americans realize that even if the government siezed all the wealth of all the billionaires, it wouldn't even fund the federal government for a year.\n\nAnd in doing that, the government would essentially nationalize the entire economy by taking 51% of all the major corporations stock.\n\nPerhaps the solution is to reduce government spending instead.",
            "title_similarity": "0.76672643",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hh6iabq",
            "score": 1,
            "text": "Americans are apparently stupid…",
            "title_similarity": "0.46922925",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6icut",
            "score": 1,
            "text": "Wouldn’t it also be possible that they are against inequality, but since they like at least one billionaire they may just believe that the person they like will use the potential tax money more wisely than the federal government would?",
            "title_similarity": "0.8474629",
            "sentiment_compound": 0.8919
        },
        {
            "id": "hh6id5n",
            "score": 1,
            "text": "Americans are the most cucked people on the planet and it’s not even close",
            "title_similarity": "0.5503764",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6if7h",
            "score": 1,
            "text": "I like my billionaire because he's using the money on wrestling. It's really good wrestling. Much better than the other billionaire's sports entertainment.",
            "title_similarity": "0.6559011",
            "sentiment_compound": 0.8858
        },
        {
            "id": "hh6ihwy",
            "score": 1,
            "text": "There should be a big public hearing with all of the 100 wealthiest people being allowed to go on public record saying what they think they should be taxed. And boom, do the transaction right there. Whatever that figure is, it is going to be more than what the government is able to get out of them currently.",
            "title_similarity": "0.5869867",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hh6imb9",
            "score": 1,
            "text": "So basically, if they help out the lower class we hate them less and want less from them? Who coulda thought",
            "title_similarity": "0.6816149",
            "sentiment_compound": -0.4902
        },
        {
            "id": "hh6ipmu",
            "score": 1,
            "text": "It depends on what you are going to do with the tax money.\n\nIf you are just going to take that money from one person, and give it to another person based solely on the fact that they have more children than you do, then screw your tax increase.\n\nIf you are going to give that money to people so that they'll have just enough money to get by living in the bus stop shelter on my nearest corner, then screw your tax increase.",
            "title_similarity": "0.7302216",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hh6it56",
            "score": 1,
            "text": "I'm struggling to think of any billionaire that is lovable to a complete stranger. Such an odd premise.",
            "title_similarity": "0.5560714",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hh6iw2d",
            "score": 1,
            "text": "\"that could be me someday\"\n\n\n*Gives fry basket a nice hard shake*",
            "title_similarity": "0.23543091",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hh6iwe3",
            "score": 1,
            "text": "It's why they pay millions to have positive media coverage. And they get very positive media coverage.",
            "title_similarity": "0.45129353",
            "sentiment_compound": 0.796
        },
        {
            "id": "hh6j2fw",
            "score": 1,
            "text": "I guy that went to my same high school is now a billionaire.",
            "title_similarity": "0.41789243",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6jaqq",
            "score": 1,
            "text": "The only Internet personality I like is that xiaoman dude who can learn a language in 2 weeks and then go speak it to people in neighborhoods in NYC.",
            "title_similarity": "0.40765297",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh6jdhi",
            "score": 1,
            "text": "Fix education and this will be gone.",
            "title_similarity": "0.26347095",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6jfxm",
            "score": 1,
            "text": "People love billionaires????",
            "title_similarity": "0.5739801",
            "sentiment_compound": 0.7319
        },
        {
            "id": "hh6jnlz",
            "score": 1,
            "text": "Who are the idiots who ‘love’ billionaires?!",
            "title_similarity": "0.67683434",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6jq27",
            "score": 1,
            "text": "Oprah is a billionaire?",
            "title_similarity": "0.4893339",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6jzbl",
            "score": 1,
            "text": "Imagine using the science of advertising to improve society instead of manipulating the public into accepting a few people hoarding wealth as a good thing",
            "title_similarity": "0.75705445",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hh6k93b",
            "score": 1,
            "text": "What’s the quote, “In America there are no poor persons, just disenfranchised millionaires.”?",
            "title_similarity": "0.65881133",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hh6kmuq",
            "score": 1,
            "text": "The opinions on like twelve people affect people's views on doing things directly targeting the same 12 people.\n\nLike, more taxes means more taxes as an idea.\n\nTax the ultra wealthy has a lost of names attached to it that's more than short enough to have opinions of every single person on it.\n\nSaying \"properly reduce student loans to something acceptable\" is a general statement you evaluate as a statement.\n\nSaying \"reduce student loans\" followed by twelve names of people you know.  That will be greatly affected by what you think of those people.  Even if those same people are included in the first statement they are insignificant to the issue of millions.",
            "title_similarity": "0.7836696",
            "sentiment_compound": 0.4951
        },
        {
            "id": "hh6knzd",
            "score": 3,
            "text": "Americans is too broad. I would bet the majority does not support the wealthy. It’s the loudest few that do though and that is the real problem.",
            "title_similarity": "0.7417094",
            "sentiment_compound": -0.7243
        },
        {
            "id": "hh6kvdq",
            "score": 1,
            "text": "Put them up against the wall.",
            "title_similarity": "-0.03214161",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6ldbz",
            "score": 1,
            "text": "its the politicians that are in love with the billionaires and hundred-millionaires making it impossible to tax the wealthy and rich.",
            "title_similarity": "0.7586146",
            "sentiment_compound": 0.8834
        },
        {
            "id": "hh6lhl4",
            "score": 1,
            "text": "Absolutely disgusting this is how people think.\n  \nIt is the modern day 'royalty', the royals were the rulers who reigned over the commoners and stole their wealth.  The reason almost everyone of those people are billionaires is they screwed over everyone else.  IF they didn't they were part of the system that screws over every person under them and benefit from it.\n  \nThe billionaires won, with their BS philanthropy and crap like the Bill and Melinda gates \"wealth pledge\" to give away most of their wealth, which can be **after they die and to their own charity** to make sure their name is lauded as 'one of the good ones'.",
            "title_similarity": "0.7496994",
            "sentiment_compound": 0.8927
        },
        {
            "id": "hh6lll0",
            "score": 1,
            "text": "I keep what I earn. You keep what you earn. That’s how it should be.",
            "title_similarity": "0.13241582",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6lm64",
            "score": 1,
            "text": "It's the ultimate in aspirational capitalism: *by worshipping the ultra-wealthy, perhaps I too shall ascend to their ranks*.  People are already larping as what they think billionaires live like, mainly using credit and social media.  The next step is straight-up worship.",
            "title_similarity": "0.6868919",
            "sentiment_compound": 0.836
        },
        {
            "id": "hh6lojg",
            "score": 1,
            "text": "People were CELEBRATING people becoming billionaires. Like it was from hard work and not just numbers being made to favor them at the end.",
            "title_similarity": "0.6139053",
            "sentiment_compound": 0.8494
        },
        {
            "id": "hh6lrzn",
            "score": 1,
            "text": "**I think all billionaires are scum.** The only way to possibly convince me otherwise is to make me a billionaire. Any takers?",
            "title_similarity": "0.6702236",
            "sentiment_compound": 0.25
        },
        {
            "id": "hh6lx4j",
            "score": 1,
            "text": "And that is exactly why musk and bezos have such a huge PR team.",
            "title_similarity": "0.3339408",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hh6m1kq",
            "score": 1,
            "text": "As if taxation is properly manged at all, the money is wasted on warfare and weaponry. Whenever you see a tax hike, It almost sounds like a preparation for war. Why do you even need that much, when you can manage the money you get now?",
            "title_similarity": "0.7130673",
            "sentiment_compound": -0.8393
        },
        {
            "id": "hh6m3g9",
            "score": 1,
            "text": "I ain't got no love for none them!",
            "title_similarity": "0.14185655",
            "sentiment_compound": 0.4668
        },
        {
            "id": "hh6m4ga",
            "score": 1,
            "text": "Ronald Wright: \"John Steinbeck once said that socialism never took root in America because the poor see themselves not as an exploited proletariat but as temporarily embarrassed millionaires.\"",
            "title_similarity": "0.7680879",
            "sentiment_compound": -0.5514
        },
        {
            "id": "hh6m75k",
            "score": 1,
            "text": "Buying the vote - pyschologically",
            "title_similarity": "0.42391258",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6mite",
            "score": 1,
            "text": "Could it be fantasies of [Daddy Warbucks](https://en.wikipedia.org/wiki/Daddy_Warbucks)?",
            "title_similarity": "0.3888266",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6mobo",
            "score": 1,
            "text": "You say Americans but I really think you just mean Conservatives.",
            "title_similarity": "0.54438585",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6mt79",
            "score": 1,
            "text": "Appreciating success I guess.",
            "title_similarity": "0.1944619",
            "sentiment_compound": 0.765
        },
        {
            "id": "hh6mth6",
            "score": 1,
            "text": "What an utter load of complete crap.",
            "title_similarity": "0.15611072",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hh6mtux",
            "score": 1,
            "text": "The super rich make me disgusted. Disgusted that people should have that amount of money, people getting paid millions of dollars to act or play a sport. While the rest of us struggle, and actually make a difference .",
            "title_similarity": "0.75573075",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hh6mtw9",
            "score": 1,
            "text": "It will likely be a nightmare to find",
            "title_similarity": "0.2868563",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6muxn",
            "score": 1,
            "text": "That Mukesh Ambani. So smart, and that dreamy smile……",
            "title_similarity": "0.17721014",
            "sentiment_compound": 0.541
        },
        {
            "id": "hh6mvi6",
            "score": 1,
            "text": "No love lost here, pay your fair share buddy!",
            "title_similarity": "0.3103538",
            "sentiment_compound": 0.2467
        },
        {
            "id": "hh6mxcj",
            "score": 1,
            "text": "I think it’s because we can’t conceive of having enough money that it’s OK if we had to give some of it up.",
            "title_similarity": "0.57573277",
            "sentiment_compound": 0.4466
        },
        {
            "id": "hh6n30u",
            "score": 1,
            "text": "I think people who want to tax wealth don’t fully understand what that means. You can’t tax someone’s hundreds of millions or billions of dollars if that money is tied into stock or assets that they haven’t sold off yet. Meaning the gains haven’t been realized into an income. Musk might be worth $180 billion dollars but that’s only because of his ownership of Tesla and how much Tesla has grown. If we taxed that then he would have to sell stock in the company to pay the taxes and thus lose ownership of the company he created. If you want a wealth tax then you are for forcing people to give away what is theirs",
            "title_similarity": "0.8070097",
            "sentiment_compound": 0.7814
        },
        {
            "id": "hh6n6aq",
            "score": 1,
            "text": "Maybe it’s because politicians say they’re going to tax the rich, but tax the poor instead every single time. \n\nJust passed a law to track any 600$ transfer in your accounts to tax the poor. \n\nSo much for helping the poor eh?",
            "title_similarity": "0.7639221",
            "sentiment_compound": -0.8383
        },
        {
            "id": "hh6nb75",
            "score": 1,
            "text": "Taxing the rich more won’t change my life as much as the rich paying me more would. Government will just wasteful spend it. In fact I’d bet my life would be exactly the same as it is now.",
            "title_similarity": "0.8064685",
            "sentiment_compound": 0.802
        },
        {
            "id": "hh6ngoe",
            "score": 1,
            "text": "Does it annoy anyone else when broad claims are made about their country, when it doesn't really speak for the entirety of a country?",
            "title_similarity": "0.5519877",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hh6nl74",
            "score": 1,
            "text": "Who fuckin’ loves billionaires?",
            "title_similarity": "0.5993995",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hh6nqax",
            "score": 1,
            "text": "Who the hell is fangirling over billionaires…",
            "title_similarity": "0.5614296",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hh6nqoc",
            "score": 1,
            "text": "Who the hell is fangirling over billionaires…",
            "title_similarity": "0.5614296",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hh6nslw",
            "score": 1,
            "text": "“Why would I want to tax the billionaires when I might end up being one myself?” Checks bank account… “$5000 so far… just $999,995,000.00 left to go.”",
            "title_similarity": "0.66672623",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hh6nuhc",
            "score": 1,
            "text": "Which is why a majority donate to charities, aside from the massive tax break, it's good PR.",
            "title_similarity": "0.5651419",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hh6nwtn",
            "score": 1,
            "text": "People love billionaires? Social media has really changed the perception of gaudy to one of positive connotation. Earned or not, billionaires don’t exist without a society to allow their success and an investment back into that society shouldn’t require convincing of those that would benefit most. Yet here we are.",
            "title_similarity": "0.7371273",
            "sentiment_compound": 0.959
        },
        {
            "id": "hh6nz8d",
            "score": 1,
            "text": "Tax them? No, I want to eat them.",
            "title_similarity": "0.36912197",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hh6o554",
            "score": 1,
            "text": "But I idealize Kim, Elon, and Bozos! Also Joe Esteves, stock genius!",
            "title_similarity": "0.43659553",
            "sentiment_compound": 0.5242
        },
        {
            "id": "hh6oeku",
            "score": 1,
            "text": "This should be under r/facelpalm.",
            "title_similarity": "0.02391214",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6ok10",
            "score": 1,
            "text": "Love me some Papa Musk, haha.",
            "title_similarity": "0.2882098",
            "sentiment_compound": 0.802
        },
        {
            "id": "hh6omfv",
            "score": 1,
            "text": "I just don't feel one person should be able to vote on taxing another person. Worry about yourself. That person you think is too rich is paying a lot more taxes than you are.",
            "title_similarity": "0.793748",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hh6ooht",
            "score": 1,
            "text": "You forgot to add ignorant before Americans",
            "title_similarity": "0.42603576",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hh6p3dt",
            "score": 1,
            "text": "Temporary embarrassed millionaires",
            "title_similarity": "0.6170646",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hh6p7zt",
            "score": 1,
            "text": "Who the hell loves billionaires?",
            "title_similarity": "0.566694",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hh6p86v",
            "score": 1,
            "text": "Who funded this bias study? Dr. Evil and Zuckerfuck?",
            "title_similarity": "0.5495716",
            "sentiment_compound": -0.7399
        },
        {
            "id": "hh6pajx",
            "score": 1,
            "text": "I mean I like a lot of stuff that Bill Gates does, but I don’t love the guy. I don’t even know him.",
            "title_similarity": "0.6089755",
            "sentiment_compound": 0.8201
        },
        {
            "id": "hh6pb0j",
            "score": 1,
            "text": "For me, it's the reality that the wealthy are using existing tax laws in reducing their tax income.\n\nThe\"Billionaire Club\" hires wealth managers and lobby's for tax law that benefits them.\n\nWhen politicians (and their sheep) yell continuesly about \"Tax the Rich\", I know in the end that this will ultimately fall on the upper middle class and middle class.",
            "title_similarity": "0.8468398",
            "sentiment_compound": 0.8979
        },
        {
            "id": "hh6pc6l",
            "score": 1,
            "text": "But but but Elon post memes like me!",
            "title_similarity": "0.2242572",
            "sentiment_compound": 0.5487
        },
        {
            "id": "hh6pffp",
            "score": 1,
            "text": "How about those of us who don’t support wealth taxes on the super rich because it’s a really stupid idea that has failed numerous times before now? \n\nAs opposed to ad hominem attacks implying that those of us who oppose high taxes on the rich are stupid, as r/science would seem to suggest.",
            "title_similarity": "0.830637",
            "sentiment_compound": 0.5729
        },
        {
            "id": "hh6pg6h",
            "score": 1,
            "text": "I love billionaires! They support trickle down economics so I know they will help poor people like me. It’s just a matter of time before they start handing their wealth down to the poor. I can’t wait! Billionaire lives matter!!",
            "title_similarity": "0.7361046",
            "sentiment_compound": 0.8877
        },
        {
            "id": "hh6pgbb",
            "score": 1,
            "text": "It's definitely not love for billionaires. It's that most poor and middle class individuals are taught they can too achieve the same level of success. So why impose wealth tax on your future self.",
            "title_similarity": "0.7929258",
            "sentiment_compound": 0.1592
        },
        {
            "id": "hh6ph73",
            "score": 1,
            "text": "As an American, screw billionaires.",
            "title_similarity": "0.55081743",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hh6pn99",
            "score": 1,
            "text": "We’re not far from the Altered Carbon reality where they literally had people who worshipped the rich as if they were gods",
            "title_similarity": "0.5909091",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hh6posa",
            "score": 1,
            "text": "I know for a fact I don't love (or hate) any stranger. Really, I don't get how anyone could have such strong emotions for total strangers. I don't have those sort of feelings for the vast majority people I actually know. Only the really close ones get love, and I don't hate anyone at all so far. Hate is a wasteful and self-harming feeling imo and should be reserved for monsters, such as malicious killers, rapist and such that have personally harmed you or yours. Again, imo.  \n\n\nAnyways, I don't think the super rich should have to pay \"wealth taxes\". If the wealthy use the legal system to their advantage, good for them. It's really none of my business and wealth isn't finite so nothing is being taken from me.  \n\n\nThat said, I think government and wealthy people/corps should be separated. People in government should be forced to live on their salary, which should be a \"living wage\". They and their spouses, should they have one, shouldn't be aloud to profit from that work even after they retire, leave. ect as well. No big money campaigns, no billionaire/corporate support/lobbying, ect. In short, regular people should govern. No wealth in government.",
            "title_similarity": "0.6353173",
            "sentiment_compound": 0.6093
        },
        {
            "id": "hh6ppox",
            "score": 1,
            "text": "What. This is ridiculous! Tax the rich! Bad article!",
            "title_similarity": "0.67012167",
            "sentiment_compound": -0.5067
        },
        {
            "id": "hh6q63f",
            "score": 1,
            "text": "Idol worship to this level is very detrimental to society. G'damn..   \nI don't think anyone should \"love\" someone who is basically a complete stranger and completely unaware of their existence.",
            "title_similarity": "0.5527143",
            "sentiment_compound": 0.6494
        },
        {
            "id": "hh6qj34",
            "score": 1,
            "text": "That’s totally fucked up",
            "title_similarity": "0.1397606",
            "sentiment_compound": -0.6901
        },
        {
            "id": "hh6qlry",
            "score": 1,
            "text": "I don't love any billionaires or trillionairs. I don't know any. Why would I love people who have more money and probably either inherited it or took advantage of others to get it.",
            "title_similarity": "0.7422193",
            "sentiment_compound": 0.4276
        },
        {
            "id": "hh6qryy",
            "score": 1,
            "text": "I’m supposed to love the billionaires? Oops.",
            "title_similarity": "0.56601393",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh6qvej",
            "score": 1,
            "text": "It's the cult of money.",
            "title_similarity": "0.40487838",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6r0wc",
            "score": 1,
            "text": "\"Socialism never took root in America because the poor see themselves not as an exploited proletariat, but as temporarily embarrassed millionaires.\" — John Steinbeck\n\nBut make no mistake: Millennials and Gen Z are big into socialism, and we're coming for your toothbrush. All of us. For ~~your~~ *our* toothbrush.",
            "title_similarity": "0.6880635",
            "sentiment_compound": -0.2514
        },
        {
            "id": "hh6rdx7",
            "score": 1,
            "text": "They ain’t askin the right people.",
            "title_similarity": "0.2668899",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6sxhw",
            "score": 1,
            "text": "What billionaire affected the study? Because they are not asking the right people if that’s what they came up with with",
            "title_similarity": "0.7005384",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hh6t4rl",
            "score": 1,
            "text": "If a billionaire isn't strategically investing in human-centric ventures to both preserve and allow that level of wealth to benefit the society that forged it from the blood, sweat, and anxiety of its workers, the person shouldn't be a billionaire. \n\nWealth is synonymous with power, and there's no reason selfish / clannish / tribal billionaires should exist. Ever.",
            "title_similarity": "0.77624404",
            "sentiment_compound": 0.8736
        },
        {
            "id": "hh6tcsl",
            "score": 1,
            "text": "I hate them all, and won't be satisfied until their net worth is dropped below 1B.",
            "title_similarity": "0.55606675",
            "sentiment_compound": -0.6288
        },
        {
            "id": "hh6tddi",
            "score": 1,
            "text": "Elon stans TERRIFY me",
            "title_similarity": "0.25612533",
            "sentiment_compound": -0.6166
        },
        {
            "id": "hh6tqlk",
            "score": 1,
            "text": "I dont want to be American anymore",
            "title_similarity": "0.39358467",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hh6ttpf",
            "score": 1,
            "text": "Experts say and a new study finds ...",
            "title_similarity": "0.24643955",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6u3sl",
            "score": 1,
            "text": "Wait until he finds out the maintenance costs PepeLaugh",
            "title_similarity": "0.27537555",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6u9wz",
            "score": 1,
            "text": "Serfs typically love their king",
            "title_similarity": "0.47507983",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh6uck9",
            "score": 1,
            "text": "There are lovable billionaires?",
            "title_similarity": "0.46379608",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hh6uek7",
            "score": 1,
            "text": "If only they knew what billionaires think of them…",
            "title_similarity": "0.64758193",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6uh8x",
            "score": 1,
            "text": "Why is it considered greedy to want to keep the money you earned but not greedy to want to take other peoples money?",
            "title_similarity": "0.6862514",
            "sentiment_compound": 0.1556
        },
        {
            "id": "hh6ujut",
            "score": 1,
            "text": "I've never met anyone irl that loves billionaires. Maybe it's something more common away from where I live.",
            "title_similarity": "0.50569624",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hh6ujxe",
            "score": 1,
            "text": "Idk these americans even exist don't get me wrong if your self made i can respect that but love is a different thing.  \n\n\n\nBut i guess i can love elon as long as my calls fly my to the moon.",
            "title_similarity": "0.5105468",
            "sentiment_compound": 0.9453
        },
        {
            "id": "hh6uk1o",
            "score": 1,
            "text": "Once you have acquired more wealth than hour grandchildren can spend in a lifetime, you should be gorged to retire. \n\n\\#restorebalance",
            "title_similarity": "0.61852396",
            "sentiment_compound": 0.5413
        },
        {
            "id": "hh6um1f",
            "score": 1,
            "text": "This is Reddit. Anyone that makes over $20/hr is hated.",
            "title_similarity": "0.6216616",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hh6ut0q",
            "score": 1,
            "text": "…which is why billionaires hire PR firm to shape their image.",
            "title_similarity": "0.58688825",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6utcl",
            "score": 1,
            "text": "The only billionaires I love already support wealth taxes.",
            "title_similarity": "0.6373731",
            "sentiment_compound": 0.8779
        },
        {
            "id": "hh6vfkt",
            "score": 1,
            "text": "New study shows, people ate stupid.",
            "title_similarity": "0.46394658",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hh6vq52",
            "score": 1,
            "text": "Maybe the government wouldn't need a wealth tax if it had respect for us in the first place. There should be jail time for stealing from the citizenry and giving contracts to friends.",
            "title_similarity": "0.7261305",
            "sentiment_compound": 0.312
        },
        {
            "id": "hh6vrh1",
            "score": 1,
            "text": "As an American living around other Americans, I can assure you that this is in fact true. It doesn't help that most people here think we live in some perfect meritocracy. \"He started with nothing, and look at him now!\", \"He worked hard for all that money.\" Yet in reality, they might have worked long hours, but at the scale of wealth these billionaires live in, they didn't work 300x harder than the average worker did they? It's very understandable that people struggle to conceptualize billions of dollars, we're just not wired to imagine numbers at those scales. I think generally most people imagine billionaires somewhere in the ballpark of millionaires, when that is just demonstrably untrue.",
            "title_similarity": "0.7838469",
            "sentiment_compound": 0.7238
        },
        {
            "id": "hh6vtqr",
            "score": 1,
            "text": "A study found this?  What was the study called, American history?",
            "title_similarity": "0.36435848",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6vwul",
            "score": 1,
            "text": "\"even as they rage against the “top 1%” as a group, new research finds\"\n\nWell, people are still raging. That's good.",
            "title_similarity": "0.48452535",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hh6w3du",
            "score": 1,
            "text": "Why do Americans love billionaires?",
            "title_similarity": "0.6774715",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh6wam3",
            "score": 1,
            "text": "love.\n\nI agree with  many but not all of Erich Fromm's great ideas on love - he really hit the nail on the head nicely in his The Art of Loving. \n\n>Love is not primarily a relationship to a specific person; it is an attitude, an ordination of character which determines the relatedness of the person to the whole world as a whole, not toward one object of love\n\n>Love, experienced thus, is a constant challenge; it is not a resting place, but a moving, growing, working together; even whether there is harmony or conflict; joy or sadness, is secondary to the fundamental fact that two people experience themselves from the essence of their existence, that they are only one with each other by being one with themselves, rather than by fleeing from themselves.\n\n>To love somebody is not just a strong feeling—it is a decision, it is a judgment, it is a promise. If love were only a feeling, there would be no basis for the promise to love each other forever. A feeling comes and it may go.\n\n[Psychoanalysis and social philosophy aren't exactly science, I hope the readers will take inspiration as such and not boot me out of here for being unscientific]",
            "title_similarity": "0.51893896",
            "sentiment_compound": 0.9978
        },
        {
            "id": "hh6wpoz",
            "score": 1,
            "text": "Love? Who LOVES billionaires!?!?",
            "title_similarity": "0.53793633",
            "sentiment_compound": 0.8947
        },
        {
            "id": "hh6x0ll",
            "score": 1,
            "text": "Ahhh yes, the \"temporarily embarrassed millionaires\"",
            "title_similarity": "0.5648323",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hh6y34j",
            "score": 1,
            "text": "Americans are celebrity-loving idiots.",
            "title_similarity": "0.65053624",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6y5cn",
            "score": 1,
            "text": "I hate everything. (facepalm)",
            "title_similarity": "0.28173283",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hh6y90j",
            "score": 1,
            "text": "Little orphan Annie and Daddy Warbucks syndrome  (longest name ever for a disorder, maybe)",
            "title_similarity": "0.35772654",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hh6y9jm",
            "score": 1,
            "text": "Looking at you 1980’s",
            "title_similarity": "0.07159701",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6ymvc",
            "score": 1,
            "text": "USA will be remembered as the shortest lived empire.",
            "title_similarity": "0.38033086",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6yzvg",
            "score": 1,
            "text": "So the propaganda and pr is working. No kidding go on r/economics",
            "title_similarity": "0.4836951",
            "sentiment_compound": -0.3766
        },
        {
            "id": "hh6z1yw",
            "score": 1,
            "text": "Who the heck loves billionaires? It should be illeagal to have that much money.",
            "title_similarity": "0.75819445",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hh6z9a4",
            "score": 1,
            "text": "I never did understand worshipping the rich.",
            "title_similarity": "0.55315137",
            "sentiment_compound": 0.3434
        },
        {
            "id": "hh6zen4",
            "score": 1,
            "text": "I've never met a single person that thinks like this, thus saying Americans is beyond a generalization.",
            "title_similarity": "0.27534133",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh6zgsy",
            "score": 1,
            "text": "You will never be a billionaire.",
            "title_similarity": "0.25517532",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh6zqov",
            "score": 1,
            "text": "God damn Americans are dumb",
            "title_similarity": "0.45082456",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hh70cvu",
            "score": 1,
            "text": "...we had to study this to find out?",
            "title_similarity": "0.16903144",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh70fm5",
            "score": 1,
            "text": "We also give book deals to war criminals and sweet heart deals to  convicted pedophiles",
            "title_similarity": "0.49440715",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hh70nrk",
            "score": 1,
            "text": "And then there are those of us who understand that theft is wrong even if it is legal.\nThere are also those who learn from history. The income tax was originally a tax on the wealthy. The lowest tax rate in 1913 was 1% on income over $3,000 per year. That would be nearly $80,000 per year in today's dollars. If you make less than $80k per year and pay more than 1% income tax, then you should understand the problem with a wealth tax: eventually you will be wealthy enough to be taxed.",
            "title_similarity": "0.8012409",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hh70qni",
            "score": 1,
            "text": "Nothing about the American Dream? Nothing about individualism over collectivism? It's just class warfare under cover of \"science.\"",
            "title_similarity": "0.52343273",
            "sentiment_compound": -0.1431
        },
        {
            "id": "hh70uit",
            "score": 1,
            "text": "> think Oprah Winfrey or Bill Gates \n\nI feel like there's another billionaire who really seems to have a cult like following, more so than Bill or Oprah... like they even come out to concerts he puts on where he talks. And wear stuff with his name and slogans on them.",
            "title_similarity": "0.58354056",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hh714q5",
            "score": 1,
            "text": "So basically Hollywood is a gigantic psyop created to make consent about loving the \"down to earth\" millionaries?",
            "title_similarity": "0.5494643",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hh71b7y",
            "score": 1,
            "text": "I don’t know of anyone that has love for billionaires",
            "title_similarity": "0.3916181",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh71ixi",
            "score": 1,
            "text": "That's how religion controls people , right ? Now it's the 1 %",
            "title_similarity": "0.49447328",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh71k8y",
            "score": 1,
            "text": "So happy this convo is getting more attention. Inequality had been mans true enemy since Mesopotamia and looks to the French and Russian revolutions not so long ago",
            "title_similarity": "0.5470718",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hh71krk",
            "score": 1,
            "text": "It’s like Stockholm Syndrome.",
            "title_similarity": "0.14634703",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh71n96",
            "score": 1,
            "text": "I think a lot of people  think they are better off than they actually are… they just want to feel superior",
            "title_similarity": "0.58491147",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hh71q65",
            "score": 1,
            "text": "Wealth taxes are dumb-dumb. I don’t care if they are super wealthy, I don’t want to start a precedent of taxes unrealized gains",
            "title_similarity": "0.7273916",
            "sentiment_compound": 0.9382
        },
        {
            "id": "hh71w34",
            "score": 1,
            "text": "The hungry and divided play into the hands of the men who put them there.",
            "title_similarity": "0.4027969",
            "sentiment_compound": 0.34
        },
        {
            "id": "hh71wcc",
            "score": 1,
            "text": "It is called \"Stockholm Syndrome\", baked into a whole culture.",
            "title_similarity": "0.27540463",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7210j",
            "score": 1,
            "text": "Why would I support a team in anyone that supports more than a basic government?",
            "title_similarity": "0.550966",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh72hgv",
            "score": 1,
            "text": "I dont love billionaires. I also don't hate them for being more financially successful",
            "title_similarity": "0.77357626",
            "sentiment_compound": 0.5731
        },
        {
            "id": "hh72on7",
            "score": 1,
            "text": "Feudalism at its finest",
            "title_similarity": "0.2712195",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hh72wxt",
            "score": 1,
            "text": "It’s our version of royalty, which is ridiculous as well.",
            "title_similarity": "0.49507803",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hh72y2m",
            "score": 1,
            "text": "Not sure who’s polling, never saw a poll but, no don’t at all think like this",
            "title_similarity": "0.24343657",
            "sentiment_compound": -0.008
        },
        {
            "id": "hh73luq",
            "score": 1,
            "text": "I think that I would have more respect for the rich if they paid their fair share of taxes.",
            "title_similarity": "0.7291906",
            "sentiment_compound": 0.8883
        },
        {
            "id": "hh73o0i",
            "score": 1,
            "text": "Interesting number of non scientific / rule breaking top comments with a liberal bent. And by interesting I mean, exactly as expected on this sub.",
            "title_similarity": "0.4457888",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hh73o1l",
            "score": 1,
            "text": "Billionaires are really not the problem with our economy. Our disastrous government spending is.",
            "title_similarity": "0.7628296",
            "sentiment_compound": -0.3353
        },
        {
            "id": "hh73r1r",
            "score": 1,
            "text": "Why would anyone have any love for billionaires they will NEVER have as a friend or even personal acquaintance? I don't understand that at all. I mean, not even a little. Then, on top of that, to allow that to affect the way you think about how they should be taxed. WHAT?!?!?!?",
            "title_similarity": "0.7219382",
            "sentiment_compound": 0.9131
        },
        {
            "id": "hh73rzq",
            "score": 1,
            "text": "Americans are stupid, a new study finds.",
            "title_similarity": "0.6230196",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hh73ueo",
            "score": 1,
            "text": "Still waiting on that trickle down……",
            "title_similarity": "0.021880439",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh73xfo",
            "score": 1,
            "text": "Are you serious?   I think all billionaires are mental.  Tax the hell out of them",
            "title_similarity": "0.6762741",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hh740vn",
            "score": 1,
            "text": "Fame gets a fortune and a fortune gets fame. USA! USA! USA!",
            "title_similarity": "0.4892892",
            "sentiment_compound": 0.7701
        },
        {
            "id": "hh745zq",
            "score": 1,
            "text": "Feeble minded individuals.",
            "title_similarity": "0.17058976",
            "sentiment_compound": -0.296
        },
        {
            "id": "hh74fte",
            "score": 1,
            "text": "Couldn't one very easily make the mirror argument:\n\n\"Americans' hatred for individual billionaires affects their views on economic inequality -- and makes them more likely to support wealth taxes.\"\n\nThis argument seems like a double-edged sword to me.",
            "title_similarity": "0.9206713",
            "sentiment_compound": -0.4194
        },
        {
            "id": "hh74q34",
            "score": 1,
            "text": "\"Terrific race the Romans.. Terrific!\"",
            "title_similarity": "0.30667704",
            "sentiment_compound": 0.7574
        },
        {
            "id": "hh74tb3",
            "score": 1,
            "text": "Tax law should be simplified. Less loopholes. Greater estate tax. Tax on unexercised stock or unsold stock? No. Taxes should have a higher tax % at the top income, but everyone should have the same credits, deductions, etc without limits due to income.",
            "title_similarity": "0.7193302",
            "sentiment_compound": 0.6441
        },
        {
            "id": "hh74vau",
            "score": 1,
            "text": "I don't love individual billionaires, I think they suck ass because they pay little taxes",
            "title_similarity": "0.79142576",
            "sentiment_compound": -0.8798
        },
        {
            "id": "hh74xay",
            "score": 1,
            "text": "Haven't read the paper, but did they consider the possibility that many Americans probably find the notion of taxes distasteful in general? And would prefer not to extort their fellow citizens; regardless of their level of wealth?",
            "title_similarity": "0.83151233",
            "sentiment_compound": 0.6868
        },
        {
            "id": "hh758wr",
            "score": 1,
            "text": "How can any one like bezo the stingyest man on earth",
            "title_similarity": "0.42545575",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh75bie",
            "score": 1,
            "text": "Which in my opinion is exactly what the philanthropy is designed to do, at least partially.",
            "title_similarity": "0.26107335",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh75d8l",
            "score": 1,
            "text": "The difference between America and T.R.O.T.W.",
            "title_similarity": "0.34970564",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh75eta",
            "score": 1,
            "text": "And if you think that image is an accident, I have a bridge to sell you.",
            "title_similarity": "0.39941442",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hh75fm6",
            "score": 1,
            "text": "i think its cause the American dream is for us to become rich. We all love mob movies and Wolf of Wallstreet type films. the dudes in those movies r assholes. through and through yet we love to root for them. to have that power and wealth. and only a few of us make it",
            "title_similarity": "0.6741166",
            "sentiment_compound": 0.9246
        },
        {
            "id": "hh75gg1",
            "score": 1,
            "text": "Americans are so obsessed with money that it distorts our world view.",
            "title_similarity": "0.8051046",
            "sentiment_compound": -0.5634
        },
        {
            "id": "hh75l66",
            "score": 1,
            "text": "All part of the plan. Divide and conquer",
            "title_similarity": "0.17402333",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh75orh",
            "score": 1,
            "text": "A new study finds a new study finds",
            "title_similarity": "0.2519508",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh75wwl",
            "score": 1,
            "text": "Of course. Everyone wants to be rich. So why attack your dream?",
            "title_similarity": "0.5957604",
            "sentiment_compound": 0.3008
        },
        {
            "id": "hh75xjg",
            "score": 1,
            "text": "Real fuckin' weird, my dudes.",
            "title_similarity": "0.29372376",
            "sentiment_compound": -0.2484
        },
        {
            "id": "hh76ib3",
            "score": 1,
            "text": "I absolutely do NOT love billionaires and I definitely think they should pay their fair share of taxes. I don’t personally know any fellow Americans who think they shouldn’t. Who did they study?",
            "title_similarity": "0.7810329",
            "sentiment_compound": 0.2888
        },
        {
            "id": "hh77qq9",
            "score": 1,
            "text": "“Don’t tax poor Elon, he might invite me to a party someday!”",
            "title_similarity": "0.40549305",
            "sentiment_compound": 0.126
        },
        {
            "id": "hh7863a",
            "score": 1,
            "text": "I want daddy bezos to give me my amazon bux",
            "title_similarity": "0.290677",
            "sentiment_compound": 0.25
        },
        {
            "id": "hh789ty",
            "score": 1,
            "text": "I don’t believe this “study” ever happened.",
            "title_similarity": "0.15996754",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh78lvf",
            "score": 1,
            "text": "It’s almost as if letting these same billionaires control the media we consume is a bad idea.",
            "title_similarity": "0.74942935",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hh78q1s",
            "score": 1,
            "text": "I spent all evening yelling at a tv with my neighbors. We were cheering for our billionaire’s millionaires who were playing a children’s game against another billionaire’s millionaires more than 800 miles away. The millionaires on tv said my community wasn’t as committed to our billionaire’s millionaires as people think and that made me upset. Then I drank a whiskey and remembered how, beyond the connection I felt with my neighbors, nothing that happened this evening matters. That said, I can’t fathom cheering for anyone who wasn’t walking around with the name of my community plastered all over his clothes. What possesses a person who has hopes and dreams, who has daily struggles to overcome, and relationships to manage, to put any measure of their energy or emotion into the accomplishments of another person. Particularly someone they don’t know and who doesn’t care to know them. Seems more than a little off to me.",
            "title_similarity": "0.56397384",
            "sentiment_compound": 0.936
        },
        {
            "id": "hh78s2v",
            "score": 1,
            "text": "American enculturation trains you to respect people who have earned what they own. This indirectly justifies being wealthy, even when it's unhealthy for everyone. You see a guy who has a bunch of money and think, \"He's not in jail, he must have got it through hard work. He deserves it.\" We defend them, even though they're likely getting wealthy by gaming economic and banking systems.\n\nJust to put certain wealth into perspective: if you had a billion dollars, you could spend over $30,000 a day for 80 years.",
            "title_similarity": "0.76765096",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hh792ki",
            "score": 1,
            "text": "10% of americans own 89% of US stock.",
            "title_similarity": "0.38485995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh79ehk",
            "score": 1,
            "text": "We on that feudal peasant mindset",
            "title_similarity": "0.23819564",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hh79hr8",
            "score": 1,
            "text": "Buy, HODL, DRS.  That is all.",
            "title_similarity": "0.12104094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh79ns5",
            "score": 1,
            "text": "Imagine being so fond of a person you never met that you prefer to live a worse life than what you could have only to let that person have some billions extra",
            "title_similarity": "0.72954446",
            "sentiment_compound": 0.1633
        },
        {
            "id": "hh79ryl",
            "score": 1,
            "text": "Yeah this sub is fucked.",
            "title_similarity": "0.20323426",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hh79umf",
            "score": 1,
            "text": "Thank goodness this study was done. Known it since 2008 but finally it’s official. Win for science",
            "title_similarity": "0.3586626",
            "sentiment_compound": 0.8381
        },
        {
            "id": "hh79wbs",
            "score": 1,
            "text": "This doesn't make any sense. I love my parents, wife, friends, etc., but I still want them to pay a fair share of taxes",
            "title_similarity": "0.6925709",
            "sentiment_compound": 0.85
        },
        {
            "id": "hh7a0k1",
            "score": 1,
            "text": "I call shenanigans here.",
            "title_similarity": "0.028938133",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7a184",
            "score": 1,
            "text": "Interesting topic, but this is hardly science. A sociologic survey at best.",
            "title_similarity": "0.39560765",
            "sentiment_compound": 0.8248
        },
        {
            "id": "hh7a1cj",
            "score": 1,
            "text": "Maybe I got the context wrong but when I think of billionaires I first assume they have ripped off customers, treated their employees like trash and cut their benefits and pay so that they could make billions.",
            "title_similarity": "0.7679784",
            "sentiment_compound": 0.3291
        },
        {
            "id": "hh7a3aw",
            "score": 1,
            "text": "And after reading this I am, for some coincidental reason, slapped by teens/pre-twenties praising the successes of musk and bezos on YouTube shorts...\n\nMy high ass: musky blehzos",
            "title_similarity": "0.35321185",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hh7a7pp",
            "score": 1,
            "text": "There's more income inequality in this country since the Gilded Age and people don't bat an eye. The very wealthy have done a great job convincing everyone else that they are \"just like them\".",
            "title_similarity": "0.7572875",
            "sentiment_compound": 0.902
        },
        {
            "id": "hh7ajdz",
            "score": 1,
            "text": "I’m less likely to support wealth taxes on the super-rich because I have no faith in my government to use the money on necessities like social services instead of new tanks.",
            "title_similarity": "0.8424103",
            "sentiment_compound": 0.7008
        },
        {
            "id": "hh7amgl",
            "score": 1,
            "text": "Yeah right. I am skeptical about this conclusion in the header.",
            "title_similarity": "0.27617735",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hh7as18",
            "score": 1,
            "text": "Can’t close tax loopholes. What if lord bezos has to force his private accounting firm to account for that change? How would he possible survive?",
            "title_similarity": "0.70052505",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7aykz",
            "score": 1,
            "text": "ive heard from a few people that say ive never gotten a job from some one who isnt rich",
            "title_similarity": "0.4426465",
            "sentiment_compound": -0.4449
        },
        {
            "id": "hh7b2uf",
            "score": 1,
            "text": "Seriously?  I have to strain to think of a billionaire I like.  Screw ‘em all.",
            "title_similarity": "0.65613306",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hh7bmt4",
            "score": 1,
            "text": "Doesn't the same theory mimic die hard sports fans?",
            "title_similarity": "0.5383521",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hh7bo63",
            "score": 1,
            "text": "Tax them all, won’t hurt my feelings.",
            "title_similarity": "0.37910476",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hh7c0kw",
            "score": 1,
            "text": "Rich have always been fawned on that way. \n\nIn the 1930s we saw countless such films.",
            "title_similarity": "0.35956806",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hh7c5a8",
            "score": 1,
            "text": "Slaves defending their masters in a hope someday to become a master.",
            "title_similarity": "0.42378432",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hh7cdr1",
            "score": 1,
            "text": "The wealthy: “go ahead and come for my money, but you know whose money they will come for next, right?”\n\nMiddle class overwhelmingly votes against taxing the wealthy.",
            "title_similarity": "0.8019055",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hh7cgy9",
            "score": 1,
            "text": "Read the same thing in 'the hidden fault lines'",
            "title_similarity": "0.17446573",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hh7chxt",
            "score": 1,
            "text": "As if the grave isn’t already dug deep enough.",
            "title_similarity": "0.2993216",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hh7cnuu",
            "score": 1,
            "text": "The other day I read a post about how when Elon or Bezos gives 50mil to charity it's WAY less than they should be paying in taxes were things more equitable.  Really changed how I saw those gifts.  Looks like PR now.",
            "title_similarity": "0.7071068",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hh7cq8e",
            "score": 1,
            "text": "Unfortunately, Americans are dumb AF and easy to entertain.",
            "title_similarity": "0.4271549",
            "sentiment_compound": -0.128
        },
        {
            "id": "hh7cqrq",
            "score": 1,
            "text": "The only study these guys made was up some rich asshole.",
            "title_similarity": "0.604548",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hh7cz8v",
            "score": 1,
            "text": "Loving the controversial posts. Man, people are quick to defend billionaires.",
            "title_similarity": "0.5944748",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hh7d41z",
            "score": 1,
            "text": "Parasocial relationships suck, any good way to spread awareness about this so we don’t do this?",
            "title_similarity": "0.5541005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7dsve",
            "score": 1,
            "text": "I coulda told you that for $5",
            "title_similarity": "0.24410288",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7dtgs",
            "score": 1,
            "text": "Honestly we keep talking about these issues. Nothing changes. Apathy on repeat.",
            "title_similarity": "0.117071785",
            "sentiment_compound": 0.5978
        },
        {
            "id": "hh7dxel",
            "score": 1,
            "text": "So the flip side of the coin is how the tax money is used. People tend to get mad when they point out “the wealthy aren’t paying enough,” but is additional tax need? How will it be used? Do they want to expand gov/ gov programs with additional tax money? What percentage is used to benefit the general public?",
            "title_similarity": "0.83734274",
            "sentiment_compound": 0.8406
        },
        {
            "id": "hh7ecjc",
            "score": 1,
            "text": "I personally know someone rich and can say it's ok. And yes, its also not ok to just get his money imo.\nSorry but whenever i am in here ir's rich=bad. And all people then do is point at bezos and be like \"see rich =bad, everyone!\"\nIt's the equivilant of if you'd hear \"you poor? Well you are probably just lazy!!\" \nDo you like that? Is it true? Ofc. Not ffs.\nYall need to get your heads out of you ass just like you say other people have to.",
            "title_similarity": "0.7798549",
            "sentiment_compound": 0.9038
        },
        {
            "id": "hh7eyqc",
            "score": 1,
            "text": "There is a term for people like that: class traitors.",
            "title_similarity": "0.3937894",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh7ezkx",
            "score": 1,
            "text": "Unless the rich individual is publicly pushing for wealth taxes.",
            "title_similarity": "0.72423947",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hh7f11a",
            "score": 1,
            "text": "This is why we should fund schools",
            "title_similarity": "0.29504165",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7f1ag",
            "score": 1,
            "text": "Rich people own nothing to tax & pay themselves small annual salaries.\n\nIt's chess not checkers with them & you aren't winning! \n\nAdopt their strategies if you want to live your best life!",
            "title_similarity": "0.65702134",
            "sentiment_compound": 0.7176
        },
        {
            "id": "hh7f4jx",
            "score": 1,
            "text": "That is patently false on the surface.  I want to tax THE CRAP out of the rich.  Who do they ask for these studies?",
            "title_similarity": "0.75990593",
            "sentiment_compound": 0.1449
        },
        {
            "id": "hh7fdno",
            "score": 1,
            "text": "Unbelievable. Humanizing the rich makes it harder to treat them as less human. Who would have guessed!",
            "title_similarity": "0.8075993",
            "sentiment_compound": 0.8122
        },
        {
            "id": "hh7fm9o",
            "score": 1,
            "text": "Absolutely.  Don’t infringe on a billionaire’s right to exploit because one day I may have that opportunity.",
            "title_similarity": "0.5186187",
            "sentiment_compound": 0.34
        },
        {
            "id": "hh7fq56",
            "score": 1,
            "text": "What fucked up pseudo article is this",
            "title_similarity": "0.26519728",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hh7fxzr",
            "score": 1,
            "text": "I am happy to say that I am an american and I don't love billionaires.  Billionaires shouldn't exist.  It makes me sick to know that some people possess more money than millions of us combined.  Meanwhile, some people go hungry, some people are homeless, some people can't afford health insurance, some people don't make a living wage and the list goes on.",
            "title_similarity": "0.8352626",
            "sentiment_compound": -0.453
        },
        {
            "id": "hh7g5x5",
            "score": 1,
            "text": "Propaganda and advertising work. \n\nNotice how whenever you search a billionaires background news stories come up from all sorts of weird sources and always downplay the affluence of their parents?",
            "title_similarity": "0.7252009",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hh7g794",
            "score": 1,
            "text": "Most Americans are too dumb, they voted trump for goodness sake.",
            "title_similarity": "0.6087939",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hh7gg1x",
            "score": 1,
            "text": "Who are they polling???  That’s what I need to know.",
            "title_similarity": "0.23280576",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7h2kf",
            "score": 1,
            "text": "2022 just around the corner and poeole still attacking other people not corporations. \nWe had this scenerio several times in our history, the most infamous is The Royal British India Company, and the devastation it made to our world.\nYet rather than focus on a company we prefer to focus on an individual. Like that will change the problem we have right now. Neo-Feudalism is on our doorstep, with those people being the new monarchy, yet we still like idiots are angry on an individual or love and defend him if he has pure intentions.\n\nThis used to be different, this was not the way USA was made.",
            "title_similarity": "0.66859543",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hh7hapg",
            "score": 1,
            "text": "Us poor folk don't love a billionaire instead we know most of them earned their money and just hope/think the government taxes them accordingly like we get taxed.\n\nNot rocket science just common sense thinking but the reality is that they have rich lawyers scrounging and hiding every penny they make while us poor folk who can't afford a tax attorney and have to rely on the government help from time to time just accept being taxed to death.",
            "title_similarity": "0.8286362",
            "sentiment_compound": -0.4468
        },
        {
            "id": "hh7hd51",
            "score": 1,
            "text": "a lot of scientific comments here, the scientists are definitely out in full force today... heavily scrutinizing every aspect of this study and definitely not just reading the headline and agreeing with it",
            "title_similarity": "0.41840827",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hh7ifxr",
            "score": 1,
            "text": "So propaganda works? Shocker.",
            "title_similarity": "0.28070524",
            "sentiment_compound": -0.4865
        },
        {
            "id": "hh7j4zh",
            "score": 1,
            "text": "I think admiration is a better word for it.",
            "title_similarity": "0.32406762",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hh7j6aj",
            "score": 1,
            "text": "What Americans are these",
            "title_similarity": "0.21634103",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7j8se",
            "score": 1,
            "text": "I don't understand the lefts hate of billionaires....are you just jealous?",
            "title_similarity": "0.7435473",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hh7ji2c",
            "score": 1,
            "text": "I’m pretty sure my love for economics makes me not like a wealth tax. Taxing money that doesn’t exist is a wholly stupid idea.",
            "title_similarity": "0.786706",
            "sentiment_compound": 0.374
        },
        {
            "id": "hh7jmmj",
            "score": 1,
            "text": "I think it has to do with the rich being \"role models\". Not that they are good ones but everyone wants to be rich so how can you hate what you strive to become?",
            "title_similarity": "0.7906598",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hh7jns2",
            "score": 1,
            "text": "These editors need a TikTok account.",
            "title_similarity": "0.28013682",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7kdi7",
            "score": 1,
            "text": "Modern day goddamn royalty. Again, an enduring system in human societies",
            "title_similarity": "0.3253247",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hh7kgcn",
            "score": 1,
            "text": "I can’t think of one billionaire that I even want to like",
            "title_similarity": "0.39804533",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hh7km0u",
            "score": 1,
            "text": "Rich people own everything the poor and middle class buy. You think the rich are just going to roll over and accept more taxes?  Nope they will just raise their prices and the low/middle class will end up paying for the tax increase. Trump showed if you give corporations a decent tax rate they will reward employees and bring jobs back but you fools didnt like his mean tweets so now we are stuck w dipshit joe",
            "title_similarity": "0.86637264",
            "sentiment_compound": -0.8055
        },
        {
            "id": "hh7kmwj",
            "score": 1,
            "text": "Is this another party trying to encourage social unrest and inducing between each other?\n\nI love what musk does. He creates electric cars, for less pollution, better tech.\n\nGlobal satellite network for internet everywhere!\n\nThat's two amazingly huge things.\n\nAnd it's funny how washer meant to hate these people, when there's 1000's of billionaires who are hidden, why target the known ones?\n\nThis feels like an attack by the oil industry or even other car industries that are feeling the threat of electric cars or large internet companies getting the threat of musk's global internet.\n\nHe's a distributor and that's upset a lot of the old industries.\n\nThere's been an avid anti musk/bezo theme on Reddit and this is another piece that targets them.\n\nIt's not about billionaires, it's about trying to make certain billionaires unpopular.\n\nThis post doesn't talk about the hidden billionaires yet it's the same principle of potentially taxing then as well, they're not part of this propaganda against new tech disruptors.",
            "title_similarity": "0.7073761",
            "sentiment_compound": 0.8279
        },
        {
            "id": "hh7l86h",
            "score": 1,
            "text": "This study was quite a waste of time eh?",
            "title_similarity": "0.4144652",
            "sentiment_compound": -0.4728
        },
        {
            "id": "hh7liby",
            "score": 1,
            "text": "It's because one day they think they can be that billionaire. \n\nIt's not gonna happen but boy do they love billionaires, the biggest leeches on the planet.",
            "title_similarity": "0.67854464",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hh7m4ha",
            "score": 1,
            "text": "I will remain unimpressed by any billionaire until someone deconstructs a medieval Scottish castle brick by brick and has it flown piece at a time by helicopter to be rebuilt atop their 2000ft+ skyscraper in an effort to undo an ancient curse.",
            "title_similarity": "0.5220395",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hh7ma5s",
            "score": 1,
            "text": "right wing Americans or all Americans?",
            "title_similarity": "0.34882444",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7mlpu",
            "score": 1,
            "text": "“Socialism never took root in America because the poor see themselves not as an exploited proletariat but as temporarily embarrassed millionaires.” -- John Steinbeck\n\nWhen even the poorest most exploited peons think they are millionaires waiting to happen, something just went wrong and they haven't gotten their money yet in the land of opportunity and yada yada, they don't get behind plans to actually stem the massive inequalities. \n\nThe poor are literally sabotaging their own lives because they have an unrealistic view of where they stand. Musk, Bezos and so on - they're by all accounts major assholes as people which is why they got where they are in our exploitation based world, but people look up to them and think they're something to emulate.",
            "title_similarity": "0.81665957",
            "sentiment_compound": -0.9776
        },
        {
            "id": "hh7mwsk",
            "score": 1,
            "text": "Because of the propaganda that anyone can be a billionaire if they just try hard enough.",
            "title_similarity": "0.57430124",
            "sentiment_compound": -0.34
        },
        {
            "id": "hh7n6ml",
            "score": 1,
            "text": "It doesn't matter if people support it or not because if debt creates new money and the bottom 60% have nothing, and the government rely on new investors of bonds to pay their older bondholders, which is unsustainable, where else is the money going to come from...?",
            "title_similarity": "0.73005664",
            "sentiment_compound": 0.6636
        },
        {
            "id": "hh7n8id",
            "score": 1,
            "text": "Americans also love politicians too much as well, which is what got us to where we are today with a dementia stricken loon in office",
            "title_similarity": "0.6365032",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hh7nbz9",
            "score": 1,
            "text": "I'll take a more educated opinion than the opinion of a guy who has never read a book or watched a movie",
            "title_similarity": "0.4819337",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7ngfu",
            "score": 1,
            "text": "Some Americans realize billionaires would spend their money better than their own government. Separation of money and state is a good thing. The wealthy subsidized this government far longer than they should.",
            "title_similarity": "0.8283472",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hh7ngjt",
            "score": 1,
            "text": "In other words, Americans are stupid. Hardly news.",
            "title_similarity": "0.5112579",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hh7ni0c",
            "score": 1,
            "text": "As always: the people who have the money, don't wanna spend it.",
            "title_similarity": "0.4937642",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7nylj",
            "score": 1,
            "text": "No f*cking sh*t sherlock. How did people need a survey to point this out",
            "title_similarity": "0.331547",
            "sentiment_compound": -0.296
        },
        {
            "id": "hh7o3cz",
            "score": 1,
            "text": "Americans are *seriously* weird.\n\nDon't they realize that taxing the rich benefits *them*? And that's what's so strange, because Americans seems very selfish. They don't want to pay taxes to ensure that everyone get things like education and health care for free, but this study says that they really care about some rich guy they don't know?",
            "title_similarity": "0.8914283",
            "sentiment_compound": 0.9465
        },
        {
            "id": "hh7o3s7",
            "score": 1,
            "text": "Science opinion same thing",
            "title_similarity": "0.08824613",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7ou5k",
            "score": 1,
            "text": "Being cudgeled by the cruelty of the wealthy, so they can be more wealthy.  Our species is doomed to eat itself whole, like an ouroboros.",
            "title_similarity": "0.72721046",
            "sentiment_compound": -0.3197
        },
        {
            "id": "hh7ovsb",
            "score": 1,
            "text": " [Bribing Society at Large](https://www.vox.com/recode/2019/5/22/18634612/anand-giridharadas-billionaires-philanthropy-zuckerberg-bezos-kara-swisher-decode-podcast-interview)\n\n>Goldman Sachs’ 10,000 Women Program, that’s just giving back. It’s not really giving anything up. It’s not dismantling a bad system, right? It’s actually trying to buy yourself a little bit of wiggle room to continue being Goldman Sachs. But Goldman Sachs saying, “We’re going to actually get out of the student loan activities that we’re doing, which are actually just hurting and dooming millions of people, or we’re going to stop lobbying against Glass-Steagall or we’re going to stop lobbying against this consumer financial protection because, actually, it would be good for people even though it’ll be bad for us.” That would actually be giving up ...  \n>  \n>And you can have philanthropists ... I was in a room full of philanthropists this afternoon. I asked them, “How many of you in this room” — about this size, because they all worked for big foundations, giving away lots of money. I said, “How many of you, your random foundations, how many of your foundations work on impact investing?” Maybe half the room’s hands went up. Two-thirds of the room’s hands went up. Most foundations in that room are engaged in that.  \n>  \n>I said, “Great. How many of your foundations are working on a wealth tax?” It’s like one lonely guy in the middle was like ... right? It’s very simple what I advocate. People in that room, more of them should be working on the wealth tax. More of them should be working on equalizing public school funding, winning a Supreme Court case, so that it’s no longer legal in this country to fund public schools according to how big mommy or daddy’s house is.  \n>  \n>*Those* kinds of things that would actually help dismantle a bad system and would actually not crowd government out but crowd government in. Where you’d use your giving to test things privately and then try to mainstream it into policy. That heritage has been lost under this fantasy of billionaires ...",
            "title_similarity": "0.6260179",
            "sentiment_compound": 0.9203
        },
        {
            "id": "hh7owzk",
            "score": 1,
            "text": "This sounds like it was written by a billionaire",
            "title_similarity": "0.41740054",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh7pc5p",
            "score": 1,
            "text": "but but bill gates is the most kindest and caring and selfless human being on earth!",
            "title_similarity": "0.32507947",
            "sentiment_compound": 0.7173
        },
        {
            "id": "hh7piuj",
            "score": 1,
            "text": "Considering how Bezos and Gates came from modest beginnings, they prove that the American dream is very much alive if you work hard and get lucky.",
            "title_similarity": "0.41932124",
            "sentiment_compound": 0.7414
        },
        {
            "id": "hh7q0l5",
            "score": 1,
            "text": "What billionaire do I supposedly love? Can't think of a single one. Nor can I imagine anyone else loving them.",
            "title_similarity": "0.5175934",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hh7q5dc",
            "score": 1,
            "text": "And the billionaires most likely figured this out ~10 years ago.",
            "title_similarity": "0.3736253",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7q9ip",
            "score": 1,
            "text": "Tax is thief. Nothing to the state, everything for the individual.\n\n\n\"Taxing the rich\" won't do anything to solve any problem, in fact it'll increase it and create more.\n\n\nThe fun fact, also, is that the ones saying to \"tax the rich\" are rich, but they don't consider themselves rich. \n\"Tax the rich, but only if the rich to be taxed is richer than me\".",
            "title_similarity": "0.8153036",
            "sentiment_compound": 0.9599
        },
        {
            "id": "hh7qb21",
            "score": 1,
            "text": "I mean even if I loved a billionaire, that doesn’t mean I should be sacrificing the integrity of my views over fairness and rightness of the world.",
            "title_similarity": "0.6850705",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hh7qcf1",
            "score": 1,
            "text": "I said to my friend: \"I wish I was a billionaire, just like my dad...\"\r  \nMy friend said, \"Whoa, your dad was a billionaire?\"\r  \n\r  \nI said, \"no, he also wished he was...\"",
            "title_similarity": "0.66510516",
            "sentiment_compound": 0.891
        },
        {
            "id": "hh7qea3",
            "score": 1,
            "text": "Are any of the hot posts on here ever actual science. \n\nI only ever see political stuff",
            "title_similarity": "0.31092703",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7qk9n",
            "score": 1,
            "text": "I have found that to be the case with a lot of people. Its scary how many people defend these mega rich, even though their own lives are struggling. Media manipulates them into believing all the problems in the country are from the poor, immigrants and those not willing to work several jobs just to survive. Got 3 jobs, can't afford to put food on the table or pay for any healthcare, its your own fault sorta thing.\n\nAlways said if the rich paid the taxes they were supposed to, it wouldn't make any difference to them, it wouldn't make their life harder, most of them probably wouldn't even notice the difference they have that much money. Its not like they ever have to worry about putting food on the table, yet you will moan at someone struggling to put food on the table and want them prisoned for not paying their taxes",
            "title_similarity": "0.7866346",
            "sentiment_compound": -0.9301
        },
        {
            "id": "hh7qleo",
            "score": 1,
            "text": "that’s the media, It’s a ducking cringe fest when the media serves bezos on a platter",
            "title_similarity": "0.44255072",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7qlsa",
            "score": 1,
            "text": "Many Americans have some weird notion in their mind that they will be a billionaire too, and do not want laws which will harm this hypothetical future self, not understanding death by poverty because the hyper rich are not being taxed is actually far more likely.",
            "title_similarity": "0.8414062",
            "sentiment_compound": -0.2444
        },
        {
            "id": "hh7qm2o",
            "score": 1,
            "text": "If money can buy public perception, it can buy anything. 💸💸💸🤣",
            "title_similarity": "0.3584363",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hh7qpu4",
            "score": 1,
            "text": "Simps to the highest degree",
            "title_similarity": "0.059392",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7r1bb",
            "score": 1,
            "text": "We don't need a tax on how much wealth you have. That is no different than breaking into someone's bank vault. We should however tax income earned and bully the world when it comes to tax evasion via sending the money earned to different countries to avoid higher taxes",
            "title_similarity": "0.70054185",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hh7r79l",
            "score": 1,
            "text": "Was the study made all over the two continents or just another time that the usa citizens thinks themselves way bigger of what they are?",
            "title_similarity": "0.5379747",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7rcx2",
            "score": 1,
            "text": "This feels like an article/idea that would induce learned helplessness... I don't love any billionaires and neither does anyone I know. Can we say payed for by an anonymous billionaire?",
            "title_similarity": "0.71423995",
            "sentiment_compound": -0.6083
        },
        {
            "id": "hh7roac",
            "score": 1,
            "text": "yes yes, higher taxes totally always work, and do not paradoxically incur less revenue as empirical studies would suggest",
            "title_similarity": "0.5278611",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hh7rrve",
            "score": 1,
            "text": "People are indoctrinated and dumb.",
            "title_similarity": "0.26647717",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hh7ruo0",
            "score": 1,
            "text": "While most of them support being taxed more. We are a funny bunch of meat sacks.",
            "title_similarity": "0.49751982",
            "sentiment_compound": 0.7063
        },
        {
            "id": "hh7s8co",
            "score": 1,
            "text": "So what you're saying is decades of propaganda have worked? Awesome.",
            "title_similarity": "0.31332526",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hh7s99o",
            "score": 1,
            "text": "Until they realize that super wealthy people don't pay taxes no matter how much you raise the tax rate on them because they have a massive array of loopholes to bypass the laws, a network of tax havens to hide their money, big superpac lobbyists to keep the IRS underfunded and the tax laws \"ever in their favor,\" and teams of tax lawyers to keep it all straight and go to bat for them if the tax collector ever does come knocking on their door...\n\nInstead of raising their taxes how about we start with closing the loopholes so that the tax laws have some teeth to begin with",
            "title_similarity": "0.79230416",
            "sentiment_compound": 0.8598
        },
        {
            "id": "hh7sa9b",
            "score": 1,
            "text": "Money buys a lot of PR. And politicians.",
            "title_similarity": "0.5898697",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7sb05",
            "score": 1,
            "text": "From getting rich while you loose your job, and making huge profits from vaccines. I thought COVID showed everyone how lovable the 1% is... guess not then.",
            "title_similarity": "0.64297396",
            "sentiment_compound": 0.8885
        },
        {
            "id": "hh7swh7",
            "score": 1,
            "text": "I don't have an issue with the wealthy or think that they need to pay extortionate taxes. The real issue is the insider trading, abuse of position, etc that Congress people, the fed, federal judges, etc get away with.\nTaking away those advantages is really the only thing that will level the playing field. Take away those advantages and all of those loopholes go away instantly. Bam. Problem mostly solved.",
            "title_similarity": "0.7419162",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hh7swup",
            "score": 1,
            "text": "Man I thought this was r/science the top comments have nothing to do with science or the study",
            "title_similarity": "0.4254147",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hh7swwf",
            "score": 1,
            "text": "Nah, we just think our government is bloated, overfunded and wastes our money. It has nothing to do with billionaires, trillionaires, zillionaires or thousandaires.",
            "title_similarity": "0.7032262",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hh7szop",
            "score": 1,
            "text": "I could have told you that without the study",
            "title_similarity": "0.32617962",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7t4h8",
            "score": 1,
            "text": "It's not about taxes. It's about regulations so individuals don't suck out all of the chances for working class people. Money is meant to give purpose not create greedy assholes that become new age Royalty.",
            "title_similarity": "0.70312774",
            "sentiment_compound": 0.7711
        },
        {
            "id": "hh7tif5",
            "score": 1,
            "text": "If voting for a megalomaniac, not-self-made billionaire who won't even share their tax return fillings for president didn't hint that Americans love their rich... This research only states the obvious.",
            "title_similarity": "0.8171211",
            "sentiment_compound": 0.7853
        },
        {
            "id": "hh7tiq3",
            "score": 1,
            "text": "Imagine loving a billionaire. 'You there, person who doesn't have a concept of the price of milk or budgeting. I love you and I will die of poverty so your tax havens stay safe.'",
            "title_similarity": "0.757728",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hh7tmmf",
            "score": 1,
            "text": "I don't support wealth taxes because they are dumb.\n\nI don't care that others have more than me",
            "title_similarity": "0.65447474",
            "sentiment_compound": -0.8694
        },
        {
            "id": "hh7tnun",
            "score": 1,
            "text": "I don't love individual billionaires, and even if I did they can pay their damn taxes. I love my parents and my parents have to pay their taxes. Billionaires have a much greater ability to pay their taxes than my parents do.",
            "title_similarity": "0.79930985",
            "sentiment_compound": 0.1857
        },
        {
            "id": "hh7um9v",
            "score": 1,
            "text": "I like well-off people that don’t exploit others and give back to what helped them succeed. I despise well-off people that exploit others and then waste their wealth on private spaceships and super yachts. The latter should be systematically destroyed and promptly forgotten.",
            "title_similarity": "0.73836124",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hh7urxy",
            "score": 1,
            "text": "This is true\n\nI like Elon",
            "title_similarity": "0.055892948",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hh7v3id",
            "score": 1,
            "text": "The movie parasyte is so lucid. Wasn’t there a character that worshipped the rich guy trapped in basement?",
            "title_similarity": "0.576115",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hh7vbeh",
            "score": 1,
            "text": "“Wealth taxes on the super rich”\nBecause historically it’s the super rich that find it hard to avoid tax, not the middle class…",
            "title_similarity": "0.8434025",
            "sentiment_compound": 0.8689
        },
        {
            "id": "hh7viyr",
            "score": 1,
            "text": "I see it more as why take more in taxes just because they made more like if they pay a fair share and follow the law then how is it their fault. The pathetic thing is so many people are worried them and not the multimillionaire  congress memebers",
            "title_similarity": "0.7852013",
            "sentiment_compound": -0.4033
        },
        {
            "id": "hh7w27t",
            "score": 1,
            "text": "I think the lobbying and tax cuts implemented by Washington are what's stopping a wealth tax. Not a few peoples opinion of billionaires",
            "title_similarity": "0.79766285",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hh7wa3s",
            "score": 1,
            "text": "Geez that's... thats really dumb.",
            "title_similarity": "0.18282773",
            "sentiment_compound": -0.5563
        },
        {
            "id": "hh7wjiq",
            "score": 1,
            "text": "Who actually love individual billionaire? None of them are likeable",
            "title_similarity": "0.58982503",
            "sentiment_compound": 0.802
        },
        {
            "id": "hh7wk4g",
            "score": 1,
            "text": "AKA idiots who thinks will join the billionaires club some day!",
            "title_similarity": "0.5861863",
            "sentiment_compound": 0.3595
        },
        {
            "id": "hh7wqz3",
            "score": 1,
            "text": "Sounds like a billionaire funded this study",
            "title_similarity": "0.5195736",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh7wsxt",
            "score": 1,
            "text": "Why are people so obsessed with taxes on Reddit? We have a spending issue not a revenue issue",
            "title_similarity": "0.6844619",
            "sentiment_compound": -0.3052
        },
        {
            "id": "hh7wt03",
            "score": 1,
            "text": "Followed closely by the shocking study showing large breasts on actresses inhibits males ability to detect poor acting.",
            "title_similarity": "0.7017415",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hh7wtvy",
            "score": 1,
            "text": "Billionaires very, very expensive marketing campaigns affects Americans love for individual billionaires.",
            "title_similarity": "0.771806",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh7wucp",
            "score": 1,
            "text": "Yet I’m here with a reflexive aversion and extreme suspicion of the super rich. I never suffered the idiocy of parasocial relationships. Never got star crazy. Wonder why that is.",
            "title_similarity": "0.60504085",
            "sentiment_compound": 0.7485
        },
        {
            "id": "hh7wx8t",
            "score": 1,
            "text": "It is impossible to have economic equality. Not everyone work equally to achieve the highs economically. That is just how it works\n\nThe confusion most people have is the difference of Capitalist vs Crony Capitalist. Equality is a lovely idea that is impossible to achieve",
            "title_similarity": "0.7453196",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hh7x269",
            "score": 1,
            "text": "Propaganda is a powerful tool",
            "title_similarity": "0.24814552",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hh7xqne",
            "score": 1,
            "text": "It's even worse with these same billionaires buying media corporations and slowly trickling pro themselves propaganda. I'm looking at you Bezos",
            "title_similarity": "0.6949943",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hh7xr5y",
            "score": 1,
            "text": "Most of these morons who “love” individual billionaires actually think they will become one. The fact that they have no skills or abilities that will make them a billionaire ever crosses their minds.",
            "title_similarity": "0.61643547",
            "sentiment_compound": -0.6709
        },
        {
            "id": "hh7xzjf",
            "score": 1,
            "text": "It’s like the Bronx tale movie the Mickey mantle Theory",
            "title_similarity": "0.23224616",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh7y64l",
            "score": 1,
            "text": "Someone needs to study and create a psychological profile for the “billionaire” and study why some individuals amass and hoard excessive wealth to the extreme.",
            "title_similarity": "0.74066323",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hh7y92x",
            "score": 1,
            "text": "I believe we live in a world with to many idiots",
            "title_similarity": "0.38536245",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7ytk4",
            "score": 1,
            "text": "i know my opinion is anecdotal, but i have no love for any of the billionaires. however, i do not support a wealth tax. we have income tax in this country. it needs to be either or, but not both. to me, the most fair way for taxing is to have no income/wealth tax at all and simply have a sales tax on all products/services. if you spend it you pay tax, if you sit on it you do not.\n\nfor the record, i am an economics idiot so my opinion might be completely ridiculous.",
            "title_similarity": "0.74504024",
            "sentiment_compound": -0.964
        },
        {
            "id": "hh7z5am",
            "score": 1,
            "text": "May also be a bit of concern that over taxing wealthy will make them less charitable for their cause.",
            "title_similarity": "0.78983116",
            "sentiment_compound": 0.6003
        },
        {
            "id": "hh7zcld",
            "score": 1,
            "text": "When you realize they are real people you are not as open to robbing them anymore.",
            "title_similarity": "0.41867256",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7zf3b",
            "score": 1,
            "text": "It's just Elon.. isn't it?",
            "title_similarity": "-0.02879965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7zglx",
            "score": 1,
            "text": "Socialism never took root in the US because we don’t view ourselves as an abused proletariat; we view ourselves as temporarily embarrassed millionaires.",
            "title_similarity": "0.67968684",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hh7znt4",
            "score": 1,
            "text": "The money has to come from somewhere, if not the rich then the poor and middle class. For example arizona has some I the highest registration fees in the country. \nBut swift-knight transportation registers their truck and trailers out of state.\nCould Jeff basos survive on 6.5 billion a day? Of course! So why does he not pay taxes and the rest of us do? \nThere are some that are philosophically opposed to taxes but for the most part it is a matter of the tax code that is written for the mega rich.",
            "title_similarity": "0.74316585",
            "sentiment_compound": 0.629
        },
        {
            "id": "hh7zp6i",
            "score": 1,
            "text": "This is such a ridiculous post. There is nobody I know who love billionaires.",
            "title_similarity": "0.5263196",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hh7zwbz",
            "score": 1,
            "text": "yes, you've been well conditioned, and if's true, you are in fact surrounded by idiots.",
            "title_similarity": "0.38271606",
            "sentiment_compound": 0.765
        },
        {
            "id": "hh800i1",
            "score": 1,
            "text": "Ah Reddit. Being a hemorrhaging wound of racism, misogyny, and general bigotry isn't an issue because \"it's just a joke\". On the other hand, the revolution depends on successfully dehumanizing billionaires in the public perception.\n\nListen, it's just that these ideas and principles obviously always matter. Not just when they impact a topic Reddit actually seems to care about.",
            "title_similarity": "0.740535",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hh801ol",
            "score": 1,
            "text": "So let me get this straight…\n\nWhen people see another person as a real human being instead of as an abstract they are less likely to want to punish that person?\n\nWow. Revolutionary.",
            "title_similarity": "0.584329",
            "sentiment_compound": 0.1119
        },
        {
            "id": "hh803tr",
            "score": 1,
            "text": "Even the republicans I know don’t like how easy it is for the rich to get off easy. Just don’t let a democrat start that conversation with them. If we had some kind of church-going, community participating, republican revolutionary making these statements, the country would probably start to heal.",
            "title_similarity": "0.7327429",
            "sentiment_compound": 0.8979
        },
        {
            "id": "hh804ic",
            "score": 1,
            "text": "Reading this, it's also fair to say that people support higher taxes when billionaires are dehumanized as \"the 1%\".",
            "title_similarity": "0.77014697",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hh8073t",
            "score": 1,
            "text": "If I was a billionaire, I'd try my utmost best to make America a 4 day work week/3 day weekend. I'll chip in most of my money if it was possible.",
            "title_similarity": "0.5457611",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh80bcw",
            "score": 1,
            "text": "Who loves them?!? Who?!?! Tf, most people I know find their existence criminal!!!!",
            "title_similarity": "0.5173391",
            "sentiment_compound": 0.5312
        },
        {
            "id": "hh80lv6",
            "score": 1,
            "text": "\"It's easier to fool someone. Than to convince them they've been fooled.\"",
            "title_similarity": "0.48605692",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hh80o78",
            "score": 1,
            "text": "Sounds like a BS report funded by billionaires",
            "title_similarity": "0.53705597",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh80stn",
            "score": 1,
            "text": "I think people are just in love with the idea that such a wealthy person lives. How they live, spend their money, interact. Someone worth hundreds of billions playing Wario. It’s a bit different with royalty, but Queen and country. It’s a bit romanticized.",
            "title_similarity": "0.6754471",
            "sentiment_compound": 0.7615
        },
        {
            "id": "hh813ef",
            "score": 1,
            "text": "Why do we allow these clickbait headlines/articles on this sub?",
            "title_similarity": "0.29184827",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hh81lsf",
            "score": 1,
            "text": "This is, by far, the most American thing I have ever read. All jokes aside, no unhealthy food post, no joke, no ignorance, no nothing, come even close to the level of actual stupidity this is, as it reeks of America.\n\nYou don't even know them, yet, you don't want them to be taxed like anyone else? Isn't that the literal definition of inequality in terms of economy?",
            "title_similarity": "0.7139121",
            "sentiment_compound": 0.7588
        },
        {
            "id": "hh81mlk",
            "score": 1,
            "text": "they can't have a problem with billionaires, because they want to be one.",
            "title_similarity": "0.5288327",
            "sentiment_compound": 0.3732
        },
        {
            "id": "hh81teb",
            "score": 1,
            "text": "But Elon uses memes! We are practically the same!",
            "title_similarity": "0.08968198",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh81w2q",
            "score": 1,
            "text": "Idiots. You’ll never be a billionaire. They can pay their taxes.",
            "title_similarity": "0.57582617",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hh81zb3",
            "score": 1,
            "text": "we are a celebrity obsessed culture for sure. although i’d be shocked to hear it’s different in other countries. they seem just as celebrity obsessed as us.",
            "title_similarity": "0.6404636",
            "sentiment_compound": -0.34
        },
        {
            "id": "hh821d3",
            "score": 1,
            "text": "DO Americans love billionaires, or is the media, bought and paid for by said billionaires, telling Americans they love billionaires?",
            "title_similarity": "0.7521444",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hh822v4",
            "score": 1,
            "text": "I'm American and I despise the billionaires... Greed is the American way unfortunately....",
            "title_similarity": "0.74077475",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hh8281t",
            "score": 1,
            "text": "If I don't shower for 2 days and I scratch my balls my fingers will smell, a new study finds.",
            "title_similarity": "0.48029324",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh82cpc",
            "score": 1,
            "text": "Imagine defending someone who makes 1000x what you make. What are they getting out of it? You think they're gonna share their wealth with you if you defend them on facebook? It's delusional. But then again, everything about being a conservative is.",
            "title_similarity": "0.779247",
            "sentiment_compound": 0.4696
        },
        {
            "id": "hh82mla",
            "score": 1,
            "text": "Well they're all just temporarily embarrassed future billionaires themselves, so why would they favor a tax like that??",
            "title_similarity": "0.8167274",
            "sentiment_compound": 0.6322
        },
        {
            "id": "hh82xc5",
            "score": 1,
            "text": "How dumb do you have to be to love a billionaire. At least idiots that idolise singers/actors can be forgiven, because they are artists with a talent that’s something tangible.",
            "title_similarity": "0.7000206",
            "sentiment_compound": 0.743
        },
        {
            "id": "hh82yw9",
            "score": 1,
            "text": "Cult of personality = Monopoly man",
            "title_similarity": "0.48971212",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh830uq",
            "score": 1,
            "text": "Lemme fix the title for you.\n\n“America’s deep seated and untreated mental illness has somehow encouraged the poorest of the poor identify with billionaires, when they themselves cannot afford to clothe themselves, pay rent, nor afford basic health needs.” “America has become the most mentally ill country in the world.”",
            "title_similarity": "0.7609624",
            "sentiment_compound": -0.8828
        },
        {
            "id": "hh8365f",
            "score": 1,
            "text": "French Revolution mentality anywhere? \" Tale of Two Cities\" , required reading at one time in the States,  makes me think some didn't read it.",
            "title_similarity": "0.46234766",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh838ui",
            "score": 1,
            "text": "The rich have reinforced this",
            "title_similarity": "0.35058162",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hh83cmx",
            "score": 1,
            "text": "America, land of the free… to be complete morons.",
            "title_similarity": "0.42988086",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hh83exo",
            "score": 1,
            "text": "“It is a bad thing for a nation to raise and admire a false standard of success, and there can be no falser standard than that set by the deification of material well-being in and for itself” -Teddy Roosevelt",
            "title_similarity": "0.6949062",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hh83kjh",
            "score": 1,
            "text": "imho its because people believe, that one day they have a little chance to become one of them. and then use all kinds of rich priviledges. if billionaires can't do something, thay impossible for 99% of people - what's the point to be billionaire?",
            "title_similarity": "0.6941992",
            "sentiment_compound": 0.6494
        },
        {
            "id": "hh83tut",
            "score": 1,
            "text": "Americans are stupid and think life is a tv show",
            "title_similarity": "0.55950534",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hh83vzr",
            "score": 1,
            "text": "In other words: A lot of Americans are sadly idiots, or rather a lot of humans.\n\nI think a majority of humans are kind of dumb and horrible. people say homophobic/sexist/racist people are a minority but my day to day interactions make me feel like that they're the majority, My sample is small but you get what I'm saying. keep in mind too that a majority of the world is also china/middle east/africa etc.",
            "title_similarity": "0.688613",
            "sentiment_compound": -0.2952
        },
        {
            "id": "hh83zvc",
            "score": 1,
            "text": "Where are they finding these Americans? Your average joe atleast in my experience either doesn't really care about a Billionaire (maybe their business?) or outright dislikes them.",
            "title_similarity": "0.7688829",
            "sentiment_compound": -0.71
        },
        {
            "id": "hh84jdd",
            "score": 1,
            "text": "What utter BS. Another propaganda story",
            "title_similarity": "0.22923452",
            "sentiment_compound": -0.3102
        },
        {
            "id": "hh84pxc",
            "score": 1,
            "text": "If you say it loud enough and long enough, people may start to believe you.",
            "title_similarity": "0.28171876",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh84tuj",
            "score": 1,
            "text": "Could trade Americans for Brazilians too. Every time the subject taxes came up it’s a bunch of poor/middle class ppl saying they are against. \n\nLike dude government won’t tax the iPhone that you took 3 years to buy. Or that new car you paid 2 times the price to the bank in order buy in a way that fits\nIn your budget for 5 years",
            "title_similarity": "0.64263505",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh852w3",
            "score": 1,
            "text": "Well, the only one I thought was really all that good was Bill Gates… and I’m very disillusioned now. Although, I maintain that all shall be forgiven if Musk actually makes catgirls. At least, for Musk himself. The rest can work the coal mines they fight to keep open.",
            "title_similarity": "0.59097904",
            "sentiment_compound": 0.2665
        },
        {
            "id": "hh85rnx",
            "score": 1,
            "text": "Guess, I have always been different & am not in love with billionaires when there are so many people going hungry.",
            "title_similarity": "0.6105292",
            "sentiment_compound": -0.5216
        },
        {
            "id": "hh85wda",
            "score": 1,
            "text": "I'm American, and I support it 100%. Hope one day instead of fearing a financially crushing medical debt or becoming homeless, that my troubles are: \"I got to pay this taxes, that won't change my great lifestyle one bit\"",
            "title_similarity": "0.6357728",
            "sentiment_compound": -0.8688
        },
        {
            "id": "hh8693g",
            "score": 1,
            "text": "Ehh. I’m American and I hate billionaires. They shouldn’t exist. Period.",
            "title_similarity": "0.6298229",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hh886zd",
            "score": 1,
            "text": "Those individuals aren't poor enough then.",
            "title_similarity": "0.13923654",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hh88hsp",
            "score": 1,
            "text": "People… like billionaires?",
            "title_similarity": "0.5291323",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh892kt",
            "score": 1,
            "text": "If they took every billionaires fortune it would run the government for less than 6 months.\n\nBut if you make 15 and hour 31k a year and single… the government takes 20 percent of your wages… without asking.\n\nBut billionaires are the problem…",
            "title_similarity": "0.6748903",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh89et7",
            "score": 1,
            "text": "I don’t think I’ve ever loved a billionaire before. Frankly I find the obsession over that Tesla guy kind of sad.",
            "title_similarity": "0.61590457",
            "sentiment_compound": -0.2247
        },
        {
            "id": "hh89nxc",
            "score": 1,
            "text": "I have a good opinion about Bill Gates from his philanthropy work and whatnot, but I still think he should be taxed more",
            "title_similarity": "0.69983435",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hh89o5o",
            "score": 1,
            "text": "I have been intimately acquainted with several people worth 10 to 20 million bucks for various years of my life and they were all very personable and all dishonest to varying degrees. I can only imagine what absolute worthless garbage they would have been had they become billionaires. I knew a fellow who once stopped on a date at a car dealership and bought 7 Bentleys, one for every day of the week, to impress the much younger model on the date, who in fact married him.",
            "title_similarity": "0.60134935",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hh89t3q",
            "score": 1,
            "text": "They lothe idea of being a billionaire and honestly believe that they will be one one day",
            "title_similarity": "0.38305396",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hh8a4ph",
            "score": 1,
            "text": "We sure do love rich strangers over here, can't lie about that one. Good point",
            "title_similarity": "0.47536716",
            "sentiment_compound": 0.9186
        },
        {
            "id": "hh8b3wb",
            "score": 1,
            "text": "Damn you right . I better let the IRS monitor my bank account to combat this .",
            "title_similarity": "0.5159399",
            "sentiment_compound": -0.296
        },
        {
            "id": "hh8bj38",
            "score": 1,
            "text": "We don’t have a kings/queens/ or a royal family. We have billionaires",
            "title_similarity": "0.42095625",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8boxg",
            "score": 1,
            "text": "Can't see why, they all sound like horrible sociopaths to me",
            "title_similarity": "0.5018941",
            "sentiment_compound": -0.25
        },
        {
            "id": "hh8bysv",
            "score": 1,
            "text": "Being American, I wasn't aware that being a fan of a particular billionaire was a common thing. Maybe this is more of an older generation thing? Or maybe I just don't surround myself with money grubbing dipshits.",
            "title_similarity": "0.69548786",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hh8ckxr",
            "score": 1,
            "text": "'Bout time humanity started sciencing this.",
            "title_similarity": "0.09042944",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8coow",
            "score": 1,
            "text": "A better understanding of the impact of wealth inequality would mean that they are aware of how the ultra-rich are taxed and are aware of the impact it has on the economy. This means they can start to support a wealth tax in places where it will raise tax revenue.",
            "title_similarity": "0.7328092",
            "sentiment_compound": 0.9001
        },
        {
            "id": "hh8crpb",
            "score": 1,
            "text": "Amazon and tesla r great",
            "title_similarity": "0.25928444",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hh8cxcv",
            "score": 1,
            "text": "whats the phrase? that everyone in america thinks theyre displaced billionaires-to-be. when in reality a significant amount of people will never even top 200k. (and its not a meritocracy)",
            "title_similarity": "0.729748",
            "sentiment_compound": -0.0608
        },
        {
            "id": "hh8cxd0",
            "score": 1,
            "text": "Considering those 1% billionaires own the majority of programming 99% consume its not a surprise the population would have stockholm syndrome . Falls in line with the notion of corporate personhood.",
            "title_similarity": "0.58503675",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hh8egzs",
            "score": 1,
            "text": "This is so embarrassing, get those boots out of your mouths",
            "title_similarity": "0.34919232",
            "sentiment_compound": -0.5214
        },
        {
            "id": "hh8eolq",
            "score": 1,
            "text": "Anyone who do not support taxing the rich more and rethinking the ways of our financial system is either corrupt or plain stupid.",
            "title_similarity": "0.7994201",
            "sentiment_compound": -0.2635
        },
        {
            "id": "hh8g8ze",
            "score": 1,
            "text": "It’s a strange thing when the US gives up so much to play a lottery with almost no odds of winning.",
            "title_similarity": "0.58714736",
            "sentiment_compound": 0.5198
        },
        {
            "id": "hh8gqyc",
            "score": 1,
            "text": "Anyone who supports a wealth tax on people who are richer than them are greedy fucks.",
            "title_similarity": "0.78242993",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hh8hpac",
            "score": 1,
            "text": "I'm not a billionaire by any stretch, but I am a millionaire, and most wealthy people have a different type of utility. There is a measurement called marginal utility and it diminishes as one navigates the classes. By the time you make are wealthy you get more utility from investment than you do buying a couch or a car. In 2008 when went from living below the poverty line to the middle class my wants and needs changed. By 2016 when I sold my business I left behind 30 people who were fully employed and currently work for the same company which is now twice the size of when I sold. Because a wealthy person invested money in buying a business. Employing twice as many people as I could. I took the money I made and invested those dollars in other companies like tesla who in turn used my investment to expand. This idea that “Wealthy People” are hoarding money is not exactly true. \n\nWhere I think billionaires should be regulated is interference in the government. Meaning I shouldn't be able to send a lobbyist to Washington to limit the number of refining licenses in my state because I own 5 of them. Bazos shouldn't be able to bribe politicians to grant tax abatements for simply reserving the option to relocate to their districts. Healthcare insurance companies should not be able to bribe government officials to keep overseas healthcare companies from selling coverage in the US. OR across state lines. I could go down a long list of millionaires and billionaires using our greedy political class to avoid paying our fair share. What is really happening is the wealthy pay the political class to limit the opportunity for the masses. So begging to tax the rich is WAY better than banning the lobbying system and demanding term limits.",
            "title_similarity": "0.73511875",
            "sentiment_compound": 0.9703
        },
        {
            "id": "hh8iifa",
            "score": 1,
            "text": "This. So the “rich” becomes those who put in long hours, often at multiple jobs, often after years of study, who’ve made it to the point in life where they can enjoy things a little, and many who make less feel justified in taking some of what they have earned, while politicians understand that doing so is their only method to fund their programs.",
            "title_similarity": "0.6715879",
            "sentiment_compound": 0.683
        },
        {
            "id": "hh8ltsi",
            "score": 1,
            "text": "Nope. Huge fan of Mark Cuban and Warren Buffett, but they need to pay their fair share in taxes. Which means they need to be paying a hell of a lot more than I do.",
            "title_similarity": "0.74175805",
            "sentiment_compound": -0.6384
        },
        {
            "id": "hh8mcmj",
            "score": 1,
            "text": "This reminds me of the “explained” series on Netflix that covers the monarchies of the 20th century and how they’ve adapted their public image to remain adored/influential in the public eye.",
            "title_similarity": "0.42965126",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8nv2n",
            "score": 1,
            "text": "To hell with them all, Eat the Elite. Pay your part.",
            "title_similarity": "0.3975594",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hh8o3q6",
            "score": 1,
            "text": "The needs of the many outweigh the needs of the few",
            "title_similarity": "0.501317",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8oddu",
            "score": 1,
            "text": "This is why /r/space needs to please stop talking about the billionaire space race.",
            "title_similarity": "0.62084025",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hh8pfry",
            "score": 1,
            "text": "I'm an American and I have no love for individual billionaires.",
            "title_similarity": "0.56158125",
            "sentiment_compound": -0.5216
        },
        {
            "id": "hh8pk29",
            "score": 1,
            "text": "This is completely unnatural to me and I can't understand it.",
            "title_similarity": "0.2151744",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8qgqr",
            "score": 1,
            "text": "I have a convenience-crush on a billionaire who makes my life easier, but it in no way affects my desire to tax the crap out of him and his ilk.",
            "title_similarity": "0.68026197",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hh8qijs",
            "score": 1,
            "text": "Most Americans like this love billionaires because they fancy themselves, somehow, someway, becoming one.",
            "title_similarity": "0.5695872",
            "sentiment_compound": 0.8307
        },
        {
            "id": "hh8rw3r",
            "score": 1,
            "text": "*economic inequality*\n\nDont you mean personal choices affect outcome?",
            "title_similarity": "0.70798045",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8upby",
            "score": 1,
            "text": "No actually it's just our moral consistency where we don't believe in theft, even if you have more than me.",
            "title_similarity": "0.39325207",
            "sentiment_compound": -0.296
        },
        {
            "id": "hh8vhlq",
            "score": 1,
            "text": "Trump for example, exploited this, to get himself elected.",
            "title_similarity": "0.49683022",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hh8x05e",
            "score": 1,
            "text": "Scientific proof why we can’t have nice things.",
            "title_similarity": "0.48112974",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hh8y7rn",
            "score": 1,
            "text": "The only Billionaire that I like is from clan McDuck, and even then he's still frequently a jerk.",
            "title_similarity": "0.5676451",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hh91xcf",
            "score": 1,
            "text": "So many people worship these billionaires and genuinely believe they will make the right moves and become one themselves and benefit from the same lopsided system. It's so delusional. I'm not sure how they believe it.",
            "title_similarity": "0.59824973",
            "sentiment_compound": 0.5426
        },
        {
            "id": "hh923uw",
            "score": 1,
            "text": "Unlike other countries, the US allows anyone to build wealth. There is no cast system, you do not have to die in the same cast system you are born into.",
            "title_similarity": "0.47396272",
            "sentiment_compound": 0.6305
        },
        {
            "id": "hh93mn5",
            "score": 1,
            "text": "I don't love a bloody one of them. Everyone needs to be taxed appropriately in this country. You make an assload, you get taxed an assload.",
            "title_similarity": "0.6172626",
            "sentiment_compound": -0.2411
        },
        {
            "id": "hh947i0",
            "score": 1,
            "text": "Because anything less than complete demonization and not supporting blanket statements = love",
            "title_similarity": "0.39189857",
            "sentiment_compound": 0.4203
        },
        {
            "id": "hh94z3b",
            "score": 1,
            "text": "The system isn't broken, it's working exactly how they influenced it & designed it to be.",
            "title_similarity": "0.14347583",
            "sentiment_compound": 0.3724
        },
        {
            "id": "hh94zgm",
            "score": 1,
            "text": "Collective Stockholm's syndrome",
            "title_similarity": "0.17061089",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh96a3t",
            "score": 1,
            "text": "People should aspire to be like them but they in no way should worship them.",
            "title_similarity": "0.46362078",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hh99jjw",
            "score": 1,
            "text": "Take 1 billion and divide it by 100.\n\nThat's money most humans will never ever see. \n\nShame most billionaires and mega corps aren't even taxed enough. That money could have solved the planets entire infrastructure, resource distribution problems and waste management problems.\n\nPeople who oppose this probably think of it as something that would apply on them eventually but IMHO, anyone upper middle class and below shouldn't be and doesn't need to be taxed as aggressively like the mega rich should be in ordee to solve our problems.",
            "title_similarity": "0.75645554",
            "sentiment_compound": 0.3771
        },
        {
            "id": "hh9b2hb",
            "score": 1,
            "text": "I’m sorry, but who exactly loves billionaires?",
            "title_similarity": "0.6050501",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hh9gqoe",
            "score": 1,
            "text": "Dear Americans, as a Spanish friend, you don’t want socialism. Trust me, run from it.",
            "title_similarity": "0.62393",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hh9k3a8",
            "score": 1,
            "text": "Thank God there is still room for love in these polarized times.",
            "title_similarity": "0.18774252",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hh9q8k4",
            "score": 1,
            "text": "I'm trying to think of a lovable billionaire. \n\nOk now I'm trying to think of a likeable billionaire. \n\nOk now I'm trying to think of how a billionaire could become likeable. Maybe by giving away 90% of their money...",
            "title_similarity": "0.74349654",
            "sentiment_compound": 0.9413
        },
        {
            "id": "hh9unmk",
            "score": 1,
            "text": "Are we really that stupid?",
            "title_similarity": "0.29454654",
            "sentiment_compound": -0.5688
        },
        {
            "id": "hha7g9n",
            "score": 1,
            "text": "The problem remains that most Americans, regardless of actual income or prospect of inheritance, identify with the ultra-wealthy. They think that if they got the right break, or that stupid supervisor wasn't calling the shots, that would be them, owning Amazon or making electric cars and shooting rockets up. As such, they don't want anything bad like taxes happen to people who, let's face it, could be them in a few years. This illusion is immutable and impervious to reason. Hope has been turned into the fuel for the new ruling class, and don't you think they won't milk it for all that it's worth.",
            "title_similarity": "0.7959495",
            "sentiment_compound": 0.6935
        },
        {
            "id": "hhb2ym7",
            "score": 1,
            "text": "Yeah, bootlicker syndrome. And Reddit is full to bursting with men affected by it.",
            "title_similarity": "0.43213627",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hhb63wq",
            "score": 1,
            "text": "American’s stupidity prevents them from seeing reality…",
            "title_similarity": "0.55777967",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hhe4987",
            "score": 1,
            "text": "TIL Americans support billionaires? I do?",
            "title_similarity": "0.5920038",
            "sentiment_compound": 0.4696
        },
        {
            "id": "hhgvwxu",
            "score": 1,
            "text": "I think the title is a lil off. Should say \"people living in the USA are slightly brain washed into loving billionaires\" new study finds.",
            "title_similarity": "0.6841276",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hhz674s",
            "score": 1,
            "text": "Honestly it's not like taxing the rich is effective anyway. They just avoid it.",
            "title_similarity": "0.64712095",
            "sentiment_compound": 0.7499
        },
        {
            "id": "hkm8k7w",
            "score": 1,
            "text": "The way I see it, is that, I know for a fact that greedy billionaires will fight tooth and nail to not pay taxes by finding legal loopholes, etc., and in this unfair world, the rich and powerful usually get what they want. That being said, taxes still obviously have to be collected, and it's always the middle class that gets screwed. I feel bad for a lot of fellow millennials because they still believe that some legislators are altruistic enough to actually tax the wealthy, but that's not how the world works and likely will never be. Those legislators have just realized that there will always be a supportive group of constituents willing to vote for that cause. \n\nIt's actually genius, really. The problem will never get solved, so it's basically a lifetime guarantee of re-election.",
            "title_similarity": "0.8443903",
            "sentiment_compound": -0.5428
        },
        {
            "id": "hpxto05",
            "score": 1,
            "text": "I couldn’t agree more I’m so sick of the undeserved unearned adoration that many people give billionaires.",
            "title_similarity": "0.6552369",
            "sentiment_compound": 0.2093
        }
    ]
}