{
    "More than 99.9% of studies agree: Humans caused climate change\n": [
        {
            "id": "hh802nj",
            "score": 1,
            "text": "The article’s link is broken. Here is the original source paper: https://iopscience.iop.org/article/10.1088/1748-9326/ac2966\n\n###Abstract\nWhile controls over the Earth's climate system have undergone rigorous hypothesis-testing since the 1800s, questions over the scientific consensus of the role of human activities in modern climate change continue to arise in public settings. We update previous efforts to quantify the scientific consensus on climate change by searching the recent literature for papers sceptical of anthropogenic-caused global warming. From a dataset of 88125 climate-related papers published since 2012, when this question was last addressed comprehensively, we examine a randomized subset of 3000 such publications. We also use a second sample-weighted approach that was specifically biased with keywords to help identify any sceptical peer-reviewed papers in the whole dataset. We identify four sceptical papers out of the sub-set of 3000, as evidenced by abstracts that were rated as implicitly or explicitly sceptical of human-caused global warming. In our sample utilizing pre-identified sceptical keywords we found 28 papers that were implicitly or explicitly sceptical. We conclude with high statistical confidence that the scientific consensus on human-caused contemporary climate change—expressed as a proportion of the total publications—exceeds 99% in the peer reviewed scientific literature.",
            "title_similarity": "0.68442726",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hh7zsj7",
            "score": 13,
            "text": "But Joe Manchin doesn’t want to stop making easy money so we are all fucked.",
            "title_similarity": "0.26305586",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hh9jmd6",
            "score": 7,
            "text": "More misinformation. They agree that humans influenced it, not caused. Reported, let's see if any of the mods care about their own rules.",
            "title_similarity": "0.39511958",
            "sentiment_compound": 0.5221
        },
        {
            "id": "hh7rygg",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.13158122"
        },
        {
            "id": "hh877nd",
            "score": -87,
            "text": "Isn't that a little misleading? \n\nIsn't climate change is a natural process that the Earth has always been going through. Is that incorrect?\n\nI wouldn't doubt that our ignorance in the industrial era about environmental science, our sadly slow response to those issues once we were aware and corporations that focus on their bottom line more than the long term consequences of their practices, in some cases even actively deceiving people despite knowing full well about the impact their practice will have, has drastically accelerated the process of climate change. \n\nLikely to such an extreme degree that the changes in our environment will happen so suddenly as to cause catastrophic events.\n\nBut due to my, possibly mistaken, belief that climate change is a natural process that has always been happening I feel it's sort of sensationalist to claim that we \"*caused*\" climate change.\n\nAm I way off base here?",
            "title_similarity": "0.6095582",
            "sentiment_compound": -0.6304
        },
        {
            "id": "hh8ddkl",
            "score": 13,
            "text": "GOP: So your telling me there's a chance...",
            "title_similarity": "0.2794906",
            "sentiment_compound": 0.25
        },
        {
            "id": "hh89tke",
            "score": 6,
            "text": "The problem is, more than 50% of humans don't agree with science",
            "title_similarity": "0.44270346",
            "sentiment_compound": -0.5873
        },
        {
            "id": "hh7x2tr",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.13158122"
        },
        {
            "id": "hh7qkcw",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "0.13158122"
        },
        {
            "id": "hh8bxdx",
            "score": -14,
            "text": "WHO IS QUESTIONING THIS?????\n\nWhy did a study even need to happen. That’s been super clear since the 80s!",
            "title_similarity": "0.49949",
            "sentiment_compound": 0.7663
        },
        {
            "id": "hh81pqj",
            "score": -39,
            "text": "[removed]",
            "title_similarity": "0.13158122"
        },
        {
            "id": "hh7wo5e",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.13158122"
        },
        {
            "id": "hh7ye0i",
            "score": 21,
            "text": "I mean we know that but is quantity really the right measure? maybe quality and content should be the the primary way to judge scientific research",
            "title_similarity": "0.42323232",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8b7va",
            "score": 15,
            "text": "8 billion living creatures have a direct impact on their environment.\n\nWas never a controversial take. It was made\"controversial\" by science deniers",
            "title_similarity": "0.5565448",
            "sentiment_compound": -0.1301
        },
        {
            "id": "hh7zcvw",
            "score": 11,
            "text": "greed caused the climate change",
            "title_similarity": "0.5781692",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hh838hi",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "0.13158122"
        },
        {
            "id": "hh86sc5",
            "score": 4,
            "text": "So 0.01% of scientist still disagree then. I guess the science is still out on this one. We better wait until there is a consensus before we do anything.",
            "title_similarity": "0.48897305",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hh9wxy6",
            "score": -5,
            "text": "There was a time that 99.9% of scientists  believed the earth was flat.",
            "title_similarity": "0.7154319",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh870nq",
            "score": -121,
            "text": "I hate titles like this. What does that even mean? Climate change is a constant fact. Like gravity. Humans cannot *cause* gravity. It's a law. And we couldn't stop climate change if we tried. It's a condition of the planet.\n\nHave humans made it worse? Perhaps. So say *that*.",
            "title_similarity": "0.46881545",
            "sentiment_compound": -0.312
        },
        {
            "id": "hh8gw3r",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "0.14681393"
        },
        {
            "id": "hh85jtg",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.13158122"
        },
        {
            "id": "hh7zw3h",
            "score": 14,
            "text": "You think any of the people on the other side care? They have Facebook and YouTube videos. So there.",
            "title_similarity": "0.31821126",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hh7zvyw",
            "score": 20,
            "text": "I think that the contrarian opinions on this topic, just like the anti-vax movement, stem from a fundamental mistrust in authority/society/others.\n\nWe should address that concern and maybe help rational thought regain its credibility. Otherwise all this information will be dismissed by the anti-rational, by the mistrustful, as yet more propaganda.",
            "title_similarity": "0.32816052",
            "sentiment_compound": 0.4417
        },
        {
            "id": "hh7zlez",
            "score": 5,
            "text": "i would love to check out the .1% of studies that concluded otherwise. guessing a weird sample set or something",
            "title_similarity": "0.56577706",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hh7u82b",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.13158122"
        },
        {
            "id": "hh81y7n",
            "score": -44,
            "text": "[removed]",
            "title_similarity": "0.13158122"
        },
        {
            "id": "hh8ev2a",
            "score": -8,
            "text": "Reminder: it’s not a vote.\n\nScientists don’t vote on science.\n\nThey repeat experiments, or review the data, then they either concur or make corrections.\n\nWe like to talk percentages, but it’s a bit dangerous since it sounds like facts are opinions.\n\nIt’s not a vote.",
            "title_similarity": "0.3097903",
            "sentiment_compound": -0.0387
        },
        {
            "id": "hh7m7qj",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.13158122"
        },
        {
            "id": "hh859tp",
            "score": -20,
            "text": "Climate change happens naturally.  There is a ton of evidence of this.  The climate with change regardless if we like it or not and we are in a natural warming portion of the cycle.  This is why some people question our involvement.  However, it is not supposed to warm as fast as it is.  In the past 100 years or so it has warmed at a rate that would normally take thousands of years.  The natural cycle will still happen but we are giving a pretty strong offset.  An unnatural offset that lines up wit industrialization.  We need to stop thinking it is all of one and none of the other (thanks reality tv political system).",
            "title_similarity": "0.70428187",
            "sentiment_compound": 0.9571
        },
        {
            "id": "hh8hbf3",
            "score": 6,
            "text": "“Only 99%?! Well, the jury is still out!” - Republicans",
            "title_similarity": "0.49359417",
            "sentiment_compound": 0.3987
        },
        {
            "id": "hh84ftg",
            "score": -1,
            "text": "Can we past this stupid goal post?\n\nWe dont need anymore information about who is causing climate change as much as we meed collective action in addressing the problem.",
            "title_similarity": "0.4827034",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hh82s6c",
            "score": -35,
            "text": "Science isn’t about what humans agree upon. It’s about what the hard reproducible empirical data shows. Who cares what humans agree upon anyway. I want to know what the squirrels have to say about it",
            "title_similarity": "0.37020516",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hh7z8vi",
            "score": 68,
            "text": "I have a question about a detail of this. I completely agree with the general premise that human activity has massively influenced the climate, but one thing always bothers me a bit. Since climate has changed before humans have existed, it´s impossible for humans to cause ALL of climate change. \n\nIt might be by far the majority, or at least a very large part, but this generalization has always put me off. \n\nSo do we have an idea what the delta between \"regular\" climate change, and human caused climate change is?",
            "title_similarity": "0.6226514",
            "sentiment_compound": -0.0781
        },
        {
            "id": "hh7tmcr",
            "score": -41,
            "text": "[deleted]",
            "title_similarity": "0.14681393"
        },
        {
            "id": "hh7p2sp",
            "score": -33,
            "text": "[removed]",
            "title_similarity": "0.13158122"
        },
        {
            "id": "hh8d3kp",
            "score": 3,
            "text": "Dickheads; SeE, nOt AlL sCiEnTiStS aGrEe.",
            "title_similarity": "0.39906013",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hh8st7p",
            "score": -2,
            "text": "So your saying theres a strong chance its just a planetary cycle and not to be concerned... got it",
            "title_similarity": "0.42355883",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hhaxl3r",
            "score": 2,
            "text": "Weird that climate change happened over and over BEFORE humans even existed. Did you phrase that wrong?",
            "title_similarity": "0.5975017",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hh7qbtw",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh8708z",
            "score": 4,
            "text": "Hooray! \n\nTwelve thousand peer-reviewed articles, hundreds of thousands of hours of work, and presumably billions of dollars in funding to tell us what we knew almost 200 years ago!\n\nI wonder when we'll get around to doing something about it?",
            "title_similarity": "0.54100984",
            "sentiment_compound": 0.5972
        },
        {
            "id": "hh7vg6u",
            "score": 1054,
            "text": "If you don't believe in climate change by humans you don't believe/understand science.",
            "title_similarity": "0.4817157",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh84we3",
            "score": -2,
            "text": "stop figuring out who to blame and instead focus on a solution.",
            "title_similarity": "0.18139078",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hh8i6c3",
            "score": 2,
            "text": "Need an update to title to say the climate change we are experiencing right now is man made.\n\nToo easy for denialists to point to the title right here and point out the inaccuracy for more fodder.",
            "title_similarity": "0.63553095",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hh9ggh3",
            "score": -4,
            "text": "The argument isn't whether humans have had an impact on climate. That's not a debate. We did.\n\nThe earth's climate has changed drastically and rapidly in short periods of time before humans had an impact on it. Wether we can manipulate a planets climate into being stable seems  like a pipe dream green energy companies are selling you to make money. Now this doesn't mean go litter and deplete the earth resources. Still take care of it. Don't be stupid.\n\nThe great year. A complete cycle of the equinox. The 26,000 year cycle that ancient civilizations passed down to us. They felt it was important to make sure any future humans would know about it and track it. We are coming to the close of the 26k year cycle. Typically climate catastrophes occur around these times. 26k years ago the Wisconsin ice age started. 13k years ago the younger dryas climate catastrophes. Rapid rise in tempature and sea water that destroyed a lot of large mamals and believed to be what sunk Atlantis. The date Plato gives for Atlantis aligns with that time range. Atlantis aside. Ice core drilling has shown that drastic dynamic climate change has happened far more often then what was believed. We understand far less about this planet then we think we do. We probably can't stop one of these events from happening. But we can put in place a failsafe for our knowledge. Like the Egyptians did before us with the pyramids. Modern Humans have been on earth for at least 150k years. We somehow managed to survive well over a dozen species ending events since then. It just appears we may of lost some knowledge from the Civilizations that existed 12500+ years ago.",
            "title_similarity": "0.66221905",
            "sentiment_compound": 0.8815
        },
        {
            "id": "hh8r6jx",
            "score": 1,
            "text": "Fox headline: Study Shows Not All Scientists Agree Humans Caused Climate Change",
            "title_similarity": "0.6658078",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hha31r6",
            "score": 1,
            "text": "Consensus of published papers does not equate to consensus of scientists. Like the previous two studies of published papers, they did not account for the fact that a relatively small number of scientists write the vast majority of papers on the subject of climate change. Scientists who do not support anthropogenic global warming theory, or who have no opinion, do not write papers on the subject. Further, publications that have an editorial staff that supports AGW theory are reluctant to accept papers that contradict their beliefs. To say that there is no debate because they couldn't find it the scientific journals is like saying there is no debate about the Ten Commandments because we couldn't find any such debate in the Bible.\n\nNo credible statement can be made about the level of consensus among scientists without actually polling the scientists.",
            "title_similarity": "0.4682535",
            "sentiment_compound": -0.3309
        },
        {
            "id": "hh7xtik",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "0.13158122"
        },
        {
            "id": "hh82l1k",
            "score": -9,
            "text": "This is such a straw man. Moves the debate to the cause, rather than the actual effects that are happening and how to fix them.",
            "title_similarity": "0.24429739",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8y832",
            "score": -8,
            "text": "We didnt cause it, its a naturally occuring thing, we just sped it up to a dangerous speed",
            "title_similarity": "0.36384356",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hh7t9el",
            "score": -22,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh8b1x3",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh85iqi",
            "score": -35,
            "text": "Just like the elections where the favorite candidate gets 99.9% of the vote.",
            "title_similarity": "0.6925069",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hh8efpc",
            "score": 8,
            "text": "Does this mean we can all start the push to nuclear energy? That’s probably the cleanest way humans and control this situation.",
            "title_similarity": "0.52316195",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hh80a4f",
            "score": 59,
            "text": "Can someone help me understand/find the sources and data they used to come to this conclusion?\n\nI don't like that there isn't a stack of papers I can pull from to show that the study doesn't just say so.\n\n>We searched the Web of Science for English language ‘articles’ added between the dates of 2012 and November 2020 with the keywords ‘climate change’, ‘global climate change’ and ‘global warming’. C13 used the latter two phrases but not ‘climate change’ without the preceding ‘global’. (As discussed below, this was justified post-facto in our study because the majority of sceptical papers we found would not have been returned had we used the same search phrases as C13.) This wider set of search terms yielded a total of 88125 papers, whereas C13 identified a total of 11944 abstracts from papers published over the years 1991 and 2011.\n\nThey don't mention where to find this \"web of science\", it's not in the sources either.\n\nBasically I can't find their data.\n\nI think I found 3000 samples from their data, but that's not the 88000 they mention. https://iopscience.iop.org/article/10.1088/1748-9326/ac2966/data\n\nedit: Thank you very much, so it's a search engine? I don't think i can search it as a regular normal citizen though...",
            "title_similarity": "0.538983",
            "sentiment_compound": 0.6863
        },
        {
            "id": "hh7zkjy",
            "score": 28,
            "text": "I never understood why people so vehemently reject this notion. Even if they did it out of fear, they should fear that we *didn't* cause any climate change. If humans *cause* climate change, then we can reasonably assume that it's possible for us to undo what we've done. If humans did *not* cause climate change, then we cannot assume that we are capable of fixing the problems we're facing.\n\nIt is in our best interest going forward to believe that we have a measurable impact on the climate and that climate change is very real. If we assume that everything is fine and that we cannot change anything, then we will be in a world of trouble if we are proven incorrect. If we assume that catastrophe is imminent and that we must act now, then we will have a much cleaner and pleasant world to live on if proven incorrect. The latter seems like the safer bet.",
            "title_similarity": "0.46787146",
            "sentiment_compound": 0.1832
        },
        {
            "id": "hh8xslr",
            "score": -2,
            "text": "I believe in climate change, I just don't believe in politicians trying to claim we are all gonna die in 10 years.",
            "title_similarity": "0.5670556",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hhbmkdc",
            "score": 2,
            "text": "What a dumb title. Climate change occurs naturally. Be more specific with the part humans are effecting.",
            "title_similarity": "0.61737764",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hh81ti5",
            "score": -21,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh7twfn",
            "score": -17,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh7zu4k",
            "score": 17,
            "text": "Of course we're causing climate change (or causing it to be more rapid than otherwise may have been). But the question of whether to do something about it should remain basically the same as if it was not caused by us. If rapid climate change was naturally caused, we'd still have to adapt our production of food and how we live, where we live, and many things about our and other creatures situation on Earth. If there was no human cause to climate change, it may still be worth finding ways to extract co2 from the atmosphere, either to keep things the same or to ease the transition into new climate circumstances.",
            "title_similarity": "0.54899",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hh84vhg",
            "score": -3,
            "text": "Sure but the conditions of this planet created humans.",
            "title_similarity": "0.51181686",
            "sentiment_compound": 0.4854
        },
        {
            "id": "hh872qu",
            "score": 3,
            "text": "It’s cool how we are still arguing over who have the bad directions while diving straight at a concrete wall.",
            "title_similarity": "0.28134978",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hh8fu5h",
            "score": -3,
            "text": "“Humans” ....more like corporations",
            "title_similarity": "0.45569062",
            "sentiment_compound": 0.4201
        },
        {
            "id": "hh7mgg6",
            "score": 28,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh8hvbw",
            "score": 12,
            "text": "An important reminder: there is no scientific alternative to human induced climate change. None. No one has proposed a testable alternative. Whatever skeptics there may be running around, none of them will voice an alternate theory. There is no on going scientific debate.",
            "title_similarity": "0.27426445",
            "sentiment_compound": -0.276
        },
        {
            "id": "hh803dw",
            "score": -30,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh80uc5",
            "score": 1,
            "text": "WHAT?!\n\nHow can that be?!?!",
            "title_similarity": "0.15316889",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh867yl",
            "score": 0,
            "text": "Yeah but what about that 0.1%? I choose to believe them.",
            "title_similarity": "0.43912172",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hh91yo6",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh96n2u",
            "score": 0,
            "text": "This article seems to be an algorithms statistical use of keywords in public, peer reviewed opinions.",
            "title_similarity": "0.4214465",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh99cmj",
            "score": 0,
            "text": "Well when human hit the J-curve. Just breathing causes CO2...\n\nSo merely humans breathing causes climate change.\n\nSo it should be 100%.\n\nKilling off amazon forests and polluting ocean's phytoplankton doesn't help either...",
            "title_similarity": "0.60641754",
            "sentiment_compound": -0.5938
        },
        {
            "id": "hh9trcd",
            "score": 0,
            "text": "okay but cows helped. those jerks. their farting!",
            "title_similarity": "0.23542106",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hh9uylm",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hha6j2h",
            "score": 0,
            "text": "What to the other .1% of the studies say? That it is natural?",
            "title_similarity": "0.62127376",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hhacsfa",
            "score": 0,
            "text": "It was never a question of whether we caused some of the climate change, just that how much of it was our doing. And how much change can we make to the ever changing climate with our actions.",
            "title_similarity": "0.536358",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhah1qf",
            "score": 0,
            "text": "Name one conclusive study and one accurate model made based on that understanding!  Crickets…",
            "title_similarity": "0.35735598",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhaktw5",
            "score": 0,
            "text": "“2104 of the studies held no position”\n\nExplicit endorsement with quantification (Explicitly states that humans are the primary cause of recent global warm- ing) : 19\n\nExplicit endorsement without quantification (Explicitly states humans are causing global warming or refers to anthropo- genic global warming/climate change as a known fact): 412\nImplicit endorsement (Implies humans are causing global warming. e.g. research assumes green- house gas emissions cause warming without explicitly stating humans are\nthe cause): 460\n\n\nI fully agree human activities are a major factor of climate change. But it takes some mind juggle to say it’s a 99% consensus from this survey.",
            "title_similarity": "0.7053831",
            "sentiment_compound": 0.6805
        },
        {
            "id": "hhazhpe",
            "score": 0,
            "text": "Humans got rid of the ice age ?!?! The climate is always at a constant change. Humans are believed to be accelerating climate change not causing it.",
            "title_similarity": "0.64582884",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhb42dh",
            "score": 0,
            "text": "The title reads like an advertisement.",
            "title_similarity": "0.3038755",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hhbf91m",
            "score": 0,
            "text": "Humans probably are the primary causes of climate change. But this is based solely on climate models that are known the best flawed. The reason we can’t predict the weather more than a week out is because the errors compound each other until the data is unreliable. Saying that humans indisputably cause climate change is simply false and gives Climate deniers ammo like when people say vaccines carry no risks. The best science we have says humans are the primary cause, but it’s not very good science.\n\nThe “butterfly effect” where a butterfly flapping its wings has a cascade effect that changes the weather ended up being a result of poor climate modeling. Our models have vastly improved since the 60’s, but they are still far from perfect.",
            "title_similarity": "0.59131515",
            "sentiment_compound": 0.8954
        },
        {
            "id": "hhbfv8g",
            "score": 0,
            "text": "Climate change caused humans. Do yourself some research fool.",
            "title_similarity": "0.637632",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hh7ueh3",
            "score": 185,
            "text": "I feel like the metric \"x% of studies\" is a really bad way of looking at scientific research, but if you have no time to actually look in depth at who's funding what for each study, that's what we're down to.",
            "title_similarity": "0.44238222",
            "sentiment_compound": -0.5341
        },
        {
            "id": "hh7nvmp",
            "score": 52,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh7p7zb",
            "score": -35,
            "text": "[removed]",
            "title_similarity": "0.13158122"
        },
        {
            "id": "hh8j8xs",
            "score": -4,
            "text": "So did dinosaurs cause the last ice age or something?",
            "title_similarity": "0.5071819",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8rm3c",
            "score": 4,
            "text": "The other 0.1% were conducted by the same dentist that would not recommend Trident Toothpaste.",
            "title_similarity": "0.4062583",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hh8fdrk",
            "score": -7,
            "text": "A reminder: History won't distinguish between those who denied the science of climate change, and those who believed it but did nothing.\n\nPlease go vegan.\n\n/r/PlantBased4ThePlanet is a good place to start.",
            "title_similarity": "0.42607975",
            "sentiment_compound": 0.1172
        },
        {
            "id": "hh7lmw5",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.3860966",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hh841fb",
            "score": 1,
            "text": "Scientist here, I usually like to prefer to say humans have \"greatly accelerated\" And \"exaggerated' or \"alterated\" what was supposed to be way more tame, in fact we should be heading to a glaciation! \nBut we have altered the process so much we got it at the verge of a not return point, I have done simulations in my last year of environmental sciences about the atmospheric equilibrium and if we don't do something to stop the temperature increase soon, the last of our worries will be the ice melting.",
            "title_similarity": "0.58000684",
            "sentiment_compound": -0.5305
        },
        {
            "id": "hh86xqr",
            "score": 1,
            "text": "It’s good to believe science as a whole and not from single studies",
            "title_similarity": "0.36216316",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hh8af60",
            "score": 1,
            "text": "Honest Question- What is causing climate change on a molecular level?",
            "title_similarity": "0.67087054",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hh8b7g2",
            "score": -1,
            "text": "Yeah, maybe, but have you seen this study on Facebook that says we didn't? I'm gonna believe that one thanks, its got names I've heard of on the written by list, such as Shell and BP",
            "title_similarity": "0.46749812",
            "sentiment_compound": 0.6652
        },
        {
            "id": "hh8fdo5",
            "score": 1,
            "text": "0.1% are paid for by the oil industry",
            "title_similarity": "0.52589834",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8fi76",
            "score": 1,
            "text": "The .1 was probably from the My Pillow guy.",
            "title_similarity": "0.32344532",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8gem6",
            "score": -1,
            "text": "Instead of telling me that they agree it exists how bout the percentage of what we’re doing in context to the overall change (natural and manmade)",
            "title_similarity": "0.55465984",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hh8hb4d",
            "score": 1,
            "text": "But did these studies Do ThEiR oWN rEAseArCH?",
            "title_similarity": "0.25215644",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8i5hm",
            "score": 1,
            "text": "And 100% of right wing politicians and pundits will continue to say it’s a hoax.",
            "title_similarity": "0.5422586",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hh8k1jy",
            "score": -1,
            "text": "The more billions we add the finer the balance and tighter the tolerances needed to maintain it.   \nCome up with a sane plan - short of global war - to reduce the number of people or be prepared for more and more 'rules'.",
            "title_similarity": "0.48433006",
            "sentiment_compound": -0.34
        },
        {
            "id": "hh8lobx",
            "score": 1,
            "text": "Well yeah...old news. Oh, you mean some people still don't want to accept that? Not sure how 1 more headline is going to change those minds!",
            "title_similarity": "0.41803682",
            "sentiment_compound": -0.3736
        },
        {
            "id": "hh8lq0l",
            "score": -1,
            "text": "This doesn't really surprise me.  I can't really think of anyone I have talked to that would say that humans don't have an impact on the Earth's climate.\n\nEven people that you might consider \"climate change skeptics\" or whatever title we might use... Still acknowledge that humans have an impact.\n\nThe discussion is more around how *much* of an impact, how much climate would have changed without human existence, and probably most importantly, how much would it change if humans *did* exist, but we used 100% green energy sources.\n\nOn those topics, the opinions of experts get much more nuanced than 99.9%.\n\nFor that reason, this survey of studies seems to intentionally sidestep those discussions to tackle a straw man of sorts.   It's very difficult to find someone that claims that humans have no impact on our climate.  So this conclusion is kind of preaching to the choir.",
            "title_similarity": "0.6240262",
            "sentiment_compound": -0.5801
        },
        {
            "id": "hh8n3l6",
            "score": 1,
            "text": "\"So scientist do not fully agree? We can't act on something so uncertain.\"",
            "title_similarity": "0.28934374",
            "sentiment_compound": -0.6361
        },
        {
            "id": "hh8t1md",
            "score": 1,
            "text": "So it wasn't elephant farts and rhino sneezes?",
            "title_similarity": "0.28825796",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8v37o",
            "score": 1,
            "text": "Westerners caused it by industrialization and destroying marine life.",
            "title_similarity": "0.4650811",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hh8v9w5",
            "score": 1,
            "text": "I have a feeling the world's richest people are messing around with space exploration because they know this planet will not last as it is, in the future.",
            "title_similarity": "0.42005318",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hh8y1pl",
            "score": -1,
            "text": "We are an inherently destructive species.",
            "title_similarity": "0.26484054",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hh8z62q",
            "score": 1,
            "text": "Climate Change Deniers: “See!! That just proves it’s a conspiracy!!”",
            "title_similarity": "0.56169754",
            "sentiment_compound": -0.5053
        },
        {
            "id": "hh92hsm",
            "score": 1,
            "text": "But wait, the .01% is worth talking about, a lot, like all the time.  In fact...let's focus on it right now.  We need interviews, meetings, a movement, can we get some outrage in here!?!? STAT!!!",
            "title_similarity": "0.5369402",
            "sentiment_compound": 0.3975
        },
        {
            "id": "hh945xq",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh945yr",
            "score": -1,
            "text": "so only 4 studies took the stance that humans did not cause climate change, which in turn automatically means the other couple of thousand agree that humans caused it ? I’m not saying this study is wrong but it is a little misleading",
            "title_similarity": "0.52250624",
            "sentiment_compound": -0.5284
        },
        {
            "id": "hh94m42",
            "score": 1,
            "text": "Frankly I don’t understand how “human impact” is still a debate.\n\nWhy do the people who argue against this blatant fact also ironically seem to (on average) believe in an incorporeal, omniscient man in the sky who controls their lives? It’s like, okay, well, climate change is most certainly corporeal - you can literally point to the physical natural damage we’ve done - and yet they refuse to believe that’s their fault? While simultaneously believing that they’ll go to Heaven after death? I will never understand.",
            "title_similarity": "0.427445",
            "sentiment_compound": -0.2375
        },
        {
            "id": "hh94xxa",
            "score": 1,
            "text": "Good luck convincing China and India",
            "title_similarity": "0.2990243",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hh97vl6",
            "score": 1,
            "text": "*accelerated climate change. Climate change was already happening since way before the industrial revolution. It's just gotten way worse, way faster than it likely ever would naturally.",
            "title_similarity": "0.6433877",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hh9glyf",
            "score": -1,
            "text": "1400: More than 99.9% of studies agree god created the earth. \n\n(I believe in climate change I'm just making a joke)",
            "title_similarity": "0.82380867",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hh9igsd",
            "score": -1,
            "text": "The biggest climate  change that EVER occurred is the transformation of altmospheric air from mostly Sulfur to Nitrogen/Oxygen. We can thank the algae for it's waste product:oxygen. Even though Oxygen was toxic to algae, they continued to over populate and free oxygen was released.\n\nWe would not be here if not for this climate change...",
            "title_similarity": "0.5738482",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hh9n3j2",
            "score": -1,
            "text": "Misleading title. The every study has unanimously agreed humans effected climate change. The earth goes through natural cooling and heating cycles. Regardless of humans we were currently exiting a mini ice age and moving towards a warmer planet, nothing we did created or caused it. What humans did was accelerated it, the acceleration is a compound not addition meaning if over 2 years humans push climate change from a base of 100% to 101%, and the next 2 years increase it by 1 again it's now 102.1% faster, and compounding.  Those are the actual facts (not the actual percentages just for example) however the real big factor in my opinion is waste, plastic waste in 100 years at our current pace will be far more damaging than climate change ever will be to the planet because at least climate change is somewhat natural.",
            "title_similarity": "0.691532",
            "sentiment_compound": -0.5149
        },
        {
            "id": "hh9p119",
            "score": -1,
            "text": "Were all these studies conducted by HUMANS? Seems a little biased to me...???",
            "title_similarity": "0.39990574",
            "sentiment_compound": -0.4151
        },
        {
            "id": "hh9puj9",
            "score": -1,
            "text": "Too bad studies aren’t public opinions, eh scientists?",
            "title_similarity": "0.33306697",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hh9qagm",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.14681391"
        },
        {
            "id": "hh9tuxg",
            "score": 1,
            "text": "There's people who thought we *didn't* cause climate change??",
            "title_similarity": "0.61906",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9ukn5",
            "score": 1,
            "text": "Are we still discussing this? Historians in the year 2500 will be laughing all the way to the next Hunter gatherer settlement",
            "title_similarity": "0.45509273",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hh9xv80",
            "score": -1,
            "text": "Just white American males or was it all humans ?",
            "title_similarity": "0.3867677",
            "sentiment_compound": 0.0
        },
        {
            "id": "hha0a3g",
            "score": -1,
            "text": "This sub loves posting articles with just bad methodologies.  \n\nWhile the consensus is absolutely that CC is manmade (a conclusion I absolutely agree with, my expertise being in climate policy), this is really junk science meant to facilitate a certain outcome and should not have passed peer review.\n\nThe reason being?  Tons of climate articles dont address the actual cause behind CC because that's not how articles work.  So saying 4/3000 climate articles questioned the manmade nature, therefore the other 2400 articles agree that it's manmade is absolute bunk.\n\n\n(Again, the conclusion here isn't wrong in a meaningful way, but this should go to show people that peer review isnt an absolute guarantee for quality.)",
            "title_similarity": "0.5094007",
            "sentiment_compound": 0.5289
        },
        {
            "id": "hha0lew",
            "score": -1,
            "text": "I believe in climate change but I also think if there was data disproving it people would think twice before publishing it. Science is politicized now like it or not.",
            "title_similarity": "0.61577415",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hha16cl",
            "score": -1,
            "text": "It's kind of weird because these same scientist are the ones that predicted on ice age was coming on at one time well that never happened the whole climate thing is to try to start a new industry and people aren't buying it",
            "title_similarity": "0.50340855",
            "sentiment_compound": 0.0276
        },
        {
            "id": "hha4olp",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hha7tnv",
            "score": -1,
            "text": "Really 99.9 we damage the earth in 300 yes when sciencetist said it was here for billions of years fansinating.",
            "title_similarity": "0.63779116",
            "sentiment_compound": -0.1935
        },
        {
            "id": "hhabjlc",
            "score": -1,
            "text": "The Dark Ages were actually dark due to the ash spewed into the atmosphere with the eruption of Krakatoa volcano.  Why did humans do this? 99%... in your dreams cupcake",
            "title_similarity": "0.5595696",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hhafl3x",
            "score": -1,
            "text": "Science isn’t based on consensus. Politics is.",
            "title_similarity": "0.2530606",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhah5tk",
            "score": -1,
            "text": "So the climate never changed until humans walked the earth?",
            "title_similarity": "0.42859936",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhahv1d",
            "score": -1,
            "text": "So both main ice ages were caused by a tiny population of Stone Age people living in caves...how? And the previous 5 mass extinctions caused by climate upheaval *prior to human evolution*...also caused by humans? Seeing as changes to climate are only caused by human industry??\n'Once science became political, it became another branch of politics'",
            "title_similarity": "0.56044346",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhahzh4",
            "score": -1,
            "text": "Is this gonna be like those “11,000 scientists agree” survey where less than 50 were actually qualified to even have an opinion on the subject?\n\nOr like that other survey where the answers were practically  “global warming is 100% not caused by man” or “it’s likely that man could be contributing”?",
            "title_similarity": "0.6511273",
            "sentiment_compound": 0.7149
        },
        {
            "id": "hhaiidy",
            "score": -1,
            "text": "All 5% of it. \nThe recent forest fires released more carbon into the atmosphere than all of human history combined.",
            "title_similarity": "0.56767064",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhajlos",
            "score": -1,
            "text": "Did humans cause things to warm up in the 800s AD and get cold abruptly in the 1400s?\nWhat caused and then ended the Little Ice Age said to prevail 1400-1800s?\n\nGranted humans may be making a natural warming worse - can there be two causes?",
            "title_similarity": "0.63856584",
            "sentiment_compound": 0.533
        },
        {
            "id": "hharpht",
            "score": -1,
            "text": "Ummmmm that is still not 100%.",
            "title_similarity": "0.17670776",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhavbyd",
            "score": 1,
            "text": "Anyone with a brain knows the climate never changed before the 1900's",
            "title_similarity": "0.47715145",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhaw7q4",
            "score": -1,
            "text": "It’s true, there was no change in the climate before humans. Also pollution has nothing to do with it.",
            "title_similarity": "0.36137843",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hhaytfr",
            "score": -1,
            "text": "Don't see anyone presenting evidence of human-caused climate change. That's odd.",
            "title_similarity": "0.34802616",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hhb0mpj",
            "score": -1,
            "text": "I want to meet the .1% that think it wasn't.  Volcanos are definitely a big part...",
            "title_similarity": "0.59839356",
            "sentiment_compound": -0.2401
        },
        {
            "id": "hhb26mz",
            "score": -1,
            "text": "So what. doesn't change anything now",
            "title_similarity": "0.14391173",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhbaj6a",
            "score": -1,
            "text": "*99% of the paid studies done by the government agree",
            "title_similarity": "0.69494975",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hhbbgx6",
            "score": -1,
            "text": "Since when did consensus become the basis for science?\n\nIf the studies are funded by organizations looking for climate change, then they’ll find it every time.  It’s about the gravy train.",
            "title_similarity": "0.6990633",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7u8lj",
            "score": 685,
            "text": "I guess one would be out of touch to deny it at this point",
            "title_similarity": "0.13890338",
            "sentiment_compound": -0.34
        },
        {
            "id": "hh8244c",
            "score": -7,
            "text": "More than 99.9% percent of studies are performed by humans. Coincidence ? I think not. Studies cause global warming",
            "title_similarity": "0.88989526",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hhagr3g",
            "score": 13,
            "text": "Also gravity exists & cigarettes cause cancer.  Why are we bothering with this anymore?  There are only 2 types of climate change deniers left alive.\n\n1. The dumbest people on the planet & they don't matter.\n\n2. Evil capitalists who make their money by doing climate change, & nerds talking about facts isn't gonna stop them.",
            "title_similarity": "0.50037193",
            "sentiment_compound": -0.6673
        },
        {
            "id": "hh7mrtc",
            "score": 186,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh82ptk",
            "score": 61,
            "text": "The only scientific body that retained the position against anthropogenic climate change was the American Association of Petroleum Geologists. In 2007 they officially changed their postion, but it was just posturing.\n\nMy whole family and their friends are high up in the industry and they still maintain their views. Most recent argument I heard was the modeling. These proffessionals have spent their entire careers studying and working within and around models, yet they still try the debunked \"bad data in=bad data out.",
            "title_similarity": "0.5269349",
            "sentiment_compound": -0.639
        },
        {
            "id": "hh7zbl8",
            "score": -7,
            "text": "More than 99.9% that’s called 100%",
            "title_similarity": "0.6509101",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh7y585",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh81jji",
            "score": 2,
            "text": "And also:\n\n> the top three climate-change-doubting countries are all English-speaking: the U.S., Great Britain, and Australia, in that order.  Canada comes in at number seven, after Russia, Poland, and Japan. \n\nhttps://www.sierraclub.org/sierra/2014-4-july-august/green-life/language-problem",
            "title_similarity": "0.5930126",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hh82jx6",
            "score": -2,
            "text": "Past tense? Did we fix it already?\n\nEdit: jeez people I'm being facetious about the title.",
            "title_similarity": "0.38743496",
            "sentiment_compound": -0.4137
        },
        {
            "id": "hh836lv",
            "score": 2,
            "text": "When a meta study like this is done, is it done in peer reviewed papers or all regardless of their peer review status?\n\nIf it's the latter, aren't meta studies like this problematic? I'm not questioning climate change by the way, simply wondering about how meta studies on research papers is done.",
            "title_similarity": "0.47384495",
            "sentiment_compound": -0.4676
        },
        {
            "id": "hh84896",
            "score": 2,
            "text": "If COVID has taught us anything, it's that humanity will ride the climate change disaster train right to the end of the line, and do so fiercely declaring we're headed to Disneyland.",
            "title_similarity": "0.5427663",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hh848cm",
            "score": -2,
            "text": "Here is what i tell climate change deniers. humans ACCELERATED climate change. Climate change always has and always will happen. We just gave it a nudge, or more like a push.",
            "title_similarity": "0.6815567",
            "sentiment_compound": 0.1761
        },
        {
            "id": "hh875t0",
            "score": 2,
            "text": "I don't think most people who deny it at this point care at all what science says, unfortunately",
            "title_similarity": "0.4139662",
            "sentiment_compound": -0.2177
        },
        {
            "id": "hh87mbp",
            "score": -2,
            "text": "So stop farting out kids ffs!",
            "title_similarity": "0.21336806",
            "sentiment_compound": -0.7639
        },
        {
            "id": "hh87n32",
            "score": -2,
            "text": "Well if our winters are getting warmer within the Northern Hemisphere we won't have to have our heating on as much, so the bills will hopefully be less due to this.\n\nOne positive from a negative situation.",
            "title_similarity": "0.48778585",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hh87tvp",
            "score": -2,
            "text": "We almost always learn more about things later that tend to change whatever current science was thinking. I'm not denying human's part in all this, but I also feel saying its ALL OUR FAULT is like saying the other planets and the sun revolve around us... We're heading for another ice age, not an oven. [Heinrich event](https://www.sciencedirect.com/topics/earth-and-planetary-sciences/heinrich-event)",
            "title_similarity": "0.52541995",
            "sentiment_compound": -0.2219
        },
        {
            "id": "hh89m4z",
            "score": -2,
            "text": "This makes the 0.01% of studies very valuable. We need more of those.",
            "title_similarity": "0.5478823",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hh8aest",
            "score": -2,
            "text": "I think what often happens, and why I think topics like this can be slightly misleading, is use of verbiage.\n\nDid human create climate change? No. Did humans accelerate the speed at which said natural climate change occurs? That’s irrefutable and that’s what these studies say. They all conclude that “man has contributed to global climate change”.\n\nIt is worth noting that many of these studies vary on what the severity of that contribution is. Some say we can’t reverse where it is and some say we can etc.",
            "title_similarity": "0.68789005",
            "sentiment_compound": 0.7143
        },
        {
            "id": "hh8al5e",
            "score": -2,
            "text": "Well, there still 0.1% which doesn't agree, so there's no Climate Change",
            "title_similarity": "0.45325732",
            "sentiment_compound": -0.3587
        },
        {
            "id": "hh8avtv",
            "score": -2,
            "text": "We're on a rock in a bubble being dragged through space behind a gigantic flaming ball of gas. Humans may have contributed to our current situation but Earth isn't a controlled stable place.",
            "title_similarity": "0.35884672",
            "sentiment_compound": -0.3468
        },
        {
            "id": "hh8b2z3",
            "score": -2,
            "text": "Why are we debating who caused global warming? What's the point of doing that? \n\nIt makes so much more sense to discuss and plan for how we adapt to the massive changes that are coming.",
            "title_similarity": "0.59341145",
            "sentiment_compound": 0.2406
        },
        {
            "id": "hh8bi05",
            "score": -2,
            "text": "More than 99.9% of politicians agree: human cattle need more taxes imposed through bribery of ‘scientific’ studies that conclude their way of life causes natural climate change.",
            "title_similarity": "0.63300633",
            "sentiment_compound": 0.5302
        },
        {
            "id": "hh8dn4f",
            "score": -2,
            "text": "OK, now send this article to China and India and get them with the program. Changes in North America and Europe alone will not make much of a difference.",
            "title_similarity": "0.3795043",
            "sentiment_compound": -0.25
        },
        {
            "id": "hh8eee7",
            "score": 2,
            "text": "Hopefully this thing doesn’t change that.",
            "title_similarity": "0.14736035",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hh8ewqi",
            "score": 2,
            "text": "Climate change is natural.. but naturally it occurs over tens of thousands of years! There’s no doubt we’re causing this radical change peeps.",
            "title_similarity": "0.72105616",
            "sentiment_compound": 0.5729
        },
        {
            "id": "hh8fx2d",
            "score": 2,
            "text": "Obviously they did not have Facebook to get the truth.",
            "title_similarity": "0.19645093",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hh8gzhe",
            "score": -2,
            "text": "What about cow farts? Can't we blame the cows, how dare they...",
            "title_similarity": "0.25097612",
            "sentiment_compound": 0.2584
        },
        {
            "id": "hh8h14t",
            "score": -2,
            "text": "I agree humans are negatively impacting climate change.    But the climate was already changing as we come out of our 5th ice age.   Much of the US was under ice roughly 15k years ago.   The Sahara desert did not exist when the pyramids were built.    But I get that bending the truth for the collective good is probably ok.   My point is that we did not cause climate change but we sure are making it worse.",
            "title_similarity": "0.6079122",
            "sentiment_compound": 0.7469
        },
        {
            "id": "hh8i7qb",
            "score": 2,
            "text": "And still people will believe that 0.1%",
            "title_similarity": "0.45412958",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8icjh",
            "score": -2,
            "text": "Echo chambers… echo chambers everywhere",
            "title_similarity": "0.26685187",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8jsv7",
            "score": -2,
            "text": "the predicted big freeze, were humans the cause too?\nPeople who believe this claim, dismiss the claim regarding the corrupted models of classical electrodynamics (regarding the vector potential, proven to be real in QED, killed in CED), while it has been  clearly shown what is wrong, but they are fixing it, then everyone will say they knew it all along.",
            "title_similarity": "0.51773566",
            "sentiment_compound": -0.431
        },
        {
            "id": "hh8kav9",
            "score": -2,
            "text": "Everyone, yes everyone, already knows this. To what extent though? 1%? 100%? Somewhere between? And what, I’d anything, can be done about it? This is where disagreements come from.",
            "title_similarity": "0.49131882",
            "sentiment_compound": -0.264
        },
        {
            "id": "hh8klp8",
            "score": -2,
            "text": "Seriously, the climate changed during the dinosaur age, pretty extensively, explain that?  I'm waiting...\n\nStill waiting...",
            "title_similarity": "0.55820113",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh8ksq1",
            "score": 2,
            "text": "Humans are responsible for all worlds horrors!!",
            "title_similarity": "0.40271837",
            "sentiment_compound": -0.4559
        },
        {
            "id": "hh8kuvi",
            "score": 2,
            "text": "Nothing can be proven to those who have an interest in not believing.",
            "title_similarity": "0.13194373",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hh8lz8y",
            "score": -2,
            "text": "Ha, when I see peer reviewed and the words \"it's pretty much case closed for public debate\" then I know it's BS.",
            "title_similarity": "0.39434722",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hh8mhf5",
            "score": 2,
            "text": "Climate change deniers see this as 0.01% they’re right.",
            "title_similarity": "0.664607",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hh8mig9",
            "score": -2,
            "text": "thats an entirely meaningless percentage, because its not about quantity.\n\nIts about the quality. 1 single study that proves this is all that matters. \n\noh wait im on the r/science sub, we dont do critical thinking here",
            "title_similarity": "0.3575413",
            "sentiment_compound": -0.2803
        },
        {
            "id": "hh8n2g5",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.14681391"
        },
        {
            "id": "hh8oeyz",
            "score": -2,
            "text": "Humans caused human-made climate change. Extremely important distinction, as to claim that climate does not change without humans is extremely easily debunked.",
            "title_similarity": "0.61371225",
            "sentiment_compound": 0.584
        },
        {
            "id": "hh8pd5y",
            "score": 2,
            "text": "And the 00.1% that don't agree get nice paychecks from the fossil fuel industry.",
            "title_similarity": "0.52128565",
            "sentiment_compound": -0.5334
        },
        {
            "id": "hh8pdz9",
            "score": -2,
            "text": "‘Anthropogenic climate change’ \n\nHard to compare what’s happening now to the climatic changes of the lesser dryas for example",
            "title_similarity": "0.5275183",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hh8shdf",
            "score": -2,
            "text": "Wouldn't it be more correct to state our influence has been speeding up climate change? Our planet has undergone several ice ages, every ice age is the result of a global warming preceding it. It's the cycle of our planet. On the whole timeline of our planet, humans are only a dot. \n\nGlobal warming would have happened regardless, the fact that we're speeding things up can't and shouldn't be denied, but claiming that we can prevent it is also wrong in my opinion. At best we can prolong our existence a handful of generations, but nature will move on and recover. We will not. \n\nWe're so elitist, wanting to save and preserve, so many life forms and plants have come before us and died, so many will come after us and die. Maybe the earth will end up a barren rock, maybe not, but our influence is so minimal, so futile. To state we caused it is just us wanting to be more important than we are. \n\nI believe the climate change is real, it can't be denied, I don't believe it wouldn't have happened anyways. This is the longest period between ice ages our planet has seen, and we're long overdue one anyways. \n\nSo go about your lives, recycle, don't waste water, walk those 2 km instead of taking the car, be mindful, buy local grown produce to reduce your carbon footprint, eat less meat, don't leave trash lingering (pick up one piece a day, even if it isn't yours and throw it in the bin), don't throw your cigarette butts on the ground, do all of those things and remember that it are big companies that should take steps and bare responsibility as well. Most of them never will.",
            "title_similarity": "0.6555703",
            "sentiment_compound": 0.1949
        },
        {
            "id": "hh8snmu",
            "score": -2,
            "text": "Ok but what about that .01%? That's where the real science happened",
            "title_similarity": "0.6405479",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hh8t4bh",
            "score": 2,
            "text": "Oil companies: \"See! It's not 100% and therefor it means nothing, you are the problem not us\"",
            "title_similarity": "0.39276928",
            "sentiment_compound": -0.4574
        },
        {
            "id": "hh8utut",
            "score": -2,
            "text": "Ehhh yeah.... so what. We can't stop multi billion dollar corporations. They have more weight than all the activists in the world combined.\n\nYou guys should be happy the climate is warming and not cooling. According to Ice cores from Greenland, in the past 180,000 years: On average about every 2-4 thousand years there was a huge climate shift, either a melt down or a freezing event. The longest inter-glacial period ever recorded is the one we are in now called the Holocene which is about 12,000 years long. We are more than double the average time it would normally take for the next average dated ice age to occur. \n\nAnd when you go back into history and look at the world every time we had a small \"cooling period\" You would then realize maybe a warmer climate isn't such a bad thing.... even as unnatural as it is....\n\nBlack plague? Coincided with a global 10 degree cooling period. \nDark Ages? Coincided with a global 10 degree cooling period.",
            "title_similarity": "0.6966461",
            "sentiment_compound": 0.9287
        },
        {
            "id": "hh8va1c",
            "score": -2,
            "text": "The title if this post is misleading or just a purposeful lie maybe. The climate has been changing for millennia without any human input.   And will continue to do so long after humans are extinct",
            "title_similarity": "0.5006621",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hh8wzsw",
            "score": -2,
            "text": "Ok, now that we know the answer from today, what clues do we have to the myraid of climate changes as evident by our fossil records before man?",
            "title_similarity": "0.60125446",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8xf0z",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.14681391"
        },
        {
            "id": "hh951vx",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh952yc",
            "score": -2,
            "text": "Kinda misleading title or premise imo. Humans contribute to climate change",
            "title_similarity": "0.64806116",
            "sentiment_compound": -0.3415
        },
        {
            "id": "hh9mfvi",
            "score": 2,
            "text": "Right wingers and conspiracy nuts :\n\n#only 0.01% of scientists can be trusted to tell the truth about climate change!",
            "title_similarity": "0.65016174",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hh9yt24",
            "score": -2,
            "text": "That's a number when you poll studies from a journal that explicitly excludes studies observing solar forcing and our ONGOING magnetic excursion. Though we are killing are planet, it was going to try to kill us regardless of our pollution. When the sirens sound don't believe for a second you deserved it.",
            "title_similarity": "0.43236327",
            "sentiment_compound": -0.8689
        },
        {
            "id": "hhb945e",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh7xs79",
            "score": -10,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh81unt",
            "score": 778,
            "text": "We need to make the breakdown of corporate vs personal now. So tired of being told I need to conserve when businesses ruin the planet.",
            "title_similarity": "0.39160252",
            "sentiment_compound": -0.8196
        },
        {
            "id": "hh7nno6",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh82d4g",
            "score": -2,
            "text": "Study says studies are right.",
            "title_similarity": "0.31864914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh84exj",
            "score": -3,
            "text": "More than the sun? I'm sure we have an impact, but doubt that it's the sole cause or even the main one.",
            "title_similarity": "0.39959013",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hh85f5b",
            "score": 2,
            "text": "Yeah I get it that humans caused climate change - but what are you gonna do, remove the humans?",
            "title_similarity": "0.6156652",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hh85fu1",
            "score": -2,
            "text": "I would imagine this is correct... the amount of money being poured into climate research which supports man made climate is probably in the trillions globally at this point. I too would make sure that my math supported the only way I get to keep eating.",
            "title_similarity": "0.62542695",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hh88bnr",
            "score": -3,
            "text": "All of our technology produces heat.\n\nAll of our manufacturing produces heat.\n\nOur replacement of natural landscapes with concrete and asphalt structures and roads produces heat.\n\nEverything we accomplish produces or exacerbates thermal loads on the environment.\n\n______\n\nOccam’s razor states that all things being equal the simplest answer tends to be the correct answer.\n\nWhich is the simpler answer?\n\nA) Carbon emissions cause climates change.\n\nOr…\n\nB) All that we accomplish dumps heat into a system not designed to capture all of the heat we produce.\n\nThink about this as you drive that mobile oven around, or fly that mobile torch around, or sit in the conditioned air which takes heat from inside and dumps it outside, inefficiently, adding more heat in the process.\n\n[Cities *change weather patterns*...](http://thescienceexplorer.com/nature/shape-and-layout-cities-affect-weather)\n\nWhich is simpler to explain?\n\nOur entire way of life makes and dumps heat into this world.  Pretty simple.",
            "title_similarity": "0.55723083",
            "sentiment_compound": 0.5514
        },
        {
            "id": "hh8bin0",
            "score": -3,
            "text": "If we all kill ourselves, today - we can save the climate. \n\nLet's do our part while there's still time",
            "title_similarity": "0.49188983",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hh8ieid",
            "score": -2,
            "text": "Minimum 75% global population reduction required ASAP.\n\nFor starters.",
            "title_similarity": "0.55590117",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8jbpj",
            "score": -4,
            "text": "But not the volcano rite ? They did nothing?",
            "title_similarity": "0.22875616",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8jghg",
            "score": -2,
            "text": "That still doesn't prove we should do anything about it.",
            "title_similarity": "0.0795786",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8jjjd",
            "score": -2,
            "text": "Please name ALL of the studies used to calculate the 99.9% number please?\n\nAre volcanoes factored into the studies? The number of volcanoes as well as the magnitude and duration?",
            "title_similarity": "0.6936881",
            "sentiment_compound": 0.7808
        },
        {
            "id": "hh8oqi0",
            "score": -4,
            "text": "Wait this one or the one that thawed the ice age and allowed humans to create modern civilizations? How did those humans hunting wooly mammoths cause climate change? Seems weird that something that’s been happening for millions of years is now only caused by humans. I wonder what % of studies in the 90s said the ozone would be gone by now? They all turned out to be completely wrong.",
            "title_similarity": "0.67011595",
            "sentiment_compound": -0.5473
        },
        {
            "id": "hh8orem",
            "score": -3,
            "text": "I'm of the position that -  humans definitely are not helping, and all the plastic, emissions, etc are clearly not good... but is our impact enough to raise global temps by 2C+?  I think there are too many variables at play here.\n\nScientists never speak in absolutes.  The media takes their words, misinterprets them and then splashes it for millions to see.  They are also as biased as politicians, so if there's any type of political edge to be gained, they will use it.\n\nPoint of story - we need to do better as humans, but it's really difficult to say that we're the cause of it all.  What if something we weren't measuring was changing?   Look at Jupiter - they are talking about how the big red eye storm is shrinking.Pluto's atmosphere is disappearing.  Those are naturally occurring things that would be catastrophic for earth and there's no humans there to blame.  Again - not saying we're helping, but do we really know enough?",
            "title_similarity": "0.45705462",
            "sentiment_compound": -0.818
        },
        {
            "id": "hh8pex8",
            "score": 4,
            "text": "Are China and India expected to act on this?",
            "title_similarity": "0.2498501",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8qjqs",
            "score": -3,
            "text": "This doesn’t tell me anything. If I light a candle, it has *some* effect on the climate meaning that I’m causing the climate to change.\n\nI find it strange that the headlines always talk about humans “causing climate change”, but no percentage of climate change.\n\nThe second thing I don’t understand are the doomsday predictions from climate change. The models are still not reliable for predictions, which tells me that we still haven’t gotten all the variables. I understand that the ocean plays a big role since it is essentially the earth’s heat sink, is the idea that once the ocean hits a certain temperature, we’re at thermal runaway?",
            "title_similarity": "0.54171133",
            "sentiment_compound": -0.6428
        },
        {
            "id": "hh8rdqi",
            "score": -4,
            "text": "If you can't question the science, then it is propaganda.",
            "title_similarity": "0.35589612",
            "sentiment_compound": -0.25
        },
        {
            "id": "hh8tt0s",
            "score": 3,
            "text": "It’s a false promise that either house will not follow through on. Make the promise to get votes and then not follow through. Sounds like lying to me.",
            "title_similarity": "0.2854099",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hh8ujb8",
            "score": 3,
            "text": "But are you sure we shouldn't just listen to the 0.1% of sponsored studies who disagreed so that heavy industry titans can add billions to their personal fortunes?",
            "title_similarity": "0.5707638",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8wt98",
            "score": -4,
            "text": "Lynas said. “This pretty much should be the last word,” he said.\n\nThose should be the last words a real scientist ever says",
            "title_similarity": "0.34925765",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hh8z0i4",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh8ztof",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh933uz",
            "score": -3,
            "text": "And what about the once forested Sahara now a vast wasteland of sand?\n\nMan obviously is a spice in the recipe. Should we all do a better part? Yes...but at what costs? Adaptation to creature comforts are what changes the scenery.  Planetary changes occur, that no man or animal will be a part of except for adaptation or eradication. Storm damage can not be allowed to be measured in dollars over the last 1000 years. \n\nThis 12 year nonsense has been being spewed for decades. The scare tactic is real.\nSudden changes to our behavior may not be the best solution in the next fraction of climate changes(200 years). But capitalism is a solid bet that technology changes can be discovered and implemented without sacrificing the ability of EACH generation enjoying life instead of sacrifice and hardships.\n\nYou dont energize the upgraded circuit breaker box before replacing the wiring to accommodate twice the demand.",
            "title_similarity": "0.49681708",
            "sentiment_compound": -0.5787
        },
        {
            "id": "hh941q3",
            "score": -3,
            "text": "Climate change =/= global warming.",
            "title_similarity": "0.6824202",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hh9h06j",
            "score": -3,
            "text": "Brought to you by $cience.",
            "title_similarity": "0.28634843",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9hdqh",
            "score": -4,
            "text": "Other planets are warming \"[E]vidence that CO2 is not the principle driver of warming on this planet is provided by the simultaneous warming of other planets and moons in our solar system, despite the fact that they obviously have no anthropogenic emissions of greenhouse gas es.. Mars, Triton, Pluto and Jupiter all show global warming,",
            "title_similarity": "0.5346548",
            "sentiment_compound": 0.296
        },
        {
            "id": "hh9jtyx",
            "score": -2,
            "text": "Is there an inherent bias since most (all) funding is to combat anthropogenic climate change? Their most papers are going to address that aspect.",
            "title_similarity": "0.68205327",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hh9l97i",
            "score": -4,
            "text": "Thats right folks. Be afraid and hand all of your rights over to the government…\n\nYou dont want something bad to happen to the earth right?",
            "title_similarity": "0.37963396",
            "sentiment_compound": 0.703
        },
        {
            "id": "hh9rr3a",
            "score": -3,
            "text": "In general, whenever I see the *99.9% of experts agree*, can't help but suspect there's something fishy. \n\nScience is about constantly trying to challenge the status quo, purposely trying to poke holes in a theory. It's done with the goal of raising more questions, always expanding the scope of our current understanding. When all the experts are this agreeable, it demonstrates a possible lack of interest and innovation in the field. \n\nThere's so much more to learn about our planet, and if we wish to take real steps towards a real solution, we're going to have to start trying a little harder to expand current understanding by asking more questions. \n\n99.9% consensus, yet no realistic / ACTIONABLE solutions are being offered. That should tell you everything..",
            "title_similarity": "0.46577775",
            "sentiment_compound": 0.964
        },
        {
            "id": "hh9tlgx",
            "score": -3,
            "text": "Of course humans are have an effect of the climate but it's way preferable to global cooling. No one ever talks about that for some reason",
            "title_similarity": "0.49731535",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hh9v9b9",
            "score": -3,
            "text": "If climate change existed before humans then it is false to say humans caused climate change. It would be more accurate however to simply acknowledge that humans have impacted climate change rather than created or caused it.",
            "title_similarity": "0.5476147",
            "sentiment_compound": 0.25
        },
        {
            "id": "hh9xeg9",
            "score": -3,
            "text": "So does the Sun, volcanoes, cows and forest fires",
            "title_similarity": "0.35405344",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhaxvvw",
            "score": -4,
            "text": "“We only publish studies showing humans cause climate change — and we know we are right because 99.9% of published studies agree that humans cause climate change!”",
            "title_similarity": "0.83198535",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hh8gmpc",
            "score": -4,
            "text": "But to what extent? Is human activity the sole cause of climate change? Are there other factors at play that contribute to climate change like the sun or natural earth cycles? Any 'scientific' article that says only one factor is the cause of natural phenomenon is reductionistic and misleading.",
            "title_similarity": "0.60891914",
            "sentiment_compound": 0.8702
        },
        {
            "id": "hh8goxu",
            "score": -4,
            "text": "At its very basest level all living beings create heat energy and thus enough humans or really any animal would conceivably heat a planet sufficiently over enough time to make it uninhabitable. This is why Pierson's Puppeteers began moving worlds, not for agricultural reasons, but heat due to explosive population growth.  \nEdit: I double checked and waste heat from over industrialization played a part in *Ringworld* as to why they moved worlds, not just body heat.",
            "title_similarity": "0.54804724",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hh99l0z",
            "score": -4,
            "text": "At one point, more than 99.9% of studies agreed that the Earth was at the center of the universe.   \n\n\nA much better approach to this - rather than using a data point that is effectively meaningless (consensus does not equal \\*correct\\*...)   \n\n\nPoint out that we are the only species on Earth that releases geologically sequestered carbon stores into the atmosphere. In simple English - we dig up and burn oil, coal and other resources that \\*lock carbon and other greenhouse gas producers\\* in the Earth's crust.   \n\n\nSo, we contribute to more net output of greenhouse gasses into the atmosphere than was already there.   \n\n\nWhich still doesn't mean we \\*cause\\* climate change. The climate changes with or without us.   \n\n\nBut \\*if\\* there is a problem, we're currently \\*accelerating\\* it - and that needs discussion \\*free\\* of the kind of sensationalist rhetoric in the top post that doesn't really mean anything.   \n\n\nSee the difference between science and propaganda?",
            "title_similarity": "0.74651265",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hh801di",
            "score": 33,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh7u4k7",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh883jm",
            "score": -7,
            "text": "More than 99.9 % of theologians say God is real and the Bible is his word. Do you?",
            "title_similarity": "0.6385653",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hh89vut",
            "score": -6,
            "text": "Do people really think the climate was the same for billions of years up until the industrial revolution ?",
            "title_similarity": "0.7096466",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8btoe",
            "score": -5,
            "text": "They’re all wrong humans do not have THAT big an effect on the planets climate. The earth has had climates changing long before we even existed and will continue to have a changing climate long after we’re all extinct",
            "title_similarity": "0.5195509",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hh8ec1l",
            "score": -5,
            "text": "[deleted]",
            "title_similarity": "0.14681391"
        },
        {
            "id": "hh8eqoc",
            "score": -5,
            "text": "Out of 88,000 papers an algorithm only found 28 papers...\n\nThis isn't science, and how does stuff like this pass peer review.\n\nWith a very quick search you can find over tripple that in just 2021 alone.\n\nThis kind of computer generated paper is pointless.",
            "title_similarity": "0.48768958",
            "sentiment_compound": 0.128
        },
        {
            "id": "hh8fdi1",
            "score": -5,
            "text": "Good thing we are doing science by consensus or voting.  Because I remember in all my science classes that when I proved a theory that next step was to get other scientists to vote on it and see if they agree.  Oh wait, no that is not how any scientist does their work.  It is the media (including social media) and news outlets that like to create topics like more than 99.9% blah blah blah.  Because studies don’t read like that.  And you have to go looking for what you want to find and gather them together.  So yes if I go looking for studies that prove my point any point I can find a bunch and then create the false narrative that all the studies agree.  \n\nStop listening to this type of BS “news”.  Science is either a study, a theory, or a fact (law).  Science is never a consensus or a vote\n\nBtw I am not denying global warming.  I am just saying scientists with firm finding don’t seek the approval of other scientists to tell them if their work is true or not.",
            "title_similarity": "0.51011556",
            "sentiment_compound": 0.9683
        },
        {
            "id": "hh91i45",
            "score": 5,
            "text": "That's always been a confusing argument from the deniers imo.  If the climate change we're seeing is *not* due to human actions , we should be in a full out panic over the change we've seen so far.  If we caused it, we have a realistic chance of being able to slow or stop the change.  If the earth is going through record heating all on its own, we need to do the seemingly impossible to slow/stop it.",
            "title_similarity": "0.5308657",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hhacqno",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.14681391"
        },
        {
            "id": "hh83tvj",
            "score": -6,
            "text": "We increased the rate at which climate change happens. Climate change has always existed. Humans didn't \"cause\" it but we sure did contribute more to it during/after the industrial revolution.",
            "title_similarity": "0.62477326",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hh8852p",
            "score": -7,
            "text": "Um, who caused it before the humans then? Terrible wording, sorry not sorry.",
            "title_similarity": "0.32626832",
            "sentiment_compound": -0.4902
        },
        {
            "id": "hh8g2ce",
            "score": -6,
            "text": "We didn't CAUSE it. We were a catalyst, no doubt. To what degree, I'm not sure. But CAUSING climate change is a little bit of a display of hubris.",
            "title_similarity": "0.5011163",
            "sentiment_compound": 0.0191
        },
        {
            "id": "hh8a0v5",
            "score": 19,
            "text": "[deleted]",
            "title_similarity": "0.14681391"
        },
        {
            "id": "hh8dobm",
            "score": -7,
            "text": "88,125 papers in dataset,...only 31 were from apposing viewpoint.  Study seems a bit skewed??  No mention of who funded any of these studies. Follow the money.",
            "title_similarity": "0.47186404",
            "sentiment_compound": -0.3736
        },
        {
            "id": "hh81s9u",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh8aexe",
            "score": -8,
            "text": "And 99.9% of all statistics are made up on the spot. Id like some concrete sources and evidence  please.",
            "title_similarity": "0.67566454",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hh83iiv",
            "score": -10,
            "text": "Wait caused it or increased the rate at which it is happening? The earth goes up and down in temperature all the time throughout millennium",
            "title_similarity": "0.55973256",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hh83qpq",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh7ywzu",
            "score": 539,
            "text": "How many of those <0.1% of studies simply say that they could not conclusively prove that the current climate change is human-driven? The wording of the post's title makes it seem like all of this <0.1% is vocally against the human-driven climate change hypothesis but I very much doubt that.",
            "title_similarity": "0.5917538",
            "sentiment_compound": -0.4437
        },
        {
            "id": "hh8287z",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh88ata",
            "score": -12,
            "text": "I call BS on the whole concept. It's just a way to get more of our tax dollars for the libs period!",
            "title_similarity": "0.57462966",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh82cxb",
            "score": -13,
            "text": "What if all of those studies were missing some crucial data? We think we understand more than we do.",
            "title_similarity": "0.43760067",
            "sentiment_compound": -0.296
        },
        {
            "id": "hh7z4na",
            "score": 24,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh80vtf",
            "score": 2830,
            "text": "In climate policy studies/development we’re encouraged to use ‘anthropogenic climate change’ rather than just climate change. The distinction is really important as without this it becomes easy for politicians, individuals, and businesses to deflect blame where blame is necessary. Responsibility is a key part of climate action (ACC also works too).",
            "title_similarity": "0.5437126",
            "sentiment_compound": 0.4005
        },
        {
            "id": "hh8imne",
            "score": 38,
            "text": "[removed]",
            "title_similarity": "0.13158119"
        },
        {
            "id": "hh80uny",
            "score": 1,
            "text": "What, and the othet 0,1% says it was ants?",
            "title_similarity": "0.5047579",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8242l",
            "score": 1,
            "text": "I am interested to see that .1% of studies. Were they just chimps banging on a typewriter?",
            "title_similarity": "0.51214945",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hh82rkl",
            "score": 1,
            "text": "I thought this was common sense?",
            "title_similarity": "0.2511531",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh82tou",
            "score": 1,
            "text": "Nobody serious (including those who disagree with specific government policies designed to tackle climate change) disputes that anthropogenic climate change exists.",
            "title_similarity": "0.52466387",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hh82v14",
            "score": 1,
            "text": "> caused\n\nAre causing.  It's still going on as companies push profits of fossil fuels known to worsen it.  Companies that 'lobby' politicians to insure their profits remain a priority.  People who care more about immediate profits than the future of the planet.",
            "title_similarity": "0.50816107",
            "sentiment_compound": 0.8387
        },
        {
            "id": "hh82xoc",
            "score": 1,
            "text": "so what you're saying is, scientists are still deeply divided?",
            "title_similarity": "0.33328113",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh82yzw",
            "score": 1,
            "text": "But Bob on FB told me it was just a natural occurrence.",
            "title_similarity": "0.3456787",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hh8326w",
            "score": 1,
            "text": "And the only chance we have to stop the rising tide of climate change is to downsize and collectivize...but capitalism demands just the opposite.\n\nIf economics were based in actual science to begin with (rather than just speculation)...we wouldn't even be in this position.",
            "title_similarity": "0.55613303",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hh83kjl",
            "score": 1,
            "text": "How many times are we going to come to this conclusion?\nIt's like a whole industry that does nothing else than confirm what we already know.",
            "title_similarity": "0.43046427",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh83oex",
            "score": 1,
            "text": "Don't tell our govt that. They don't believe facts\n\nSigned an Australian..",
            "title_similarity": "0.24583367",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh83p5v",
            "score": 1,
            "text": "Yeah but I read this thing on facebook that says you're wrong.",
            "title_similarity": "0.37672555",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hh83r2w",
            "score": 1,
            "text": "And the .1% that do not believe, exactly how much wealth do they have, and are therefore hampering progress on this issue?",
            "title_similarity": "0.45039243",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hh83ue3",
            "score": 5,
            "text": "At this point the real question is, what are we going to do about it?",
            "title_similarity": "0.18606955",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh83wfp",
            "score": 1,
            "text": "I'd like to say *giant corporations* run by humans caused climate change. Tired of the legitimate factory owners trying to shift the blame to me and encourage me to \"do my part\" when they've been polluting in a year more than I could in 10.",
            "title_similarity": "0.68013453",
            "sentiment_compound": 0.128
        },
        {
            "id": "hh83x5e",
            "score": 1,
            "text": "Sounds like a controversial topic surrounded by mystery and a lack of consensus. I’ll have to do my own research.",
            "title_similarity": "0.21181558",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hh83yp8",
            "score": 1,
            "text": "But really I want to focus in the .1%.",
            "title_similarity": "0.4230369",
            "sentiment_compound": 0.2186
        },
        {
            "id": "hh844ec",
            "score": 1,
            "text": "What about ice heat cycles before humans roamed the earth?",
            "title_similarity": "0.4960472",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh84acv",
            "score": 1,
            "text": "Meh boring news, give us a viable solution.",
            "title_similarity": "0.26045305",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hh84j83",
            "score": 1,
            "text": "\"See? Even science says that there is a chance that humans didn't cause climate change!\"\n\n-- conservatives, probably",
            "title_similarity": "0.6071279",
            "sentiment_compound": 0.3164
        },
        {
            "id": "hh84plg",
            "score": 1,
            "text": "Let’s do something about it…like now",
            "title_similarity": "0.19998927",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh84pue",
            "score": 1,
            "text": "And…the other .01% say it was caused by Tucker Carlson himself, but since he’s not human they couldn’t say it’s 100% caused by humans.",
            "title_similarity": "0.5265851",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh84qqm",
            "score": 1,
            "text": "Stop publishing all these papers and plant trees. Quit being problem identifiers and solve it. I try to plant 100 trees a year. Everyone should do the same if possible.",
            "title_similarity": "0.44294778",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hh84qzi",
            "score": 1,
            "text": "At long last WE CAN FINALLY INFER THAT HUMANS might be THE SOURCE OF CLIMATE CHANGE*\n\n* because science is never a proven fact, only a suggestion, though this one feels like a shotgun to the face",
            "title_similarity": "0.5738655",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh84thp",
            "score": 1,
            "text": "I mean.. no.. but humans sure accelerated it. The climate is always gonna change we’re just moving things along quicker than normal.",
            "title_similarity": "0.54457116",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hh84tzu",
            "score": 1,
            "text": "Alternately 0.1% of scientists agree that climate change is not man made! Edit: maths",
            "title_similarity": "0.6134583",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hh84uja",
            "score": 1,
            "text": "Im glad the students agree",
            "title_similarity": "0.25373894",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hh84yta",
            "score": 1,
            "text": "These studies are very stupid and pointless. Even with common sense you could deduct that humans are causing climate change. For those people who lack common sense, they wouldnt read the studies anyway. So who are we making these studies for? How about we direct all this funding to : How to stop climate change. Or How to slow down climate change.",
            "title_similarity": "0.53568274",
            "sentiment_compound": -0.8016
        },
        {
            "id": "hh85a3m",
            "score": 1,
            "text": "humans accelerated climate change. climate change is like death, bound to happen. however humans shortened the time by industrialization.",
            "title_similarity": "0.62632036",
            "sentiment_compound": -0.34
        },
        {
            "id": "hh85c3b",
            "score": 1,
            "text": "So you’re telling me there’s a chance",
            "title_similarity": "0.24875179",
            "sentiment_compound": 0.25
        },
        {
            "id": "hh85mt4",
            "score": 1,
            "text": "The fact that we still do such studies is frustrating",
            "title_similarity": "0.1269713",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hh85pjl",
            "score": 1,
            "text": "But that 0.1%. ”Scientists disagree on cause of climate change”",
            "title_similarity": "0.6160164",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hh85vmt",
            "score": 1,
            "text": "What you mean spewing filth into the atmosphere and throwing garbage into our oceans for 200+ years can change our climate? \nWho knew?",
            "title_similarity": "0.5993116",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh85zf1",
            "score": 1,
            "text": "One in a million?\nSo there’s a chance?",
            "title_similarity": "0.41602498",
            "sentiment_compound": 0.3866
        },
        {
            "id": "hh861ui",
            "score": 1,
            "text": "So you're telling me there's a chance",
            "title_similarity": "0.25240815",
            "sentiment_compound": 0.25
        },
        {
            "id": "hh862cj",
            "score": 1,
            "text": "Some of climate change, the vast majority of it really",
            "title_similarity": "0.6634314",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh869hu",
            "score": 1,
            "text": "There's a 99.9% chance we're fucked. \n\nWhy? Because climate change is a class issue and they take centuries to solve. To the daily life of a regular richie rich, climate change poses 0 threat. If anything, it presents opportunities.",
            "title_similarity": "0.7001597",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hh86ctb",
            "score": 1,
            "text": "Articles like this one really make it seem as though its your average John and Jane regular-person not buying reusable grocery bags and paper straws that are responsible for the inevitability of climate change. When the truth is just 100 corporations are responsible for 71% of all global greenhouse gas emissions[¹](https://www.theguardian.com/sustainable-business/2017/jul/10/100-fossil-fuel-companies-investors-responsible-71-global-emissions-cdp-study-climate-change)\n\nI think it's well past time we stopped this whole \"climate change is everyone's fault\" narrative and placed the blame where it truly belongs, at the feet of greedy corporate executives and their shareholders who refuse to adopt climate saving measures because they would cut ever so slightly into their bottom line. So it's nice that Bill Gates' Science foundation funded this study, but someone like him is millions of times more responsible for the situation we are in right now than you and I are. Moreover him and people like him are the only people with the actual power to do something about it. So it's nice that they're \"raising awareness\" but they've been doing that for decades, we are all painfully aware of the circumstances we're in. It's time they literally put their money where their mouth is, and did something significant.",
            "title_similarity": "0.6746916",
            "sentiment_compound": 0.9245
        },
        {
            "id": "hh86d2m",
            "score": 1,
            "text": "You’re trying to convince people that believe a sky phantom takes a personal stake in their life. How much do you think proof (or wide scale agreement about that proof) matters to them?",
            "title_similarity": "0.38271654",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hh86f1l",
            "score": 1,
            "text": "Of course we caused climate change I'm just sick of the hypocrites out here and how everyone ignores the real cause of climate change which is overpopulation obviously if you have 8 billion people all polluting the environment your going to have problems we need a one child policy world wide to reduce climate change. And also all you hypocrites if you drive a car, have an air conditioner at home or use electricity at all and then complain about climate change your a hypocrite turn off your home a/c and sweat your ass off then it helps.",
            "title_similarity": "0.49854222",
            "sentiment_compound": -0.8885
        },
        {
            "id": "hh86il3",
            "score": 1,
            "text": "Don't feel bad. The Holocene extinction started 12,000 years ago. About the same time as literacy. Once we were able to retain knowledge that isn't in our DNA we started changing things. Civilization changed things.",
            "title_similarity": "0.6044809",
            "sentiment_compound": 0.431
        },
        {
            "id": "hh86l0b",
            "score": 1,
            "text": "And yet the loud idiots will cling to that 0.1% of uncertainty!",
            "title_similarity": "0.49371335",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hh86pz4",
            "score": 1,
            "text": "Just to be clear for people that haven’t ever actually looked into this the Earth’s climate goes through cycles of change. It has done this since the birth of Earth. That being said their is overwhelming proof that humans have greatly sped up how fast our current climate cycle is changing and things like permafrost melting releasing methane into the atmosphere will hit the gas pedal even harder.",
            "title_similarity": "0.61600125",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hh86qaa",
            "score": 1,
            "text": "But the media still think that both sides should carry equal weight in the debate.",
            "title_similarity": "0.35682076",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh86wnj",
            "score": 1,
            "text": "Check the back account of the one dickhead whose nay.",
            "title_similarity": "0.30394095",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hh87053",
            "score": 1,
            "text": "Love seeing random redditors that know more than sicience. It’s always a fun read.",
            "title_similarity": "0.2531034",
            "sentiment_compound": 0.8176
        },
        {
            "id": "hh870pl",
            "score": 1,
            "text": "Only because they were influenced by aliens who promised them power.",
            "title_similarity": "0.3726015",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh8793k",
            "score": 1,
            "text": "Corporations owned by specific few people****",
            "title_similarity": "0.35224363",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8816k",
            "score": 1,
            "text": "Its that 0.1% thats gonna be quoted the most.",
            "title_similarity": "0.49583176",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh881gf",
            "score": 1,
            "text": "How can there be any well-designed scientific studies that say humans AREN'T causing climate change??\n\n99.9% means one out of every thousand studies shows that: either humans aren't causing climate change, or it's impossible to prove humans are having any effect on climate.",
            "title_similarity": "0.64870334",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh884ht",
            "score": 1,
            "text": "This question has always been folly anyway.  It's like trying to place blame on a plane headed at a mountain top.  I'd doesn't matter how it got there, only how to clear the mountain.",
            "title_similarity": "0.34118915",
            "sentiment_compound": 0.5308
        },
        {
            "id": "hh885x1",
            "score": 1,
            "text": "The people that need convincing don’t believe in science. You’ll never convince them with more science.",
            "title_similarity": "0.2633305",
            "sentiment_compound": 0.2406
        },
        {
            "id": "hh887hy",
            "score": 1,
            "text": "Sure, over population will use more resources. So..   Wouldn't shoving our dead into deep well oil extraction points be more efficient?..",
            "title_similarity": "0.42789024",
            "sentiment_compound": 0.8731
        },
        {
            "id": "hh88chq",
            "score": 1,
            "text": "Average Facebook user:  So, not everyone agrees, therefore it doesn't exist.",
            "title_similarity": "0.2873639",
            "sentiment_compound": -0.1511
        },
        {
            "id": "hh88ns2",
            "score": 1,
            "text": "And just 100 companies are producing over 73% of the emissions and pollution.\n\nWhat are our leaders gonna do about it? Nothing!",
            "title_similarity": "0.6387689",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh88o37",
            "score": 1,
            "text": "Oh okay and here I thought it was the chickens",
            "title_similarity": "0.23866531",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hh88sr2",
            "score": 1,
            "text": "In my humble opinion, the studies all agree on this because it's the truth.",
            "title_similarity": "0.28661373",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hh88tbz",
            "score": 1,
            "text": "Who cares? And I don’t mean that this isn’t a significant finding. Of course it is. But the drumbeat of the climate science deniers isn’t ‘Humans didn’t cause climate change’ (though they say this too); because what they are REALLY saying is, ‘Climate change doesn’t matter.’",
            "title_similarity": "0.42780256",
            "sentiment_compound": -0.0644
        },
        {
            "id": "hh88w5b",
            "score": 1,
            "text": "I like to see the source of funding for every study, regardless of subject matter.",
            "title_similarity": "0.3241254",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hh894l5",
            "score": 1,
            "text": "More than 99.9% is 100%!",
            "title_similarity": "0.6232326",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh895kl",
            "score": 1,
            "text": "Feels like what I already was hearing as a kid in the 80ies but whatever.",
            "title_similarity": "0.37527287",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hh896lh",
            "score": 1,
            "text": "Was this a big secret all along? I dont get it",
            "title_similarity": "0.24011727",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh89b7x",
            "score": 1,
            "text": "To me it feels like OPs post and majority of the discussion herein is trying to convince one another who is right or wrong, thus who’s to blame/at fault.\n\nThe focus/effort should not be on this as it’s ‘past tense’. Instead, if it is an issue or will be detrimental to us humans into the future, the focus/effort needs to applied there to avoid any further damage to our lifestyle and global ecosystem.\n\nEither way *evolution* follows no logical path because it knows no boundaries.",
            "title_similarity": "0.3381269",
            "sentiment_compound": -0.8779
        },
        {
            "id": "hh89gb1",
            "score": 1,
            "text": "No prizes for guessing where the .1% live.",
            "title_similarity": "0.3061335",
            "sentiment_compound": -0.357
        },
        {
            "id": "hh89l18",
            "score": 1,
            "text": "People say that they believe climate change is manmade, but few will actually change their lifestyle to do anything about it and that's the big problem. Don't wait for the government to force you to do it, do it yourself. Stop driving your car, get off your cellphone, turn off the AC in your house. Instead they want to protest and post on websites about what needs to be done instead of being an example.",
            "title_similarity": "0.44193718",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hh8a8x6",
            "score": 1,
            "text": "Then why the hell in the US is nuclear power so demonized!? Most notably from left wing politicians who seem to care more about taking climate change action. Even Burnie Sanders recently celebrated his state closing down either its last or one of its last nuclear plants.",
            "title_similarity": "0.5062083",
            "sentiment_compound": 0.3802
        },
        {
            "id": "hh8aau5",
            "score": 1,
            "text": "It's funny because I had a math professor in my old uni that was a prominent climat change skeptic. He is even the president of an organisation dedicated to say that climate change isn't happening. One of the best math professors I've ever had tho.",
            "title_similarity": "0.4976825",
            "sentiment_compound": 0.8885
        },
        {
            "id": "hh8abiw",
            "score": 1,
            "text": "Ironically, science is entirely responsible for climate change.  Or more accurately, the technology derived from the science.",
            "title_similarity": "0.6657208",
            "sentiment_compound": 0.3804
        },
        {
            "id": "hh8ad4x",
            "score": 1,
            "text": "Has anyone ever watch that movie that Exxon put out after the Valdez oil spill? \n\nThat might have given you a clue about oil companies",
            "title_similarity": "0.41463673",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8ahty",
            "score": 1,
            "text": "Well I don't think the ants caused it..",
            "title_similarity": "0.21853217",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hh8aqj6",
            "score": 1,
            "text": "Psh...I bet humans made this study. Biased",
            "title_similarity": "0.45861375",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hh8b9d5",
            "score": 1,
            "text": "Of course we did, look at CO2 output after the industrial revolution.",
            "title_similarity": "0.58532536",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8bdka",
            "score": 1,
            "text": "Idiocracy, the movie has been popping up on my social media over the years but I didn't have the chance to watch it and randomly one night I decided to and I was disappointed. I thought it was a thought provoking movie from what I've read but it turned out to be a silly movie, well that's what I thought. But looking back, I'm starting to believe that we're heading in that direction. It's an eerie feeling.",
            "title_similarity": "0.2742216",
            "sentiment_compound": -0.7998
        },
        {
            "id": "hh8bipi",
            "score": 1,
            "text": "Yes virtual all human-caused climate change is caused by humans.\n\n\"This pretty much should be the last word.\"\n\nThat's not how science works.",
            "title_similarity": "0.62048316",
            "sentiment_compound": 0.7543
        },
        {
            "id": "hh8bsi0",
            "score": 1,
            "text": "The media is so bad about messaging. This is what makes conservative people double down in the opposite direction. Humans 100% did not *cause* climate change. Humans *accelerated* climate change.",
            "title_similarity": "0.583482",
            "sentiment_compound": -0.6696
        },
        {
            "id": "hh8cesd",
            "score": 1,
            "text": "Deniers: but the 1% that disagrees means the science isn’t conclusive yet. \n\nSo I guess you don’t brush since 9 out of 10 doctors recommend daily brushing?",
            "title_similarity": "0.57662356",
            "sentiment_compound": -0.0644
        },
        {
            "id": "hh8cjmg",
            "score": 1,
            "text": "So we can stop blaming farting cows?",
            "title_similarity": "0.27994892",
            "sentiment_compound": -0.6872
        },
        {
            "id": "hh8ckw1",
            "score": 1,
            "text": "the question now is what to do?\n\nA carbon tax would have more detrimental affects on the poor and those in developing countries than it would on the corporations causing the bulk of the pollution. I believe it would drive many of the countries who are approaching first world status back into the 3rd world.\n\nI think nuclear power is a clear option. newer fuel sources with less waste would allow for an increase in energy production that is virtually carbon free.\n\nI think not considering nuclear along with renewables would be a mistake.",
            "title_similarity": "0.5769449",
            "sentiment_compound": 0.4459
        },
        {
            "id": "hh8cmsd",
            "score": 1,
            "text": "Well. Here is that 0.1% that don't.  \n  \n-Every older person I know.",
            "title_similarity": "0.44199115",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hh8cq26",
            "score": 1,
            "text": "This is the scientist equivalent of “1 out of 1000 dentists agrees: fall asleep with a sour lollipop dissolving in your mouth.” \n\nThe truth is that the anti-climate change people don’t trust scientists.",
            "title_similarity": "0.504272",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hh8cx3o",
            "score": 1,
            "text": "I hate people who hike",
            "title_similarity": "0.19231012",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hh8cy06",
            "score": 1,
            "text": "Can I get the 0.01% of the paper to see what they have got to say.",
            "title_similarity": "0.52124107",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8d4ug",
            "score": 1,
            "text": "It’s only a problem for us, and if we learned anything this decade it’s that we aren’t going to live to see it happen. A pandemic (maybe this one) is going to take us out long before a tsunami does. Then once we are all dead, the climate will stabilize (we saw this happen almost instantly at the start of lockdowns) and something else will take over. Probably spiders.",
            "title_similarity": "0.48132882",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hh8da9n",
            "score": 1,
            "text": "Good thing we don't do science through consensus... right?",
            "title_similarity": "0.29878837",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hh8dif2",
            "score": 1,
            "text": "Vulcan in kampe vera strongly disagrees....",
            "title_similarity": "0.28577304",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hh8djbh",
            "score": 1,
            "text": "I’m still on the fence about this one",
            "title_similarity": "0.07975021",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8djet",
            "score": 1,
            "text": "Okay now let’s do something about it",
            "title_similarity": "0.17652091",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hh8dr9l",
            "score": 1,
            "text": "I could only access the extract, but that’s good to see. Of course, step 2 is some research on what to do about it, which unfortunately I think gets stepped over when we have these discussions. From a non-exhaustive list (my opinions in parenthesis):\n\n1) climate change isn’t real (the 1%, who really shouldn’t be a target of this discussion)\n2) it’s real but who cares (slightly nihilistic)\n3) it’s real but not my problem (often a little libertarianism here, where the argument is that environmental measures should compete similar to the free market…so people should drive electric cars when electric cars are as compelling value props as combustion cars; I’d argue though value should include externalities like not polluting)\n4) it’s real and a problem but my…(a little with 4/5; I think these are people that are usually receptive to life policies on change (no more plastic bags, reusable utensils) but less receptive to other changes (not having a car and usually public transportation)\n5) it’s real and a problem but stop telling me and start telling companies/countries that heavily pollute\n6) it’s real and we all need to fight it together\n7) it’s real but we need to balance people’s welfare with fighting climate change (I don’t think these are mutually exclusive, but I have heard compelling arguments in this camp)\n…\n\nProbably missing a few…but think the opportunity is getting people from 2/3 into 4/5 and 4/5 into 6/7.",
            "title_similarity": "0.52852786",
            "sentiment_compound": -0.4315
        },
        {
            "id": "hh8e0ck",
            "score": 1,
            "text": "93% of scientists agree.\n\n97% of climate scientists.\n\nAs per wikipedia.\n\nNow, that is convincing enough to me, no reason to exaggerate figures.",
            "title_similarity": "0.74163663",
            "sentiment_compound": 0.34
        },
        {
            "id": "hh8e0pf",
            "score": 1,
            "text": "I've consistently had this conversation with someone at work that says this is a phase the Earth is going through. I just don't understand how to argue with them.",
            "title_similarity": "0.3286538",
            "sentiment_compound": -0.34
        },
        {
            "id": "hh8e2w3",
            "score": 1,
            "text": "Cool we’ve been at this consensus for well over a decade and nothing changes. Nothing is going to change. Even if the USA magically went fully green (they won’t) China and India will just laugh and keep the coal burning. It’s already game over.",
            "title_similarity": "0.4447385",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hh8e9q0",
            "score": 1,
            "text": "I mean, it wasn't the dogs.",
            "title_similarity": "0.112493105",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8eak0",
            "score": 1,
            "text": "Now, it is the time to start solving this very important issue of climate change. Some politicians just ignore it as if it does not even exist. The populace must put pressure on them to do something about it.",
            "title_similarity": "0.49636105",
            "sentiment_compound": -0.0534
        },
        {
            "id": "hh8ebji",
            "score": 1,
            "text": "It is time to address human accelerated climate change by phasing out oil, gas, and coal, plus ending the clear-cutting of forests.",
            "title_similarity": "0.52777255",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8eq8l",
            "score": 1,
            "text": "When the powers that be determine planes and cruises for recreational use is wrong and stopped along with companies producing plastic I'll do my bit to recycle but until then what's the point.",
            "title_similarity": "0.33913654",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hh8ffv6",
            "score": 1,
            "text": "Knowing myself, I would. Humans suck.",
            "title_similarity": "0.2800666",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hh8fknu",
            "score": 1,
            "text": "The fact that we still have to debate this makes me want to be dead",
            "title_similarity": "0.15052584",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hh8fs44",
            "score": 1,
            "text": "and im still not convinced!",
            "title_similarity": "0.070086546",
            "sentiment_compound": -0.3716
        },
        {
            "id": "hh8fv41",
            "score": 1,
            "text": "Sounds like someone copied someone else's homework!",
            "title_similarity": "0.2870766",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hh8g0gm",
            "score": 1,
            "text": "Is there a consensus on to what extent we are causing climate change? also, haven't many a species caused/contributed to climate change? Being a part of the environment means we impact it, no?",
            "title_similarity": "0.6777488",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8g4a6",
            "score": 1,
            "text": "The other 0.1% think it is alien space lasers?",
            "title_similarity": "0.46416795",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8gljw",
            "score": 1,
            "text": "99.9% of non-billionaires agree.",
            "title_similarity": "0.6824998",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh8hakt",
            "score": 1,
            "text": "Well well well, if not the consequences of my actions.",
            "title_similarity": "0.23736912",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hh8hels",
            "score": 1,
            "text": "So you’re saying there’s a chance…",
            "title_similarity": "0.22430778",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8hq94",
            "score": 1,
            "text": "More then 99.9% of study agree: only Americans are stupid enough to believe politicians over scientists.",
            "title_similarity": "0.6657777",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hh8hty4",
            "score": 1,
            "text": "Were you guys still uncertain or? -_-",
            "title_similarity": "0.13359366",
            "sentiment_compound": -0.296
        },
        {
            "id": "hh8i29u",
            "score": 1,
            "text": "But what about Bill gates? And water vapor?",
            "title_similarity": "0.4048705",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8i9t1",
            "score": 1,
            "text": "It’s true North Americans killed the last mammoths too",
            "title_similarity": "0.47821736",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hh8ixmc",
            "score": 1,
            "text": "Trump was so certain tho.",
            "title_similarity": "0.26804686",
            "sentiment_compound": 0.4101
        },
        {
            "id": "hh8jhcc",
            "score": 1,
            "text": "Humans or not, reversal is not going to happen with increasing consumption and the amount of poverty in China and India. They rely on coal.",
            "title_similarity": "0.33368075",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hh8jliw",
            "score": 1,
            "text": "Now we need studies on how humans can reverse climate change - ASAP",
            "title_similarity": "0.6443168",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8jm5x",
            "score": 1,
            "text": "My parents did their own research. Does that count?",
            "title_similarity": "0.3488317",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8kdk8",
            "score": 1,
            "text": "Wait... some people think we didnt?",
            "title_similarity": "0.231207",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8keci",
            "score": 1,
            "text": "Am I lost, when did we ever deny this?",
            "title_similarity": "0.17799504",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hh8l1sj",
            "score": 1,
            "text": "This is worded incorrectly since human didn't \"cause\" climate change since it's a natural process of the earth. Humans just massively influenced it to a dangerous extent",
            "title_similarity": "0.4639492",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hh8l27b",
            "score": 1,
            "text": "Was there ever a question???",
            "title_similarity": "0.088600606",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8lhwu",
            "score": 1,
            "text": "\"More than 99.9% of peer-reviewed scientific papers agree that climate change is mainly caused by humans\" if you copy  the first paragraph of the study, don't leave out words.",
            "title_similarity": "0.8932003",
            "sentiment_compound": 0.3915
        },
        {
            "id": "hh8lldk",
            "score": 1,
            "text": "It’s common sense and if you believe otherwise you severely lack critical thinking skills. 7 billion of us creating a massive amount of waste and burning fossil fuels for over a century at an astounding rate is obviously going to have an effect.",
            "title_similarity": "0.5493096",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hh8lmnd",
            "score": 1,
            "text": "There are people who believe in the contrary? Wow",
            "title_similarity": "0.31304651",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hh8lp0h",
            "score": 1,
            "text": ">humans agree that humans caused climate change",
            "title_similarity": "0.73811316",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh8lr2g",
            "score": 1,
            "text": "TIL 0.1% of studies proved earth is flat.",
            "title_similarity": "0.51411897",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8lt66",
            "score": 1,
            "text": "~~Humans~~  Giant mega-Corporate factories.",
            "title_similarity": "0.48415005",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8m0fu",
            "score": 1,
            "text": "I am an archaeologist, and have studied climate change. Climate change is never ending, and alway active thing. However the speed of climate change in the last 300 years is something never seen before (in the time of humans). Anthropogenic Climate Change (human caused climate change) or ACC is very real! 99.9% out of 88,125 studies conclude this; can we now stop bickering over ACC’s existence and start working on slowing the change?",
            "title_similarity": "0.7109339",
            "sentiment_compound": 0.2003
        },
        {
            "id": "hh8my9r",
            "score": 1,
            "text": "No luck catching those murderers then?",
            "title_similarity": "0.22540323",
            "sentiment_compound": -0.777
        },
        {
            "id": "hh8o325",
            "score": 1,
            "text": "So your saying there is a .01% chance?",
            "title_similarity": "0.61164045",
            "sentiment_compound": 0.25
        },
        {
            "id": "hh8o40s",
            "score": 1,
            "text": "Wish it was “99.9% humans agree: humans caused climate change” instead",
            "title_similarity": "0.83223975",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hh8pbzp",
            "score": 1,
            "text": "I prefer saying provoke climate change. The earth had passed a lot of climate changes in its life but humans are doing this process faster.",
            "title_similarity": "0.6332024",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hh8pcoa",
            "score": 1,
            "text": "Deniers have pivoted to \"yes humans are causing it but China/India isn't going to do anything significant about it so we're screwed regardless, might as well keep the dollars churning before we perish.\"",
            "title_similarity": "0.30087975",
            "sentiment_compound": -0.145
        },
        {
            "id": "hh8pe2a",
            "score": 1,
            "text": "It hasn't been an actual debate for a very long time.",
            "title_similarity": "0.22681609",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8pmqi",
            "score": 2,
            "text": "\"In the study, the researchers began by examining a random sample of 3,000 studies from the dataset of 88,125 English-language climate papers published between 2012 and 2020. They found only four out of the 3,000 papers were skeptical of human-caused climate change. “We knew that [climate skeptical papers] were vanishingly small in terms of their occurrence, but we thought there still must be more in the 88,000,” you have to read this far don't that they didn't analyze all studies. Out of 88,000 the looked at 3000, which they say they did randomly.",
            "title_similarity": "0.57329726",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hh8pnrn",
            "score": 1,
            "text": "Corporation: Well you know that's just your opinion dude.",
            "title_similarity": "0.3933589",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hh8pqs9",
            "score": 1,
            "text": "In a way, one could also say that climate change caused humans xD",
            "title_similarity": "0.672186",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hh8psqk",
            "score": 1,
            "text": "Not humans in general. About 5 mega cooperations",
            "title_similarity": "0.3724307",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8puxr",
            "score": 1,
            "text": "About 40% of humans are anti-science.",
            "title_similarity": "0.596227",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8pw0e",
            "score": 1,
            "text": "What does the 0.1% attribute it to, or does it deny it as a whole?",
            "title_similarity": "0.44129157",
            "sentiment_compound": -0.34
        },
        {
            "id": "hh8q03r",
            "score": 1,
            "text": "Not sure of the actual numbers, but at minimum this means that 1001 studies have been done and 1000 came to similar conclusions. Because if it were 999 out off 1000, you couldn't say \"more than 99.9%\"",
            "title_similarity": "0.62474585",
            "sentiment_compound": -0.1232
        },
        {
            "id": "hh8q8kl",
            "score": 1,
            "text": "Don't take care of our earth this is what happens.",
            "title_similarity": "0.19456221",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hh8q8ty",
            "score": 1,
            "text": "Unfortunately that 0.1% is all they need",
            "title_similarity": "0.37764934",
            "sentiment_compound": -0.34
        },
        {
            "id": "hh8qmi1",
            "score": 1,
            "text": "Okay, and?  It’s the solutions that are hotly contested.",
            "title_similarity": "0.23685478",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hh8qp3g",
            "score": 1,
            "text": "Humans is a funny way of spelling a few top companies are actually responsible for it.",
            "title_similarity": "0.43221158",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hh8r0z9",
            "score": 1,
            "text": "Now I want to know what the 0.01 of studies says....",
            "title_similarity": "0.4460141",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hh8r4dw",
            "score": 1,
            "text": "Didn't 99.9% of people already know this without a single study?",
            "title_similarity": "0.64473975",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8rbx3",
            "score": 1,
            "text": "Worded incorrectly, CORPORATIONS caused climate change.  They should be the ones to foot the bill for expensive new green technology.\n\nForcing consumers to purchase electric cars, banning lawnmowers and generators will have minimal impact when corporations pollute at will.",
            "title_similarity": "0.52838075",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hh8rp5i",
            "score": 1,
            "text": "Or did climate change cause humans?",
            "title_similarity": "0.6106963",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8rr98",
            "score": 1,
            "text": "Is it not amazing that it took us around 40 years or more, for the near totality of researchers to arrive to this conclusion?\n\nThe power of executive influence over research.\n\nSee you in the deepest ends of the ocean.",
            "title_similarity": "0.5559101",
            "sentiment_compound": -0.4717
        },
        {
            "id": "hh8sn8j",
            "score": 1,
            "text": "I'm not denying climate change but how is it that this article passed peer-review. My question stems from the main author of the article Mark Lynas. This guy has had so many scandals. He has been writing books on climate change ending the world for almost 20 years. He's like the opposite of a climate change denier, he's an alarmist who capitalizes on selling fear. \n\nHe has no degree in science... He's got a degree in politics and history but nothing involving the climate or anything related to it. He has wrote books about climate change and recently published the sequel to his 2007 book. Most of his income is from writing for Left-Wing news organizations, bribery, foreign leaders, and the Bill and Melinda Gates foundation. I am not slandering him, there are tons of articles out there about him. I'm just shocked people keep dealing with this guy. In the 1990's he was part of a militant activist group which broke into GM facilities. He is a fellow at Cornell but Bill Gates put him there.\n\nI know this Sub has a strict policy against climate denial in any form, it was even wrote about in a national geographic article. I don't wanna get banned from the sub, I am not denying climate change and believe that the majority of peer reviewed studies are accurate. \n\nI only question the point of this one and the author. It has been agreed on by the majority of the scientific community for decades that 97% of scientist believe humans are the cause of climate change. It was a woman, with an actual background in the field, who wrote that original peer-reviewed article. \n\nIt seems like having a very sketchy guy recreate the study, pick out 3000 articles from 88,125 and only pull out 4 that completely disagree with him is messed up. Then they play with the numbers to make it 99.9%. Even as someone who completely agrees with climate change it seems very hard to believe all 2996 of the other articles completely agreed with his stance. Using the study's logic it would just mean that 99.9% of articles just say the same thing.\n\nI find it awesome so many people are on board with climate change! Other than trying to pat himself on the back or promote his poor selling book I'm really lost on the point he was working to make though. I know there were 2 other authors but one is a software engineer and the other is another journalist from what I can tell.\n\nI'm not doubting science just the peer-review part of this study. I remember not long ago someone was able to get a peer-reviewed study published stating how male genitalia caused climate change. The whole point they were making was that it's become too easy to get a peer-reviewed article if it's a popular opinion topic.",
            "title_similarity": "0.51017475",
            "sentiment_compound": 0.8142
        },
        {
            "id": "hh8u0fh",
            "score": 4,
            "text": "We certainly sped up the process, and gave the planet massive food poisoning",
            "title_similarity": "0.5032139",
            "sentiment_compound": -0.34
        },
        {
            "id": "hh8uc7c",
            "score": 1,
            "text": "Climate changes regardless. Geologists can see this by observing climate history through layers of ice in glaciers. \n\nDo we speed the process up? Probably.",
            "title_similarity": "0.59477806",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8uet8",
            "score": 1,
            "text": "We're doomed from this one.",
            "title_similarity": "0.16119757",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hh8ukio",
            "score": 1,
            "text": "What? First I’m hearing about this",
            "title_similarity": "0.22436117",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8up2y",
            "score": 1,
            "text": "Shaggy: *It wasn’t me.*",
            "title_similarity": "0.2419981",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8upyd",
            "score": 1,
            "text": "now let's open research facilities on the existence of an inverse operation\n\nps: this is no joke really, has anybody tried to model how to turn 8B people into a positively reinforced (somehow peaceful) biosphere saving machine",
            "title_similarity": "0.5480857",
            "sentiment_compound": 0.6919
        },
        {
            "id": "hh8v79x",
            "score": 1,
            "text": "Ok, but do 30 helens agree?",
            "title_similarity": "0.45282143",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hh8vhu7",
            "score": 1,
            "text": "I’m sad I missed this thread to help elucidate climate science (or even paleoclimate) to the people who need it.",
            "title_similarity": "0.46735469",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hh8vzt1",
            "score": 1,
            "text": "thete still 0.01 % It GOEwd will",
            "title_similarity": "0.48760253",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8wbst",
            "score": 1,
            "text": "“How high’s the water momma?”\n\n“Three feet high, an’ risin’…”",
            "title_similarity": "0.25303796",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8wcum",
            "score": 1,
            "text": "That's great, I'll think I'll eat an extra steak today.",
            "title_similarity": "0.29065278",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hh8wdg9",
            "score": 1,
            "text": "Geo engineering  and harpo",
            "title_similarity": "0.32318085",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8wjkn",
            "score": 1,
            "text": "The other .1% will shock you!",
            "title_similarity": "0.4332794",
            "sentiment_compound": -0.4389
        },
        {
            "id": "hh8wscj",
            "score": 1,
            "text": "Yeah, but I saw this facebook video that shows they didn't, so...",
            "title_similarity": "0.31220832",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hh8wyhr",
            "score": 1,
            "text": "What about deserts that were oceans before? Is that considered climate change?",
            "title_similarity": "0.621317",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8x1q1",
            "score": 1,
            "text": "YeH bUt tHaT .1 tHoUgH!",
            "title_similarity": "0.2845358",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh8xb3w",
            "score": 1,
            "text": "So you're telling me there's a chance?",
            "title_similarity": "0.23503685",
            "sentiment_compound": 0.25
        },
        {
            "id": "hh8xt1j",
            "score": 2,
            "text": "0.0001% bp execs\n\nNope! You’re wrong!",
            "title_similarity": "0.43180305",
            "sentiment_compound": 0.4833
        },
        {
            "id": "hh8y13t",
            "score": 1,
            "text": "Going vegan or mostly vegan would help tremendously",
            "title_similarity": "0.3940225",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hh8y8js",
            "score": 1,
            "text": "Stop with the studies already and show some action!",
            "title_similarity": "0.25516695",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hh8ylll",
            "score": 1,
            "text": "But denial of this statement is not where danger lies for a long time, is it? Rarely do people deny climate change now. A prevalent tactic now is denying the damage it brings. \n\n\"Well, how bad could it be, surely it's not *that* bad?\"\n\n\"See levels rising? The Netherlands have been dealing with this for centuries, we'll be fine!\" \n\n\"Air composition changed? It was 10% more oxygen when dinosaurs lived, you are telling me that 0.1% change of CO2 will have effect on life on Earth?\"\n\nAnd so on and so on.\n\nPlease don't take it at face value, I'm making up as I go, but when such phrases occur en masse, it become more difficult to refute each one in turn after another.",
            "title_similarity": "0.6233449",
            "sentiment_compound": 0.9113
        },
        {
            "id": "hh8yqns",
            "score": 1,
            "text": "As a fellow human I must say, we investigated ourselves and found ourselves to not be at fault. The ol' cop route.",
            "title_similarity": "0.273682",
            "sentiment_compound": 0.3089
        },
        {
            "id": "hh8z5nw",
            "score": 1,
            "text": "Our politicians would need to ignore the vast amounts of wealth given to them by their corporate pimps to even ATTEMPT to help the situation, in other words. We are screwed.",
            "title_similarity": "0.36089277",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hh8zi9p",
            "score": 1,
            "text": "Well, this finally convinces me...",
            "title_similarity": "0.25386882",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hh8zlgn",
            "score": 1,
            "text": "so im a kinda dumb guy, and some smart folk i know tell me that thos is a cyclical event in nature, to which i always ask... cant we still try to do something about it even if it is not our fault? because that is kinda what humans do, we hack our environment so we can survive.",
            "title_similarity": "0.36103216",
            "sentiment_compound": 0.2385
        },
        {
            "id": "hh8zpjv",
            "score": 1,
            "text": "this is like 1980s news",
            "title_similarity": "0.4159593",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh90mzf",
            "score": 1,
            "text": "I'm no mathematician but wouldn't more than 99.9 just be 100? Like why not put \"every study ever conducted conclusively prove we have indeed fucked ourselves\"",
            "title_similarity": "0.56492126",
            "sentiment_compound": -0.6652
        },
        {
            "id": "hh91gsc",
            "score": 1,
            "text": "Teach the controversy… Clearly that .01% deserve equal (if not more) of a platform!",
            "title_similarity": "0.5938585",
            "sentiment_compound": 0.4574
        },
        {
            "id": "hh91l4k",
            "score": 2,
            "text": "We've known this since, at the latest, the 80s. It's just that we live in a capitalist world where the tech to change transportation has to both exist and be cost efficient.\n\nThe US has 300+ military bases that have to stay staffed, stocked, and mobilized, and its entire economy is dependent on being able to ship globally. Until the tech reaches a point where it's more cost efficient than gas and oil, the market will never adjust.",
            "title_similarity": "0.48329854",
            "sentiment_compound": 0.7251
        },
        {
            "id": "hh91zd7",
            "score": 1,
            "text": "So what? Until someone has a better idea than burning stuff, we’re gonna keep burning it.  As the west comes off of burning it (if we ever actually do), that’s just going to drive the price of fossil fuels down and make them MORE attractive to less developed areas.  Nuclear is/was a fantastic option, and if we spent the cash we have on wind and solar on nuclear technology NOT designed for 50’s military use, we’d have plentiful, extremely clean energy. Batteries aren’t good enough for large scale, efficient storage, but electricity is itself relatively easy to transport, and relatively easy to make use of. Another “humans are gonna kill everything” doesn’t really help.",
            "title_similarity": "0.47579664",
            "sentiment_compound": 0.937
        },
        {
            "id": "hh92aog",
            "score": 1,
            "text": "Whaaat? Was there a doubt? Amazing.",
            "title_similarity": "0.26139206",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hh92jg7",
            "score": 1,
            "text": "That 00.1% has been shown to be not valid research",
            "title_similarity": "0.36838472",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh92qfo",
            "score": 1,
            "text": "Accelerated* would be more logical",
            "title_similarity": "0.35169703",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh93gqv",
            "score": 1,
            "text": "Science is a science of trial and error, yet everyone has to pay price for science. Errors can be overcome by more science, more science should not be more climate changes.",
            "title_similarity": "0.39778954",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hh93hik",
            "score": 1,
            "text": "Plain and simple humans are destroying earth, and we could argue or agree, but the truth is evident. We worry about a virus, humans made it, the animals going extinct so the flora, and fauna, etc... are also going, the weapons we are using at war, nuclear waste being pumped into the ocean, the sea of plastic, the island of garbage is getting bigger, the forests are being burned or just being destroyed. All of this is caused by the way we live - we are more a cancer to earth than a giver of life. I don't care what people may think. If you like your life to be so simple and ignore these facts then I don't mind sounding simple enough to know we are simple human beings who are destroying the earth.",
            "title_similarity": "0.43326414",
            "sentiment_compound": -0.9887
        },
        {
            "id": "hh93rj8",
            "score": 1,
            "text": "I'd like to see those other 0.1% reports.",
            "title_similarity": "0.40561736",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh93zwb",
            "score": 1,
            "text": "And nature created humans so whatever. I didn't ask to be here and I am not trying to be overly wasteful. Tired of being told it's all my fault.",
            "title_similarity": "0.32902747",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hh94qil",
            "score": 1,
            "text": "WAIT, WHAT DID I DO?\n\nOh right; all the garbage and pollution...",
            "title_similarity": "0.34751028",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh95jze",
            "score": 1,
            "text": "Holy crap they've been saying this for literally at least half a century. When will rich or govs do something major about it? Who knows. Shame there's too much money, power and influence in oil. Literally Could've had water powered cars, hemp clothes bricks, cleaner factories from the start. But some nose picking money pig done everything he could too make sure this wouldn't happen so he can keep getting richer, at the cost of all life on earth. Humans for you huh?",
            "title_similarity": "0.50013053",
            "sentiment_compound": 0.7514
        },
        {
            "id": "hh95rt6",
            "score": 1,
            "text": "At this point, the distinction between natural climate change and Anthropogenic climate change (ACC) has long been made, and the allowance for ACC to be refered to in short as climate change has been granted.\n\nThe cretaceous period of natural warming occured over the course of 1.5 million years.  It was brought on by two main factors: an asteroid that killed a lot of life on earth (the decomposition of flora and fauna pumped millions of tons of CO2 into the atmosphere), and high levels of volcanism (volcanoes release acidic ash into the air, which causes acid rain that disolves rocks and releases trapped CO2 into the atmosphere).\n\nHumans did it, without natural factors, over the course of >150 years.",
            "title_similarity": "0.58421326",
            "sentiment_compound": -0.5283
        },
        {
            "id": "hh9635q",
            "score": 1,
            "text": "Wait there is a 0.1% who thinks it doesn’t how?",
            "title_similarity": "0.42267987",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh96ngl",
            "score": 1,
            "text": "The evidence is clear that anthropogenic change is real, but number of studies isn’t a good metric for epistemological truth.",
            "title_similarity": "0.42409247",
            "sentiment_compound": 0.8422
        },
        {
            "id": "hh971tn",
            "score": 1,
            "text": "would be great if more people cared.",
            "title_similarity": "0.27561086",
            "sentiment_compound": 0.8008
        },
        {
            "id": "hh97hze",
            "score": 1,
            "text": "yeah, we know this for the last 20 years, but what about the oil industry sponsored 0.1%, \n\nwhat about them, are you willing to ignore them and hurt the profits and feelings of global mass murderers like the oil industry.......don't you have a heart?",
            "title_similarity": "0.5871385",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hh97qog",
            "score": 1,
            "text": "I think the people who believe what scientists and research say already believe this. More studies won't convince the nonbelievers, you need a different approach.",
            "title_similarity": "0.4088516",
            "sentiment_compound": -0.2509
        },
        {
            "id": "hh97w2q",
            "score": 1,
            "text": "I wonder what the 1% think the source is",
            "title_similarity": "0.49832812",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh98h84",
            "score": 1,
            "text": "So what changed it before humans were around? Genuinely curious what in the entire life span of earth has brought the most change and how would it look if humans never came about?",
            "title_similarity": "0.50376296",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hh990zp",
            "score": 1,
            "text": "It would be dumb to think any other specie cause more destruction than the human race.",
            "title_similarity": "0.36239582",
            "sentiment_compound": -0.807
        },
        {
            "id": "hh99dbz",
            "score": 1,
            "text": "Was this ever a discussion?",
            "title_similarity": "0.135344",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh99gtr",
            "score": 1,
            "text": "This debate has been going for over thirty years, if only we knew then that no amount of proof would make people change their minds then we could have taken real action when it mattered the most.",
            "title_similarity": "0.45452973",
            "sentiment_compound": -0.296
        },
        {
            "id": "hh99zel",
            "score": 1,
            "text": "The science couldn't be more clear and, yet, I know of no one who is willing to give up meat or air travel, and this includes PHDs. We are addicted to our high carbon lifestyles and are not willingly going to give them up. We'll rail against the corporations and wait for the government to save us from ourselves.",
            "title_similarity": "0.4339826",
            "sentiment_compound": -0.1029
        },
        {
            "id": "hh9aiu6",
            "score": 1,
            "text": "There is no more doubt there hasn’t been for 5+ years a consensus doesn’t matter companies are never going to voluntarily sacrifice profits for morals never have never will. And politicians won’t sacrifice poll numbers, huge donations etc for change they don’t care. so sick of seeing these posts acting like this one is gonna be the one to initiate change",
            "title_similarity": "0.29095912",
            "sentiment_compound": 0.7151
        },
        {
            "id": "hh9b3b1",
            "score": 1,
            "text": "And yet politicians still can't make a strong decision to do real and significant steps to fight this probably the most dangerous crisis.",
            "title_similarity": "0.22489524",
            "sentiment_compound": -0.9057
        },
        {
            "id": "hh9d3r3",
            "score": 1,
            "text": "\"But point one of a percent is on MY team\"",
            "title_similarity": "0.4238515",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9d4lq",
            "score": 1,
            "text": "I just don't believe it, doesn't feel right -- the remaining 0.01 percent.. probably",
            "title_similarity": "0.32629406",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9djuj",
            "score": 1,
            "text": "99.9% very scientific figure there",
            "title_similarity": "0.6005243",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9drrc",
            "score": 1,
            "text": "Horrible headline. Journalists are scum",
            "title_similarity": "0.2491099",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hh9dt57",
            "score": 1,
            "text": "The 0.01%:  \n\n\n \"AHA! denied!\"  \n\n\nReally tho were kinda screwed.",
            "title_similarity": "0.3660659",
            "sentiment_compound": -0.75
        },
        {
            "id": "hh9dtxr",
            "score": 1,
            "text": "Horrible headline. Journalists are scum",
            "title_similarity": "0.2491099",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hh9dy2q",
            "score": 1,
            "text": "Just don’t mention China or India.",
            "title_similarity": "0.11221803",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9e8dx",
            "score": 1,
            "text": "The right is going to cling onto that 0.1% until the world is done",
            "title_similarity": "0.4574244",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9ee0y",
            "score": 2,
            "text": "This is nice to hear, but my question is always \"does it even matter?\". I've had so many discussions with people who say \"climate change is happening, but humans aren't causing it\"... practically speaking who gives a damn? If the earth is trending towards borderline uninhabitable we need to make that stop no matter WHAT or who is causing it. Like... we shouldn't stop it because we caused it, we should stop it because we **live** here.",
            "title_similarity": "0.5270713",
            "sentiment_compound": -0.4568
        },
        {
            "id": "hh9ejoz",
            "score": 1,
            "text": "Anyone have a link to the .1% i want to hear what they say",
            "title_similarity": "0.47233692",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hh9elam",
            "score": 1,
            "text": "Was it ever in question? Its the problem with capitalistic growth it assumes ressources are infinite.",
            "title_similarity": "0.40388525",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hh9ewfs",
            "score": 1,
            "text": "How does an inanimate object agree?",
            "title_similarity": "0.2113038",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh9ey6s",
            "score": 1,
            "text": "Cool, we already knew that. Now try to fix it.",
            "title_similarity": "0.2977565",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hh9fela",
            "score": 1,
            "text": "This is really groundbreaking for 1975",
            "title_similarity": "0.3225305",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9fkri",
            "score": 1,
            "text": "It's a shame conservatives can't read.",
            "title_similarity": "0.32906052",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hh9foxh",
            "score": 2,
            "text": "To be fair and balanced, shouldn’t we give the other 0.1% equal exposure?  Especially since the fix is expensive and might make currently rich people fractionally less rich?",
            "title_similarity": "0.49721223",
            "sentiment_compound": 0.8614
        },
        {
            "id": "hh9gmfi",
            "score": 1,
            "text": "MOre than-  \n\n\nYou.. You mean 100%? That.. That's called 100% isn't it? why didn't they just say that?",
            "title_similarity": "0.546577",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9gosw",
            "score": 1,
            "text": "I would be more surprised if the billions of humans occupying a planet didn't have an effect on the climate",
            "title_similarity": "0.59186965",
            "sentiment_compound": 0.2944
        },
        {
            "id": "hh9h5vm",
            "score": 1,
            "text": "I would say humans sped up climate change or humans exacerbated climate change. Not really \"caused\" climate change. As the climate always changes, always has, prior to humans ever existing. But not in a time span like this, so quickly.",
            "title_similarity": "0.64104044",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hh9hc5r",
            "score": 1,
            "text": "Agenda 21 knows. Now if we could just keep those pesky humans from reproducing we could have a cooler earth.",
            "title_similarity": "0.40810668",
            "sentiment_compound": -0.296
        },
        {
            "id": "hh9i1m3",
            "score": 1,
            "text": "Looks like everyone here agrees, I scrolled looking for someone who trying to argue global warming wasn’t real but I couldn’t find anyone. The question is, if everyone agrees, who’s stopping the change from happening?\nAlso, can human effect climate in a good way?\nHow much of the bad do we already counteract with good?",
            "title_similarity": "0.6272472",
            "sentiment_compound": 0.6747
        },
        {
            "id": "hh9i287",
            "score": 1,
            "text": "This is only \"controversial\" because fossil fuel billionaires turned it into a political issue.",
            "title_similarity": "0.46021163",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hh9ifcg",
            "score": 1,
            "text": "One if the issues with headline stats like these is that for years we were told 9 out of 10 dentists recommend sparkly toothpaste and then 9 out of 10 doctors recommend shiney toothpaste. \n\nIt's not that they rationalize the statistic in anyway, it's that in our mind it's a throwaway line. \n\nThe point should be that it is unequivocally believed and including how many support it gives leverage to the deniers. Leave the deniers with the antivaxers and the flat-earthers; you have as much chance as trying to convince them  Queen Elizabeth is not really reptilian.",
            "title_similarity": "0.5897705",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hh9irbk",
            "score": 1,
            "text": "Well it certainly wasn't the squirrels",
            "title_similarity": "0.1483429",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hh9jklq",
            "score": 1,
            "text": "Don't say that. Now the idiots will start disagreeing with this studies to act rebellious and feel special about themselves then make that their personality just like they did to covid-19 protocols and vaccination",
            "title_similarity": "0.29210663",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hh9jmzw",
            "score": 1,
            "text": "The climate is always changing, humans or no humans. A more correct term would be \"humans accelerate climate change\".",
            "title_similarity": "0.63663316",
            "sentiment_compound": -0.296
        },
        {
            "id": "hh9jxmw",
            "score": 1,
            "text": "well it's certainly not the penguins melting the ice caps.",
            "title_similarity": "0.31801245",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hh9jzvk",
            "score": 1,
            "text": "I thought the book was closed on this question after watching An Inconvenient Truth back in 2006.",
            "title_similarity": "0.34966782",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hh9keb4",
            "score": 1,
            "text": "Probably 99.9% of these doom and gloomers still aren't living full green in their personal lives though.\n\nCC is real but every people/civilization proba Ly has had a doomsday scenario and they were the smartest people of their time.",
            "title_similarity": "0.57992196",
            "sentiment_compound": 0.6542
        },
        {
            "id": "hh9koqj",
            "score": 1,
            "text": "Companies account for circa 70 percent of global emissions.",
            "title_similarity": "0.6282989",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9l747",
            "score": 1,
            "text": "I'm sure someone stupid will argue that we have a .1% chance of being just fine and they like the odds.",
            "title_similarity": "0.50886714",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hh9lhip",
            "score": 1,
            "text": "Republicans/Conservatives: So Weather? <insert \"there's a chance\" meme>",
            "title_similarity": "0.5605901",
            "sentiment_compound": 0.25
        },
        {
            "id": "hh9li4h",
            "score": 1,
            "text": "Well, it's either us or the farting cows.",
            "title_similarity": "0.2485365",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hh9m486",
            "score": 1,
            "text": "You need studies for that?",
            "title_similarity": "0.1496847",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9n0iu",
            "score": 1,
            "text": "Before you focus on the 0.1%, think of how hard it is for science to reach clear consensus on something like ivermectin for COVID 19.",
            "title_similarity": "0.47913188",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hh9nkid",
            "score": 1,
            "text": "Greed caused climate change",
            "title_similarity": "0.6049018",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hh9nl69",
            "score": 1,
            "text": "I don’t believe studies that say 99.9% of studies say.",
            "title_similarity": "0.6046061",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9ofvy",
            "score": 1,
            "text": "The other .1% was a Qanon member for those of you that are wondering.",
            "title_similarity": "0.45458734",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9qays",
            "score": 1,
            "text": "Ya but like... what about the 0.1%???",
            "title_similarity": "0.44218993",
            "sentiment_compound": 0.5845
        },
        {
            "id": "hh9qd31",
            "score": 1,
            "text": "They only people who don't agree now, aren't scientists.",
            "title_similarity": "0.28787768",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hh9qvgl",
            "score": 1,
            "text": "I bet it’s that’s dentist who hates toothpaste that’s keeping us from a full hundo.",
            "title_similarity": "0.2783236",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hh9rop9",
            "score": 1,
            "text": "Which makes me wonder what caused Climate Change before humans existed?",
            "title_similarity": "0.61187124",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9s2is",
            "score": 1,
            "text": "Wait why is there even a debate",
            "title_similarity": "0.14509636",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9slmi",
            "score": 1,
            "text": "Of course they do. Now levy the carbon tax ASAP!!!",
            "title_similarity": "0.56520474",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9srah",
            "score": 1,
            "text": "And yet what we are doing is like pissing on someone’s house when it’s on fire",
            "title_similarity": "0.3081216",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hh9urs8",
            "score": 2,
            "text": "If only we could all do something about it in some comprehensive global way.  It’s so depressing reading about shorter winters and melting snow and icecaps  constantly. Or how summers are hotter and spring comes earlier and earlier to ecosystems. It’s all so overwhelming and sad.",
            "title_similarity": "0.49389067",
            "sentiment_compound": -0.6937
        },
        {
            "id": "hh9usmm",
            "score": 1,
            "text": "yawnzz, what really matters is that driving an electric car and voting democrat isn't going to do a damn thing. Stop importing products from the biggest polluting countries and start figuring out how to capture carbon... else you are a posing fool",
            "title_similarity": "0.4532164",
            "sentiment_compound": -0.7512
        },
        {
            "id": "hh9uv55",
            "score": 1,
            "text": "The argument that temperature variability happened 250,000 years ago I find comical because humans weren't here.  Might we want to attempt to save humanity from utter collapse?",
            "title_similarity": "0.6050564",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hh9v1vh",
            "score": 1,
            "text": "I want to see this .1%",
            "title_similarity": "0.43243903",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hh9vozk",
            "score": 1,
            "text": "Republicans: \"Let me look closer at that 0.1% of studies.  Hey, thanks for finding some scientists who agree with me, by the way!  Teach the controversy!   Spend nothing on the environment until 100% of scientists agree!\"",
            "title_similarity": "0.651805",
            "sentiment_compound": 0.8306
        },
        {
            "id": "hh9vyc5",
            "score": 1,
            "text": "Wow, that's a pretty convincing number.",
            "title_similarity": "0.26271284",
            "sentiment_compound": 0.875
        },
        {
            "id": "hh9w4hm",
            "score": 1,
            "text": "But let’s talk about that .1%\n\n- the Media",
            "title_similarity": "0.6036798",
            "sentiment_compound": 0.0
        },
        {
            "id": "hh9w4tl",
            "score": 2,
            "text": "Some scientist peer reviewed all studies (26) that at the time denied Climate change. EVERY SINGLE ONE of them had errors in their calculations.",
            "title_similarity": "0.5448806",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hh9wb65",
            "score": 1,
            "text": "Well corporations are considered humans by law soooooo…..",
            "title_similarity": "0.4373314",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hh9wj5p",
            "score": 1,
            "text": "If the naysayers ever admit that this is true, I bet all they'll say is \"oh well, too late now. Gonna go fill up mah diesel with complete exhaust system delete\"",
            "title_similarity": "0.46123224",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hh9wro9",
            "score": 1,
            "text": "According to my research, 99% of studies agree: grass is green.",
            "title_similarity": "0.5631152",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh9wwzk",
            "score": 1,
            "text": "What do plants like to eat again?",
            "title_similarity": "0.17565888",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hh9x4sm",
            "score": 1,
            "text": "Ehh i don't refer to rich elite capitalistic fucks as human beings",
            "title_similarity": "0.28583246",
            "sentiment_compound": -0.7205
        },
        {
            "id": "hh9x6ze",
            "score": 1,
            "text": "The earth will be fine. We’ll kills tons of species, destroy entire ecosystems but in thousands or millions of years, the earth will repair itself and create new life and environments. \n\nWe’re not killing the earth, we’re killing ourselves. It’s literally like we’re all smokers",
            "title_similarity": "0.53467786",
            "sentiment_compound": 0.1215
        },
        {
            "id": "hh9xdn7",
            "score": 1,
            "text": "Honestly these studies and articles about studies are a waste of time imo. Anbody that doesn't believe it, isn't going to believe it no matter how many studies you do.\n\nThe political right lives in a world completely disconnected from reality.",
            "title_similarity": "0.2932545",
            "sentiment_compound": 0.0325
        },
        {
            "id": "hh9y3lu",
            "score": 1,
            "text": "Send the .01 my way please. I have a plan.",
            "title_similarity": "0.45136505",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hh9yxhs",
            "score": 1,
            "text": "Well it certainly wasn’t the squirrels.",
            "title_similarity": "0.15480788",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hh9z3wu",
            "score": 1,
            "text": "So you're saying, we have a chance",
            "title_similarity": "0.22127268",
            "sentiment_compound": 0.25
        },
        {
            "id": "hh9zxgy",
            "score": 1,
            "text": "There are 8 billion of us I'm not surprised we have some impact on the world.",
            "title_similarity": "0.6346528",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hha0lg9",
            "score": 1,
            "text": "Republicans be like:  But .1% could be right, so we should do nothing.",
            "title_similarity": "0.4480091",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hha0mlm",
            "score": 1,
            "text": "And the 0.01% of humanity are responsible for the majority of it courtesy of global industrial waste and ecological disasters by their companies and associated companies which they own shares of.",
            "title_similarity": "0.6402325",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hha0mto",
            "score": 1,
            "text": "Studies would say that. However my uncle says otherwise a hundred percent of the time.\n\nGame set match",
            "title_similarity": "0.41794437",
            "sentiment_compound": 0.0
        },
        {
            "id": "hha1lyd",
            "score": 1,
            "text": "Ackshully, God created humans, so God is to blame",
            "title_similarity": "0.47483307",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hha21j9",
            "score": 1,
            "text": "Sorry why is this news? Who else would have done it? The dolphins?",
            "title_similarity": "0.23983082",
            "sentiment_compound": -0.212
        },
        {
            "id": "hha24uw",
            "score": 1,
            "text": "Well this news is most unwelcome.",
            "title_similarity": "0.17210904",
            "sentiment_compound": -0.2247
        },
        {
            "id": "hha2bvg",
            "score": 1,
            "text": "Climates have always changed with or without human intervention",
            "title_similarity": "0.3347118",
            "sentiment_compound": 0.0
        },
        {
            "id": "hha2ohx",
            "score": 1,
            "text": "But I'm convinced it's not real thanks to my 10 minutes of Facebook \"research\". \n\n\"Everyone is dumb except me.\"\n\n\n\nWe're so doomed.",
            "title_similarity": "0.51066387",
            "sentiment_compound": -0.9268
        },
        {
            "id": "hha31ed",
            "score": 2,
            "text": "The 0.01% that don’t agree were paid off by fossil fuel companies",
            "title_similarity": "0.56894785",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hha33u1",
            "score": 1,
            "text": "That this is still being said as if it’s news, is the shocking thing.",
            "title_similarity": "0.265653",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hha345q",
            "score": 1,
            "text": "“So you’re saying there’s a chance!!!”  Every Climate Change Denier",
            "title_similarity": "0.71063834",
            "sentiment_compound": -0.5229
        },
        {
            "id": "hha3fhk",
            "score": 2,
            "text": "**GOP:** “Ah-ha! So we’re not 100% certain. We definitely need more investigation into this before we can commit to a plan.”",
            "title_similarity": "0.30670348",
            "sentiment_compound": 0.5232
        },
        {
            "id": "hha3sw8",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.14681391"
        },
        {
            "id": "hha3tg9",
            "score": 2,
            "text": "I honestly don’t know why this topic is debateable… But then I remember the number of people who are anti-vaccine…",
            "title_similarity": "0.42523828",
            "sentiment_compound": 0.3506
        },
        {
            "id": "hha3vv7",
            "score": 1,
            "text": "So you're telling me there's a chance?",
            "title_similarity": "0.23503685",
            "sentiment_compound": 0.25
        },
        {
            "id": "hha4c2k",
            "score": 1,
            "text": "We didn’t need to prove it this throughly. Anyone who could be convinced with evidence would have acknowledged it by now. \n\nSince the largest polluters are commercial sources, this decades-long campaign playing it off as a moral decision for individual consumers was a giant waste of time, as intended.",
            "title_similarity": "0.46159434",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hha4hi8",
            "score": 1,
            "text": "I hate how all of this and other research points a finger at regular people and shaming us on what we have done.  Yet, large corporations cause significantly larger impact and can make the biggest difference in improving our environment.",
            "title_similarity": "0.45382702",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hha4wna",
            "score": 1,
            "text": "Climate catastrophe, is a better term for it. I hope it catches on.",
            "title_similarity": "0.58554566",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hha4wqb",
            "score": 1,
            "text": "0.1% of studies is what deniers will cling to",
            "title_similarity": "0.5374727",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hha527n",
            "score": 1,
            "text": "I wonder who funded 0.1% of studies",
            "title_similarity": "0.48200563",
            "sentiment_compound": 0.0
        },
        {
            "id": "hha5hd3",
            "score": 1,
            "text": "Does anybody ever wonder who the .1% are and how they became climate scientists?",
            "title_similarity": "0.6793138",
            "sentiment_compound": 0.0
        },
        {
            "id": "hha5t8b",
            "score": 1,
            "text": "So you're telling me there's a chance!",
            "title_similarity": "0.2609727",
            "sentiment_compound": 0.3164
        },
        {
            "id": "hha6cxh",
            "score": 1,
            "text": "If we didn't, the volcanoes would.",
            "title_similarity": "0.41561377",
            "sentiment_compound": 0.0
        },
        {
            "id": "hha6dzi",
            "score": 1,
            "text": "Earth vs. Humans - who will win",
            "title_similarity": "0.44234347",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hha6z9c",
            "score": 1,
            "text": "Cafes should up charge customers an extra $1 to put takeaway coffees in a disposable cup. They will think twice about bringing a reusable one.",
            "title_similarity": "0.50812876",
            "sentiment_compound": 0.0
        },
        {
            "id": "hha6zff",
            "score": 1,
            "text": "So you’re saying there’s a chance!? Woo!",
            "title_similarity": "0.24555963",
            "sentiment_compound": 0.6892
        },
        {
            "id": "hha70l0",
            "score": 1,
            "text": "Yeah but that that .1%!!! What do they know!!!",
            "title_similarity": "0.50243515",
            "sentiment_compound": 0.4153
        },
        {
            "id": "hha7227",
            "score": 1,
            "text": "How come that 0.1% seem to control half of our political agenda towards climate crisis?",
            "title_similarity": "0.72955316",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hha77bc",
            "score": 1,
            "text": "Great. Wonderful. Now how do we stop it, and then let’s do it.",
            "title_similarity": "0.28072602",
            "sentiment_compound": 0.765
        },
        {
            "id": "hha7g0q",
            "score": 1,
            "text": "The problem is not proving climate change... the problem is trying to convince the people who can make changes to do something about it.",
            "title_similarity": "0.3871296",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hha7i1c",
            "score": 1,
            "text": "Oh thank god it’s finally confirmed. Here I thought it was those damn birds again.",
            "title_similarity": "0.34812182",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hha7mtn",
            "score": 1,
            "text": "I want to see some of the studies that pose other causes.  Not because I believe them, but I'm just curious what the 0.01% found.",
            "title_similarity": "0.38584626",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hha7za6",
            "score": 1,
            "text": "And water makes things wet...",
            "title_similarity": "0.15107827",
            "sentiment_compound": 0.0
        },
        {
            "id": "hha847y",
            "score": 1,
            "text": "Climate change deniers: So your saying there’s a chance!!",
            "title_similarity": "0.6328237",
            "sentiment_compound": -0.1739
        },
        {
            "id": "hha8qik",
            "score": 1,
            "text": "At what point will we start mining comets for their ice to drop into the ocean?",
            "title_similarity": "0.36953133",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hha8t3u",
            "score": 1,
            "text": "Because most of the stuff on the Subreddit can be incorrect, I wouldn’t mind if I said something a bit stupid.\n\nIf I throw a massive chunk of diarrhea that is the size of Earth into the sun will it explode?",
            "title_similarity": "0.47104603",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hha8x3s",
            "score": 1,
            "text": "Yeah, but that study was commenced by human hating robots",
            "title_similarity": "0.34233364",
            "sentiment_compound": -0.5927
        },
        {
            "id": "hha90dv",
            "score": 1,
            "text": "How are we even still debating this...",
            "title_similarity": "0.1158927",
            "sentiment_compound": 0.0
        },
        {
            "id": "hha91pi",
            "score": 1,
            "text": "I could have told them for a $1. It wasn’t monkeys that are driving and burning fossil fuels??",
            "title_similarity": "0.59068704",
            "sentiment_compound": 0.0
        },
        {
            "id": "hha939j",
            "score": 1,
            "text": "*Sorts by controversial* throws up",
            "title_similarity": "0.2604716",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hha9s0q",
            "score": 1,
            "text": "I cannot rationally believe that of all the studies conducted on climate change that 99.9% of them concluded that climate change is/was caused by humans.\n\nThe mere existence of bad faith actors would have more than a .01% on the impact of a group of studies like this.\n\nDon’t get me wrong. I’m not a climate change naysayer in the slightest, but I simply don’t believe that society as a whole are able to 99.9% conclusive on damn near anything.",
            "title_similarity": "0.6976797",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hha9xo7",
            "score": 1,
            "text": "My eyes are on the turtles. They up to something",
            "title_similarity": "0.1178747",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhaa99g",
            "score": 1,
            "text": "Doesn't matter any more.  We're way too far gone.",
            "title_similarity": "0.21270445",
            "sentiment_compound": -0.0191
        },
        {
            "id": "hhaaf8h",
            "score": 1,
            "text": "I’d like to see the 0.01 research paper.",
            "title_similarity": "0.48665085",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hhaahyl",
            "score": 1,
            "text": "And it is literally less that .01% of the global population is preventing us from saving our selves from a miserable future, for their short term financial gain.  These people inhabit corporeal bodies and have addresses, but we have to for some reason talk about the coming extinction of all life on planet earth as though it were a vague natural phenomenon we have no control over.",
            "title_similarity": "0.51433706",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hhaaoh3",
            "score": 1,
            "text": "I'm going to go out on a limb and say humans 100% caused climate change without a doubt...",
            "title_similarity": "0.747604",
            "sentiment_compound": 0.2755
        },
        {
            "id": "hhaarrl",
            "score": 1,
            "text": "True but it's the corporations that do the most damage.",
            "title_similarity": "0.42929387",
            "sentiment_compound": -0.5913
        },
        {
            "id": "hhabdrr",
            "score": 1,
            "text": "Ooooooo! New sub! I call it! r/1000thscientist\n\nFor opinions so unpopular and outlandish, they can’t be real. Who wants to mod??",
            "title_similarity": "0.47000295",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhabno9",
            "score": 1,
            "text": "Right wing parties: So You're Telling Me There's A Chance?",
            "title_similarity": "0.42173642",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hhabov1",
            "score": 1,
            "text": "So what you're saying is, there's a chance we didn't.",
            "title_similarity": "0.21947786",
            "sentiment_compound": 0.25
        },
        {
            "id": "hhac2yf",
            "score": 1,
            "text": "So you Tell me there is a Chance… :)",
            "title_similarity": "0.22575909",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hhac4ul",
            "score": 1,
            "text": "I think we're all ignoring the elephant in the room. That .1% that's the true cause! Don't blame us peeps!",
            "title_similarity": "0.47596937",
            "sentiment_compound": 0.4059
        },
        {
            "id": "hhac51a",
            "score": 1,
            "text": "Well the silver lining here is that there is not much \"more than 99.9%\"",
            "title_similarity": "0.48703775",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hhacikm",
            "score": 1,
            "text": "Like what science says matters to these people around here...",
            "title_similarity": "0.38471228",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hhaddf4",
            "score": 1,
            "text": "It blows my mind that massive numbers of people exist that think climate change doesn't exist or is a hoax. In an age where you can access large amounts of accurate information, scientific studies and data at the touch of a key. The proof that humans are causing climate change is undeniable.\n\nI feel that these selfish people (like anti-maskers/vaxxers & Covid denialists) don't believe in anything that is inconvenient to them or doesn't fit into their small minded, bull-headed, narrow narrative.\n\nI mean we even have growing numbers of people who are signing up to the absolute fuckery of Holocaust denial....",
            "title_similarity": "0.56843483",
            "sentiment_compound": -0.6715
        },
        {
            "id": "hhadmao",
            "score": 1,
            "text": "And Joe Manchin helped",
            "title_similarity": "0.25670746",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhado7m",
            "score": 1,
            "text": "I feel like the wording of this article may be slightly incorrect. What it should say is that it is 99.9% agreed upon that humans have accelerated global warming to near devastating climate change. I feel like climate change is natural and certain natural events do definitely accelerate global warming (such as volcanic explosions). However, we add humans have brought about so much harm to the environment by burning fossil fuels, and destroying our reefs and natural habits, that we are at the point of almost no return in regards to climate change and the environment.",
            "title_similarity": "0.74116075",
            "sentiment_compound": 0.6142
        },
        {
            "id": "hhae5et",
            "score": 1,
            "text": "Good to see that they didn’t call it “global warming”. \n\nAlso, isn’t this common knowledge by now? Anyone who disagrees is just ignoring blatant facts.",
            "title_similarity": "0.47263762",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hhaeysr",
            "score": 1,
            "text": "Caused is misleading, accelerated yes but not caused specially considering global temperatures of the past",
            "title_similarity": "0.5127151",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhafma3",
            "score": 1,
            "text": "Humans running massively detrimental and profitable corporations*",
            "title_similarity": "0.4251508",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hhag0zx",
            "score": 1,
            "text": "I think I am going to do my own research.",
            "title_similarity": "0.21583535",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhag1uc",
            "score": 1,
            "text": "It blows my mind that this is still up for debate. I mean if you look at climate changes from the pre-industrial era compared to the modern era the evidence is clear. Even someone who has no experience with climatology at all should be able to understand the rapid changes that occured when factories, cars and large scale agriculture became globalized.",
            "title_similarity": "0.67123336",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hhaga92",
            "score": 1,
            "text": "The deniers argument is, that all those scientists are in on a grift to get those sweet millions of government funding",
            "title_similarity": "0.5608201",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hhagbw0",
            "score": 1,
            "text": "There’s a funny joke about the .01%ers here somewhere. Lmk when they care about it",
            "title_similarity": "0.51124334",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hhagef4",
            "score": 1,
            "text": "I would think it goes without saying, that if you continue to pump certain gasses into a an atmosphere that has a finite size, eventually it's going to affect it. That doesn't take science to figure out. So for those that are opposed to climate change, they are either activly working  to discredit it, or they are idiots.",
            "title_similarity": "0.5029331",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hhagkkk",
            "score": 1,
            "text": "It was always human vs nature, yet eventually nature wins.",
            "title_similarity": "0.30285043",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hhagsko",
            "score": 2,
            "text": "But you can bet humans will do back flips to say it's not.",
            "title_similarity": "0.3431367",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhagxl5",
            "score": 1,
            "text": "New bills gotta be put in place against businesses that prioritize profits over ethics",
            "title_similarity": "0.37640122",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hhahikk",
            "score": 1,
            "text": "But isn't this like saying \"More than 99.9% of studies agree: Humans cause ocean pee concentration change\"\n\nMost die hard climate change deniers either deny the existence of climate change outright (in which case these studies would be deemed moot to begin with) or they insist that the human impact is not the most significant one. So surely if you're trying to \"BTFO the climate change deniers\" you should be looking at this from other angles? Otherwise this article just sounds like patting yourself on the back for no real gain.",
            "title_similarity": "0.6491488",
            "sentiment_compound": -0.9449
        },
        {
            "id": "hhai627",
            "score": 1,
            "text": "This is great and everything but seems like a pointless study. The science has been there for a while. \n\nThe debate on climate change has shifted. Here's a brief timeline of how this debate has shifted over time:\n\nScience says man is changing the climate and people deny climate change's existence. \n\nThose people that used to deny climate change's existence then agreed it was real but started denying that mankind had any effect on it. \n\nScience proved manmade climate change is real. The people that previously denied it's existence shifted to the question of \"ok it's real but does it even matter\". \n\n_\n\nMost conservatives believe in man made climate change at this point. They just think it doesn't matter or that it's not the governments place to do anything about it. Now the answer is yes it does matter and yes the government does have to play some role in dealing with the issue but that's not my point. \n\nMy point is that a better and more useful study would be about how our impacts have already negatively effected mankind instead of targeting the tiny percentage of people that still don't believe.",
            "title_similarity": "0.60127276",
            "sentiment_compound": 0.9304
        },
        {
            "id": "hhaiciz",
            "score": 1,
            "text": "What would the ideal temperature for the planet be?",
            "title_similarity": "0.43586916",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hhainhv",
            "score": 1,
            "text": "Well what does the .1% believe caused climate change?",
            "title_similarity": "0.81734484",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hhaj3c1",
            "score": 1,
            "text": "Third world dictators would love to have numbers that good in their \"elections\". Eat your heart out, North Korea.",
            "title_similarity": "0.46811354",
            "sentiment_compound": 0.9062
        },
        {
            "id": "hhaj7eu",
            "score": 1,
            "text": "We needed studies for this conclusion?",
            "title_similarity": "0.2141974",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhajg8k",
            "score": 1,
            "text": "The climate has changed outside of humans though no? So is it “humans accelerated climate change beyond repair” or something else?",
            "title_similarity": "0.59897065",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhak5bi",
            "score": 1,
            "text": "poluting companies: i'ma need you to get that to a 100% before we believe ya",
            "title_similarity": "0.6077992",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhal9z8",
            "score": 1,
            "text": "And the 0.1% is funded by the Koch Brothers...",
            "title_similarity": "0.4542598",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhalb2s",
            "score": 2,
            "text": "You mean corporations",
            "title_similarity": "0.4331069",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhalg0r",
            "score": 1,
            "text": "Oh good, I was starting to think it was zebras.",
            "title_similarity": "0.20201094",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hhamkkm",
            "score": 1,
            "text": "And that means that we can fix it right\n\nRight…?",
            "title_similarity": "0.33829838",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhamwwx",
            "score": 1,
            "text": "The climate has changed before humans, the climate will change after humans.\n\nSome cataclysmic event will reset things for a while in the middle.",
            "title_similarity": "0.5676602",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhanhsn",
            "score": 1,
            "text": "Ok I am interested in those that don't though",
            "title_similarity": "0.13743165",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hhankno",
            "score": 1,
            "text": "Our desire for more does ...more more more",
            "title_similarity": "0.2740068",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hhaplgq",
            "score": 1,
            "text": "That’s just what the Crab people want us to believe.",
            "title_similarity": "0.26329136",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hhaptk1",
            "score": 1,
            "text": "The benefits we get from what causes climate change outweighs the damage climate change has on people by A LOT. Sure some people need to pollute a lot less. But we can’t stop third world countries from industrializing. They need it to thrive.",
            "title_similarity": "0.598843",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hhaq7kw",
            "score": 1,
            "text": "But there is still that 0.01% that cant be ignored. I am that 0.01% and I would like to share with you, all my evidence why climate change is not real... Ahem...\n\nWhat is real? How do you define real? If real is something you can taste, touch, see, or hear. Then real is simply electrical signals interpreted by the brain.",
            "title_similarity": "0.6272485",
            "sentiment_compound": 0.834
        },
        {
            "id": "hhaqe3t",
            "score": 1,
            "text": "The rich and powerful know. Why they enjoying life now before they croak and leave us with a planet beyond unstable after years of shouting warnings by every scientist.\n\nAnyone against controlling climate change should be kicked out of our society. Tired of how cuddled the idiots in this world are. Everyone is affected if these idiots win. When the young and lower class have had enough and realize that we have more things in common; the 95% unites against the rich 5% that are holding millions back. The rich really need to be ate now before it’s too late.",
            "title_similarity": "0.49087438",
            "sentiment_compound": 0.9042
        },
        {
            "id": "hhaqmjb",
            "score": 1,
            "text": "Who caused it before us?  This isn't the first massive change of climate in earth",
            "title_similarity": "0.62640744",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhaqrvb",
            "score": 1,
            "text": "And we can fix by eating a plant based diet and planting more trees",
            "title_similarity": "0.34569162",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhaqrvv",
            "score": 1,
            "text": "How can people say that humanity doesn’t have a negative impact on the environment?",
            "title_similarity": "0.4080456",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hhaqzev",
            "score": 1,
            "text": "So? What are YOU going to do about it? Post on Reddit about it? Make a sign?",
            "title_similarity": "0.37291223",
            "sentiment_compound": 0.0
        },
        {
            "id": "hharo86",
            "score": 1,
            "text": "The .1% were done by Republican \"scientists..",
            "title_similarity": "0.60969794",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhas1es",
            "score": 1,
            "text": "But that isn’t what I want to hear so I reject your reality and substitute my own.",
            "title_similarity": "0.14889324",
            "sentiment_compound": -0.545
        },
        {
            "id": "hhas1qc",
            "score": 1,
            "text": "Well yeah if you have eyes",
            "title_similarity": "0.16157077",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hhas354",
            "score": 1,
            "text": "Does anyone ever wonder how the solar cycle and earth’s magnetic field relate to and influence climate change?",
            "title_similarity": "0.56513584",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhaskxf",
            "score": 1,
            "text": "Just wait till I cite the less than 0.1% that show we aren’t causing climate change.",
            "title_similarity": "0.5134543",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhasp10",
            "score": 1,
            "text": "I'm curious as to what has the most effect towards climate change when it comes to human involvement. Fossil fuels, live stock methane, ocean plastic pollution? I'm going to learn towards ocean pollution.",
            "title_similarity": "0.5474319",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hhasrtn",
            "score": 1,
            "text": "Durrrr... but... durrrr... that uhhh...  durrrr... that 0.1% eh... umm...  durrr.... they're ummm... Do your own research! There... I got you!",
            "title_similarity": "0.47569785",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhasyoz",
            "score": 1,
            "text": "Which is ironic given how the climate change caused humans. How the turntables.",
            "title_similarity": "0.6426183",
            "sentiment_compound": -0.128
        },
        {
            "id": "hhat3im",
            "score": 2,
            "text": "But that .1% means we have to devote an entire channels worth of 'news' pointing out those studies that show climate change isn't caused by humans purposefully ignoring the 99.9% that do.",
            "title_similarity": "0.7577356",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hhatffq",
            "score": 1,
            "text": "If you think about how many gallons of just gasoline you burn and multiply that by the number of people in your town/city and then by the number of cities in the country and remember that countries much bigger and smaller across the world also burn large quantities of fuel EVERYDAY how is it then surprising that all that burned gasoline doesn’t have an impact on the atmosphere when it used to be underground instead. Definitely we caused it and all it takes is understanding that we do this and burn coal and natural gas and other types of fossil fuels in vast quantities.",
            "title_similarity": "0.5365854",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hhauvg9",
            "score": 1,
            "text": "So, 99.91% of studies agree?",
            "title_similarity": "0.6951065",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hhav0yz",
            "score": 1,
            "text": "They still don't know how to stop it, so we're all doomed",
            "title_similarity": "0.12773275",
            "sentiment_compound": -0.7693
        },
        {
            "id": "hhavs53",
            "score": 1,
            "text": "Corporations don’t care. The CEOs will be sitting on a pile of ashes claiming “yeah we destroyed the earth but we made so much profit.”",
            "title_similarity": "0.42981046",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhaxpqe",
            "score": 1,
            "text": "99.9 percent of WHAT studies?",
            "title_similarity": "0.6235597",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhayndp",
            "score": 2,
            "text": "\"NO-ONE CARES\" is what has caused climate change.\n\n2-cents",
            "title_similarity": "0.61365056",
            "sentiment_compound": 0.5766
        },
        {
            "id": "hhayrml",
            "score": 1,
            "text": "its not 100% so that means we can keep shrugging and not doing anything about it",
            "title_similarity": "0.21332061",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhays2b",
            "score": 1,
            "text": "Are we still even having this debate? It’s 2021. The world is round. Vaccines work and WE are causing climate change daily.",
            "title_similarity": "0.65421057",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhaze17",
            "score": 1,
            "text": "But who caused humans?  I blame God, it was Gods fault.",
            "title_similarity": "0.36199182",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hhb0m13",
            "score": 1,
            "text": "Was this under debate?",
            "title_similarity": "0.12119186",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhb11yc",
            "score": 1,
            "text": "Money says that no one cares. Corporations and Businesses are the main drive for climate change. Its going to keep happening until the world is squeezed dry of its resources.",
            "title_similarity": "0.56488144",
            "sentiment_compound": -0.569
        },
        {
            "id": "hhb1cco",
            "score": 1,
            "text": "The Greedy 1% caused climate change .. the military probly helped ...",
            "title_similarity": "0.749074",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hhb1wki",
            "score": 2,
            "text": "All you need to do it f you doubt it is look at the theory behind climate change then look at a chart of industrialisation and.co2 levels in the atmosphere",
            "title_similarity": "0.6096419",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hhb26xo",
            "score": 4,
            "text": "I don’t know how anyone can believe pumping billions of tons of pollution into the atmosphere can do anything else…",
            "title_similarity": "0.51574033",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhb2f82",
            "score": 2,
            "text": "conservatives : check out the 0.1% I paid.",
            "title_similarity": "0.5742253",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhb2w59",
            "score": 1,
            "text": "🤔not more like were speeding up climate change? Since earth's climate has changed over millions of years? But humans did so in a way that wouldnt have been natural right? Thats the difference🤔",
            "title_similarity": "0.7035589",
            "sentiment_compound": -0.3201
        },
        {
            "id": "hhb352o",
            "score": 2,
            "text": "I’m imagining a room full of people talking about humans causing climate change and one dude in the back screaming it was aliens",
            "title_similarity": "0.4771536",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hhb3p7d",
            "score": 2,
            "text": "How refreshing it is to see an article like this, 20 years after I first heard of the problem.\n\nThe problem isn't climate change, the problem is climate change deniers.\nLet's get rid of them.",
            "title_similarity": "0.6018453",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hhb440e",
            "score": 2,
            "text": "Doesn't take a genius to figure this one out.",
            "title_similarity": "0.19426852",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhb530u",
            "score": 1,
            "text": "More than 99.9% of studies agree: I know",
            "title_similarity": "0.71210223",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hhb5hwg",
            "score": 1,
            "text": "Was there reallt any doubt?",
            "title_similarity": "0.17409292",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hhb5iib",
            "score": 1,
            "text": "So you're saying you're not SURE?",
            "title_similarity": "0.11182062",
            "sentiment_compound": -0.3621
        },
        {
            "id": "hhb62ea",
            "score": 1,
            "text": "Technically the cars did it",
            "title_similarity": "0.3005392",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhb6345",
            "score": 1,
            "text": "How can something be more than 99.9%? Wouldn’t that make it 100%?",
            "title_similarity": "0.6368191",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhb6pee",
            "score": 1,
            "text": "Could we focus on how to solve the problem rather than pointing at specific causes and people? Why should we care if it's volcanoes or China's industries? Stopping the industries or the volcanoes won't magically make the CO2 level decrease anyway. We need to find and use active measures at tremendous levels to decrease the CO2 level, not just expect things to be solved just by shutting down industries or finding how to make volcanoes calm down. \n\nBesides, focusing on culprits loses people and efforts trying to fight off people who could have helped. I'm yet to see any instance of witch hunting that helped any kind of situation. \n\nIf only all the efforts that have been wasted on witch hunting and asking politicians to do something they clearly never wanted to do would have been used to find helpful techs, we wouldn't be in such a dire situation...",
            "title_similarity": "0.40470463",
            "sentiment_compound": -0.4871
        },
        {
            "id": "hhb757o",
            "score": 1,
            "text": "That 0.1% study is that one dentist that says that toothpaste is bad",
            "title_similarity": "0.4781958",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hhb7vnq",
            "score": 1,
            "text": "B U L L S H I T\n\nYour playing into their hands and building your own prisons.",
            "title_similarity": "0.2627117",
            "sentiment_compound": 0.8506
        },
        {
            "id": "hhb86s6",
            "score": 1,
            "text": "It's axiomatic at this point. Those dragging their feet are too ignorant or too selfish to change their mind  and need to be left behind with the flat-earthers and anti-evolution crowd.",
            "title_similarity": "0.2327751",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hhbbuta",
            "score": 8,
            "text": "Yeah but 50% of the country will only listen to that last 0.1%",
            "title_similarity": "0.43698525",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hhbc4v4",
            "score": 2,
            "text": "yeah and humans can solve it using nuclear power but instead we're wasting billions into wind/solar and my personal favorite biofuels (nice way to say burning wood mass) because some are afraid of a nuclear fallout.\n\nYou need to decide, do you want a low-energy or high-energy future? Europe & Asia are already showing you that this low-energy bs doesn't work.\n\nProgress means nuclear fission, fusion then antimatter... Anything else won't give us the land needed to plant more trees & recycle",
            "title_similarity": "0.5011144",
            "sentiment_compound": 0.5577
        },
        {
            "id": "hhbe52y",
            "score": 1,
            "text": "Republicans in the US and their ilk around the globe, however, will continue to cite those .1% “studies.”",
            "title_similarity": "0.59060895",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhbeokv",
            "score": 1,
            "text": "And now Mother Nature will fix it",
            "title_similarity": "0.3364122",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhbg7cc",
            "score": 1,
            "text": "And 0.1% studies disagree which is still quite concerning..",
            "title_similarity": "0.3911392",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hhbh1w2",
            "score": 1,
            "text": "but I, internet reader, have reviewed all research and have come to a conclusion that it's all wrong and I know better because of my expertise.",
            "title_similarity": "0.40108708",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hhbjxow",
            "score": 1,
            "text": "I didn’t know Joe Manchin authored a climate study",
            "title_similarity": "0.5556359",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhbn7lf",
            "score": 1,
            "text": "The 0.1% blame what exactly? The libs?",
            "title_similarity": "0.42638943",
            "sentiment_compound": -0.4137
        },
        {
            "id": "hhbr0ev",
            "score": 1,
            "text": "Bill Gates agrees… just take the vaccine…",
            "title_similarity": "0.43918234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhbsgu6",
            "score": 1,
            "text": "It's not \"Caused\" It's sped up the procedure",
            "title_similarity": "0.29769814",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhbsimi",
            "score": 1,
            "text": "Comment for the algorithm because more people should see this!",
            "title_similarity": "0.33546084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hhbtf5d",
            "score": 1,
            "text": "Idk that one guys didn’t his research on Facebook and his self study disagreed.  \n\nHe also want you to know the earth is flat and trump is still president.",
            "title_similarity": "0.35732555",
            "sentiment_compound": -0.34
        },
        {
            "id": "hhbum7v",
            "score": 1,
            "text": "That's because all the studies that contradict man-made climate change aren't allowed to be published. So even if you had 40% of scientists who disagree they aren't allowed a voice anyways.",
            "title_similarity": "0.49810296",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hhbz4pg",
            "score": 1,
            "text": "Imagine being in that 0.01% bracket of scientists who are clearly wrong and know it, but are paid to say otherwise.",
            "title_similarity": "0.5315946",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hhc75et",
            "score": 1,
            "text": "And guess how much of a percentage the climate deniers will hang onto.",
            "title_similarity": "0.6653404",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hhcet7r",
            "score": 1,
            "text": "I think there is no doubt that there is scientific consensus here. But I think it’s arguably dangerous to keep quoting figures associated with consensus, because “consensus” in itself is not a scientific measure. As a result it can play into the hands of those who claim such consensus is systematically created and artificial. Instead it would be much better to talk in terms of strength of evidence and levels of certainty held by scientists. For example, 99.9% consensus does not reference the degree of confidence with which the view is held. It could simply be that 99.9% believe this hypothesis is currently the best. That’s different to it being 99.9% likely to be true.\n\nThere seems to be a lot of things written about the idea that such levels of scientific consensus in a field means it is almost certainly correct. But this simply doesn’t reflect history of science, particularly when looking over a time span of decades. \n\nBy quoting consensus percentages, it almost creates an atmosphere where alternative hypothesis is heresy. Yet alternative hypothesis is literally the core starting point of scientific progress and endeavour. Hence, quoting these kind of consensus figures ironically comes across as almost anti-science to those taking a more nuanced and pure scientific perspective.",
            "title_similarity": "0.5085064",
            "sentiment_compound": 0.9869
        },
        {
            "id": "hhdygzs",
            "score": 2,
            "text": "Caused \"rapid\" climate change. We can't stop the earth from warming up but we can slow it down quite a bit without polluting as much. We are still technically in the ice age, things will warm up. Please Google it.",
            "title_similarity": "0.6270821",
            "sentiment_compound": 0.7222
        },
        {
            "id": "hhe03fv",
            "score": 1,
            "text": "The best people in the world! They're the ones that give good news but bad news.",
            "title_similarity": "0.4072916",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hhew3kl",
            "score": 1,
            "text": "Govt to plebs: sort you recyclables!\n\nGovt to polluting corps and industries: please do carry on.",
            "title_similarity": "0.43257445",
            "sentiment_compound": 0.3802
        },
        {
            "id": "hhn5bsp",
            "score": 1,
            "text": "Wait untill something evolves to eat humans efficiently.",
            "title_similarity": "0.30514255",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hhq70jg",
            "score": 1,
            "text": "If anyone want to take part in trying to stop or reduce the impact of climate change I recommend r/climateoffensive to get started.",
            "title_similarity": "0.5209867",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hhr6afe",
            "score": 1,
            "text": "Well my gut says otherwise.",
            "title_similarity": "0.19234748",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hhv4d0i",
            "score": 1,
            "text": "But there is that 0.1%",
            "title_similarity": "0.34574234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hihbh4m",
            "score": 1,
            "text": "Human activities have increased greenhouse gas emissions into our atmosphere which trap heat from sunlight causing global temperatures to rise. Greenhouse gases such as carbon dioxide, methane, nitrous oxide, etc., absorb infrared radiation emitted by the earth's surface and re-radiate it back towards space at longer wavelengths.",
            "title_similarity": "0.53925276",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hjac37k",
            "score": 1,
            "text": "Climate change is caused by nature just as much as humans. The ice age is proof of this",
            "title_similarity": "0.6249079",
            "sentiment_compound": 0.0
        }
    ]
}