{
    "Cannabis products may help treat symptoms of depression, improve sleep, and increase quality of life, study suggests.\n": [
        {
            "id": "hhw8pft",
            "score": 1,
            "text": "Hello!\n\nJust a friendly reminder that the reason you're seeing a lot of removed comments is that purely anecdotal comments are not allowed except as a reply to our (normally) stickied [thread for anecdotes.](https://www.reddit.com/r/science/comments/qev7dk/comment/hhvinx7/?utm_source=share&utm_medium=web2x&context=3) Giving medical advice is also not allowed. Please read our [comment rules](https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) if you would prefer to not spend the effort typing up a comment only to have it be removed!",
            "title_similarity": "0.4206804",
            "sentiment_compound": 0.6395
        },
        {
            "id": "hhvy264",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.05616252"
        },
        {
            "id": "hhvjc7s",
            "score": -16,
            "text": "[removed]",
            "title_similarity": "0.05616252"
        },
        {
            "id": "hhvoh8k",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.05616252"
        },
        {
            "id": "hhwy63q",
            "score": 20,
            "text": "cannabis use can also lead to panic attacks. Ask me how I know. https://pubmed.ncbi.nlm.nih.gov/16271364/",
            "title_similarity": "0.602167",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hhvinx7",
            "score": -2,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.46372855",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hhwhjgp",
            "score": 68,
            "text": "I have to say, I'm a long time user of cannabis and I think these studies are sometimes a little opinionated. Ive gone through breaks in usage and noticed a huge increase in quality of certain aspects of life, particularly sleep. Studies show that THC actually disturbs your sleep cycles, and withdrawals from THC are super disruptive to sleep patterns.\n https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2442418/\n\nIn the early 20th century, only three generations ago, it was widely believed that smoking cigarettes was healthy for respiratory functions and prevented throat infections. This was due to massive amounts of money being poured into biased studies by tobacco companies.\nI can't say for sure because I'm not qualified to make these types of conclusions, but I genuinely believe we're experiencing the same propaganda with cannabis as we did with tobacco. Altering your mind with chemical substances rarely is healthy. As a marijuana addict I can safely say that the risks far out way the alleged benefits these studies claim to exist.",
            "title_similarity": "0.65420043",
            "sentiment_compound": 0.4993
        },
        {
            "id": "hhvy3bh",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.05616252"
        },
        {
            "id": "hhvz5a7",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.05616252"
        },
        {
            "id": "hhvkl3g",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.056162514"
        },
        {
            "id": "hhw39rw",
            "score": 43,
            "text": "I would love to see an aggregate study. Ive seen similar studies that say that cannaboids make depressions symptoms work. Seeing a statistical analysis of all of these similar studies would be very interesting",
            "title_similarity": "0.6696239",
            "sentiment_compound": 0.6115
        },
        {
            "id": "hhw7hg0",
            "score": 88,
            "text": "[removed]",
            "title_similarity": "0.056162514"
        },
        {
            "id": "hhvkthg",
            "score": -25,
            "text": "[removed]",
            "title_similarity": "0.056162514"
        },
        {
            "id": "hhy95ql",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.056162514"
        },
        {
            "id": "hhvph82",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.056162514"
        },
        {
            "id": "hhvyr21",
            "score": 60,
            "text": "[removed]",
            "title_similarity": "0.056162514"
        },
        {
            "id": "hhw7wq8",
            "score": 172,
            "text": "Hi folks, let's take a minute to examine some criticisms that should be plainly levied against this study. Both the article and the authors seem to be overstating the value of the research. The study itself - while useful perhaps to identify better research methods - is entirely self-reported. The researchers didn't attempt to verify any of the data submitted, including doing the basic research of verifying the chemical makeup of various products indicated in the data. Further conflicts of interest have to be considered, such as the fact that the study was funded by a cannabis company and one of the researchers is employed by a cannabis farm.\n\nWith all this in mind, it's important that we examine this article with a critical and scrutinizing eye. Cannabis is undergoing rapid legalization but the research isn't there to firmly stand on one side or the other due to its previous legal status making it exceptionally difficult to research with. There may be strong indications of benefits to be had from the substance, but more, ^Edit:( higher quality ^) research needs to be done to firmly identify these benefits (and any subsequent disbenefits.)",
            "title_similarity": "0.4749477",
            "sentiment_compound": 0.9083
        },
        {
            "id": "hhvru18",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.05616252"
        },
        {
            "id": "hhvo8zw",
            "score": -24,
            "text": "[removed]",
            "title_similarity": "0.056162514"
        },
        {
            "id": "hhvr7w4",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.056162514"
        },
        {
            "id": "hhx150w",
            "score": 2,
            "text": "The fact of the matter is that until we can get a massive number of studies done to determine the positive and negative effects of smoking pot or using THC/CBD in any capacity, we won’t fully understand it. This is a reason why I’m so happy to be Canadian where cannabis is legal - lots of research is now being performed since legalization so we can truly figure out the good and bad of it. \n\nI should note I use cannabis daily myself. All I’m saying really is that as more studies such as this one come out, largely possible because of decriminalization and legalization, we can finally begin to actually understand the positive (or negative) effects of cannabis.",
            "title_similarity": "0.5407785",
            "sentiment_compound": 0.8404
        },
        {
            "id": "hhvmbz2",
            "score": 27,
            "text": "[removed]",
            "title_similarity": "0.056162514"
        },
        {
            "id": "hhx85pz",
            "score": 12,
            "text": "I hope someone studies cannabis use in trauma treatment. Everything I've seen as a clinician has been that those who are daily users are almost competely unable to follow through with trauma treatment protocals.\n\nPartially because instead of following through, smoking is an easier release, and at least anecdotally, dreaming is interrupted and it seems the Rem sleep cycle is needed to really clear traumatic memories.\n\nThe trauma feelings are muted, but then return as soon as regular use is slowed, in turn causing an addictive psychological loop, with no intention at all from the user.\n\nI have no ulterior motive, if it enables more functioning, then there has to be a trade off. But, I have a lot of people come to me realizing they can't not wake and bake, and have no idea why.\n\nI'm so torn with weed. It's both so positive and causes problems it seems.",
            "title_similarity": "0.63441944",
            "sentiment_compound": -0.8733
        },
        {
            "id": "hhxvmqy",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.056162514"
        },
        {
            "id": "hhw5xj0",
            "score": 552,
            "text": "Fair warning: This was an observational trial. Not a controlled study.\n\nIt's better to think of this as laying out the initial ground work for further, better controlled studies.",
            "title_similarity": "0.47975016",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hhw52wo",
            "score": 382,
            "text": "It is important to note that the study was neither blinded nor interventional (i.e., groups were not given cannabis vs placebo). So the interpretation especially of what causes a beneficial effect in cannabis, are very limited. This shows that people that spend money on cannabis seem to feel better. This may, esprcially in the case of cbd at low doses, well be placebo.",
            "title_similarity": "0.6481585",
            "sentiment_compound": 0.6605
        },
        {
            "id": "hhw0ljx",
            "score": 1598,
            "text": "As a neurologist working in Wisconsin, I really wish they’d legalize cannabis already. It would be so nice to prescribe a non-addictive medication with very few serious side effects to treat neurogenic pain, headaches, and anxiety.",
            "title_similarity": "0.60740304",
            "sentiment_compound": 0.5763
        },
        {
            "id": "hhvs297",
            "score": 25,
            "text": "[removed]",
            "title_similarity": "0.05616252"
        },
        {
            "id": "hhvwaw0",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.05616252"
        },
        {
            "id": "hhvlpci",
            "score": 2807,
            "text": "These are fairly well known effects. It is important to note that the study is also emphasizing CBD rather than THC in its contribution. \n\nAs mentioned in the article:\n\n> “Medicinal cannabis products, especially products high in CBD, may help to treat symptoms of depression, improve sleep, and increase quality of life,” Martin told PsyPost. “There is also some evidence that medicinal cannabis may alleviate symptoms of anxiety, particularly if administered over an extended period of time, but this is less clear from our results and warrants further study.”\n> \n> Martin and her colleagues offer a few reasons why CBD may have been associated with reductions in anxiety in the long-term, but not at baseline. It could be that those who reported using cannabis products at baseline had developed a tolerance to its anxiety-reducing effects.\n\nThis is somewhat paradoxical, and suggests the mechanism might not be related to its immediate psychological effects. For example, there is some evidence it increases gut health and lowers cortisol levels, and these changes might a compounding effect on anxiety and depression over the long-term. Something like that could explain why CBD seems to start working over time but not right away.",
            "title_similarity": "0.8196799",
            "sentiment_compound": 0.394
        },
        {
            "id": "hhvsfem",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "0.05616252"
        },
        {
            "id": "hhwbpi7",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.05616252"
        },
        {
            "id": "hhxelvd",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.05616252"
        },
        {
            "id": "hhxi8kr",
            "score": 5,
            "text": "Note that the majority of participants in this study were Caucasian females, with a mean age of 46. While it’s good to get the ball rolling on this kind of research, I agree with the authors when they say that more blinded, placebo-controlled studies are needed on a broader sample to more accurately draw conclusions.",
            "title_similarity": "0.512171",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hhxkfsr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05616252"
        },
        {
            "id": "hhxu24z",
            "score": 2,
            "text": "Doesn’t  CBD act as an antagonist or inverse agonist of CB1/2 receptors? I’ve read it also increases anandamide through some allosteric modulation(not sure on that). wouldn’t you think that CBD and THC are quite opposed in many ways,so if one benefits a condition  the other may harm? Of course it gets more complicated when they are present in the same substance and that goes way passed my understanding but it is very interesting.",
            "title_similarity": "0.6154466",
            "sentiment_compound": 0.5573
        },
        {
            "id": "hhxyty2",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05616252"
        },
        {
            "id": "hhy9mj0",
            "score": 1,
            "text": "They were offered 16 total studies (4 per year for 4 years), and the average was 2 studies. \n\n1. There is a strong chance of only individuals who felt they had something to report bothering to return for the follow-up studies. \n\n2. Measuring the change across an average of one additional study is likely not reliable data. \n\n3. Their demographics were almost entirely white women. I dare suspect college-aged white women. \n\n4. The majority of participants reported chronic pain. Helping alleviate pain alone can account for decreases in anxiety and depression. \n\nFrankly, this is a crap study that shouldn't have been published with such limited data for such a loosely controlled variable. And worst of all, now all my friends who smoke a lot will be going on about how the weed that clearly causes their depression (because they accomplish nothing with their lives) is actually helped by smoking more weed.",
            "title_similarity": "0.4451694",
            "sentiment_compound": -0.9325
        },
        {
            "id": "hhyl6ss",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.05616252"
        },
        {
            "id": "hi06f7o",
            "score": 1,
            "text": "You mean they just figured that out?",
            "title_similarity": "0.19219351",
            "sentiment_compound": 0.0
        },
        {
            "id": "hi0ef0i",
            "score": 1,
            "text": "\"We know\" - Every pot user",
            "title_similarity": "0.10354121",
            "sentiment_compound": 0.0
        }
    ]
}