{
    "A lack of sleep affects people’s ability to feel for others. Sleep deprivation and emotional fatigue can hit anyone, but first responders and health-care workers are especially vulnerable due to shift work, long hours and the overall stressful nature of their jobs.\n": [
        {
            "id": "hirj6en",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.5369754",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hirmgcl",
            "score": -30,
            "text": "Be nice to new parents. Because we may not be capable of being nice back.",
            "title_similarity": "0.38762587",
            "sentiment_compound": 0.5293
        },
        {
            "id": "hisbxhu",
            "score": -3,
            "text": "When someone says they don’t sleep it’s a huge red flag for me. Also when someone is particularly nasty I try and work “how are you sleeping” into the conversation. It’s a telltale.",
            "title_similarity": "0.70931864",
            "sentiment_compound": -0.3804
        },
        {
            "id": "his2qly",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.113876194"
        },
        {
            "id": "hisfdpa",
            "score": 6,
            "text": "Spoke with a career criminal who spent most of his life in prison.  Apparently, they don't turn off the lights and there are people incarcerated with mental illness that just scream all night.",
            "title_similarity": "0.6372757",
            "sentiment_compound": -0.9022
        },
        {
            "id": "hisgmvn",
            "score": 0,
            "text": "Not to mention mothers of newborns (or father's)",
            "title_similarity": "0.34688064",
            "sentiment_compound": 0.0
        },
        {
            "id": "hisydrn",
            "score": 0,
            "text": "is this why cops are assholes?",
            "title_similarity": "0.44906193",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hisqfh4",
            "score": 2,
            "text": "The hilarious part is that they don't mention new mothers. Try going on 2-3 hour chunks of broken sleep for months at a time, and see how you feel about life.",
            "title_similarity": "0.5512172",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hisx0fz",
            "score": 8,
            "text": "Well if you see 5 people die in September, then you meet a kid with just a slice on his hand, makes sense that some people are just going to not care too much. \n\n“Oh you lost the tip of your finger? Okay.”\n\nI still think it’s rude, but I can understand where it’s coming from. I was in ER recently and there was 0 empathy. If you’re not currently about to die, they don’t care.",
            "title_similarity": "0.5332982",
            "sentiment_compound": -0.6501
        },
        {
            "id": "hit4nke",
            "score": 0,
            "text": "So in other words, you get cranky If you don't get enough sleep. I knew that when I was 5 years old",
            "title_similarity": "0.62099504",
            "sentiment_compound": 0.0
        },
        {
            "id": "his8o4w",
            "score": 15,
            "text": "How can this relate to new parents? My second kid didn't start sleeping through the night until 18 months.... I'm still tired 5 years later :)",
            "title_similarity": "0.45500463",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hisijpg",
            "score": 11,
            "text": "Here's a thought - *this -- the inability to feel for others -- is the point* (as in, 'cruelty is the point,' to cadge a meme from a popular book). Or society is constructed -- at least in part -- by society, by government, by corporate structures and practices -- to eliminate empathy from our social thinking. An overworked population is incapable (or less capable) of sympathy for others, or for that matter, of concentrating on anything but their own immediate needs, than a population that is happy and rested. \n\nAs is attested in this thread, such things as scheduling practices (e.g., long shifts, short turn-arounds), cultural insistence on staying 'busy', the overvaluation of work over restful leisure, low pay that requires multiple jobs ... lead to mental and physical exhaustion and a perpetual \"brain fog.\"",
            "title_similarity": "0.68019354",
            "sentiment_compound": 0.2315
        },
        {
            "id": "histcwq",
            "score": 1,
            "text": "But if you're sleeping, that means you're not working and that's.. bad for some reason..",
            "title_similarity": "0.6487418",
            "sentiment_compound": -0.6956
        },
        {
            "id": "hisvmcs",
            "score": 1,
            "text": "Yo this is why I feel apathetic and isolated after working on mixing and side hustles for\nweeks straight",
            "title_similarity": "0.6561796",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hisw660",
            "score": -1,
            "text": "The only way to fix is to have more people join the workforce. You CAN do it, you ARE smart enough, you ARE strong enough. PLEASE HELP AND BECOME A NURSE, RESPIRATORY THERAPIST, NP, PA, DOCTOR ANYTHING YOU CAN DO TO HELP PLEASE!",
            "title_similarity": "0.40154356",
            "sentiment_compound": 0.967
        },
        {
            "id": "hit11a3",
            "score": 1,
            "text": "Oh yes, the way we talk about COVID deaths between ourselves isn’t how we normally are.  These patients are so labor intensive and when they get critically sick they don’t have good odds.  So we are relieved when families want to terminate care instead of making us do CPR on a vented COVID patient.   Their odds on the ventilator are so bad anyways they really are doing their family member a favor.  The fact it’s people who said “screw you” to us health care workers because they refused to get vaccinated doesn’t help either.",
            "title_similarity": "0.7923186",
            "sentiment_compound": 0.8615
        },
        {
            "id": "hit4hsn",
            "score": -1,
            "text": "Weed before bed let's me sleep all night",
            "title_similarity": "0.44822943",
            "sentiment_compound": 0.0
        },
        {
            "id": "hit5c5h",
            "score": -1,
            "text": "No good for new parents.....",
            "title_similarity": "0.4101275",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hiuoaxn",
            "score": 1,
            "text": "Maybe lack of sleep is the reason all those cops and firefighters refuse to care for others and get a vaccine for Covid…. Or maybe they’re all just selfish pricks.",
            "title_similarity": "0.6583994",
            "sentiment_compound": -0.6486
        },
        {
            "id": "his7ik6",
            "score": 26,
            "text": "Not really the most worrisome aspect of sleep deprivation in that field.    \nBeing sympathetic to every patient you run into sound extremely emotionally exhausting.",
            "title_similarity": "0.8432099",
            "sentiment_compound": -0.6741
        },
        {
            "id": "hismde2",
            "score": 2,
            "text": "Yup, shift work is a killer. I work 12 hours with often mandatory overtime, then expected to come in again 8 hours later. \n\nEmployers could careless, for some reason. Mostly because we are managed by desk jockeys, and not people who understand the front lines.",
            "title_similarity": "0.7185381",
            "sentiment_compound": -0.7579
        },
        {
            "id": "histwwt",
            "score": 2,
            "text": "Don't forget IT professionals",
            "title_similarity": "0.1253052",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hitgfhd",
            "score": 2,
            "text": "First responders and health care workers don't have to feel for others to do their job.",
            "title_similarity": "0.26742858",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hiu6axq",
            "score": 2,
            "text": "Yeah, ok. I guess shiftworkers who aren't first responders or healthcare workers couldn't possibly face sleep deprivation and emotional fatigue.",
            "title_similarity": "0.654197",
            "sentiment_compound": -0.25
        },
        {
            "id": "hirl2q6",
            "score": 91,
            "text": "So pretty much how all of us are on lack of sleep.",
            "title_similarity": "0.5729241",
            "sentiment_compound": 0.2944
        },
        {
            "id": "hisl5n1",
            "score": 2,
            "text": "I can 100% confirm this. I haven't slept in 4 days and am a complete asshole right now I'm so irritable",
            "title_similarity": "0.5591201",
            "sentiment_compound": -0.6113
        },
        {
            "id": "hisvx4g",
            "score": 4,
            "text": "* I realise working a poultry processing plant or other manufacturing jobs don't have the pizzaz headline of \"first responders\" but many/most of those workers also face the same stress, sometimes more...crazy shifts, long hours, very stressful as you can be fired at the snap of a finger and really not given any form of respect. kudos to the health care workers for sure but lets not forget the millions of others",
            "title_similarity": "0.8188743",
            "sentiment_compound": 0.5203
        },
        {
            "id": "hisxwnj",
            "score": 3,
            "text": "Google: national average pay for EMT and Paramedic.  You will understand why so many work back to back shifts or more than 12 hours",
            "title_similarity": "0.42916864",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hit75xs",
            "score": 3,
            "text": "And yet people still want to put their fear of small chances of unknown long term risks from vaccination way above and beyond the clear, very evident, and present risks they pose to healthcare workers if they end up in a hospital bed.\n\n(And yes, you still can be hospitalized with the vaccine. Just as you can still die in a car crash with a seat belt on. Doesn't mean it isn't a good idea to wear the seat belt.)",
            "title_similarity": "0.6368123",
            "sentiment_compound": -0.8404
        },
        {
            "id": "hisdf61",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.113876194"
        },
        {
            "id": "hisfinz",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.113876194"
        },
        {
            "id": "hisy7ci",
            "score": 4,
            "text": "And people wonder why so many couples get divorced after having children. You get very little sleep for months. Emotional disregulation can happen quickly, leading to anger, resentment, arguments etc. I’m not sure why we are not more well adapted to sleep deprivation since we all have to go through it if we have children",
            "title_similarity": "0.77450424",
            "sentiment_compound": -0.9259
        },
        {
            "id": "hisxu6b",
            "score": 4,
            "text": "Oh so that’s why nurses seem like they don’t care",
            "title_similarity": "0.5180396",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hit11be",
            "score": -5,
            "text": "Why the additional of first responders?\n\n\nWhy is narrative being pushed?",
            "title_similarity": "0.21969599",
            "sentiment_compound": 0.0
        },
        {
            "id": "his4ysu",
            "score": 67,
            "text": "This explains why many of them have a dark sense of humor.",
            "title_similarity": "0.36594945",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hisnjr8",
            "score": 7,
            "text": "That's why it's a torture technique.",
            "title_similarity": "0.26049957",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hisa1q3",
            "score": 8,
            "text": "[deleted]",
            "title_similarity": "0.1321451"
        },
        {
            "id": "his630t",
            "score": 260,
            "text": "My husband, who works in law enforcement, has been on night shift for nearly 4 years. When you have to adjust to a normal schedule on your off days, as well as frequently attending court during the day before and after a night of work, it really messes your body up. It’s taking years off his life, it hurts to see.\n\nEdit: to those saying “just keep the same sleep schedule on your days off,” it’s not always that easy, especially with kids and two working parents. Plus there are things that need to be done during the day, like errands and such. Can’t do yard work at 2am on your day off.",
            "title_similarity": "0.73447305",
            "sentiment_compound": -0.2278
        },
        {
            "id": "his7v10",
            "score": 8,
            "text": "i noticed this when coming home from the lab late at night during my masters, because i'd be able to kill the excess snails in my fish tank after feeling uncomfrotable doing so in the mornings.",
            "title_similarity": "0.5605042",
            "sentiment_compound": -0.6369
        },
        {
            "id": "his55oj",
            "score": 100,
            "text": "Been working Fire/EMS for nearly 20 years. It all comes down to balance as well. Taking mini power naps helps a lot.",
            "title_similarity": "0.49505603",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hirya3t",
            "score": 128,
            "text": "Same, I feel for anyone who can’t sleep. I want to get on my soapbox about undiagnosed ADHD, which is pretty common in Reddit users because Reddit feeds you a constant stream of dopamine hits\n\nADHD is hugely undiagnosed in general and it makes it so you can’t turn off your mind, especially at night. There’s a certain population of people with ADHD who have insomnia that gets so bad they just don’t feel sleepy anymore, and they lose all energy for empathy. But on the proper medication I was able to very easily feel empathy - I was tying emotions into words and thoughts automatically very easily. And it made me *sleepy* as hell; that’s my body having enough energy to finally feel relaxed instead of just terrible. \n\nIf coffee makes you tired, look up the symptoms. It could save your life.",
            "title_similarity": "0.6369195",
            "sentiment_compound": 0.1489
        },
        {
            "id": "hisb8b2",
            "score": 50,
            "text": "They also get desensitized to it. I know it sucks but it's true. Every time I was in the emergency room with injuries - people hated me being there, especially the x-ray technicians when they'd find out I have a broken limb cause they can't get a good shot without me putting my arm/leg there properly, and putting it down properly brings me pain and brings out yelling in pain out of me. So I'm the part of the job they hate. And I'm also the whole reason they have that job in the first place (at that moment). I feel bad for them, cause I know the feeling, I started hating people in general when I worked retail, but I have no idea what can be done to negate this.",
            "title_similarity": "0.8064481",
            "sentiment_compound": -0.9916
        },
        {
            "id": "hisin4f",
            "score": 27,
            "text": "I'm a paramedic. Reading this in an ambulance on Halloween. \n\nIf you call at 5am because you are drunk. You are getting very little sympathy.",
            "title_similarity": "0.5572971",
            "sentiment_compound": 0.022
        },
        {
            "id": "hisfiol",
            "score": 140,
            "text": "And yet those hospitals defend those back to back 12hr shifts like their life depends on it.",
            "title_similarity": "0.59129626",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hirt2qy",
            "score": 276,
            "text": "Saved you a click.\n\n>In 2014, in collaboration with Neurolab, which is directed by cognitive neuroscience professor Giuseppe Iaria, we designed a study to understand how a single night without sleep would impact people’s ability to understand the emotions of others.\n\n>We used this test to measure empathy in a group of university students. First we tested everyone to understand how empathetic they were normally. Then we had a group spend the night in the lab where we kept them awake by playing board games, socializing and watching movies. After they had been awake all night, we re-tested them and compared their results to students who were sent home to have a good night of sleep.To do this, we developed a computer test that shows participants images of people in negative, positive and neutral situations. For example, we showed people in pain, people laughing and dancing or people just sitting at a table. We then asked participants to first describe what the people in the photo were feeling, and then how strong their own emotions were while looking at the pictures.\n\n>Our findings were clear: Sleep-deprived students felt less empathy for people in negative situations than students who had had a good night’s sleep.\n\n>But is it only extreme sleep deprivation, like staying up all night, that triggers this change?\n\n>We found that chronic poor sleep quality was also linked with lower empathy for others. One group of people that experiences chronic sleep loss due to job schedule is paramedics",
            "title_similarity": "0.5622045",
            "sentiment_compound": -0.4445
        },
        {
            "id": "hiru8oo",
            "score": 453,
            "text": "[removed]",
            "title_similarity": "0.113876194"
        },
        {
            "id": "hirzkkc",
            "score": 2084,
            "text": "Oh yeah. I have very severe insomnia and for a while in school, before I found a med that works, I was averaging like 10 hours of sleep in a 72 hour period. And I remember looking at other people and just thinking, you could die right in front of me and I would feel nothing. It was like not even being a human. Black-and-white, 2+2 thinking was the only thing I could do, and most often my brain just felt like radio static. The lack of emotion was apparent to me but I couldn't even feel enough to be concerned about it.",
            "title_similarity": "0.7034446",
            "sentiment_compound": -0.3615
        },
        {
            "id": "hisfbvy",
            "score": 403,
            "text": "I've worked in public health for 27 years and the last 18 months have taken a real toll emotionally, and lack of sleep due to anxiety probably started the roller coaster psychologically. I have a relatively high degree of empathy, but I'm all out. Done. I've found my limits. \n\nIt must be much, much worse for those who work in hospitals.",
            "title_similarity": "0.75070095",
            "sentiment_compound": -0.7311
        },
        {
            "id": "hismskl",
            "score": 201,
            "text": "I have never understood the idea that working a 24+ hour shift was smart.\n\nI’m from a country that won’t let truck drivers work more than ten hours a day because it ends up impairing drivers the same as a .8% BAC or worse, but some people believe letting nurses and doctors work that long is perfectly fine.",
            "title_similarity": "0.65834117",
            "sentiment_compound": 0.8316
        },
        {
            "id": "hisdieb",
            "score": 712,
            "text": "After working 14 16-hour shifts in a row in an ER…yeah, I can definitely say that it affected my “ability to feel for others”….I just wanted to sleep",
            "title_similarity": "0.6370345",
            "sentiment_compound": 0.2732
        },
        {
            "id": "his7gp1",
            "score": 2,
            "text": "yep. i'm a kind and helpful in nature but when im tired, i want to just go batshit crazy and watch the world burn",
            "title_similarity": "0.51192623",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hisbw71",
            "score": 18,
            "text": "Does this mean more first responders and health-care workers are needed in general? So they can sleep?",
            "title_similarity": "0.59830976",
            "sentiment_compound": 0.0
        },
        {
            "id": "hish134",
            "score": 2,
            "text": "Surely not also because they have to see people die all the time!",
            "title_similarity": "0.59862137",
            "sentiment_compound": -0.3164
        },
        {
            "id": "hisirwg",
            "score": 2,
            "text": "I was just wondering if sleep depravation had an effect on your mental health well there's my answer",
            "title_similarity": "0.53573",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hisj79y",
            "score": 63,
            "text": "Well that's kinda terrifying. The people affected the most by insomnia are the people we desperately NEED to feel for others",
            "title_similarity": "0.7869961",
            "sentiment_compound": -0.6712
        },
        {
            "id": "hislvm4",
            "score": 5,
            "text": "So, maybe doctors and EMTs shouldn't work 12 hour shifts then.",
            "title_similarity": "0.56226337",
            "sentiment_compound": 0.0
        },
        {
            "id": "hisofg4",
            "score": 18,
            "text": "Why is it so acceptable to work dangerously long hours in HEALTHCARE of all things? \"Should the people saving lives and needing to be on their A game be properly rested? NAHHHH.\"",
            "title_similarity": "0.72287905",
            "sentiment_compound": -0.0948
        },
        {
            "id": "hisoz8l",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.113876194"
        },
        {
            "id": "hispr2z",
            "score": 4,
            "text": "I'm a completely different person when my insomnia kicks in and I'm dragging. It definitely changes your patience and emotions.",
            "title_similarity": "0.71494186",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hisq17a",
            "score": 29,
            "text": "In nursing school you learn why some nurses become so cold. If you arent careful it will wear you down. Even if you are careful it can happen beyond your control. Theres a tragic and gradual erosion of you as a person in a line of work that places you in the position of direct witness to peoples most profound suffering and to be an advocate for their needs. That erosion can display itself in many ways, sometimes it looks like a lack of empathy/coldness, but really its just that their empathy has been stretched beyond its limits and they arent given enough time to recover as needed.",
            "title_similarity": "0.8326191",
            "sentiment_compound": -0.4609
        },
        {
            "id": "hisqm3o",
            "score": 1,
            "text": "I encourage people to get and read the book \"Why we sleep\" by Matthew Walker. You'll want your precious sleep after that.",
            "title_similarity": "0.45699936",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hisr8z4",
            "score": 3,
            "text": "It took me almost five years to get back to some semblance of normal after 20 years in EMS",
            "title_similarity": "0.3020842",
            "sentiment_compound": 0.0
        },
        {
            "id": "hisrg3s",
            "score": 1,
            "text": "Could making soldiers sleep-deprived have anything to do with that ?",
            "title_similarity": "0.5093878",
            "sentiment_compound": 0.0
        },
        {
            "id": "hisrkvr",
            "score": 2,
            "text": "I'm not sure how they get any usable data out of the past few years. I figured my graveyard shift and my misanthropy were just a coincidence. And now that I'm already a misanthrope, there certainly doesn't appear to be any incentive to *stop* being one...",
            "title_similarity": "0.5272245",
            "sentiment_compound": -0.1184
        },
        {
            "id": "hisrms4",
            "score": 2,
            "text": "I wonder how this applies to teenagers in high school that starts too early for their biological rythyms.",
            "title_similarity": "0.39266855",
            "sentiment_compound": 0.0
        },
        {
            "id": "hist2nz",
            "score": 3,
            "text": "That would explain why I’ve been feeling more “zero fucks left.” Than normal.",
            "title_similarity": "0.4709031",
            "sentiment_compound": -0.4364
        },
        {
            "id": "hisuoyy",
            "score": 1,
            "text": "No wonder I’ve experienced so many cold and I empathetic doctors and nurses",
            "title_similarity": "0.5293199",
            "sentiment_compound": 0.128
        },
        {
            "id": "hisvedp",
            "score": 1,
            "text": "Capitalism does not care about change. Or helping workers.  It cares about money and our hospitals are part of that machine..Until that's not a thing, we will have inhumane working conditions for our nurses and doctors. \n\nsource: spent 10 years working for a hospital.",
            "title_similarity": "0.60176384",
            "sentiment_compound": 0.3761
        },
        {
            "id": "hisvjdj",
            "score": 4,
            "text": "\"But its the only way to go through medical school\"\n\n\n\n\"I did it so you can too\"\n\n\n\n\"All great doctors have done it so why should we stop now?\"\n\n\n\n\"It's better if people stay up to date and current in their fields than to take time off and become out of touch with their industry\"\n\n\n\n\nSo we're talking about medical jobs that have people's lives in their hands. Apply this for pilots. Or for pharmacists. Even truckers. Suddenly everyone is up in arms. \n\nBut the people actually applying treatments and assessing health are overworked and we have no solutions? Everything and anything from specializations for particular types of nurses to better non medical assistants to keep track of patients and their treatments who need a lot of help. Yet we have no solutions.",
            "title_similarity": "0.6481309",
            "sentiment_compound": 0.9313
        },
        {
            "id": "hisvkvq",
            "score": 12,
            "text": "Yet we still get treated like a red headed step child.......except for about two weeks where people would randomly \"thank you for your service\" nothing has changed and there is a reason there are so many sour ems",
            "title_similarity": "0.3903709",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hisxehz",
            "score": 6,
            "text": "That's absolutely true. I've had problems sleeping since I was a child. Like 4-5 hours of sleep at night.\n\nWasn't so bad before but since like 3-4 years ago I started getting angrier and angrier. I won't even talk about the anxiety that gave me and the shitposting I do while I'm sleep deprived.\n\nRight now I've been on trazodone for half a year and while it's not perfect I'm getting a good 6-7 hours of sleep now.\n\nBut you still have to self discipline. No eating like 2-3 hours before sleep (absolutely no sugar!!!). No drinking at all like an hour and a half before sleep (had to go pee 1-2 times per night). Coca-Cola(zero) is now without caffeine and only decaf coffee.\n\nJust following these rules made things better. Trazodone does the rest.\n\n-EDIT- If you're ADHD like me, it's imperative that you do this. If you're still wondering why the hell you body stay awake, let go of the sugar at night seriously, you'll see results right away.",
            "title_similarity": "0.6577827",
            "sentiment_compound": -0.9404
        },
        {
            "id": "hisxrwo",
            "score": 5,
            "text": "It's quite hard being the partner to someone who is lacking sleep and chronically exhausted. My partner (Veterinarian) is in that situation and I find it very challenging to be at the receiving end of it.",
            "title_similarity": "0.83399945",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hisyvsd",
            "score": 7,
            "text": "I really don’t understand why the crazy hours are so standard for these occupations. It seems especially wrong when it’s peoples lives they are dealing with.",
            "title_similarity": "0.742547",
            "sentiment_compound": -0.6997
        },
        {
            "id": "hisz82t",
            "score": 3,
            "text": "I have been wondering about this for a long time: why did we, as a society, decided to make our literal life saving professional to have the worst scheduled/work life balance?",
            "title_similarity": "0.6025317",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hisz8ip",
            "score": 11,
            "text": "Former first responder here. The nature of the work is not for everyone. I turned into an alcoholic and was losing the will to live, so i quit as soon as I could. I'm doing better now.",
            "title_similarity": "0.65581095",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hiszaaj",
            "score": 5,
            "text": "This is for true. I'm not even a first responder nor do I work in the medical field, but I'm just a normal joe that has had trouble with insomnia for decades. I can testify that I hate everybody and everything after a night of very poor sleep.\n\nMy doctor warns me about taking Ambien too many nights in a row will make me sleep dependent, so for several months I switched to weed to sleep. Worked like a charm until I noticed that the weed wasn't hitting like it used to. I guess it was a tolerance to THC, because I could hang with Snoop Dogg as much as I was smoking.\n\nDoctor recommended Benadryl, and/or valerian root in combination with THC, but those things just give me the 'twilight sleep' feeling. Mind is still racing. I think that part of my problem with the weed is what I'm using: Wedding Cake. It's big on couch-lock, low on psychotropic effects, and that may also be part of the trouble. I can be so high I have trouble standing up, but my mind is as clear as can be.\n\nInsomnia is a horrible thing. I wouldn't wish it on anyone.",
            "title_similarity": "0.6870054",
            "sentiment_compound": -0.9703
        },
        {
            "id": "hit0vdg",
            "score": 1,
            "text": "How about we raise wages, increase staffing minimums, ensure affordable and easy to understand healthcare, and give management the ability to actually solve issues instead of knee capping them.",
            "title_similarity": "0.41586483",
            "sentiment_compound": 0.872
        },
        {
            "id": "hit1876",
            "score": 2,
            "text": " The science has been in for a long time.   The truth is employers don't care.  Until it hits their bottom line there is zero motivations to change.  I work for a very large municipal EMS service. The rates of burnout are staggering . Number 1 complaint for decades is the schedule. Good ol' cancer shift.  No body cares.",
            "title_similarity": "0.6085893",
            "sentiment_compound": -0.813
        },
        {
            "id": "hit26zr",
            "score": 1,
            "text": "u/lfmr thinking about you and hoping you're taking care of yourself. Emotional (and physical) fatigue sucks.",
            "title_similarity": "0.70653456",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hit2etb",
            "score": 1,
            "text": "Please realize that the military organizations and emergency services (police, ems, Drs, nurses) have know this for a very long time. The shift lengths are designed this way so they don’t we don’t focus on emotions just logic. Mission, save a life, pay attention on guard, etc.",
            "title_similarity": "0.51608896",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hit4fc7",
            "score": 1,
            "text": "I work night shift at a warehouse and pretty much don’t care about anything now. If it wasn’t for my medication I take for sleep and to manage my ptsd I’d probably be more even cynical.",
            "title_similarity": "0.69573367",
            "sentiment_compound": 0.5456
        },
        {
            "id": "hit4jbx",
            "score": 1,
            "text": "Maybe a good thing? After prolonged stress you need the ability to shut off emotional decision making.",
            "title_similarity": "0.5463995",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hit53aj",
            "score": 1,
            "text": "reddit and twitter need to to sleep for about 3 weeks straight then",
            "title_similarity": "0.4657334",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hit57nd",
            "score": 1,
            "text": "I used to care about which way round the toilet roll should go….but now I am free",
            "title_similarity": "0.32572818",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hit5oh8",
            "score": 1,
            "text": "this is very true. I worked >100 a week as an intern and resident and it can definitely cause compassion fatigue because you are just trying to survive.",
            "title_similarity": "0.58155334",
            "sentiment_compound": 0.7778
        },
        {
            "id": "hit5yig",
            "score": 1,
            "text": "This probably explains why I have so little tolerance for people when I have a bad night's sleep.",
            "title_similarity": "0.78569555",
            "sentiment_compound": -0.3214
        },
        {
            "id": "hit66od",
            "score": 1,
            "text": "Without medication I don't sleep more than 4 hours a night. Sometimes I'll stay up days at a time until I hallucinate not intentionally. I can say without a doubt lack of sleep makes it extremely difficult to function, effects your mood substantially, and makes your mental health issues way worse.",
            "title_similarity": "0.77036405",
            "sentiment_compound": -0.7255
        },
        {
            "id": "hit6hbi",
            "score": 1,
            "text": "High school teacher here. I get 8.5 hrs a night and I am still apathetic. There's the issue of compassion fatigue that doesn't seem to be considered here.",
            "title_similarity": "0.60586804",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hit6i4t",
            "score": 1,
            "text": "So that's why I've become more emotional and emphatic after I started to sleep at least 8 hours a night instead of the 3 I slept during high school.",
            "title_similarity": "0.62057877",
            "sentiment_compound": 0.2247
        },
        {
            "id": "hit6mcb",
            "score": 1,
            "text": "Go to r/VetTech to see empathy decline in real time.",
            "title_similarity": "0.3403607",
            "sentiment_compound": 0.0
        },
        {
            "id": "hit7qk6",
            "score": 1,
            "text": "And the person in the picture is touching her own head with her used glove.",
            "title_similarity": "0.080006786",
            "sentiment_compound": 0.0
        },
        {
            "id": "hit8kje",
            "score": 1,
            "text": "I don’t think that’s strictly true. I get around 5 hours a night and hate everyone",
            "title_similarity": "0.59116113",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hit8mj8",
            "score": 1,
            "text": "Not as important of a job but I would like to throw factory work in there as well. Especially if you're not unionized. You're life belongs to the company, and you're going to work the hours they want you to work. Source: I work in a factory on 3rd shift",
            "title_similarity": "0.5712721",
            "sentiment_compound": 0.7231
        },
        {
            "id": "hit95rs",
            "score": 1,
            "text": "Belsnickle really cares!",
            "title_similarity": "0.105252065",
            "sentiment_compound": 0.5551
        },
        {
            "id": "hit97ed",
            "score": 1,
            "text": "Few weeks ago I started sleeping with my Samsung Galaxy Watch 3 just to test out the sleeping functionality on it. No idea how accurate it is but I average between 5 to 7 hours of sleep per night and my sleep score averages between 50 and 60 (apparently 70 is average for my age group).\n\n\nMy issue seems to be not enough deep sleep (which I average 10 minutes of per night) and waking up or moving around a lot. My REM is fine although scattered all over the place.\n\n\nI do suffer from restlessness (eg restless leg syndrome, but often affects my entire body). Can make sleeping near impossible at times.\n\n\nI'm usually disconnected emotionally. It's something a lot of people who know me or work with me have mentioned on occasion. I often find it too tiresome to deal with. Many other factors contribute to this (less than ideal upbringing). However, interesting to note that poor sleep is yet another contributor.",
            "title_similarity": "0.64545035",
            "sentiment_compound": -0.7199
        },
        {
            "id": "hitawtl",
            "score": 5,
            "text": "Empathy fatigue is just normal for these jobs.  It’s nearly impossible to care for people who care so little for themselves while not being valued at all by their employers or society.",
            "title_similarity": "0.6575972",
            "sentiment_compound": 0.4577
        },
        {
            "id": "hitb06x",
            "score": 1,
            "text": "Nice job science peeps, this is important work. So here in the US, we'll use this info to write new legislation forcing healthcare employers to give workers more time off, right? Exciting stuff!",
            "title_similarity": "0.52084863",
            "sentiment_compound": 0.7959
        },
        {
            "id": "hitbujf",
            "score": 1,
            "text": "This explains why I feel the best after about 24 hrs without sleep. The empathetic part of my brain is over active",
            "title_similarity": "0.4912682",
            "sentiment_compound": 0.685
        },
        {
            "id": "hitda3w",
            "score": 1,
            "text": "This helps contextualize my years long sleep/rest issues (chronic health issue), and known issues I have with being wholly engaged with others, etc.",
            "title_similarity": "0.6003921",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hitdtvz",
            "score": 1,
            "text": "A lot of high level executives brag about how little sleep they get.",
            "title_similarity": "0.7363324",
            "sentiment_compound": 0.0
        },
        {
            "id": "hitdy5z",
            "score": 1,
            "text": "Yea only healthcare workers in particular.",
            "title_similarity": "0.27656502",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiteuzj",
            "score": 1,
            "text": "As a night shift nurse this is something I already know. Affects my whole outlook on life if I don’t get enough sleep",
            "title_similarity": "0.7124078",
            "sentiment_compound": 0.0
        },
        {
            "id": "hitf95e",
            "score": 1,
            "text": "And the company they work for will tell you \"We're not here to fix feelings, get back out there\"\nI loved EMS but I had to leave, I work 40 hrs a week as a Garbage man and make over double what I used to with better benefits and a month of PTO. It took 15 years at the company I worked at to make 4 weeks off a year. The whole EMS feild is backwards.",
            "title_similarity": "0.5419955",
            "sentiment_compound": 0.8555
        },
        {
            "id": "hitg0p2",
            "score": 1,
            "text": "On the other hand, diminished \"ability to feel\" can be... merciful... for an EMT. In certain context.",
            "title_similarity": "0.42218927",
            "sentiment_compound": 0.765
        },
        {
            "id": "hitg592",
            "score": 1,
            "text": "Babydodge, bet the farm buddy",
            "title_similarity": "0.10866964",
            "sentiment_compound": 0.0
        },
        {
            "id": "hitgaxe",
            "score": 1,
            "text": "Huh maybe this is one of the many reasons I can't feel for other people but myself",
            "title_similarity": "0.54617345",
            "sentiment_compound": 0.0
        },
        {
            "id": "hitgvbc",
            "score": 2,
            "text": "I work 24 hour shifts and it greatly affects my day to day. My first day off is atleast 1/2 day recovery if I don't have things to do. Then the next day is nothing but kids and work after then back to work for 24. I love the schedule but waking up to a loud tone, lights and the stress during the call takes a toll on everyone.",
            "title_similarity": "0.74834466",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hith303",
            "score": 1,
            "text": "I would add teachers to this list. Long hours, overall stress due to the nature of public education in the U.S., etc. all contribute to poor sleep and fatigue.",
            "title_similarity": "0.854216",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hithji9",
            "score": 1,
            "text": "This is really interesting. \nWhen I herniated a disc in my back years ago I was in constant pain and got very little sleep. I noticed how for the first time, all my empathy drained away. I felt almost like a sociopath for a few weeks. \nI had assumed it was the chronic pain, I never even considered whether it was related to the lack of sleep.",
            "title_similarity": "0.68019474",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hiti7cf",
            "score": 1,
            "text": "A big oof for parents with infants.",
            "title_similarity": "0.37995446",
            "sentiment_compound": 0.0
        },
        {
            "id": "hitierl",
            "score": 1,
            "text": "I feel the wording may be misleading. Are we talking empathy or are we talking affect?",
            "title_similarity": "0.35727322",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hitiie7",
            "score": 1,
            "text": "There were some studies into daylight savings time which found when the changes happen there's a decrease in the average \"satisfaction with life\" (study from 2018, Germany) and an increase in the suicide rate (study from 2008, Australia). Sleep is very important.",
            "title_similarity": "0.65467715",
            "sentiment_compound": 0.2006
        },
        {
            "id": "hitj0ln",
            "score": 1,
            "text": "H.A.L.T.\nis a real thing ppl. if you're feeling emotional, go thru this checklist first and see if any of these needs to be addressed. Hungry,  Angry, Lonely,  Tired",
            "title_similarity": "0.6253707",
            "sentiment_compound": -0.765
        },
        {
            "id": "hitjpm8",
            "score": 1,
            "text": "I wonder if this means diseases such as lyme, where fatigue is a big symptom, also reduces ones empathy",
            "title_similarity": "0.6905058",
            "sentiment_compound": -0.25
        },
        {
            "id": "hitk6gv",
            "score": 1,
            "text": "Lack of sleep, hunger, poverty ...",
            "title_similarity": "0.5971762",
            "sentiment_compound": -0.765
        },
        {
            "id": "hitkath",
            "score": 1,
            "text": "Lack of sleep fucks with everything, literally everything. I don't think enough people realize how important adequate, quality sleep is. \n\nHell I'm on here talking about it and I don't even think I properly realize how important it is to me personally (partly because I haven't slept well in years).",
            "title_similarity": "0.75772786",
            "sentiment_compound": -0.8081
        },
        {
            "id": "hitlloj",
            "score": 1,
            "text": "While I think the last decade, and especially the last 5 years has science proving this among healthcare workers. Long hours and many days in a row cause mistakes in medicine. But the reality is : too many 50 year old men and women who went through it themselves believe its a rite of passage, and now that they’re in charge : it’s not gonna change.",
            "title_similarity": "0.6592258",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hitp5vb",
            "score": 1,
            "text": "Yup.  During my clinicals I did 8 hours, then worked on the floor for 8 hours after, to, well, pay my bills. My relief never came in and management told me I had to stay for the next shift and that my clinicals hours “don’t count”.  I don’t think 24 hour work day is legal.. but they tried it.  Emotional fatigue is real!",
            "title_similarity": "0.65099126",
            "sentiment_compound": 0.3274
        },
        {
            "id": "hitpvh9",
            "score": 1,
            "text": "ELI5: Why do jobs that have life and death on the line, and require so much attention to detail, have such long shifts?",
            "title_similarity": "0.72956157",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hitq2sn",
            "score": 1,
            "text": "Sounds like a job for modafinil and cannabis",
            "title_similarity": "0.114579886",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hits169",
            "score": 1,
            "text": "I wonder if this is why that nurse went crazy.",
            "title_similarity": "0.46677113",
            "sentiment_compound": -0.34
        },
        {
            "id": "hittusz",
            "score": 2,
            "text": " I experienced that as a parent when my baby was a newborn. It always made me feel guilty the next day that I felt so annoyed the night before when my baby was crying for hours. It's kind of a relief to know that it has a scientific basis and I'm not just a horrible parent.",
            "title_similarity": "0.7510165",
            "sentiment_compound": -0.5133
        },
        {
            "id": "hitvcxw",
            "score": 1,
            "text": "There is a toxic competition to see who can sleep less - it is tired.",
            "title_similarity": "0.73685575",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hitvzxk",
            "score": 1,
            "text": "Could this be why a majority of my doctors at the VA seem to just not care?",
            "title_similarity": "0.66439986",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hitwfb7",
            "score": 1,
            "text": "and here I am an empath who never sleeps",
            "title_similarity": "0.19612476",
            "sentiment_compound": 0.0
        },
        {
            "id": "hitwfkj",
            "score": 1,
            "text": "How do you think they got truck drivers to go along with 70 hour weeks and being gone 5-6 days or 2-3 weeks for a day or two home? You break them with fatigue. They’re too docile to complain.",
            "title_similarity": "0.6358587",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hitwrg3",
            "score": 1,
            "text": "Worked 16 hours a day, 6 days a week, for way too long. Had a complete mental and physical breakdown before i realized it was time for a change.",
            "title_similarity": "0.6442658",
            "sentiment_compound": 0.0
        },
        {
            "id": "hity6ft",
            "score": 2,
            "text": "And best of all, some of the most critical staff are on rotating shifts, like cops, paramedics, doctors...\n\nOh sure let's have em all work day, night, and afternoon shifts instead of having permanent night, permanent day, permanent evening shifts. I'm sure the money we save by understaffing will never come back to bite us in the ass.",
            "title_similarity": "0.6615325",
            "sentiment_compound": 0.813
        },
        {
            "id": "hitydzr",
            "score": 3,
            "text": "I work 24's and some times we're able to sleep and some times we dont, but boyyyyy let me tell ya. The times we dont are a mfcker!!",
            "title_similarity": "0.54413694",
            "sentiment_compound": 0.0
        },
        {
            "id": "hityihi",
            "score": 2,
            "text": "Sadly in most areas first responders like cops are generally understaffed.  Police departments will often go to different states trying to recruit people.",
            "title_similarity": "0.6745491",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hitz8ft",
            "score": 3,
            "text": "Urban paramedic who has worked night shift for 16 years here with 3 kids, and 21 years in healthcare. It’s gonna cost me my marriage of 18 years and apparently it’s all my fault, but patient care never falters. Stay safe out there, and catch a nap when ya can.",
            "title_similarity": "0.6132183",
            "sentiment_compound": 0.0877
        },
        {
            "id": "hitzaem",
            "score": 3,
            "text": "My sister, an RN, says she lacks empathy for anyone complaining….unless they’re dying. Rough stuff on the daily basis for her",
            "title_similarity": "0.6717874",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiu02nr",
            "score": 1,
            "text": "Being in Information Technology in a business that doesn’t understand IT, I feel this too.",
            "title_similarity": "0.4772228",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiu12zf",
            "score": 2,
            "text": "/r/sleeptripping is a real thing!!",
            "title_similarity": "0.22647315",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiu24c9",
            "score": 1,
            "text": "It’s a good thing we  fired half of them in New York",
            "title_similarity": "0.25564057",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hiu2zfk",
            "score": 1,
            "text": "So….. schedule them better. This isn’t rocket science or astrophysics. Give them shorter shifts and longer breaks between.",
            "title_similarity": "0.3982896",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hiu58rl",
            "score": 2,
            "text": "I work shift work at a factory and the people I work with have slowly become cold indifferent assholes since we switched to 8 hour 5 day.",
            "title_similarity": "0.5638278",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hiu5bbb",
            "score": 2,
            "text": "Read “Why We Sleep” by Dr. Matthew Walker. It’ll blow your mind.\n\nPrioritize sleep. It’ll save your life.",
            "title_similarity": "0.5503039",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hiu63th",
            "score": 1,
            "text": "I can vouch for this; f*ck Texas and its noisy-ass, single-brain-celled population. Wish they'd defund the police down here faster...",
            "title_similarity": "0.4301742",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hiu66no",
            "score": 1,
            "text": "I feel for medical professionals… as a computer professional who struggled hard between doctors and computer scientist as a young’un… I went with the less emphatic role. \n\nI feel for everyone. We had a rush of empowerment, stoicism… now I watch the light leave my friends faces as they deal with people who created this problem.",
            "title_similarity": "0.65364397",
            "sentiment_compound": -0.2558
        },
        {
            "id": "hiu7db1",
            "score": 2,
            "text": "I see the correlation, but I think a more direct application would be to capitalist workaholics who by their nature don’t care about people",
            "title_similarity": "0.47645384",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hiu7h8r",
            "score": 2,
            "text": "These roles in particular are also very susceptible to compassion fatigue.",
            "title_similarity": "0.6469679",
            "sentiment_compound": 0.3102
        },
        {
            "id": "hiu7ptg",
            "score": 1,
            "text": "So this is why my paramedic wife is such a bitch to me",
            "title_similarity": "0.6062782",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hiu94su",
            "score": 1,
            "text": "Yep i am i give way less fucks when i have to work day shift (7 oclock start) then when i work an evening shift (3 pm start)",
            "title_similarity": "0.45506483",
            "sentiment_compound": -0.1548
        },
        {
            "id": "hiuddd8",
            "score": 1,
            "text": "Life hack: sleep less = feel less",
            "title_similarity": "0.47779447",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiudifk",
            "score": 3,
            "text": "I wonder if it has to do with self-preservation at all? If you don't get enough sleep you suffer mentally and physically so you're less able to take care of yourself if something comes up. In that case, empathy sort of becomes a waste of resources. If you can't take care of yourself, why would you expend what energy you have helping someone else?",
            "title_similarity": "0.7920171",
            "sentiment_compound": -0.4191
        },
        {
            "id": "hiuegt9",
            "score": 1,
            "text": "I believe it. I suffer from insomnia and during the bad bouts there are times I couldn’t care less about anything or anyone. It can get pretty eerie. Sleep deprivation is no joke.",
            "title_similarity": "0.73111343",
            "sentiment_compound": -0.7775
        },
        {
            "id": "hiufhfz",
            "score": 1,
            "text": "I got out of health care because I was an EMT who was over tired and when a cardiac arrest came in ie someone is dead and they need my help because I am on duty and the first emotion i felt was being annoyed. That was someone’s mother that I thought of dying being an inconvenience. I knew I had changed in a way that I didn’t like and I started looking for the door.",
            "title_similarity": "0.7646806",
            "sentiment_compound": -0.743
        },
        {
            "id": "hiuflfm",
            "score": 1,
            "text": "I’ve never met anyone as unfeeling as some police officers and paramedics. This explains it.",
            "title_similarity": "0.4399891",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiugdeh",
            "score": 1,
            "text": "Or that we bury what we see, do and touch while working and when we try and forget; sleep is the first to go.",
            "title_similarity": "0.5622642",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hiuijoz",
            "score": 1,
            "text": "Oh well that explains why sometimes i just feel like everyone could die and i wouldn't even care about it \n\nIt's always in the days i can't sleep because of work or school",
            "title_similarity": "0.7053248",
            "sentiment_compound": -0.4456
        },
        {
            "id": "hiujs7l",
            "score": 1,
            "text": "I can't believe that so many hospitals still use a 12 hour shifts as the standard for doctors and nurses. How many lives would be saved, just by transitioning to 8 hour shifts?",
            "title_similarity": "0.5465387",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hiukdml",
            "score": 1,
            "text": "Alright paramedics. Let’s all get in here and talk about how we hate everyone and we only say hello by giving the middle finger.",
            "title_similarity": "0.45800766",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hiuketi",
            "score": 1,
            "text": "I sleep maybe 3-5 hours normally due to shift work and overtime. My wife says I’m pretty calm and chill. Usually when I’m feeling overtired after 60-75 hour week I’m just short or fatigued. Fatigue is different for anybody but I don’t see how it would be a huge thing with empathy unless not caring about anything than staying awake is the cause for that. Just hierarchy if needs I guess.",
            "title_similarity": "0.7233324",
            "sentiment_compound": 0.0793
        },
        {
            "id": "hium5tw",
            "score": 1,
            "text": "Curious as to who has their health Care system overcrowded like the article said somebody chime in!!",
            "title_similarity": "0.58829904",
            "sentiment_compound": 0.8217
        },
        {
            "id": "hiuma56",
            "score": 1,
            "text": "I'm reading this as a Paramedic 30 hours into my 48 hr shift.\n\n\"Yup, this feels about right\"\n\nI'm never mean or rude to my patients (barring special circumstances where they are trying to physically assault me and/or they are just being verbally  abusive repeatedly despite de-escalation tactics), but when it's towards the end of a long ass shift sometimes I just switch into \"OK I'm going to medically treat you and transport you, but emotionally I'm just gonna not even deal with you and hand you off to the next person to deal with\".",
            "title_similarity": "0.6373379",
            "sentiment_compound": 0.1754
        },
        {
            "id": "hiuo14m",
            "score": 1,
            "text": "Nightshift work is associated with cancer disease. Most people should know this.",
            "title_similarity": "0.5430478",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hiuos7g",
            "score": 1,
            "text": "What can be done for sleep issues besides meds or CBT-I?",
            "title_similarity": "0.36983693",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiupusc",
            "score": 1,
            "text": "New parent here... So that's the excuse I'm dead inside",
            "title_similarity": "0.32988954",
            "sentiment_compound": -0.577
        },
        {
            "id": "hiuqvny",
            "score": 1,
            "text": "Today I learned: \"too tired to give a f\\*\\*k\" is a scientifically explained phenomenon.",
            "title_similarity": "0.44974107",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hiurm49",
            "score": 1,
            "text": "There’s quite a few jobs that are like this. Very unfortunate. My time in the military got me several times of little to no sleep.",
            "title_similarity": "0.6534929",
            "sentiment_compound": -0.4048
        },
        {
            "id": "hius52r",
            "score": 1,
            "text": "The ‘science’ news items on this service are some of the most vapid useless completely unsurprising stories one could try to think of.",
            "title_similarity": "0.5501118",
            "sentiment_compound": -0.4728
        },
        {
            "id": "hiusf4v",
            "score": 1,
            "text": "Only in regards to healthcare would they refer to thirty consecutive hours of sleepless labor as “shift work.”",
            "title_similarity": "0.52578366",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiutjnz",
            "score": 1,
            "text": "Yep, empathy has dropped a ton working night shift through both COVID waves.\n\nUnfortunately, it kinda acts like a truth serum...no filter.\n\n\"If you don't believe in the virus or treatments...then just leave.  Here are the forms, and a POLST telling us we can't do CPR on you or tube you.  See you in 12 hours...cold.\"\n\n\"You are doing poorly due to poor life choices like alcoholism and smoking, and you are morbidly obese.  You will be lucky to be alive in 5 days.\"\n\n\"You smoked a ton of meth, here are resources that you won't use.  Here are your discharge instructions that you won't follow\"\n\n\"If you don't want care..then you can  leave (my medical director).\"\n\nAlot of us ED nurses are either scrambling for specialties or faking a smile to make triple the cash travelling.  Y'all have fun with the new grads.",
            "title_similarity": "0.6595836",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hiutu45",
            "score": 1,
            "text": "I have been in EMS for about 10 years now. March of this year I suffered a shoulder injury that had me off of work for about a month and a half. I was placed on modified duties, meaning I worked in a vaccine clinic. During that month and a half with a regular sleep schedule and routine bed time, I hadn't felt that good in years. Honestly, I had forgotten what that felt like. Currently working on going back to school to make it a regular thing. I will not miss this profession.",
            "title_similarity": "0.57918453",
            "sentiment_compound": -0.5207
        },
        {
            "id": "hiuuz38",
            "score": 1,
            "text": "Ahhhh so that’s why my typical 2-3 hours a day is affecting me this way",
            "title_similarity": "0.4993363",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiuv4uu",
            "score": 1,
            "text": "Paramedic here. At first glance I thought this was someone in a unicorn costume wearing a high-vis coat",
            "title_similarity": "0.17511195",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiuw8lw",
            "score": 1,
            "text": "Is this somehow on purpose? Got to be... Right?",
            "title_similarity": "0.04180121",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiuyao2",
            "score": 1,
            "text": "I have worked as a nursing assistant and had to work 3 shifts in a row before! When the next day your waking up your patient. It's almost impossible!",
            "title_similarity": "0.5709759",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiuyo90",
            "score": 1,
            "text": "The fact that 12 hour shifts and closing/opening constantly on call duty shifts are casually seen as “okay” and “that’s just how our staff runs” in the medical industry blows my mind. On one hand I get in a disaster needing to step in, but this is their everyday life. \n\nThat can’t be good on mental health or physical health.",
            "title_similarity": "0.7635765",
            "sentiment_compound": 0.5789
        },
        {
            "id": "hiuzi8c",
            "score": 1,
            "text": "I feel this in my soul. I’m currently working my first of 4 12 hour night shifts this week. I also have an 18 month old. The fatigue is real.",
            "title_similarity": "0.5022671",
            "sentiment_compound": -0.25
        },
        {
            "id": "hiuzvqp",
            "score": 1,
            "text": "Ooh that's what this is.",
            "title_similarity": "-0.14681238",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiv1y1h",
            "score": 1,
            "text": "Don't forget about the people in the kitchens.",
            "title_similarity": "0.21901397",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hiv202e",
            "score": 1,
            "text": "Maggie Thatcher reportedly never slept more than 4 hours a night. No wonder she was a soulless robot.",
            "title_similarity": "0.464886",
            "sentiment_compound": -0.296
        },
        {
            "id": "hiv3unj",
            "score": 1,
            "text": "yea i never got why cops, firemen and ambulance personnel arent the best payed jobs in the world.. most of the them are *actual heroes*",
            "title_similarity": "0.55100316",
            "sentiment_compound": -0.0176
        },
        {
            "id": "hiv50wo",
            "score": 1,
            "text": "Even without work I can't sleep early anymore",
            "title_similarity": "0.5199789",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiv7gt0",
            "score": 1,
            "text": "Literally reading this as I work a 2300-0700 shift, 7th day in a row, and 56th hour this week.",
            "title_similarity": "0.33205652",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiv81qq",
            "score": 1,
            "text": "What about the opposite?",
            "title_similarity": "0.08465755",
            "sentiment_compound": 0.0
        },
        {
            "id": "hiv891s",
            "score": 1,
            "text": "911 Dispatcher here.  12-16 hour shifts, very little days off, gaps between shifts 8 hours (but with commute, getting ready, etc) end up getting 4 hours of sleep on most days ---and I definitely lose my empathy.  All I want is to be off duty and asleep.  For some reason the people who do some of the most important work have the least amount of care given to mental/physical/emotional well being while doing the job.  It's this ridiculous concept that \"Well this job IS important, so we don't have to follow the same labor laws other employers do because we NEED them to b here\" ---all the while burning out employees and causing the ones left behind to be burdoned even moreso.",
            "title_similarity": "0.78434354",
            "sentiment_compound": 0.9235
        },
        {
            "id": "hiv9606",
            "score": 1,
            "text": "I used to work as am ambulance dispatcher, 12 hour shifts were difficult enough.\n\nI don't know how others do it longer, I'm full of admiration and gratitude to those who put their real lives on the back burner in order to keep our communities safe.",
            "title_similarity": "0.58952165",
            "sentiment_compound": 0.802
        },
        {
            "id": "hivcmwn",
            "score": 1,
            "text": "Ah.. simply known in the military as F'-it..\n\nBecause the night move, road march, infil, ambush, road marching again, MRE, road march some more, weapon cleaning and turn in, all leaves you with just the inspection of your room and TA-50 (equipment), heath and welfare check, morning PT (you know, because it's only Thursday and Friday your headed back out to do it on a platoon level instead of squad this time).. feeling.. (Yes this was before the standard of soldiers living act [Pres. Clinton] )..",
            "title_similarity": "0.5541502",
            "sentiment_compound": 0.1796
        },
        {
            "id": "hivdekh",
            "score": 1,
            "text": "I've been sleep deprived for 15 years. I started working 3rd shift since I was up all night anyway. I only get like 2 hours of sleep a day. \n\nI haven't felt anything for years",
            "title_similarity": "0.49157035",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hivfkdg",
            "score": 1,
            "text": "Ive always found it cruel how LONG med professionals have to work per day. most places seem to have staffing issues and overload their staff. I wish it didnt have to be this way. Nobody should have to work those hours per day. They have to be able to focus and save lives. :(",
            "title_similarity": "0.85169137",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hivit00",
            "score": 1,
            "text": "Holy piss ppl need sleep? I had no idea. Thanks r/science",
            "title_similarity": "0.44431174",
            "sentiment_compound": -0.7435
        },
        {
            "id": "hivn9dx",
            "score": 1,
            "text": "Same problem in US pharmacies right now with no technician help and unlimited covid and flu vaccine demand that doubles your workloads.\n\nI have no more cares to give.",
            "title_similarity": "0.55850035",
            "sentiment_compound": -0.9221
        },
        {
            "id": "hixa5qo",
            "score": 1,
            "text": "Here i sit on cq. My room 40feet away. 1 hr left",
            "title_similarity": "0.31174225",
            "sentiment_compound": 0.0
        },
        {
            "id": "hj6h2e4",
            "score": 1,
            "text": "\"But its the only way to go through medical school\"",
            "title_similarity": "0.23236133",
            "sentiment_compound": 0.0
        }
    ]
}