{
    "More than 43% of white student admits at Harvard University are ALDC admissions (athletes, legacies, dean’s interest list, children of faculty and staff). Roughly three-quarters of white ALDC admits would have been rejected absent their ALDC status.\n": [
        {
            "id": "hjgwx6p",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.4058265",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hjhlxn3",
            "score": 3,
            "text": "I mean honestly who cares. Why would you want to go to  Harvard? These are exactly the types of people it is for.",
            "title_similarity": "0.59136754",
            "sentiment_compound": 0.743
        },
        {
            "id": "hjh2a20",
            "score": 5,
            "text": "Another class division tradition of America",
            "title_similarity": "0.40299618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjhkrv3",
            "score": 13,
            "text": "Many of the Ivy league students I meet today are absolute dunder headed children of wealthy parents.",
            "title_similarity": "0.56557083",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hjiim7w",
            "score": 0,
            "text": "Good thing a college degree means nothing anymore!",
            "title_similarity": "0.3257898",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hjgyxbr",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.0012462288"
        },
        {
            "id": "hjifj9m",
            "score": -1,
            "text": "The rich self dealing.  What's amazing is how they've convinced the poor that they don't deserve a thing to the point that the poor are screaming for the deprivation and voting against their own self interest.",
            "title_similarity": "0.4131195",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hjh06jw",
            "score": -15,
            "text": "colleges should be paying them to go there. they make *so much money* off college sports it's disgusting. look at the head coach pay. look at the fans in the stadiums and how heavily commercialized it is.\n\nwhole thing's a mess. skin color or athletic ability all the same.",
            "title_similarity": "0.47523168",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hjib4rr",
            "score": 4,
            "text": "So white students need special status to get it but not other ethnicities?",
            "title_similarity": "0.5469503",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hjhw8bg",
            "score": 46,
            "text": "And exactly what's the problem? Isn't this exactly how most of the universities work?  I wonder what percentage of black student admits into Harvard are purely from academics.  Whenever you separate people into black and white, you create problems.  It should be illegal to ask someone's race on any form in America.",
            "title_similarity": "0.7172997",
            "sentiment_compound": -0.7236
        },
        {
            "id": "hjgx9sd",
            "score": 147,
            "text": "[removed]",
            "title_similarity": "-0.0012462288"
        },
        {
            "id": "hjh08wk",
            "score": -5,
            "text": "And what are we going to do about it?",
            "title_similarity": "-0.0071172975",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjhx65t",
            "score": 6,
            "text": "37.1 % are white.\n\n37.1*.43 = 15.9\n\n15.9 * .75 = 11.9\n\nSo 11.9% of the class does not meet Harvard academic standards.",
            "title_similarity": "0.7704164",
            "sentiment_compound": 0.0
        },
        {
            "id": "hji1qo4",
            "score": 4,
            "text": "Rowing crew has never been a bad choice for a white kid who wants a top-tier diploma.",
            "title_similarity": "0.47055697",
            "sentiment_compound": 0.431
        },
        {
            "id": "hjhq7ja",
            "score": 14,
            "text": "This os interesting but not really science.",
            "title_similarity": "0.15691061",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hjhp4d4",
            "score": 18,
            "text": "Yeah but what percentage of those are athletes? They’re an example of meritocracy whereas the other groups listed are not. It’s a completely valid reason for admission in an otherwise ballpark candidate. It’s much more difficult to balance being a high-performing high school athlete coupled with strong academic performance compared to simply the latter on its own. Plus athletic adolescents tend to be more accepted by their peers and hence develop better social skills, which results in greater career potential. There’s plenty of research supporting this.",
            "title_similarity": "0.58212173",
            "sentiment_compound": 0.9493
        },
        {
            "id": "hjia8n7",
            "score": 13,
            "text": "But the real problem is affirmative action. We need to get back to when it was all merit based. Merit being one of the aforementioned special categories.",
            "title_similarity": "0.34638",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hjhthif",
            "score": 124,
            "text": "now run the calculations for how many academically high-achieving white students get turned away in favor of vastly less qualified affirmative action candidates and ethnically motivated nepotism by other races\n\nhttps://www.unz.com/wp-content/uploads/2013/09/eliteenrollment-large.jpg\n\nhuh. really makes you think, doesn't it?",
            "title_similarity": "0.731364",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hjh5fr2",
            "score": 62,
            "text": "> athletes\n\nIt may be worth pointing out that athletic achievement does take work, effort, and talent, as opposed to being legacy, being dean's interest, or being a child of faculty/staff.  Not entirely worthwhile grouping athletes with the rest, and it does bring value to the community and the university to have individuals of exceptional talent (academic or otherwise) in attendance",
            "title_similarity": "0.47073305",
            "sentiment_compound": 0.8732
        },
        {
            "id": "hjips53",
            "score": 26,
            "text": "[removed]",
            "title_similarity": "-0.0012462288"
        },
        {
            "id": "hji3m4n",
            "score": 9,
            "text": "I am going by memory for standard Reddit reasons, but my memory is that other places like MIT and University of Chicago went the merit focused route while Harvard went the ‘perfect mix’ route and Harvard’s route appears to be more successful.\n\nBasically you don’t just want a bunch of smart students, you want a mix which includes students with connections and wealth in addition to the smart students. This results in the greatest success and impact.",
            "title_similarity": "0.61008567",
            "sentiment_compound": 0.9918
        },
        {
            "id": "hjiws1b",
            "score": 9,
            "text": "How many of that percentage are jewish?",
            "title_similarity": "0.4452328",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjib01x",
            "score": 35,
            "text": "Always knew as a white middle class kid from the Midwest it was impossible to get into Harvard, and here are the facts. Separate social classes (Socialism) in America. This is why the phrase white privilege is nonsense, it’s rich privilege",
            "title_similarity": "0.6100048",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hjhj0ti",
            "score": 5,
            "text": "So more like a club, not so much a college.",
            "title_similarity": "0.23188098",
            "sentiment_compound": 0.4716
        },
        {
            "id": "hjhhop2",
            "score": 74,
            "text": "“We use public documents from the Students for Fair Admissions v. Harvard University lawsuit to examine admissions preferences for recruited athletes, legacies, those on the dean’s interest list, and children of faculty and staff (ALDCs). More than 43% of white admits are ALDC; the share for African American, Asian American, and Hispanics is less than 16%. Our model of admissions shows that roughly three-quarters of white ALDC admits would have been rejected absent their ALDC status. Removing preferences for athletes and legacies would significantly alter the racial distribution of admitted students away from whites.”\n\nOkay, but the unspoken problem here is that if you go straight merit (by removing ALDC preferences), yeah you’ll probably decrease the percentage of white students, but you’ll also probably dramatically increase the percentage of asian students.  And having lots of asians is even less desirable than having lots of whites, for these places.\n\nTL; DR: Asians are the new Jews.",
            "title_similarity": "0.8898317",
            "sentiment_compound": 0.9226
        },
        {
            "id": "hjidp1s",
            "score": 7,
            "text": "I don't get how they can mention this and then act like the remaining affirmative action is an even playing field. They engage in illegal racial discrimination against east asian students",
            "title_similarity": "0.5697464",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hjifd9o",
            "score": 6,
            "text": "Now show us how many Black, Asian, Indian, etc admissions are due to meeting racial quotas.",
            "title_similarity": "0.60659814",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjio2bp",
            "score": 7,
            "text": "I get so tired of Harvard’s admissions demographics becoming news constantly. 99.9% of the American population didn’t go to Harvard. It’s an elite institution. We get it. It is not Mount Olympus. Harvard needs to get over itself as does everyone else obsessed with Harvard admissions. Do you start shitting gold, glowing white, and dictating sacred scripture the moment you get your undergraduate degree from there?",
            "title_similarity": "0.76177394",
            "sentiment_compound": -0.8042
        },
        {
            "id": "hji6ui0",
            "score": 3,
            "text": "So the non-white students weren’t asked?",
            "title_similarity": "0.3672362",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjh5ehw",
            "score": 9,
            "text": "I wonder what kind of pattern we'd see in the Big 10 or SEC for blacks.",
            "title_similarity": "0.5124259",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjhrcyx",
            "score": 7,
            "text": "So what it’s a private school",
            "title_similarity": "0.20920643",
            "sentiment_compound": 0.0
        },
        {
            "id": "hji9fb8",
            "score": -7,
            "text": "This is such a key finding. When you start talking about affirmative action at these elite schools, it's always about Asians versus other minorities, because many Asians do great on objective measures like test scores and grades. \n\nAll the affirmative action work for underrepresented minorities pales in comparison to \"affirmative action\" for unqualified white kids who come from privilege and can get into one of these slots. At prestigious schools at least half the athletic teams are basically non-competitive ways to get these unqualified kids into the school, on cross country or tennis or sailing or whatever admissions and scholarships. \n\nInstead of pitting minorities against each other, let's end these discriminatory \"who you know\" practices first.",
            "title_similarity": "0.75059646",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hjk3l60",
            "score": 6,
            "text": "Yet people act as if affirmative action is what ruined the otherwise perfect meritocracy of colleges...",
            "title_similarity": "0.5092977",
            "sentiment_compound": 0.296
        },
        {
            "id": "hji6w85",
            "score": 6,
            "text": "Harvard has a massive endowment, which they deploy vigorously. Part of feeding this endowment is admitting people whose families have contributed and/or are likely to contribute. It will always compose a percentage of their admits — some percentage of which will be legacies.\n\nAthletes staff a competitive program and together with legacies help round out the “happy bottom quarter”.[1] They will not have a class full of the world’s top valedictorians and then more or less force a curve on them.\n\n[1] http://www.newyorker.com/magazine/2005/10/10/getting-in",
            "title_similarity": "0.68763727",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hjicvtf",
            "score": 37,
            "text": "Now do black students and affirmative action. Then compare average of black students to average of Asian students, who get totally screwed over by AA. \n\nWhy can’t we just have merit based decisions for admission across the board and stop telling Asian kids they have to be way better to get in than if they were just born black?  That’s the definition of racism.",
            "title_similarity": "0.6981692",
            "sentiment_compound": -0.624
        },
        {
            "id": "hjh9kfq",
            "score": 55,
            "text": "Given affirmative action policies in harvard this number doesn't represent much, as the percent would be lower if whites and asians weren't discriminated against",
            "title_similarity": "0.6153231",
            "sentiment_compound": -0.2083
        },
        {
            "id": "hjiatn0",
            "score": 11,
            "text": "Sweet.  \n  \nNow do minorities.",
            "title_similarity": "0.20949359",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hji0dj8",
            "score": -2,
            "text": "Karl Marx went into this at some length. You should check him out.",
            "title_similarity": "0.2803364",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjiddfk",
            "score": 3,
            "text": "What percent of minority students are affirmative action admits?",
            "title_similarity": "0.6799062",
            "sentiment_compound": 0.296
        },
        {
            "id": "hjj9dzp",
            "score": 1,
            "text": "Harvard is a trust fund with an education wing. I don't take that aristocrat nonsense seriously. Their existence proves higher education has lost its way.",
            "title_similarity": "0.54846025",
            "sentiment_compound": -0.34
        },
        {
            "id": "hjie3e3",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.0012462288"
        },
        {
            "id": "hjiasxl",
            "score": 20,
            "text": "And the admits for black students for sports or affirmative action based programs is..? I'm sorry, but this isn't a racial issue. No one at this point thinks Harvard is a hardcore, academic, purely meritocratic institution. Even MIT is increasingly dubious in that regard. Personally, I'd say whomever gets the highest grades and test scores goes to the school. Also, that's going to be be disproportionately white and Asian, which is fine. \n\nOverall, the only lesson to be learned is we need an *actual* meritocracy. And what that looks like isn't going to be comfortable for a lot of people",
            "title_similarity": "0.6936853",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hjihxf1",
            "score": 9,
            "text": "Did any of those 43% of people possibly earn there spot.   or we just going to broad stroke the whole thing for clicks?",
            "title_similarity": "0.6292864",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjhgpbb",
            "score": 18,
            "text": "Secondary education is a crap show.",
            "title_similarity": "0.33916363",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hjhsdrj",
            "score": 58,
            "text": "\"Roughly 3/4 of white ALDC admits would have been rejected absent their ALDC status\" is such a misleading statement.\n\nFirst, this segmenting on white people smells a lot like data dredging; someone looked at a lot of characteristics like income, race, ALDC vs just legacy, etc. And just picked the one that stood out the most.\n\nRoughly 95% of people are rejected from Harvard each year, so this is actually saying that the average ALDC admit is in the top 20% of the applicant pool. But it doesn't sound as bad that way, does it? Most people who get into Harvard barely make the cut above the thousands of other qualified applicants, so we definitely expect even a small boost like ALDC to drastically affect people's chances.\n\n\"More than 43% of white student admits...\" And what was the percentage for other races and the whole student body? Why is the statistic reported like this? Why not phrase it as \"x% of ALDC admits were white, x% were Asian, x% were black...\"\n\nThis article smells like someone came up with a conclusion and dredged up data and methods of data presentation to support that conclusion.",
            "title_similarity": "0.8334094",
            "sentiment_compound": 0.9841
        },
        {
            "id": "hjh612k",
            "score": 37,
            "text": "But I thought we lived in a meritocracy...",
            "title_similarity": "0.25778168",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hjid7i3",
            "score": 11,
            "text": "What percentage would POC be rejected if not for race based admission?",
            "title_similarity": "0.53028923",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hjidop3",
            "score": -4,
            "text": "Sounds affirmative action but for whites",
            "title_similarity": "0.39548832",
            "sentiment_compound": 0.0
        },
        {
            "id": "hji0a3c",
            "score": 6,
            "text": "So it's really the poor, non-connected white kids who are at the biggest disadvantage, possibly only edged out by a non-connected Asian kid.",
            "title_similarity": "0.5105725",
            "sentiment_compound": -0.7334
        },
        {
            "id": "hjhj3fk",
            "score": 160,
            "text": "So what this article is saying is that rather than having the best of the best, Harvard is actually 1/3 occupied by schmucks with rich parents.\n\n… should we really be treating it as like, a special school for smart people?",
            "title_similarity": "0.72355866",
            "sentiment_compound": 0.9633
        },
        {
            "id": "hjhtagk",
            "score": -7,
            "text": "It’s good to be white",
            "title_similarity": "0.11451544",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hjia0x9",
            "score": 6,
            "text": "Now look at race based admissions.",
            "title_similarity": "0.30510598",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjiysw5",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.0012462288"
        },
        {
            "id": "hji0a7o",
            "score": -1,
            "text": "So, You've graduated Harvard? Dismissed.",
            "title_similarity": "0.53826493",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjif2he",
            "score": -1,
            "text": "OF COURSE....  this isn't news kiddoes",
            "title_similarity": "-0.010125191",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjii30q",
            "score": -1,
            "text": "I’ve wondered why people think that claiming to be a minority gives them an advantage. What’s worse is that they cry reverse racism. Too bad they weren’t legacy because I’m sure they’d be ok with that.",
            "title_similarity": "0.48082593",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hjk34xy",
            "score": 2,
            "text": "It’s like some white folk have been using affirmative action for themselves the whole time!",
            "title_similarity": "0.49744138",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hjhbopq",
            "score": 311,
            "text": "Rampant nepotism aside, why are university admissions in the USA based on race? That's seems frankly really racist and unfair.",
            "title_similarity": "0.54479396",
            "sentiment_compound": -0.8251
        },
        {
            "id": "hji2z4f",
            "score": 244,
            "text": "SO: \n\nDoes this mean that non-white kids are discriminated against, since majority whites are accepted from nepotism?\n\nOr does this mean white kids are being discriminated against, since apparently it’s impossible to get in without nepotism to bridge the affirmative action gap?",
            "title_similarity": "0.6380054",
            "sentiment_compound": 0.3527
        },
        {
            "id": "hji1oa5",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.041252088"
        },
        {
            "id": "hjivmat",
            "score": 44,
            "text": "No student should be given preference regardless of their ALDC status OR race. \n\nMerit only.",
            "title_similarity": "0.38270336",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hjhl9ai",
            "score": -9,
            "text": "I had to look up ALDC. Which is it? \nALDC\nAlso found in: Medical.\nAcronym\tDefinition\nALDC\tAbby Lee Dance Company (Pittsburgh, PA)\nALDC\tAssociation of Liberal Democrat Councillors (GB)\nALDC\tAdaptive Lossless Data Compression (IBM)\nALDC\tAdvanced Lossless Data Compression\nALDC\tAtlanta Legal Diversity Consortium (Georgia)\nALDC\tAdvanced Learning Development Center\nALDC\tAirlie Leadership Development Centre (Victoria Police; Victoria, Australia)\nALDC\tAfferent Lymph Dendritic Cell",
            "title_similarity": "0.48005787",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hjiefk3",
            "score": 14,
            "text": "I'm surprise everyone on Reddit here seems to have attended Harvard and know everything about it",
            "title_similarity": "0.5719454",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hjht3dd",
            "score": 0,
            "text": "Crony Capitalism lead the US here. \"It isn't WHAT you know, it's WHO.\"",
            "title_similarity": "0.3110538",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjhvotk",
            "score": 0,
            "text": "Elise Stefanik didn’t get in because she was smart.",
            "title_similarity": "0.3362466",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hjhz3y3",
            "score": 0,
            "text": "Keep telling us that the world runs as a meritocracy.",
            "title_similarity": "0.2571572",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hjhzskb",
            "score": 0,
            "text": "Not surprising at all",
            "title_similarity": "-0.06344783",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hji173u",
            "score": 5,
            "text": "And every other person of a different race 100% earned their way in on grit and hard work",
            "title_similarity": "0.36850148",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hji2779",
            "score": 0,
            "text": "Then they should be absent. This \"know body to get in\" society we live in needs to stop. Underqualified people getting jobs, education and pay just because they know someone, but those who have, or can earn it, the qualified ones, get tossed to the wayside. I worked at a pizza joint with a guy with a masters in some kind of management field, but got passed over for the bosses nephew or something. Its all fucked. Y'all people need to do better.",
            "title_similarity": "0.47522885",
            "sentiment_compound": -0.6187
        },
        {
            "id": "hji2mko",
            "score": 0,
            "text": "When you realize its all about branding then you realize why it is so.",
            "title_similarity": "0.16183276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hji3p9a",
            "score": 0,
            "text": "That's equality!  Gotta make sure there is a proportionate number of privileged in the student body!",
            "title_similarity": "0.48055917",
            "sentiment_compound": 0.7256
        },
        {
            "id": "hji4aq4",
            "score": 2,
            "text": "Given the white population of the US is greater than 42%, whites are actually underrepresented in this regard",
            "title_similarity": "0.6512579",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hji9v8n",
            "score": 0,
            "text": "Ah so this is why I didn’t get into half the schools I applied to",
            "title_similarity": "0.6565901",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjic1u8",
            "score": 0,
            "text": "It's long been said that the hardest part of going to Harvard was getting into Harvard and this is why.",
            "title_similarity": "0.59480757",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjicd4m",
            "score": 0,
            "text": "But some white people somewhere are poor, so white privilege doesn’t exist.",
            "title_similarity": "0.47813165",
            "sentiment_compound": -0.1236
        },
        {
            "id": "hjicfk6",
            "score": 0,
            "text": "Every institution gets corrupted eventually",
            "title_similarity": "0.31754118",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjicir3",
            "score": 0,
            "text": "Nepotism and cronyism is how America operates, otherwise feel free to choose subjugation.  (There are outliers of course)",
            "title_similarity": "0.344562",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hjidxyy",
            "score": 0,
            "text": "I'd like to show this to everyone crying about unfair admissions and \"reverse racism\"",
            "title_similarity": "0.34623915",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hjidzke",
            "score": 0,
            "text": "This is a known fact.  *eleite* schools in America  are pay to play.  Education might be slightly better  than others,  but advertising keeps the names higher-end.",
            "title_similarity": "0.48832205",
            "sentiment_compound": 0.319
        },
        {
            "id": "hjiebc5",
            "score": 0,
            "text": "That’s actually less than I thought it would be. I just assumed all white students fell under one of those categories.",
            "title_similarity": "0.62555015",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjiemhd",
            "score": 0,
            "text": "Bro, jump in the water or don’t… if you just stick your toe in, you gon’ get fucked.",
            "title_similarity": "0.22007582",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hjifi32",
            "score": 0,
            "text": "So 75% of the 43% would have been rejected if not for some previous connection? That's crazy yet it also makes a lot of sense when clearly dumb people have Harvard on their resume.\n\nI'm looking at you, Ted Cruz.",
            "title_similarity": "0.7698652",
            "sentiment_compound": -0.743
        },
        {
            "id": "hjifonb",
            "score": 0,
            "text": "I’ll take ‘what is nepotism’ for $500, Alex.",
            "title_similarity": "0.43026316",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjifpjd",
            "score": 0,
            "text": "Honestly, I've never looked at Harvard the same after they rejected Joey Cheek. Lost all respect for them there.",
            "title_similarity": "0.55887496",
            "sentiment_compound": 0.128
        },
        {
            "id": "hjig39k",
            "score": 0,
            "text": "Clown school anyway. Zuckerberg who is proof we don’t select to remove from gene pool went there",
            "title_similarity": "0.38272917",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjig530",
            "score": 0,
            "text": "I know god damn those fuckin white people. There they go again.",
            "title_similarity": "0.3093148",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hjih6l4",
            "score": 0,
            "text": "Privileged people gonna privilege",
            "title_similarity": "0.19708145",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hjihov7",
            "score": 0,
            "text": "Sounds legit, Harvard never once pretended that it’s education is built on fair, competitive grounds",
            "title_similarity": "0.4299804",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hjihzko",
            "score": 0,
            "text": "It’s not what you know it’s who you know.",
            "title_similarity": "0.046744622",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjiiwlp",
            "score": 0,
            "text": "The problem is people assume these universities exist to give the smartest an education. They want graduates with money and status. \n\nAnd sure, some smart kids may get admitted and eventually win some award, or someone could be a prominent academic or public figure, but that's peanuts compared to those who will be CEO or founder of some company because they had the means to have their family financially support their passion, and donate to get their kids in, or make a ton of money by having enough disposable income to invest significant in start ups and donate some of that money to ensure their kids get in, or succeed in politics because they are part of a political dynasty, and can donate to ensure their kids get in and continue the dynasty. And Harvard and Yale and Princeton can put each of their photos on the their website and say \"see, you too can achieve great things if you're smart enough to get into this school,\" when in reality being \"smart\" only accounts for a small sliver of the Ivy success stories.",
            "title_similarity": "0.6014307",
            "sentiment_compound": 0.9937
        },
        {
            "id": "hjiiwm7",
            "score": 0,
            "text": "How else do you expect to be elected president, if you don't want to wear orange face?",
            "title_similarity": "0.41898164",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hjiizlr",
            "score": 0,
            "text": "Now i know why i got dinged by haaaarvard.",
            "title_similarity": "0.16089007",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjijq03",
            "score": 0,
            "text": "It’s simple, the larger an entity/institution/corporate becomes, the more corrupt and unjust way of working!",
            "title_similarity": "0.33307305",
            "sentiment_compound": -0.5935
        },
        {
            "id": "hjijxrj",
            "score": 0,
            "text": "Then we should care if someone graduated from Harvard. It is essentially meaningless.",
            "title_similarity": "0.49160329",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hjijzqk",
            "score": 0,
            "text": "If you aren’t a part of the good ole boys club, you ain’t in it.",
            "title_similarity": "0.39668626",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hjik4rm",
            "score": 0,
            "text": "Being accepted without merit ? Isnt Havard suppose to be one of the greatest university in the world ? American education system is so corrupted.",
            "title_similarity": "0.561968",
            "sentiment_compound": 0.6517
        },
        {
            "id": "hjik6o7",
            "score": 0,
            "text": "Not surprising in the slightest",
            "title_similarity": "-0.037086718",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hjikt8g",
            "score": 0,
            "text": "Young pope S1:2\n\nLenny Ballardo:\n\nThe name Harvard may impress everyone around here, but to an American it only means one thing. Decline.\nLenny",
            "title_similarity": "0.60896826",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hjil6hc",
            "score": 0,
            "text": "Also Harvard has a lot of white students falsely claiming minority status.",
            "title_similarity": "0.8005499",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjila7a",
            "score": 0,
            "text": "Where does race come into play with this? Not baiting just genuinely curious.",
            "title_similarity": "0.19765034",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hjilmr8",
            "score": 0,
            "text": "That’s how the world works.  No different in any arena. Know someone.",
            "title_similarity": "0.11638494",
            "sentiment_compound": -0.296
        },
        {
            "id": "hjim84v",
            "score": 0,
            "text": "Not really news. Everyone knows this already. Same thing at most major companies too.",
            "title_similarity": "0.35892862",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjimbtj",
            "score": 0,
            "text": "That is so completely fucked. Public institutions should not be granting access to the best education in the country based on who their friends are. It's honestly quite surprising to me that this is even legal.",
            "title_similarity": "0.44467402",
            "sentiment_compound": 0.7399
        },
        {
            "id": "hjin0v7",
            "score": 0,
            "text": "People go to Harvard only for networking.",
            "title_similarity": "0.5849323",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjin6zb",
            "score": 0,
            "text": "Don't forget Harvard is so rich in bequests, literally billions, they don't need to charge any student a cent. Ever. Think about that. Harvard is incredibly well endowed but somehow they don't have the balls to do good unless you are already a privileged asshole.  That's privileged with the silent \" white rich male connected and almost  certainly less smart than your neighbours dog\".  But we don't talk about that nor the bizzare initiation rituals. Yes America this is how you raise your ruling class. Unless they went to Wharton (not really but if you pay enough you can get a course credit).",
            "title_similarity": "0.60671353",
            "sentiment_compound": 0.9861
        },
        {
            "id": "hjin7fj",
            "score": 0,
            "text": "But there’s no such thing as systemic racism",
            "title_similarity": "0.096923426",
            "sentiment_compound": -0.8573
        },
        {
            "id": "hjin8qb",
            "score": 0,
            "text": "The same colleges that claim to be so \"woke and progressive\". What a joke",
            "title_similarity": "0.4234519",
            "sentiment_compound": 0.296
        },
        {
            "id": "hjindfa",
            "score": 0,
            "text": "Harvard loves that Sackler $.",
            "title_similarity": "0.35213515",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hjinf9w",
            "score": 0,
            "text": "Throws ball good means learns calculus good.",
            "title_similarity": "0.32911813",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hjinofy",
            "score": 0,
            "text": "High end government jobs should disallow Ivy League credentials....I'm pretty sure it has a lot to do with the situation the country is in.",
            "title_similarity": "0.45875233",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hjiopl9",
            "score": 0,
            "text": "I like how this has been known for decades, but now Gen X and the Millennials are supposed to do something about it because of \"the injustice\"",
            "title_similarity": "0.43607378",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hjioqjv",
            "score": 0,
            "text": "The even crazier thing is that most of them graduate meaning Harvard is not an elite academic institution,  it’s an exclusive private club.  Why do we not tax this  fraud?",
            "title_similarity": "0.6447897",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hjip50l",
            "score": 0,
            "text": "To be honest, am sick of trying to hide the morally correct view. It’s time we started telling white people that they aren’t allowed to participate because they have generated so much privilege in the past.\n\nWe should demand that only POC’s are given preferential treatment in all universities, government sectors and also mandate leadership position requirements in privately owned businesses.\n\nWhite people need to take the next 2 generations to think about how much pain they have caused.",
            "title_similarity": "0.5757816",
            "sentiment_compound": -0.4062
        },
        {
            "id": "hjiq54m",
            "score": 0,
            "text": "It’s a big club and you ain’t in it",
            "title_similarity": "0.26703063",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjiqfdy",
            "score": 0,
            "text": "I've met some morons with harvard degrees. I believe it",
            "title_similarity": "0.57926846",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hjiqsvm",
            "score": 0,
            "text": "So THAT’S why so many people at good schools are dumber than you’d expect",
            "title_similarity": "0.6099571",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hjir9lt",
            "score": 0,
            "text": "It ain’t what you know, it’s who you know …",
            "title_similarity": "0.027294096",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjirlve",
            "score": 0,
            "text": "Dare I say, white privilege",
            "title_similarity": "0.2715354",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hjit0nf",
            "score": 0,
            "text": "When people talk about SYSTEMS this is what they mean. \n\nSystemic power. Systemic racism.",
            "title_similarity": "0.31712103",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hjiu1gv",
            "score": 0,
            "text": "People seem to think colleges aren’t greedy corporations.",
            "title_similarity": "0.392554",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hjiuijf",
            "score": 0,
            "text": "How white supremacy is maintained…",
            "title_similarity": "0.26226977",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hjiv9bg",
            "score": 0,
            "text": "Wow surprise surprise manufactured prestige in one of the highest regarded universities in the world. Who’d a thunk?",
            "title_similarity": "0.49569598",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hjiw5em",
            "score": 0,
            "text": "So what? Higher education in America is a bigger grift than big pharma. At least when it comes to sleaze factor.",
            "title_similarity": "0.509366",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjiwen1",
            "score": 4,
            "text": "Nice. Now do affirmative action",
            "title_similarity": "0.082867265",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hjixug0",
            "score": 0,
            "text": "Harvard also perpetually releases studies on diet, the environment, that are bought and paid for by industry lobbies and serve to undermine science as a construct. I don't think harvard is as impressive as people hope it is",
            "title_similarity": "0.55281806",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hjixy8k",
            "score": 0,
            "text": "It's not the pro affirmative action or anti affirmative action people that are dumb. It's the people that think Ivy leagues provide a better educational experience than any other schools, or that the smartest people all go to Ivy's. Their students end up in high places because they mingled with the children of the rich and powerful for 4-8 years.",
            "title_similarity": "0.62526476",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hjiy7wr",
            "score": 0,
            "text": "Bahaha - I got asked what “sport” I played and told that affirmative action was the only reason I was in school so much this article soothes my soul. It’s messed up of me but I’ll own it. \n\nAnd also, sharing SAT scores, job history, grades…the looks that followed, that also soothed my soul.",
            "title_similarity": "0.43823725",
            "sentiment_compound": 0.6652
        },
        {
            "id": "hjiyd0c",
            "score": 0,
            "text": "Affirmative action is the problem though",
            "title_similarity": "0.27956766",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hjiygm2",
            "score": 0,
            "text": "It's not what you know, it's who you know. It's what makes it an exclusive club that people like Jared Kushner can get into but people much smarter than him cannot.",
            "title_similarity": "0.44291574",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hjiyxto",
            "score": 0,
            "text": "So it's predominantly a school for the most well off as opposed to the best and brightest?\n\nWho'd have thought.",
            "title_similarity": "0.58586705",
            "sentiment_compound": 0.8908
        },
        {
            "id": "hjj014k",
            "score": 0,
            "text": "Merit doesn't work. Elite schools should not exist. Filtering and selecting students is not a good idea.\n\nI'm pretty okay with selecting job candidates, but everyone should have access to the same education.\n\nAnd if candidates are not really picked based on grades and merit, does that really mean Harvard graduates are really elite when they get out of Harvard? Or just having Harvard on a degree increase perceived reputation?\n\nI'm confused because what makes Harvard a good school? Are rich students better students because they previously attended better schools and high schools? It seems quality education is more based on societal values and norms rather that measurable performance.",
            "title_similarity": "0.67967945",
            "sentiment_compound": 0.9825
        },
        {
            "id": "hjj03rl",
            "score": 0,
            "text": "It’s not what you know, it’s who you know.",
            "title_similarity": "0.03069833",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjj0cdi",
            "score": 0,
            "text": "Nepotism? In an elite Ivy League university? Must be a day that ends in y",
            "title_similarity": "0.5309301",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjj653r",
            "score": 0,
            "text": "So who is really getting affirmative action. You got selected cause daddy went there not because you are smart. Almost half of white students. Talk about privilege.",
            "title_similarity": "0.7298205",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hjj91uv",
            "score": 0,
            "text": "What about the other races. Without a comparative data point, this is worthless.",
            "title_similarity": "0.44553143",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hjj9ek1",
            "score": 0,
            "text": "Given how prohibitively expensive tuition has become isn't it good that people that can afford it are given preference? #plutocratsareus",
            "title_similarity": "0.47047088",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hjjc69s",
            "score": 0,
            "text": "Is \"admits\" what the rest of the English speaking World would call admissions?",
            "title_similarity": "0.41665617",
            "sentiment_compound": 0.296
        },
        {
            "id": "hjjcix4",
            "score": 0,
            "text": "I didnt need a case study to know that white ppl get preferential treatment when getting accepted into college not based on merit. Also, white ppl get preferential treatment in the judicial system, politics, education, the job force, military, etc",
            "title_similarity": "0.5263257",
            "sentiment_compound": -0.0598
        },
        {
            "id": "hjjcvct",
            "score": 0,
            "text": "So, if you're non-white, you will be heavily scrutinized on your academic merit to attend, but if you're white, it's literally a price tag. Why do we still hold these ancient colleges in high regard?",
            "title_similarity": "0.5907123",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hjjh85z",
            "score": 0,
            "text": "People should dismiss the college qualification based on this, when it clearly isn’t getting the best and brightest in the door. I would as an employer , first question I’d ask too, “are ya really bright or did you get some pull” Then I’d spend the interview second guessing them. Time people started coming into the 21st century, reputation and prestige are bs.",
            "title_similarity": "0.56354296",
            "sentiment_compound": 0.9336
        },
        {
            "id": "hjjxlao",
            "score": 0,
            "text": "I know a lot of Harvard students (my college band was half Harvard kids), and there are a lot of really bright amazing people there… but almost none of them are the white kids. There are so many dumb stupid entitled white kids there it’s crazy… people who would be in the bottom half of their class in their local community college. Every person of color I’ve met at Harvard though, without exception, is an exceptional human being. It is not a fair admissions standard at all",
            "title_similarity": "0.794756",
            "sentiment_compound": -0.7918
        },
        {
            "id": "hjk8vtj",
            "score": 0,
            "text": "This whole thread reads like some bizarro world alternate reality. At Harvard white students only comprise 18% of the student population while making up 56% of the US population (and an even larger proportion of National Merit Finalists). Statistically white people are the most underrepresented racial group at elite universities in the US.",
            "title_similarity": "0.8431513",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hjk94ee",
            "score": 0,
            "text": "What is the breakdown of Christian vs Jewish?",
            "title_similarity": "0.38876972",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjkb025",
            "score": 0,
            "text": "Call it what it is - White Affirmative Action. Harvard University is a joke, I can't believe people think their students are the best and brightest",
            "title_similarity": "0.6704971",
            "sentiment_compound": 0.886
        },
        {
            "id": "hjkbuxf",
            "score": 0,
            "text": "Further proves how minorities are catered to in top tier colleges. It’s more of an insult to their intelligence, as the colleges lower their standards exclusively towards minorities.",
            "title_similarity": "0.63626194",
            "sentiment_compound": -0.2177
        },
        {
            "id": "hjkkq9y",
            "score": 0,
            "text": "This is why the right is always trying to pit asians against other minorities - claiming that affirmative action is stealing spots from asians. This just proves privileged white are more of a culprit.",
            "title_similarity": "0.52295667",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hjkwtad",
            "score": 0,
            "text": "At this point, does going to Harvard even mean anything significant?",
            "title_similarity": "0.48055717",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hjhvku5",
            "score": 73,
            "text": "The paper comes to the completely wrong conclusion that reducing the ALDC for whites would lower the white population. \n\nWith quotas in place, yes controversial point I know, the bar is much lower for URMs, so it’s not like the quotas would change. You would just see more non-ALDC whites. I would imagine faculty kids and athletes are the two groups that most “unfairly “ get in despite potentially lower academic performance. Though for athletes that is an excellence that is valued just like say math Olympiad or 1st chair cello. \n\nI doubt 75% of legacy kids would be rejected without the status.\n\nRace plays a much greater role in these admissions.\n\n“if an Asian-American applicant with certain characteristics (like scores, GPAs, and extracurricular activities, family background) would result in a 25% statistical likelihood of admission, the same applicant, if white, will have a 36% likelihood of admission. A Hispanic and black applicant with the same characteristics will have a 77% and 95% predicted chance of admission, respectively”\n\nAlso check out table 5 in the study, page 27 http://public.econ.duke.edu/~psarcidi/legacyathlete.pdf#page27\n\nYou can see taking out legacy or athletic preference doesn’t change the results much. Race blind admission changes it a lot.",
            "title_similarity": "0.7248677",
            "sentiment_compound": 0.5749
        },
        {
            "id": "hjhsl03",
            "score": 525,
            "text": "This should be no surprise.   \n\n\nAlso a good chunk of the people classified by whites (ballpark 40% in the Ivy league) would've faced discrimination in the past for having Jewish heritage. A good chunk are also half Asian but don't check \"Asian\" to avoid discrimination.   \n\n\nThe corruption and unfairness of the system across time is abhorrent.   \n\n\nHARVARD RECEIVES PUBLIC FUNDS.",
            "title_similarity": "0.7447071",
            "sentiment_compound": -0.788
        },
        {
            "id": "hjh0flk",
            "score": 775,
            "text": "[removed]",
            "title_similarity": "-0.0012462288"
        },
        {
            "id": "hjhxtxf",
            "score": 16,
            "text": "[deleted]",
            "title_similarity": "0.04125209"
        },
        {
            "id": "hjh8x1y",
            "score": 369,
            "text": "You can’t get in to the Ivies with good grades or test scores. At that level, everyone has good grades and test scores.  3/4s will probably be valedictorians and you could fill them all with valedictorians and still turn away others. They all have community service, APs, polished essays. So what’s left? All-state athletes, music, national prize winners for certain subjects. And legacies, because who doesn’t need more money.  I’m not sure how you’d just get in though, unless you had 20million to drop on the school. 1 million just isn’t going to do it. And at that level, do you need school for junior?\n\nThe thing is they have rules against participating in the admissions process if your kid is applying. I’m not saying it doesn’t happen, but it’s not easy for a rank and file alum.",
            "title_similarity": "0.6907418",
            "sentiment_compound": 0.4348
        },
        {
            "id": "hjjhrc8",
            "score": 5,
            "text": "So if a full third of people graduating from Ivy league colleges don't meet the standards to even be there, it seems to me that the degrees shouldn't be viewed as valuable or worth anywhere near what they charge.\n\nEducation in the US is becoming a farce, and that's why the country is falling apart.",
            "title_similarity": "0.720739",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hjie2ox",
            "score": 39,
            "text": "Harvard's white undergraduate [population](https://blog.collegevine.com/harvard-university-diversity-statistics/) is 37%.\n\n43% of white admits are ALDC:\n\n0.43 x 37% = 16% of total undergrad population is white ALDC.\n\n75% of white ALDC admits would be rejected:\n\n0.75 x 16% = 12% of total undergrad population would be rejected.\n\nSo, roughly 12% of the undergrad population of Harvard shouldn't be there.\n\nEDIT: assuming admits refers to undergrad only. Also, this excludes ALDC admits of other racial backgrounds.",
            "title_similarity": "0.87829685",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hjh2p6n",
            "score": -7,
            "text": "Rules for thee and not for me.",
            "title_similarity": "0.08340467",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjhopxi",
            "score": -1,
            "text": "Good to see nepotism is alive and well",
            "title_similarity": "0.06573045",
            "sentiment_compound": 0.765
        },
        {
            "id": "hjhrh2l",
            "score": -1,
            "text": "Yes. The oligarchy. We’ve all seen it.",
            "title_similarity": "0.16725978",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hjhxqk6",
            "score": -1,
            "text": "This isn't particularly respectable. On the other hand it's not like you have to go to Harvard to do well in life. You're in just as good a position if you go to any one of the top schools. \n\nI don't say this for any other particular reason than to give younger people some perspective. You don't need to dream about going to a place where you're very unlikely to be accepted without a connection or attending the right feeder school. Anyone talented enough to think about attending a top name school but who does not have connections should think only about applying to places without legacy admission practices. Many of the top schools specifically state they give no preference to legacy candidates. \n\nPlease do not even apply to Harvard, all you do is become another statistic that bolsters their prestige by pumping up their rejection numbers.",
            "title_similarity": "0.61511356",
            "sentiment_compound": 0.2414
        },
        {
            "id": "hjhxvv6",
            "score": -1,
            "text": "\"You got your law degree at Costco?!\"\n\n\"Yeah, I couldn't believe it either. Luckily, my dad was Alumni.\"",
            "title_similarity": "0.499017",
            "sentiment_compound": 0.6996
        },
        {
            "id": "hjhy7oy",
            "score": -1,
            "text": "Put four generations through and get the fifth free. Loyalty programs work for universities too!",
            "title_similarity": "0.41578263",
            "sentiment_compound": 0.7959
        },
        {
            "id": "hji1nsv",
            "score": -1,
            "text": "I would think nearly every single A in the ALDC at nearly every D1 and ivy league school wouldn't be admitted without being ALDC.  Otherwise, there'd be almost no point in reaching that level of athlete...",
            "title_similarity": "0.7246498",
            "sentiment_compound": -0.1035
        },
        {
            "id": "hji26fr",
            "score": -1,
            "text": "But remember, it's affirmative action that's the real problem.",
            "title_similarity": "0.24741971",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hji3j25",
            "score": -1,
            "text": "It was never a meritocracy. They have and never will be impartial for anyone.",
            "title_similarity": "0.1820041",
            "sentiment_compound": -0.1139
        },
        {
            "id": "hjicuda",
            "score": 1,
            "text": "And then they get mad at people of color citing affirmative action, when in reality, the rich kids are the truly undeserving admissions. Laughable.",
            "title_similarity": "0.52820945",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hjidap6",
            "score": 1,
            "text": "ALDC is a form of diversity in ways universities find valuable so I don't see this as a bad thing.",
            "title_similarity": "0.28640383",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hjidlda",
            "score": -1,
            "text": "It's a big club and you ain't in it.",
            "title_similarity": "0.25664705",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjieb08",
            "score": -1,
            "text": "How do you think George Bush, Jr. got in?",
            "title_similarity": "0.34962654",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjiesxk",
            "score": -1,
            "text": "So about a third of the student body is ALDC.  For a private school this doesn’t seem so bad.  But maybe we need to keep the outrage machine running….",
            "title_similarity": "0.69290805",
            "sentiment_compound": -0.8018
        },
        {
            "id": "hjifgqa",
            "score": 1,
            "text": "But affirmative action is *wrong*. This is affirmative action with more expensive steps. Merit based myth is a lie.",
            "title_similarity": "0.3882695",
            "sentiment_compound": -0.0141
        },
        {
            "id": "hjigmqs",
            "score": 1,
            "text": "Pretty useless numbers without totals.",
            "title_similarity": "0.22336942",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hjii9or",
            "score": 1,
            "text": "I know the list is super biased to favour Caucasian, but what is the fraction of not white in the same privileged boat. I'd like to know, to properly quantify just how effing biased the system is.",
            "title_similarity": "0.5433254",
            "sentiment_compound": 0.7821
        },
        {
            "id": "hjiiafv",
            "score": 1,
            "text": "How is this related to science? Are we looking at science of polling ?",
            "title_similarity": "0.2889157",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjiiauz",
            "score": -1,
            "text": "I assume all the people that spam the affirmative action threads with pleas of meritocracy are also going to spam this one as well? Where are all those comments?",
            "title_similarity": "0.44702965",
            "sentiment_compound": -0.3939
        },
        {
            "id": "hjijn7a",
            "score": 1,
            "text": "White kiss living below the poverty line are still not getting in",
            "title_similarity": "0.44118857",
            "sentiment_compound": -0.128
        },
        {
            "id": "hjil3ey",
            "score": 1,
            "text": "For some applications too, some of the requirements/prerequisites (let’s say for grad school, for example) are so heavily biased towards people who can afford to meet those requirements and not work/make a living while attending school. One of the many reasons why it’s harder for lesser fortunate people to meet some standards for acceptance. So yeah, not surprised admission anywhere is biased.",
            "title_similarity": "0.6256341",
            "sentiment_compound": 0.5201
        },
        {
            "id": "hjilam3",
            "score": 1,
            "text": "IT's a pay wall for me, it's 43% for white students, do we know what the rate is for non-white?",
            "title_similarity": "0.79433835",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hjim83y",
            "score": 1,
            "text": "Lovely little study. Love it when it sanctimonious liberals get exposed. They get away with a lot of hypocrisy purely because the right-wing is batshit crazy in this country.",
            "title_similarity": "0.36843526",
            "sentiment_compound": 0.7203
        },
        {
            "id": "hjin8r8",
            "score": 1,
            "text": "Question: What percentage of that \"white\" is actually Jewish?",
            "title_similarity": "0.4838796",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjipdz9",
            "score": 1,
            "text": "Is there a similar statistic for people of color? I would be curious if would a higher or lower percentage of people who knew people.",
            "title_similarity": "0.47267604",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hjishow",
            "score": 1,
            "text": "I haven't read the full paper. But, if I am reading table 3 correctly, then the effects of being African American or Hispanic are still positive on the admissions rate in all the models that they constructed. So, if we just go by this paper, its not that being African American or Hispanic Hurts your chances of getting into Harvard all other things remaining equal, it actually helps it. But the Athletics Legacy Deans list and Children of faculty and staff admissions still benefit white students at the expense of other groups.",
            "title_similarity": "0.6733203",
            "sentiment_compound": 0.8847
        },
        {
            "id": "hjiu730",
            "score": 1,
            "text": "None of that should count but there also shouldn’t be affirmative action. \n\nInstead, everyone should get in on their merits alone. There should be no name or gender listed. \n\nIt should be based solely on grades and community activism, that’s it.",
            "title_similarity": "0.32421356",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hjivy1l",
            "score": -1,
            "text": "And we will never see the people against affirmative action complain about this.",
            "title_similarity": "0.23539263",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hjiwfx5",
            "score": -1,
            "text": "So ~a third of people at Harvard don't deserve to be there?",
            "title_similarity": "0.8023165",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjiznhj",
            "score": -1,
            "text": "So Harvard is just a bunch of hot air and crap? I'm not surprised, never heard something positive about Harvard graduates in my life, this explains why.",
            "title_similarity": "0.5203186",
            "sentiment_compound": -0.7343
        },
        {
            "id": "hjiznii",
            "score": -1,
            "text": "So all that white privilege people didn't think exists ... actually exists at Harvard?\n\nNo wonder the \"poorly educated\" couldn't find evidence of it. 😎",
            "title_similarity": "0.6738689",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hjj0gec",
            "score": 1,
            "text": "but Harvard also lowers the test scores and grades needed for blacks and hispanics to get in. So really the only ones being discriminated against here are the Asians. what percent of blacks and hispanics would get accepted if they had to meet the same academic standards that asians do?",
            "title_similarity": "0.73013216",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hjj4l8h",
            "score": 1,
            "text": "Cue the bourgeois furor in the comments. All the ~110 IQ middle class school children think they’ve exposed the great conspiracy undermining capitalism. Pity, most of them will never understand the publications they so blockishly memorize the titles of.",
            "title_similarity": "0.611068",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hjj4opy",
            "score": 1,
            "text": "Obviously. It's pretty hard for whites and Asians to get in otherwise.",
            "title_similarity": "0.48153502",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hjjanxs",
            "score": -1,
            "text": "I mean, blacks/hispanics get chosen for scholarships all the time over white applicants, just because theyre skin is colored black instead of white. I think everybody knows now that campus is a breeding ground for racism. I saw it firsthand and dropped out because pretty much everything at college felt gross to me… the racism, the pro-censorship and anti free speech rhetoric, the pro-authoritarianism… being a college drop out is a great source of pride for me. I’d be absolutely devastated if my name was tied to the university that I attended.",
            "title_similarity": "0.6413858",
            "sentiment_compound": -0.7902
        },
        {
            "id": "hjk4tcu",
            "score": -1,
            "text": "Can we check percentages of other groups who would not have been admitted without affirmative action?",
            "title_similarity": "0.5676323",
            "sentiment_compound": -0.0762
        },
        {
            "id": "hjk5ii3",
            "score": 1,
            "text": "Ah, so Harvard is like all other private schools.\n\nHelping keep the rich families rich and the poor families poor. America the great.",
            "title_similarity": "0.5347044",
            "sentiment_compound": 0.8768
        },
        {
            "id": "hji8ik3",
            "score": 52,
            "text": "It should be illegal to ask a person their race on a college application",
            "title_similarity": "0.4140271",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hjj99k2",
            "score": 34,
            "text": "When I learned at the age of 10, that George W Bush was accepted to both Yale and Harvard, their admission processes lost all credibility in my eyes. Again and again the USA confirms, that over there anything is for sale",
            "title_similarity": "0.6488256",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hjiasip",
            "score": 224,
            "text": "Operation Varsity Blues is an *excellent* documentary on Netflix based on exactly this. Bribes from the top 1% to get their kids in top tier shools by pretending to be athletes or musicians etc",
            "title_similarity": "0.6393521",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hjhh9gj",
            "score": -2,
            "text": "This is disgusting. What a sham.",
            "title_similarity": "0.071849525",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hji5hta",
            "score": -2,
            "text": "All you have to do to get accepted to Harvard is to become famous for your far left opinions that you believe just because you were told to and scream them louder than the person next to you. Or be seriously connected.",
            "title_similarity": "0.57817674",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hji6vb4",
            "score": 2,
            "text": "They should regulate against legacy admissions before enacting race-based affirmative action laws.",
            "title_similarity": "0.3852991",
            "sentiment_compound": 0.0
        },
        {
            "id": "hji9ty4",
            "score": 2,
            "text": "And people will still say there exists a thing called white privilege.",
            "title_similarity": "0.31250513",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hjid02c",
            "score": -2,
            "text": "No doubts about this being true",
            "title_similarity": "0.005882419",
            "sentiment_compound": 0.5702
        },
        {
            "id": "hjidj1p",
            "score": 2,
            "text": "But it's terribly unfair to give Hispanic and African-American kids preferences in admissions.",
            "title_similarity": "0.45887992",
            "sentiment_compound": -0.8765
        },
        {
            "id": "hjiedsy",
            "score": -2,
            "text": "This begs the question: why would the other 57% still want to go Harvard? Why waste hundreds of thousands of dollars to go to school where nearly half of the student body has no merit? You only defeat cronyism when you stop playing their game. Stop idolizing Ivy League schools, and stop trying to get into them.",
            "title_similarity": "0.78502905",
            "sentiment_compound": -0.8999
        },
        {
            "id": "hjiop0s",
            "score": 2,
            "text": "nice kinda like how if it weren't for white people in the past, no one would have contemporary universities to go to in the first place.",
            "title_similarity": "0.63028026",
            "sentiment_compound": 0.4228
        },
        {
            "id": "hjip9ix",
            "score": 2,
            "text": "In South Africa there is a government practise called BEE(black economic empowerment) which states that the universities need to meet a quotation of black students. White students are rejected based entirely on race over their matriculation results, it stems down to levels where black students gain more entry admission than any other, followed by coloured and Indian students and then white students. While this seems like a good idea in practise is has resulted in a lot of students being admitted into university only to fail miserably because they do not actually have the academic knowledge required to keep up with the high level of university. While many other students who have the knowledge are rejected based on their race. I understand there is a need to uplift the underprivileged but some of these students, white, coloured, Indian are rejected because they are not black, and thus have to work harder to even have a chance. It has created a generation of young black individuals that believe everything is handed to them and they do not need to work to gain recognition in society. Which in the long term has detrimented the society as a whole. I have nothing wrong with empowering the underprivileged and wronged generations of the past but this approach has had a long term negative effect on the society as a whole. Just my 2 cents.",
            "title_similarity": "0.7547139",
            "sentiment_compound": -0.6019
        },
        {
            "id": "hjirk3i",
            "score": 2,
            "text": "Sounds a bit like absent these programs, you could easily make the case that Harvard was discriminating against white student applicants.",
            "title_similarity": "0.6599351",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hjisx1l",
            "score": 2,
            "text": "In case it's of interest, I'm a white male legacy (my dad went to Harvard) and my GPA and SAT score were both solidly above above the average that Harvard admitted from my high school. I still got waitlisted then rejected. So yeah being legacy or any of those other things definitely helps relative to having no connection to the school, but it's not like they just let in anyone whose relatives went there or whatever. Anyone who gets into Harvard is exceptional in some way.",
            "title_similarity": "0.7335969",
            "sentiment_compound": 0.0946
        },
        {
            "id": "hjiv3b9",
            "score": -2,
            "text": "For this study, does \"white\" include or exclude jewish people?",
            "title_similarity": "0.51700115",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hjizgim",
            "score": 2,
            "text": "And 70%+ of USA s population is white?",
            "title_similarity": "0.6206547",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjjes6",
            "score": 2,
            "text": "Something like this would be useful alongside research showing how many would be rejected without affirmative action and diversity quotas.",
            "title_similarity": "0.55976456",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hjjpr3p",
            "score": 2,
            "text": "How is this even remotely related to anything scientific?!\n\nAt best it seems to have race-baiting undertones.",
            "title_similarity": "0.3327239",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hjjrk7x",
            "score": 2,
            "text": "Love that we’re picking on the white kids. Can we just stop this (for all races) please?",
            "title_similarity": "0.42084444",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hjjw20n",
            "score": 2,
            "text": "and?, they are a private organization, can't they do as they like?",
            "title_similarity": "0.17554632",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hjk6e1h",
            "score": 2,
            "text": "Why bring race into this? If it where the other way around people would be screaming…",
            "title_similarity": "0.35361707",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjh58g7",
            "score": 55,
            "text": "[removed]",
            "title_similarity": "-0.0012462288"
        },
        {
            "id": "hjigdnm",
            "score": 48,
            "text": "There are several points of nuance missed in the above summary, and as is standard in this subreddit people are largely using it as an exercise in confirmation bias without seriously engaging with the information in the article. \n\nAlmost every athlete who gets into Harvard would not get in on their non-athletic merits, and almost every recruited athlete gets in.  There are obvious financial reasons for this that should be clear to anyone with a minimum level of familiarity on how postsecondary institutions operate and raise funds. \n\nIgnoring athletes, non-athlete legacy and dean’s list applicants are higher quality than the typical applicant.  The above article estimates they would get in around 14% of the time based on their intrinsic merits, in actuality they get in around 33% of the time (which, to be clear, is a large gain).  \n\nThe estimated impact of legacy status is large but only about half the size of being African-American and roughly the same as being Hispanic (relative to being white).  As is well-known, Asian applicants face a penalty relative to all other racial groups. See page 26 here: http://public.econ.duke.edu/~psarcidi/legacyathlete.pdf\n\nFinally, the statement \n\n> Roughly three-quarters of white ALDC admits would have been rejected absent their ALDC status.\n\nis somewhat misleading.  If one looked at every **admitted** student and applied the same methodology as is used in the above quote, one would conclude that many of the actual admits would be rejected (as each has a nonzero probability of rejection based on observables).",
            "title_similarity": "0.73328114",
            "sentiment_compound": -0.9345
        },
        {
            "id": "hjh2rst",
            "score": 256,
            "text": "The abstract doesn't say exactly what legacies means.  I assume it means admission based on parents/ancestors attending.  I thought most schools got rid of that for exactly this reason.",
            "title_similarity": "0.6115238",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjhuwsn",
            "score": -4,
            "text": "This is why I hate Harvard and other Ivy League/historically prestigious insitutions",
            "title_similarity": "0.49579594",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hji2v9l",
            "score": -3,
            "text": "So why white people complaining about affirmative action ruining meritocracies  is full of shite.",
            "title_similarity": "0.5251665",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hjik835",
            "score": 2,
            "text": "It’s great that this research proves what we knew already. If the majority in an university isn’t Asian, the game is rigged. There is a high school for the gifted in Sydney. Drive by in the morning when the kids are going to school and out of 10 kids, 1 is white, 5 five are Asian looking and the other 4 look like they are from India. That’s is an institution I trust, because it’s obvious that acceptance is based on merit. I dig that.",
            "title_similarity": "0.6195303",
            "sentiment_compound": 0.9217
        },
        {
            "id": "hjiym3l",
            "score": 3,
            "text": "Ok, but this isn't black versus white, it is rich versus poor.",
            "title_similarity": "0.2747958",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hjj0lb2",
            "score": 3,
            "text": "This paper is part of an argument to remove affirmative action. The author was a plaintiff expert in the recent Harvard case. The argument is—\n\n1. Classifications explicitly based race are “odious” so the schools must show they are necessary to some educational goal, typically diversity/multiple perspectives, as well as engagement and “safe environment” for students of all ethnicities.\n\n2.  Studies like these suggest other aspects of recruitment are driving racially biased outcomes (e.g., legacies).\n\n3. Therefore racial classifications like affirmative action are not necessary to increase enrollment and must go.\n\nThey — the group that funds these cases — tried \nthe same thing with the Texas Ten Percent plan in the UT system a few years ago. If that racially-neutral policy increased enrollment, why keep AA? Schools typically respond that looking at one factor in isolation distorts a complex multi-stage holistic admissions process reviewing tens of thousands of applicants over many months (knowing that all their emails/spreadsheets/rubrics will come out in court). \n\nSo for legacy they’d say it correlates to matriculation or admitted/enroll rates which are prevalent in rankings. Or faculty admits ensure we get dank professors. And hey they correlates to money and we’re a businesses. And school X tried policy Y and they think that’s relevant here for Z reason, and they’ve allowed SAT alternatives which should boost enrollment, and they’ve increased funding for outreach to specific schools, and they’re seeing decreased racial incidences on campus, and they’ve got several different intel’s projections at five and ten years based on historical data in consultation with such and such external auditor, and so on. It’s a sophisticated and actually pretty dense area of the law. \n\nThe problem is that the concept of whether AA “works” is diffuse, but it has been around so long people fear if it goes away things could get drastically worse (umbrella when it’s raining). The Enlightenment says you do not accept a proposition without evidence, but what do you do when the only really useful test would be longitudinal over lifetime for populations of millions (literally impossible), and the cost in social or political terms would be generations of minorities excluded from a common path to upward mobility and power. Studies like this solve the endemic design problem by looking at what data they can get to meet the demands of publish or perish. So that is immediate data sets they can get from the school by litigation, involving admission percentages, GPA, SAT, etc. Nothing wrong with that but it is limited and therefore only indirectly relevant to the ultimate question.  \n\nNone of this says anything about the linked study. I’m sure there was five days of trial going back and forth with experts who prepared for hundreds of hours, and I have not read the study design, or frankly even opened it. Rather, this explains how such studies find funding and dissemination, and suggests motive to omit important context. Be humble and skeptical, especially of things that appeal to your political instincts, because if you’re wrong you could be hurting a lot of people.",
            "title_similarity": "0.6110115",
            "sentiment_compound": -0.9058
        },
        {
            "id": "hjhf4vu",
            "score": -4,
            "text": "Sheesh, lots of people are gonna be mad at this one",
            "title_similarity": "0.27659428",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hjhkwpj",
            "score": -5,
            "text": "And they get hired at the Republican white house or win in florida elections after graduation.",
            "title_similarity": "0.449731",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hji8xjm",
            "score": -4,
            "text": "And yet people go after Affirmative Action when it comes to admission advantages.",
            "title_similarity": "0.3861097",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hjjfc89",
            "score": 4,
            "text": "Out of context.  For the 2025 class, Harvard admitted 2320 students, and of that, 55.9% are non-white. \n\nOf the 2025 admissions  \n \n* 55.9% are non-white  \n \n* 2320 total students were admitted  \n\n* 1297 non-white students were admitted  \n\n* 1023 white students were admitted  \n* 430 are white and at least 1 of {athletes, legacies,dean's interest list, faculty children}.  This amounts to 18.5% of the class.  \n\n\nHarvard does not provide a breakdown of the non-white students who are faculty children, athletes, dean's interest, legacies. \n\nRefer to https://college.harvard.edu/admissions/admissions-statistics",
            "title_similarity": "0.8438227",
            "sentiment_compound": 0.8344
        },
        {
            "id": "hjhrseg",
            "score": 773,
            "text": "My 12th great grandfather was in the first graduating Harvard class.  I was  still rejected.",
            "title_similarity": "0.6405789",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hjhv5z1",
            "score": -4,
            "text": "Sounds about white for America",
            "title_similarity": "0.30217114",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjig51k",
            "score": 6,
            "text": "So how many of the remaining students were accepted because their parents bought their way in?",
            "title_similarity": "0.59543234",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hjj9bcp",
            "score": 6,
            "text": "When science answers what we already know.\n\nIt's about who you know, not what you know.",
            "title_similarity": "0.25755417",
            "sentiment_compound": 0.0
        },
        {
            "id": "hji8jqf",
            "score": 58,
            "text": "This is not unique to harvard",
            "title_similarity": "0.19267276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjth9k",
            "score": 6,
            "text": "They use these terms like \"legacies\" but we already have a word for this, it's nepotism. In almost every scenario nepotism is wrong. Fuckin rich people keep fuckin everything up for the rest of us.",
            "title_similarity": "0.4678697",
            "sentiment_compound": 0.4478
        },
        {
            "id": "hji1xjc",
            "score": 8,
            "text": "That's fucked up. Meritocracy my ass.",
            "title_similarity": "0.19364779",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hjimpmm",
            "score": 8,
            "text": "Every other post on this subreddit is explicitly hostile towards White people. A purely meritocratic admissions system would produce a higher percentage of whites relative to total admitted, not a lower percentage.",
            "title_similarity": "0.62871575",
            "sentiment_compound": -0.0049
        },
        {
            "id": "hjhick0",
            "score": 2360,
            "text": "I put in a Ph.D. application for Harvard just yesterday and I was really surprised during the application process that there was a whole page dedicated to \"are you related to someone famous/rich/relevant to the university?\" No other application I've filled of the like 10-15 I've worked on had anything like that.\n\nTo be fair though...Harvard was the only university to waive my application fee because of ethnic cultural background (I had previously attended an ethnic diversity conference event for my major and that let me waive the fee). Which was nice since Ph.D. applications are like $100 a piece.",
            "title_similarity": "0.6978641",
            "sentiment_compound": 0.9273
        },
        {
            "id": "hjjf051",
            "score": 12,
            "text": "And they all get As and Bs because grade inflation is rampant there.\n\nNow we know how politicians who attended Ivy league schools can be so stupid.",
            "title_similarity": "0.59214103",
            "sentiment_compound": -0.656
        },
        {
            "id": "hjh7gxb",
            "score": 811,
            "text": "And they openly talk about it",
            "title_similarity": "0.026872428",
            "sentiment_compound": 0.0
        },
        {
            "id": "hji7ots",
            "score": 322,
            "text": "[removed]",
            "title_similarity": "-0.0012462288"
        },
        {
            "id": "hjh0oi4",
            "score": 77,
            "text": "[removed]",
            "title_similarity": "-0.0012462288"
        },
        {
            "id": "hjgy7r9",
            "score": 32,
            "text": "[removed]",
            "title_similarity": "-0.0012462288"
        },
        {
            "id": "hjinlu8",
            "score": 1456,
            "text": "“ If Harvard admitted students based on their academic qualifications alone, Harvard would be 43 percent Asian, 38.4 percent white, 0.7 percent black, and 2.4 percent Hispanic, according to a 2013 study by Harvard’s Office of Institutional Research.” https://newcriterion.com/issues/2019/11/harvard-admits-its-preferences",
            "title_similarity": "0.80881107",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hji043p",
            "score": 3848,
            "text": "“Children of faculty or staff”\n\n\nThere was a janitor at my university that was specifically working there so he could provide his kids with a college education that they would not normally been able to afford.",
            "title_similarity": "0.604809",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjh7t9a",
            "score": 1754,
            "text": "[removed]",
            "title_similarity": "-0.0012462288"
        },
        {
            "id": "hjh2ilx",
            "score": 9621,
            "text": "If anyone is a little unsure like I was, \"legacies\" refers to students whose parents attended Harvard, and the Dean's interest list is an opaque list of whoever the Dean wants to be on there.",
            "title_similarity": "0.7316648",
            "sentiment_compound": 0.5446
        },
        {
            "id": "hjhmt3i",
            "score": 482,
            "text": "[removed]",
            "title_similarity": "-0.0012462288"
        },
        {
            "id": "hjh0dsm",
            "score": 67,
            "text": "[removed]",
            "title_similarity": "-0.0012462288"
        },
        {
            "id": "hjht4jv",
            "score": 1,
            "text": "Who's Dean? (serious question)",
            "title_similarity": "0.22785075",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hjhvax6",
            "score": 1,
            "text": "Really it all comes down to “donations” to the school. What is the percentage of affirmative action admits would have been rejected",
            "title_similarity": "0.6427443",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hjhvkz4",
            "score": 2,
            "text": "Is this figure not though amplified by something, such as quotas or falling male intakes affecting that rates of especially white males going into college, which has been decreasingly a lot lately?\n\nHave levels of white students declined in general, is what I am wondering here, thereby leaving behind an increasing fraction being ALDC?",
            "title_similarity": "0.7443731",
            "sentiment_compound": -0.2406
        },
        {
            "id": "hjhzsv7",
            "score": 1,
            "text": "Then remove the list. So more people can get in that actually qualify maybe that is the issue with our current leadership.",
            "title_similarity": "0.4175868",
            "sentiment_compound": 0.0
        },
        {
            "id": "hji2b0g",
            "score": 1,
            "text": "I work at a college bar in Harvard...this makes all too much sense..not everyone who goes to Harvard was admitted because of their intelligence.",
            "title_similarity": "0.64780676",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hji2ur2",
            "score": 1,
            "text": "What possible non-corrupt reason could there be for \"Legacy\" to be an acceptable method to get into a college. \n\nEverything else I can see a justification for, albeit some flimsy, but legacy is just the most ridiculous",
            "title_similarity": "0.52480793",
            "sentiment_compound": -0.4659
        },
        {
            "id": "hji2vkp",
            "score": 3,
            "text": "Look I took a large paycut to teach at a University. The least my little private college do is let my one kid into college. The other stuff I can get. Yes, I know the faculty at Harvard probably make twice or three times what I do.",
            "title_similarity": "0.7126609",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hji3zke",
            "score": 3,
            "text": "And?  \n\nSurely no one is naive enough to think universities don’t need to keep donors and multi-generational alumni rich folk coming back for more?",
            "title_similarity": "0.40994653",
            "sentiment_compound": 0.5514
        },
        {
            "id": "hji54bh",
            "score": 1,
            "text": "If i wasn't qualified and got in, that's even worse bc now you have to *graduate* from harvard",
            "title_similarity": "0.67371595",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hji5j95",
            "score": 1,
            "text": "Can’t wait for all the over qualified Asian kids that didn’t get in to find out it’s even worse than they thought.",
            "title_similarity": "0.588463",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hji6why",
            "score": 1,
            "text": "This goes on at all schools. Shouldn't be a surprise to anyone.",
            "title_similarity": "0.22912996",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hji73pr",
            "score": 1,
            "text": "That's why I never got the prestige of \"Harvard\" when it's well known you have to have connections to the \"good ol' boys club\" to get in.   Have much more respect for non-Ivy League grads who get in without benefit of history and personal preferences.",
            "title_similarity": "0.5870451",
            "sentiment_compound": 0.7107
        },
        {
            "id": "hji79hh",
            "score": 3,
            "text": "Sucks for poor white people I guess",
            "title_similarity": "0.3862874",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hji7vr6",
            "score": 1,
            "text": "Don't forget the Kushner plan",
            "title_similarity": "0.095549226",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hjia48o",
            "score": 1,
            "text": "Seems like that would devalue Harvard and would be something they wanted to avoid.",
            "title_similarity": "0.33898437",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hjices4",
            "score": 1,
            "text": "So about a third of white people at Harvard are there due to reverse affirmative action. Cool. Cool cool cool.",
            "title_similarity": "0.83065426",
            "sentiment_compound": 0.802
        },
        {
            "id": "hjidppv",
            "score": 1,
            "text": "So people without criteria would get rejected without criteria….",
            "title_similarity": "0.3715462",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hjih2ho",
            "score": 1,
            "text": "Confused about “dean’s interest list.” Can anyone clarify?",
            "title_similarity": "0.32782465",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hjihtg8",
            "score": 1,
            "text": "Legacies is a pretty common term for kids of alumni. I’m surprised the top comment is about someone not knowing what it means.",
            "title_similarity": "0.53657705",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hjii8rb",
            "score": 1,
            "text": "Even indian students who get into harvard these days are from rich families.",
            "title_similarity": "0.615755",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hjiia4g",
            "score": 1,
            "text": "Lots of very smart people go to elite schools but I also think a lot of average people that are well off end up in them too. \n\nI went to a state school but most people at my first job were from Ivy League (or other elite colleges). Harvard, Brown, Georgetown, UVA Currency School.. almost all of them also went to feeder high schools that are incredibly expensive where you’re expected to go on to an elite college. It wasn’t something I would have even ever considered for myself given the admission rate, and also price. Around 7 years later I’ve done better than some worse than others, but never felt like anyone was intellectually superior to anyone else to such a degree that you could say they got a better education.",
            "title_similarity": "0.7499001",
            "sentiment_compound": 0.9243
        },
        {
            "id": "hjiiruc",
            "score": 1,
            "text": "What prestigious private university isn't like this? it's one of the main reasons both them and not thems attend those schools.",
            "title_similarity": "0.56921166",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hjiiunm",
            "score": 1,
            "text": "When applying to med school, almost every interview asked me if I had any doctors in the family. Im not sure why that would matter",
            "title_similarity": "0.5853419",
            "sentiment_compound": -0.2173
        },
        {
            "id": "hjijjmd",
            "score": 1,
            "text": "One of the only kids from my high school who went to Harvard got in because he did crew. It was frankly ridiculous that our school even fielded a crew team - the nearest lake was like an hour away. The kid definitely wasn’t one of our top students, even though he made decent grades.",
            "title_similarity": "0.7239045",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hjijr6h",
            "score": 1,
            "text": "I’d like to see how these stats compare at state schools. Probably not as dramatic results but they are state schools, not private, so more meaningful.",
            "title_similarity": "0.44622618",
            "sentiment_compound": 0.6764
        },
        {
            "id": "hjijv3k",
            "score": 2,
            "text": "That's some weird science",
            "title_similarity": "0.13945296",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hjijxxx",
            "score": 1,
            "text": "No one cares where you got your piece of paper. Don’t waste your money",
            "title_similarity": "0.08201091",
            "sentiment_compound": -0.7565
        },
        {
            "id": "hjika8k",
            "score": 1,
            "text": "Remember that scandal with the Full House actress who bribed college officials or something to get her kids in? I still don't understand the outrage over that. If that's wrong, then get rid of all this donation/legacy crap.",
            "title_similarity": "0.54822797",
            "sentiment_compound": -0.7094
        },
        {
            "id": "hjikblb",
            "score": 2,
            "text": "What's with the white before ALDC?",
            "title_similarity": "0.34187984",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjikn0y",
            "score": 1,
            "text": "Jokes on Harvard I'm not giving them a dime in donations.\n\nThanks for the degree and my dads degree though I guess.",
            "title_similarity": "0.55033934",
            "sentiment_compound": 0.4337
        },
        {
            "id": "hjikqov",
            "score": 1,
            "text": "I mean I was born in the 80’s and my parent told me this like it was common knowledge.",
            "title_similarity": "0.31236762",
            "sentiment_compound": 0.4357
        },
        {
            "id": "hjikv7h",
            "score": 1,
            "text": "Now tell me what percentage of all wealthy admissions are ALDC admissions. I bet it correlates even more with generational wealth/poverty.",
            "title_similarity": "0.51248384",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hjikz1o",
            "score": 1,
            "text": "I don’t think a single paragraph is enough evidence here",
            "title_similarity": "0.3116362",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjilnng",
            "score": 1,
            "text": "I’d like to see the percentages of funding from each category.  I know Harvard has a huge endowment left mostly by alumni.  Likely the same alumni who are wanting legacies to attend.\n\nAlso what percentage of students originate from a country with strict testing guidelines?  I know that rampant cheating occurs in other countries for entry into universities. It would be interesting to see how that changes the numbers.",
            "title_similarity": "0.70206785",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hjilxct",
            "score": 1,
            "text": "For those with shorter memories: There was a whole \"[scandal](https://en.wikipedia.org/wiki/2019_college_admissions_bribery_scandal)\" over this in 2019.\n\nAround 60 people were charged, some had to pay fines and undertake community service, others [spend a few months in prison](https://www.npr.org/2020/08/21/904640101/lori-loughlin-husband-set-to-be-sentenced-in-college-admissions-scheme).",
            "title_similarity": "0.6754229",
            "sentiment_compound": -0.296
        },
        {
            "id": "hjimjzu",
            "score": 1,
            "text": "I found this site that claims that 18% of Harvard is black but the site is full of typos and the first comment discredits the claim by pointing out that they lump African immigrants in with the American black demographic.\n\nhttps://www.jbhe.com/2021/04/blacks-make-up-18-percent-of-admitted-students-at-harvard-university/\n\nAnd then this article accuses Harvard of using Latinos as a marketing tool.\n\nhttps://aldianews.com/articles/culture/social/latino-students-accuse-harvard-using-diversity-marketing-tool/57277\n\nAccording to this article, about 6% of Harvard is Jewish down from 21% in 1962. Jewish people make up roughly 1.5% of the US so they're still over represented at least 3:1.\n\nhttps://www.mindingthecampus.org/2019/06/22/are-the-doors-to-elite-universities-still-open-to-jewish-students/\n\nDo Jewish students fall under the white demographic or are they a minority demographic like Asian students who are also over represented in Harvard?\n\nIt seems that both groups are victims of the Harvard quota.\n\nNepotism in the Ivy's is fairly well known but it seems to just favour the affluent the most. Remember kids, it's not how hard you try, it's who you know.",
            "title_similarity": "0.6979209",
            "sentiment_compound": 0.6303
        },
        {
            "id": "hjimnlz",
            "score": 1,
            "text": "Best I could afford was a school that doesn’t even exist anymore and stuck with astronomical interest on an astronomical loan.",
            "title_similarity": "0.49945945",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hjimydy",
            "score": 1,
            "text": "I heard somewhere that most Ivy League schools would be 80% Asians and non Asian immigrants if admission were based or merits. I’m not sure how true it is, but that’s a wild thought.",
            "title_similarity": "0.7188282",
            "sentiment_compound": -0.0765
        },
        {
            "id": "hjin5cb",
            "score": 1,
            "text": "I remember thinking when Felicity Huffman and some other celebrities were caught in the college admissions scandal that they weren’t doing anything out of the ordinary.",
            "title_similarity": "0.6086496",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hjio303",
            "score": 1,
            "text": "How do ALL ALDC admissions break down by the individual \"qualifications\"?",
            "title_similarity": "0.49770868",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjio3bz",
            "score": 1,
            "text": "Why does it bother people who goes to Ivy League schools? Just go elsewhere. If you want their degree, you actually support their ways.",
            "title_similarity": "0.46864584",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hjio4vv",
            "score": 1,
            "text": "Ok so are we actually saying that without these “affirmative action” mechanisms, Harvard would be majority POC? Or just mostly Asians?\n\nIf it’s the latter… no wonder they discriminated against Asians in admission, they’d turn into University of California Irvine otherwise.",
            "title_similarity": "0.7393249",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjiopu0",
            "score": 1,
            "text": "I didn’t go to Harvard but I went to a private “liberal arts” college for one year, which was exactly enough time to figure out the absolute most conservative of mindsets are propagated at private “liberal arts” colleges no matter how big or small.  \n\nEven as a fine arts student, it was literally “do it my way or else”. Like I’m sorry I know what sixteenth notes are and the rest of your class doesn’t because the university thinks it’s okay to accept students into a collegiate music program who have never played or sung a single note in their life?  \n\nSo glad to have left my private “liberal arts” college when I did. It’s been three years and I’m only just starting to regain my individuality.",
            "title_similarity": "0.61459935",
            "sentiment_compound": 0.9244
        },
        {
            "id": "hjip0t2",
            "score": 1,
            "text": "I wonder if the authors had time to do the same analysis of their own university at Duke?",
            "title_similarity": "0.48043555",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjip15y",
            "score": 1,
            "text": "So can someone share a link to actually download the study?",
            "title_similarity": "0.17564458",
            "sentiment_compound": 0.3535
        },
        {
            "id": "hjipgj6",
            "score": 1,
            "text": "Is like to see the percentage of legacies and dean preferences, please.",
            "title_similarity": "0.23735604",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hjipo2v",
            "score": 1,
            "text": "That's the half of the student population that makes the top half possible.",
            "title_similarity": "0.5959289",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hjipotn",
            "score": 1,
            "text": "I'm not saying this is right or wrong, but isn't that why the university is so prestigious? I would have thought the percentage would be higher.",
            "title_similarity": "0.43387654",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hjiqb7g",
            "score": 1,
            "text": "What I've always wondered... why don't the Ivy-Leagues (and equivalents) have their cake and eat it too? Have all these ALDC be registered as some sort of provisional alumni (something-something-legal-loophole), so they can attend classes, be part of the varsities, maybe study if they want to. And once they've completed their courseload, regularize them as full-time students (something-something-legal-loophole, I don't know, have their lawyers come up with it, I assume Harvard or Yale have a few clever minds on retainer) and graduate as a full-Harvard student. And in the meanwhile, all the spots they would've taken over get filled with actual best & brightest. Harvard/Ivies get that endowment money and can keep their acceptance rate low, actual geniuses get a little test of some kind of meritocracy, and entitled (A)LDCs can have their Ivy diplomas while doing very little, as it's always been. Win Win.",
            "title_similarity": "0.61464775",
            "sentiment_compound": 0.9733
        },
        {
            "id": "hjiqbll",
            "score": 1,
            "text": "The other races were 16%.  It should say that in the headline.",
            "title_similarity": "0.5079457",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjiql09",
            "score": 2,
            "text": "I’m surprised only 75% of ALDCs aren’t qualified.",
            "title_similarity": "0.62903273",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hjirqri",
            "score": 1,
            "text": "Others have touched on this but lumping athletics into the same category with legacies is not good science. I attended an ivy and had ivy grades/test scores. Athletics set me apart but it didn’t let me coast into an admission by any means. I’d go one step further and say that athletics in general tended to overrepresent certain socioeconomic and race groups compared to general admissions. I didn’t know what Groton or a prep school was until I attended an Ivy but you can be damn sure the prep school kids were way more likely to be aware of legacy than people who were there because athletics was a differentiator.",
            "title_similarity": "0.67329955",
            "sentiment_compound": -0.2638
        },
        {
            "id": "hjiruhi",
            "score": 1,
            "text": "That's a big gap between 43% and three quarters. What's going on?",
            "title_similarity": "0.5283215",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjiskvi",
            "score": 1,
            "text": "Ugh. Can you imagine what it’s like to feel obligated or pressured to go to Harvard but know the only way you got there is b/c of these reasons?",
            "title_similarity": "0.65158474",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hjitxce",
            "score": 1,
            "text": "So, am I understanding correctly that roughly an entire third of the white student body of Harvard would not have otherwise qualified to be a student there?",
            "title_similarity": "0.89150906",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjiumpe",
            "score": 1,
            "text": "And bunch of unqualified minorities like black nd Hispanics while discriminate against asians and white people especially those not coming from a wealthy background just on the basis of their group doing well at school usually meaning the rich white and asian kids. \n\nIt's a mess of letting in legacies , people from money and unqualified people. It's a joke that ivy league school are considered top schools.",
            "title_similarity": "0.6965699",
            "sentiment_compound": 0.8807
        },
        {
            "id": "hjiuoe4",
            "score": 1,
            "text": "It's absurd that such a thing even exists. People should be admitted only based on their knowledge and intelligence.",
            "title_similarity": "0.362543",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hjiuvec",
            "score": 1,
            "text": "They are a private university and should be able to do whatever they want, BUT I think it's about time people stopped considering Harvard so prestigious. Literally half of the most corrupt politicians I know of came out of that school.",
            "title_similarity": "0.7147591",
            "sentiment_compound": -0.296
        },
        {
            "id": "hjiv5ai",
            "score": 1,
            "text": "I cannot break down this title to understand it",
            "title_similarity": "0.16896431",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjiva2t",
            "score": 1,
            "text": "University entrance is a scam anyway. Highschool performance means nothing and I bet a huge chunk of these students flourish at university and go on to do great things",
            "title_similarity": "0.56036687",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hjiwovk",
            "score": 1,
            "text": "Would be cool if they got rid of AL and C (I'll be honest I don't even know what D means... the dean gets to hand pick students he read articles about or knows personally?), but as long as we're needlessly bringing \"race\" into this story, I hope they would at the same time get rid of all racial considerations when it comes to admissions, too. And maybe financial and other considerations as well. Of course then Harvard would be 85% rich Asian kids.",
            "title_similarity": "0.68239725",
            "sentiment_compound": 0.9349
        },
        {
            "id": "hjix65q",
            "score": 1,
            "text": "Honestly I'm surprised it's that few.",
            "title_similarity": "0.16853431",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hjixp87",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "-0.0012462288"
        },
        {
            "id": "hjiys1k",
            "score": 2,
            "text": "Anyone able to read the full study? I'm really curious what their methodology was for determining if the applicant would have been reject without having legacy status.",
            "title_similarity": "0.51412034",
            "sentiment_compound": -0.0276
        },
        {
            "id": "hjiz2ge",
            "score": 1,
            "text": "Welcome to the world, most jobs nepotism would follow the same bias, and non white businesses would also follow the same biases towards their own race. No clue how you fix it, but it isn’t unique to Harvard",
            "title_similarity": "0.6245888",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hjj10kw",
            "score": 1,
            "text": "How big a % of the annual intake is ALDC?",
            "title_similarity": "0.4858259",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjj1ngf",
            "score": 1,
            "text": "Cuz the white folks got to be accepted somewhere in regards to the outrageous “other cultural” groups that  have a higher chance of being accepted at this current times.",
            "title_similarity": "0.4790982",
            "sentiment_compound": 0.296
        },
        {
            "id": "hjj25bw",
            "score": 1,
            "text": "Where does the \"C\" come in?",
            "title_similarity": "0.083511114",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjj2yrd",
            "score": 1,
            "text": "I’ve yet to meet someone that graduated from Harvard that I would consider to be substantially intelligent. Granted, I haven’t met many Harvard grads, but I had high expectations for their graduates. \n\nGoing to Harvard just seems to be a popularity contest check box. This seems to substantiate that claim.",
            "title_similarity": "0.67978394",
            "sentiment_compound": 0.7867
        },
        {
            "id": "hjj3avh",
            "score": 1,
            "text": "But... But.... Affirmative action is unfair???!!!!?!?!",
            "title_similarity": "0.28025198",
            "sentiment_compound": -0.8062
        },
        {
            "id": "hjj3bcd",
            "score": 1,
            "text": "Is it not the same for other races?",
            "title_similarity": "0.29096293",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjj3ft5",
            "score": 1,
            "text": "For profit colleges prioritize profit over educational prospects? Who'd have thought.\n\n\nThe system is broken",
            "title_similarity": "0.49100393",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hjj3hhq",
            "score": 1,
            "text": "Is anybody shocked that elite colleges are a good ol boy group?",
            "title_similarity": "0.4960966",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hjj3k0g",
            "score": 1,
            "text": "And this is how you perpetuate the privileged class. No more handouts.",
            "title_similarity": "0.2694331",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hjj3u6w",
            "score": 2,
            "text": "And yet this is the same school that has a problem with admitting Asians who qualify legitimately through academic merit. \n\nBut no racism and no white privilege, right?",
            "title_similarity": "0.5873177",
            "sentiment_compound": 0.0067
        },
        {
            "id": "hjj3wup",
            "score": 2,
            "text": "This is truly coming from a place of curiosity, knowing what the common responses will be. What percentage of “non-white” students gain their positions from programs working towards more racial diversity?",
            "title_similarity": "0.5219598",
            "sentiment_compound": 0.743
        },
        {
            "id": "hjj4179",
            "score": 1,
            "text": "Harvard is a nepotism racket masquerading as a university",
            "title_similarity": "0.4959703",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjj43pf",
            "score": 1,
            "text": "It’s a big club and your not invited",
            "title_similarity": "0.26805288",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjj4oto",
            "score": 1,
            "text": "Okay why does this matter?",
            "title_similarity": "-0.0028724335",
            "sentiment_compound": 0.2558
        },
        {
            "id": "hjj4sd8",
            "score": 1,
            "text": "Maybe those are the only people interested in attending…",
            "title_similarity": "0.28016117",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hjj4wc7",
            "score": 1,
            "text": "You shouldn’t be able to get into a school solely on recommendations",
            "title_similarity": "0.445495",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjj4yqy",
            "score": 1,
            "text": "Ok but \"admits\"? Is that supposed to be a verb or adjective in the context of the OP? Strewth son.",
            "title_similarity": "0.29613394",
            "sentiment_compound": 0.5803
        },
        {
            "id": "hjj52o1",
            "score": 1,
            "text": "It's the same over here in the UK, you just gotta go to the \"right school\" ... \n\n**\"Oxford and Cambridge are being accused of being so socially exclusive that they recruit more students from EIGHT top schools than almost 3,000 other UK state schools put together.\"**\n\nQuote is from here:\n\nhttps://www.bbc.co.uk/news/education-46470838\n\nIn otherwords if you are a very talented pupil in Britain and you have the same grades or better than anyone in these 8 schools you are very likely *not* to go to Oxford or Cambridge. \n\n\nThen after graduating the oxbridge set all employ each other. It's nearly a closed shop in some UK industries:\n\n**\"Just 7 per cent of the public as a whole attend independent schools, yet 71 per cent of our top judges did so, 62 per cent of our senior military officers, 55 per cent of civil service permanent secretaries, 26 per cent of BBC executives, 35 per cent of England rugby players, and 33 per cent of the national cricketers.One in seven judges went to just five independent schools.\"**\n\nThe above quote is from here:\n\nhttps://www.independent.co.uk/voices/comment/when-elitism-grips-top-british-society-extent-there-only-one-answer-abolish-private-schools-9696813.html\n\nMore here... \n\nhttps://www.bbc.co.uk/news/education-48745333",
            "title_similarity": "0.7565014",
            "sentiment_compound": 0.8258
        },
        {
            "id": "hjj58bl",
            "score": 3,
            "text": "Damn white people and their \n\n*shuffles deck, draws card \n\nHarvard qualifications",
            "title_similarity": "0.5694809",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hjj5jqy",
            "score": 1,
            "text": "Is this surprising to literally anyone at this point?\n\nRich people don't want not rich people being near their offspring. Rich people don't want more rich people. They want peons that generate money for them for basically nothing.\n\nThe best way to do that is to deny education and opportunity. And they're really really good at denying education and opportunity. Only support education that indoctrinates you into a cog that only feels happy when outputting some saleable product for them.",
            "title_similarity": "0.4297435",
            "sentiment_compound": 0.931
        },
        {
            "id": "hjj5r62",
            "score": 1,
            "text": "I mean isn’t it clear? All these prestigious schools are just nepotism to the max. You’ll make more big name contacts there",
            "title_similarity": "0.5105022",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hjj6tlt",
            "score": 1,
            "text": "This is one of the best examples for how the ruling elite keep their grip on the power centers of this nation. This is a well known fact in the social sciences where the concept of ruling class is studied.",
            "title_similarity": "0.3617284",
            "sentiment_compound": 0.743
        },
        {
            "id": "hjj6vo0",
            "score": 1,
            "text": "How is this school best in the world? Are the ranking rigged?",
            "title_similarity": "0.49278075",
            "sentiment_compound": 0.4696
        },
        {
            "id": "hjj729d",
            "score": 1,
            "text": "This goes to just about every major university!",
            "title_similarity": "0.39880228",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjj7xfc",
            "score": 1,
            "text": "What is the percentage on other races?",
            "title_similarity": "0.33784264",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjj7xus",
            "score": 1,
            "text": "ALDC? You mean the Abby Lee Dance Company? Obviously I’ll be getting into Harvard soon",
            "title_similarity": "0.5220736",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjj82k2",
            "score": 1,
            "text": "Legacy admissions are just affirmative action for rich white people.",
            "title_similarity": "0.5162442",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hjj831u",
            "score": 1,
            "text": "Oh look, another \"ypipo bad\" thread.",
            "title_similarity": "0.20998694",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hjj8c0u",
            "score": 1,
            "text": "i wish we could talk less about the issues of university admissions. but i understand that there is significant impact of your degree and the institution from which you earned it for many people. and that there are many issues. it just all feels like a broken record at this point, and i dont believe most people (especially not on reddit) are talking about it without their personal experience (sub)consciously influencing their POV. more likely to stand on the side of admissions practices being fair if your outcome was good, maybe more likely to question if you felt you deserved better. really, we should give less credence to this whole process.\n\nmaybe what i am wishing is that we would all stop treating a degree from a certain institution as if it's an indication of a person's abilities or natural talent. because it follows you for a lot longer than people want to admit and has a larger impact than imo is reasonable. you can argue there are savants who never went to college or people who \"hustled\" to financial/career success in life and use them as evidence that it doesn't matter, instead your personality/work ethic matter more (there are other factors like racial and socio-economic privilege that influence this). but the fact of the matter is that for many people in terms of getting their careers started and setting them on the right path and giving them access to the right opportunities, this stuff matters way too much. there are so many industries that funnel kids with these types of educations into low-contribution corporate shuffling paper type work (hello management consulting) where the revenue really comes from perceived ability due to diplomas and gold stars on resumes like where you went to college.\n\nit's just ridiculous because once you're in at a top school, you're likely to graduate, since the school wants successful outcomes from an ROI perspective. and the people at the gates who are deciding who gets in or is kept out are so unbelievably unqualified to make the decisions they are paid to make. i dont think thats some kind of well-kept secret either--that the people making these decisions wield too much power for their knowledge and experience level. yet, even though we know the system is imperfect and the gatekeepers are unqualified, somehow we let it color our perceptions of graduates so much--socially, professionally.\n\nsource: i personally knew a few people who did admissions at top LACs and top 5 usnwr universities in the united states. also went to a top 5 usnwr university. also worked in one such corporate-funnel job after graduation.",
            "title_similarity": "0.61039424",
            "sentiment_compound": 0.9956
        },
        {
            "id": "hjj8l0c",
            "score": 1,
            "text": "Aaaaand one of the big reasons their endowment is 53.2 BILLION dollars. Also they have huge returns on their investments.",
            "title_similarity": "0.4929735",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hjj8s02",
            "score": 1,
            "text": "Study from U of C.  Irony!",
            "title_similarity": "0.1824522",
            "sentiment_compound": -0.126
        },
        {
            "id": "hjj945v",
            "score": 1,
            "text": "Ok reddit, what new information does this state show us? \nThank you",
            "title_similarity": "0.31097192",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hjj9d1h",
            "score": 1,
            "text": "Fuking positive discrimination",
            "title_similarity": "0.19830576",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hjj9vpy",
            "score": 1,
            "text": "So Harvard is almost like Hogwarts. If you're a muggle, then tough luck my friend.",
            "title_similarity": "0.50441253",
            "sentiment_compound": 0.785
        },
        {
            "id": "hjj9z70",
            "score": 1,
            "text": "Now so affirmative action’s discrimination",
            "title_similarity": "0.30683017",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjja2sp",
            "score": 1,
            "text": "It's a who you know world. Being the smartest and most qualified doesn't mean you get the highest paying jobs either.",
            "title_similarity": "0.3585008",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hjjacev",
            "score": 1,
            "text": "So whenever someone says \"I went to Harvard\" I might as well flip a coin to determine if they are a moron or actually somewhat intelligent, cool, what a trash institution.\n\nHow much does it cost to go there again?",
            "title_similarity": "0.6291207",
            "sentiment_compound": 0.3876
        },
        {
            "id": "hjjafqd",
            "score": 1,
            "text": "I’m shocked - I never imagined nepotism like decision making was part of everyday life at Harvard…",
            "title_similarity": "0.4935038",
            "sentiment_compound": -0.5283
        },
        {
            "id": "hjjakde",
            "score": 1,
            "text": "If admissions were completely blind as to race, gender, socio economics, legacy etc..what do you think the enrollment would look like?",
            "title_similarity": "0.5459419",
            "sentiment_compound": -0.1263
        },
        {
            "id": "hjjb0y1",
            "score": 1,
            "text": "I'll bet the same group gets most of the scholarship money or don't pay tuition fees at all.",
            "title_similarity": "0.525595",
            "sentiment_compound": 0.0762
        },
        {
            "id": "hjjb44k",
            "score": 1,
            "text": "So the reason why I never got accepted finally came out 🤔",
            "title_similarity": "0.35039926",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hjjbcyb",
            "score": 1,
            "text": "And how many minority admits would have been rejected if they weren't minorities?",
            "title_similarity": "0.6131304",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hjjbn0v",
            "score": 1,
            "text": "This puts most white people at a disadvantage, because all of their spots are prefilled. Other races are competing based on merit (within their race) to get in to Harvard.",
            "title_similarity": "0.752553",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjc8os",
            "score": 1,
            "text": "Why is corruption so open and accepted in the US? In other countries, admission is (almost, certainly not a mere 57%) entirely on merit.",
            "title_similarity": "0.5507606",
            "sentiment_compound": 0.7614
        },
        {
            "id": "hjjcyaj",
            "score": 1,
            "text": "White supremacy out here doing its thing again",
            "title_similarity": "0.20633674",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hjjd1n1",
            "score": 1,
            "text": "Why focus on white instead of class?",
            "title_similarity": "0.43415016",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjdesb",
            "score": 1,
            "text": "Harvard is just there to credential rich white people so they sound smarter than they are? No!",
            "title_similarity": "0.60525644",
            "sentiment_compound": 0.7995
        },
        {
            "id": "hjjdrvm",
            "score": 1,
            "text": "That's ok; this is standard fare for any brand. Harvard is just twenty minutes away from being Toblerone.",
            "title_similarity": "0.45777455",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjje19p",
            "score": 1,
            "text": "Thankfully, this cannot happen in my country ahah",
            "title_similarity": "0.08284983",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hjjee5y",
            "score": 1,
            "text": "Welcome to the real world. We all know how things are really run. Nepotism, trading favors, payments, donations, etc. Nothing is 'fair'. It is sickening. One would hope admissions were merit-based but alas, we are in a world of assholes.",
            "title_similarity": "0.3432958",
            "sentiment_compound": -0.7953
        },
        {
            "id": "hjjef7j",
            "score": 1,
            "text": "Harvard’s student body is 40% white now, so the demographics of this group is not much more white than the student body as a whole. \n\nI wonder what would be the demographics of the students who would be admitted if these ALDC students weren’t there, and how would it be different from the ALDC group.",
            "title_similarity": "0.8256763",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hjjeiva",
            "score": 1,
            "text": "You mean it's not based on merit? Surely you jest.",
            "title_similarity": "0.14742082",
            "sentiment_compound": 0.1451
        },
        {
            "id": "hjjfexe",
            "score": 1,
            "text": "Well with all the affirmative action / diversity and inclusion initiatives it seems like the only way white people can get anywhere now.",
            "title_similarity": "0.53697187",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hjjg4g1",
            "score": 1,
            "text": "When are all the anti-affirmative action groups going to sue over this? Surely they should be just as upset about this?",
            "title_similarity": "0.43242756",
            "sentiment_compound": 0.2812
        },
        {
            "id": "hjjhjwl",
            "score": 1,
            "text": "Harvard discriminates against white and Asian applicants.  I thought everyone knew that.",
            "title_similarity": "0.6629952",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjhu05",
            "score": 2,
            "text": "The societal fraudulence is starting to show. First our finances, then our political system, now  academia. The cracks are widening.",
            "title_similarity": "0.45079947",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hjjiwd0",
            "score": 1,
            "text": "So, what’s wrong with that? It’s a private school they can admit who they want.",
            "title_similarity": "0.32395583",
            "sentiment_compound": -0.25
        },
        {
            "id": "hjjj1dg",
            "score": 1,
            "text": "Mediocrity is big business.",
            "title_similarity": "0.27244312",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hjjj5j8",
            "score": 1,
            "text": "Ivy League Schools are a joke.",
            "title_similarity": "0.35537052",
            "sentiment_compound": 0.296
        },
        {
            "id": "hjjk36a",
            "score": 1,
            "text": "Meritocracy. Make sure your kids are working really hard! It will pay off!",
            "title_similarity": "0.22947279",
            "sentiment_compound": 0.338
        },
        {
            "id": "hjjkbi7",
            "score": 1,
            "text": "Makes sense. These first and foremost are businesses.  Those are the people that make the money.  Yes, I wish it was not this way, but this the world we live in so I'm not surprised to read this",
            "title_similarity": "0.30787683",
            "sentiment_compound": 0.0786
        },
        {
            "id": "hjjknhx",
            "score": 1,
            "text": "So roughly 32% of white students at Harvard have no business being there?",
            "title_similarity": "0.84674317",
            "sentiment_compound": -0.296
        },
        {
            "id": "hjjksiu",
            "score": 1,
            "text": "Harvard is a private university.  Let them make their own criteria.",
            "title_similarity": "0.3550613",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjkuzk",
            "score": 1,
            "text": "You find someone getting in by being on the Dean’s list, aka having very good grades, or by being an outstanding athlete somehow objectionable? I’m curious what you would consider to be a legitimate reason for admission.",
            "title_similarity": "0.60603297",
            "sentiment_compound": 0.8588
        },
        {
            "id": "hjjl9z0",
            "score": 1,
            "text": "No wonder why so many US companies are run by toxic boys club leadership.  They teach you right in school that being member of an \"elite\" club is more important than being qualified for the job. \n\nAs a Canadian I always been confused as to why Americans care so much about which university someone went to.  Over here it is is barely relevant.",
            "title_similarity": "0.6136445",
            "sentiment_compound": 0.2006
        },
        {
            "id": "hjjlaw7",
            "score": 1,
            "text": "Sounds a lot like the affirmative action their parents never stop whining about.",
            "title_similarity": "0.3926521",
            "sentiment_compound": 0.6192
        },
        {
            "id": "hjjliws",
            "score": 1,
            "text": "Some kid's mom was bragging to me that his son got into Harvard with a scholarship. Knowing that they don't give scholarships other than for financial need I thought it was funny she was bragging to me that she was poor.",
            "title_similarity": "0.678971",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hjjlt8a",
            "score": 1,
            "text": "Still better than getting accepted just because of their skin color.",
            "title_similarity": "0.35616794",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hjjlzkw",
            "score": 1,
            "text": "This is socialism for the wealthy and well connected.  This is how “institutions” stay in business.  Ask why and a guy dressed like Tevye comes out and sings “Tradition.” Ironically, Tevye wouldn’t be admitted to Harvard.",
            "title_similarity": "0.5272417",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hjjm560",
            "score": 1,
            "text": "My son went to Stanford. My wife (his mom) went to Stanford. Both of her parents went to Stanford. Her grandmother on her mom’s side went to Stanford. \n\nHe’s a very bright kid. 1550 without studying for SAT. Went to one of NYC’s elite public high schools (starts with “S” ends with “T”.) Straight A student. There’s no question the legacy status pushed him over the edge and took the place of the kind of intense extra curricular activities that he’d of needed to be considered. \n\nOn the upside he’s working in a non-profit, and my wife is a social worker (likely the lowest paid Stanford graduate of 1993, the dot com class.)",
            "title_similarity": "0.6314006",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hjjmgls",
            "score": 1,
            "text": "Without commenting on the study itself, this isn't science, so I don't think it's relevant to this subreddit.",
            "title_similarity": "0.2492383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjmhda",
            "score": 1,
            "text": "Oh my God are you saying Harvard is a networking school about who you know and not what you know?! \n\n\n\n\n\n\n.....woooooow. Anyway.",
            "title_similarity": "0.5360577",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hjjmius",
            "score": 1,
            "text": "Let's pretend Harvard was 90% people of color who were admitted through affirmative action.",
            "title_similarity": "0.7201022",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjn0qs",
            "score": 1,
            "text": "This was my main complaint when everyone was in an uproar over the college admission scandal that included that lady from full house and Frances McDermott. \n\nI understand that people were upset that these rich people cheated to get their kids into high end state schools, but to me this is the real travesty in education. A Harvard or Yale degree is essentially a lifetime pass to 6 figure job opportunities. And the majority of the kids that go there kill themselves and suffer great personal penalty to not only their individual wealth but also their families.  And the people on these lists just get in... They don't have to work hard or prove anything they just get in because of who they are or who their parents are. \n\nThe Hollywood people simply tried to purchase the unearned privilege that these people are taking advantage of every year all the time. While it may feel good to punish Lauri Laughlin for her petty indiscretion there are thousands of anonymous high level school attendees who simply came out the correct uterus to earn the right to go to far more prestigious schools than UCLA. And my view being born to little and earning your way to a point you can buy your kids into a decent college is far less of a crime than than just your great great grandfather going there and thus you are entitled to a lifetime of wealth.\n\n(No disrespect to UCLA. I couldn't get in there.)",
            "title_similarity": "0.6699855",
            "sentiment_compound": 0.458
        },
        {
            "id": "hjjn7do",
            "score": 1,
            "text": "Is that because they consider race in admissions? Whitys need the extra connection to make the cut?",
            "title_similarity": "0.5016917",
            "sentiment_compound": -0.3527
        },
        {
            "id": "hjjosz5",
            "score": 1,
            "text": "Those hiring take notice. Ivy League degree might not be worth the paper its printed on.",
            "title_similarity": "0.54009074",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hjjoz5k",
            "score": 1,
            "text": "If you're rich and white. You can do anything in this country. Anything. Read that again.",
            "title_similarity": "0.22869666",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hjjoz7e",
            "score": 1,
            "text": "It’s not the education, it’s the piece of paper.",
            "title_similarity": "0.09814909",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjpxas",
            "score": 1,
            "text": "Harvard, Yale, Warton, Princeton. These are places you go to make connections so you can get in on the future Meta. It’s all about who you know. Otherwise most universities will get you a great degree as long as you’re pursuing an employable job (medicine).",
            "title_similarity": "0.5463793",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hjjq80o",
            "score": 1,
            "text": "Fun fact, Dartmouth is the only Ivy League that does not give any advantage to children of the faculty. \n\nEvery other Ivy League school give children of the faculty a small bonus on their application, and actually also give them better financial aid. It’s also reciprocal, so if your parent works at Columbia, you could get the same benefits at Brown, but not Dartmouth.",
            "title_similarity": "0.6458811",
            "sentiment_compound": 0.6985
        },
        {
            "id": "hjjqcyw",
            "score": 1,
            "text": "Meritocracy myth. https://scholar.google.com/scholar?hl=en&as_sdt=0%2C47&q=mcnamee+meritocracy+myth&oq= In the United States, birth ZIP Code better predicts material outcomes than talent, Hardwork or merit",
            "title_similarity": "0.51231766",
            "sentiment_compound": 0.8979
        },
        {
            "id": "hjjqnfu",
            "score": 2,
            "text": "To be fair I never expected the athletes to have the same academic stats as your average “Harvard admit”.",
            "title_similarity": "0.6631292",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hjjqpne",
            "score": 1,
            "text": "I mean, it's a private university, they can give preferential status to people with outtie bellybuttons as long as they apply that evenly to their admissions and does not get tied to race or religion.",
            "title_similarity": "0.39695776",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjqtse",
            "score": 1,
            "text": "This ain’t science, just spitting out the facts of life...",
            "title_similarity": "0.14017242",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjqyhi",
            "score": 1,
            "text": "Grew up in Boston - we all knew this. Also that not only do they get it, they don’t get kicked out. \n\nIt’s always funny to me when people talk about how great Harvard is as a school… because we knew it as a pay to play old boys club.",
            "title_similarity": "0.54378784",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hjjrl2q",
            "score": 1,
            "text": "Reminds me of a certain word that gets thrown around about white folks that starts with a P",
            "title_similarity": "0.4408081",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hjjrr1s",
            "score": 1,
            "text": "This is why when people defend others by simply saying “they went to blah college” I’m like: So?",
            "title_similarity": "0.4963975",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hjjs2vc",
            "score": 1,
            "text": "Aren't all arbitrary social constructs of power or influence biased?  I'd imagine this same bias to be true of most ivy league schools and probably would be found in large companies as well.",
            "title_similarity": "0.59565717",
            "sentiment_compound": 0.34
        },
        {
            "id": "hjjs6hx",
            "score": 2,
            "text": " I'd be curious to know how many are athletic and how that number corresponds with non-ivy league school athletic scholarships. Ivy league schools generally do not offer athletic scholarships. So lowering standards of admission is often how they draw student athletes.  To me, that's quite different than the legacies and \"dean's special list\".\n\nIt's also very common for employees of learning intitutions to get heavy discounts for their children (sometimes free tuition altogether).  I worked at an R1 public university and knew a 75+ year old cleaning lady who just started working there so her granddaughter (who she raised) could get tution covered. Otherwise, they would not have been able to afford to attend.  That's a bit different than lowering standards of course, but the general concept is not completely out there.\n\nThe abstract here is very race driven. And the implication may be valid for sure. I would just like to see the details of these different categories and race distribution within the categories (and race break down of the staff/faculty and how many have college-aged children)\n\n\nI want to see athletics, faculty/staff dependents, legacies, and deans special pets broken down.\n\nThe atheltic thing is quite different than dean's pet list.  And I don't necessarily have an issue with the faculty/staff thing either depending on the specifics of how that works.  I mean, how many students is that in any given year amyhow? As long as it extends beyond the deans and professors, that is a way to possibly allow students to attend who wouldn't be able to otherwise.\n\n\nTL;DR:  Context.  Context matters.",
            "title_similarity": "0.72518384",
            "sentiment_compound": 0.8955
        },
        {
            "id": "hjjscnn",
            "score": 1,
            "text": "The rich simply have an easier time at everything.",
            "title_similarity": "0.09148242",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hjjsyc7",
            "score": 1,
            "text": "What’s the Dean’s Interest List? Girls the Dean thinks are hot?",
            "title_similarity": "0.38243732",
            "sentiment_compound": 0.5204
        },
        {
            "id": "hjju19k",
            "score": 1,
            "text": "Remember friends dont listen to propoganda from a paywall. The idea that just saying white kids are over represented in schools without any admission to needing change, or doing it for monetary gains means that your true intent was never to provide for ethnic groups or lgbtq+ groups.",
            "title_similarity": "0.5128188",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hjju7ny",
            "score": 2,
            "text": "And this is what the aristocracy looks like. \n\nThey aren’t even hiding it, anymore.",
            "title_similarity": "0.15672977",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hjjuys6",
            "score": 2,
            "text": "This applies to almost everything in this political world.",
            "title_similarity": "0.24677941",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjv33v",
            "score": 2,
            "text": "But they cry about affirmative action. What a joke.",
            "title_similarity": "0.32326338",
            "sentiment_compound": -0.3291
        },
        {
            "id": "hjjvnqs",
            "score": 1,
            "text": "And people wonder why things like affirmative action are needed",
            "title_similarity": "0.35437772",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hjjw0gq",
            "score": 1,
            "text": "Okay? Why would you include the students making use of their parents contractual job benefits?",
            "title_similarity": "0.48689362",
            "sentiment_compound": 0.594
        },
        {
            "id": "hjjwi17",
            "score": 1,
            "text": "This is literally nothing new. One thing I was taught years ago in high school was how legacy worked. That's for most if notal colleges.",
            "title_similarity": "0.5042647",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjwnwh",
            "score": 1,
            "text": "The myth of meritocracy at its finest.",
            "title_similarity": "0.17650221",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hjjwvij",
            "score": 1,
            "text": "Wow so a lot of this is just open nopitism?",
            "title_similarity": "0.1535233",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hjjx8fq",
            "score": 1,
            "text": "Pretty sure this is the case for most Colleges/Uni in America",
            "title_similarity": "0.43674207",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hjjxejg",
            "score": 1,
            "text": "If you do not like this then don’t be impressed with people who have a Harvard degree.  Clearly it is overrated as as those with them.\n\nBitching about unfairness is how these people maintain their illusion of superiority.  \n\nI get job applicants all the time who think that I care about what school they were accepted into. I usually skip over the education section in the resumes. I just look to see if it was completed.\n\nIf you are dealing with HR people who think this is important then I can assure you that they are  not well educated either.",
            "title_similarity": "0.68199885",
            "sentiment_compound": 0.8928
        },
        {
            "id": "hjjxhsb",
            "score": 1,
            "text": "Private school right? My only peeve about it is that they do receive federal money through student loans, etc...",
            "title_similarity": "0.44736433",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjxjjx",
            "score": 1,
            "text": "Suddendly, all those race quotas they're also implementing start to make sense...and the feeling of alienation of white people outside those two lanes for privilege.",
            "title_similarity": "0.5378883",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hjjxooy",
            "score": 3,
            "text": "Shouldn't this number be compared to the non white, respectively before we comment?",
            "title_similarity": "0.45877174",
            "sentiment_compound": 0.291
        },
        {
            "id": "hjjxtf7",
            "score": 1,
            "text": "\"Just work hard and you'll succeed in the US, and here's the one-in-a-million example of that!!\"\n\n&#x200B;\n\nKinda really tired of that lie, and I've been hearing it for over six decades.",
            "title_similarity": "0.55384254",
            "sentiment_compound": -0.1775
        },
        {
            "id": "hjjxwn7",
            "score": 1,
            "text": "It's a snooty private school.  They can run it however they want.  I just find it surprising that a degree from there earns so much respect, given the mertilessness of the whole process of producing their graduates.  \n\nI guess it's just about the money.",
            "title_similarity": "0.46024722",
            "sentiment_compound": 0.6983
        },
        {
            "id": "hjjxxmo",
            "score": 1,
            "text": "And many of these same people scream about the unfairness of affirmative action.",
            "title_similarity": "0.4087089",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hjjy1lk",
            "score": 1,
            "text": "White people have been pushed into the background!!  Whatever happened to “Equality for All?”",
            "title_similarity": "0.5371469",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjy4uu",
            "score": 1,
            "text": "They ride the gravy train of accumulated intergenerational wealth and privilege. They are largely below average intelligence and academic ability. They pay people to write their papers and their profs are afraid to give them low marks for fear of reprisal from corrupt parents. American rot begins at the head.",
            "title_similarity": "0.5319264",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hjjyb43",
            "score": 1,
            "text": "I had no idea about this kind of thing. A famous Canadian comedian, Rick Mercer, did a special where he talked to Harvard students. He asked them silly questions and got silly answers. Of course not all answers were shown, but at a place like Harvard, you’d think it would be a lots of cuts. I guess it wouldn’t actually be so hard.",
            "title_similarity": "0.601848",
            "sentiment_compound": 0.0774
        },
        {
            "id": "hjjyhxb",
            "score": 1,
            "text": "What is the number for every other race?",
            "title_similarity": "0.37700757",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hjjyqfd",
            "score": 1,
            "text": "Asians really do get fucked over at Harvard",
            "title_similarity": "0.54118115",
            "sentiment_compound": -0.6872
        },
        {
            "id": "hjjyr33",
            "score": 1,
            "text": "The real Affirmative Action. This has played out at schools across the US for generations.",
            "title_similarity": "0.43135566",
            "sentiment_compound": 0.34
        },
        {
            "id": "hjjyrqo",
            "score": 1,
            "text": "Didn't Trump go to Harvard? This story checks out!",
            "title_similarity": "0.56993043",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjystf",
            "score": 1,
            "text": "And you have celebrities going to jail for paying for their kids to go to college. How about the whole staff at Harvard?",
            "title_similarity": "0.6403223",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjyxg7",
            "score": 1,
            "text": "Life is who you know and how much money you got. This is not new. These schools goal is to make money",
            "title_similarity": "0.29477134",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjjz8wa",
            "score": 1,
            "text": "Clearly OP was “admit” with ADLC status",
            "title_similarity": "0.15865004",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hjjzive",
            "score": 1,
            "text": "$25 paywall for a single article.\n\nThis is the world we live in where access to scientific research (or anything that looks like it) now costs money direct to consumers because that's the only way science can still survive.",
            "title_similarity": "0.59307003",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hjjzmh8",
            "score": 1,
            "text": "It’s in our power to stop giving the respect to these institutions of nepotism",
            "title_similarity": "0.19620378",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hjjzy5m",
            "score": 1,
            "text": "Depending on where you are at it might be easier. One of my scholars bowl teamates in Highschool went to Harvard. She was white, from a small town in western kansas. Elite schools also want regional diversity so they will pull high acheivers out of underserved areas.",
            "title_similarity": "0.6987299",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hjk08gx",
            "score": 1,
            "text": "And people still revere their students?",
            "title_similarity": "0.20604998",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjk0am1",
            "score": 1,
            "text": "And? The only reason to go to an ivy is for the connections. It’s access to the elite and they want to protect that. But you don’t need harvard to access the elite, you just need to be clever, aggressive, and disciplined. \n\nUnfairness is just a perception. Redditors seem to think everything should be handed them on a plate ‘fairly’. It’s cringe.",
            "title_similarity": "0.4373874",
            "sentiment_compound": 0.6187
        },
        {
            "id": "hjk0esk",
            "score": 1,
            "text": "I bet if admission was pure academics 75 percent of the students would be asian.",
            "title_similarity": "0.7438486",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjk0g0s",
            "score": 1,
            "text": "And the other 57% are too arrogant to admit it?",
            "title_similarity": "0.55212533",
            "sentiment_compound": -0.34
        },
        {
            "id": "hjk0jgd",
            "score": 1,
            "text": "I wonder how this compares to MIT. As someone who went to MIT, I always felt like our sports teams sucked and although I knew some legacies, it was not as many as at Harvard.",
            "title_similarity": "0.6529093",
            "sentiment_compound": -0.128
        },
        {
            "id": "hjk0ndx",
            "score": 1,
            "text": "Where I live, kids are killing themselves to get perfect grades, perfect SATs, do all the checkbox activities like violin/piano virtuoso, curing cancer in a research lab, a refined sport of some kind like crew or lacrosse, starting a billion dollar tech company in their spare time...all to get into an Ivy League school (or if they're really gunning for it, all of them for bragging rights.) Even with all this, there's a good chance most won't get in. When you have hundreds of thousands of applicants applying for 1000 spaces or whatever it is, that's lottery-level odds and you're competing against clones of yourself with the perfect grades, perfect slate of activities, etc.\n\nWhat I wonder, never having been a stellar student and ending up in a state school...what do you actually get for the price of admission? I've heard it's basically a guaranteed ticket to a successful life and at the very least you'll get a lucrative investment banking or management consulting job. I just don't know what drives the parents to drive their kids so hard (or donate a building, or cheat the system.) Is it the networking? Is it a country club and you can relax the second you're admitted? Because if the exit prize is getting whipped 100 hours a week by senior bankers to Excel faster or giving the same thought-leader PowerPoint 40 times a year to bored executives...that just doesn't seem worth it.",
            "title_similarity": "0.6362387",
            "sentiment_compound": 0.9834
        },
        {
            "id": "hjk0nu7",
            "score": 1,
            "text": "Shocking. Just shocking.",
            "title_similarity": "0.069033094",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hjk0qg7",
            "score": 1,
            "text": "Oh those evil whites…",
            "title_similarity": "0.20388773",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hjk0qti",
            "score": 1,
            "text": "File this under: Things you already knew but didn't have verifiable proof of.",
            "title_similarity": "0.3052652",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjk0r7s",
            "score": 2,
            "text": "In other words, \"affirmative action.\"",
            "title_similarity": "0.13668533",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjk16xh",
            "score": 2,
            "text": "ALDC = Nepotism. Just say it. That’s what it is for white mostly wealthy kids.",
            "title_similarity": "0.54032016",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hjk17xu",
            "score": 1,
            "text": "Woudn’t it be fairer that the only way in would be the entrance examination?",
            "title_similarity": "0.4131206",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjk1xc9",
            "score": 1,
            "text": "So you spent six months working with a law firm, including regular observation and participation in trial procedure, check.",
            "title_similarity": "0.5057002",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjk1xnf",
            "score": 1,
            "text": "Not sure if classism or systemic racism, maybe a little of both….. but things like this have got to change.",
            "title_similarity": "0.30228758",
            "sentiment_compound": 0.0565
        },
        {
            "id": "hjk2fu0",
            "score": 1,
            "text": "Yeah and what's the size of their endowment again? Over 50 billion now?....",
            "title_similarity": "0.46489725",
            "sentiment_compound": 0.3736
        },
        {
            "id": "hjk2gbw",
            "score": 1,
            "text": "Well obviously, this is how college admissions work, not surprising.",
            "title_similarity": "0.28184718",
            "sentiment_compound": 0.0736
        },
        {
            "id": "hjk2iz8",
            "score": 2,
            "text": "I remember that when I visited Harvard with my high school, the snobbish tour guide, who was also a student at Harvard, said: \"another way to get into Harvard is if you make a large donation in money...\"",
            "title_similarity": "0.66645056",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hjk2mgt",
            "score": 1,
            "text": "It’s a private institution I don’t see a problem with this.",
            "title_similarity": "0.05576405",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hjk30v6",
            "score": 2,
            "text": "So you're telling me Harvard is a cult? Not surprising.",
            "title_similarity": "0.48275173",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hjk36py",
            "score": 1,
            "text": "So about 32% of white Harvard students would be rejected without their ALDC status? I did not go to Harvard and my last math class was in 10th grade a couple decades ago, so please correct me if I'm wrong.",
            "title_similarity": "0.77865696",
            "sentiment_compound": -0.5281
        },
        {
            "id": "hjk3myt",
            "score": 3,
            "text": "It's a big club, and you ain't in it. -GC",
            "title_similarity": "0.28662583",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjk3u2o",
            "score": 1,
            "text": "If ya can’t beat them that join them",
            "title_similarity": "0.23717056",
            "sentiment_compound": 0.296
        },
        {
            "id": "hjk3ups",
            "score": 1,
            "text": "Why is this on the science subreddit",
            "title_similarity": "0.183247",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjk3ydo",
            "score": 1,
            "text": "I like how all whites are grouped together in references.  If your skin is white your white and white only.   Not British, not Scottish, not Irish not Canadian, not African,.  Just white.    \n\nBut people of color can be Korean, Chinese, Vietnamese, Iranian, Iraqi , African and so forth.      \n\n\nStop that....  It's bigotry racism 101.\n\nAnd to those unaware....  Yes, there are \"white\" Africans.   It's a thing.   Gtfu",
            "title_similarity": "0.5272241",
            "sentiment_compound": -0.7762
        },
        {
            "id": "hjk3zap",
            "score": 1,
            "text": "Hasn't this always been the case? This is seriously surprising to people?",
            "title_similarity": "0.25890398",
            "sentiment_compound": 0.1926
        },
        {
            "id": "hjk48r3",
            "score": 1,
            "text": "Welcome to the real world. As unfair as it may seem, this is how the world has been working and will work forever. If you come to Africa or South America it’s way worse compared to ‘Western world’",
            "title_similarity": "0.3079909",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hjk4hrx",
            "score": 1,
            "text": "I’m not sure what’s deans interest is, but athletics are at least some kind of merit. Family and legacy nepotism doesn’t really seem like the same thing to me. I get it’s non-pure academic, but it’s also not nepotism. If they want good sports teams they’re gonna recruit good athletes.",
            "title_similarity": "0.47597694",
            "sentiment_compound": 0.9485
        },
        {
            "id": "hjk4jdp",
            "score": 1,
            "text": "And? It’s a private school. They are allowed to set their own policies.",
            "title_similarity": "0.21305507",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjk4q0t",
            "score": 1,
            "text": " I'm not particularly impressed by Ivies because they're all like that.  My mom's boss's son got straight Cs in school and is now at Yale because his dad is wealthy and powerful.  Whenever someone says they went to Harvard I dont automatically think they're smart, I automatically think they're rich.",
            "title_similarity": "0.6399187",
            "sentiment_compound": 0.9048
        },
        {
            "id": "hjk4uzs",
            "score": 1,
            "text": "Now do statistics for black student admits?",
            "title_similarity": "0.5676054",
            "sentiment_compound": 0.296
        },
        {
            "id": "hjk5f0y",
            "score": 1,
            "text": "A lot of companies will see Harvard on an application and throw it out now. Been working in HR over 20 years.",
            "title_similarity": "0.6798254",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjk5zbl",
            "score": 1,
            "text": "Its interesting to note that although Academics are often painted as somehow against the institution, we still very much rank our education based on these institutionally-backed ivy leagues. The wealthy, politically-entrenched, and ever-exclusionary ruling class of this country have been coming out of these institutions for hundreds of years. I would challenge anyone with a decent college education to say that corruption *wouldn't* be the norm at a place like Harvard. You don't survive hundreds of years as a organization without eventually kowtowing to the powerful.",
            "title_similarity": "0.72077775",
            "sentiment_compound": 0.8689
        },
        {
            "id": "hjk6a9s",
            "score": 1,
            "text": "Yeop we already knew that now do yale",
            "title_similarity": "0.19326343",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjk6pcn",
            "score": 2,
            "text": "And out of the 43% I wonder how many will actually admit they were given a leg up in life.",
            "title_similarity": "0.6536981",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hjk6tek",
            "score": 1,
            "text": "Hispanic is not a race. Also the Dean's interest list is not only donors but connections. Government likes to groom people into useful positions.",
            "title_similarity": "0.43014938",
            "sentiment_compound": 0.8608
        },
        {
            "id": "hjk6z4r",
            "score": 2,
            "text": "It's a big club and you're not a member",
            "title_similarity": "0.29398218",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjk79ni",
            "score": 1,
            "text": "although this needs to change I thought this was more common knowledge, kids from wealthy families with connections always go to good schools. It’s never been about the grades or fairness sadly",
            "title_similarity": "0.4876936",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hjk7dbb",
            "score": 1,
            "text": "These numbers mean nothing without the same numbers for all other races",
            "title_similarity": "0.31168306",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjk7m04",
            "score": 2,
            "text": "Ah the classic it's not what you know, it's who you know. The saying seems to apply even when trying to gain knowledge.",
            "title_similarity": "0.17815965",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hjk7qwj",
            "score": 1,
            "text": "Thanks reddit for making me depressed again by showing me that the world isn't fair.",
            "title_similarity": "0.3381108",
            "sentiment_compound": -0.3318
        },
        {
            "id": "hjk7ujm",
            "score": 2,
            "text": "“legacy” is affirmative action for white people",
            "title_similarity": "0.44455343",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjk7xzd",
            "score": 1,
            "text": "I think children of staff is the worst one. Definition of nepotism.",
            "title_similarity": "0.40424109",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hjk85qg",
            "score": 1,
            "text": "How about the idea that excellent education should be open to all?",
            "title_similarity": "0.19083016",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hjk8qox",
            "score": 1,
            "text": "I would imagine is why professors at those colleges teach there part time and do other gigs like teaching at other colleges or idk consulting in their field or even a regular full time job so I’d have no problem being a janitor if I lived near these school just for myself to have free tuition and use fafsa because of the low pay I’m sure. If they had a pension I’d be there for life even after I graduated I have no shame in having a good job that has benefits while having a college education.",
            "title_similarity": "0.46889186",
            "sentiment_compound": 0.9297
        },
        {
            "id": "hjk8tky",
            "score": 1,
            "text": "Every Ivy does this, as well as the big scholarships (Rhodes. Marshall, etc.)",
            "title_similarity": "0.3989527",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hjk91l8",
            "score": 1,
            "text": "Meaning regular White people have basically a zero percent chance of getting in unless theyre lucky enough to track down a Native American or Black relative.",
            "title_similarity": "0.6352234",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hjk992e",
            "score": 1,
            "text": "ALDC Abby Lee Dance Company",
            "title_similarity": "0.24207199",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjk9dfz",
            "score": 1,
            "text": "I’m personally for blind applications.",
            "title_similarity": "0.23519002",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hjk9qe5",
            "score": 1,
            "text": "Oddly the most deserving of those 4 groups are probably the Athletes.",
            "title_similarity": "0.43631238",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjka4lv",
            "score": 1,
            "text": "Can I just say that as an athlete who probably wouldn't have gotten into my school without sports - we're not really the same as legacies, and lumping athletes in with legacies can be problematic. except maybe golf and crew",
            "title_similarity": "0.5939939",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hjka535",
            "score": 1,
            "text": "What % of non-white students are ALDC admits?",
            "title_similarity": "0.7301",
            "sentiment_compound": 0.296
        },
        {
            "id": "hjkarmp",
            "score": 1,
            "text": "Welcome to the Dystopian Reality , the rich , well connected and privileged only taking care of and looking for themselves and their friends. It's a big club and you ain't in it. We need to change our goals folks. I have long known this reality  ( how can you miss it....it's all around you ), just trying to share it.",
            "title_similarity": "0.3890044",
            "sentiment_compound": 0.9552
        },
        {
            "id": "hjkaw3i",
            "score": 1,
            "text": "What sucks is that deserving whites without connections are marginalized, minorities stay marginalized, and the wealthy and connected keep on with their privilege.",
            "title_similarity": "0.5114585",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hjkbe2s",
            "score": 1,
            "text": "Someone needs to be put on Double secret probation for this.",
            "title_similarity": "0.41865087",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjkbfue",
            "score": 1,
            "text": "This is.... news, somehow?",
            "title_similarity": "0.10918432",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjkbm5k",
            "score": 1,
            "text": "Been around long enough now to realize a Harvard degree isn’t any different than one from Sum State U and is only a “ghetto pass” for elites to get into jobs literally anyone else similarly credentialed could do just as well, and likely better.",
            "title_similarity": "0.62405145",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hjkbxpg",
            "score": 2,
            "text": "Wow, this really diminishes the value of the degree.  Who’s to say the help stopped at admissions.  So what qualifies as Dean’s list?  Let me guess a huge donation.  Didn’t this type of academic corruption come to light and be exposed.  \n\nAdmissions should only be made on equal grounds.\n\n3/4 would have been rejected?  How can they be expected to handle the curriculum?  This smells so bad.",
            "title_similarity": "0.62122893",
            "sentiment_compound": 0.2529
        },
        {
            "id": "hjkc43m",
            "score": 1,
            "text": "Everyone knows Harvard is overrated garbage, no idea why is this surprising at all",
            "title_similarity": "0.46269286",
            "sentiment_compound": 0.0451
        },
        {
            "id": "hjkc48i",
            "score": 1,
            "text": "If someone says to me \" I studied at Harvard \" in the back of my head I assume this person is just a huge asshole trying some sort of power play, because it doesn't really matter where you studied all I care about is that you can compete a task I hired your for, like why are we even talking go work.",
            "title_similarity": "0.5664739",
            "sentiment_compound": 0.8323
        },
        {
            "id": "hjkclpd",
            "score": 1,
            "text": "Is that title difficult to read or was that just me?",
            "title_similarity": "0.26437193",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hjkctfw",
            "score": 1,
            "text": "So, when interviewing a Harvard grad, verify if they were ALDC as you may have someone that was aided I. Getting the degree and is UNQUALIFIED.\n\nI live in a different country but I’m sure some American will get their hands on the LDDC admissions lists and publish it online so we can disqualify people.\n\nI don’t want someone working for me that were accepted in university because of their parents.  The help they were given to get through university ended with the degree.  Guaranteed they cannot perform as expected on their own.",
            "title_similarity": "0.65263474",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hjkd4c1",
            "score": 1,
            "text": "Can someone explain to me why athletes belong on that list?  I get the other three as it has nothing to do with the student but rather their family and connections, but if a student is a talented enough athlete that the school wants them why is that lumped in with family connections?",
            "title_similarity": "0.5664112",
            "sentiment_compound": 0.7013
        },
        {
            "id": "hjkfokq",
            "score": 1,
            "text": "i kept reading ALDC as “abby lee dance company”",
            "title_similarity": "0.31952724",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjkfpja",
            "score": 1,
            "text": "The best university in the world is in your country but u can't go because you are not white and rich. America logic.",
            "title_similarity": "0.58469856",
            "sentiment_compound": -0.3151
        },
        {
            "id": "hjkj51m",
            "score": 1,
            "text": "It’s a social club for the ruling class",
            "title_similarity": "0.2810449",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjkjbhs",
            "score": 1,
            "text": "Were talking about the university where you get bonus points for not being white?",
            "title_similarity": "0.6128245",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hjkll02",
            "score": 1,
            "text": "What percent of nonwhite kids are ALDC",
            "title_similarity": "0.55409276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjkm7a8",
            "score": 1,
            "text": "And 37% of students at Harvard are white.. so it’s a pretty small amount of people. It used to be much higher",
            "title_similarity": "0.8212114",
            "sentiment_compound": 0.5367
        },
        {
            "id": "hjkmql5",
            "score": 1,
            "text": "I do not think the conclusion that removing ALDC would reduce white admissions is demonstrated by this study. That conclusion assumes the whites who were rejected due to lack of ALDC status were inferior candidates relative to the general pool.",
            "title_similarity": "0.5851381",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hjkn6d4",
            "score": 1,
            "text": "It's not what you know, but who you know.",
            "title_similarity": "0.1594406",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjkod7r",
            "score": 2,
            "text": "Interesting fact, Harvard could offer free tuition and still be very profitable due to alumni contributions. Harvard or any ivy league school is not what they use to be. The overtly liberal agendas that are allowed to fester there are driving away good teachers and faculty.",
            "title_similarity": "0.577362",
            "sentiment_compound": 0.902
        },
        {
            "id": "hjkqfj1",
            "score": 1,
            "text": "How many people get in with no merit other than their skin color?",
            "title_similarity": "0.53713906",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hjkrpwo",
            "score": 3,
            "text": "Ok, now break down the other demographics of students who got in based on factors other than merit",
            "title_similarity": "0.5501678",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hjkv1py",
            "score": 1,
            "text": "I think this speaks to class even more than it speaks to race.",
            "title_similarity": "0.44775724",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjkxoub",
            "score": 1,
            "text": "Isn't the company line that full-tuition paying legacy admits basically subsidize a huge number of merit based enrollment?",
            "title_similarity": "0.5094155",
            "sentiment_compound": 0.765
        },
        {
            "id": "hjl4fhn",
            "score": 1,
            "text": "This explains why so many celebs get accepted into Harvard Business school.",
            "title_similarity": "0.61571085",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hjl70ty",
            "score": 1,
            "text": "White privilege, I guess…..",
            "title_similarity": "0.2676996",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hjl8ke0",
            "score": 1,
            "text": "What percentage of total admits is that? \n\nIt’s not saying 43% of all admits, just the white admits.",
            "title_similarity": "0.658067",
            "sentiment_compound": 0.7089
        },
        {
            "id": "hjl9j52",
            "score": 1,
            "text": "I also read up on a study where Ivy League students don’t really make any more than state university students later in life because at that point … where you went to college doesn’t really matter. I feel that employers look for a certain type of critical thinking that isn’t offered at ivy leave schools. If you guys are interested, I can edit my comment & give links to support this claim.",
            "title_similarity": "0.5851106",
            "sentiment_compound": 0.659
        },
        {
            "id": "hjl9ohe",
            "score": 1,
            "text": "I know a girl whom was almost murdered via hitman hired by boyfriend of victim. Her boyfriend was jealous she was accepted into Harvard and he WASN’T\nThe kind of crazy that exists in politics are being made right there via politics.",
            "title_similarity": "0.59026754",
            "sentiment_compound": -0.8689
        },
        {
            "id": "hjlf2ti",
            "score": 1,
            "text": "phuqing nepotism and racism. phuquing cocks",
            "title_similarity": "0.3137594",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hjlgkh8",
            "score": 1,
            "text": "What theory is this testing?",
            "title_similarity": "0.09390647",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjlh6lu",
            "score": 1,
            "text": "How does that compare to non-white students?",
            "title_similarity": "0.5180495",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjli7cn",
            "score": 1,
            "text": "I just did some math. If that’s true, and if 40% of Harvard is white, ~13% of kids wouldn’t have been accepted.",
            "title_similarity": "0.82662463",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hjlm89d",
            "score": 1,
            "text": "Crazy how much more intelligent East Asians are.",
            "title_similarity": "0.39234573",
            "sentiment_compound": 0.2247
        },
        {
            "id": "hjlte8y",
            "score": 1,
            "text": "How about statistics on which former students donate to Harvard on a regular basis. My bet is so-called “ADLC” graduates.",
            "title_similarity": "0.65115964",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjluvrf",
            "score": 1,
            "text": "What’s “Dean’s Interest?”",
            "title_similarity": "0.13395041",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjm05y4",
            "score": 1,
            "text": "Wow.  Just wow.   Pay for play at the next highest level.  Highest being government / Supreme Court.",
            "title_similarity": "0.3611574",
            "sentiment_compound": 0.9217
        },
        {
            "id": "hjn7ayy",
            "score": 2,
            "text": "This really doesn’t mean anything because there is no comparison with other ethnic groups. Is 43% a lot, I don’t know, there is nothing to compare it to.",
            "title_similarity": "0.43918693",
            "sentiment_compound": -0.296
        },
        {
            "id": "hjp03pe",
            "score": 1,
            "text": "How about an article with real science in it?",
            "title_similarity": "0.18355803",
            "sentiment_compound": 0.0
        },
        {
            "id": "hjp8kxw",
            "score": 1,
            "text": "I would be interested in a follow up survey of their parents view on race, meritocracy, pulling yourself up by your bootstraps, getting ahead through hard work etc. I recognize this is a science sub and not a political sub but it there is a lot of overlap between social science, social policies, and the political views that drive social policy.",
            "title_similarity": "0.52495754",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hoet5or",
            "score": 1,
            "text": "The statement that roughly three quarters would have been rejected is wildly untrue and shows such a complete lack of understanding about college admissions that it boggles the mind.",
            "title_similarity": "0.517694",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hq989cx",
            "score": 1,
            "text": "Goes to show you how much Americans really care about education, academia, and building well rounded individuals. This is why the US is so far behind foreign countries in education; we’re too busy prioritizing stupid athletics, making money, and catering to wealthy alumni’s kids",
            "title_similarity": "0.5462849",
            "sentiment_compound": 0.5709
        }
    ]
}