{
    "Both moderate and strenuous exercise alleviate symptoms of anxiety, even when the disorder is chronic.\n": [
        {
            "id": "hjzzceo",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.38860238",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hk0q1rw",
            "score": -2,
            "text": "[deleted]",
            "title_similarity": "0.14238232"
        },
        {
            "id": "hk0qdsp",
            "score": 1,
            "text": "OK, now this is a prime example of one of those things which gets a new study every few years, only to contradict the previous study.  I do recall there being stories about how exercise could help reduce depression symptoms, but I then recall seeing another study which I'm sure said that it actually did *not* help at all.  I wish I could find that particular one.",
            "title_similarity": "0.44582877",
            "sentiment_compound": 0.3534
        },
        {
            "id": "hk0o3zg",
            "score": 12,
            "text": "Exercise helps me zero percent.",
            "title_similarity": "0.49237657",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hk1y89v",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.14796048"
        },
        {
            "id": "hk0x6zl",
            "score": 7,
            "text": "We get it! I have only been told this by every therapist and psychiatrist I have been to since the 90s.",
            "title_similarity": "0.11619898",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk0meog",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.14796048"
        },
        {
            "id": "hk0p62g",
            "score": 6,
            "text": "1 rep of bench press and I can feel the stress and anxiety exiting my body. It's amazing.",
            "title_similarity": "0.6589601",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hk1el99",
            "score": 0,
            "text": "Who would've thought not sitting and laying down all day helps.",
            "title_similarity": "0.41800225",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hk0x7ic",
            "score": 3,
            "text": "I (61f) believe this 100%.\nI work in my yard a lot. \nRaking, picking up limbs, weedeating, watering. I feel as if I don't have a care in the world when I'm outside working. It's the best anti depressant and it's free!",
            "title_similarity": "0.44922742",
            "sentiment_compound": 0.3103
        },
        {
            "id": "hk0wbjw",
            "score": -2,
            "text": "I don’t need to read a study. I have empirical personal evidence that this is true.",
            "title_similarity": "0.36699095",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hk131h2",
            "score": 0,
            "text": "Enter chronic cardiac arrhythmia induced anxiety",
            "title_similarity": "0.44890064",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hk15fyr",
            "score": 1,
            "text": "This isn't news for people with anxiety.",
            "title_similarity": "0.32487535",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hk15oek",
            "score": -1,
            "text": "In my personal experience, exercise with a decently high heart rate caused panic attacks and most definitely did not help. I can only manage mellow yoga and walking.",
            "title_similarity": "0.5897089",
            "sentiment_compound": -0.0683
        },
        {
            "id": "hk0b4n3",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "0.14796048"
        },
        {
            "id": "hk0051t",
            "score": 185,
            "text": "[removed]",
            "title_similarity": "0.14796048"
        },
        {
            "id": "hk10mu0",
            "score": 1,
            "text": "This has been known for quite some time. The issue is getting those people with it to actually start doing it on a regular basis.",
            "title_similarity": "0.4295079",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk1d2bw",
            "score": -2,
            "text": "Thats why i jack off atleqat once an hour throughout the day",
            "title_similarity": "0.2384003",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk1zto2",
            "score": 1,
            "text": "Too bad exercising outside and thevgym gives me anxiety :/\n\nOh well, at least they cancel each other out somewhat.",
            "title_similarity": "0.5509093",
            "sentiment_compound": -0.7579
        },
        {
            "id": "hk1lpzw",
            "score": 0,
            "text": "I exercise, that means i’m cool. You know how cool I am? Let me tell you about this injury i got. What? No one asked? Not possible. Everyone wants to know what I do.",
            "title_similarity": "0.51823556",
            "sentiment_compound": -0.3378
        },
        {
            "id": "hk10465",
            "score": 4,
            "text": "Well that explains why nobody in the military has anxiety disorders!",
            "title_similarity": "0.32340628",
            "sentiment_compound": 0.1759
        },
        {
            "id": "hk0tis9",
            "score": 2,
            "text": "Here for the comments",
            "title_similarity": "0.24376884",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk0wlx3",
            "score": 2,
            "text": " Running has been my antidepressant for many years! I enjoy lifting and biking and rowing as well, but something about running resets me in every possible way, like meditation.",
            "title_similarity": "0.5562744",
            "sentiment_compound": 0.7345
        },
        {
            "id": "hk14lus",
            "score": 2,
            "text": "I don’t know about moderate, but when I feel that anxiety boiling towards an attack really strenuous  cardio exercise does the trick for me. \n\nYou can’t run a 5K at a full out sprint (basically collapsing at the end) and still be anxious, it’s just not possible. Push hard enough and it always works, imo.",
            "title_similarity": "0.53798735",
            "sentiment_compound": -0.8848
        },
        {
            "id": "hk1j8bq",
            "score": 2,
            "text": "NOOOOOOOOOOOO WONG. Correlation ≠ Causation\n\nONLY WEED CAN HELP.  JUST LEGALIZE IT ALREADY.",
            "title_similarity": "0.38217443",
            "sentiment_compound": 0.5319
        },
        {
            "id": "hk10hu2",
            "score": 16,
            "text": "The thing is many people simply won't do it. Better diet and exercise is usually the right answer to help with many MANY things and should be the first thing to try when one is having physical or mental health struggles before moving towards medication and such... but a very large number of people simply refuse to make the change, unfortunately.\n\nFrom my experience, I was in constant physical pain from back trouble, heartburn and headaches. I was overweight, depressed and hermitting. I did nothing but work, sit in my bed on the computer and eat for about 4 years. I was completely miserable and felt hopeless.  About 8 years ago I changed my diet to something intelligent and I exercise daily. I never have aches and pains, I very rarely feel depressed of anxious and my self confidence is now very healthy. 10/10 would recommend!",
            "title_similarity": "0.4021709",
            "sentiment_compound": -0.9415
        },
        {
            "id": "hk0ubeh",
            "score": 10,
            "text": "Anxious and depressed?\n\nGo to a rave!\n\nThe dancing fixes the anxiety and the drugs fix the depression!",
            "title_similarity": "0.43817753",
            "sentiment_compound": -0.8829
        },
        {
            "id": "hk1ar6k",
            "score": 1,
            "text": "Did not work for me, but thats because my anxiety is driven by existential dread, and theres no overcoming that.",
            "title_similarity": "0.44486138",
            "sentiment_compound": -0.8338
        },
        {
            "id": "hk1gl8u",
            "score": 1,
            "text": "So does smoking a small joint",
            "title_similarity": "0.2756888",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk1n5ab",
            "score": 1,
            "text": "No one tell this to wowthanksimcured they really not like hearing about this there.",
            "title_similarity": "0.23893271",
            "sentiment_compound": -0.5556
        },
        {
            "id": "hk13er9",
            "score": 4,
            "text": "Can not confirm, before i run i am anxious, after i run i am tired and anxious.",
            "title_similarity": "0.48984718",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hk0urd7",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.14796048"
        },
        {
            "id": "hk150kq",
            "score": 2,
            "text": "I know exercise is my best weapon against depression and anxiety, but it’s the one thing my depression and anxiety stop me from doing. Drives me crazy.",
            "title_similarity": "0.63209605",
            "sentiment_compound": -0.9287
        },
        {
            "id": "hk0v3wy",
            "score": 20,
            "text": "Is that why it seems depression is more prevalent today? Because as a whole we don't get enough exercise? (US)",
            "title_similarity": "0.51669735",
            "sentiment_compound": -0.6199
        },
        {
            "id": "hk16wta",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "0.14796048"
        },
        {
            "id": "hk16crl",
            "score": 1,
            "text": "Even helps trying to kick meds",
            "title_similarity": "0.6477815",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hk19tpr",
            "score": 7,
            "text": "It doesn't seem to do a damn thing for me. I've tried CBT DBT. nothing seems to work but good old benzos and I get so few of those that I have to save them for emergencies.\n\nI walk and exercise every damn day. Anxiety just gets worse and worse.",
            "title_similarity": "0.43765736",
            "sentiment_compound": -0.765
        },
        {
            "id": "hk0iu5v",
            "score": 125,
            "text": "Yes exercise helps.. For me the problem is that anxiety makes going to the gym near impossible. Then I decide to workout at home, fine for 2 days and then my mind makes that a mountain too and I don't do it.\n\nMental illness for me is not about doing what I know is right.. It is illogical and stops me from doing what's right. It is a mental illness, there is something actually wrong with me and I actually need medicine.. Telling me to go for jogs to feel better simply is not helpful.",
            "title_similarity": "0.37957206",
            "sentiment_compound": -0.7033
        },
        {
            "id": "hk0w0pg",
            "score": 0,
            "text": "I read this as elevate at first.",
            "title_similarity": "0.2693193",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk0xv58",
            "score": -5,
            "text": "Exercise is good but anxiety is related to a D3 deficiency. (D3 deficiency is at epidemic levels in this country) I heartily recommend a powerful supplement.",
            "title_similarity": "0.70438445",
            "sentiment_compound": 0.7814
        },
        {
            "id": "hk12uy9",
            "score": 0,
            "text": "Absolute best way for me to calm down before a date is to spend an hour in the gym and then showering",
            "title_similarity": "0.24051097",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hk14lmm",
            "score": 0,
            "text": "I played hockey once a week since I was probably 10 or 12. My wife is a nurse, so I don't play in a league for thr past 2 seasons. The amount of clarity I feel the next day after working my ass off in a game is a breath of fresh air.",
            "title_similarity": "0.20970735",
            "sentiment_compound": 0.1532
        },
        {
            "id": "hk18hfl",
            "score": 0,
            "text": "It's true. I get to use up my nervous energy elsewhere, so I'm not as likely to freak out over nothing.",
            "title_similarity": "0.7011134",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hk18znn",
            "score": 0,
            "text": "I started going on long walks a couple weeks ago. I haven’t been able to properly motivate myself to exercise for years. Struggled with anxiety and depression. It’s been a really nice albeit minor reprieve. Of course it’s not fixing everything, but it feels good to be able to motivate myself to do it, and it feels good to do it as well.",
            "title_similarity": "0.53615075",
            "sentiment_compound": 0.9216
        },
        {
            "id": "hk191xy",
            "score": 0,
            "text": "I played basketball today because I was stressed about an empirical project for one of my classes. Still stressed but man, I missed every shot I took pretty much",
            "title_similarity": "0.30726516",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hk19k1d",
            "score": 0,
            "text": "Obviously, I've always said we are physical before thought. Can't just neglect the body.",
            "title_similarity": "0.32625505",
            "sentiment_compound": 0.357
        },
        {
            "id": "hk1agkq",
            "score": 0,
            "text": "Going to the gym vs. not going to the gym can change my entire evening. I always feel better when I do and I make better choices and get better sleep.",
            "title_similarity": "0.51653594",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hk1aytj",
            "score": 0,
            "text": "Is some labor the answer to all my problems?",
            "title_similarity": "0.37032795",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hk1b18a",
            "score": 0,
            "text": "Playing basketball is my therapy",
            "title_similarity": "0.30163717",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hk1d5lr",
            "score": 0,
            "text": "I’ve been doing yoga almost every day for three weeks on the grounds that eventually I’ll feel better",
            "title_similarity": "0.30691612",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk1dtem",
            "score": 0,
            "text": "I was really hoping for mild to be in this",
            "title_similarity": "0.4457488",
            "sentiment_compound": 0.4754
        },
        {
            "id": "hk1gtyc",
            "score": 0,
            "text": "I can relate to this. When Im home not finding nothing to do . We all have a wife that has a list ready for you. I instead go rebel mode and go for a walk then come back and work on the house.",
            "title_similarity": "0.28829",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hk1h88y",
            "score": 0,
            "text": "I know for a fact that this is true in my case... But I still can't force myself to actually exercise.",
            "title_similarity": "0.5062989",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hk1h9d0",
            "score": 0,
            "text": "I legit feel like I'm on a small amount of a dopamine drug after a good workout. It really almost always helps me mood and lessens anxiety quite a bit.",
            "title_similarity": "0.7885462",
            "sentiment_compound": 0.7419
        },
        {
            "id": "hk1hlim",
            "score": 0,
            "text": "I started jogging to overcome anxiety long time ago. I went jigging every day for 3-5km routes. It's not long but at some point if I don't go for one day i felt terrible. Good times",
            "title_similarity": "0.40028495",
            "sentiment_compound": -0.1655
        },
        {
            "id": "hk1hsh6",
            "score": 0,
            "text": "Yeah, one of my finest tools in my Arsenal during medical school. Exercise daily for up to 30 minutes and after a month you’ll become invincible!",
            "title_similarity": "0.3015518",
            "sentiment_compound": 0.69
        },
        {
            "id": "hk1itwt",
            "score": 0,
            "text": "I definitely experienced this as helpful. But how do i overcome that initial hurdle? Its always the first leap for me",
            "title_similarity": "0.5100771",
            "sentiment_compound": 0.4118
        },
        {
            "id": "hk1jw9z",
            "score": 0,
            "text": "Hard part is always getting started isn't it? Spent some time gardening, always need to do more hehe",
            "title_similarity": "0.32873803",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hk1kjee",
            "score": 0,
            "text": "People don't want to hear it but this is resoundingly true.",
            "title_similarity": "0.53089637",
            "sentiment_compound": 0.5557
        },
        {
            "id": "hk1kp50",
            "score": 0,
            "text": "I've been exercising in some or another my whole life, so it might have helped (almost) stopping my anxiety. The one thing that really helped was quitting cafeinne tho.",
            "title_similarity": "0.52451986",
            "sentiment_compound": -0.1885
        },
        {
            "id": "hk1kptn",
            "score": 0,
            "text": "I’ve never gone to a gym because the thought of people looking at me is so scary. I also don’t go outside because of my anxiety. So no exercise for me.",
            "title_similarity": "0.15753856",
            "sentiment_compound": -0.8263
        },
        {
            "id": "hk1lbxx",
            "score": 0,
            "text": "I play amateur League basketball. \nI am generally an anxious person with sporadic panic attacks. Whenever I have a basketball match, I forget all my problems, my anxiety vanishes, I become a totally different person.\nTo everyone, pick up hobbies, activities, exercise, whatever you like, you have no idea how much it helps.",
            "title_similarity": "0.38213733",
            "sentiment_compound": -0.802
        },
        {
            "id": "hk1lcxx",
            "score": 0,
            "text": "Started walking during the pandemic, it's become one of my favorite things to do now. Clears the mind and gets some steps in. An hour + hill is ideal, and it's really fun with a friend. Easy on joints too.",
            "title_similarity": "0.62029773",
            "sentiment_compound": 0.9468
        },
        {
            "id": "hk1mpda",
            "score": 0,
            "text": "Exercise is a decent brain chemical supplement of serotonin and dopamine that anxiety was leeching from",
            "title_similarity": "0.75463015",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hk1nmi1",
            "score": 0,
            "text": "My thing with the gym is the getting dressed and going there, not the working out and then followed by leaving",
            "title_similarity": "0.27502537",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk1oadt",
            "score": 0,
            "text": "Walking has genuinely been the greatest thing for my anxiety ever.",
            "title_similarity": "0.57160103",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hk1ov9h",
            "score": 0,
            "text": "People say you need to get your mind in the right state before you can do these things. It’s more a case of getting your body to kickstart things and allowing the mind to follow otherwise you’ll always be waiting. I say this from my own experience over lockdown. Like I enjoy my own company but lockdowns exacerbated that feeling of impending doom and isolation waaaay too much.",
            "title_similarity": "0.51331985",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hk1oys6",
            "score": 0,
            "text": "Strenuous exercise definitely \"helps\" me. In the sense that after an hour of focus on lifting and a 30mins stair master makes me so drained and tired I forget about all my worries.",
            "title_similarity": "0.56922954",
            "sentiment_compound": -0.7008
        },
        {
            "id": "hk1pusu",
            "score": 0,
            "text": "I could have told you that, based on my 1 data point of anecdotal evidence from myself",
            "title_similarity": "0.29922864",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk1r6sc",
            "score": 0,
            "text": "Wait, you're telling me tiring your body out so it doesn't have the energy to worry about things reduces your body's ability to worry about things? Incredible.",
            "title_similarity": "0.46438727",
            "sentiment_compound": -0.6501
        },
        {
            "id": "hk1r809",
            "score": 0,
            "text": "I do yoga (power yoga specifically) and its a wonderful form of light exercise - gentle cardio, strength, mobility and core. For the guys out there I recommend Sean Vigue Fitness on YouTube, Breathe and Flow, and Man Flow Yoga!",
            "title_similarity": "0.5106349",
            "sentiment_compound": 0.9286
        },
        {
            "id": "hk1ru5p",
            "score": 0,
            "text": "Ah this was on the news here even",
            "title_similarity": "0.21539529",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk1s3j9",
            "score": 0,
            "text": "I try to get an hour of solid exercise in at least five days a week. The feel good energy lasts throughout the day. You never regret any time spent working out",
            "title_similarity": "0.40515602",
            "sentiment_compound": 0.7865
        },
        {
            "id": "hk1sr0w",
            "score": 0,
            "text": "News flash! Exercise is, in fact, good for you",
            "title_similarity": "0.61002684",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hk1swuv",
            "score": 0,
            "text": "That's a yes from this guy.",
            "title_similarity": "0.3212021",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hk1tser",
            "score": 0,
            "text": "I got in the best shape during lockdown because there was nothing else to do and I still had my gym equipments. Of course it won’t get rid of anxiety completely especially if you have it for a long time but it does feel liberating and I always get a lot of new, creative ideas from all the Adrenalin rush, especially with some caffein in me while working out.",
            "title_similarity": "0.6288335",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hk1twl8",
            "score": 0,
            "text": "Dog walking is amazing therapy on the cheap!",
            "title_similarity": "0.5331367",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hk1u9mn",
            "score": 0,
            "text": "so what do i do when my anxious and depressed and adhd ass cant",
            "title_similarity": "0.45337856",
            "sentiment_compound": -0.8316
        },
        {
            "id": "hk1v203",
            "score": 0,
            "text": "And that’s why I love skateboarding. Any activity that requires focus and letting go of fears and clearing your mind helps so much",
            "title_similarity": "0.6439804",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hk1v5dc",
            "score": 0,
            "text": "Being someone who has non-stop anxiety I have always noticed, I am at my most comfortable/relaxed after a good run, or bicycle ride.",
            "title_similarity": "0.6584848",
            "sentiment_compound": 0.296
        },
        {
            "id": "hk1vl1c",
            "score": 0,
            "text": "This is the silver lining to my anxiety. I attribute my healthy lifestyle (no drink, no drugs, lots of strength &cardio exercise, clean diet) to my anxiety. The motivation for following a path of healthy living was precisely to reduce anxiety. \n\nI don't know what the state of my health would be now without anxiety.",
            "title_similarity": "0.60760534",
            "sentiment_compound": 0.8367
        },
        {
            "id": "hk1vpuz",
            "score": 0,
            "text": "I was really fit, running every other day with actual muscle mass and confidence. Before this I was an anxious kid that could barely change a trash can infront of my gas station trainer... It makes SUCH a difference. You follow a healthy diet, workout plan, and lay off porn and I guarantee you that your confidence levels will spike and many of your mental issues will subside. Just don't let work take you away from this lifestyle like it did me. I've just give up at this point. I got no choice but to pay bills.",
            "title_similarity": "0.5104256",
            "sentiment_compound": 0.6805
        },
        {
            "id": "hk1x69g",
            "score": 0,
            "text": "Battling anxiety isn't so much learning what to do, most people already know - but how to get to do it.",
            "title_similarity": "0.52493435",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hk1ylo5",
            "score": -4,
            "text": "This is misleading as all the research into excercise is and it's counter productive. The group of people who would benefit from excercise because they do not currently excercuse are disproportionately likely to not receive the associated neurotransmitter boost from excercise. There is some evidence that the mental benefits of excercis3 are the same as doing any activity you enjoy and not an excercise specific response. In trying to motivate this group by saying you will enjoy it, they will feel offcut, forlorn and down about themselves when it doesn't work for them. Then, they'll likely throw excercise out the window and lost the actual universal benefits for their physical health.",
            "title_similarity": "0.58308136",
            "sentiment_compound": 0.9313
        },
        {
            "id": "hk1yq3i",
            "score": 0,
            "text": "The brain needs challenging.",
            "title_similarity": "0.39035505",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hk1z24r",
            "score": 0,
            "text": "Thinking back this explains why my anxiety got worse after i stopped doing football (soccer for the US) in middle school.",
            "title_similarity": "0.29575813",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hk1zuer",
            "score": 0,
            "text": "Thats why every psychologist has recommended it ey? Well back to my psychiatrist for drugs. No more benzo's? Alcohol then, the circle of therapy.",
            "title_similarity": "0.27464002",
            "sentiment_compound": 0.264
        },
        {
            "id": "hk20omv",
            "score": 0,
            "text": "Take care of the body and the mind will follow.",
            "title_similarity": "0.37165257",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hk20s0f",
            "score": 0,
            "text": "Now I'm anxious about how I should exercise!",
            "title_similarity": "0.32371747",
            "sentiment_compound": -0.3164
        },
        {
            "id": "hk2240d",
            "score": 0,
            "text": "Swimming helps my anxiety a lot.",
            "title_similarity": "0.72340196",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hk23ol1",
            "score": 0,
            "text": "Naw that's okay, I just take magic mushrooms I bought on the internet!",
            "title_similarity": "0.15059268",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hk242ml",
            "score": 0,
            "text": "Until you hurt yourself and get anxious about the pain lasting longer than you think it should.",
            "title_similarity": "0.5211921",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hk260if",
            "score": 0,
            "text": "can't be nervous if you are exhausted",
            "title_similarity": "0.5841092",
            "sentiment_compound": -0.1744
        },
        {
            "id": "hk289x8",
            "score": 0,
            "text": "Have fun convincing Reddit that exercising is good for you",
            "title_similarity": "0.60481656",
            "sentiment_compound": 0.836
        },
        {
            "id": "hk28dkh",
            "score": 0,
            "text": "Figured this out 15 years ago.",
            "title_similarity": "0.0108970255",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk28l1r",
            "score": 0,
            "text": "Exercise works very well to control anxiety, it’s been proven over and over in many studies. Yet Americans run to the pharmacy rather than go for a run. So we are anxious, fat out of shape and pop way too many pills when the fix is as simple as going for a mile run.\nFor myself all I need is about a half mile but I must get my heart beating about 15 minutes total.",
            "title_similarity": "0.46737516",
            "sentiment_compound": 0.3642
        },
        {
            "id": "hk2997z",
            "score": 0,
            "text": "Yes! My partner and I start the day by going to the gym. We've taken personal notes on the effects it has had on our mental clarity, anxiety, and mood. Physical activity releases brain chemicals that literally do make us happier, and over time, if we make activity a habit, our bodies will start to crave those chemicals and reinforce the habit (and the consequential physical and mental benefits).",
            "title_similarity": "0.58926475",
            "sentiment_compound": 0.8748
        },
        {
            "id": "hk2b9wh",
            "score": 0,
            "text": "Too tired to feel anxious",
            "title_similarity": "0.49879044",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hk2bibb",
            "score": 0,
            "text": "I started noticing this during my divorce. I started exercising and feeling pretty decent. When I stopped, that's when I noticed there was a change in my anxiety levels.",
            "title_similarity": "0.6161811",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hk2bkrf",
            "score": 0,
            "text": "I literally and figuratively run for my life ❤️",
            "title_similarity": "0.19041562",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2bl37",
            "score": 0,
            "text": "Yea, this is real, but at least for me, when things were at their worst for me, exercise is not enough.",
            "title_similarity": "0.6609237",
            "sentiment_compound": -0.7684
        },
        {
            "id": "hk2d7j9",
            "score": 0,
            "text": "I can approve. Working construction, I feel anxious to coordinate with other contractors first thing in the morning but if I can get a little work done first I feel fine to handle my day.",
            "title_similarity": "0.46760085",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hk2dw73",
            "score": 0,
            "text": "Thought about this yesterday. I used to workout a ton (legit 6-7 times a week, even ran a marathon) but got really lazy the last few years, gained some weight and my anxiety got a lot worse. I started going back to the gym and my headspace is like night and day. Whether it's the exercise itself, the feeling that I'm back on track, or whatever - it's worth it.",
            "title_similarity": "0.41927034",
            "sentiment_compound": -0.036
        },
        {
            "id": "hk2efhn",
            "score": 0,
            "text": "Honestly, I don't how else I would cope my anxiety, depression and melancholy if it wasn't for working out. Best coping mechanism i have.  However, my irritability when I can't train is problematic, but I will take that over the other.",
            "title_similarity": "0.6476621",
            "sentiment_compound": -0.0121
        },
        {
            "id": "hk2hhoz",
            "score": 0,
            "text": "Definitely didn't work for me in high school when I ran 3-6 miles a day. Exercise was a distraction, but it never changed the core issue. My symptoms did not alleviate until I finally got on medication in college. Changed my life for the better. I'm so much happier now and no longer experience the mood swings anxiety gave me.",
            "title_similarity": "0.44324458",
            "sentiment_compound": 0.7242
        },
        {
            "id": "hk2j7tv",
            "score": 0,
            "text": "When I first began to have panic attacks, my psych doc said to \"walk, just walk.\" If you're at home, walk around the house, or down the street. If you're at work, walk around the building. Walking will help burn off the adrenaline and give you some relief. It has worked amazingly well for me. I also use a \"naming\" exercise to ground me back to the Present. If I'm feeling overwhelmed, I just start naming everything in sight... tree, bird, house, lantern, dog... on and on until I feel better. Bless anyone who's dealing with it because #AnxietySucks!",
            "title_similarity": "0.50888395",
            "sentiment_compound": 0.8264
        },
        {
            "id": "hk2jbje",
            "score": 0,
            "text": "This is surfing for me. I’ve always hated the gym but I started surfing about 2 years ago and it completely changed my life. It’s hard and is very physically demanding. So that’s my gym now",
            "title_similarity": "0.24464513",
            "sentiment_compound": -0.7156
        },
        {
            "id": "hk2kkx3",
            "score": 0,
            "text": "The absolute best medicine is Vitamine E.\n\nEXERCISE.",
            "title_similarity": "0.5771977",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hk2l33y",
            "score": 0,
            "text": "The absolute worst think I can do when my anxiety is bad is lay on the couch all day…. Thats why hangovers are killer l. They ramp up my anxiety and make it difficult to get of the couch all day on a Sunday.",
            "title_similarity": "0.36625153",
            "sentiment_compound": -0.9501
        },
        {
            "id": "hk2njhm",
            "score": 0,
            "text": "Oh is that what we're doing now? We're fighting?",
            "title_similarity": "0.26527506",
            "sentiment_compound": -0.4329
        },
        {
            "id": "hk2odn1",
            "score": 0,
            "text": "This is why I love biking twice a week. It helps so much.",
            "title_similarity": "0.51636016",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hk2ptom",
            "score": 0,
            "text": "Shocked. Shocked, I say.",
            "title_similarity": "0.23700146",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hk2sp1x",
            "score": 0,
            "text": "Damn it, so your telling me there nothing that can be done",
            "title_similarity": "0.16205823",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hk2sx3z",
            "score": 0,
            "text": "Wild, it’s almost like we’ve known this forever.",
            "title_similarity": "0.2676997",
            "sentiment_compound": 0.2975
        },
        {
            "id": "hk2u18n",
            "score": 0,
            "text": "I have to workout almost everyday. I’m 40 and have been working out daily for twenty years. I’m sure it’s saved my life and made it better overall. It’s just a part of my routine, like brushing my teeth.",
            "title_similarity": "0.36558652",
            "sentiment_compound": 0.8591
        },
        {
            "id": "hk2vigr",
            "score": 0,
            "text": "Man, this is the worst vicious cycle: the less I exercise, the worse my mental health gets. The worse my mental health, the less I exercise.",
            "title_similarity": "0.40877116",
            "sentiment_compound": -0.9153
        },
        {
            "id": "hk2yy35",
            "score": 0,
            "text": "That would explain why hikers seem so level-headed...",
            "title_similarity": "0.4764353",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk30fw6",
            "score": 0,
            "text": "This is so understated, but seriously, regular exercise changes everything. I went from having crippling social anxiety to being able to have normal conversation with strangers all by working out. I wouldn’t have had the courage to try if I didn’t feel so different after working out, but it got to the point where if I didn’t work out, I literally felt that. It made me feel objectively worse. It’s definitely a part of mental health that needs to be talked about more, because while some people need to be on medication for their mental health issues, this isn’t always the right answer for everyone, and holistic approaches like this have been proven to work so I’d like to see more focus on total body/mind rehabilitative therapy rather than just focusing on the mental aspects 100% of the time.\n\nGoing to just state this again and even more clearly, I don’t intend this to mean that nobody needs drugs for mental health problems - that’s a foolish position to take and ignores the suffering of tons of people, even athletes can have mental health issues and they do work out regularly. I just think that having a healthy outlet is good for everyone, and that introducing physical, body-positive exercises and having that coincide with traditional therapy would be beneficial to a lot of people who suffer from anxiety and/or depression, and in the world of mental health, every little bit of progress counts.",
            "title_similarity": "0.6293675",
            "sentiment_compound": 0.2061
        },
        {
            "id": "hk31nmf",
            "score": 0,
            "text": "Oh man. Twitter won’t like this.",
            "title_similarity": "0.2604015",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hk32clh",
            "score": 0,
            "text": "I can attest this is accurate",
            "title_similarity": "0.4928538",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk32ddj",
            "score": 0,
            "text": "I can honestly say that going to the gym or even running at a local park has helped me with day to day life. I feel soooo much better after and I can tell if I skip a few days!",
            "title_similarity": "0.4869212",
            "sentiment_compound": 0.7345
        },
        {
            "id": "hk32kzr",
            "score": 0,
            "text": "This is why at 30 I still skateboard.\n\nTrapped in the house with 3 kids? Skateboard\nCar broke down and no money for repairs? Skateboard\nSnapped my skateboard in half? Skateboard",
            "title_similarity": "0.052132793",
            "sentiment_compound": -0.8377
        },
        {
            "id": "hk34g22",
            "score": 0,
            "text": "only thing that works for me, lift heavy, intense cardio, 30min in hot sauna 5 times a week keeps my anxiety relativaly well under control",
            "title_similarity": "0.4693936",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hk387mh",
            "score": 0,
            "text": "A truer thing has never been said.. coming off a extremely painful breakup the only thing keeping me going is going to the gym.",
            "title_similarity": "0.35792115",
            "sentiment_compound": -0.1761
        },
        {
            "id": "hk39k26",
            "score": 0,
            "text": "Helps the most for me personally if the exercise also carries a little bit of risk, or is exhilarating. I know that’s not the case for everyone, but I’ve never been as calm as I am after rock climbing or pushing myself on skies or cliff diving. Doesn’t have to be crazy dangerous just a little bit past your comfort zone whatever that may be. Conquering that fear makes everything else seem easier to face",
            "title_similarity": "0.7124795",
            "sentiment_compound": -0.6554
        },
        {
            "id": "hk3a3ba",
            "score": 0,
            "text": "The runner high is real. I swim, so I also get the swimmer high.",
            "title_similarity": "0.39897817",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3bmgt",
            "score": 0,
            "text": "I go for a nice longboard ride almost everyday gets me out of my headspace too many racing/intrusive thoughts, stick on spotify and skate. Helps for a bit. \n\nNow that its getting colder/closer to winter im gonna have to figure out something else.",
            "title_similarity": "0.52149165",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hk3c1qx",
            "score": 0,
            "text": "I was going to gym for 3 months, but my anxiety was still the same, idk why",
            "title_similarity": "0.35725346",
            "sentiment_compound": -0.3919
        },
        {
            "id": "hk3dyfy",
            "score": 0,
            "text": "Now how do I get rid of laziness",
            "title_similarity": "0.35496542",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk3m1nv",
            "score": 0,
            "text": "I've recently taken up golfing, and have noticed that I seem to be in a much better mood whenever I finish a round.",
            "title_similarity": "0.43685454",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk3mqr0",
            "score": 0,
            "text": "Imagine making fun of your boomer parents your whole life, who kept telling you to stop playing video games and go outside.\n\nAnd maybe, just maybe, exercise and sunshine could be good for you.",
            "title_similarity": "0.3123924",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hk3o5sj",
            "score": 0,
            "text": "Keep on a moving folks! All movement is progress.",
            "title_similarity": "0.4029212",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hk3oykv",
            "score": 0,
            "text": "Thanks for the breakthrough.",
            "title_similarity": "0.49587852",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk3zp89",
            "score": 0,
            "text": "It definitely helps. A long walk/hike used to relieve my very bad anxieties for the rest of the day the longer the better actually, come in a moderately bad COVID infection last year and my anxieties worsened, exercise still helps but not as much and too much exercise can actually be detrimental as it brings in a sort of hyped heightened state.",
            "title_similarity": "0.66555774",
            "sentiment_compound": -0.0479
        },
        {
            "id": "hk4hyok",
            "score": 0,
            "text": "One of my major anxiety symptoms is shortness of breath. I was also tasked with exercise by my psychologist. End up fainting several times while exercising instead.",
            "title_similarity": "0.5391273",
            "sentiment_compound": -0.2484
        },
        {
            "id": "hk0zwxh",
            "score": 15,
            "text": "Okay, but what alleviates the symptoms of moderate and strenuous exercise?  i.e. feeling like death.",
            "title_similarity": "0.6965034",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hk0z00a",
            "score": 143,
            "text": "[removed]",
            "title_similarity": "0.1479605"
        },
        {
            "id": "hk1enst",
            "score": 9,
            "text": "I don't fully understand this. I have severe anxiety and have used occupational therapists in the past to confront my extreme panic when exercising in public.\n\n Physical exertion mimics the symptoms of panic attacks that I try so hard to avoid, so it's hard to push through to find the benefits when they feel like negatives..",
            "title_similarity": "0.53453934",
            "sentiment_compound": -0.9287
        },
        {
            "id": "hk253aw",
            "score": 5,
            "text": "\"for some people\" fixed it for you",
            "title_similarity": "0.42223904",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk0268m",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.14796048"
        },
        {
            "id": "hk0uxsm",
            "score": 26,
            "text": "I believe that the benefits can also be found in physical activity other than your standard cardio and weights.  What I mean by that is that having a job that incorporates exercise or any decent amount of physical movement.  For example, a job that involves walking/lifting versus a desk job.  My anxiety is reduced by the simple act of not sitting.  You can add a gym lifestyle to that to reap even more benefits.",
            "title_similarity": "0.66193575",
            "sentiment_compound": 0.5849
        },
        {
            "id": "hk1e4mv",
            "score": 12,
            "text": "[removed]",
            "title_similarity": "0.14796048"
        },
        {
            "id": "hk10m91",
            "score": 6,
            "text": "I wonder why that doesn't work for me. I'm a semi pro athlete.",
            "title_similarity": "0.38609746",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk0xbk5",
            "score": 1,
            "text": "Ill push harder and harder then.",
            "title_similarity": "0.31962538",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hk117ge",
            "score": 1,
            "text": "I confirm this. If I don't weight train with cardio at least 3 times a week I get more anxious and a bit more depressed",
            "title_similarity": "0.3818801",
            "sentiment_compound": -0.7083
        },
        {
            "id": "hk129dx",
            "score": 1,
            "text": "Fine fine! I will stop resisting and start exercising.",
            "title_similarity": "0.45474434",
            "sentiment_compound": 0.1759
        },
        {
            "id": "hk13i8n",
            "score": 1,
            "text": "I take a walk during my lunch break every day, rain or shine. Listen to a podcast and just get out of my head. I do not understand how people can sit at their desk all day long.",
            "title_similarity": "0.18482542",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk13shr",
            "score": 1,
            "text": "That’s the thing for me, I know this and have for a while. Every time I’ve exercised or gotten out into nature my mental state become so much better. Yet the issue for me when I do have some bad anxiety finding the motivation to get up and do those things is damn near impossible",
            "title_similarity": "0.6750978",
            "sentiment_compound": -0.323
        },
        {
            "id": "hk13wqs",
            "score": 1,
            "text": "You control your body with your mind\nAnd you control you mind with your body",
            "title_similarity": "0.3248382",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk16os9",
            "score": -1,
            "text": "Heavy except use decreases anxiety for me and I have been diagnosed with chronic anxiety.",
            "title_similarity": "0.7318328",
            "sentiment_compound": -0.34
        },
        {
            "id": "hk18w3v",
            "score": 1,
            "text": "I will second this. I think I interpret this as those with chronic conditions benefit from exercise. I have PPMS and feel best when on a nice walk around my block and feel better all day from it. Days I don’t I do not always feel so good.",
            "title_similarity": "0.7667279",
            "sentiment_compound": 0.9292
        },
        {
            "id": "hk1966r",
            "score": 1,
            "text": "I started walking to and from work all the time. Only about 35 mins. It’s true, I’ve been far less anxious. Interesting.",
            "title_similarity": "0.2972157",
            "sentiment_compound": 0.5446
        },
        {
            "id": "hk19fma",
            "score": 1,
            "text": "And I see this when I started the challenge of running around the block daily.",
            "title_similarity": "0.22357221",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hk19vg1",
            "score": 1,
            "text": "Then the medicine is worse than the disease.",
            "title_similarity": "0.49468768",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hk1a2qz",
            "score": 1,
            "text": "I have bad GAD. I take (non-benzo) medication for it which has helped tremendously, but not 100%. Exercise has been whats solved the problem of my lingering anxiety. Like yesterday, I started feeling that nervous (almost electric) tension in my chest, so i got down did pushups, lifted some weights, and then hopped on my stationary bike and went hard on that for 30 minutes just trying to put all my anxious energy into it. Anxiety completely gone afterwards and now today I feel great again. It's helped keep the rest of my anxiety (thats stuck around even with the meds) almost completely at bay. Its incredible.",
            "title_similarity": "0.6830481",
            "sentiment_compound": -0.5835
        },
        {
            "id": "hk1ek6e",
            "score": 1,
            "text": "It really doesn't for me, unless you can count \"alleviates symptoms\" as being \"anxiety lessens a bit within five minutes of starting and comes back twice as hard five minutes prior to stopping, and never goes back down.\"",
            "title_similarity": "0.505211",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hk1ga2n",
            "score": 1,
            "text": "I picked up jogging in college, and wow was it a game changer for my generalized anxiety disorder and self confidence. Of course it’s not a cure all. I remember vividly being so stressed out and overwhelmed with worry about my family, delayed grief, failure, my future, I was sobbing up a storm while running. But getting that jittery adrenaline from heightened anxiety out with an exhausting workout really tames the beast. Adding therapy and finding a solid support system with cardio and weightlifting is the real bread winner in all of it. Holding it all in and staying comatose, doing nothing, saying nothing, is what will eventually deteriorate who you are and leave you as an empty shell.\n\nEdit: also to add, quit or limit your drinking/drugs. When the depression starts kicking in, the crazy anxiety seeping it’s way, escaping it with chemicals will only make the pest into an uncontainable monster that will ruin you for days. When you sober up, the problems will still be there, and physiologically your brains Neural pathways will begin going haywire trying to stabilize. \n\nIf drinking has started to become a problem, and your life seems too hard to handle, you tried the meds, you’ve tried therapy, all with out helping, address the drinking. You can’t heal or improve your life until you’re sober (or limited). It started to became a problem for me after college, and eventually hangovers turned into violent, bodily seizure like panic attacks. Not only did I feel like I had no control over my anxiety, but then it felt like I had no control over my body responding to stress triggering panic attacks. I got help, real help that addressed all my problems, the drinking alone that started as a “mistake aid” to my mental health, and it was not effing easy. Quitting drinking, opening up old wounds I buried and tried to forget but subconsciously was always there, addressing them all while sober. No longer using a crutch or hiding from the pain, the ptsd. Addressing it all upfront and really processing. Only then was I able to start the healing process and grow as a person, really tackle the root of my anxiety and depression, even if it is in my genetics. It definitely got worse before it got better.\n\nI’ve accepted it’ll always be there, but it doesn’t have to be a beast to fear. For 6 months I did Individual cognitive behavioral therapy, and intensive outpatient sober women’s group therapy I started in February this year and it saved my life. I skipped out on plans, quit jobs even though I couldn’t afford to, fired from a job, my body literally eating away my muscles from malnutrition, poverty, broken up with, ruining friendships, scaring my family, drinking everyday to avoid people seeing me go through withdrawals.. if I kept running away from my problems I know my body wouldn’t be able to keep up anymore or I’d succumb to my worst scary thoughts of major depression. \n\nNow I don’t have any more panic attacks, rebuilding my friendships, held down a job full time, financially stable, family isn’t whispering worries about me behind my back, I’m HEALTHY with no more high blood pressure, I went for a sickly 127 lbs at 5’9 to 163 lbs of muscle not fat, ex and I found our way back to each other, and able to function and focus on my values and really start my pursuit of happiness. Depression and anxious thoughts are there, but not as debilitating and I remember the coping skills I learned in therapy and working on communicating me feelings better. It is possible. Life can get better. You just need to be honest with yourself and let go of the ego and take accountability of your actions. Learn to forgive yourself. That’s a hard one for me, but a crucial one to practice.\n\nSorry for the novel, but I thought it was important to add that bit about using chemicals. Exercise, therapy, moderated or no use of unhealthy chemicals, social support, meds if necessary, healthier diet all help. Follow the hierarchy of needs. Healthy body, healthy mind, happier you.",
            "title_similarity": "0.47717822",
            "sentiment_compound": -0.9978
        },
        {
            "id": "hk1gbt1",
            "score": 1,
            "text": "I started riding my new bike 3-4 days a week.  Sometimes for 20-30 min at lunch. The effect is remarkable. I cannot believe the difference anxiety is all but gone after living with the dark cloud of doom, I’m suddenly free. Highly recommended.",
            "title_similarity": "0.4067547",
            "sentiment_compound": 0.6694
        },
        {
            "id": "hk1h70f",
            "score": 1,
            "text": "does jerking off count",
            "title_similarity": "0.35300475",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk1hmti",
            "score": 1,
            "text": "What if anxiety is in some parts your body saying \"bro, i m too stiff and bored, let's do something, lift something\".. You know like a dog",
            "title_similarity": "0.4608774",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hk1i78r",
            "score": 1,
            "text": "I recommend everyone who is neurotic and up in their head most days to get a personal trainer at the gym to get started. Because if you have a brain that overthinks and its isolated with itself all day on headphones or maybe wfh or something like that, you will carry that over to the gym. Isolated headphones in your head... But now in the gym. This will also not let you push yourself harder because honestly most of us dont know what that means when done correctly. We tend to overtrain or undertrain and/or train in the wrong way. I most certainly did and would end up being sore and not want to go to the gym for another two days. \n\nGetting a trainer really helped me shut down my head voice for 2 hours.. And listening and talking to someone else and doing things in the gym that i wouldnt have considered to be 'working out'. And i would still have enough energy left post my workout and i can feel the difference with my body kinda opening up.\n\nFYI, i have a work from home situations so i am very isolated for 80% of the day",
            "title_similarity": "0.38967502",
            "sentiment_compound": 0.1207
        },
        {
            "id": "hk1iaak",
            "score": 1,
            "text": "One thing the pandemic made me realise is I'm going to die. It wasn't that apparent before. So I started running because it's the opposite of dead. And that made me stop smoking because breathing non-air seemed like a way to die. The anxiety and fears are still there, but at least I'm healthier and still alive.",
            "title_similarity": "0.49226767",
            "sentiment_compound": -0.6428
        },
        {
            "id": "hk1jpj1",
            "score": 1,
            "text": "Not with everyone......I work out hard every weekday and my anxiety is worse than ever these days..............",
            "title_similarity": "0.38729662",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hk1o4lv",
            "score": 1,
            "text": "Yeah it does help. Everytime my depression comes around I find myself going on walks a lot more. Luckily I have a graveyard behind my apartment which makes for good laps as I listen to something on my phone and maybe play a game. I also got an exercise bike but i find it tougher to motivate myself to do that when I'm down, though I did notice the effects afterwards the few times I did motivate myself",
            "title_similarity": "0.57353026",
            "sentiment_compound": 0.8909
        },
        {
            "id": "hk1ocfa",
            "score": 1,
            "text": "Right, except when you get anxious about being able to fit said exercise in your days.",
            "title_similarity": "0.5045856",
            "sentiment_compound": 0.128
        },
        {
            "id": "hk1oj0j",
            "score": 1,
            "text": "Funnily enough the opposite is true for me. Since I started getting panic attacks, any time my heart rate rises (for example if I try to run), I feel like I’m going to die - so I just stop. It sucks.",
            "title_similarity": "0.44858178",
            "sentiment_compound": -0.3947
        },
        {
            "id": "hk1pwcw",
            "score": 1,
            "text": "It's just too bad that I don't want to do either.",
            "title_similarity": "0.30100012",
            "sentiment_compound": -0.575
        },
        {
            "id": "hk1r4fw",
            "score": -1,
            "text": "but don't ever tell that to anxious people. They'll just say \"oH tHaNkS I'm CuReD\" as if you're an idiot when you never claimed it was an all out cure in the first place.",
            "title_similarity": "0.34614736",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hk1rn9x",
            "score": 1,
            "text": "I wish I could bring myself to do anything when anxiety strikes. My legs go soft, I can barely make myself food. All I can do is worry and google my imaginary symptoms. Walking does help a lot, but not if there are people around, and sadly I don't live near a forest anymore.",
            "title_similarity": "0.4604497",
            "sentiment_compound": -0.6187
        },
        {
            "id": "hk1t2er",
            "score": 1,
            "text": "The thought of exercise gives me anxiety.",
            "title_similarity": "0.5210942",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hk1tlev",
            "score": 1,
            "text": "It’s important to note that it only alleviates. It doesn’t cure or make it go away. I’m sick of my brother telling me I can cure my anxiety by working out more (and exasperating my body dysmorphia). Offer to go walking more, maybe ask if they want to go outside. But, don’t tell us we don’t need meds and can just magically walk out cured if we got in shape.",
            "title_similarity": "0.5349877",
            "sentiment_compound": -0.2382
        },
        {
            "id": "hk1tm2k",
            "score": 1,
            "text": "I can't leave my house without panic attacks but even when I just exercise in my room, it makes a difference. I can't imagine going to a gym but I can do resistance bands at home.",
            "title_similarity": "0.3319157",
            "sentiment_compound": 0.3875
        },
        {
            "id": "hk1v4ik",
            "score": 1,
            "text": "A few weeks ago, erected from an underlying disease, I felt very close to going into some serious depression. Nothing felt worth doing anymore and still don't, sometimes. The feeling of hopelessness and emptiness really took its toll on me.\n\nA day after the worse day, I decided to just get out and start running. I've been doing it every other day, and man... the barrier it eventually builds up against depressive, dark thoughts, is very real. **The exercise has completely saved me from a hellhole**.",
            "title_similarity": "0.528535",
            "sentiment_compound": -0.9446
        },
        {
            "id": "hk1v7y0",
            "score": 1,
            "text": "One of my biggest anxiety triggers is an elevated heart rate. Every time I workout I spend the rest of the evening having terrible anxiety.",
            "title_similarity": "0.45983756",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hk1vfdw",
            "score": 1,
            "text": "1 week from completing a couch to 5k program and I've developed plantar fasciitis.  Feels bad man.",
            "title_similarity": "0.20926735",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hk1vmm3",
            "score": 1,
            "text": "As someone that suffers fome this I can 100% confirm that it works.",
            "title_similarity": "0.5061277",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hk1xzik",
            "score": 1,
            "text": "When I go the gym I am anxious, nervous, unsure etc, don't really wanna make eye contact or engage with anyone. After I am sweating balls I just bounce around the place like I am king of the world.",
            "title_similarity": "0.3315296",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hk21cso",
            "score": 1,
            "text": "Work out 5-6 times a week, I'm still waiting.",
            "title_similarity": "0.16790065",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk24x7k",
            "score": -1,
            "text": "maybe its more like, you're chronically anxious because you dont exercise.  we're not designed to sit around in perfectly climate controlled shelters all day.",
            "title_similarity": "0.3762815",
            "sentiment_compound": 0.7178
        },
        {
            "id": "hk25akh",
            "score": 1,
            "text": "My experience is the opposite. Any excerise triggers severe anxiety especially if it's outdoors, and has the possibility to leave me crippled for days unable to do any physical activity.\n\nBut when I do normal activities - ie loading boxes, moving furniture, groceries, etc - I'm fine.",
            "title_similarity": "0.55837464",
            "sentiment_compound": -0.0129
        },
        {
            "id": "hk2752g",
            "score": 1,
            "text": "I'm one of those people who this does NOT work on. In fact, running and working out absolutely exhaust me and make me feel worse - tired, moody, annoyed and unmotivated.\n\nInstead, I absolutely love doing sports with others! Any sport involving other people makes me feel so so much less stressed!",
            "title_similarity": "0.6272762",
            "sentiment_compound": -0.9091
        },
        {
            "id": "hk27kx7",
            "score": 1,
            "text": "Does the opposite for me. I spend the rest of the day feeling like I'm struggling to breathe.",
            "title_similarity": "0.4186759",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hk27pxx",
            "score": 1,
            "text": "Hmm, i'm not so sure. I have suffered from cripplingly anxiety for going on about 15 years now and no matter how many times I get told \"it works!\" it doesn't.",
            "title_similarity": "0.29914308",
            "sentiment_compound": -0.7743
        },
        {
            "id": "hk28xep",
            "score": 1,
            "text": "Why doesn’t this work for me? I’m constantly being made to feel like it should, but it just doesn’t.",
            "title_similarity": "0.36466473",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hk2a38o",
            "score": 1,
            "text": "Tell me something I don’t know… Exercise is as close as it gets to a magical cure and prevention tool for a massive list of diseases, both mental and physical.  It just isn’t as easy as popping a pill, that’s why people don’t do it.",
            "title_similarity": "0.52858096",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hk2bkgf",
            "score": 1,
            "text": "\"mens sana in corpore sano.\"\n\n\"A healthy spirit in a healthy body.\"",
            "title_similarity": "0.5720659",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hk2ebso",
            "score": 1,
            "text": "Adjacent Question? What do you do when the trauma/anxiety is caused by exercise?\n\nI've wondered about this a lot as a kid that grew up in the 90s. I had some horrific exercise stuff happen. At one point my heart stopped beating while I was swimming a 400m. (My times had been going slower and slower leading up to this) after thrashing for a bit I stopped being able to move my limbs-  I did a dead man's float for a while trying to feel like I wasn't drowning as I stared at the yellow light through the darkening water. I realized no one was coming for me and I thought for sure I was dead if I didn't somehow drag myself out. I got to the edge and was yelled at and after I dragged myself out of the water and laid under the diving block holding my chest trying to breath I was screamed at again by my coach to move out of the way. I was being berated for being lazy. After what felt like forever I dragged myself away to the bleachers and quit completing that day. I stopped swimming entirely and all other sports too. After all I was 14 and lazy (and confused, if this is what it feels like to be a swimmer f#ck all to that).\n  A few years later I was diagnosed with stress induced Vtac (my left ventrical stops beating under stress). After seeing what happens with Covid patients and them being laid in the prone position I'm pretty sure that is the only reason I didn't drop dead was from being in the dead man's float/prone position.. Anyway that fear and anxiety still comes out when I exercise.\n\nI wonder about other weird/disabled/abused kids subjected to social ostracism and show aversion to exercise and not feeling safe in their own body? How do we bridge the disjuncture we feel with our bodies when exercise triggers a trauma response?",
            "title_similarity": "0.36138865",
            "sentiment_compound": -0.989
        },
        {
            "id": "hk2elgd",
            "score": -1,
            "text": "Has this been posted to r/thanksimcured yet? Because they *love* being told about exercise.",
            "title_similarity": "0.5557164",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hk2fjoq",
            "score": 1,
            "text": "I understand the science here, but man... I workout 6 times a week. Five of those days are pretty intense workouts. My anxiety isn't touched by my workouts. I still have cold sweats when the someone knocks on my door, my phone rings or if I have to make a call.",
            "title_similarity": "0.40824908",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hk2fmq7",
            "score": -1,
            "text": "Exercise makes you feel better… shocked pikachu face",
            "title_similarity": "0.62745196",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hk2ftgy",
            "score": -1,
            "text": "This is severely gonna hurt those \"woke\" mental health folks that says excercise doesnt work.",
            "title_similarity": "0.42128876",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hk2gckf",
            "score": 1,
            "text": "I tried this, but I just got more anxiety from being in a public gym, so I settled for going for a couple walks in the wood a week",
            "title_similarity": "0.3121941",
            "sentiment_compound": -0.359
        },
        {
            "id": "hk2j7n6",
            "score": 1,
            "text": "I wish.\n\nI've done multiple half year exercise routines only to drop them cold turkey out of the boredom they produce.",
            "title_similarity": "0.33197707",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hk2k4bu",
            "score": 1,
            "text": "Yes! While I'm exercising I will have bad intrusive thoughts of people or whatever, and what I do is put their face or that energy right in my way and beat the living hell out of it. YOU LIKE THAT ANXIETY, DO  YOU? TAKE MORE!!! HAD ENOUGH? NO? NOT YET? THEN TAKE THAT!!! KA ME HA ME HAAAAAAAAAAAAAAAAAAAAAA!",
            "title_similarity": "0.591254",
            "sentiment_compound": -0.5416
        },
        {
            "id": "hk2p5zo",
            "score": 1,
            "text": "In my 41 miserable anxiety ridden, suicidal infatuated years on this planet I can say the 1 year I went to the gym was the healthiest time of my life. Complete 180.",
            "title_similarity": "0.3398143",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hk2xt5i",
            "score": -1,
            "text": "Blows my mind how ppl think some pills and sitting on your ass can help anxiety. Maybe for some but just gotta get up get out and get something",
            "title_similarity": "0.5846656",
            "sentiment_compound": -0.1901
        },
        {
            "id": "hk2zxx4",
            "score": 1,
            "text": "Nobody wants to admit that exercise can have a positive impact on mental health because nobody wants to do it",
            "title_similarity": "0.30040032",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hk33db9",
            "score": 1,
            "text": "I’ve always been anxious, but really just realized the importance of exercise and walking. I feel significantly less anxious walking daily. When CoVid lockdowns hit, I luckily lived somewhere that I could still walk outdoors. I basically walked every day while not working for 4 weeks and it was the only thing that kept me from being a little ball of anxiety. Now that I am vaccinated and gyms are back open, I have also started lifting and doing pretty strenuous yoga again and it’s getting even better. \n\nOut of curiosity, do you have ADHD? I do, and I wonder if it’s how the “hyperactive “ manifests in adults. Like we have enough self control to sit and behave during our jobs, but then all that pent up energy manifests as anxiety.\n\nAlso want to add that drinking less alcohol has helped me. I used to drink almost every day. Generally 1 to 3 drinks, and frequently up to 6 on one of the weekend days. I always felt less anxious while buzzed, but more when it wore off. Now I maybe drink 0 to 3 times a month and I feel like that has helped a lot as well.",
            "title_similarity": "0.5076799",
            "sentiment_compound": 0.9712
        },
        {
            "id": "hk369p1",
            "score": 1,
            "text": "Can't be anxious if you're exhausted!",
            "title_similarity": "0.4998082",
            "sentiment_compound": -0.2621
        },
        {
            "id": "hk36qxo",
            "score": 1,
            "text": "Some people just don’t want to hear this.",
            "title_similarity": "0.36235464",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hk39ym2",
            "score": 1,
            "text": "I had sudden onset depression when i moved to a new city for a job. The therapist that i began seeing told me he was writing a book on how beneficial exercise was in treating depression. He would say “if i could lock you in the water tower at the top of town and make you tread water for 30 minutes, you might hate me, but i promise you’d feel better.” And it’s to this day the best advice I’ve ever received. In the gym 6 times a week for an hour before 6am and I have never felt better.",
            "title_similarity": "0.33902895",
            "sentiment_compound": 0.448
        },
        {
            "id": "hk3vasw",
            "score": -1,
            "text": "Don’t ever try to tell people with anxiety or depression this unless you want to feel their wrath. They want sympathy not solutions that require action.",
            "title_similarity": "0.3743375",
            "sentiment_compound": -0.4249
        },
        {
            "id": "hk0ujt2",
            "score": 135,
            "text": "[removed]",
            "title_similarity": "0.14796048"
        },
        {
            "id": "hk0zo95",
            "score": 7,
            "text": "True, I never feel anxious when or directly after I workout but it doesn't stop me from having panic attacks almost daily",
            "title_similarity": "0.574165",
            "sentiment_compound": -0.6906
        },
        {
            "id": "hk10lt2",
            "score": 2,
            "text": "Damn I need to get back into the gym….",
            "title_similarity": "0.2151181",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hk1kw0s",
            "score": -2,
            "text": "Note: 'Alleviates' doesn't cure",
            "title_similarity": "0.28558767",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk1pp9n",
            "score": 2,
            "text": "I’m just realizing I haven’t taken any Xanax since I got my peloton two months ago. Wow.",
            "title_similarity": "0.07881374",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hk1tiea",
            "score": 2,
            "text": "Next you´ll tell me people are depressed because they are sitting the whole day inside. Crazy times",
            "title_similarity": "0.26184598",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hk1wpht",
            "score": -2,
            "text": "I was incredibly anxious at the gym. I stuck it out for as long as I could, but inevitably I stopped.        \n    \nEdit: Thanks for kicking me while I'm down guys. I do try, but the anxiety is overwhelming. I go for long walks instead. Not as intense but still better than nothing.",
            "title_similarity": "0.5808213",
            "sentiment_compound": 0.4254
        },
        {
            "id": "hk04tm9",
            "score": 1265,
            "text": "I can't count the number of times I have tried to be helpful and mentioned that exercise helps my anxiety and I get put down in response - typically, Oh, so you think exercise cures mental illness? or So you know more than my doctor does?   I hope this study helps people.  Exercise and a clean diet helps me.",
            "title_similarity": "0.6065348",
            "sentiment_compound": 0.8987
        },
        {
            "id": "hk0yecf",
            "score": 3,
            "text": "This is why I exercise.",
            "title_similarity": "0.35808325",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk16zas",
            "score": 2,
            "text": "This is so true, I was dealing with a really terrible habit of yelling out “you need to die” when I would fixate on anxiety inducing thoughts (only in private tho) and it was just terrible.\n\nMy friend forced me to join him as he re-started his weightlifting programme in July and god damn, I feel so good everyday! The voice still comes back but it’s honestly no where near as debilitating as it used to be. \n\nI am now convinced that all humans have a biological need to exercise, it’s as necessary as brushing your teeth.",
            "title_similarity": "0.45404094",
            "sentiment_compound": 0.7597
        },
        {
            "id": "hk1gq9n",
            "score": 4,
            "text": "It’s really weird but some exercise made my anxiety worse. After doing an elliptical workout I’d feel HORRIBLE and it didn’t help long term either. I switched to weight lifting and felt great!",
            "title_similarity": "0.6382917",
            "sentiment_compound": -0.5629
        },
        {
            "id": "hk2x3js",
            "score": 3,
            "text": "Oh my God I know shut up",
            "title_similarity": "0.17306569",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hk1p1zl",
            "score": 11,
            "text": "Ok, this does and does not apply to me. I was always very sporty. I did track and fields for about 10 years, since in was 10ish until my twenties. I continued regularly exercising (yoga, gym, jogging) throughout my life, now in my 30s.\n\n Recently, I've been under significant stress and anxiety. And I knew very well how exercise can help fight anxiety. But the opposite started happening. I would come from a run and become increasingly more anxiously and depressed. It's like instead of alleviating the anxiety the physical exercise would just add to it. I don't know anything about the physiological structure of the body; however, it's like whatever chemical is released during this exercise and is supposed to help fight anxiety just instead adds to it. By jogging I now work myself up from a mild anxiety to a full blown panic attack. Other times I feel great after a run. But now I basically reached a point that I have to assess whether an exercise will help or not. And more and more I'm getting in a state where I feel like it will just make things worse.",
            "title_similarity": "0.46938953",
            "sentiment_compound": -0.771
        },
        {
            "id": "hk0zzx9",
            "score": 5,
            "text": "\"he found out pushups helped alleviate anxiety and never stopped\"\n\nBest explanation as to why a character was absolutely ripped. Chidi, the good place",
            "title_similarity": "0.6960431",
            "sentiment_compound": -0.1285
        },
        {
            "id": "hk1tw2c",
            "score": 5,
            "text": "From reading the comments it shows that certainly exercise or taking a walk daily helps in curing depression. But from the posts where people make memes or share tweets of people on r/facepalm in which the people who say 'maybe go out for a walk, or do some exercise' to people with anxiety and depression are made fun of, it gives the image that they exercise won't do anything good to them.\nI know in that state people don't want to do anything but that is what you have to overcome.",
            "title_similarity": "0.5713617",
            "sentiment_compound": -0.484
        },
        {
            "id": "hk2dc35",
            "score": 5,
            "text": "Sadly excercise does little to alleviate my anxiety",
            "title_similarity": "0.47888607",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hk0yle7",
            "score": 123,
            "text": "[removed]",
            "title_similarity": "0.14796048"
        },
        {
            "id": "hk0xp2s",
            "score": 12,
            "text": "Do not do to the point to injure yourself though. I’ve been to some toxic gyms and pain with chronic addiction to painkillers as a result of over doing it is not talked enough about the whole workout mentality in today’s trends.",
            "title_similarity": "0.50664556",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hk0u5sl",
            "score": 254,
            "text": "[removed]",
            "title_similarity": "0.14796048"
        },
        {
            "id": "hk0dt41",
            "score": 735,
            "text": "[removed]",
            "title_similarity": "0.1479605"
        },
        {
            "id": "hk0tssy",
            "score": 42,
            "text": "[deleted]",
            "title_similarity": "0.14238232"
        },
        {
            "id": "hk1e7wh",
            "score": 985,
            "text": "I think most people are aware or this. The problem is motivating someone suffering from anxiety and or depression to actually get up and move around, preferably outdoors.",
            "title_similarity": "0.5995947",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hk0jsd2",
            "score": 3655,
            "text": "That's the best thing I did during the lockdowns. Going for a walk every single day. It does help even if sometimes you don't notice it. \n\nAnd ofc now its a habit so I kept doing it.",
            "title_similarity": "0.5853964",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hk1d71v",
            "score": 658,
            "text": "[removed]",
            "title_similarity": "0.14796048"
        },
        {
            "id": "hk0sbie",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.14796048"
        },
        {
            "id": "hk15kg0",
            "score": 2,
            "text": "I believe it, I feel better when I have a slight anxiety spike and just walk around my house.",
            "title_similarity": "0.5518135",
            "sentiment_compound": 0.3597
        },
        {
            "id": "hk167u1",
            "score": 2,
            "text": "I need to get back into a workout habit. It’s hard with work, but the stress is compounding man",
            "title_similarity": "0.6010815",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hk16l4x",
            "score": 2,
            "text": "Mild to moderate crossfit. You know the drill.",
            "title_similarity": "0.59679174",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk171ra",
            "score": 7,
            "text": "Just remember not too long ago we were roaming the woodlands, the Savannah, the mountains, the rainforest, exploring; nomadic people who used our feet to go forward instead of just push a pedal. Yes. Walking is the best medicine.",
            "title_similarity": "0.4435444",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hk17hsj",
            "score": 3,
            "text": "I exercise frequently and I would say it’s mostly for the mental benefit. Humans are built to move and for endurance and when we don’t use our bodies our mental health suffers dramatically. Or at least that’s my personal experience.",
            "title_similarity": "0.6539955",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hk17ot0",
            "score": 1,
            "text": "It’s been working well for me. I experience chronic anxiety but ended up building up a micro cleaning business during covid. The constant movement keeps my anxiety at bay enough that I can function better than ever before.",
            "title_similarity": "0.7247104",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hk17wfh",
            "score": 2,
            "text": "Heavy weight make bad thought go away",
            "title_similarity": "0.50507236",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hk17zom",
            "score": 1,
            "text": "> \"There was a significant intensity trend for improvement — that is, the more intensely they exercised, the more their anxiety symptoms improved,” states Malin Henriksson,.... the study's first author.",
            "title_similarity": "0.60451806",
            "sentiment_compound": 0.4256
        },
        {
            "id": "hk1sweq",
            "score": 10,
            "text": "What if exercise just pisses you the hell off like Hulk smash! to the point where you don't want to exercise because of how it makes you feel?\n\n\nBeen hearing all my life exercise makes people feel good, but it's never been that way for me.",
            "title_similarity": "0.45188248",
            "sentiment_compound": -0.2966
        },
        {
            "id": "hk1v513",
            "score": 1,
            "text": "I thought this was my research but it's with anxiety participants. We found that in typical population. We had a larger sample size.",
            "title_similarity": "0.43735287",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hk1wlvw",
            "score": 1,
            "text": "What about the school of thought that high intensity exercise/cardio raises cortisol levels? There are some trainer/coach/medical types on YouTube who I've watched recently who advocate walking over running with one of the reasons being the cortisol argument. Anecdotal, for sure, but is there anything factual to their argument that walking lowers cortisol levels and running raises them, which leads to higher anxiety?",
            "title_similarity": "0.529726",
            "sentiment_compound": -0.7587
        },
        {
            "id": "hk22693",
            "score": 10,
            "text": "I would like to see the study results replicated with solo exercise because it seems to me like regularly meeting up with a group of people to exercise intensely would build a nice amount of camaraderie that might just make you feel better itself. Would be nice to see a comparison between solo/1-1/group activity.\n\n\nPersonally I miss group exercise classes but I'd be scared shitless of going into a room full of strangers and exercising. As it is I follow the advice for anxiety, go for long daily walks and exercise, and I do feel a little better in the short term but then I spend most of the rest of the day worrying about how I'll gather the resolve to do it all over again tomorrow ...",
            "title_similarity": "0.6082542",
            "sentiment_compound": 0.5804
        },
        {
            "id": "hk2dk14",
            "score": 1,
            "text": "That's a *ridiculously* inadequate control.\n\nThe intervention group first got a one-on-one session with a physiotherapist who designed an individualized plan together with them, and then they were overseen by physiotherapists in exercise sessions 3 days a week for 12 weeks.  \nThe control group OTOH got \"a single session with a physiotherapist who provided general advice about physical activity according to public health recommendations\".\n\nIt is well known that just feeling like you're being listened to by medical professionals and getting attention from them has a huge effect (this is the cornerstone of a lot of \"alternative medicine\" - you can sell whatever snake oil you like as long as you listen to, or appear to listen to, your patients and offer them an individualized solution).",
            "title_similarity": "0.32944635",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hk2iu5w",
            "score": 1,
            "text": "Have we not know about this? My understanding was the first question asked by a psychiatrist in regards to depression and anxiety is about your diet and exercise.",
            "title_similarity": "0.311374",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hk2mbyq",
            "score": 1,
            "text": "What is the underlying mechanism? Is this a misatrribution of arousal effect?",
            "title_similarity": "0.306283",
            "sentiment_compound": 0.0
        },
        {
            "id": "hk2pu2p",
            "score": 1,
            "text": "Lots of comments regarding the whole concept of “will power”. Personally, I don’t believe in will power. I don’t think it exists. I believe it is our natural state as humans to pursue our aptitudes mentally/physically without restraint. Unfortunately this quality is damaged through experiences of unresolved trauma that creates conditions like PTSD. When people are suffering with this, serious limitations occur when it comes to enacting our “will”. The chain of command can be damaged or completely broken. So ones ability to will oneself out of anxiety is not a testament to ones strength as a person or the power of ones practice, it’s simply a representation of the degree and nature of ones personal trauma. Congratulations to anyone who has been able to choose to not be anxious anymore but the majority of people cannot. Traumatized people need a lot of space and a lot of freedom to process and integrate their experiences. Recovery is possible but the part of the brain required to pursue recovery is the part of the brain that requires treatment so it is very very difficult. If someone in your life seems lazy or stuck, it’s not because they lack will power it’s because they are unable to access that part of themselves.",
            "title_similarity": "0.5166956",
            "sentiment_compound": 0.2741
        },
        {
            "id": "hk2t7de",
            "score": 2,
            "text": "As someone living in chronic pain this a god damn lie. I lost 170+ pounds felt good but my depression and anxiety won. Went from 2 1 hour workout sessions a day to 0 cause what's the point. Still in pain still hate myself still want to die.  No amount of exercise changed that.",
            "title_similarity": "0.48952168",
            "sentiment_compound": -0.9698
        },
        {
            "id": "hk2w941",
            "score": 2,
            "text": "I wish that worked for me. I've always been serious about exercising, but it doesn't do jack for my anxiety. All of the medications make things worse too.",
            "title_similarity": "0.5648235",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hk2y5dm",
            "score": 1,
            "text": "True, however extended exercise will release cortisone which can exacerbate a disorder.",
            "title_similarity": "0.6491715",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hk3n0k2",
            "score": 1,
            "text": "The reason is because exercise lowers inflammation.  There is inflammation in the brain with anxiety sufferers. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7555994/",
            "title_similarity": "0.69862026",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hk3nclu",
            "score": 2,
            "text": "PhysEd should be mandatory in schools again. If I remember correctly it was when Reagan was governor of California and he removed physed and art from public schools that gangs began being a real problem. Kids need to move.",
            "title_similarity": "0.1958855",
            "sentiment_compound": -0.34
        },
        {
            "id": "hk3rtqm",
            "score": 2,
            "text": "See I knew I wasn't crazy! I do a set of as many pushups as I can when I start feeling super anxious and it always seems to help a little bit.",
            "title_similarity": "0.6791525",
            "sentiment_compound": 0.814
        },
        {
            "id": "hk49bxm",
            "score": 2,
            "text": "I've given up on the mental health benefits of running. I hear they exist, but despite running a 10k and several shorter runs every week, I've yet to notice any difference, so I run for cardio health.\nI find that walking in nature is much more effective, in case anyone else is in a similar boat.",
            "title_similarity": "0.49554753",
            "sentiment_compound": 0.7498
        },
        {
            "id": "hk4k7ta",
            "score": 1,
            "text": "I had a therapist in my 20’s tell me that if she could prescribe exercise she would tell everyone with anxiety to do some sort of vigorous aerobic exercise for an hour a day.  It took me about 10 more years of struggling to accept her prescription.",
            "title_similarity": "0.2921872",
            "sentiment_compound": -0.2878
        },
        {
            "id": "hk4o355",
            "score": 2,
            "text": "As a person who exercises alot this is not remotely true for myself.",
            "title_similarity": "0.40005162",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hk4ui80",
            "score": 1,
            "text": "It is hard when you have chronic pain and the only way out is exercise.",
            "title_similarity": "0.57014024",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hk4wzre",
            "score": 1,
            "text": "Hello science people.  \nI have a quick question, but didn't want to make a new thread.\n\n  \nWhat is/are the best source or sources for high quality research papers?\n\n(other than r/science, which I just joined)\n\nIdeally I would love to find one of those automated services that email me studies that are relevant to my interest, but I'm unsure what are the most reputable services and sources out there. My areas of interest are fairly broad, though my main areas of interest are probably psychology, biology and health (nutrition, exercise, supplementation).\n\nAppreciate any help.",
            "title_similarity": "0.46609688",
            "sentiment_compound": 0.9878
        },
        {
            "id": "hk52b3b",
            "score": 3,
            "text": "I used to have really really bad anxiety but then I started working out consistently, and I’m so much better for it. Ofc the anxiety is still there but nowhere near as intolerable before.",
            "title_similarity": "0.73864317",
            "sentiment_compound": 0.0157
        },
        {
            "id": "hk6s7ra",
            "score": 1,
            "text": "Well yeah, psychological research has shown this for decades",
            "title_similarity": "0.28429174",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hm4su7z",
            "score": 1,
            "text": "i have torn both of mine 2x. no surgeries. this last time may have done me in. im back to gym but i cannot jump or run. when mine gets caught i do leg extensions with 10 lbs and somehow it resets it. good luck.",
            "title_similarity": "0.4030339",
            "sentiment_compound": 0.775
        }
    ]
}