{
    "Pregnant women in the United States die by homicide more often than they die of pregnancy-related causes — and they're frequently killed by a partner. Pregnant or recently pregnant black women have up to nearly three-fold higher risk of dying by homicide than those who are not pregnant.\n": [
        {
            "id": "hkgvium",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.4156561",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hkhegt8",
            "score": 8,
            "text": "I wonder how much safer pregnant women would be if humans in America were guaranteed basic needs like food, healthcare, and shelter without the help of a partner, or if abortion was less demonized by religious extremists, and easier to access",
            "title_similarity": "0.55640537",
            "sentiment_compound": 0.7043
        },
        {
            "id": "hkgylfd",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhf0wj",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkh69t6",
            "score": -9,
            "text": "[removed]",
            "title_similarity": "-0.005057009"
        },
        {
            "id": "hkhbrui",
            "score": 7,
            "text": "I wonder how closely this correlates to the abortion laws.",
            "title_similarity": "0.38872522",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkh4jir",
            "score": -23,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkh7okl",
            "score": 82,
            "text": "Adding a gun to domestic violence drastically increases the murder rate.\n\nEdit: [A woman is 5 times more likely to be murdered when her abuser has a gun.](https://efsgv.org/learn/type-of-gun-violence/domestic-violence-and-firearms/)",
            "title_similarity": "0.7888734",
            "sentiment_compound": -0.9648
        },
        {
            "id": "hkhjy9u",
            "score": 8,
            "text": "In terms of silver lining\n\nIt's incredible how much US medicine has grown in preventing pregnancy related death.",
            "title_similarity": "0.4995069",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hkho24w",
            "score": 14,
            "text": "To look at this in a more positive way: pregnancy has become incredibly safe compared to the rest of human history, whereas murder will always kill you.\n\nIt’s like if we came to a point where an article could be written that says “drivers killed more in road rage-fueled murders than in direct collisions while driving.”  It sounds scary, but the reality behind that scenario would likely be cars becoming so safe that the only danger is of others escalating to violence, however rare it may be.",
            "title_similarity": "0.68595815",
            "sentiment_compound": -0.9252
        },
        {
            "id": "hkhkrh8",
            "score": -9,
            "text": "I wonder if there's any correlated increased risk of homicide for men as well, either by outside parties (affair) or due to increased risk taking due to desperation?",
            "title_similarity": "0.62961304",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hkh5k1d",
            "score": -11,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhr0dc",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhmg0z",
            "score": -1,
            "text": "Perhaps someone can help me out with perspective in comparison? I Iove coming through comments in this sub because the fluff and assumption are gone and I really feel like I'm gathering perspective from facts and knowledge rather than someone's own opinion, however rooted in fact that opinion may be. I suppose my wonder is a mathematical one, statistics, based on this presented data. \n\nViolence and unnatural death are never good. I preface with this not intending to marginalize safety or death at any rate, only to gather perspective. Doctors are finding this \"shocking\" at the higher likelihood of violent death. Bad, without question. But what is the base measurement of danger against these compared increases in danger? I can't find a percentage or ratio defining the baseline(?) like they use for comparisons against this unknown ratio/percentage/whatever. \"2.5x more likely\" was used for one of the demographic. So 2.5 times higher than, say, .075%? So around 2% compared to the .075%? I'm just making up numbers here and I chose quite low numbers on purpose. I would find it hard to think of becoming concerned, as a populous, at 2% risk. I wonder about this more than anything because of the mention of how low risk is, relatively, for births in the states. \n\nInformation is always great for firming opinions/decisions. But this type of hype makes me think about how, in other mediums of discussion, an effort to set policy/legislation based on \"shocking\"  info ends up being far more damaging by enactment than its intended original protectionism. \n\nThanks for reading the book and any insight.",
            "title_similarity": "0.56633747",
            "sentiment_compound": -0.9783
        },
        {
            "id": "hkhh7l9",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkh940o",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhtv2r",
            "score": 4,
            "text": "And the last hundred years or so we have made amazing leaps in the prenatal healthcare...\n\nThe same cannot be said for domestic violence...",
            "title_similarity": "0.50151014",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hkiccaw",
            "score": 19,
            "text": "> Pregnant women in the United States die by homicide more often\n\nReally?\n\n> across 2018 and 2019, a total of 273 women died by homicide either while pregnant **or within a year of the end of their pregnancy**.\n\nBecause this statistic includes non-pregnant women.\n\nOk, well there were [33,043](https://www.statista.com/statistics/191134/reported-murder-and-nonnegligent-manslaughter-cases-in-the-us-since-1990/) homicides on those two years, so their pool represents 0.8% of it. In 2019 USA's population was 328.3 million and there were [3,747,540 births](https://www.cdc.gov/nchs/fastats/births.htm) so at the roughly 1.1% of the population was **actually** pregnant during one of those years. So your odds decrease from the actual average even if it peaks in other comparisons. And we're off to a wonderful start aren't we?\n\n> The researchers found that US women who are pregnant or were pregnant in the past 42 days (the post-partum period) die by homicide at more than twice the rate that they die of bleeding or placental disorders — the leading causes of what are usually classified as pregnancy-related deaths. \n\nAlso sepsis, it's kind of convenient that was left out.\n\n> Slightly more than half (52%) of all deaths occur after the day of delivery, while almost a third occur during pregnancy. [Source] (https://www.commonwealthfund.org/publications/issue-brief-report/2020/dec/maternal-mortality-united-states-primer)\n\nAckward right? Hey, let's finish reading *that* article real quick.\n\n> By 1960 the U.S. ratio was 37 per 100,000 live births. During the 1980s and into the 1990s, clinical interventions as well as public health efforts further reduced maternal mortality; it declined until the late 1990s, when it leveled off at about nine deaths per 100,000. After 1997, the U.S. ratio began rising again until 2008, when it plateaued at around 14 deaths per 100,000 births. The focus on improving maternity care in hospitals has had consequences, for example by diminishing the importance of community-based care and overlooking persistent racial and ethnic disparities.\n\nSounds like the study Commonwealth reported nailed it. Back to the OP's.\n\n> The overall rate of maternal mortality in the United States is on the rise. And it is particularly high for a wealthy country. Contributing factors include inadequate access to health care, staff who are poorly trained for obstetric emergencies, and subpar care given to Black women because of racism in clinical practice.\n\nThey just blame nurses & racism. Anyway...\n\n> The team reported rates only among Black, Hispanic and white women, because the sample sizes for other groups — such as Asian American women or Native American women — were too small to publish\n\nOoh, I can help with that.\n\n> The same study also reported widely disparate pregnancy-related mortality ratios for each group, specifically: white (12.7), Black (40.8), American Indian/Alaska Native (29.7), Asian Pacific Islander (13.5), and Hispanic (11.5). For example, hemorrhage (severe bleeding) is a cause of death most frequently seen in pregnancy and at the time of birth. It was the leading cause of death among American Indians and Alaska Natives (AIANs) and Asian Pacific Islanders (APIs), accounting for twice the proportion of deaths as seen among white or Black people. [Commonwealth](https://www.commonwealthfund.org/publications/issue-brief-report/2020/dec/maternal-mortality-united-states-primer)\n\n(;;;・_・)\n\nI mean don't get me wrong, the Commonwealth article also points out a 2.5 disparity between black & white. It just happens to have more data, better analysis, a better explanation, sticks to the 42 (not 365 day) window the CDC uses, makes a more accurate claims off it's data, and it's willing to discuss the elephant in the room.\n\n> Black women are more likely than white women to report that their concerns and preferences regarding birth were disregarded; women with Medicaid coverage reported inadequate postpartum care and support. (article goes on to explain it's source for this) ... For example, both Black women and those with Medicaid coverage were less likely than white women and those with private health coverage to say they had autonomy about childbirth decisions and were treated with respect by their providers.\n\nSee, one article claims homicides are up in a fishy way so reader walk away thinking \"black man bad\" with a subtle and uncited claim healthcare givers are racist. But when you read the other you walk away questioning the quality of healthcare Medicaid receptants receive. How minorities are dependent on this flawed \"healthcare provider\" of an government ran insurance company are getting screwed over worse than before. Despite the woke community skin shaming doctors for a decade, the system has just gotten worse. Not better. And, well. Let's just let the article finish this.\n\n> As these charts show, relatively high maternal mortality ratios in the U.S. as compared with other countries, and disparities between Black and white women, are not new problems, nor are they improving. Even if you looked just at non-Hispanic white women in cross-national comparisons of maternal mortality, the U.S. would still be in last place. \n\n> When we consider causes of racial and other disparities in maternal mortality, it is essential to consider women’s interactions with the maternity care system and understand how bias and racism manifest in these experiences. Because experiences of pregnancy and parenthood differ by race and insurance coverage, our health care systems need to address structural factors — including racism and bias — that affect treatment while meeting the full needs of all pregnant and birthing people. Racism in the health care sector compounds the issue, with Black women less likely to have access to treatment and receive good-quality care. And the intersection of sexism and racism can mean women of color are not listened to or respected by their providers, contributing to preventable morbidity and mortality due to delayed diagnosis or care. This has been reported by women in multiple surveys and illustrated by the high-profile cases of Serena Williams, Shalon Irving, and Kira Johnson.\n\n> Moreover, although recent efforts to improve hospital maternity care have been valuable, only a third of pregnancy-related deaths occur at the time of birth. We need to improve women’s health services before and after pregnancy — not just at the time of birth. Policies are also needed to promote continuous health insurance coverage before and after pregnancy. In particular, the large proportion of maternal deaths that occur after childbirth suggests that too many women are losing connections to health care after giving birth. High maternal mortality in the U.S. is not the result of any single factor, and reducing it will require an integrated effort involving policy and practice changes to improve hospital and community care for all women while advancing racial equity.\n\nGive it a read through.\n\nhttps://www.commonwealthfund.org/publications/issue-brief-report/2020/dec/maternal-mortality-united-states-primer",
            "title_similarity": "0.8585017",
            "sentiment_compound": 0.8433
        },
        {
            "id": "hkh1iep",
            "score": -15,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkh5mdv",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkh3imf",
            "score": 33,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhtj73",
            "score": -8,
            "text": "Here is a hypothesis. Killers like to impregnate people.",
            "title_similarity": "0.44302744",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hkhf6ta",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkgzdj1",
            "score": 34,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkh5734",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkgw04f",
            "score": 30,
            "text": "[removed]",
            "title_similarity": "-0.0050570145"
        },
        {
            "id": "hkhs3il",
            "score": -29,
            "text": "femicide as a word is more apt for this context than homicide tbh",
            "title_similarity": "0.48903692",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkhlhqd",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhpvid",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkh0v5m",
            "score": -14,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhk3ar",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhedqp",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkia8g7",
            "score": 2,
            "text": "Ok maybe I missed it because I was admittedly skimming, but do they not look at income?",
            "title_similarity": "0.35197806",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkhd5ka",
            "score": 244,
            "text": "To put this in a positive light, this means that modern medicine has reduced maternal deaths so dramatically that most of the time, a pregnant women only dies if someone purposely kills her or her doctor neglects to give her proper medical attention.",
            "title_similarity": "0.8101615",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hkhaxc7",
            "score": 17,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhhckn",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hki8k6a",
            "score": -5,
            "text": "this isn't surprising at all.  in fact the numbers are very good.  almost nobody dies from pregnancy anymore.",
            "title_similarity": "0.33991182",
            "sentiment_compound": 0.3354
        },
        {
            "id": "hki7hy1",
            "score": -1,
            "text": "This was my first thought wither Texas abortion ban and other states. The rate of deaths in women will sky rocket and just not because of back ally abortions. Instead of forcing your mistress to get a abortion you will just kill her now.",
            "title_similarity": "0.701517",
            "sentiment_compound": -0.8519
        },
        {
            "id": "hkhn550",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhqfhb",
            "score": -6,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhedjh",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhg3x5",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhw5k4",
            "score": 73,
            "text": "The most dangerous time in a woman’s life is when she’s pregnant and/or leaving her abusive partner. Let that sink in. \n\nEdited to add/clarify that this stat is specifically related to pregnant women leaving abusive relationships. Pregnancy on its own can be dangerous for women due to other extenuating circumstances. And while pregnant woman are killed by partners who have never shown signs of previous abuse (See Shannan Watts and Lacy Peterson), that’s less common than rates among abused women. \n\n[Interesting article on risks for pregnant women. ](https://www.redbookmag.com/body/pregnancy-fertility/news/a46452/biggest-threats-to-pregnant-women/)\n\nHopefully my edit clarifies my earlier post.",
            "title_similarity": "0.82014585",
            "sentiment_compound": -0.9741
        },
        {
            "id": "hki3ciy",
            "score": 0,
            "text": "So how are we planning on preventing this?",
            "title_similarity": "0.022340316",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hkighpt",
            "score": 0,
            "text": "Wonder if guns have anything to do with the high homicide rate",
            "title_similarity": "0.6170696",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkiobrz",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.005057009"
        },
        {
            "id": "hkjxwlt",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.005057009"
        },
        {
            "id": "hkhimm6",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhmfhe",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhgxf1",
            "score": 7,
            "text": "Is this because homicide is really high or because death in childbirth is really low?",
            "title_similarity": "0.73819244",
            "sentiment_compound": -0.7425
        },
        {
            "id": "hkhj3mn",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "-0.005057009"
        },
        {
            "id": "hkhj3lb",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hki3i9o",
            "score": -2,
            "text": "Science - pregnancy now so medically understood more women die while pregnant than from pregnancy. \n\nThis was always going to happen people. It's not as much a condemnation of our society as it is an achievement by science. When no one dies from pregnancy complications it's a good thing, not a problem that the risk of murder for pregnant women is higher. One can be controlled by medicine and practice, one cannot.",
            "title_similarity": "0.76025295",
            "sentiment_compound": -0.9156
        },
        {
            "id": "hkkm78k",
            "score": 1,
            "text": "So does that mean black men are three times as likely to kill their pregnant significant other than non pregnant significant other?",
            "title_similarity": "0.80758166",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hkicon3",
            "score": -7,
            "text": "Ever wonder if improved sex Ed, access to family planning free of charge and general improved education would work?  Would women just stop being pregnant in terrible situation with terrible people? Would everyone just have better sense and judgment?",
            "title_similarity": "0.5656855",
            "sentiment_compound": 0.6747
        },
        {
            "id": "hkhs2h9",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhjqf3",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hki0uy8",
            "score": -1,
            "text": "I mean, we have the knowledge and technology to give healthy childbirths these days. And Domestic Abuse has been prevalent for decades. Kind of a no-brainer.",
            "title_similarity": "0.55116487",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hkiagba",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkkn5wc",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hki2cqh",
            "score": -6,
            "text": "How much would this figure go down by if people were universally offered paternity and maternity leave?\n\nOr even just free diapers or planned parenthood visits?",
            "title_similarity": "0.41352516",
            "sentiment_compound": 0.5362
        },
        {
            "id": "hkkt9qz",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkh3kpj",
            "score": 51,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhjhq0",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkjkb88",
            "score": -1,
            "text": "We needed mandatory sex Ed in k-12 , free or financially rewarding birth control, and family planning /counseling for teens and young adults since 1960.\n\nAmerica is an extremely violent culture in most places. People don't realize how rampant DV is and unchecked mental illness. Then people pair off and make babies in that culture",
            "title_similarity": "0.67171705",
            "sentiment_compound": 0.0276
        },
        {
            "id": "hki3kuf",
            "score": 13,
            "text": "Pregnancy is one of the leading cause of death for young women. A man might kill your because you are planning to get an abortion and he might kill because you are planning not to.",
            "title_similarity": "0.75404835",
            "sentiment_compound": -0.936
        },
        {
            "id": "hkhudn0",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkkhvw6",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkkqq8i",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkktdpq",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhe9jv",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhhgjc",
            "score": 29,
            "text": "[removed]",
            "title_similarity": "-0.005057009"
        },
        {
            "id": "hkh6n8z",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhxtck",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhy1u5",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hki2ce0",
            "score": -3,
            "text": "That’s because deaths due to pregnancy are so insanely low now that they are less likely to happen than murder.",
            "title_similarity": "0.6753305",
            "sentiment_compound": -0.7951
        },
        {
            "id": "hki38tz",
            "score": 0,
            "text": "This is a sad commentary given that the US is the 4th worst out of 36 developed nations for maternal and infant mortality rate.",
            "title_similarity": "0.67978114",
            "sentiment_compound": -0.802
        },
        {
            "id": "hki4inq",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkisiwa",
            "score": 0,
            "text": "I wonder if this is a thing that happens in other countries at all. As in, could stress from the fact that we have no maternal or paternal leave here or knowing what kinds of medical bills you’ll have because our healthcare is so awful. I’m not trying to defend this in any way, mind you, it would just be interesting to know if that’s a factor.",
            "title_similarity": "0.4661994",
            "sentiment_compound": -0.7481
        },
        {
            "id": "hkj424k",
            "score": 0,
            "text": "I dont think you needed a research article to figure this out",
            "title_similarity": "0.11758836",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkjjb63",
            "score": 3,
            "text": "*“Age is also a factor in pregnancy-related homicide, the team found: young women between the ages of 10 and 24 are at higher risk of homicide while pregnant than are those who are older, according to the study.”*\n\nYoung women aka children. Pregnant children. Being murdered. This makes my stomach hurt. I hate everything",
            "title_similarity": "0.89263976",
            "sentiment_compound": -0.9274
        },
        {
            "id": "hkkhxsx",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkkjkme",
            "score": 0,
            "text": "„Dying by Homicide“ sounds too passive. You mean: violent men more likely to kill their pregnant partners. There, fixed it for you.",
            "title_similarity": "0.69626147",
            "sentiment_compound": -0.8428
        },
        {
            "id": "hkkrjv2",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkliufi",
            "score": 0,
            "text": "Evil does not stay in just one sphere of life. Evil overflows into all aspects of human activities. Women are on the bottom tier of the caste system in the world and especially in Gringoland. USA. And African women are the most defenseless targets of male evil tendencies as is proven over and over. Being despised by the powerful, as are African women, just allows men to abuse women with impunity and also permits men to enjoy being sadists. There are thousands more examples of Men being sadists.",
            "title_similarity": "0.7211355",
            "sentiment_compound": -0.9571
        },
        {
            "id": "hkhu570",
            "score": 15,
            "text": "My god that’s horrific",
            "title_similarity": "0.17816791",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hkhfdjy",
            "score": 25,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hki9369",
            "score": 19,
            "text": "“There’s an idea in our society that pregnancy is a happy time,” Sharps says. “But for a lot of women, that’s just not true, and a lot of women are just not safe in their homes.”",
            "title_similarity": "0.6538508",
            "sentiment_compound": -0.0098
        },
        {
            "id": "hkik3bc",
            "score": 1,
            "text": "Is there data of married vs single women as well?",
            "title_similarity": "0.5243043",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hkim7f6",
            "score": -1,
            "text": "I’d be curious if there’s a paternity data point in the stats",
            "title_similarity": "0.1099648",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hkip19s",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkivti6",
            "score": 1,
            "text": "Well, the U.S. has the [highest maternal mortality rate among developed countries](https://www.commonwealthfund.org/publications/issue-briefs/2020/nov/maternal-mortality-maternity-care-us-compared-10-countries). \nBut its a really complicated issue [as laid out by this JAMA article](https://jamanetwork.com/journals/jama/fullarticle/2728576) that I think is absolutely worth the read. Data hasn't been standardized, and is just flat out inaccurate in a lot of states. Medicaid, stops paying for pregnancy care six weeks postpartum,  black women continue to die in childbirth at rates 3 to 4 times higher than white women, and women struggling with substance abuse or mental health issues in particular can get lost in the system. The whole thing is misty at a local level, murky at a state level, and nearly impenetrable at a national one. That's not to say  pregnancy-related deaths in the US haven't decreased in recent years, which may be why we are now looking at secondary causes such as murder. That JAMA article acknowledges that: \"California confronted its high maternal mortality rate—16.9 per 100 000 live births—head-on starting in 2006. By 2013, the state cut its maternal mortality rate by half\"\n\n&nbsp;\n\nPart of it could be in part due to at home births, which absolutely kill both babies and mothers. [\"nearly 14 newborns per 10,000 live births died following planned home births - more than four times the rate for babies born in hospitals.\"](https://www.reuters.com/article/us-health-homebirths-newborn-mortality/hospital-births-far-safer-for-u-s-newborns-than-home-births-idUSKBN20N0R0) But the College of Obstetricians and Gynecologists say that [\"High-quality evidence that can inform this debate is limited\"](https://www.acog.org/clinical/clinical-guidance/committee-opinion/articles/2017/04/planned-home-birth) due to a ton of reasons due to clinical study volunteer reluctance to midwife quality to self-reporting issues to inability to account for and accurately attribute adverse outcomes etc etc... It seems pretty messy as far as actual substantial conclusions go.\n\n&nbsp;\n\nBut it could also be related to the limited number of care providers, especially in areas of poverty and low socio-economic status [\"the United States and Canada 'have the lowest overall supply of midwives and obstetrician-gynecologists \\(OB-GYNs\\) — 12 and 15 providers per 1000 live births, respectively,' whereas all other countries have a supply that is between 2 and 6 times greater.\"](https://www.ajmc.com/view/us-ranks-worst-in-maternal-care-mortality-compared-with-10-other-developed-nations) \n\n&nbsp;\n\nBut also it seems that murders of the pregnant are also high in the US. I.e. in Louisiana [119 pregnancy-associated deaths for 2016 and 2017 in the state, 13.4% \\(16\\) were homicides](https://www.nih.gov/news-events/news-releases/homicide-leading-cause-pregnancy-associated-death-louisiana). Or in Texas: [\"suicide, homicide, or drug overdoses were responsible for nearly half of postpartum deaths\"](https://jamanetwork.com/journals/jama/fullarticle/2728576). There absolutely seems to be a disconnect between local care systems and ongoing care for post partum mothers. \n\n&nbsp;\n\nThe economic hardships of child birth in the US are another added stresser to this dynamic with it costing [$27,000 more to give birth in the US than it does in the UK](https://www.cnbc.com/2017/09/25/how-much-less-it-costs-to-give-birth-in-the-uk-than-in-the-us.html). \"The average fee for delivery and newborn care in America is $32,000, according to [2013 data reported by The Guardian](https://www.popsugar.com/family/How-Much-Does-Childbirth-Cost-America-vs-UK-44789221). The delivery itself racks up about $10,000, and it's the pre- and postpregnancy care that increase the cost to around the $30,000 mark.\" I cannot imagine its gotten better since then. In fact a [tiktoker recieved an itemised bill totalling $69,634](https://www.independent.co.uk/life-style/birth-cost-us-tiktok-uk-b1839688.html) after giving birth this year and posting about it in May 2021. All in all it appears the way the US does pregnancy care and post partum maternal health care needs a complete overhaul on a national scale.",
            "title_similarity": "0.65215874",
            "sentiment_compound": -0.9371
        },
        {
            "id": "hkjrkat",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkjsqc3",
            "score": 1,
            "text": "I just was finding out about this the other day. It’s amazing how safe pregnancy is now. Not at all the risk it’s made out to be. Something .002% result in maternal death. \n\nOne wonders, if we didn’t force men to supplement the lives of women who choose to produce a child, would there be less homicides?  Men are only involved in conception, which does not result in life. It’s creates a zygote. I think it’s time we do away with antiquated laws. They don’t really have a place in modern society given what we know about life and reproduction.",
            "title_similarity": "0.63320494",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hkhu2wg",
            "score": 84,
            "text": "Intimate partner homicide is exceptionally common. Each country has its own rates and it's usually several per day. Some of these are done by an ex partner, a partner that's never been physically violent but is usually coercively controlling. It takes on average 7 attempts to leave an abusive relationship and that is usually the most dangerous time. Things such as job loss, moving, pregnancy, new baby, etc can be triggers for such an event. \n\nIf you think you may be at risk please look at the VDASH risk assessment by Laura Richard's and/or the MOSAIC Method by Gavin De Becker. \n\nGood podcast resource is Real Crime Profile as they speak a lot about this on there, Something Was Wrong also mentions a lot of indicators. \n\nAn amazing book would be The Gift of Fear by Gavin de Becker and another amazing book about this specifically is See What You Made Me Do by Jess Hill.",
            "title_similarity": "0.7154411",
            "sentiment_compound": -0.8755
        },
        {
            "id": "hki2s8n",
            "score": 8,
            "text": "Pregnancy is stressful on relationships. When a relationship is already experiencing DV, it is amplified by pregnancy. I'm guessing it is also very hard to leave a relationship when you are pregnant due to wanting the child to have both parents involved.",
            "title_similarity": "0.6351756",
            "sentiment_compound": -0.6659
        },
        {
            "id": "hki7s8n",
            "score": 16,
            "text": "That is quite a fuckin morbid stat right there",
            "title_similarity": "0.2224589",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkhmah9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhy5yt",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.005057005"
        },
        {
            "id": "hkj4xv5",
            "score": -2,
            "text": "We need a meteor. NOW!",
            "title_similarity": "0.11157884",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkksymj",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057005"
        },
        {
            "id": "hkihmfg",
            "score": -4,
            "text": "I would propose that this pattern of behavior derives from our universal primate nature, not a \"Cultural Difference\" ; being a dogwhistle implying the existence of inherent biological differences between us and them.\n\nUnder our natural circumstances, There would be an evolutionary incentive to get rid of those who are physically impeded and/or cant pull their weight during times of strife and deficiency, i.e. , \"You could always make more babies later when times are better\".\n\nE.G. : Snakes will eat their own eggs when they believe a predator is stalking them, many species of birds will kill some of their hatchlings and feed it to the others when they judge that only some of them will make it, lions and bonobos are known to practice maternal homicide and cannibalization. Biologically speaking its a smart investment to make in the long run.\n\nModern hunter-gatherer tribes are also known to have proclivities for cleansing the weak and members that are annoying and don't want to deal with ; women, children, and women under intense hormonal periods are generally considered to be very annoying.\n\nWhat we could do to address this would would be to abolish systemically educed economic disparities, which disproportionately affect black people more so than other ethnolinguistic groups in the unites states.",
            "title_similarity": "0.48897567",
            "sentiment_compound": -0.5596
        },
        {
            "id": "hkig36v",
            "score": 48,
            "text": "As an investigator investigating the death of young pregnant woman, if you begin your investigation focusing on the husband or boyfriend you'll be right 85% of the time. \\*85% of the time a pregnant women dies at the hands of a murderer, that murderer is her husband or boyfriend, been that way for decades.",
            "title_similarity": "0.79754686",
            "sentiment_compound": -0.9337
        },
        {
            "id": "hkhzito",
            "score": 78,
            "text": "More of a factor than stress or unplanned pregnancy, is the fact than an abuser can’t stand being left (and being pregnant is a motivator to leave the abusive relationship), and also can’t stand being put in second place, or being stood up to. The most dangerous time in an abusive relationship is when you try to leave. A pregnant victim of abuse may be more likely to leave their partner. And adding a gun to the mix makes the risk of being murdered higher. Gun violence is also an issue that effects women and children.",
            "title_similarity": "0.7239123",
            "sentiment_compound": -0.9911
        },
        {
            "id": "hkieo9x",
            "score": 5,
            "text": "Disturbing to say the least",
            "title_similarity": "0.07871242",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hkih6k5",
            "score": -5,
            "text": "I wonder how many of these deaths are triggered by the fact that the woman does not want to have intercourse.",
            "title_similarity": "0.6756918",
            "sentiment_compound": -0.0572
        },
        {
            "id": "hkisiqu",
            "score": -4,
            "text": "Let’s add icing on this cake! Our maternal care is pretty much the worst of first world countries and similar to a third world country. \n\nWe SCHEDULE C-sections for gods sake!\n\nSuper high infants mortality rates\n\nNot uncommon for women to bleed out post birth\n\nOne of the Keys out of all of the this: Education \n\nKeep people dumb, their much easier to manipulate and control.",
            "title_similarity": "0.7048734",
            "sentiment_compound": 0.7418
        },
        {
            "id": "hkhe4dn",
            "score": 587,
            "text": "Interesting article but hardly surprising. Pregnancies and childbirths are sources of stress in a couple, if there's already domestic violence or other risk factors that's got good chance to trigger some sort of nightmarish downward spiral.",
            "title_similarity": "0.62412786",
            "sentiment_compound": -0.5558
        },
        {
            "id": "hkjwp4z",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.005057005"
        },
        {
            "id": "hkgwwbe",
            "score": 348,
            "text": "From the article: \n\n>\n>>The researchers found that US women who are pregnant or were pregnant in the past 42 days (the post-partum period) die by homicide at more than twice the rate that they die of bleeding or placental disorders — the leading causes of what are usually classified as pregnancy-related deaths. Also, becoming pregnant increases the risk of death by homicide: between the ages of 10 and 44 years, women who are pregnant or had their pregnancy end in the past year are killed at a rate 16% higher than are women who are not pregnant.\n\n>\n>\n\nHomicide During Pregnancy and the Postpartum Period in the United States, 2018–2019\n\n\n>OBJECTIVE: \n\n>>To estimate the national pregnancy-associated homicide mortality ratio, characterize pregnancy-associated homicide victims, and compare the risk of homicide in the perinatal period (pregnancy and up to 1 year postpartum) with risk among nonpregnant, nonpostpartum females aged 10–44 years.\n\n>\n>METHODS: \n\n>>Data from the National Center for Health Statistics 2018 and 2019 mortality files were used to identify all female decedents aged 10–44 in the United States. These data were used to estimate 2-year pregnancy-associated homicide mortality ratios (deaths/100,000 live births) for comparison with homicide mortality among nonpregnant, nonpostpartum females (deaths/100,000 population) and to mortality ratios for direct maternal causes of death. We compared characteristics and estimated homicide mortality rate ratios and 95% CIs between pregnant or postpartum and nonpregnant, nonpostpartum victims for the total population and with stratification by race and ethnicity and age.\n\n>\n>RESULTS: \n\n>>There were 3.62 homicides per 100,000 live births among females who were pregnant or within 1 year postpartum, 16% higher than homicide prevalence among nonpregnant and nonpostpartum females of reproductive age (3.12 deaths/100,000 population, P<.05). Homicide during pregnancy or within 42 days of the end of pregnancy exceeded all the leading causes of maternal mortality by more than twofold. Pregnancy was associated with a significantly elevated homicide risk in the Black population and among girls and younger women (age 10–24 years) across racial and ethnic subgroups.\n\n>\n>CONCLUSION: \n\n>>Homicide is a leading cause of death during pregnancy and the postpartum period in the United States. Pregnancy and the postpartum period are times of elevated risk for homicide among all females of reproductive age.",
            "title_similarity": "0.92665803",
            "sentiment_compound": -0.9829
        },
        {
            "id": "hki90nc",
            "score": 16,
            "text": "I wonder what impact reducing access to abortion will have on these numbers….",
            "title_similarity": "0.51313394",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkhskjr",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkjy64x",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhs1p2",
            "score": 28,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkjuu70",
            "score": 11,
            "text": "Why are black women at such heightened risk of homicide while pregnant vs. other races?",
            "title_similarity": "0.81440794",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hkhtc6u",
            "score": 131,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkh4s4b",
            "score": 378,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkh8n8e",
            "score": 3580,
            "text": "Comments are a mess of people not reading. Here's an exerpt, emphasis mine:\n\n\"On the basis of years of study, specialists in intimate-partner violence expect **women who are already in abusive relationships to be at increased risk of homicide if they become pregnant**. Wallace and her co-authors say that about **two-thirds of the homicides recorded in their data occurred in the person’s home, suggesting that the woman was killed by her partner. It’s not a perfect indicator**, Wallace says, “but it’s all we’ve got in these data”.\"\n\nAdditionally:\n\n\"Black women are similarly at heightened risk of death from obstetric causes. Overall, Black women who are pregnant or were recently pregnant **die of pregnancy-related causes 2.5 times as often** as non-Hispanic white women, according to the CDC.\"\n\nEdit to correct an error. I am not an expert in these fields, this is an excerpt from the linked article.",
            "title_similarity": "0.83125216",
            "sentiment_compound": -0.9847
        },
        {
            "id": "hkhs4kq",
            "score": 27,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkhh6kq",
            "score": 377,
            "text": "A quick summary of this study:\n\nThe research paper cited by the article is a study based on data from the National Center for Health Statistics for homicide rates among pregnant woman & mothers within 1 year postpartum, vs non-pregnant, non-postpartum females at a reproductive age. Out of 3.62/100,000 pregnant women were murdered vs 3.12/100,000 non pregnant. **This means on average, 266 women in the US that are pregnant or gave birth within a year ago are murdered**",
            "title_similarity": "0.8249668",
            "sentiment_compound": -0.8689
        },
        {
            "id": "hkhaent",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.054836318"
        },
        {
            "id": "hkhlre8",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkholpc",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hki0icx",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hki8fxu",
            "score": 6,
            "text": "What are the statistics of the other minorities in the US? Wasn't aware of this being so common",
            "title_similarity": "0.50103784",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkib2et",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057009"
        },
        {
            "id": "hkiep2u",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057009"
        },
        {
            "id": "hkif87i",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057009"
        },
        {
            "id": "hkihcho",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.005057009"
        },
        {
            "id": "hkit3h9",
            "score": 1,
            "text": "Now this is a dysfunction that terrifies me. Its one that is brought on by poverty and despair but also a level of internalized self hate.",
            "title_similarity": "0.40305185",
            "sentiment_compound": -0.9011
        },
        {
            "id": "hkiuqwu",
            "score": 1,
            "text": "Well done to the USA for taking this radical step to reduce emissions.",
            "title_similarity": "0.31148702",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hkivl1g",
            "score": 1,
            "text": "I wonder if the partner is weighing cost over time of having to support an unwanted child versus possibly doing prison time for murder. I doubt it is common as these are likely impulsive acts and are from known abusers of DV, but I still wonder if any of those assholes do the calculation.",
            "title_similarity": "0.54182976",
            "sentiment_compound": -0.9161
        },
        {
            "id": "hkix03q",
            "score": 1,
            "text": "Uhhh, woman age 10-24 are at higher risk of homicide? 10?!?",
            "title_similarity": "0.742851",
            "sentiment_compound": -0.4464
        },
        {
            "id": "hkix086",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057009"
        },
        {
            "id": "hkiygkk",
            "score": 1,
            "text": "not sure if this is good news that medicine had advanced so far or bad news that people are still horrible",
            "title_similarity": "0.5535427",
            "sentiment_compound": -0.6515
        },
        {
            "id": "hkj44v6",
            "score": 1,
            "text": "Says more about our economy than anything else tbh.",
            "title_similarity": "0.3590232",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkj86m3",
            "score": 1,
            "text": "What's going on, world?",
            "title_similarity": "-0.06738651",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkj8xa8",
            "score": 1,
            "text": "So the USA has an intentional homicide rate of 4.7 per 100,000 , that's mostly loaded towards young men but also young women. \n\nThere were 3.62 homicides per 100,000 live births among females who were pregnant or within 1 year postpartum\n\nConsidering the wide age bands and wide period covered post-partum I'd wonder whether some of this might be a case of Simpsons paradox since both mortality and pregnancy seems heavily loaded towards the young.",
            "title_similarity": "0.8520447",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hkjgsh5",
            "score": 1,
            "text": "Just wanted to add that the second leading cause of death among pregnant women is suicide.",
            "title_similarity": "0.804755",
            "sentiment_compound": -0.8555
        },
        {
            "id": "hkjlf7k",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkjtvww",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkjxpoc",
            "score": 1,
            "text": "Thank you Jon Stwart for talking about this very subject this week on his show What’s the Problem with Jon Stwart. \n\nCirculate this article multiple times for all the people in the back!!!",
            "title_similarity": "0.39089435",
            "sentiment_compound": -0.2677
        },
        {
            "id": "hkk01d6",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.054836318"
        },
        {
            "id": "hkk0sz5",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkk4hib",
            "score": 1,
            "text": "Why, whats it even doing in there, does the pride flag have anything to do with this?!",
            "title_similarity": "0.09553326",
            "sentiment_compound": 0.4003
        },
        {
            "id": "hkkhxws",
            "score": 1,
            "text": "Now factor in economic hardship among the African community and it gets clearer.\nOne more reason why there are so many single black mothers.",
            "title_similarity": "0.645921",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hkkjqtq",
            "score": 1,
            "text": "It is not surprising ,cause there are so much pressure for a connubial life which would have a baby soon ,and pregnant maternal is vulnerable ,so their masculine parter woud use them as a vent  when the pressure makes them on a tipping point and triggered finally.",
            "title_similarity": "0.5045529",
            "sentiment_compound": -0.7501
        },
        {
            "id": "hkkjsiv",
            "score": 1,
            "text": "In Ireland there's a standard set of appointments that women attend when they're pregnant, that go on throughout the pregnancy. \n\nThe partner is permitted to attend all of these no matter how intimate they are (if the woman wants) but there is one appointment where the partner will be explicitly told to remain outside. \n\nAs it may be the only time in years that a woman is alone with a healthcare provider, they take the time to explicitly ask if there's a history of DV and to explain the dangers for pregnant women specifically, and provide information on how to get help.\nThey also use the time to talk mental health and how to identify if you're developed pregnancy &related depression.",
            "title_similarity": "0.51499367",
            "sentiment_compound": -0.8533
        },
        {
            "id": "hkkkt8m",
            "score": 1,
            "text": "To quote \"becoming pregnant increases the risk of death by homicide: between the ages of 10 and 44 years\"  It seems a bit problematic to include 10 year olds.  I don't know anything about murder rates broken down by age, but I would hazard that (particularly young) teens who are pregnant are not in the most stable of situations, and more likely to be murdered than the general population regardless of whether they are pregnant or not.",
            "title_similarity": "0.82451963",
            "sentiment_compound": -0.9137
        },
        {
            "id": "hkkprm7",
            "score": 6,
            "text": "I don't understand the race dimension. Are they comparing black and white non-Hispanic women after they controlled for being in an abusive relationship? Or is the comparison to white women as a whole?",
            "title_similarity": "0.6569892",
            "sentiment_compound": -0.6767
        },
        {
            "id": "hkkrrco",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.005057052"
        },
        {
            "id": "hkkt40b",
            "score": 1,
            "text": "We should make that illegal right away!",
            "title_similarity": "0.18920776",
            "sentiment_compound": -0.5983
        },
        {
            "id": "hkktufq",
            "score": 1,
            "text": "Well, it's time to realise that having a good, stable family in a safe neighborhood is a privilige few have.",
            "title_similarity": "0.1758633",
            "sentiment_compound": 0.8442
        },
        {
            "id": "hkkudr7",
            "score": 1,
            "text": "This is absolutely horrifying.\n\nWe need to wake up in this country. Our society is clearly not well. Our culture is sick.",
            "title_similarity": "0.44235772",
            "sentiment_compound": -0.7512
        },
        {
            "id": "hkkvmt1",
            "score": 1,
            "text": "Starts off about women then slip black in there",
            "title_similarity": "0.43672854",
            "sentiment_compound": 0.0
        },
        {
            "id": "hkkwk1t",
            "score": 1,
            "text": "This is odd and disturbing",
            "title_similarity": "0.12566242",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hkl3cx0",
            "score": 1,
            "text": "This feels like it’s trying to say something about violence against women but it really just shows you that modern medicine saves lives by the tens of millions.",
            "title_similarity": "0.680953",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hklbx4f",
            "score": 1,
            "text": "Make child control free and more available, and hopefully those numbers will decrease",
            "title_similarity": "0.26230568",
            "sentiment_compound": 0.7402
        },
        {
            "id": "hkouz6r",
            "score": 1,
            "text": "Not-so-fun fact: the leading cause of death during pregnancy in NZ is suicide.",
            "title_similarity": "0.72090995",
            "sentiment_compound": -0.8555
        },
        {
            "id": "hkpv4xj",
            "score": 1,
            "text": "I'd be curious about what states have it more. The original study is behind a pay wall. They factor in ages as young as 10 year old pregnant I'd say women but little girls. My guess is lack of health care and probably even abortion laws but can't say for sure. They pull the race card on this too but I'm gonna guess it's more of a wealth and state law card.",
            "title_similarity": "0.6834856",
            "sentiment_compound": 0.7809
        },
        {
            "id": "hksdvj1",
            "score": 1,
            "text": "You mean… people in poverty and cuz rasict :( are at a higher risk, of dying by pregnancy and it’s feminists because females literally are the only sex that can get pregnant?",
            "title_similarity": "0.7919838",
            "sentiment_compound": -0.8074
        },
        {
            "id": "hkv80yg",
            "score": 1,
            "text": "Woh, cool it with the racism",
            "title_similarity": "0.13969326",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hn9suol",
            "score": 1,
            "text": "If you kill a pregnant lady does it count as a double-kill?",
            "title_similarity": "0.71762383",
            "sentiment_compound": -0.6908
        }
    ]
}