{
    "Mask-wearing cuts Covid incidence by 53%. Results from more than 30 studies from around the world were analysed in detail, showing a statistically significant 53% reduction in the incidence of Covid with mask wearing\n": [
        {
            "id": "hl3zl9o",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.3131312",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hl3zq3r",
            "score": 46,
            "text": "Mask-wearing is the single most effective public health measure at tackling Covid, reducing incidence by 53%, the first global study of its kind shows.\n\nVaccines are safe and effective and saving lives around the world. But most do not confer 100% protection, most countries have not vaccinated everyone, and it is not yet known if jabs will prevent future transmission of emerging coronavirus variants.\n\nGlobally, Covid cases exceeded 250 million this month. The virus is still infecting 50 million people worldwide every 90 days due to the highly transmissible Delta variant, with thousands dying each day.\n\nNow a systematic review and meta analysis of non-pharmaceutical interventions has found for the first time that mask wearing, social distancing and handwashing are all effective measures at curbing cases – with mask wearing the most effective.\n\n“This systematic review and meta analysis suggests that several personal protective and social measures, including handwashing, mask wearing, and physical distancing are associated with reductions in the incidence of Covid-19,” the researchers wrote in The BMJ.\n\nThey said the results highlight the need to continue mask wearing, social distancing and handwashing alongside vaccine programmes.\n\nResearchers at Monash University and the University of Edinburgh say multi-faceted measures, such as lockdowns and closures of borders, schools and workplaces need further analysis to assess their potential negative effects on populations.\n\nhttps://www.bmj.com/content/375/bmj-2021-068302",
            "title_similarity": "0.7800636",
            "sentiment_compound": 0.9237
        },
        {
            "id": "hl4l3hm",
            "score": -1,
            "text": "Don't forget about distancing. Get vaxxed, wear a mask and keep distance when possible, that's the reduce the spread formula™",
            "title_similarity": "0.12510493",
            "sentiment_compound": 0.1695
        },
        {
            "id": "hl4sy12",
            "score": -2,
            "text": "If Republicans could read they would still reject this",
            "title_similarity": "0.24674554",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hl4djee",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl4d5y2",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl4er3z",
            "score": 26,
            "text": "But wait, I thought the narrative being pushed was that masks don’t work. You mean to tell me if someone wears a mask, spits water/vapor droplets that get caught in the mask preventing spread of at least some of those droplets is actually doing something to help?! You don’t say…",
            "title_similarity": "0.29580003",
            "sentiment_compound": 0.5707
        },
        {
            "id": "hl4ddd1",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl4e8be",
            "score": -9,
            "text": "Sometimes I'm ashamed that we've fell to the level of some not so rationally thinking countries. We had study made by health ministry (spring 2020) that concluded there wasn't significant benefit in wearing mask. \n\nSure the biggest reason was there weren't enough for general population back then, but they undermined the usage of masks so badly.\n\nFinland...fcking Finland. Generally we do believe in science and are down to earth pragmatic ppl. Unfortunatly not always...",
            "title_similarity": "0.50386465",
            "sentiment_compound": -0.9037
        },
        {
            "id": "hl44b91",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl411b0",
            "score": 43,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl4hfm3",
            "score": 8,
            "text": "I live in a country where masks are still mandatory and where a high percentage of the population is wearing them and our COVID numbers are lower then ever.",
            "title_similarity": "0.63169914",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hl4png2",
            "score": 8,
            "text": "We've know this for more than 100 years. The Spanish Flu told us so. It's a no-f\\*cking brainer. I mean, it doesn't take a brain surgeon to realize that covering one's nose and mouth reduces the spread. Jeez. The people who claim they don't work are irresponsible and directly contribute to the pain, suffering and deaths of untold numbers of friends, family and others.",
            "title_similarity": "0.6352391",
            "sentiment_compound": -0.5414
        },
        {
            "id": "hl4k7il",
            "score": 5,
            "text": "Pretty sure that would mean that if everyone got vaccinated and wore a mask the R0 would go below 1 and the disease could be eradicated.  Instead we know that humans won't do that, so we are just aiming for endemic.  I gave up on humanity uniting but seeing info like this has such a big 'what if' effect.",
            "title_similarity": "0.48463082",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hl4sd60",
            "score": 11,
            "text": "It's been 2 years since COVID. We are still here arguing about the most basic.",
            "title_similarity": "0.5057992",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hl4fmj3",
            "score": 52,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl4w7xc",
            "score": -1,
            "text": "Gonna have to post that on Facebook so they can “research”.",
            "title_similarity": "0.25500497",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4tw1u",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl4gv2b",
            "score": 27,
            "text": "Went two years without a common cold. Enjoyed that. Mask also helped my allergies a bit… not entirely, but a noticeable bit.",
            "title_similarity": "0.48873377",
            "sentiment_compound": 0.2846
        },
        {
            "id": "hl4yuqi",
            "score": 3,
            "text": "So far at school board meetings I’ve heard:\n\nThey don’t work. \nThey make people sick. \nThey kill people. \nMasks are for pedophiles and are actually just a sexual fetish \nAnd more talk about microns from people who can’t rationalize anything remotely scientific.",
            "title_similarity": "0.48497272",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hl4o9w1",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl4wvbu",
            "score": 1,
            "text": "Some people look at me weird when I wear my mask in public. One redneck asked me why I said, \"to avoid Joe Biden's unvaxinated facial recognition programs.\" Wish I could have recorded his concerned and confused looking face.",
            "title_similarity": "0.40421867",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hl4tq6y",
            "score": -32,
            "text": "They didn't say what kind of mask. It's probably N95. \nThere is no way that a piece of fabric is going to stop inhaled particles. They want us to wear masks forever ?",
            "title_similarity": "0.2745734",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hl4s7e1",
            "score": -2,
            "text": "Considering most of the masks worn are fabric or medical \"style\" non-medical masks, that's an impressive figure.  Just imagine how much further the infection rate could be beaten down if people wore actual respirators like KF94's or other N95 equivalents.",
            "title_similarity": "0.60061145",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hl4vww2",
            "score": -6,
            "text": "\"Masks make Covid 47 percent more infectious!\"-every brainless anti vaxxer",
            "title_similarity": "0.44721496",
            "sentiment_compound": -0.4321
        },
        {
            "id": "hl4z9lq",
            "score": -1,
            "text": "Its not an 'incident' its a deadly disease. Stop being an ignorant moron and use the damn masks.",
            "title_similarity": "0.16745526",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hl4jzz1",
            "score": -19,
            "text": "Moderate risk of bias\nThe study is sound for a non-randomized study with regard to this domain but cannot be considered comparable to a well-performed randomized trial.\n\nSerious risk of bias\nThe study has some important problems in this domain.\n\nCritical risk of bias\nThe study is too problematic in this domain to provide any useful evidence on the effects of intervention.",
            "title_similarity": "0.24643876",
            "sentiment_compound": -0.9186
        },
        {
            "id": "hl4o87g",
            "score": -9,
            "text": "Repeating it loudly for the stupid at the back",
            "title_similarity": "0.22958346",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hl6lj7o",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl501tn",
            "score": 4,
            "text": "I just want to know why nobody is talking about this: \n\nhttps://mb.ntd.com/fda-asks-court-for-55-years-to-fully-release-pfizer-covid-19-vaccine-data_703326.html",
            "title_similarity": "0.50313336",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hl4k4gz",
            "score": -4,
            "text": "There's that much reduction when it's all masks types, all wearing styles (as in, not wearing it correctly and consistently), and with people taking risky behaviour (like going to a bar unmasked at the height of the pandemic).\n\n&#x200B;\n\nImagine the results if every just properly wore n95-like masks and didn't act stupid.",
            "title_similarity": "0.49975666",
            "sentiment_compound": 0.5386
        },
        {
            "id": "hl544c5",
            "score": -4,
            "text": "I am simply pointing out how ineffective masks are at preventing transmission of the virus.  Consider this..there is a new airline that delivers passengers from point A to point B without crashing 53% of the time.  If there is a pool of 1000 passengers and the plane carries 100 people, how many flights can it make before it runs out of people?\nThe answer is Zero.  No one would ever board the plane.  The same logic applies here.  \n\nMasks are great for virtual signaling and dividing us all but are very poor at stopping the spread of the virus.",
            "title_similarity": "0.58649355",
            "sentiment_compound": -0.7379
        },
        {
            "id": "hl4rmtt",
            "score": -9,
            "text": "Good to know for future lethal diseases.\n\nAs for Covid have we not moved on now? Are we not all going to get this disease like influenza and the cold? Here more and more people seems to belive in \"Get vaccinated and live your lives.\" Without facemasks. Let's face it, they are freaking annoying to wear. Reason why only about 2% kept wearing them after they stopped being mandatory here.",
            "title_similarity": "0.613595",
            "sentiment_compound": -0.264
        },
        {
            "id": "hl4sqws",
            "score": -10,
            "text": "Only a N 95 mask will blah blah blah- should be added to this head line",
            "title_similarity": "0.29544592",
            "sentiment_compound": -0.296
        },
        {
            "id": "hl50g04",
            "score": 10,
            "text": "The facts are, being afraid of the virus at this point is a choice. You can get the vaccine, Pfizer is soon to release a therapeutic you take once have actually tested positive for covid. It barely poses any risk to non-elderly, healthy people in the first place.\n\nIf you want to wear a mask for the rest of your life, that’s your choice. Should there be mandates forcing everyone else to do the same for the unforeseeable future? A rational person would say no. \n\nPSA: Being on a science subreddit doesn’t mean you are smarter than everyone else.",
            "title_similarity": "0.38526565",
            "sentiment_compound": 0.83
        },
        {
            "id": "hl4h358",
            "score": -26,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl4w8jt",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl500b0",
            "score": -7,
            "text": "Haven't worn a mask the whole time... Never gotten covid..",
            "title_similarity": "0.2530081",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hl4wzvd",
            "score": -2,
            "text": "I still wear a mask everywhere except for home.  Its warm and safe behind the mask.",
            "title_similarity": "0.16344586",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hl5a2nk",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl6j662",
            "score": 0,
            "text": "This is complete fallacy. There were no groups not wearing masks to compare against. Stop spreading this stupidity. Without a control group, the stats mean nothing",
            "title_similarity": "0.40167922",
            "sentiment_compound": -0.743
        },
        {
            "id": "hl6o3j0",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl4w123",
            "score": -1,
            "text": "Listens to whining “But masks can’t work, the holes are bigger than the virus.” Gosh it’s almost as if breaking the habit of touching your face with your gross hands has a significant effect?!?!",
            "title_similarity": "0.37738377",
            "sentiment_compound": -0.6303
        },
        {
            "id": "hl4wrxq",
            "score": 3,
            "text": "My own personal anecdote is that since masks have been around I haven’t gotten sick 1 time. Even after flying a few times, which used to be automatic that I knew I would get sick after. \n\nI’ll be keeping my mask for awhile.",
            "title_similarity": "0.49465108",
            "sentiment_compound": -0.765
        },
        {
            "id": "hl5owex",
            "score": 0,
            "text": "Then how is Florida prospering with no mandates of anything yet some places are STILL seeing spikes with mandates?",
            "title_similarity": "0.35858983",
            "sentiment_compound": -0.296
        },
        {
            "id": "hl4b4qa",
            "score": 78,
            "text": "I only see six mask studied in the paper, none of them actual experimental studies.",
            "title_similarity": "0.46855584",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4qr9o",
            "score": 3,
            "text": "Everyone get vaccinated, everyone wear a mask, no more lockdowns.",
            "title_similarity": "0.2595724",
            "sentiment_compound": -0.296
        },
        {
            "id": "hl66ejv",
            "score": -1,
            "text": "i don't know why we need 30 new studies - we know masks work its been studied for decades. The problem is they are not 100% effective and somehow the masses via manipulation take an all or nothing approach if it doesn't work 100% it must not work at all....  And not enough effort was put forth to explain it.  Can't tell you how many people ive heard say they don't wear a mask because they been proven not to work.....no they have been proven not to work ALL the time.   \n\nI always say There is only a .02% chance of you getting in a car accident yet you wear a seatbelt right?  THis is a 30 - 50% chance to keep you and other safe......\n\nIgnorance is the problem and a better effort to explain that a minimum its a 30% reduction and explain how important that 30% is .  But instead of educational infographics spreading wild consipiracies spreaking like they are 0% effective but only being pushed becuase X person owns X shares in X med tech company selling them .",
            "title_similarity": "0.64870286",
            "sentiment_compound": 0.8236
        },
        {
            "id": "hl69mfp",
            "score": -1,
            "text": "Don't just wear a mask. Wear a proper mask properly.",
            "title_similarity": "-0.025166688",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7js4c",
            "score": -1,
            "text": "They have no citations in the article. This is mis-informative.",
            "title_similarity": "0.16180229",
            "sentiment_compound": -0.296
        },
        {
            "id": "hl45l1q",
            "score": 46,
            "text": "Can anyone link me to the actual study they're apparently quoting? The article just says 'a study shows', but they never say which study, or link to it. \n\nThey don't even say how many people were studied, how they were studied or provide the link? \n\nAnyone?",
            "title_similarity": "0.38378066",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl40r6t",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl7se8v",
            "score": 0,
            "text": "Stop wasting my time with facts and science! Only politicians and obscure right wing news channels tell the truth!",
            "title_similarity": "0.30461317",
            "sentiment_compound": -0.4912
        },
        {
            "id": "hl4m33i",
            "score": 5,
            "text": "Florida would like to have a word.",
            "title_similarity": "-0.035998996",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hl4uqpn",
            "score": 5,
            "text": "What kind of masks?\nHow are they wearing them?\nHow long can the masks be worn for?\n\nWithout controlling for these (and other) variables these results don’t mean much",
            "title_similarity": "0.29038948",
            "sentiment_compound": -0.4098
        },
        {
            "id": "hl4y3cc",
            "score": 7,
            "text": "This is why I triple mask. That way I get 159% protection",
            "title_similarity": "0.31204656",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl53mhl",
            "score": 5,
            "text": "Trash science. Nothing experimental, might as well be anecdotal evidence.",
            "title_similarity": "0.17680125",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hl54dra",
            "score": 11,
            "text": "[deleted]",
            "title_similarity": "0.118070446"
        },
        {
            "id": "hl4j1ti",
            "score": 7,
            "text": "In the country where I live, there is no obligation or penalty to wear a mask, but almost everyone wears one.\nAlthough there is no obligation or penalty to vaccinate, 75.7% of the total population, including children, have completed the second dose of the vaccine.\nThere has never been a lockdown. There is freedom and self-discipline here at the same time.\nThe population is 126 million, but the number of infected people announced today is 163.\nI live in Japan. No one is forcing me to do this, but until a safe and effective medication becomes widely available, I will not be removing my mask.",
            "title_similarity": "0.5015707",
            "sentiment_compound": 0.8661
        },
        {
            "id": "hl4o7iu",
            "score": 1,
            "text": "Sweden - \"Absolutely not.\"",
            "title_similarity": "0.06471243",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl6mnjc",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl4ggrq",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl4x022",
            "score": -2,
            "text": "Wonder who funded these studies.",
            "title_similarity": "0.08923909",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4c823",
            "score": 323,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl4whc0",
            "score": 1,
            "text": "I was told it was like 90",
            "title_similarity": "0.21148045",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hl7mswm",
            "score": 1,
            "text": "Yep. Here in Tokyo, where masks have always been a thing we are averaging 21 cases a day now. \n\nThis simple effortless task plus a vaccination rate approaching 80% has made a massive difference.",
            "title_similarity": "0.704175",
            "sentiment_compound": 0.296
        },
        {
            "id": "hl7vpci",
            "score": 1,
            "text": "It's really disingenuous for the article to say: \"Mask-wearing is the single most effective public health measure at tackling Covid..\"\n\nThe best vaccines make you immune to covid.  The vaccines are objectively the most effective measure.  Plenty of masks before the vaccines were available and a lot more people died.",
            "title_similarity": "0.5432697",
            "sentiment_compound": 0.8522
        },
        {
            "id": "hl43jg4",
            "score": 435,
            "text": "The percent effectiveness is probably even higher when the masks are worn properly. When masks were mandated where I live I couldn’t tell you how many people I saw with the mask over the mouth only, leaving the nose exposed.",
            "title_similarity": "0.52032644",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hl6ix20",
            "score": 7,
            "text": "If the majority of the functional population around the world:\n\n \\- Were not couch potatoes  \n \\- Exercised regularly  \n \\- Ate well\n\nThe impact of COVID would have been reduced beyond what you would get by wearing 10 masks even.\n\nYES, there are exceptions: some healthy people die from COVID too, but it is rare.\n\nThe basic things guys. Take care of your body and you won't have to worry about such things ...",
            "title_similarity": "0.59573567",
            "sentiment_compound": 0.8616
        },
        {
            "id": "hl4dza7",
            "score": -19,
            "text": "I think this says there's a 50% chance that people don't use masks properly.\n\nMasks work else hospital workers would have a 50% chance of being infected every time they encounter someone with covid.",
            "title_similarity": "0.78948474",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hl585xw",
            "score": 10,
            "text": "Sorry this is poor science and has already been debunked elsewhere in the literature and in real-life\n\nhttps://www.cato.org/working-paper/evidence-community-cloth-face-masking-limit-spread-sars-cov-2-critical-review\n\nIf real-life non-FFP3 / paper mask mandates worked then we would see huge differences in US states, we don't\n\nAnd back in real-life mask-free Sweden they appear to have avoided the 4th and 5th waves smashing other countries\n\nStop pretending COVID is simple please",
            "title_similarity": "0.49144813",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hl4kvaq",
            "score": 4,
            "text": "Unfortunately, wearing a mask or not has become a political struggle in the United States of America today.  The mask has become a political symbol.",
            "title_similarity": "0.26566806",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hl4x0ek",
            "score": -5,
            "text": "\"See? Studies show it doesn't work all the time.\" -Every anti-mask/vax/mitigation strategy-er out there\nThe truth of the matter is, no facts, no study regardless of how extensive, no research, no evidence is going to convince those people to do their part.",
            "title_similarity": "0.3159949",
            "sentiment_compound": 0.4168
        },
        {
            "id": "hl4hcx0",
            "score": 8,
            "text": "Are these statistics on kn95 masks, every mask, or what?",
            "title_similarity": "0.40592492",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4xhg8",
            "score": -7,
            "text": "BuT tHe mASkS dOnT hELp!!!!",
            "title_similarity": "0.10352324",
            "sentiment_compound": -0.6193
        },
        {
            "id": "hl4pynw",
            "score": 25,
            "text": "I don't want to start a debate for or against, but one thing I have been curious about is with COVID confirmed to be aerosolized, why would generic cloth masks be effective?  N95 masks I imagine are different, but most places just want generic cloth face coverings. \n\nCould someone explain this to me?",
            "title_similarity": "0.35698062",
            "sentiment_compound": 0.8479
        },
        {
            "id": "hl4iflh",
            "score": 50,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl4j6kt",
            "score": -6,
            "text": "Do you hear that Holland?  Most of the people that live there refuse to wear masks.  Only mandatory on the when you ride the transit systems.",
            "title_similarity": "0.48314148",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hl54a0e",
            "score": -5,
            "text": "Genuine question: how does this square with the CDC data we’ve had for the greater part of this year stating that masks were barely effective in preventing the spread?",
            "title_similarity": "0.6699394",
            "sentiment_compound": 0.6674
        },
        {
            "id": "hl4iviy",
            "score": 2,
            "text": "Interesting that the article does not link to the actual study",
            "title_similarity": "0.16557185",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hl53l4s",
            "score": -3,
            "text": "Dang, masks are way better for preventing spread and infection than the vaccines are. Might need to whip up a new batch.",
            "title_similarity": "0.31468564",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hl7v0tw",
            "score": 2,
            "text": "But my freedom! \n\nHang on, I gotta go join my friends at the abortion place we’re protesting",
            "title_similarity": "0.22852513",
            "sentiment_compound": 0.8845
        },
        {
            "id": "hl4cm5e",
            "score": 116,
            "text": "Not completely accurate. While the paper reviews more than 30 studies, only 6 related to masking. Not arguing mask effectiveness or study results, just stating that the headline is inaccurate and implies greater significance to the results. Most of the topics of the paper (hand washing, lock downs, social distancing, etc) only evaluated 1-5 studies. Over thirty studies were conducted on about a dozen different topics.",
            "title_similarity": "0.7526407",
            "sentiment_compound": 0.8512
        },
        {
            "id": "hl40ugb",
            "score": -68,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl505p3",
            "score": 2,
            "text": "https://www.bmj.com/content/375/bmj-2021-068302\n\n>72 studies met the inclusion criteria, of which 35 evaluated individual public health measures and 37 assessed multiple public health measures as a “package of interventions.” Eight of 35 studies were included in the meta-analysis, which indicated a reduction in incidence of covid-19 associated with handwashing (relative risk 0.47, 95% confidence interval 0.19 to 1.12, I2=12%), mask wearing (0.47, 0.29 to 0.75, I2=84%), and physical distancing (0.75, 0.59 to 0.95, I2=87%).\n\nAm I reading this right?  They had 72 studies that matched what they were looking for but they filtered it down to 8 because they didn't like the other 64?  Isn't this just creating the conclusion first and then finding studies to satisfy your conclusion?",
            "title_similarity": "0.66984046",
            "sentiment_compound": 0.2831
        },
        {
            "id": "hl52pwg",
            "score": 3,
            "text": "It won’t matter.  It is and will remain endemic.",
            "title_similarity": "-0.08148202",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hl7v1u0",
            "score": 3,
            "text": "Its not a “we don’t have enough information” problem, but rather a “i dont care about the information you’re giving me”. \n\nWe’ve known masks work. We knew they were effective enough to warrant making them a mandate. But people still refuse to wear them “just cause”. I saw people on my flight today that were talking with it off.",
            "title_similarity": "0.33249524",
            "sentiment_compound": 0.0408
        },
        {
            "id": "hl4536u",
            "score": 573,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl54zaz",
            "score": -7,
            "text": "There is video proof showing masks don’t work",
            "title_similarity": "0.29724962",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4mewp",
            "score": 0,
            "text": "CDCs Director just said up to 80% effective. Although she didn't provide any data.",
            "title_similarity": "0.5340041",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hl4mmz6",
            "score": 0,
            "text": "How do researchers isolate the protectiveness of masks vs other factors? For example, I would imagine that someone who still wears a mask in public most likely also washes their hands thoroughly, socially distances when possible, doesn’t go out when they feel sick, etc.. whereas someone who refuses to wear a mask will (likely) take fewer of the above preventative measures.\n\nAre masks actually reducing COVID incidents by 53% or are they just an easy indicator of communities that are going the extra mile in all regards to stop the spread?",
            "title_similarity": "0.5191232",
            "sentiment_compound": -0.5803
        },
        {
            "id": "hl4vvny",
            "score": 0,
            "text": "They really should be more precise with their wording. Every study I've seen that compared the two showed that cloth masks did nothing and surgical masks were effective. People will read this and think their cloth mask is going to offer some protection.",
            "title_similarity": "0.43418074",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hl51ty8",
            "score": 0,
            "text": "My kids daycare class closed for a week last month because one of the kids brought COVID in and spread it to all of the other kids (all under 2, so unmasked). 80% of the class got it.\n\n7 teachers were tested as well (all teachers who spent any time in that daycare class). All of the teachers wear masks, and all but 1 wear them properly (the one constantly wears it under her nose). The 6 who wear them the right way all tested negative, and the last one was positive.\n\nIf you want to know that masks work - I have my real life proof right there.",
            "title_similarity": "0.7164868",
            "sentiment_compound": 0.2144
        },
        {
            "id": "hl51vos",
            "score": 0,
            "text": "It blew my mind that during the start of the pandemic, the US government didn't give out free masks. You expect people to pay for a thing that will stop the spread of a disease? So stupid.",
            "title_similarity": "0.46052444",
            "sentiment_compound": -0.8647
        },
        {
            "id": "hl532ab",
            "score": 0,
            "text": "I don't know why we didn't start wearing the mask sooner. Wearing the mask is natural and good. There are no downsides to wearing the mask.",
            "title_similarity": "0.039324734",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hl5364m",
            "score": 0,
            "text": "Here in Japan, we're getting to 80 percent soon hopefully, and almost everyone has a mask on still.\n\nYesterday there were fewer than 20 cases in Tokyo. Let me repeat Tokyo. I'm in a neighboring prefecture. Probably half my neighbors go there daily. 1 new case in my city of some 70k today.",
            "title_similarity": "0.7143929",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hl53oaa",
            "score": 0,
            "text": "Welcome to more obvious science established almost 100 years ago.",
            "title_similarity": "0.22287199",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hl548p7",
            "score": 0,
            "text": "\"Trump won the election. Masks are just a form of control sheep. COVID IS FAKE!\" - Anti-maskers\n\nWhy are they like that?",
            "title_similarity": "0.3513239",
            "sentiment_compound": 0.3937
        },
        {
            "id": "hl54du6",
            "score": 0,
            "text": "> In 2019 there were 1282 cases of measles, in 2020 there were 13, and as of Sept 2021 there have been 6 cases of the measles.\n\nSince Sept 2021...\n> As of November 10, 2021, a total of 47 measles cases were reported by 4 jurisdictions.\n\n41 cases of the measles in the past 2 months.",
            "title_similarity": "0.76827896",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl558zz",
            "score": 0,
            "text": "Imagine how much better they would be working if everyone was wearing them PROPERLY too.",
            "title_similarity": "0.13781865",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hl55vq5",
            "score": 0,
            "text": "Oh cool, I bet this is gonna really change people's minds for those who are hesitant",
            "title_similarity": "0.12387455",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hl564x3",
            "score": 0,
            "text": "53% decrease by merely wearing a piece of cloth over your nose and mouth.",
            "title_similarity": "0.67965454",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl567ns",
            "score": 0,
            "text": "Why are we even still discussing whether or not mask-wearing is effective? It’s been known for decades. There’s a reason Asian countries do this. Stop placating the idiots that don’t believe in science and simply tell them to piss off. We don’t have to prove anything anymore about efficacy of masks.",
            "title_similarity": "0.4289779",
            "sentiment_compound": -0.7753
        },
        {
            "id": "hl56ixv",
            "score": 0,
            "text": "I hate people who act like kids and refuse to wear a damn mask with passion.\n\nIn my country when they have even a common cold, they will caugh in your back/face without feeling bad. If you're telling them something, you're the weird and the bad one...",
            "title_similarity": "0.3676147",
            "sentiment_compound": -0.7022
        },
        {
            "id": "hl57bz4",
            "score": 0,
            "text": "I would like to know who funded the studies.",
            "title_similarity": "0.05763065",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hl59end",
            "score": 0,
            "text": "What about the countries that had a mask mandate (and lockdowns) from the beginning and still had/have high numbers",
            "title_similarity": "0.43000543",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl5es5s",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl5gd7g",
            "score": 0,
            "text": "The largest single most effective data point that proved masks work effectively against spreading COVID was in Florida when the CDC announced that fully vaccinated people no longer need to wear a mask. Everyone in Florida (for the most part) stopped wearing masks and the COVID cases skyrocketed. We find out that fully vaccinated people can still catch and spread COVID and the unvaccinated felt more free to not wear masks while also catching and spreading COVID.\n\nMasks work. Should people be required to wear masks? No. Mandating masks or requiring them should still never be a thing.",
            "title_similarity": "0.51053375",
            "sentiment_compound": 0.7387
        },
        {
            "id": "hl5l398",
            "score": 0,
            "text": "It's not rocket science to know if droplets containing virus are not able to br ejected from a person's mouth into the eyes, nose or mouth of another person that the risk of transmission is lower. Same reason a doctor wears a mask during surgery although in their case it's to keep the droplets from entering open wounds or incisions. \n\nAnti-maskers just like spout how because some smaller aerosols can get thru most masks that means masks do nothing to reduce the risk.",
            "title_similarity": "0.37346947",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hl5lh7i",
            "score": 0,
            "text": "So let's get this straight:\n\nWearing a mask reduces incidence of covid by 53% \n\nBeing unvaccinated makes you 6x more likely to get covid versus vaccinated people\n\nBeing unvaccinated results in a hospitalized death rate that is 12x greater than vaccinated people\n\nAll of this has been pretty clear from the beginning, but now that a reasonable amount of time has passed, we finally have some solid real-world data to work off of.",
            "title_similarity": "0.7591935",
            "sentiment_compound": 0.5665
        },
        {
            "id": "hl5rb9l",
            "score": 0,
            "text": "I’m a diligent mask wearer and it’s required for a lot of my work as I work in close quarters with people from different parts of the country. This past year I have traveled by air 17 times, meaning I’ve taken at least 34 individual flights. I got vaccinated in February so it’s been a while, but I get tested roughly every week for work… Not once have I ever tested positive.\n\nAlmost all of my other colleagues/team members that I have worked with who are anti-mask, anti-covid restrictions, or anti-vax have had covid, sometimes while we were in close contact. \n\nI chalk it up to the masks (and to the vaccination).",
            "title_similarity": "0.66752183",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hl5rtrp",
            "score": 0,
            "text": "I have seen studies that ranged from 8% reduction to 80% reduction... when will people realize that its random and completely situational and circumstantial. I believe masks do help but i also believe there really is no real way to know exactly how much it helps. Its a virus. A virus is going to virus especially one airborne and this contagious.\n\nI wear masks when required i really feel they are most effective in situations like going to the grocery store or a less than 2 hour flight. \n\nSchools all around me have mask mandates and its been shutting down every other week due to covid cases in the classrooms. If you are in a confined unventilated building for 8 hours a day with 1000 other people... that mask isnt going to do a whole lot if several people come in with covid.\n\nThat and all the times its deemed appropriate to remove your mask human nature is just another factor thats unable to be accurately measured.\n\nI just feel its a waste of time constantly running studies on masks... whoever decides to wear them will wear them and whoever refuses will refuse no matter how much data they get. Lets focus energy on treatment studies that will significantly impact lives saved.",
            "title_similarity": "0.6970993",
            "sentiment_compound": 0.7172
        },
        {
            "id": "hl5t9wg",
            "score": 0,
            "text": "Can anyone link to the study? My friend is a dickhead and reckons masks don't do anything.",
            "title_similarity": "0.29233366",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hl5viut",
            "score": 0,
            "text": "Everyone is unanimous about surgeons and staff wearing masks in the OR. Curious why this still needs study, do the same principles change out in the public? What’s my disconnect?",
            "title_similarity": "0.36597806",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hl65zm9",
            "score": 0,
            "text": "What about natural immunity? Any science on that?",
            "title_similarity": "0.060368884",
            "sentiment_compound": 0.4329
        },
        {
            "id": "hl6qntt",
            "score": 0,
            "text": "While I'm totally not questions the effectiveness of masks. But I do question just what we're doing now that the vaccine has been available for this long. The fact is, not a single person on this planet is going to avoid getting SARS-COV2. If you haven't gotten it yet, your are going to at some point. It is here to stay. How much longer do we stick with the masks? It made plenty of sense early on, but are we just delaying the inevitable? I'm just sharing thoughts please don't get upset if you have push back for me, I'm happy to accept that. Just want to add this thought to the ether.",
            "title_similarity": "0.35948575",
            "sentiment_compound": 0.9508
        },
        {
            "id": "hl6s14x",
            "score": 0,
            "text": "Masks can't possibly have a higher reduction than vaccines after just a few months?",
            "title_similarity": "0.5274181",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl716xf",
            "score": 0,
            "text": "If it weren’t the guardian reporting this I may believe it.",
            "title_similarity": "0.13218367",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7c73n",
            "score": 0,
            "text": "The mask (N95 or similar) is a measure taken to help minimize the spread. It is effective. \n\nThe problem is there are too many people who think if the mask doesn’t work 100% (which it was never designed for) then it doesn’t work at all.",
            "title_similarity": "0.48103514",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hl7ghh6",
            "score": 0,
            "text": "Uhhh did't we already know this for like a century? Against any airborne disease, masks work.",
            "title_similarity": "0.42284882",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hl7hxan",
            "score": 0,
            "text": "But I thought it was the work of the white man trying to keep the white man down? I don't buy it, I don't buy it!!! I'm just gunna keep fake coughing on people for fun to showseses them it's nothing.\n\nSorry just noticed this was the science sub. I'll delete it myself... in a moment. Sarcasm should be flailing out every which way.",
            "title_similarity": "0.33171713",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hl7ix3x",
            "score": 0,
            "text": "How 8s this news or science at this point? \n\nScience wise.. It's like saying the earth rotates around the sun.  If you don't know this by now you're a lost cause.",
            "title_similarity": "0.36047882",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hl7o2tg",
            "score": 0,
            "text": "Literally, we have been in chemical war fare for 2 years — just me?",
            "title_similarity": "0.609612",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hl7x5rw",
            "score": 0,
            "text": "File this under NoFuckinShit/OhManWhoWouldaThought",
            "title_similarity": "0.06485565",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7zm3e",
            "score": 0,
            "text": "That... doesn't actually seem to be a lot.  Not enough to essentially mandate it everywhere.  If it is expected or even required for people to be doing this everywhere in public, I would have hoped a whole 10 fold reduction or more.  This just makes it seem like mildly effective security theater.",
            "title_similarity": "0.45000228",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hl81s1y",
            "score": 0,
            "text": "Yeah, and gay shitting caused aids too. What’s new?",
            "title_similarity": "0.34369946",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hl825us",
            "score": 0,
            "text": "Not ever going back to wearing those things.",
            "title_similarity": "0.06132377",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl83vpq",
            "score": 0,
            "text": "idgaf, won’t wear anyway.",
            "title_similarity": "0.035064984",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl8453f",
            "score": 0,
            "text": "Totally unbiased news source....",
            "title_similarity": "0.025582109",
            "sentiment_compound": -0.101
        },
        {
            "id": "hl85qan",
            "score": 0,
            "text": "So when do these “expert scientists” expect to ever stop wearing masks. When we get a vaccine that’s actually effective ?",
            "title_similarity": "0.37059686",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hl85ta1",
            "score": 0,
            "text": "You know what would help even more then wearing masks ? If we cut back on the obesity rate in the west.",
            "title_similarity": "0.43465433",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hl882f8",
            "score": 0,
            "text": "That's like, your opinion man.",
            "title_similarity": "-0.06886719",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hl8hcss",
            "score": 0,
            "text": "Is this article peer-reviewed and all that? Is it actually trustworthy? I tried looking it up at https://www.bmj.com/content/375/bmj-2021-068302 but it's just way too confusing for me. \n\n(Want to know so that I can share it without being one of those linking to something untrustworthy.)",
            "title_similarity": "0.23577416",
            "sentiment_compound": 0.5514
        },
        {
            "id": "hl97r3p",
            "score": 0,
            "text": "Bangladesh [just finished a randomised controlled trial](https://www.poverty-action.org/sites/default/files/publications/Mask_RCT____Symptomatic_Seropositivity_083121.pdf) across 600 villages and 342,000 adults, the largest randomized trial ever performed on mask wearing. They used blood samples and checked for the presence of antibodies. You will not find a better study on mask wearing. \n\nThe results showed wearing a cloth mask doesn’t work, and wearing a surgical mask reduced transmission by 11%.\n\nYour headline is a fantasy.",
            "title_similarity": "0.7576016",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hl4in9d",
            "score": -5,
            "text": "not so sure about this...\n\nhttps://www.bmj.com/content/375/bmj.n2729",
            "title_similarity": "0.21914925",
            "sentiment_compound": -0.2912
        },
        {
            "id": "hl4u1tt",
            "score": -6,
            "text": "Finally we have a number, so they're saying masks offer ~50% protection.............still not considered effective protection by all typical PPE safety standards.",
            "title_similarity": "0.7667726",
            "sentiment_compound": 0.1396
        },
        {
            "id": "hl4g18x",
            "score": -20,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl4qwtx",
            "score": 210,
            "text": "I looked at the studies that supported this claim, and I'm very wary of the result.\n\nFor one thing, the meta-analysis shows extreme heterogeneity in the results, with a I2 of 84%. In effect, you have two large studies with small confidence intervals suggesting an effect of about 15% only and 5 smaller studies with larger intervals suggesting an effect of 70%.\n\nThe largest of the latter studies is a study from China ([Xu 2020](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7669364/)) which asked participants if they wore masks outdoors and found only 100 people who didn't and over 5 000 who did. In an authoritarian country like China, with a social credit system, the type of person that would not only not wear masks but also dare tell a survey is likely a highly contrarian personality unlikely to abide by measures. So there's a lot of confounders involved.\n\nThe second largest such study is [Lio 2021](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8082215/), about people returning from high-risk countries in Macao. The sample includes only 24 infected. Again, the question is whether people wore mask outdoors, with less people reporting wearing one always in the infected than non-infected sample. Extremely small sample, and again there's confounders galore.\n\n(And honestly, I'd be curious to know if some of those who don't wear mask outdoors do not BECAUSE they have been infected, think they're immunized and so feel they don't need to protect themselves anymore. In short, if some do not wear masks because they've already been infected rather than have been infected because they don't wear masks. Speculative, but not impossible.)\n\nThe only non-Chinese one is [Doung-Ngem](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7588529/), from Thailand. This one splits off mask use in three categories: never wears them, sometimes wears them, always wears them. The study finds a small, not significant reduction of infection between those who sometimes wear them and those who never wear them, but a large reduction between those who always do and those who never do. Here, we can see the confounders in behavior and they are MASSIVE.\n\n40% of those who never wear masks share cups and dishes with others, versus 11% of those who always wear them.\n\n26% of those who never wear masks often wash their hands versus 79% of those who always do.\n\n26% of those who always wear masks keep contacts within 1 meter to less than 15 minutes, versus 12% of those who never do.\n\nThese are signs that those who always wear masks not only wear them but also act in a much more careful manner in general. They did a multivariable analysis, but when the difference is so important, it's hard to effectively separate confounders.\n\nThe less positive studies are the Danish mask study that was a randomized trial eliminating confounders and an epidemiological study of mask mandates.\n\nOverall, it really looks like the large effect is not due directly to the protective effect of masks, but simply how masks (especially when worn despite the lack of mandate, or when not worn despite huge social pressure) might act as a marker of personality.",
            "title_similarity": "0.63202167",
            "sentiment_compound": 0.3997
        },
        {
            "id": "hl4hhei",
            "score": 157,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl4j6jk",
            "score": -12,
            "text": "I was wearing a mask when the first cases were at O'Hare, Miami and Washington State. I kept wearing them when Fauci told the American public not to wear masks - it would INCREASE transmission because it would encourage them to touch their faces.   \n\n\nI kept wearing them once the whole thing had been politicized along polarized partisan lines by both the Left in the middle of a 4 year temper tantrum and the Right in the middle of suspecting \\*everything\\* happening was a plot to remove one man from office.   \n\n\nThe truth is - in any normal election cycle, the masks wouldn't have become a partisan controversy. Mandates wouldn't have been necessary to even talk about. If it had hit when Obama or Bush Jr. had been President - it wouldn't have been such a trainwreck.   \n\n\nWe turned everything into bitterly divided partisan politics and this is what we got. Even MASKS are seen as a sign of partisan affiliation.   \n\n\nI've never worn the mask for you, or your immunocompromised grandmother in the nursing home, or because \"it is the right thing to do for society.\" I do it for myself. I DGAF which side you align with and what that makes you think of me when you see me wearing a mask. I don't care if you ALL get it. The fewer of you... the better for society.",
            "title_similarity": "0.48385847",
            "sentiment_compound": 0.1263
        },
        {
            "id": "hl4jvbx",
            "score": -12,
            "text": "masks only being 53% effective seems shockingly low",
            "title_similarity": "0.57551193",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hl4kijr",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl4oa9v",
            "score": -13,
            "text": "Of course it does. But is that how we want to live our lives?",
            "title_similarity": "-0.08045305",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hl4lz94",
            "score": 1,
            "text": "Higher than the vaccine??",
            "title_similarity": "0.27058363",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4njkx",
            "score": 1,
            "text": "> Handwashing also indicated a substantial 53% reduction in Covid incidence\n\nHand washing should’ve been mandated. Wash your damn hands, people.",
            "title_similarity": "0.7105572",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hl4pi4f",
            "score": 1,
            "text": "I live in Nova Scotia, we have had a mask mandate since last summer (summer 2020) and this is so self apparent it is hilarious that there is still debate. We have low enough cases that that we can list exposure warnings via contact tracing when someone is diagnosed with covid, and looking at the exposure warnings vs the new cases subsequently announced it is pretty obvious that if everyone is social distancing + wearing masks + vaccinated the spread rate is very low. Enough so that now that pretty much everyone is vaccinated (about 80% before kids are approved) I feel very, very good about dropping the social distancing requirements (as we have been). Things are pretty much back to normal but with masks. With what I’ve seen, I’ll also feel good about masks becoming optional once we get under-12s vaccinated.",
            "title_similarity": "0.6735545",
            "sentiment_compound": 0.8654
        },
        {
            "id": "hl4pl4v",
            "score": -1,
            "text": "That's why California and New York had 50% less COVID than the southern states",
            "title_similarity": "0.7727149",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4qzbt",
            "score": 1,
            "text": "How much does vaccination help? I have a suprising ammount of people who dont think it helps against covid wich is crazy. i dont even know what to say.",
            "title_similarity": "0.40502137",
            "sentiment_compound": -0.2225
        },
        {
            "id": "hl4r0em",
            "score": -1,
            "text": "This isn't terribly surprising.  We knew from day 1 that covid was a respiratory disease that was spread either by droplets or aerosol.   We know that masks cut the transmission rate of both of those things. Only question was by how much.",
            "title_similarity": "0.52871245",
            "sentiment_compound": 0.0026
        },
        {
            "id": "hl4v12t",
            "score": -1,
            "text": "I have to be honest, its much lower than I expected. Kinda disappointing, surrounded by folks who dont wear a mask or who wear chin straps. Feeling quite exposed now.",
            "title_similarity": "0.35859522",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hl4xj96",
            "score": -1,
            "text": "53% isn’t as high as a number as I would have liked, I thought it would be a 90%+ effectiveness",
            "title_similarity": "0.5492614",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hl4z08a",
            "score": 1,
            "text": "Is there a link to all the studies / grouping of them? They still suggest that this number is only reached by: hand washing, social distancing and mask wearing, not just the latter.\n\nNothing mentioned on the variables and controls used, what settings they were in, the objective they used to determine said % rate, etc.. Are all of the above controlled in all 30 of these studies? If that's not the case, then quantifying all of these together is largely pointless.",
            "title_similarity": "0.52058613",
            "sentiment_compound": 0.6525
        },
        {
            "id": "hl4zsmk",
            "score": -1,
            "text": "Where are those redditors who say masks do not work and are not effective back in the early pandemic? All completely silent.",
            "title_similarity": "0.5145147",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hl56doj",
            "score": -1,
            "text": "Wow I guess I should wear a mask in the future.\n\nI already wear one, but I should wear one in the future too.",
            "title_similarity": "0.116119936",
            "sentiment_compound": 0.34
        },
        {
            "id": "hl588re",
            "score": 1,
            "text": "Can someone explain me, I really don't understand:\n\nIf Covid is endemic, and here to stay. And if there are vaccins protecting against severe consequences. Why is then there still such focus on avoiding the spreading ? Do we not just all get it, wether we like it or not?",
            "title_similarity": "0.25431114",
            "sentiment_compound": -0.4329
        },
        {
            "id": "hl5aufm",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl5gae0",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl5gqbe",
            "score": 1,
            "text": "Just imagine what it would due for the flu. Common cold. Any airborne virus.",
            "title_similarity": "0.33962405",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hl5syhf",
            "score": -1,
            "text": "Many people have stopped wearing masks altogether. Of those who do wear them in business settings, including pharmacies, I've noticed many wear them only over their mouth, not their nose too. Insane. There is still a pandemic going on.",
            "title_similarity": "0.61508393",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hl61x1b",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl68ec8",
            "score": -1,
            "text": "Everyone in this thread is pretending like people didn't/don't believe masks work because of some fuckbook post.\n\nNo...it were the multiple peer reviewed studies available prior to this one which concluded masks don't work in the current form of use among the general public.",
            "title_similarity": "0.5021431",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hl6e9ri",
            "score": 1,
            "text": "This is going to be \"proof\" that they don't work to conservatives.\n\n&#x200B;\n\nI hope not.  But I don't have high hopes here in America anymore.",
            "title_similarity": "0.31006238",
            "sentiment_compound": -0.2612
        },
        {
            "id": "hl6fmbh",
            "score": 1,
            "text": "This is why I will wear mine from now on. Why risk getting someone else sick because you don't want to wear a piece of paper?",
            "title_similarity": "0.30099466",
            "sentiment_compound": -0.683
        },
        {
            "id": "hl6gy0e",
            "score": -1,
            "text": "I would have liked to have seen some real numbers and this Is from someone whose favourite newspaper is the guardian",
            "title_similarity": "0.21263027",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hl6hqff",
            "score": -1,
            "text": "Most people in the UK don't bother wearing them yet people are dieing daily from it even being jabbed. I wear it in busy areas or when shopping",
            "title_similarity": "0.56532323",
            "sentiment_compound": 0.2584
        },
        {
            "id": "hl6k83q",
            "score": 1,
            "text": "\"Nu-uh!\"\n-everyone posted in the Herman Cain award subreddit",
            "title_similarity": "0.3474007",
            "sentiment_compound": 0.5848
        },
        {
            "id": "hl6lgf1",
            "score": 1,
            "text": "Always has seemed like basic common sense to me",
            "title_similarity": "0.000714086",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hl6q96c",
            "score": -1,
            "text": "Gibraltar is 100% vaccinated, the population has both booster shots, and masks are still being used indoors. Despite this, infections are rising. All Christmas events have been cancelled because of this and you're more than free to fact check me. If masks, vaccines, and boosters are working and making a difference, why is this phenomenon occurring?",
            "title_similarity": "0.5399387",
            "sentiment_compound": 0.3774
        },
        {
            "id": "hl6qzf9",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl6w8oc",
            "score": 1,
            "text": "Studies with accurate data are great.  That said, does everyone plan on wearing their mask for the rest of their life?  :|",
            "title_similarity": "0.2264005",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hl73evh",
            "score": 1,
            "text": "Explaining this to right wing anti maskers is like trying to put toothpaste back in the tube",
            "title_similarity": "0.30860695",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hl763fc",
            "score": 1,
            "text": "The anti-mask idiots at the start of the pandemic, what ever happened to them?",
            "title_similarity": "0.44715053",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7765a",
            "score": -1,
            "text": "Let's say there is Approximately 7,000,000,000  on earth. At the rate of 250,000,000 infected world wide per month. We are looking at approximately 28 months before everyone on earth has been infected. Explain to me how vacation does anything in the preventing and or stopping this pandemic from going on.  People who get vaxx can still catch, carrier and spread the virus. Natural immunity has already been proven to be better than synthetic immunity. Are far as symptoms go. And the rate of death of humans on earth has not changed in the past years it still sits right around every 8 sec someone on earth dies. So if the rate of death has not changed what has? It's all about perception. \n     Death smiles at us all\n All's we can do is smile back. \nLive without fear and be the creator of your own destiny. An remember\nThe only thing worst then death is fearing death.",
            "title_similarity": "0.75895655",
            "sentiment_compound": -0.9744
        },
        {
            "id": "hl7cjlk",
            "score": 1,
            "text": "Given that over one-third of the covid deaths at the hospital I work have been fully vaccinated individuals, I highly advise that people continue masking and social distancing. We have a 69.8% vaccination rate here so it is clear that the vaccine works but studies have been showing the vaccines' efficacy wanes to about 50% after only four months. During this time you are more vulnerable and are putting others at an increased risk. A vaccine alone will not end the pandemic, we must take every precaution necessary to save future generations.",
            "title_similarity": "0.7331298",
            "sentiment_compound": 0.2364
        },
        {
            "id": "hl7d43r",
            "score": 1,
            "text": "Americans… “I don’t believe those 30 studies… I will do my own base on what I read in Facebook!”",
            "title_similarity": "0.47603965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7d7dv",
            "score": 1,
            "text": "Shhhh the conservatives might hear you...",
            "title_similarity": "0.18524519",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7ielv",
            "score": -1,
            "text": "Meanwhile Florida's Governor De Santis just signed a law banning all mask mandates in schools.",
            "title_similarity": "0.3868548",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7j634",
            "score": 1,
            "text": "Hey cool another percentage completely different than the last study’s results. Throw it on the pile",
            "title_similarity": "0.47551662",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hl7lrp6",
            "score": -1,
            "text": "Yeah we all know that already! The people who need to have this smashed into their brains however will never learn this!",
            "title_similarity": "0.22286478",
            "sentiment_compound": 0.4184
        },
        {
            "id": "hl7pg2a",
            "score": -1,
            "text": "To some that logic does not overrule their  idea of \"nah ah, that's not what I think so it must not be\"",
            "title_similarity": "0.025283698",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hl7r3y7",
            "score": -1,
            "text": "Mask wearing is enforced very poorly at school. We have to wear it for entirety of class but we can take it off for lunch break? Where kids sit near each other eating? Possibly sharing food? One of the teachers was antivax, she just got told to leave after 3 months of the school year. One kid used her cousins vaccination card to go to parties and public places. Sent all the grade 11’s home for covid testing. \n\nI can’t wait for everyone to either get the vaccine or the virus and be done with it.",
            "title_similarity": "0.58856946",
            "sentiment_compound": 0.8171
        },
        {
            "id": "hl7s3wh",
            "score": 1,
            "text": "Not cloth masks. Which is what most people are wearing…",
            "title_similarity": "0.28070548",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7xzsb",
            "score": -1,
            "text": "It’s almost as if the vaccine doesn’t work like a vaccine and it was all about government overreach and controlling the population the whole time… more vaccinated people are now being hospitalized than unvaccinated. How ironic.\n\nhttps://www.nbcnews.com/health/health-news/hospitalizations-rising-fully-vaccinated-us-fauci-says-rcna5907",
            "title_similarity": "0.5412764",
            "sentiment_compound": 0.25
        },
        {
            "id": "hl82x4k",
            "score": -1,
            "text": "They want people to wear masks for the rest of their lives",
            "title_similarity": "0.12464319",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hl8419r",
            "score": -1,
            "text": "Nope, I'm vaccinated I'm done with the masks",
            "title_similarity": "0.2495802",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4htee",
            "score": 142,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl4hmbm",
            "score": 218,
            "text": "If I’m reading their info correct, only 8 studies were included in their analysis. Of those 8 studies, 6 focused on masking.  Am I reading that wrong or did The Guardian sensationalize the story\n\n\nhttps://www.bmj.com/content/bmj/375/bmj-2021-068302/F1.large.jpg?width=800&height=600",
            "title_similarity": "0.545258",
            "sentiment_compound": -0.128
        },
        {
            "id": "hl4lbpg",
            "score": -7,
            "text": "53%  id rather not wear the mask.  50% is nothing",
            "title_similarity": "0.57034945",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4lskq",
            "score": -7,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl4mft3",
            "score": -8,
            "text": "Why go through all that hassle if you can just take the size of the virus and compare it to the size of the holes in the masks?",
            "title_similarity": "0.44160414",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4rpgg",
            "score": -8,
            "text": " Correlation ≠ Causation",
            "title_similarity": "-0.038545266",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4tvum",
            "score": -6,
            "text": "10% or less. These studies are bogus.",
            "title_similarity": "0.38718218",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl41gyu",
            "score": -32,
            "text": "I couldn’t tell if it meant when one person wears a mask or everyone",
            "title_similarity": "0.18483606",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4hqmf",
            "score": -8,
            "text": "I'm now triple-masked with a recent booster shot. I have no issue with masks other than not wanting to wear one; the effectiveness of masks seems clear from the science. \n\nSo, my sincere question is if avoiding hospitalization and death are the primary goals, why should someone like me wear a mask anymore? \n\nSure, I can have a breakthrough infection, but I have an infinitesimal chance of being hospitalized or dying. At what point do we say that's good enough?",
            "title_similarity": "0.37859535",
            "sentiment_compound": 0.7912
        },
        {
            "id": "hl4c9gv",
            "score": -36,
            "text": "I am 3 times moderna vaccinated. I don’t wear masks. I trust the vaccine.",
            "title_similarity": "0.48707962",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hl4gd2i",
            "score": 18,
            "text": "Mask wearing and covid-19 incidence—Six studies with a total of 2627 people with covid-19 and 389 228 participants were included in the analysis examining the effect of mask wearing on incidence of covid-19 (table 1) Overall pooled analysis showed a 53% reduction in covid-19 incidence (0.47, 0.29 to 0.75), although heterogeneity between studies was substantial (I2=84%) (fig 5). Risk of bias across the six studies ranged from moderate to serious or critical\n\n&#x200B;\n\nCan someone explain what this means to me?",
            "title_similarity": "0.8296788",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hl4hdu6",
            "score": -2,
            "text": "I thought there was some other study that was saying cloth masks were ineffective but surgical ones were much better.  Is that still true?",
            "title_similarity": "0.36429265",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hl4jvjg",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl4udpu",
            "score": 2,
            "text": "***No?***\n\nDemand your next surgical team not wear masks.",
            "title_similarity": "0.33295083",
            "sentiment_compound": -0.128
        },
        {
            "id": "hl4zc4y",
            "score": 2,
            "text": "Are they saying mask are 3% better than no mask?",
            "title_similarity": "0.54457366",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hl5a4ld",
            "score": -2,
            "text": "So do I still need a booster? Had COVID , been vaccinated with moderna after having COVID , still wearing a mask in public.  \n\n\nTired of all this “now you may need  booster every six months and  now you need to double mask”\n\nEnough is enough.",
            "title_similarity": "0.5774226",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hl5lwvz",
            "score": -2,
            "text": "53% is really not that great….",
            "title_similarity": "0.3740848",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl5m8x9",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl5oaw0",
            "score": -2,
            "text": "I'm assuming these are N95 masks and not three cloth ones where the virus easily passes through?",
            "title_similarity": "0.44345325",
            "sentiment_compound": 0.34
        },
        {
            "id": "hl6bly3",
            "score": -2,
            "text": "Ok then open up the country and borders if It works then.",
            "title_similarity": "-0.0031778812",
            "sentiment_compound": 0.296
        },
        {
            "id": "hl6kovh",
            "score": 2,
            "text": "So not even 100%? I Might as well go back to licking doorknobs",
            "title_similarity": "0.26890972",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hl6qckk",
            "score": 2,
            "text": "So, like, it is proven now that it only slows the spread of it... but like, it's been years. How long do we want to keep slowing the spread of something that is basically fully spread?",
            "title_similarity": "0.49866045",
            "sentiment_compound": 0.6652
        },
        {
            "id": "hl6tjrt",
            "score": 2,
            "text": "Add that to the percentage of protection that the vaccines gives us, then we will be almost fully freed of this plague. EVERYONE NEEDS TO TAKE THE VACCINES!!!!",
            "title_similarity": "0.4136361",
            "sentiment_compound": 0.5971
        },
        {
            "id": "hl6whof",
            "score": 2,
            "text": "I'm really annoyed seeing people in stores now not wearing masks.\n\n\nWhy not wear one and help reduce it's spread? Why not take into consideration the immunocompromised who can't get the vaccine and wear a mask? Why not take advantage and help reduce the spread of the flu and common cold during winter? You can still get covid, so why risk it or suffering the effects of long covid?\n\nThe vaccine has reduced efficacy as time goes on, we're going to need booster shots before long. Nobody wants lockdowns, or new deadlier variants to pop up, so please keep wearing a mask in public while indoors.",
            "title_similarity": "0.51037145",
            "sentiment_compound": -0.6463
        },
        {
            "id": "hl72d6u",
            "score": 2,
            "text": "People in Asia have been using masks to curb the spread of contagious illness for decades. \n\nI’m still completely confused why this is a revelation",
            "title_similarity": "0.5869726",
            "sentiment_compound": -0.7713
        },
        {
            "id": "hl79spy",
            "score": 2,
            "text": "Then why did Fauci tell everybody not to wear masks at the beginning of the pandemic?  How many deaths is he responsible for?",
            "title_similarity": "0.5330105",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hl7c4rx",
            "score": 2,
            "text": "I'm not willing to live my life that way",
            "title_similarity": "0.082500204",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7cge8",
            "score": 2,
            "text": "Bet I can find 30 studies that say the exact opposite.",
            "title_similarity": "0.59260774",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7e0pv",
            "score": 2,
            "text": "Florida had no mask mandates and no vaccine mandates and they have the lowest covid rate in the nation. Nice story tho",
            "title_similarity": "0.49473527",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hl7vwbh",
            "score": 2,
            "text": "Wow, I’m pretty sure there was a study done with hairdressers and their clients, when there was a positive person in the space where all of them were wearing proper masks, none got covid. That says how affective the masks are in indoor spaces.",
            "title_similarity": "0.42737317",
            "sentiment_compound": 0.9169
        },
        {
            "id": "hl85oq7",
            "score": 2,
            "text": "Here are 79 studies that contradict that\n\nhttps://gellerreport.com/2021/11/47-studies-confirm-ineffectiveness-of-masks-for-covid-and-32-more-confirm-their-negative-health-effects.html/",
            "title_similarity": "0.59210145",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hl41g5t",
            "score": -71,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl47tpu",
            "score": -33,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl4vf0h",
            "score": 2,
            "text": "If only we could've rolled out FFP2/N95 masks to the population, that could of saved a lot more lives and reduced the spread.",
            "title_similarity": "0.44841203",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hl4z60j",
            "score": -3,
            "text": "I think a lot of people believe that the claim is that wearing a mask is good at keeping you from getting sick rather than that they are good at keeping you from getting other people sick.",
            "title_similarity": "0.34740537",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hl6hxjn",
            "score": -3,
            "text": "Where is the data. This happens constantly. CDC said masks were 80%+ effective a few weeks ago. Zero data then too.",
            "title_similarity": "0.6935749",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hl7ghsn",
            "score": 4,
            "text": "Pandemic is over move on with your lives.",
            "title_similarity": "0.23265144",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7j85c",
            "score": 3,
            "text": "This is very low quality “science” like those studies that say, “eating chocolate reduces cancer 23%.” Totally meaningless and made up because there are so many factors.\n\nThe issue people have with masks is that all of the science prior to this pandemic said masks were useless unless they were an expertly fitted specific type of mask.\n\nWhat we think might be the case is actually that even if masks have a relatively small amount of effectiveness that small amount is extremely important if something is spreading exponentially. Quite simply a mask is an asymmetric solution (if you ignore the societal/social impact). It might work it might not but if it doesn’t work nothing is damaged but if it does youll save lies.",
            "title_similarity": "0.5529206",
            "sentiment_compound": -0.1249
        },
        {
            "id": "hl4mq2o",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl4806p",
            "score": -28,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl6ihbk",
            "score": 4,
            "text": "I didn't catch the flu this year.",
            "title_similarity": "0.33971494",
            "sentiment_compound": 0.2924
        },
        {
            "id": "hl6srhm",
            "score": -4,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl468qg",
            "score": -50,
            "text": "[removed]",
            "title_similarity": "0.061019808"
        },
        {
            "id": "hl5tcib",
            "score": 347,
            "text": "The quantitative results are from **8 studies** (72 studies met inclusion, 35 distinguished measures from one another, 8 included in the final meta-analysis quantitatively).\n\nOf those 8, 6 are of medium risk of bias, 2 are of serious risk of bias.\n\nThe 53% effectiveness figure has a CI of 21% to 75%.\n\nI think this meta-analysis is being given way more attention than it deserves.",
            "title_similarity": "0.72040534",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hl4z8dp",
            "score": 5,
            "text": "Has anyone found the actual study? I've searched for 15 minutes and can't find a recent study that the news articles describe...",
            "title_similarity": "0.6113645",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl52ihq",
            "score": 5,
            "text": "I don't understand why the American gulf states are seeing the lowest rates of COVID infection while having the lowest rates of vaccination or mask wearing.\n\nhttps://www.npr.org/sections/health-shots/2021/07/28/1021795290/cdc-mask-guidelines-indoors-vaccinated-by-county-covid-spread",
            "title_similarity": "0.5678034",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hl42d92",
            "score": 7912,
            "text": "In the country where I live - Costa Rica - we have had a mask mandate from the get-go.  Our Minister of Health is a doctor with a specialty in Epidemiology.  There were also other important protocols put in place for being in public and days when people could drive and couldn't drive.  \n\nIt's been a battle, but more than 70% of the population is vaccinated and we are down to just over 100 new cases per day ( population around 5.5 million).  We are lucky to have him - Dr. Daniel Sala Peraza - and we are lucky our legislators listened to him.",
            "title_similarity": "0.6313648",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hl4grkf",
            "score": 777,
            "text": "The article doesn't link to any studies. Which studies are they referencing?",
            "title_similarity": "0.14349094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl63vdh",
            "score": 274,
            "text": "No, no, no. Read the bloody paper. Even BMJ themselves say that:\n\n• Most of the studies included in the meta analysis are low quality and subject to major biases\n• We need more & better research [like the mask-wearing RCTs which have consistently found a smaller benefit, about 10%\n\nEveryone needs to chill out in stuff like this. Overplaying your hand leaves you verry vulnerable to criticism from the other side in a debate",
            "title_similarity": "0.5857476",
            "sentiment_compound": 0.6786
        },
        {
            "id": "hl58bef",
            "score": 23,
            "text": "well if that isn't a misrepresentation of the study then I don't know what is... No wonder none of the articles actually link to it. Here's what is says with context!\n\n\"A linked systematic review of public health measures for covid-192 by Talic and colleagues (doi:10.1136/BMJ-2021-068302) found just one randomised controlled trial—of mask wearing—among 35 eligible studies that could provide estimates on the effectiveness of individual interventions.3 The 34 observational studies comprised 14 natural experiments or quasi-experiments and nine cohort, two case-control, and nine cross sectional studies—from Asia (n=11), the United States (n=9), Europe (n=7), and elsewhere (n=8). Combined, these studies suggested relative reductions in incidence of 25% (relative risk 0.75, 95% confidence interval 0.59 to 0.95) for physical distancing, 53% (0.47, 0.29 to 0.75) for mask wearing, and 53% (0.47, 0.19 to 1.12) for handwashing.\n\nTalic and colleagues’ review includes just one randomised controlled trial that evaluated mask wearing, and it was too small for a reliable estimate of effect (18% reduction in incidence for the wearer, 95% confidence interval −23% to 46%).5 The authors mention, but did not include, a large cluster randomised trial of mask wearing from Bangladesh, currently available as a preprint.6 The trial randomised 600 villages (341 830 adults) to surgical masks, cloth masks, or control and found a 9% (95% confidence interval 0% to 18%) relative reduction in symptomatic SARS-CoV-2 infection (measured by seroprevalence) in villages randomised to the mask interventions. Combined, these two randomised trials suggest that mask wearing is responsible for a statistically significant relative risk reduction of about 10% in incidence (95% confidence interval 1% to 18%)—important but substantially less than that from observational studies. A third large cluster trial (40 000 participants) from Guinea-Bissau has completed and should report soon\"\n\nlink: https://www.bmj.com/content/375/bmj.n2729",
            "title_similarity": "0.61892086",
            "sentiment_compound": 0.957
        },
        {
            "id": "hl4betj",
            "score": 192,
            "text": "> Overall pooled analysis showed a 53% reduction in covid-19 incidence (0.47, 0.29 to 0.75), although heterogeneity between studies was substantial (I2=84%) (fig 5). Risk of bias across the six studies ranged from moderate to serious or critical\n\nCan someone explain what 'risk of bias being moderate to serious' means?",
            "title_similarity": "0.8310306",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hl4jefd",
            "score": 1,
            "text": "Article: https://www.bmj.com/content/375/bmj-2021-068302",
            "title_similarity": "0.1654479",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4mrpe",
            "score": 1,
            "text": "Cool, now do a study about goggles.\n\nResearch a few years back found that like 70% of flu is caught through the tear ducts\n\nDoes covid spread the same way?",
            "title_similarity": "0.77448606",
            "sentiment_compound": 0.296
        },
        {
            "id": "hl4q4dv",
            "score": 1,
            "text": "What about this stacked on top of vaccine and or prior infection? People who tout infection numbers are missing the point. What matters is number of hospitalizations and there is no good correlate for infections > hospitalizations for those with immunity (vaccine or otherwise) due to the huge variation in health status. \n\nAgain, infection rates of masked individuals for unvaccinated or those lacking natural immunity is not of value unless one lives in the 3rd world with little access to vaccines. \n\nFor a more indicative estimation, look at large states in the US who have been pro mask vs anti mask. Look at where they've been and where they are.",
            "title_similarity": "0.57193875",
            "sentiment_compound": -0.3489
        },
        {
            "id": "hl4q5zr",
            "score": 1,
            "text": "What are the specific studies? I hear a lot about them being done in a controlled environment, which is far from reality.",
            "title_similarity": "0.22522172",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4s8x5",
            "score": 1,
            "text": "Did the test specify which type of mask and how often it was changed or cleaned ?\n\n\nFrom what I’ve seen personally everyone knows that high quality medical grade masks are effective but many people question the quality of masks people use and the frequency they use the same mask.",
            "title_similarity": "0.46893096",
            "sentiment_compound": 0.2617
        },
        {
            "id": "hl4sgu2",
            "score": 1,
            "text": "But that one guy breathed heavy through his mask in the cold.",
            "title_similarity": "0.2502296",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4t5hq",
            "score": 1,
            "text": "It showed a big example when jason kenny said covid was gone for summer as soon as my front of house staff let their own guards down by taking the masks off to talk to customers also half didnt get vaxxed it only took 2 weeks and we nearly shutdown due to covid spikes",
            "title_similarity": "0.6718907",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4v53j",
            "score": 1,
            "text": "It took me a while to find the actual study, but I'm skeptical given the difference between the two RCTs run in the last year.  Looking at it, it started from looking at about 37000 trials and got down to 70.  That's a lot of exclusion.  Metaanalysis is great in principle, but GIGO still applies.  Could someone verify the methodology?  I want to feel the same rigor applies regardless of the result.",
            "title_similarity": "0.6087412",
            "sentiment_compound": -0.1654
        },
        {
            "id": "hl4vikc",
            "score": 1,
            "text": "We already know this from 100 years ago when Spanish flu happened. And there is no side effect of using it. Yet, fauci for some reason doesn't believe that wearing mask is effective.",
            "title_similarity": "0.41456532",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hl4vpqh",
            "score": 1,
            "text": "It didn't specify what kind of mask unless I missed something. Does it have to be an surgical mask or will any paper or cloth work too?",
            "title_similarity": "0.27182937",
            "sentiment_compound": -0.296
        },
        {
            "id": "hl4vq45",
            "score": 1,
            "text": "Does the study include if the users change the masks as they are supposed to and hide their schnozers? Asking unironically",
            "title_similarity": "0.31632096",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hl4wgmj",
            "score": 1,
            "text": "We are going to learn that face masks have a greater impact on covid spread than vaccines as their durability continues to fade over time. Perhaps the future will be yearly optional flu/covid shots with mask mandates as the primary means of slowing annual waves.",
            "title_similarity": "0.5679318",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hl4wxiv",
            "score": 1,
            "text": "What kind of masks are we talking about here? There are so many…",
            "title_similarity": "0.24155696",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4x2wj",
            "score": 1,
            "text": ">Mask-wearing is the single most effective public health measure at tackling Covid, reducing incidence by 53%,\n\n>Vaccines are safe and effective and saving lives around the world. But most do not confer 100% protection\n\nDoes anyone read this and just not trust the author after that? How could he say masks are the most effective option, when they work only half the time. Vaccines are significantly higher than that.\n\nIf everyone was vaccinated, the virus would be gone.\n\nIf everyone wore masks, the virus would still be around.",
            "title_similarity": "0.658294",
            "sentiment_compound": 0.7378
        },
        {
            "id": "hl4x452",
            "score": 1,
            "text": "Tell that to Illinois, surrounding states have no mask mandates and Illinois does. Somehow they’re dealing with covid better",
            "title_similarity": "0.263102",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hl4xrnv",
            "score": 1,
            "text": "Mask? How about the vaccine? A coworker just caught a breakthrough case- barely missed any work.",
            "title_similarity": "0.4065733",
            "sentiment_compound": -0.3109
        },
        {
            "id": "hl4y3sa",
            "score": 1,
            "text": "And then there's the people who decide that because it's only 53%, not 100%, it \"doesn't work\" therefore they shouldn't wear it and instead get 0%.",
            "title_similarity": "0.52493167",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4y48x",
            "score": 1,
            "text": "If they used decent masks with decent seals around the outside it'd be 98%",
            "title_similarity": "0.37846062",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4yffw",
            "score": 1,
            "text": "Except that I own my lawn and can enforce those property rights.",
            "title_similarity": "-0.0055207144",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4yl5l",
            "score": 1,
            "text": "There’s now a coating of graphene silver oxide that kills the virus on contact. Trebor RX makes the masks and Zentek makes the coating. Approved by health Canada and confirmed to work as advertised. I bought a box and have had no issues with the masks. Stay safe out there.",
            "title_similarity": "0.42167857",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4ym9l",
            "score": 2,
            "text": "If this is a good study then logically it would follow  that the places in the US with compulsory mask mandates and the highest rates of mask wearing should have the lowest amounts of Covid transmission and deaths per capita. And the opposite should also be true",
            "title_similarity": "0.56400716",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hl4z9e6",
            "score": 1,
            "text": "Where is link to original article? I don’t see in the one posted from guardian?",
            "title_similarity": "0.21317482",
            "sentiment_compound": 0.3939
        },
        {
            "id": "hl4zdkt",
            "score": 1,
            "text": "Quick, someone tell the CDC.",
            "title_similarity": "0.12880698",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl4ztqq",
            "score": 2,
            "text": "Just a reminder, a 53% reduction in incidence is not a 53% reduction in total cases.  The virus should burn out when (1-1/R0)% of the population is infected\n\nAssuming no additional measures and an R0 of 6.5, you get 1-(1/6.5) or 85% infected.  With masks it’s 1-(1/(6.5x0.53)) or 71%.  If you want to stop the next wave  from infecting 2/3 of the population, we either need better masks or a new strategy.",
            "title_similarity": "0.71733505",
            "sentiment_compound": -0.765
        },
        {
            "id": "hl4zzx1",
            "score": 1,
            "text": "Rando on the internet: “It’s not 100% successful, so obviously it is useless!!!”",
            "title_similarity": "0.36359462",
            "sentiment_compound": -0.6057
        },
        {
            "id": "hl50j32",
            "score": 1,
            "text": "Does anyone have a link to the original study, or doi?\n\nEdit: I was able to find this meta analysis https://doi.org/10.1136/bmj-2021-068302 but I don’t think this is the correct study. They clearly reference a systematic review.",
            "title_similarity": "0.29987904",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hl50la4",
            "score": 1,
            "text": "Why is this still a thing? Just wear a darn mask",
            "title_similarity": "0.04886385",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl50mjw",
            "score": 1,
            "text": "The blm studies made it seem way higher than that",
            "title_similarity": "0.19626766",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl511ox",
            "score": 1,
            "text": "Yes! I'm going to print this out and show it to people I see in stores not masking.",
            "title_similarity": "0.1660534",
            "sentiment_compound": 0.4574
        },
        {
            "id": "hl518h0",
            "score": 1,
            "text": "Having trouble with that site but is this specific to makes or would face coverings (which I’d say a vast majority of people are using instead of medical masks) also be considered?",
            "title_similarity": "0.46726286",
            "sentiment_compound": -0.2144
        },
        {
            "id": "hl51cke",
            "score": 2,
            "text": "Florida has the lowest new case COVID rate doesn’t it? ( in the us right now)",
            "title_similarity": "0.5060937",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hl51gjm",
            "score": 1,
            "text": "Louder for the idiots in the back",
            "title_similarity": "0.19016653",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl51lvd",
            "score": 1,
            "text": "Just wear a freaking mask…",
            "title_similarity": "0.028159533",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hl51not",
            "score": 1,
            "text": "If this was an STI we would all be fine. Maybe Covid will jump to our sex parts and save humanity.",
            "title_similarity": "0.23443225",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hl51rgl",
            "score": 2,
            "text": "Now do a per capita study of \n\nCalifornia/New York/Michigan\n\nvs \n\nFlorida/Texas/Georgia\n\n\nWhat's the deal?",
            "title_similarity": "0.40966302",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl522rq",
            "score": 1,
            "text": "what about when most people wear it under the chin/nose, take it off to talk, or worse, take it off to sneeze and cough?",
            "title_similarity": "0.44698542",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hl533an",
            "score": 1,
            "text": "In the meantime in the UK…",
            "title_similarity": "0.049750365",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl53dth",
            "score": 2,
            "text": "Covid will be with us forever now in different variants, are we saying masks are forever? If you got the vaccine then that all that should matter",
            "title_similarity": "0.27769965",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hl53klz",
            "score": 1,
            "text": "A mask mandate makes so much more sense than a vaccine mandate. One is invasive and the other is not. One is temporary and the other is not. One respects body autonomy and the other does not. Masks work better than vaccines and they are less intrusive. Mask mandates are better than vaccine mandates.",
            "title_similarity": "0.25166702",
            "sentiment_compound": -0.12
        },
        {
            "id": "hl573s9",
            "score": 1,
            "text": "Are they claiming a casaul link or no?",
            "title_similarity": "-0.005794741",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl57gxc",
            "score": 1,
            "text": "Can they be proven effective using the scientific method? In a lab with (reproducible) experiments?",
            "title_similarity": "0.13681857",
            "sentiment_compound": 0.5362
        },
        {
            "id": "hl57ksb",
            "score": 2,
            "text": "Yeah better question is how well do the vaccines reduce transmission between unmasked individuals. It obviously reduces severity of symptoms, but I don’t understand why no studies are focusing on transmission.",
            "title_similarity": "0.49170175",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hl5804f",
            "score": 1,
            "text": "It's the actual study linked in there? I dug through the article and couldn't find it. I'd love to send the study to my superintendent but I need to data to reference, not a tertiary source.",
            "title_similarity": "0.3175633",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hl58eye",
            "score": 1,
            "text": "Why are so many r/science posts news outlet articles? Just link to the actual science.",
            "title_similarity": "0.3308612",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl58nxn",
            "score": 1,
            "text": "anyone have the actual link to the study",
            "title_similarity": "0.06929088",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl58y4p",
            "score": 1,
            "text": "Incidence? Seems like an odd word to use. I wonder if they are covering their bases by not specifying \"transmission\"...",
            "title_similarity": "0.13657352",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hl58z95",
            "score": 1,
            "text": "So... masks are effective enough to take advantage of, but much less effective than most people think?",
            "title_similarity": "0.3406152",
            "sentiment_compound": 0.74
        },
        {
            "id": "hl5901w",
            "score": 1,
            "text": "And how effective are the mask around your chin or with your nose out of them",
            "title_similarity": "0.13733219",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hl59hay",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl59huw",
            "score": 1,
            "text": "Why use word incidence, I have to google it....",
            "title_similarity": "0.11745213",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl5a5ud",
            "score": 1,
            "text": "It would be much higher if the best masks were worn. Does this count bandanas?",
            "title_similarity": "0.2273116",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hl5bro7",
            "score": 1,
            "text": "So now how do we convince all the people who got their vaccine to put the mask back on?  My mom just got it through the vaccine and im sure it must have been one of her vaccined friends not wearing a mask.  She has other health issues and was very careful not to spend time with anyone who didnt have vaccine  NEWS FLASH.. you can still catch and transmit covid with the vaccine.  Dont be an asshole and keep the mask on.  You vaccine might be suppressing your symptoms enough for you not to realize you have it and are spreading.  WEAR YOUR MASKS WITH OR WITHOUT VACCINE\n\nSorry this one hits home for me. My mom went through hell 2 times because people thought it was ok not to be vigilant.  Vaccine or no. Wear your mask.",
            "title_similarity": "0.46138138",
            "sentiment_compound": 0.5569
        },
        {
            "id": "hl5ckcu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl5de1g",
            "score": 1,
            "text": "Kinda wack this even needs to be pointed out tbh",
            "title_similarity": "0.03262655",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl5dqg4",
            "score": 1,
            "text": "Masks cover the whole the germs come out of.",
            "title_similarity": "0.21978357",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl5e2mo",
            "score": 1,
            "text": "This same study says hand washing isn’t effective. I think I’ll take it with a grain of salt.",
            "title_similarity": "0.39973703",
            "sentiment_compound": 0.743
        },
        {
            "id": "hl5e2q8",
            "score": 1,
            "text": "This is not surprising and it’s not only for covid. I think mask should be mandatory all the time in hospitals.",
            "title_similarity": "0.21274662",
            "sentiment_compound": -0.1316
        },
        {
            "id": "hl5e7cd",
            "score": 1,
            "text": "I’m sure that masks work. The question is what do we do now thar Covid is pretty much confirmed to be endemic. Does everyone just wear a mask forever? The answer we would get before was “when everyone is vaccinated”. The mask mandate was lifted in my city when vaccinations met the target, but we figured out pretty quick that this vaccines did almost nothing to curb spread and the masks went right back on. Now we’re seemingly in a permanent holding pattern.",
            "title_similarity": "0.47470623",
            "sentiment_compound": 0.7935
        },
        {
            "id": "hl5ebh3",
            "score": 1,
            "text": "So mandate it everywhere so we can end this mess",
            "title_similarity": "0.08077747",
            "sentiment_compound": -0.4357
        },
        {
            "id": "hl5ediw",
            "score": 1,
            "text": "A study in Bangladesh said masks have 11% efficacy (still I think pretty good if most people wear a mask and also considering that I've heard that even the flu VACCINE has an efficacy of ~35%). Is a higher number due to the fact that people wearing masks generally take Covid seriously and hence are vaccinated as well?",
            "title_similarity": "0.63725156",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hl5ev49",
            "score": 1,
            "text": "I wonder what constitutes \"wearing a mask\" - are the masks cloth vs solid material? Are they worn over the nose? Are they constantly cleaned? Who is keeping track of who is wearing a mask?\n\nDo we see an increase or a decrease or no change in the incidents with also utilizing things like hand sanitizer and social distancing? They suggest that they included it in the study, and this is just an article - but they suggest that mask wearing leads to the highest prevention - which makes no sense; since to get the virus you need to come into contact with it and get it inside you somehow. AKA if you have it on your hands, even if you are wearing a mask - if you don't sanitize you take your mask off, the virus is near and in your mouth area and eye area. I would think that makes Sanitizing \"more effective\".\n\nStatistics like these are always skewed in some way; 53% is a huge number. I can't imagine it's been done correctly.",
            "title_similarity": "0.4413736",
            "sentiment_compound": 0.9201
        },
        {
            "id": "hl5ezra",
            "score": 1,
            "text": "Why Did Biden go on TV and tell people who are vaccinated that they could stop wearing masks when we knew the delta variant was spreading in the US? Makes no sense to me.",
            "title_similarity": "0.4589278",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hl5fr6e",
            "score": 1,
            "text": "That's better than long term immunity from the vaccine!",
            "title_similarity": "0.29246694",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hl5g2b4",
            "score": 1,
            "text": "Serious question, wouldn't we have a sense of mask efficacy simply based on decades of medical usage? Is there something particularly alarming about covid that requires its own study?\n\nAnd I know that question is going to elicite sarcastic jibes but I am asking seriously about the viral characteristics that would delineate it from other airborne pathogens.",
            "title_similarity": "0.47407347",
            "sentiment_compound": -0.5356
        },
        {
            "id": "hl5jhn4",
            "score": 3,
            "text": "This sounds really promising on the surface but without the same exact study done on the same group with no mask wearing the results will always be questioned. I read a while back where science showed that masks in schools curbed the vivid spread but they never tested a school with no mask mandate. It will be years before we actually have a good grasp on how to avoid Covid. Personally I was a hard core mask wearer and I still got it. Now my antibodies are through the roof. At least there’s that.",
            "title_similarity": "0.51903033",
            "sentiment_compound": -0.5794
        },
        {
            "id": "hl5k6nq",
            "score": 2,
            "text": "Could this be associated with the mask wearers behaviors ?",
            "title_similarity": "0.015248327",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl5m851",
            "score": 1,
            "text": "not even just covid. anything airborne. i haven’t been sick since we started lockdown here in NY",
            "title_similarity": "0.44239557",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hl5mmy8",
            "score": 1,
            "text": "Probably even better preventing reinfection of already vaxxed people also",
            "title_similarity": "0.24117224",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hl5n9rv",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl5nwh9",
            "score": 1,
            "text": "There's a lot of \"mask wearing\".  This doesn't control for much.  Is it fitted n95's and welding up doors?  Is it a coke bottle on the face like in /r/ithadtobebrazil?   Or sonewhere inbetween?  I see many usless germ mops on peoples' faces, and few actual masks.  People insist on using them wrong.  Do they use them wrong in these studies?",
            "title_similarity": "0.45541486",
            "sentiment_compound": -0.6868
        },
        {
            "id": "hl5nwmb",
            "score": 1,
            "text": "A filter helps prevent some particles from passing. Who would have thunk it?",
            "title_similarity": "0.16791892",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hl5ofpy",
            "score": 1,
            "text": "GFD. Does this mean that I will be stuck in this thing for the rest of time?",
            "title_similarity": "0.28835756",
            "sentiment_compound": -0.25
        },
        {
            "id": "hl5oz0l",
            "score": 1,
            "text": "Wow, if this is correct, then we're going to be using masks for a long time. Even with masks cases still go up in many areas despite reducing the incidence by 53%.",
            "title_similarity": "0.6644119",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hl5prv3",
            "score": 1,
            "text": "My opinion is that focusing on masking only empowers resistance to the covid vaccine. Most people see things are black and white. When you say “you should mask too,” it lowers confidence in the efficacy of the vaccine, which is exponentially more effective than masking. \n\nThis is about prioritizing the strategic win for a tactical loss. The masking debate should be kept in academia for the foreseeable future.",
            "title_similarity": "0.46982518",
            "sentiment_compound": 0.8268
        },
        {
            "id": "hl5pw9k",
            "score": 1,
            "text": "Why should we at this point seek to avoid covid? Everyone who wants to be vaccinated is. Exposure to covid is unlikely to be deadly to the vaccinated and would increase immunity.",
            "title_similarity": "0.34205416",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hl5rqb0",
            "score": 1,
            "text": "It also keeps your face warmer in the winter which has been really nice.",
            "title_similarity": "0.12850842",
            "sentiment_compound": 0.6478
        },
        {
            "id": "hl5s5fj",
            "score": 3,
            "text": "The article doesn't say this. The article says that mask wearing, hand washing, social distancing and other non medical steps help to reduce COVID. This could even include lockdowns or complete isolation for all we know. Unless reading the original BMJ report. Which I don't have time to do now... I need to get ready for the COVID party!",
            "title_similarity": "0.44094163",
            "sentiment_compound": 0.8748
        },
        {
            "id": "hl5s9a7",
            "score": 1,
            "text": "I wonder how well the masks have been in lowering incidences of the flu and the common cold lately.",
            "title_similarity": "0.5408428",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hl5u9lx",
            "score": 1,
            "text": "Depends on the type of mask. India already did a study showing this.",
            "title_similarity": "0.3750303",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl5vo46",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl5wg6r",
            "score": 1,
            "text": "So does vaccinations stop the spread? Or just lower your symptoms of Covid?",
            "title_similarity": "0.42004746",
            "sentiment_compound": -0.6154
        },
        {
            "id": "hl5x51p",
            "score": 1,
            "text": "How did the researchers deal with confounding? I can’t find the article to check myself, but isn’t using other covid measures and policies confounding with mask wearing?",
            "title_similarity": "0.28471306",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl5xv1m",
            "score": 1,
            "text": "I mean that's basically the data MITs study showed like a year ago",
            "title_similarity": "0.49472445",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hl5zmqx",
            "score": 1,
            "text": "Vaccination decreases incidences by almost 100%. So the unvaxxed (conscious decision at this point for 5 year olds and up) can continue to mask. It’s not my job to protect them otherwise.",
            "title_similarity": "0.75159705",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hl63jmz",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl691uc",
            "score": 1,
            "text": "Test produces result in incidence of test that produces result",
            "title_similarity": "0.08211708",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl696x1",
            "score": 1,
            "text": "There has to be more to this. States like New York have mask mandates and their cases are still high while Florida doesn't have near as many restrictions and they gave managed to keep severe instances extremely low. Also, I'd assume this is only surgical masks and not cloth or otherwise?",
            "title_similarity": "0.4645133",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hl6ax88",
            "score": 1,
            "text": "So let’s be honest here.. Covid will never be eradicated…. Soooooo…. Masks forever? Just curious",
            "title_similarity": "0.1616387",
            "sentiment_compound": 0.7063
        },
        {
            "id": "hl6c0gp",
            "score": 3,
            "text": "I am not an anti-vaxxer or -masker by any stretch of the imagination. But to throw a wrench in upon reading: it could be that people who wear masks are more likely to engage in a variety of hygienic behaviours that, taken together, makes it less likely that they will get COVID. That is, mask-wearers might be more likely to also social distance, wash their hands more frequently, sanitize, etc., than non mask-wearers. It doesn’t necessarily mean that masks themselves work better than not wearing them; just that the adoption of mask-wearing predicts a lower COVID incidence. Correlation, causation, etc.",
            "title_similarity": "0.2898798",
            "sentiment_compound": 0.6752
        },
        {
            "id": "hl6cp5w",
            "score": 2,
            "text": "The sun is hot, study finds.",
            "title_similarity": "0.0060317405",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl6edrq",
            "score": 1,
            "text": "> Handwashing also indicated a substantial 53% reduction in Covid incidence, although this was not statistically significant after adjusting for the small number of handwashing studies included.\n\nUnderpowered, but still a very compelling trend. I thought that fomite spread was next to zero? I guess you'd need to read the studies to see if hand washing is simply highly correlated with mask wearing.",
            "title_similarity": "0.74883115",
            "sentiment_compound": 0.8097
        },
        {
            "id": "hl6etrr",
            "score": 1,
            "text": "The biggest studies completed in Denmark and bangledash recently showed a maximum effectiveness of 20%",
            "title_similarity": "0.646546",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl6f5h2",
            "score": 1,
            "text": "Mask and washing hands reduce the same percentage. Although it doesn't say what type of mask",
            "title_similarity": "0.4643383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl6hclr",
            "score": 2,
            "text": "I'd be interested in the methodology for this. Before I start - I will just say, I'm not anti-mask (quite the opposite) - but I wonder if it's more that those who wear masks are also likely to take other precautions too like social distancing and not going to crowded places.",
            "title_similarity": "0.15854545",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hl6iw43",
            "score": 1,
            "text": "Masks are an effective way to fight covid but I'm surprised it's only 53%. Not nearly as effective as I thought.",
            "title_similarity": "0.6015373",
            "sentiment_compound": -0.1855
        },
        {
            "id": "hl6l2oj",
            "score": 2,
            "text": "So you’re telling me the unruly airline passengers who mistreated the airline staff were just wrong all this time?!",
            "title_similarity": "0.4556494",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hl6l4xj",
            "score": 1,
            "text": "Ireland not in this studies?",
            "title_similarity": "0.12252051",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl6lws7",
            "score": 3,
            "text": "Interesting. Take a look at Vermont, New Mexico, Oregon in conjunction with their non-mask counterpart states - the case rates are nearly identical.",
            "title_similarity": "0.29265052",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hl6lz1v",
            "score": 1,
            "text": "There is no ethical way to study this - but this confirms that while zero droplets is ideal - reduction of INNOCULATION SIZE probably also is significant when reducing infectivity and severe outcomes…",
            "title_similarity": "0.31723216",
            "sentiment_compound": 0.3714
        },
        {
            "id": "hl6mgcb",
            "score": 1,
            "text": "Can someone tell me if the mask wearing prevents the person wearing the mask from getting COVID or mask wearing helps prevent the spread of it overall?",
            "title_similarity": "0.25686136",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hl6mjo5",
            "score": 2,
            "text": "And if you use high quality (N95 or similar), there's an even bigger reduction. Remember when healthcare workers in the West were all getting COVID? Not very common now that the PPE shortage is worked out.",
            "title_similarity": "0.59489936",
            "sentiment_compound": -0.25
        },
        {
            "id": "hl6ne7d",
            "score": 2,
            "text": "Mask wearing without proper PPE education/use/enforcement is suboptimal. Why isn’t proper PPE education being distributed?",
            "title_similarity": "0.2474489",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl6ntb4",
            "score": 2,
            "text": "Can someone explain me how masks work? The viruses are being filtered through the fabric? What about the air coming up from the masks?",
            "title_similarity": "0.30518126",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl6oyfs",
            "score": 1,
            "text": "now break it down into environment type, mask type and indoor or outdoor.",
            "title_similarity": "0.12237926",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl6reap",
            "score": 1,
            "text": "The article also claims that \"mask-wearing is the most effective public health measure\", when the actual article is limited to 'non-pharmaceutical interventions'. Which makes sense, because vaccines are by far the most effective public health measure.",
            "title_similarity": "0.3635614",
            "sentiment_compound": 0.7083
        },
        {
            "id": "hl6vx9t",
            "score": 1,
            "text": "No source in the article",
            "title_similarity": "0.062679514",
            "sentiment_compound": -0.296
        },
        {
            "id": "hl6vz09",
            "score": 1,
            "text": "Is there a source to the actual studies conducted? I don’t just listen to conclusions of a study just because a journalist told me so.",
            "title_similarity": "0.2794693",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl6yvio",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.06101977"
        },
        {
            "id": "hl6zg7r",
            "score": 1,
            "text": "Anyone have the link to the actual study?  We need science here, but we don't actually get it without some bs wrapper.  I don't want to support such stuff or give any traffic to these links",
            "title_similarity": "0.23595826",
            "sentiment_compound": -0.4973
        },
        {
            "id": "hl6zowx",
            "score": 1,
            "text": "I’d say that’s worth it",
            "title_similarity": "-0.10756884",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hl700wy",
            "score": 1,
            "text": "I am impressed by this [natural experiment ](https://www.tennessean.com/story/news/2020/08/10/vanderbilt-mask-mandates-go-up-then-hospitalizations-slow-down/3323568001/) showing the efficacy of masks.",
            "title_similarity": "0.24424356",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hl70rjb",
            "score": 1,
            "text": "remember when the west laughed and mocked the east for doing this?",
            "title_similarity": "0.20431305",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hl713bx",
            "score": 1,
            "text": "Wow nobody had any idea.",
            "title_similarity": "-0.015817797",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hl724b0",
            "score": 1,
            "text": "Now imagine if every waitress didn't wear them like a beard, not even covering their mouth or nose.",
            "title_similarity": "0.36787802",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hl728zu",
            "score": 1,
            "text": "But republicans said they don't do anything.  They're wrong again.",
            "title_similarity": "0.23771793",
            "sentiment_compound": -0.631
        },
        {
            "id": "hl73xgt",
            "score": 1,
            "text": ">Eight of 35 studies were included in the meta-analysis, which indicated a reduction in incidence of covid-19 associated with handwashing...\n\nDoesn't this mean that, of the 72 study pool, 8 were analyzed to reach their effectiveness figures? Additionally, the meta-analysis goes on to show in an infographic that only 6 of the 8 included studies assessed the effectiveness of mask wearing.\n\nSo, isn't the title a bit misleading since 8 studies were actually analyzed to get their figures, or is this my misinterpretation?\n\n(Not to say this compromises the study, I just dislike misleading things)",
            "title_similarity": "0.73664606",
            "sentiment_compound": -0.8053
        },
        {
            "id": "hl74pri",
            "score": 1,
            "text": "How was this study conducted? I read that they couldn’t use a control in covid studies because it would not be ethical",
            "title_similarity": "0.28294423",
            "sentiment_compound": -0.4023
        },
        {
            "id": "hl75e5m",
            "score": 1,
            "text": "[Source paper](https://doi.org/10.1136/bmj-2021-068302)\n\n&#x200B;\n\nIt's comical to me that this outlet decided to go with the \"drunk history\" method of just stuffing recent policy changes into a summary article for a paper written to be accessible to laypersons.",
            "title_similarity": "0.35959518",
            "sentiment_compound": -0.34
        },
        {
            "id": "hl785rw",
            "score": 2,
            "text": "What study?  There is no reference in the article!",
            "title_similarity": "0.13594267",
            "sentiment_compound": -0.3595
        },
        {
            "id": "hl7a6a7",
            "score": 1,
            "text": "Which variant?  And which mask?  Virtually nobody wears anything better than those flimsy I’ll fitting surgical masks. \n\nThe Delta variant results in a viral load increase 1000 fold (fact).  So your mask that filters out between 70% - 80% of particles still results in a dose of 200x what you got from the original strain. Both wearing a mask still means 16x what you’d have gotten maskless from the wild strain.  So fully masked 1 minute at six feet seems to be all it requires to get sick.",
            "title_similarity": "0.67667294",
            "sentiment_compound": 0.4871
        },
        {
            "id": "hl7a6t3",
            "score": 1,
            "text": "You know,  this is the thing that annoys me about the guardian. Source for report,  too much effort; source for politician doing stupid,  yeah bro, here's the link. Same article.",
            "title_similarity": "0.3391024",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hl7ab37",
            "score": 1,
            "text": "when they say 53% reduction is that relative or absolute?",
            "title_similarity": "0.66423047",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7arud",
            "score": 1,
            "text": "It says 53% but did they consider the chain of infectiona that's been prevented? I'm pretty sure it's much higher if it's considered.",
            "title_similarity": "0.6945488",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hl7b30k",
            "score": 1,
            "text": "Isn't this already known since like, the beginning of the pandemic?",
            "title_similarity": "0.29704684",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hl7b9cw",
            "score": 2,
            "text": "I got my shots, I wish everyone got them and we can be done with the masks! Its getting old.",
            "title_similarity": "0.3451305",
            "sentiment_compound": 0.4574
        },
        {
            "id": "hl7dsh8",
            "score": 1,
            "text": "So you’re saying there is still a chance?",
            "title_similarity": "-0.0799783",
            "sentiment_compound": 0.25
        },
        {
            "id": "hl7fft5",
            "score": 1,
            "text": "As pointed out by other comments, the studies arent great.\n\nAlso do we want to live in a society with masks forever? Covids not going away people, get used to it",
            "title_similarity": "0.30390307",
            "sentiment_compound": -0.4577
        },
        {
            "id": "hl7ghe7",
            "score": 2,
            "text": "I haven’t gotten sick for almost 2 years. No colds or the flu. I did catch COVID once though but luckily was asymptomatic and didn’t feel anything. A nice perk to mask culture",
            "title_similarity": "0.4879174",
            "sentiment_compound": 0.6939
        },
        {
            "id": "hl7i2cd",
            "score": 1,
            "text": "maintain echo chamber",
            "title_similarity": "-0.015979169",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7i7nr",
            "score": 1,
            "text": "There was an interesting article within the last few days on the wide range of efficacy of masks and ivermectin across different studies and the perceived bias of the authors.  The authors suggested switching “mask” and “ivermectin” (with other minor conforming wording changes) and see how the same peer reviewers evaluated the same results with the switch.  It would be interesting to see.",
            "title_similarity": "0.46216264",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hl7id33",
            "score": 1,
            "text": "Is there a study regarding the dangers and/or affect of prolonged mask wearing? \n\nMy boss seems to think it’s bad for him. I have no statistical basis to further the discussion.",
            "title_similarity": "0.38839096",
            "sentiment_compound": -0.836
        },
        {
            "id": "hl7iijw",
            "score": 1,
            "text": "Question : do they regard which types of masks?",
            "title_similarity": "0.09056567",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7isu8",
            "score": 1,
            "text": "This is great news. Do they take into account the type of mask? I wear kn95 when I have to wear mask like in busy places.",
            "title_similarity": "0.2637719",
            "sentiment_compound": 0.765
        },
        {
            "id": "hl7iybb",
            "score": 2,
            "text": "Wouldn’t places with high vaccination also have high mask wearing",
            "title_similarity": "0.28945664",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7o1az",
            "score": 1,
            "text": "Is there a qualifier on the type of mask? N95 specific? A medical mask enough? Any face+nose covering?",
            "title_similarity": "0.3158266",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7t0b7",
            "score": 2,
            "text": "In that actual study - \n\"Risk of Bias - Moderate to Severe\"\nYe...",
            "title_similarity": "0.38033366",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hl7x3en",
            "score": 1,
            "text": "Joe Rogan has left the chat",
            "title_similarity": "0.16956031",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7xw1o",
            "score": 1,
            "text": "My biggest issue with these studies and mask policies in general is this: what is the protective factor of wearing masks into a restaurant, taking it off, eating for an hour, then putting it on and leaving the restaurant? Similarly how efficacious is getting on a plane with masks, everyone removing them for drinks and snacks not even remotely social distancing and then putting them back on?",
            "title_similarity": "0.53533924",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7y6vf",
            "score": 1,
            "text": "i bet all sweden comment are being deleted",
            "title_similarity": "0.41518646",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl7zce0",
            "score": 1,
            "text": "At this point it really seems like most of us will catch COVID, it's just a matter of time when. So just get double vaxxed and a booster when necessary to prevent being in the ICU/dying, and you're good to go.",
            "title_similarity": "0.41013616",
            "sentiment_compound": 0.7076
        },
        {
            "id": "hl817rd",
            "score": 1,
            "text": "Which types of masks were used for testing?",
            "title_similarity": "0.09928656",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl81e5b",
            "score": 1,
            "text": "Guys, it’s illegal to not wearing a mask when taking public transportations in China. I thought wearing masks when faced with respiratory infectious disease is common sense…",
            "title_similarity": "0.3329037",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hl81lna",
            "score": 2,
            "text": "Gotta wonder why it took 2 years to come up with such straightforward and nesecasry studies.",
            "title_similarity": "0.5090934",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl81s3f",
            "score": 1,
            "text": "You'd get about another 50% with a filter respirator. They're not that pricey and a cartridge pair lasts a few months at least.",
            "title_similarity": "0.65583086",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl822ow",
            "score": 2,
            "text": " I have no doubt that mask and vaccines help reduce the spread of disease but they don’t provide 100% protection. This past Saturday my brother and I were visiting our mom in the ICU. The pastor of my brothers church was there visiting as well. Before the pastor left he gave my brother a hug. All 3 of us have been vaccinated and were wearing mask per the hospital policy. I received a call from my brother Monday morning saying I should get tested for COVID because his pastor called and informed him that Sunday morning while getting ready for that morning’s service he was putting cologne on he realized he couldn’t smell. So he ask one of the deacons to cover that morning’s service while he went to get tested. His results came back positive. My brother and I both got tested Monday and my results came back negative while my brother tested positive. Not sure if the pastor gave it to my brother or my brother gave it to him but since the pastor showed symptoms first I would bet it started with him. Just wanted to share the story with everyone please take care and protect yourselves as much as you can. Also I’m glad I didn’t get a hug that day.",
            "title_similarity": "0.5670866",
            "sentiment_compound": 0.9894
        },
        {
            "id": "hl84cpf",
            "score": 1,
            "text": "Yeah, I’m sure. Why are we still talking about this and studying this. If you’re a person wears a mask, when was the last time you were sick? Or anyone else around you was sick. It’s anecdotal, buuuuut is it really?",
            "title_similarity": "0.4569264",
            "sentiment_compound": -0.5362
        },
        {
            "id": "hl84gar",
            "score": 1,
            "text": "Well if people really believed the masks do not work (or are even harmfull, because they are cutting our oxygen,...) they would be petitioning to all surgeons to stop using masks during surgeries long before covid. Have you ever heard about someone going to surgery and demanding all the staff to not wear the masks because masks dont work, and because of easier access to oxygen, the surgeon will perform better job? Would you ask for this during your surgery (even before covid)? If not, than you believe the masks works and please act according your own believes.\n\nIf the masks suddenly stopped working only when it become little inconvenient for your life, maybe the problem are not masks, but you being a hypocrite.",
            "title_similarity": "0.44765064",
            "sentiment_compound": -0.1188
        },
        {
            "id": "hl84z02",
            "score": 1,
            "text": "Imagine if people were wearing those masks properly. Huh if only.",
            "title_similarity": "0.12801197",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl85mb0",
            "score": 2,
            "text": "..but by \"covid\" we mean a positive pcr test, and nothing more.",
            "title_similarity": "0.16921604",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hl86kxq",
            "score": 1,
            "text": "Mask wearing also almost eradicated the common flu last season with so few cases its difficult to graph them compared to last years. Combined with social distancing and lock downs.\n\nAnd that also shows just how much more worse/contagious Covid is compared to the common flu, despite some circles claiming otherwise.",
            "title_similarity": "0.64900565",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hl879s1",
            "score": 1,
            "text": "Cuts incidents or just delays them? Didn't read, just asking because of how contagious this thing is despite politician after politician world over promising to eradicate Covid.",
            "title_similarity": "0.4026732",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hl88s1u",
            "score": 2,
            "text": "And more and more i see people that don't wear a mask or they wear it as a chin diaper. It's so annoying.",
            "title_similarity": "0.36674488",
            "sentiment_compound": -0.541
        },
        {
            "id": "hl89sfs",
            "score": 2,
            "text": "I'm glad that majority of the top comments here are trying to spread correct information!",
            "title_similarity": "0.18681112",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hl8ayv7",
            "score": 1,
            "text": "So you’re telling me, a cloth that stops saliva particles from spraying all over others around you when you cough stops a virus from spreading as quickly?!  Science is crazy man wow",
            "title_similarity": "0.37614995",
            "sentiment_compound": 0.126
        },
        {
            "id": "hl8fbuv",
            "score": 1,
            "text": "I think the only issue is WHICH mask.",
            "title_similarity": "0.06378144",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl8gnx6",
            "score": 1,
            "text": "Research is certainly mixed on whether mask mandates are effective. Other studies show no significant effect of mask mandates on COVID transmission\n\n> Mask mandates and use are not associated with slower state-level COVID-19 spread during COVID-19 growth surges\n\n\n https://www.medrxiv.org/content/10.1101/2021.05.18.21257385v1",
            "title_similarity": "0.36668456",
            "sentiment_compound": 0.7585
        },
        {
            "id": "hl8gwxc",
            "score": 1,
            "text": "What type of masks? Any? And does this also apply if people adjust them throughout the day?",
            "title_similarity": "0.19181742",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl8hj59",
            "score": 1,
            "text": "So, given the error of the results, the chance is 50/50 a mask cuts the incidence of covid. Also, who decided 53% is statistically significant?",
            "title_similarity": "0.68599355",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hl8hw0t",
            "score": 1,
            "text": "I think people fail to understand the difference between association and causality. These studies haven't shown that the masks are causing people to be less likely to contract the disease, but rather that their use are associated with it. People who wear masks also likely to engage in other behaviours that may be protective and dissentangling the relative effect of each is very difficult, if not impossible.",
            "title_similarity": "0.32247886",
            "sentiment_compound": -0.429
        },
        {
            "id": "hl8hw5o",
            "score": 2,
            "text": "why are we posting studies that say directly in them \"these studies may be moderately to extremely biased\" \n\nlike cmon please try harder",
            "title_similarity": "0.3164501",
            "sentiment_compound": 0.399
        },
        {
            "id": "hl8js90",
            "score": 1,
            "text": "Tht doesn't seem like a lot, am I missing something?",
            "title_similarity": "0.086162634",
            "sentiment_compound": -0.5122
        },
        {
            "id": "hl8kteo",
            "score": 1,
            "text": "Two weeks to flatten the curve!",
            "title_similarity": "0.40383673",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl8l56t",
            "score": 1,
            "text": "Are there statistically insignificant 50% increases/decreases in something? Genuinely curious.",
            "title_similarity": "0.5995432",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hl8n271",
            "score": 1,
            "text": "This article is misleading, and disappointing that it's come from a credible source: what it doesn't say is what standards did the masks in the study meet? Were the masks cotton, paper, or of a standard (either FFP2 or N95, for example.).\n\nI believe that if masks are mandated they should be of a set standard which is proved to reduce viral transmission.",
            "title_similarity": "0.38081062",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hl8ribi",
            "score": 1,
            "text": "I could not find a link in the article to the studies they were citing.",
            "title_similarity": "0.25484544",
            "sentiment_compound": 0.0
        },
        {
            "id": "hl8schj",
            "score": 1,
            "text": "Darn. I wish they were completely ineffective so I could stop wearing them.",
            "title_similarity": "0.28678733",
            "sentiment_compound": -0.1423
        },
        {
            "id": "hl8xtvy",
            "score": 1,
            "text": "Statistics show a different image, though. Many countries show no correlation between the infection curve and the dates when more or less mask-wearing was prescribed.",
            "title_similarity": "0.54168475",
            "sentiment_compound": -0.296
        },
        {
            "id": "hl9kcaa",
            "score": 1,
            "text": "So what they’re saying is 100% of43% of the time it’s not effective? MaSkS aRe BaD Co2 pOiSoN mmmmmKay",
            "title_similarity": "0.59789944",
            "sentiment_compound": -0.8609
        },
        {
            "id": "hl9p35f",
            "score": 2,
            "text": "Masks should be the new norm indoors even if covid goes away completely. What other species has EVER sequestered itself inside with hundreds or thousands of nearly completely random members of the same species. The air has nowhere to go! Masks would forever cut down on the flu  and common cold just like it’s cutting down covid now. \n\nThat said, I don’t think it should be the new normal for employees. Yet we are doing the exact opposite where I work. Customers don’t have to wear masks but employees do. Totally backwards. \n\nAlso, we cancelled our semi annual used gear sale that was held outdoors and now have it permanently stationed in a corner where people congregate constantly. Without masks. Brilliant.",
            "title_similarity": "0.58266354",
            "sentiment_compound": -0.8294
        },
        {
            "id": "hlapajz",
            "score": 1,
            "text": "We get it, we will never stop wearing mask",
            "title_similarity": "-0.022431038",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hlb6z2i",
            "score": 1,
            "text": "remember when we were kids and were told not to put plastic bags on our heads?",
            "title_similarity": "0.2557378",
            "sentiment_compound": 0.0
        },
        {
            "id": "hlbu7uy",
            "score": 1,
            "text": "I love seeing people driving alone in their car with a mask on.",
            "title_similarity": "0.21686023",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hldp9rd",
            "score": 2,
            "text": "That is 53% of those who are exposed . Not 53% of people . For people who are always toting the science of things you really tweak the presentation to be misleading",
            "title_similarity": "0.56692207",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hlx1e8k",
            "score": 1,
            "text": "Ahhh finally a number on thé efficiency.",
            "title_similarity": "0.12906334",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hwvfnj8",
            "score": 1,
            "text": "Why are we ending mask mandates then?",
            "title_similarity": "0.1913861",
            "sentiment_compound": 0.0
        },
        {
            "id": "hwvfsd8",
            "score": 1,
            "text": "This is misinformation! It was only ONE study and it did not conclude statistical significance.",
            "title_similarity": "0.28877518",
            "sentiment_compound": -0.5277
        }
    ]
}