{
    "While attractive hospitality workers typically earn higher customer service scores than their peers, wearing face masks—a practice widely adopted during the pandemic—levels the playing field, a new study says. Average-looking workers were perceived as more attractive when they were wearing masks.\n": [
        {
            "id": "hosomre",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.5129007",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hotzlpa",
            "score": 13,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hosvx1x",
            "score": 61,
            "text": "\"However, wearing masks reduced both the perceived attractiveness of attractive female workers and their customer service ratings. When attractive male employees wore masks, perceptions of their attractiveness and their customer service scores were unchanged.\"\n\nMasks on females make them look like some alluring and mysterious mortal Kombatesque seductress in fairness. Male eye contact probably makes people call management.",
            "title_similarity": "0.76358545",
            "sentiment_compound": 0.9169
        },
        {
            "id": "hot096o",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "houik49",
            "score": 0,
            "text": "Face masks in children for more than 2 years of their development will have decades of unforeseen consequences -biological anthropology major",
            "title_similarity": "0.4360206",
            "sentiment_compound": 0.0
        },
        {
            "id": "hou4xx3",
            "score": 3,
            "text": "It’s obvious there is sex discrimination going on here. We should be mandating that men receive 20% higher wages in any service industry based on this evidence.",
            "title_similarity": "0.68435264",
            "sentiment_compound": 0.0
        },
        {
            "id": "houd6j2",
            "score": 0,
            "text": "So here is a question, are the majority of anti-maskers more on the attractive side? A mask takes away their privilege.",
            "title_similarity": "0.66196",
            "sentiment_compound": 0.6872
        },
        {
            "id": "hounc3n",
            "score": 2,
            "text": "The study also found 100% of those surveyed to be complete assholes.",
            "title_similarity": "0.5518153",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hou27ao",
            "score": 7,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hotp8ny",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hotv20l",
            "score": 7,
            "text": "who financied this study and why is it a contribution to human knowledge?",
            "title_similarity": "0.26487315",
            "sentiment_compound": 0.0
        },
        {
            "id": "hot5s5q",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hou2xj5",
            "score": 0,
            "text": "I call it the Princess Jasmine effect. Despite not agreeing with the societal constructs that force middle-eastern or other Muslim women to cover their faces, it sure does make them seem crazy attractive. Eyes are almost universally attractive, when the face below them is hidden you just see the attractive eyes and the rest doesn't matter so much.",
            "title_similarity": "0.68333864",
            "sentiment_compound": 0.8408
        },
        {
            "id": "houhof8",
            "score": 0,
            "text": "The first wave of discrimination against beautiful people…",
            "title_similarity": "0.60536796",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hotjh39",
            "score": 35,
            "text": "Why is this even a thing? I am polite and tip well to anyone who is doing their job well. The service should be the only thing that matters",
            "title_similarity": "0.41115493",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hotmnxc",
            "score": 10,
            "text": "Everyone keeps calling me an asshole when i say that everyone is more attractive with the masks on!",
            "title_similarity": "0.6343465",
            "sentiment_compound": 0.54
        },
        {
            "id": "hot208q",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hotqoqf",
            "score": 7,
            "text": "\\> Average-looking workers were perceived as more attractive when they were wearing masks.\"\n\nHehe. You're prettier with half your face covered.",
            "title_similarity": "0.7519692",
            "sentiment_compound": 0.7425
        },
        {
            "id": "hotv78v",
            "score": -4,
            "text": "Im never gonna stop wearing one",
            "title_similarity": "0.09730936",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hostxbe",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hotjndp",
            "score": 4,
            "text": "Seems more likely that people now judge hospitality workers by their eyes and brow (not to mention height...), rather than the whole face...",
            "title_similarity": "0.6524067",
            "sentiment_compound": 0.0
        },
        {
            "id": "hou0j0a",
            "score": 1,
            "text": "Soon we'll all have to be the same weight and height",
            "title_similarity": "0.24217626",
            "sentiment_compound": 0.0
        },
        {
            "id": "houc5h2",
            "score": 1,
            "text": "Imagine being so ugly that a face mask *improves* your appearance.",
            "title_similarity": "0.5327892",
            "sentiment_compound": -0.3488
        },
        {
            "id": "hotm1lu",
            "score": 31,
            "text": "Another reason why certain people are happy with masks and lockdowns. Lots of introverts love staying home and covid gives them the perfect excuse.",
            "title_similarity": "0.5890391",
            "sentiment_compound": 0.9325
        },
        {
            "id": "hotg358",
            "score": 5,
            "text": "How's that for unconscious bias!",
            "title_similarity": "0.23826408",
            "sentiment_compound": -0.1759
        },
        {
            "id": "hou143n",
            "score": 13,
            "text": "I’m never taking it off.",
            "title_similarity": "-0.047787175",
            "sentiment_compound": 0.0
        },
        {
            "id": "hou6u5u",
            "score": 0,
            "text": "If you’ve got janky teeth from hitting the meth pipe, now is your time to shine!",
            "title_similarity": "0.4211034",
            "sentiment_compound": 0.0
        },
        {
            "id": "hou78lv",
            "score": 0,
            "text": "Is there nsfw-ish sub of girls wearing face masks? I know of r/demeyesdoe",
            "title_similarity": "0.33491537",
            "sentiment_compound": 0.0
        },
        {
            "id": "hou7chl",
            "score": 0,
            "text": "Ah so they were on to something with the old bag-on-the-head trick.",
            "title_similarity": "0.34002715",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hou86kn",
            "score": 0,
            "text": "Yeahhhh, if you could just go ahead and cover up the ugly that would be great!",
            "title_similarity": "0.40692416",
            "sentiment_compound": 0.2714
        },
        {
            "id": "hou8xol",
            "score": 0,
            "text": "Eye makeup game still counts. Someone attractive usually has good eyes. Tweezed eyebrows, eye lashes/real or fake, nice eye color or contracts, etc. Before covid seeing someone in the OR for the first time that has pretty eyes leaves a better impression than someone who doesn't take care of that.",
            "title_similarity": "0.7382189",
            "sentiment_compound": 0.8712
        },
        {
            "id": "hou9mmz",
            "score": 0,
            "text": "Could you…. Just slip this bag over your head? Thannnnnnks! \n\n…. Ahhh much better",
            "title_similarity": "0.43331516",
            "sentiment_compound": 0.4926
        },
        {
            "id": "houagaq",
            "score": 0,
            "text": "Please rename the sub \"Surveys we like,\" for the love of God.",
            "title_similarity": "0.31980157",
            "sentiment_compound": 0.8779
        },
        {
            "id": "houbnrx",
            "score": 0,
            "text": "Reminds of that barista that made the front page. With his mask on he was a very attractive girl, with wonderful hair and eyes. \n\n With out the mask he looked most certainly male.",
            "title_similarity": "0.66505975",
            "sentiment_compound": 0.862
        },
        {
            "id": "houmif9",
            "score": 0,
            "text": "I started tipping more because I was so sure the pandemic was making everything harder for them.. turns out I was just horny.",
            "title_similarity": "0.62559664",
            "sentiment_compound": 0.4572
        },
        {
            "id": "houvd98",
            "score": 0,
            "text": "This should finally make some of those Trump supporters put on a mask.  Too bad it doesn’t hide obesity though.",
            "title_similarity": "0.6544396",
            "sentiment_compound": -0.3182
        },
        {
            "id": "houy55d",
            "score": 0,
            "text": "Masks don't hide when you're 100 kilos overweight, though.",
            "title_similarity": "0.5707075",
            "sentiment_compound": -0.2458
        },
        {
            "id": "hov1rpn",
            "score": 0,
            "text": "This is a shameful article",
            "title_similarity": "0.2272884",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hovgf7v",
            "score": 0,
            "text": "People who believe this crap are most likely judgmental assholes. They're using something that sounds 'sciencey' to politely tell people to keep their ugly mugs covered.\n\nAny noted disparities in tips are easily explained by people becoming more appreciative of servers during the pandemic, not masks covering what people really look like.",
            "title_similarity": "0.68471396",
            "sentiment_compound": -0.3165
        },
        {
            "id": "hovtv73",
            "score": 0,
            "text": "Why is the attractiveness of hospitality employees a subject of scrutiny?",
            "title_similarity": "0.57905596",
            "sentiment_compound": 0.4215
        },
        {
            "id": "howq1ht",
            "score": 0,
            "text": "Don’t you just love how shallow we are?  These are the kind of things I pray that I don’t do.   My adult children have always helped me with this.  They are so freaking amazing.  Oldest son was in college and he’s telling me about a girl he met.   So, I said “is she pretty” to which he replied “why would that matter?”  Gosh I love that boy!  In that moment, I was not loving myself, but I sure did love the lesson.",
            "title_similarity": "0.6003814",
            "sentiment_compound": 0.9372
        },
        {
            "id": "hoto2e3",
            "score": -5,
            "text": "I mean being attractive is a talent and that is also cosmetic surgery is widely popular in many many countries. And I hate cosmetic surgery for same reason.",
            "title_similarity": "0.660492",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hotyxpi",
            "score": 1,
            "text": "We love a little mystery.  You can't tell me a bit of clothing isn't hotter than completely naked.",
            "title_similarity": "0.4804889",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hou0ses",
            "score": -1,
            "text": "I got a dog and met a lot of new friends during the first year of the pandemic, all of them wearing masks. Year two the masks come off and I find out that I’m an optimist and think very highly of people!",
            "title_similarity": "0.51476574",
            "sentiment_compound": 0.7777
        },
        {
            "id": "hou400l",
            "score": -1,
            "text": "Wow. If you can’t see half of someone’s face, suddenly they’re more attractive. What a shocker.",
            "title_similarity": "0.6557555",
            "sentiment_compound": 0.7501
        },
        {
            "id": "hou8w2j",
            "score": 1,
            "text": "Did this account for the overall increase in tipping during the pandemic? I felt that that was the main rule that was emphasized to everybody: “if you are going out to get food, tip them well or double no matter what” when so many small businesses were on the verge of closing.",
            "title_similarity": "0.6825221",
            "sentiment_compound": 0.5149
        },
        {
            "id": "houljv7",
            "score": 1,
            "text": "If I had to guess the face mask is obscuring the effects of being overweight in the face region.\n\nWhile some people are not given great features, I think the thing that has the most significant effect on facial appearance is the extra fat that is carried in the neck and cheeks for those bordering on obesity.",
            "title_similarity": "0.7346918",
            "sentiment_compound": -0.572
        },
        {
            "id": "houllkb",
            "score": 1,
            "text": "Has someone who struggles a little bit with social anxiety, The masks have been a godsend! I don't feel like everybody's looking at me anymore cuz I look like everyone else.",
            "title_similarity": "0.64331913",
            "sentiment_compound": 0.3142
        },
        {
            "id": "hourv3i",
            "score": 1,
            "text": "Well being attractive is largely associated with maintaining good health, so masks literally take away the incentive to be healthy on the flip side of this argument.",
            "title_similarity": "0.6739239",
            "sentiment_compound": 0.8491
        },
        {
            "id": "houw32l",
            "score": 1,
            "text": "Who wears a mask these days",
            "title_similarity": "0.22043918",
            "sentiment_compound": 0.0
        },
        {
            "id": "houx5na",
            "score": 1,
            "text": "So does that mean the hijab brings equality among women?",
            "title_similarity": "0.40519795",
            "sentiment_compound": 0.0
        },
        {
            "id": "houywmh",
            "score": 1,
            "text": "I definitely feel more attractive with my mask on!  I’m super insecure of my mouth (crooked stained teeth) so I have noticed I have a confident attitude with my mask on. HOWEVER I am the only staff member that still wears a mask and I think it might be affecting my tips.",
            "title_similarity": "0.7065088",
            "sentiment_compound": 0.8881
        },
        {
            "id": "hov1ml3",
            "score": 1,
            "text": "Most people get a confidence boost with a mask, while the very attractive might get a confidence hit. \n\nMaybe confidence is the secret?",
            "title_similarity": "0.7088085",
            "sentiment_compound": 0.9412
        },
        {
            "id": "hov3xuq",
            "score": 1,
            "text": "Oh yay, let’s keep them on to increase equality. Who’s with me!!!!!",
            "title_similarity": "0.39590457",
            "sentiment_compound": 0.7825
        },
        {
            "id": "hovg2o5",
            "score": 1,
            "text": "Theeeen i will keep my mask on forever. I am no way a hospitality worker, but people do treat me differently. Hate being ugly :(",
            "title_similarity": "0.46347848",
            "sentiment_compound": -0.9081
        },
        {
            "id": "hovhyjj",
            "score": 1,
            "text": "Yes... I wear masks to prevent the spread of COVID.... No other reason....",
            "title_similarity": "0.29681867",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hoviqil",
            "score": 1,
            "text": "There is a manager at work who looks like she lost a ton of weight at one point because she has a terrible double chin, but her face is very pretty, her body is rocking, and she has this really good smelling perfume that reminds me of the first girl I had sex with's perfume.  She's like an 11 out of 10 with the mask, but a 6 without it.",
            "title_similarity": "0.6550703",
            "sentiment_compound": 0.9068
        },
        {
            "id": "hovjhbn",
            "score": 1,
            "text": "Those attractive people will look for any opportunity to have their masks off as long as possible so that everyone else can see their pretty faces.",
            "title_similarity": "0.5299136",
            "sentiment_compound": 0.836
        },
        {
            "id": "hovmsra",
            "score": 1,
            "text": "I also think people sorta realized how hot masks can be. Less is more and all",
            "title_similarity": "0.59234625",
            "sentiment_compound": 0.0
        },
        {
            "id": "how1y1t",
            "score": 1,
            "text": "When your customer service score stays low.\n\"Wah waaaahhh\"",
            "title_similarity": "0.33251986",
            "sentiment_compound": -0.2732
        },
        {
            "id": "howervd",
            "score": 1,
            "text": "It really is incredible the image you build of a person who you’ve only seen masked\n\nA new girl started working at the coffee shop mid pandemic - never saw her without a mask, we had a great rapport and I developed a slight interest\n\nThen I saw her without the mask recently and yikes. It’s not even that she’s unattractive, but the difference between what I imagined and what I saw threw me off that much",
            "title_similarity": "0.606354",
            "sentiment_compound": 0.3514
        },
        {
            "id": "howf1p3",
            "score": 1,
            "text": "As a member of the not-attractive population, this actually makes me more sad. It's a depressing confirmation that it's simply more challenging to be anything more at what I do because of my appearance.",
            "title_similarity": "0.5426036",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hoxf2ky",
            "score": -1,
            "text": "I hate aesthetic determinism. I love how my friend tries to justify such standards as part of social darwinism, where prettier people are able to use their intrinsic biological advantage to gain social acumen. While I hate wearing masks, if such an act can effectively curtail an aesthetic or physical determinism that conflates perceptions of actual competence, then I'm all for getting people to wear masks long term.",
            "title_similarity": "0.6608603",
            "sentiment_compound": 0.886
        },
        {
            "id": "hou1sck",
            "score": 7,
            "text": "Imagine, society favors aesthetics.",
            "title_similarity": "0.36811724",
            "sentiment_compound": 0.25
        },
        {
            "id": "hou7mi7",
            "score": 6,
            "text": "Funny story about this sort of thing.\n\nLast year a coworker set me on a blind date with her cousin. I meet her for the first one outside the restaurant, and she is _gorgeous!_  Red-orange hair, pretty eyes, a nice green shirt and a cute black bedazzled mask.  I think to myself, \"Wow, if this works out, then I _really_ got lucky!!\"  (I have a thing for redheads and I didn't know she was one before we met.)\n\nWe get inside, we start talking, _and what do you know, we've got a **lot** in common!!_  This is going really well!  The food comes, we take our masks off, and...\n\nI really don't want to be rude. I know that the way her face developed isn't something she  has control over, and I've got things about my own body I don't like.  But it _was_ disappointing after I'd gotten my hopes up like that.\n\nShe had one of those chins that seemed closer to her neck than to the front of her face, and without a proper jawline.  Two of her teeth were angled almost perpendicularly to the neighboring teeth.\n\nI felt really bad for judging her like that, and I hope I hid my disappointment well enough that she didn't notice. Her appearance didn't change the fact that she was still really fun to talk to, so I focused on that and decided to make the best of things! (We went on a couple more dates, but things didn't work out...)\n\nSo yeah. Masks can be deceiving sometimes.",
            "title_similarity": "0.56912667",
            "sentiment_compound": 0.9746
        },
        {
            "id": "houp7wo",
            "score": 22,
            "text": "[deleted]",
            "title_similarity": "-0.005905604"
        },
        {
            "id": "hou3l2y",
            "score": 8,
            "text": "This applies to life. I've met some people I found intriguing and they took off their masks and I wanted to ask them to put them back on.",
            "title_similarity": "0.41802508",
            "sentiment_compound": 0.0
        },
        {
            "id": "hotvgoa",
            "score": 2,
            "text": "Yes people appeared less ugly when their face was covered. How is this new? Did we all forget about the brown paper bag over the head as being the required head wear when people deem you unsightly???",
            "title_similarity": "0.554371",
            "sentiment_compound": -0.4883
        },
        {
            "id": "hotwnpv",
            "score": 2,
            "text": "Talking about useful studies...",
            "title_similarity": "0.28400886",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hotz399",
            "score": -2,
            "text": "Time to change my Bumble avatar",
            "title_similarity": "0.21213917",
            "sentiment_compound": 0.0
        },
        {
            "id": "hou7qzj",
            "score": 2,
            "text": "So now cleavage will be the top factor.",
            "title_similarity": "0.46938926",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hou877e",
            "score": 2,
            "text": "Oh, we’ve all been there. She/he is cute! Look’at’em eyes and hair!\n\n*takes off mask*\n\nOhhhhhhh.",
            "title_similarity": "0.4462732",
            "sentiment_compound": 0.555
        },
        {
            "id": "houb029",
            "score": 2,
            "text": "Pro tip:  A paper bag works too!",
            "title_similarity": "0.3816562",
            "sentiment_compound": 0.0
        },
        {
            "id": "houvu97",
            "score": 2,
            "text": "Who…why was this even a “study”?",
            "title_similarity": "0.14463563",
            "sentiment_compound": 0.0
        },
        {
            "id": "houyftr",
            "score": -2,
            "text": "Your mask doesn't hide your obesity though",
            "title_similarity": "0.5181736",
            "sentiment_compound": 0.1326
        },
        {
            "id": "hovdeyb",
            "score": 2,
            "text": "all the women that used the dog filter are loving this mask world",
            "title_similarity": "0.37116373",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hovlj9h",
            "score": 2,
            "text": "You can tell how fit someone is by how their clothes wear on them. I think the attractive people will still have a sizable advantage here.",
            "title_similarity": "0.6113105",
            "sentiment_compound": 0.7506
        },
        {
            "id": "how15ep",
            "score": 2,
            "text": "Meanwhile my beautiful face is covered and people can't see the radiance of my smile",
            "title_similarity": "0.39351487",
            "sentiment_compound": 0.6558
        },
        {
            "id": "howcp7l",
            "score": -2,
            "text": "Yes, people ARE that shallow. The so-called racism in the West right now e.g. against black is in a large part simply because the \"victim\" group are not as sexually-validated and so they feel rejected internally. You see anti-social behavior common in Asian men too, for the same (sexually-unattractive) reason, but their culture prompts them to close in on themselves (another form of anti-social behavior), rather than express them outward. If suddenly a sufficiently large group of women collectively decide to penalize white men categorically in the mating game, then white men will claim they are being discriminated against. It is just that simple.",
            "title_similarity": "0.6145435",
            "sentiment_compound": -0.5472
        },
        {
            "id": "hotp5i4",
            "score": 243,
            "text": "[removed]",
            "title_similarity": "-0.031494413"
        },
        {
            "id": "hot2qx5",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "-0.031494413"
        },
        {
            "id": "hotvwbv",
            "score": 2,
            "text": "Maybe next we can just all put bags over our heads",
            "title_similarity": "0.2233165",
            "sentiment_compound": 0.0
        },
        {
            "id": "hou1d3t",
            "score": -2,
            "text": "“[continue masking. If you don’t believe The Science™️, it is at least equitable to ugly people!”",
            "title_similarity": "0.63754773",
            "sentiment_compound": -0.5562
        },
        {
            "id": "hou38oa",
            "score": 4,
            "text": "So if you're earning more since March 2020 that probably means you ugly.",
            "title_similarity": "0.59028816",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hou75jy",
            "score": 3,
            "text": "You’re ugly, here’s a mask. Better.",
            "title_similarity": "0.4226145",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hou9n81",
            "score": 3,
            "text": "For real, I had been working with a woman who I had considered to be reasonably attractive.\n\nI’m married, so it wasn’t any distraction, but just something I noted. Was very confused when she told us she had never had a boyfriend.\n\nThen one day, our lunch breaks aligned, and I saw her without her mask for the first time. It is utterly unreal how much that mask covers up.\n\nWent from 8 to 4 in a heartbeat.",
            "title_similarity": "0.5386885",
            "sentiment_compound": -0.5006
        },
        {
            "id": "hovn979",
            "score": 2,
            "text": "Oh wait, you mean covering over half the face leaves the rest up to imagination, and we humans imagine most everyone to be attractive? \n\nI swear some of these studies are blatantly obvious and a waste of time and resources.",
            "title_similarity": "0.68227315",
            "sentiment_compound": -0.0258
        },
        {
            "id": "houe0uc",
            "score": 74,
            "text": "[removed]",
            "title_similarity": "-0.031494413"
        },
        {
            "id": "hotpjm3",
            "score": 54,
            "text": "[removed]",
            "title_similarity": "-0.031494413"
        },
        {
            "id": "hotbiu2",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hou0bmh",
            "score": -3,
            "text": "Umm they always wore masks....like since last century and stuff....yeah.",
            "title_similarity": "0.3029204",
            "sentiment_compound": 0.0
        },
        {
            "id": "houb15d",
            "score": -3,
            "text": "While the Trumpbillies tell me while i bartend “oh you can take your mask off it’s ok!” I respond “I’m not doing this for you!”",
            "title_similarity": "0.33518153",
            "sentiment_compound": 0.0
        },
        {
            "id": "houfxhc",
            "score": 4,
            "text": "I did some graphic design work for FEMA before I left the army. Was told by the higher ups to create a poster that would target women and convince them to wear their mask. It never got used to my knowledge but I turned a photo black and white. Brought the color back through on the mask and eyes and captioned it something along the lines of \"Beauty is in the eyes of the beholder, wear your mask\" it got good remarks but as with everything in the army it just gets tossed aside.",
            "title_similarity": "0.49351478",
            "sentiment_compound": 0.9022
        },
        {
            "id": "hotwx4w",
            "score": 48,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "houvylf",
            "score": 19,
            "text": "Another reason to abolish tipping.",
            "title_similarity": "0.25865844",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoton2e",
            "score": 428,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hosqe2l",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hothof9",
            "score": 220,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hotxy9e",
            "score": 69,
            "text": "Covering your face makes people not realize you're ugly and more things at 10.",
            "title_similarity": "0.57367706",
            "sentiment_compound": 0.4023
        },
        {
            "id": "hospen8",
            "score": 409,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hotaz8a",
            "score": 494,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hoty7fz",
            "score": 160,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hou0zxj",
            "score": 49,
            "text": "[deleted]",
            "title_similarity": "-0.005905643"
        },
        {
            "id": "hotyx58",
            "score": 18,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hotjbkn",
            "score": 883,
            "text": "Id say it may be because eyes and eye-contact is often sexy/attractive. Doesnt matter if they're blue, or brown, or green, or hazel, or dichromatic, or with freckles, etc... As long as they have both eyes, and they arent bloodshot, there is not much one can complain about.  Its bad teeth, various jawlines shapes, skin health, bad breath, and/or RBF that can be off-putting.\n\nOur minds think: attractive eyes must belong to an attractive face.  So without any evidence, everyone becomes a supermodel.",
            "title_similarity": "0.7071551",
            "sentiment_compound": -0.5823
        },
        {
            "id": "houc7jd",
            "score": 96,
            "text": "[removed]",
            "title_similarity": "-0.031494424"
        },
        {
            "id": "hotm8zz",
            "score": 215,
            "text": "[removed]",
            "title_similarity": "-0.031494413"
        },
        {
            "id": "hotxggl",
            "score": 34,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hou3xss",
            "score": 178,
            "text": "[removed]",
            "title_similarity": "-0.031494413"
        },
        {
            "id": "hot2jyp",
            "score": 558,
            "text": "[removed]",
            "title_similarity": "-0.031494424"
        },
        {
            "id": "hotqlnw",
            "score": 55,
            "text": "[removed]",
            "title_similarity": "-0.031494424"
        },
        {
            "id": "hou8a1a",
            "score": 54,
            "text": "Good looking people always have an edge. But as a very plain looking man and a nurse, I noticed that doing best you can and treating your patients with empathy works well too. Not a single complaint in those 10 years I have been in business. \n\nMaybe I could do only a half the work if I was good looking, hmm...",
            "title_similarity": "0.613552",
            "sentiment_compound": 0.9484
        },
        {
            "id": "hou75mw",
            "score": 73,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hou0ic0",
            "score": 423,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hotioin",
            "score": 202,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hototym",
            "score": 89,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hou0ryq",
            "score": 238,
            "text": "[removed]",
            "title_similarity": "-0.031494413"
        },
        {
            "id": "hotxjy8",
            "score": 260,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "houba3x",
            "score": 564,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hotgu9u",
            "score": 190,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hou2yzr",
            "score": 192,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hotqj1x",
            "score": 2019,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hou8mxm",
            "score": 563,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hotsqez",
            "score": 2600,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hotqshi",
            "score": 2148,
            "text": "[removed]",
            "title_similarity": "-0.031494413"
        },
        {
            "id": "hou1gsb",
            "score": 4373,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hosri09",
            "score": 97,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hot77jr",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "hotjm4f",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "-0.031494424"
        },
        {
            "id": "hotkn8t",
            "score": 74,
            "text": "[removed]",
            "title_similarity": "-0.031494424"
        },
        {
            "id": "hotkwj8",
            "score": 66,
            "text": "[removed]",
            "title_similarity": "-0.031494424"
        },
        {
            "id": "hotqviv",
            "score": 3,
            "text": "A lot of retail places don't give dental, this autocorrects that",
            "title_similarity": "0.33610708",
            "sentiment_compound": 0.0
        },
        {
            "id": "hotrsg7",
            "score": 2,
            "text": "Yep. You don’t realize how attractive everyone’s eyes are until it is the only focus of attention.",
            "title_similarity": "0.523358",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hotuqve",
            "score": 15,
            "text": "They laughed at me for using the ole' 'paperbag over the head' trick, but now we have a study that proves it!",
            "title_similarity": "0.5733731",
            "sentiment_compound": 0.2942
        },
        {
            "id": "hotxpxp",
            "score": 3,
            "text": "Ah this is just a new variation of the old \"paper bag over the head\" trick",
            "title_similarity": "0.3101903",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hotz5tw",
            "score": 1,
            "text": "One thing I've learned from the pandemic is that most humans have really lovely eyes, the rest though can be a real mess.",
            "title_similarity": "0.68075407",
            "sentiment_compound": 0.3804
        },
        {
            "id": "hou251v",
            "score": 1,
            "text": "Look at science telling me who’s pretty and who isn’t",
            "title_similarity": "0.43609428",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hou2nr1",
            "score": 2,
            "text": "Is this science? Ppl look better we you can’t see their face? Alrighty",
            "title_similarity": "0.47416312",
            "sentiment_compound": 0.504
        },
        {
            "id": "hou2ug4",
            "score": 1,
            "text": "Ah the ol' paper bag trick.",
            "title_similarity": "0.15595002",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hou2v32",
            "score": 1,
            "text": "Although tipping is not the norm in my country, I will tip if the dining experience is on point and I’ve had a bit to drink.",
            "title_similarity": "0.541854",
            "sentiment_compound": 0.0
        },
        {
            "id": "hou2waq",
            "score": 1,
            "text": "It’s all about the mystery",
            "title_similarity": "0.15334547",
            "sentiment_compound": 0.0
        },
        {
            "id": "hou40y5",
            "score": 3,
            "text": "I'm SOOOO curious how they objectively determined who was attractive and who \"average-looking\".",
            "title_similarity": "0.4730566",
            "sentiment_compound": 0.765
        },
        {
            "id": "hou4chs",
            "score": 2,
            "text": "I’ve never looked better.",
            "title_similarity": "0.26676586",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hou4ecn",
            "score": 2,
            "text": "The fact that a study is using Personal attraction as a number in an equation is stupid as hell! Beauty is in the eye of the beholder! Pushing a false narrative.",
            "title_similarity": "0.52461946",
            "sentiment_compound": -0.3578
        },
        {
            "id": "hou4ipc",
            "score": 1,
            "text": "Smart and altruistic = sexy",
            "title_similarity": "0.46278882",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hou4zpg",
            "score": 1,
            "text": "It's hard for a single fella out there, man",
            "title_similarity": "0.2740217",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hou5430",
            "score": 2,
            "text": "Good news for average looking people, bad news for attractive people",
            "title_similarity": "0.611155",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hou5gsm",
            "score": 1,
            "text": "Take comfort in the thought that most of us are ugly until we wear a mask.",
            "title_similarity": "0.53945494",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hou6j2v",
            "score": 1,
            "text": "TL;DR \"Taco Bell Distinguished Professor in Hospitality Business Management\" is a real thing.",
            "title_similarity": "0.44619",
            "sentiment_compound": 0.0
        },
        {
            "id": "hou6k8z",
            "score": 2,
            "text": "Hell yeah! Average looking gang rise up!",
            "title_similarity": "0.40231523",
            "sentiment_compound": -0.6103
        },
        {
            "id": "hou6xbx",
            "score": 1,
            "text": "I noticed this recently and I think it has to do w the outline of the face/chin. Iirc, I imagined the person I was looking at had a longer face and a sharper chin. When they took off the mask, they revealed a much rounder looking face. This is my own personal experience/observation so it's probably different for everyone, but that's my imo.",
            "title_similarity": "0.59097886",
            "sentiment_compound": 0.0
        },
        {
            "id": "hou8cx8",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.031494424"
        },
        {
            "id": "hou92tz",
            "score": 2,
            "text": "Reminds me of the guy missing a tooth in an ad, but he is also missing an eyebrow. Things we notice first.",
            "title_similarity": "0.4196629",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hou9idw",
            "score": 2,
            "text": "Sad truth.  I got a lot more attention from girls in my bartending gig when my face was covered.  I have pretty eyes so it was a trick.  Sigh.",
            "title_similarity": "0.67617357",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hou9ilh",
            "score": 2,
            "text": "I swear I clicked on this thinking it was the onion. Haha.",
            "title_similarity": "0.28722227",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hou9kjz",
            "score": 1,
            "text": "I wear glasses, and I'm balding. It couldn't be much worse for me",
            "title_similarity": "0.3610596",
            "sentiment_compound": 0.3724
        },
        {
            "id": "houacxu",
            "score": 1,
            "text": "Masks are sexy. Got it.",
            "title_similarity": "0.48991647",
            "sentiment_compound": 0.5267
        },
        {
            "id": "houala8",
            "score": 1,
            "text": "I don't think anyone is going to come out of this feeling any better",
            "title_similarity": "0.23695686",
            "sentiment_compound": 0.5461
        },
        {
            "id": "houaot6",
            "score": 2,
            "text": "In other words, when ugly people cover their ugly parts, people think they're less ugly. It's the same reason why ugly people look better with beards. This shouldn't be news to anyone.",
            "title_similarity": "0.6342852",
            "sentiment_compound": -0.8752
        },
        {
            "id": "houas71",
            "score": 1,
            "text": "I wonder, has anyone measured tipping trends in light of that?",
            "title_similarity": "0.33808476",
            "sentiment_compound": 0.0
        },
        {
            "id": "houauw2",
            "score": 1,
            "text": "How do they measure attractiveness?",
            "title_similarity": "0.3850358",
            "sentiment_compound": 0.4215
        },
        {
            "id": "houb1bu",
            "score": 1,
            "text": "Tell me about it my eyelashes are gorgeous and they get the ladies taalking",
            "title_similarity": "0.46384704",
            "sentiment_compound": 0.6124
        },
        {
            "id": "houb5ah",
            "score": 1,
            "text": "The Arabs were on to something.",
            "title_similarity": "0.23308901",
            "sentiment_compound": 0.0
        },
        {
            "id": "houcjcb",
            "score": 1,
            "text": "Furries have known this for decades.",
            "title_similarity": "0.24686417",
            "sentiment_compound": 0.0
        },
        {
            "id": "houclw9",
            "score": 2,
            "text": "To me, the mask increases the level from “most women are attractive” to “all women are attractive”, as interested eyes are interesting to watch.",
            "title_similarity": "0.63571256",
            "sentiment_compound": 0.6597
        },
        {
            "id": "houclz1",
            "score": 1,
            "text": "Totally true. People are way better looking with masks on",
            "title_similarity": "0.55431366",
            "sentiment_compound": 0.7178
        },
        {
            "id": "houcmat",
            "score": 2,
            "text": "People are attractive when they have nice warning positive vibes",
            "title_similarity": "0.5470444",
            "sentiment_compound": 0.7845
        },
        {
            "id": "houcrl1",
            "score": 2,
            "text": "ouch. imagine noticing your tips went up as soon as you covered your face.",
            "title_similarity": "0.50323176",
            "sentiment_compound": 0.0
        },
        {
            "id": "houcrzu",
            "score": 1,
            "text": "Omfg. Average looking people look better wearing a mask. Lololol. Solid gold.",
            "title_similarity": "0.47252196",
            "sentiment_compound": 0.5423
        },
        {
            "id": "houd69a",
            "score": 1,
            "text": "So you're saying I have a chance!",
            "title_similarity": "0.1476215",
            "sentiment_compound": 0.3164
        },
        {
            "id": "houdc2h",
            "score": 4,
            "text": "Your mouth/smile/jaw play a huge role in how people perceive your attractiveness. It’s obvious, but now everyone has undeniable real world proof.",
            "title_similarity": "0.5615631",
            "sentiment_compound": 0.5023
        },
        {
            "id": "houdtw5",
            "score": 2,
            "text": "We feel the same way about the guests",
            "title_similarity": "0.32046217",
            "sentiment_compound": 0.0
        },
        {
            "id": "houeedv",
            "score": 1,
            "text": "Oh the things pandemic do to us…it’s a love and hate relationship now",
            "title_similarity": "0.45633382",
            "sentiment_compound": 0.128
        },
        {
            "id": "houeg04",
            "score": 1,
            "text": "Imagine being asked to be in the below-average looking control group for this study",
            "title_similarity": "0.3675841",
            "sentiment_compound": 0.0
        },
        {
            "id": "houeglm",
            "score": 2,
            "text": "Because with masks we look at the eyes. And honestly, most people have really pretty eyes. Look at them more, also without masks.",
            "title_similarity": "0.55155605",
            "sentiment_compound": 0.7574
        },
        {
            "id": "houevze",
            "score": 1,
            "text": "Japanese have a word for this: マスク美人 (masuku bijin), basically means \"masked beauty.\"",
            "title_similarity": "0.39446744",
            "sentiment_compound": 0.5859
        },
        {
            "id": "houfa9f",
            "score": 1,
            "text": "Can’t see the teeth (or lack there of) or smell their breath.  Solved.",
            "title_similarity": "0.20622142",
            "sentiment_compound": -0.0516
        },
        {
            "id": "houfb9x",
            "score": 1,
            "text": "I spent some time at pubs/ clubs over the pandemic and I definitely noticed that ordinarily average looking people looked way more attractive with a mask on.\n\nAs to the study, I think quite a few studies like this have been conducted, Where there is a positive relationship between objective attractiveness and overall success in life. I think studies have also shown height positively affects a man's success as well.",
            "title_similarity": "0.8294501",
            "sentiment_compound": 0.9792
        },
        {
            "id": "houfj8m",
            "score": 1,
            "text": "Is this why everyone is so mean to me lately?!",
            "title_similarity": "0.34630704",
            "sentiment_compound": 0.0
        },
        {
            "id": "houfk7n",
            "score": 1,
            "text": "I only even get compliments on my eyes because they're a very pale blue, almost grey. I also have a massive nose and jacked up teeth, so this pandemic has been great! People assume I'm way hotter than I really am",
            "title_similarity": "0.64313555",
            "sentiment_compound": 0.7905
        },
        {
            "id": "houfmrq",
            "score": 1,
            "text": "The paper bag trick always works.  Turns a 6 into a 9. Just watch out for paper cuts.",
            "title_similarity": "0.35949332",
            "sentiment_compound": -0.34
        },
        {
            "id": "houfqgi",
            "score": 1,
            "text": "Imma wear a mask on my tinder profile",
            "title_similarity": "0.24140655",
            "sentiment_compound": 0.0
        },
        {
            "id": "houfrv8",
            "score": 1,
            "text": "It's all about the eyes. The eyes are everything.",
            "title_similarity": "0.14550303",
            "sentiment_compound": 0.0
        },
        {
            "id": "houfsai",
            "score": 1,
            "text": "Is this actually a good thing? \n\nDont more attractive  people  make more of an effort, either by working out and being physically fit or by having higher personal  hygiene.",
            "title_similarity": "0.67026573",
            "sentiment_compound": 0.4171
        },
        {
            "id": "houfvq0",
            "score": 1,
            "text": "I’m so god damned sarcastic to my bar guests and my saving grace is my charming ass smile. It’s been rough. Haha",
            "title_similarity": "0.55095005",
            "sentiment_compound": 0.7051
        },
        {
            "id": "houg4zg",
            "score": 1,
            "text": "Define \"average looking\"....",
            "title_similarity": "0.19390002",
            "sentiment_compound": 0.0
        },
        {
            "id": "houg664",
            "score": 1,
            "text": "After pandemic I noticed too many people have pretty eyes.",
            "title_similarity": "0.7133361",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hougaf0",
            "score": 4,
            "text": "Yikes. That's a real back handed compliment.\n\n\"You look much better when I can't see your face\".",
            "title_similarity": "0.5929437",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hougcm9",
            "score": 1,
            "text": "As are we all. The perks of mask wearing.",
            "title_similarity": "0.38412458",
            "sentiment_compound": 0.0
        },
        {
            "id": "hougey7",
            "score": 1,
            "text": "Ahh thats why reddit is so pro mask",
            "title_similarity": "0.48561832",
            "sentiment_compound": 0.0
        },
        {
            "id": "houh4ii",
            "score": 1,
            "text": "Eyes are the great equalizer.\n\nI've noticed people's eyes a lot more since masks started becoming prevalent and for the most part - people have pretty eyes.",
            "title_similarity": "0.63604045",
            "sentiment_compound": 0.8074
        },
        {
            "id": "houhbih",
            "score": 1,
            "text": "I wonder if there will be an insurgence of mildly to non-attractive people suddenly making it big in the arts again. I mean, take guitar playing for example: there are some good looking good players out there, but very few unattractive people rising up through the ranks. Obviously, looks and guitar playing at not correlated so it must follow that good players are not allowed in the industry based on their appearance. I wonder if this face covering phase will switch the focus back to proficiency rather than looks",
            "title_similarity": "0.6497549",
            "sentiment_compound": 0.6227
        },
        {
            "id": "houhj73",
            "score": 1,
            "text": "I am 99.9% sure that this post would be removed if it was a comment",
            "title_similarity": "0.35196087",
            "sentiment_compound": 0.3182
        },
        {
            "id": "houhyng",
            "score": 1,
            "text": "I wonder how paper bags would do.",
            "title_similarity": "0.10561698",
            "sentiment_compound": 0.0
        },
        {
            "id": "houi2gj",
            "score": 1,
            "text": "The eyes just start looking lower is all :)",
            "title_similarity": "0.0922281",
            "sentiment_compound": 0.2023
        },
        {
            "id": "houi5v7",
            "score": 1,
            "text": "People like attractive people. News at 1100",
            "title_similarity": "0.551913",
            "sentiment_compound": 0.6597
        },
        {
            "id": "houiepk",
            "score": 1,
            "text": "As I was told: the more you cover your face, the more beautiful you are.",
            "title_similarity": "0.58905554",
            "sentiment_compound": 0.6361
        },
        {
            "id": "houifla",
            "score": 1,
            "text": "i'm ugly and i'm proud",
            "title_similarity": "0.3649364",
            "sentiment_compound": -0.0516
        },
        {
            "id": "houitd3",
            "score": 1,
            "text": "Ah, the good ol' \"just put a paper bag over them\" theory",
            "title_similarity": "0.27164388",
            "sentiment_compound": 0.4404
        },
        {
            "id": "houitmq",
            "score": 3,
            "text": "Upon learning this, rates of depression skyrocketed among people who learned they were more attractive with their face covered",
            "title_similarity": "0.73663414",
            "sentiment_compound": -0.1298
        },
        {
            "id": "houj640",
            "score": 1,
            "text": "the real reason doofy bill gates created covid",
            "title_similarity": "0.27564895",
            "sentiment_compound": 0.25
        },
        {
            "id": "houjc11",
            "score": 2,
            "text": "Remember everyone you're sexy if you cover your face!",
            "title_similarity": "0.49657398",
            "sentiment_compound": 0.5707
        },
        {
            "id": "houjnd9",
            "score": 1,
            "text": "I’m a 10 if you have cataracts or it’s foggy, solid covid 9.",
            "title_similarity": "0.34433013",
            "sentiment_compound": 0.1531
        },
        {
            "id": "houjoto",
            "score": 1,
            "text": "That's why I bought a padded bra. Playing field re-unleveled.",
            "title_similarity": "0.29604",
            "sentiment_compound": 0.2023
        },
        {
            "id": "houk179",
            "score": 1,
            "text": "You can’t fix your face but you you can definitely fix your hair.",
            "title_similarity": "0.34023342",
            "sentiment_compound": 0.5499
        },
        {
            "id": "houkark",
            "score": 1,
            "text": "TIL people just hate mouths.",
            "title_similarity": "0.19404158",
            "sentiment_compound": -0.5719
        },
        {
            "id": "houklfi",
            "score": 1,
            "text": "Everyone has beautiful eyes.",
            "title_similarity": "0.26467982",
            "sentiment_compound": 0.5994
        },
        {
            "id": "houla60",
            "score": 1,
            "text": "Unless they’re cross-eyed",
            "title_similarity": "0.15352014",
            "sentiment_compound": 0.0
        },
        {
            "id": "houlbbh",
            "score": 2,
            "text": "Privilege removed!\n\nMasks for everyone so that us ugly people can compete!\n\nGet woke!",
            "title_similarity": "0.49204803",
            "sentiment_compound": -0.4478
        },
        {
            "id": "houlo5c",
            "score": 2,
            "text": "Humans are such pathetically superficial creatures...",
            "title_similarity": "0.25331843",
            "sentiment_compound": -0.4215
        },
        {
            "id": "houloe5",
            "score": 2,
            "text": "Who funded this study?",
            "title_similarity": "0.20651369",
            "sentiment_compound": 0.0
        },
        {
            "id": "houluxr",
            "score": 1,
            "text": "Masked up, anyone can be the Knight of Flowers",
            "title_similarity": "0.19246392",
            "sentiment_compound": 0.0
        },
        {
            "id": "houm3aa",
            "score": 1,
            "text": "Hol up - you’re telling me a cave troll wearing a mask might not be as scary?  Please tell me how many millions were spent on this “study”.",
            "title_similarity": "0.6234499",
            "sentiment_compound": 0.6031
        },
        {
            "id": "houm9zb",
            "score": 1,
            "text": "Sound like it's my time to shine.",
            "title_similarity": "0.24907517",
            "sentiment_compound": 0.3612
        },
        {
            "id": "houmc02",
            "score": 2,
            "text": "The bottom half of your face is where all the ugliness is stored is a fact I learned very quickly during the initial pandemic.",
            "title_similarity": "0.50127566",
            "sentiment_compound": -0.5719
        },
        {
            "id": "houmtgq",
            "score": 2,
            "text": "U can just call me ugly, damn",
            "title_similarity": "0.2359017",
            "sentiment_compound": -0.7184
        },
        {
            "id": "houn4he",
            "score": 1,
            "text": "Maybe a heavier emphasis on the eyes, an area that's typically well-cared for and could be made leagues better with makeup, means it reflects on our perception of the entire face.",
            "title_similarity": "0.6495582",
            "sentiment_compound": 0.4404
        },
        {
            "id": "houng1j",
            "score": 1,
            "text": "And here I’ve been stoked about my mask because I don’t scare the customer service workers anymore with my rbf and bad skin.",
            "title_similarity": "0.61860913",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hounga2",
            "score": 1,
            "text": "A lot of people have great eyes",
            "title_similarity": "0.34292722",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hounji3",
            "score": 1,
            "text": "> Taco Bell Distinguished Professor in Hospitality Business Management at the WSU Carson College of Business\n\nStrong Demolition Man vibes.",
            "title_similarity": "0.46747467",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hounpzg",
            "score": 1,
            "text": "most people have pretty or at least interesting eyes.",
            "title_similarity": "0.42613685",
            "sentiment_compound": 0.7322
        },
        {
            "id": "hounrmq",
            "score": 1,
            "text": "Puts bag on head.\nMirror mirror on the wall",
            "title_similarity": "0.15381983",
            "sentiment_compound": 0.0
        },
        {
            "id": "hounvff",
            "score": 1,
            "text": "Everyone has gorgeous eyes.",
            "title_similarity": "0.2931636",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hounyl8",
            "score": 1,
            "text": "Awesome, now I've got a chance!",
            "title_similarity": "0.2022089",
            "sentiment_compound": 0.75
        },
        {
            "id": "houo2cx",
            "score": 2,
            "text": "As an extremely handsome bartender, yeah I've seen my income go down.",
            "title_similarity": "0.66274464",
            "sentiment_compound": 0.7146
        },
        {
            "id": "houoa4j",
            "score": 1,
            "text": "Next article: “Leading researchers in the scientific field are bad at picking topics to spend their time researching on.”",
            "title_similarity": "0.49233222",
            "sentiment_compound": -0.5423
        },
        {
            "id": "houoimb",
            "score": 1,
            "text": "Wait till you see how attractive I am when im fully invisible",
            "title_similarity": "0.38662457",
            "sentiment_compound": 0.4404
        },
        {
            "id": "houp1yl",
            "score": 1,
            "text": "This is the same reason a paper bag over the head of some women during sex is helpful. A 2 can be a 10!  Great post.",
            "title_similarity": "0.574625",
            "sentiment_compound": 0.8016
        },
        {
            "id": "houp777",
            "score": 1,
            "text": "Never in my life have I been asked to assign a customer service score to a nurse... is that just an American thing?",
            "title_similarity": "0.23381434",
            "sentiment_compound": 0.0
        },
        {
            "id": "houpgfz",
            "score": 1,
            "text": "Everyone in Walmart looks better with a mask too.",
            "title_similarity": "0.5246982",
            "sentiment_compound": 0.4404
        },
        {
            "id": "houpma9",
            "score": 1,
            "text": "How the hell is this science?",
            "title_similarity": "0.047787193",
            "sentiment_compound": -0.6808
        },
        {
            "id": "houpz5s",
            "score": 1,
            "text": "“Hey can I ask you a few questions, health care worker? You look unattractive enough to be in my control group.”",
            "title_similarity": "0.41664705",
            "sentiment_compound": 0.0772
        },
        {
            "id": "houq0zf",
            "score": 15,
            "text": "So…. ugly people look better when their face is covered. That’s absolutely hilarious that a scientific study now supports that. It’s like a backhanded compliment to all unattractive people.",
            "title_similarity": "0.69113064",
            "sentiment_compound": 0.7778
        },
        {
            "id": "houq27o",
            "score": 9,
            "text": "Whenever I see studies like this I always imagine they just find the most obvious things that are intuitive and everyone already understands.",
            "title_similarity": "0.4494396",
            "sentiment_compound": 0.3612
        },
        {
            "id": "houq6wa",
            "score": 1,
            "text": "Attractive people should pay ugly people reparations.  -another Babylon bee article comes true.",
            "title_similarity": "0.6594039",
            "sentiment_compound": 0.25
        },
        {
            "id": "houq7vq",
            "score": 3,
            "text": "Looks like they were computer generated faces with varying degrees of symmetry but I had a chuckle wondering how they were recruiting ugly people for this study",
            "title_similarity": "0.5854898",
            "sentiment_compound": -0.0387
        },
        {
            "id": "houqiry",
            "score": 1,
            "text": "Because it's difficulty to have \"ugly eyes\". Ugliness resides in  jaws, nose, mouth and ears.",
            "title_similarity": "0.3708225",
            "sentiment_compound": -0.8555
        },
        {
            "id": "houqtlm",
            "score": 2,
            "text": "Absolutely this is true. \n\nThere are some very attractive people who look normal or even unattractive with a mask on. \n\nAnd there are some average looking people who look way more attractive with a mask on. \n\nEspecially people with odd proportions in their face tend to look better with a mask. \n\nI will be wearing a mask for a long time yet.",
            "title_similarity": "0.724249",
            "sentiment_compound": 0.7837
        },
        {
            "id": "houqyy1",
            "score": 1,
            "text": "Dang. Mask face syndrome is real. Hahaha. I thought it was just me. \n\nI've seen lots of people with pretty eyes though. At least it makes me smile as I walk around.",
            "title_similarity": "0.58453524",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hour4vm",
            "score": 1,
            "text": "This is why I grew a beard. Anything that hides half my face is an improvement.",
            "title_similarity": "0.49903157",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hourc9h",
            "score": 1,
            "text": "Mask fishing is real y'all",
            "title_similarity": "0.2519103",
            "sentiment_compound": 0.0
        },
        {
            "id": "hourcnb",
            "score": 1,
            "text": "Hmm…my gf always joked around that I need a paper bag over my head.",
            "title_similarity": "0.27823395",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hourfm2",
            "score": 1,
            "text": "Ugly pepper make attractive with their face covered… People been telling that about me my whole life",
            "title_similarity": "0.51955223",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hourk3k",
            "score": 2,
            "text": "This is the age of the butter face.",
            "title_similarity": "0.24021618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hourqjs",
            "score": 2,
            "text": "Brought to you by paper bag manufacturers local 301",
            "title_similarity": "0.17617889",
            "sentiment_compound": 0.0
        },
        {
            "id": "hourqzs",
            "score": 1,
            "text": "I love masks! I’m 50% more attractive!",
            "title_similarity": "0.58621716",
            "sentiment_compound": 0.8392
        },
        {
            "id": "hourvh9",
            "score": 1,
            "text": "It’s nice, I can look at people like their idiots and the mask hides my thoughts.\n\nWhere as before I’d always get in trouble.",
            "title_similarity": "0.5583985",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hous094",
            "score": 1,
            "text": "So basically people didn’t think they were ugly because their faces were covered?",
            "title_similarity": "0.48722622",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hous4jg",
            "score": 1,
            "text": "Adds up that nice people getting more recognition than just a pretty face",
            "title_similarity": "0.69192386",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hous6j0",
            "score": 1,
            "text": "I knew there was a reason I saw a slight increase in tips...",
            "title_similarity": "0.51402473",
            "sentiment_compound": 0.2516
        },
        {
            "id": "houspkb",
            "score": 1,
            "text": "Next up, paper bags! This year’s hottest new dating fad!",
            "title_similarity": "0.5177022",
            "sentiment_compound": 0.3578
        },
        {
            "id": "hout8cg",
            "score": 1,
            "text": "WHAT?! You mean having a good personality and genuine hospitality makes better money?",
            "title_similarity": "0.72053576",
            "sentiment_compound": 0.7545
        },
        {
            "id": "houtsno",
            "score": 1,
            "text": "Wow I can’t tell your face isn’t nice if I can’t see your face. Thanks for the study…..",
            "title_similarity": "0.41342098",
            "sentiment_compound": 0.8591
        },
        {
            "id": "houtspt",
            "score": 1,
            "text": "No one cared who I was until I put on the mask",
            "title_similarity": "0.19369811",
            "sentiment_compound": -0.5472
        },
        {
            "id": "houtwpb",
            "score": 1,
            "text": "This is kind of like how Samuel Colt made all men equal",
            "title_similarity": "0.36794943",
            "sentiment_compound": 0.2975
        },
        {
            "id": "houuc3k",
            "score": 1,
            "text": "I am wearing mask because it hides how ugly I am. The pandemic benefited me greatly",
            "title_similarity": "0.6309816",
            "sentiment_compound": -0.6124
        },
        {
            "id": "houuraj",
            "score": 1,
            "text": "It’s the jibs.  \n\nA lot of people have messed up teeth. \n\nMesses up the whole face",
            "title_similarity": "0.337614",
            "sentiment_compound": -0.34
        },
        {
            "id": "houv48p",
            "score": 1,
            "text": "I’m just commenting to remember to look up HOW they evaluated which workers are more attractive",
            "title_similarity": "0.5935355",
            "sentiment_compound": 0.4927
        },
        {
            "id": "houvbz8",
            "score": 1,
            "text": "I used to work the floor at a comedy club and I was the only male in a sea of attractive females. They DEFINITELY made more money than me from the GUYS. But the ladies, they tipped me more instead of the girls. It all evens out.",
            "title_similarity": "0.72163707",
            "sentiment_compound": 0.6016
        },
        {
            "id": "houvcel",
            "score": 1,
            "text": "It's that person hot, or mask hot?",
            "title_similarity": "0.39110023",
            "sentiment_compound": 0.0
        },
        {
            "id": "houvukf",
            "score": 2,
            "text": "Probably because you can’t see the teeth. I think teeth are are the most important aspect of someone’s face. Maybe shortly after eyes. But very important.",
            "title_similarity": "0.5022466",
            "sentiment_compound": 0.4915
        },
        {
            "id": "houvyqt",
            "score": 3,
            "text": "In the name of Equity people will try to keep masking as commonplalce.",
            "title_similarity": "0.25465813",
            "sentiment_compound": 0.0
        },
        {
            "id": "houw1rt",
            "score": 1,
            "text": "Your wife, pillow case, and me.",
            "title_similarity": "0.17570737",
            "sentiment_compound": 0.0
        },
        {
            "id": "houw4me",
            "score": 1,
            "text": "My eyes are really nice.  But that's it.",
            "title_similarity": "0.32126626",
            "sentiment_compound": 0.2609
        },
        {
            "id": "houwe9z",
            "score": 3,
            "text": "Who decided they were \"average\" looking?  That seems pretty harsh...",
            "title_similarity": "0.33750594",
            "sentiment_compound": 0.0772
        },
        {
            "id": "houwecj",
            "score": 1,
            "text": "It's the teeth… Or the lack of visuals of them.",
            "title_similarity": "0.18332252",
            "sentiment_compound": -0.3182
        },
        {
            "id": "houwosr",
            "score": 1,
            "text": "I noticed that my eyes are pretty sexy. The mask helps with that.",
            "title_similarity": "0.56924653",
            "sentiment_compound": 0.8481
        },
        {
            "id": "houwz9d",
            "score": 1,
            "text": "The beer goggle effect.",
            "title_similarity": "0.25398892",
            "sentiment_compound": 0.0
        },
        {
            "id": "houx0yn",
            "score": 1,
            "text": "what I’m wondering is who’s classifying these worker as “average looking” & “attractive”",
            "title_similarity": "0.5845873",
            "sentiment_compound": 0.0
        },
        {
            "id": "houx5az",
            "score": 1,
            "text": "So that's why I'm getting tipped worse :/",
            "title_similarity": "0.3721053",
            "sentiment_compound": -0.6705
        },
        {
            "id": "houxidg",
            "score": 1,
            "text": "I think just not really seeing people for a year made most people look better.",
            "title_similarity": "0.6790962",
            "sentiment_compound": 0.4877
        },
        {
            "id": "houxq4l",
            "score": 1,
            "text": "Or were more attractive considered less",
            "title_similarity": "0.43996885",
            "sentiment_compound": 0.4927
        },
        {
            "id": "houxy2k",
            "score": 1,
            "text": "Imma start wearing 2 or 3 masks",
            "title_similarity": "0.24912305",
            "sentiment_compound": 0.0
        },
        {
            "id": "houycx8",
            "score": 1,
            "text": "Levels the playing field? Maybe until the first maskless encounter..",
            "title_similarity": "0.26380885",
            "sentiment_compound": 0.2023
        },
        {
            "id": "houyj9g",
            "score": 1,
            "text": "Literally every average looking woman knows this from Halloween.",
            "title_similarity": "0.3097211",
            "sentiment_compound": 0.0
        },
        {
            "id": "houymgc",
            "score": 1,
            "text": "I knew I looked better with the mask on!",
            "title_similarity": "0.45714918",
            "sentiment_compound": 0.4926
        },
        {
            "id": "houymnq",
            "score": 1,
            "text": "How tf can u even record “attractiveness”?",
            "title_similarity": "0.35512683",
            "sentiment_compound": 0.0
        },
        {
            "id": "houywlu",
            "score": 8,
            "text": "[removed]",
            "title_similarity": "-0.031494446"
        },
        {
            "id": "houyxji",
            "score": 2,
            "text": "Seeing coworkers without face masks weeks after working with them is a total trip. Never quite what I imagined but it’s nice to get to know someone on some personal level before seeing them unmasked.",
            "title_similarity": "0.5718788",
            "sentiment_compound": 0.5719
        },
        {
            "id": "houz82a",
            "score": 1,
            "text": "I guess wearing a mask leaves room for imagination. So people are perceived as more attractive.  \nIt could also highlight other parts of the face that wouldn't have been noticed as much before and therefore being appreciated more.\n\nIt interesting how we recognise people.",
            "title_similarity": "0.68356264",
            "sentiment_compound": 0.8973
        },
        {
            "id": "houzbqm",
            "score": 1,
            "text": "I don’t care about the nurses looks or her level of car provided to me.  Does she laugh at my lame jokes? That’s all that matters. Give me that small sense of happiness while hooked up to machine and trying not to die.",
            "title_similarity": "0.45581698",
            "sentiment_compound": 0.916
        },
        {
            "id": "houzbr7",
            "score": 1,
            "text": "Wow. You don’t say?  Groundbreaking.",
            "title_similarity": "0.17911147",
            "sentiment_compound": 0.5859
        },
        {
            "id": "houzy6s",
            "score": 3,
            "text": "“Excuse me, waitress?!” (Puts bag over woman’s head) “you’ll thank me for this later”",
            "title_similarity": "0.3857569",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hov052r",
            "score": 1,
            "text": "Step 1: Be attractive.  \nStep 2: Don't be not attractive.  \nStep 3: realize humanity is really not much more than a shaved ape with some fancy toys.",
            "title_similarity": "0.5113586",
            "sentiment_compound": 0.6047
        },
        {
            "id": "hov0gis",
            "score": 1,
            "text": "Of course they did. Even if you believe the pandemic is hogwash, seeing someone caring for you while wearing a mask only adds to that feeling of trust and safety. I guess that's not a universal statement, but as part of the kit I like seeing it.",
            "title_similarity": "0.6139935",
            "sentiment_compound": 0.8248
        },
        {
            "id": "hov0ids",
            "score": 1,
            "text": "Glad I can cover my ugly face with a mask now.",
            "title_similarity": "0.45021206",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hov0jnr",
            "score": 1,
            "text": "Soon everyone will have to wear a bag over their head for the sake of equity",
            "title_similarity": "0.3358025",
            "sentiment_compound": 0.0
        },
        {
            "id": "hov0kiq",
            "score": 1,
            "text": "I get alot of looks from women I never got before the mask mandate. It's crazy how much the bottom half of your face impacts your level of attractiveness",
            "title_similarity": "0.6211213",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hov0x45",
            "score": 1,
            "text": "Why y’all think us dudes rocking beards?!?",
            "title_similarity": "0.38798",
            "sentiment_compound": 0.0
        },
        {
            "id": "hov1h92",
            "score": 1,
            "text": "Wait so your telling me that if u cover up a ugly persons face they are just as normal as the beautiful people wow what a story amazing",
            "title_similarity": "0.62548673",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hov1itj",
            "score": 1,
            "text": "One of my coworkers looks nothing like I had imagined. She looks beautiful either way, but I always have to take an extra second when I see her without a mask. It's like she's two different people",
            "title_similarity": "0.55420077",
            "sentiment_compound": 0.6304
        },
        {
            "id": "hov1o66",
            "score": 1,
            "text": "Oh this is the truth \n\nI've seen some tens go to fives in a hurry",
            "title_similarity": "0.4271267",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hov1t72",
            "score": 1,
            "text": "I went the extra mile to take off Wednesday onward, I am, a glutton for punishment. As soon as I see I'm only one who missed donuts at the end needs to be more popular than the naive ones. I can easily teleport you there but no. Take this Gryphon instead!\"",
            "title_similarity": "0.60418177",
            "sentiment_compound": -0.2012
        },
        {
            "id": "hov22o5",
            "score": 1,
            "text": "Attractive people definitely lost their edge due to mask wearing.   Being treated better due to good looks is real, sadly.",
            "title_similarity": "0.71627015",
            "sentiment_compound": 0.743
        },
        {
            "id": "hov23jk",
            "score": 2,
            "text": "Just last night at the end of service. Two guys that i made friends with saw me without my mask when i was cleaning and they said that i looked 'different'. Guess i have the ugly",
            "title_similarity": "0.44598913",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hov2cjb",
            "score": 3,
            "text": "So, this was an online survey where participants were shown photoshopped faces and were asked to imagine an interaction? Call me a touch skeptical about the study design.",
            "title_similarity": "0.37907267",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hov315p",
            "score": 6,
            "text": "personally i dont think people should be tipped or treated like they're less just bc they're less attractive than someone else",
            "title_similarity": "0.5356632",
            "sentiment_compound": 0.6258
        },
        {
            "id": "hov316b",
            "score": 1,
            "text": "Hey buddy, eyes up here!",
            "title_similarity": "0.12612146",
            "sentiment_compound": 0.0
        },
        {
            "id": "hov47tb",
            "score": 1,
            "text": "I find not wanting to cause my death attractive.",
            "title_similarity": "0.3811059",
            "sentiment_compound": -0.25
        },
        {
            "id": "hov4g77",
            "score": 1,
            "text": "Damn so you’re beautiful when that face is covered",
            "title_similarity": "0.3679066",
            "sentiment_compound": 0.3566
        },
        {
            "id": "hov4jr4",
            "score": 1,
            "text": "In surgery we call them mascots (mask-hot)",
            "title_similarity": "0.38265377",
            "sentiment_compound": 0.0
        },
        {
            "id": "hov4xcg",
            "score": 1,
            "text": "People always look better when you let your imagination fill in the gaps. It's the foundation of the beer goggles phenomenon.",
            "title_similarity": "0.6434392",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hov56ow",
            "score": 1,
            "text": "Makes age restricted products challenging hard.\n\nDon't want to ask to remove mask due to pandemic. But a lot of adults have young eyes.",
            "title_similarity": "0.57559764",
            "sentiment_compound": -0.205
        },
        {
            "id": "hov5j7j",
            "score": 1,
            "text": "And here I am STILL single. Fu-",
            "title_similarity": "0.033847883",
            "sentiment_compound": 0.0
        },
        {
            "id": "hov5k7j",
            "score": 1,
            "text": "See, anti-maskers?  You'd be cuter if you wore the mask!",
            "title_similarity": "0.5934614",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hov5n99",
            "score": 1,
            "text": "I find I’m much more attractive as long as I cover my ugly face",
            "title_similarity": "0.5841581",
            "sentiment_compound": -0.0276
        },
        {
            "id": "hov5stn",
            "score": 1,
            "text": "The ol brown bag effect.",
            "title_similarity": "0.1821912",
            "sentiment_compound": 0.0
        },
        {
            "id": "hov62nx",
            "score": 1,
            "text": "It’s true.  Because imagination is the most wonderful thing we have forgotten and lost during the age of technology.  Thank you Covid for what little good you brought to us!",
            "title_similarity": "0.54459906",
            "sentiment_compound": 0.8398
        },
        {
            "id": "hov6b1t",
            "score": 1,
            "text": "Obvi. Was this a government funded study? I hope not",
            "title_similarity": "0.30314824",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hov6fpt",
            "score": 1,
            "text": "The secret beard wearers have kept for years is finally out….",
            "title_similarity": "0.3118743",
            "sentiment_compound": 0.0
        },
        {
            "id": "hov6lx1",
            "score": 1,
            "text": "everyone looks more attractive with a bag over their head",
            "title_similarity": "0.46916705",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hov73j4",
            "score": 1,
            "text": "Larry David has great hair when he wears a hat",
            "title_similarity": "0.4114681",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hov7e1d",
            "score": 1,
            "text": " the words \"attractive\" and \"average looking\" in a study makes one wonder who funded such a study in the 1st place, and why. Also, **** Capitalism.",
            "title_similarity": "0.69107914",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hov7nob",
            "score": 1,
            "text": "What's that article from the 1900s about the Spanish flu? They mentioned that for plain-looking people, the mask can hide features they don't like, and make them look more attractive. For attractive people, it adds a sense of mystery.",
            "title_similarity": "0.7083236",
            "sentiment_compound": 0.2374
        },
        {
            "id": "hov7q2m",
            "score": 1,
            "text": "Oh lovely, more evidence for me to never stop wearing a mask.",
            "title_similarity": "0.30747312",
            "sentiment_compound": 0.6896
        },
        {
            "id": "hov8lsu",
            "score": 1,
            "text": "The eyes, when isolated tend to say far more than the whole face.",
            "title_similarity": "0.4674419",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hov8o8k",
            "score": 1,
            "text": "This is kind of a minor nitpick, but:\n\n\"Average\" and \"Attractive\" do not pick up all hospitality workers.  Did the study do any analysis on the impact masks had on unattractive workers?  Or was \"average\" a euphemism to pick up everyone not in the \"attractive\" group?  By definition you aren't getting average if you're picking everyone but the attractive people.",
            "title_similarity": "0.68243766",
            "sentiment_compound": 0.2734
        },
        {
            "id": "hov8t7c",
            "score": 1,
            "text": "I'm in texas and lots of people don't wear their masks& they are UGLY!! You think they would want to hide their uggo faces!! I love to wear q mask, I'm no longer oggled in the grocery store!",
            "title_similarity": "0.45313495",
            "sentiment_compound": -0.5575
        },
        {
            "id": "hov8zjo",
            "score": 1,
            "text": "Why are so many comment trees deleted????",
            "title_similarity": "0.3299431",
            "sentiment_compound": 0.0
        },
        {
            "id": "hov90ze",
            "score": 1,
            "text": "I get a lot more numbers and flirting on my shift now. I think i have nice eyes.",
            "title_similarity": "0.6449615",
            "sentiment_compound": 0.5945
        },
        {
            "id": "hov91by",
            "score": 1,
            "text": "They all look the same in the dark",
            "title_similarity": "0.09807429",
            "sentiment_compound": 0.0
        },
        {
            "id": "hov96m5",
            "score": 1,
            "text": "Girls with beautiful eyes but weird noses been gettin away wit murder.",
            "title_similarity": "0.4200954",
            "sentiment_compound": -0.7992
        },
        {
            "id": "hov9htj",
            "score": 1,
            "text": "Because their personality shines",
            "title_similarity": "0.31144992",
            "sentiment_compound": 0.0
        },
        {
            "id": "hov9lel",
            "score": 1,
            "text": "“I’ll tip you more if I don’t have to look at your face”",
            "title_similarity": "0.39996237",
            "sentiment_compound": 0.0
        },
        {
            "id": "hova9no",
            "score": 1,
            "text": "I cant stop touching my wife when we're out and about wearing masks. I touch her when we're at home too, but I do the same when we're outside as well.",
            "title_similarity": "0.38711208",
            "sentiment_compound": 0.4756
        },
        {
            "id": "hovagrm",
            "score": 1,
            "text": "Who judges the attractiveness for these polls?",
            "title_similarity": "0.46647578",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hovb2ds",
            "score": 1,
            "text": "What a profound and important scientific study.",
            "title_similarity": "0.317432",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hovb2xl",
            "score": 1,
            "text": "There's an incentive! Masks improve the looks of most people! Except Karen's, there's no helping Karen's",
            "title_similarity": "0.7360736",
            "sentiment_compound": 0.6244
        },
        {
            "id": "hovbjoo",
            "score": 1,
            "text": "BS.... If my server wears a mask the entire time I am far less likely to give them a bigger tip. Male or female I want to be able to hear and understand you. Masks are fear porn. It is all political theater and virtue signaling.",
            "title_similarity": "0.676158",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hovbkxi",
            "score": 1,
            "text": "Ah yes the old bag over the head strategy.",
            "title_similarity": "0.25142604",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hovcrvb",
            "score": 1,
            "text": "Wow. Says a lot about people’s perceptions, none of it good.",
            "title_similarity": "0.41692287",
            "sentiment_compound": 0.3387
        },
        {
            "id": "hovcxji",
            "score": 1,
            "text": "Who named these people  as \"average\"?",
            "title_similarity": "0.2616696",
            "sentiment_compound": 0.0
        },
        {
            "id": "hovd43s",
            "score": 3,
            "text": "Uglies are less ugly with some of their ugly hidden behind masks?!?! Really?! Thanks science.",
            "title_similarity": "0.5449295",
            "sentiment_compound": -0.8191
        },
        {
            "id": "hovdeng",
            "score": 1,
            "text": "I just think nose and teeth really make your whole face.",
            "title_similarity": "0.3620473",
            "sentiment_compound": 0.0
        },
        {
            "id": "hovdkwl",
            "score": 1,
            "text": "I’ve noticed this as well. Everybody is potentially good looking behind a mask.",
            "title_similarity": "0.49407285",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hovepds",
            "score": 1,
            "text": "We did a little experiment with this at a bar in miamk. Were all attractive women and spent nights alternating taking our mask on and off (after the rate dropped down to 5%) and noticed our average was tip percent went down.",
            "title_similarity": "0.52329266",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hovezvk",
            "score": 1,
            "text": "Looks like there was a way to even the looks playing field without being the product of explicitly dystopian laws after all: just have an ongoing pandemic!",
            "title_similarity": "0.44839197",
            "sentiment_compound": 0.5562
        },
        {
            "id": "hovf0kt",
            "score": 2,
            "text": "It's true. I got a girl's number that I met who was wearing a mask; sorry to be crude but I felt she was actually more attractive until I saw her without the mask.",
            "title_similarity": "0.61617815",
            "sentiment_compound": 0.5913
        },
        {
            "id": "hovfuuq",
            "score": 2,
            "text": "i had been pondering if masks made more plain people get treated as possibly attractive and that now everyone knows what it's like to be good looking.    i could have told theml; it's great.",
            "title_similarity": "0.68487316",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hovfz8k",
            "score": 1,
            "text": "It's because traits tend to be most attractive when they are average, and the brain assumes averageness of the traits it can't see. For example, for a given gender, the average nose is an attractive nose, the average lips are attractive, the average jaw is attractive, etc. But a random person isn't likely to have all average features, and usually have some \"flaws\" or non-average features that make them less attractive. Think of an unattractive person and what features they have that make them unattractive. Those features are likely to be less common then the \"good\" features, so it would be weird for the brain to assume they are what's hidden.\n\nTLDR average features look good and the brain assumes averageness, but most of us have some non-average features.",
            "title_similarity": "0.7474563",
            "sentiment_compound": 0.8078
        },
        {
            "id": "hovg1kp",
            "score": 1,
            "text": "Wearing a mask definitely hurt my game.",
            "title_similarity": "0.38399577",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hovgh7f",
            "score": 1,
            "text": "Of the two unwritten laws of dating, 1 has been been removed by masks. People, bar has never been lower: just stop being unattrictive and the world is your oyster.",
            "title_similarity": "0.43031114",
            "sentiment_compound": -0.0803
        },
        {
            "id": "hovh8w2",
            "score": 1,
            "text": "It would be better if we could just remove the human all together and just talk to a wall or our phones",
            "title_similarity": "0.30977628",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hovhx0m",
            "score": 1,
            "text": "This supports my theory that it's our holes that are ugly.",
            "title_similarity": "0.4037369",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hovi8gm",
            "score": 2,
            "text": "Based on reading the comments. People became addicted to hiding their ugly ass face and now compare it to being naked. And that's adults commenting, imagine the psychological damage it's doing to kids",
            "title_similarity": "0.56517726",
            "sentiment_compound": -0.9042
        },
        {
            "id": "hovia19",
            "score": 3,
            "text": "How do you scientifically decide who is attractive or average? I've always wondered when I see scientific studies that mention attractive",
            "title_similarity": "0.543682",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hovk5yg",
            "score": 1,
            "text": "Isn’t that just disgusting?",
            "title_similarity": "0.15604231",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hovkxg5",
            "score": 3,
            "text": "Haha! Take that, attractive people!!!",
            "title_similarity": "0.39606443",
            "sentiment_compound": 0.7946
        },
        {
            "id": "hovlfrc",
            "score": 1,
            "text": "This r/science post has some “I workout to look cool during sex” energy",
            "title_similarity": "0.47736692",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hovlmy9",
            "score": 1,
            "text": "Hospitality workers by definition have above average social skills. When that criterion is isolated by masks it creates a bias. They’re interpreted as more estimable, and that causes an assumption of their features.",
            "title_similarity": "0.7820602",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hovmigg",
            "score": 3,
            "text": "So, nonalcoholic beer goggles...",
            "title_similarity": "0.1576721",
            "sentiment_compound": 0.0
        },
        {
            "id": "hovmj8m",
            "score": 1,
            "text": "Hahahahahahahaha....let that depression and hate for life sink in good.",
            "title_similarity": "0.40465653",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hovmvi8",
            "score": 1,
            "text": "I've mentioned before I like wearing masks as I am not the most attractive. I wait tables and got 2 girls phone numbers unsolicited during covid after a long time not.  Also it encouraged me to grow my scraggly facial hair cause no one can see it anyway. Part of me will miss masks.",
            "title_similarity": "0.6087071",
            "sentiment_compound": -0.6165
        },
        {
            "id": "hovn354",
            "score": 1,
            "text": "Ayyyyeee i knew my awards were fixed haha",
            "title_similarity": "0.27594113",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hovncj1",
            "score": 2,
            "text": "Lots of mask-fishing going on.",
            "title_similarity": "0.22999606",
            "sentiment_compound": 0.0
        },
        {
            "id": "hovnjaj",
            "score": 3,
            "text": "Or, Resting Bit*h Face (RBF) means people are more likely to judge you by your kind words and your eyes.",
            "title_similarity": "0.6336186",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hovon9d",
            "score": 1,
            "text": "And in related news:\n\nAmerica is shallow. More to come on this story the next time we forget it again.",
            "title_similarity": "0.43536705",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hovprfi",
            "score": 3,
            "text": "Thats because you only see the eyes. And as we all know, eyes...are the windows of the face.",
            "title_similarity": "0.19522697",
            "sentiment_compound": 0.0
        },
        {
            "id": "hovq6tb",
            "score": 1,
            "text": "Orthodontists hate this.",
            "title_similarity": "0.22933173",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hovqcz8",
            "score": 3,
            "text": "My first intuition is that people are possibly making more eye contact than before, and looking someone in the eye makes it a lot harder to be hostile towards them (I should say, unless you’re already paranoid, then everything looks like a threat no matter what)",
            "title_similarity": "0.5997813",
            "sentiment_compound": -0.6782
        },
        {
            "id": "hovr2g2",
            "score": 1,
            "text": "I’m a moderate looking guy. But I have a beard and I’m 6,0 and medium build. I never get hit on.  I’m medium plus, but if I’ve ever had to ‘compete’ with a handsome guy, I’d lose every time.  Anyway. One Halloween I did phantom of the opera, mask covered majority of my face, showed my beard and that I’m not deformed, that was it, and a cape. All night at the club, girls kept pulling on my cape as I walked by, I thought it was weird but whatever. By the end of the night I had 5 girls literally fight over me.  I ended up trying to be a nice guy and stay with my single friend who was a girl out of solidarity. Mistake, but being nice is good to.   I think it was the mystery of what I looked like, plus they could imagine whatever they wanted, with knowing it couldn’t be that bad. Try it guys, trim your beards, do the phantom of the opera for Halloween.  You will get attention. Don’t be a creep.",
            "title_similarity": "0.53485537",
            "sentiment_compound": 0.8765
        },
        {
            "id": "hovrunm",
            "score": 1,
            "text": "Rule 2: Don’t be unattractive.",
            "title_similarity": "0.12644228",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hovrzte",
            "score": 1,
            "text": "So basically, ugly people are more socially acceptable when they hide the ugly?",
            "title_similarity": "0.64268696",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hovt01a",
            "score": 1,
            "text": "Makes sense. People see your eyes amd thats it, so you cant see janky teeth or a big snoot, or acne as much (all of which people tend to see as \"less attractive\") but 100%, people ALWAYS think eyes are pretty.",
            "title_similarity": "0.7161571",
            "sentiment_compound": 0.7272
        },
        {
            "id": "hovt1mf",
            "score": 1,
            "text": "It’s almost like showing you care about the well-being of others makes someone more attractive which is crazy.",
            "title_similarity": "0.66222674",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hovt689",
            "score": 3,
            "text": "I have also noticed, at least for me, the same affect with radio. I hear their voice on radio and if I ever see them in person they look nothing like I'd imagined. The phrase \"face for radio\" makes sense.",
            "title_similarity": "0.45570868",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hovt8e2",
            "score": 1,
            "text": "Obscuring one's face hides unattractiveness, fascinating stuff, social scientists have done it again",
            "title_similarity": "0.5149571",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hovtnrt",
            "score": 1,
            "text": "Good.  It's time to end the tyranny of lookism.",
            "title_similarity": "0.2605969",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hovts88",
            "score": 1,
            "text": "Yea I’m very cute but also much better looking with a mask on. My eyes are beautiful and seductive, don’t stare too long or else you might get entranced! Man and women tend to get lost or confused when they see me!",
            "title_similarity": "0.7198962",
            "sentiment_compound": 0.7924
        },
        {
            "id": "hovuhcl",
            "score": 2,
            "text": "This ain't news, everyone knows the attractive get treated different. We all saw that from grade school onward. Do they get money for these studies?",
            "title_similarity": "0.45741868",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hovutcb",
            "score": 1,
            "text": "Raise your hand if you are surprised  …\n\nBueller ?\nBueller ?\nBueller ?",
            "title_similarity": "0.2737643",
            "sentiment_compound": 0.6848
        },
        {
            "id": "hovuzgk",
            "score": 1,
            "text": "That's like the long haired girl turning around to show her manly face, just without the turning.",
            "title_similarity": "0.3316536",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hovv2m0",
            "score": 1,
            "text": "Hahaha, who is writing these compelling articles?",
            "title_similarity": "0.37031084",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hovv8ay",
            "score": 1,
            "text": "It works, except for this who has ugly eyes",
            "title_similarity": "0.33093828",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hovvc77",
            "score": 1,
            "text": "I realized I’ve been assuming people look like other people I know. It’s always totally different. The weird thing is their voice won’t match their face because of it. It’s the wrong face to voice match up so my mind feels like somethings off but that’s because it made the wrong connection.",
            "title_similarity": "0.45046908",
            "sentiment_compound": -0.6348
        },
        {
            "id": "hovvquh",
            "score": 1,
            "text": "Gee, people are shallow; film at 11.",
            "title_similarity": "0.22200276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hovvxwp",
            "score": 3,
            "text": "Can attest, ugly guy in hospitality. Started back after the vaccine, but still wearing a mask to this day, people consider me more approachable and attractive. \n\nSeveral co-workers have mentioned so when that simply wasn’t true in 2019. I also get hit on by more of the slightly drunk guests as they leave the bar.",
            "title_similarity": "0.74527377",
            "sentiment_compound": 0.5907
        },
        {
            "id": "hovwbbr",
            "score": 1,
            "text": "Anyone is uglier in a mask.",
            "title_similarity": "0.38696474",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hovxtuo",
            "score": 1,
            "text": "Another reason why I hate wearing masks.",
            "title_similarity": "0.3385286",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hovy1zo",
            "score": 1,
            "text": "If you rank all the possible “privileges” such as white privilege, religion privilege, gender privilege, etc.. by objective measures attractiveness privilege is by far the most determining immutable factor in long term success.  You being more attractive gives you the highest chance at a good career family and general happiness",
            "title_similarity": "0.7475947",
            "sentiment_compound": 0.9781
        },
        {
            "id": "hovz6np",
            "score": 1,
            "text": "College shuttle driver around here was looking crazy good until I saw them later on without a mask.\n\n8.5/10 with mask.\n6.5/10 no mask.",
            "title_similarity": "0.50075746",
            "sentiment_compound": -0.1779
        },
        {
            "id": "how086v",
            "score": 1,
            "text": "Put a mask on to earn more! Harsh.",
            "title_similarity": "0.4617983",
            "sentiment_compound": -0.54
        },
        {
            "id": "how0kp9",
            "score": 1,
            "text": "The author is a Taco Bell Distinguished Professor.",
            "title_similarity": "0.33964878",
            "sentiment_compound": 0.0
        },
        {
            "id": "how1dms",
            "score": 1,
            "text": "Dentists hate this pandemic.",
            "title_similarity": "0.30997282",
            "sentiment_compound": -0.5719
        },
        {
            "id": "how1x2l",
            "score": 3,
            "text": "Scientific study scores the vicious burn: “perceived as more attractive when they wore a mask”. Ouch.",
            "title_similarity": "0.7308899",
            "sentiment_compound": 0.1761
        },
        {
            "id": "how24h7",
            "score": 1,
            "text": "When hard human prejudices are revealed in r/science , they become acceptable intelligent discussions.",
            "title_similarity": "0.5502317",
            "sentiment_compound": 0.2732
        },
        {
            "id": "how30kw",
            "score": 2,
            "text": "Here in Japan, they call it \"mask magic\".\n\nMasks make the paper bags of yesteryear a practical option to increase your attractiveness. No plastic surgery required!",
            "title_similarity": "0.5084226",
            "sentiment_compound": 0.4926
        },
        {
            "id": "how3222",
            "score": 1,
            "text": "The shocking thing is the number of people who realize there are shallow people.",
            "title_similarity": "0.47906667",
            "sentiment_compound": -0.34
        },
        {
            "id": "how55pj",
            "score": 1,
            "text": "Is something I've come to notice too. A lot of people have really nice eyes.",
            "title_similarity": "0.40443903",
            "sentiment_compound": 0.4754
        },
        {
            "id": "how595m",
            "score": 1,
            "text": "I’ve def noticed I’m attracted to women wearing masks way more then before they wore masks. I’ll be enamored with a girl thinking she’s so hot and then once she takes her mask off I realize she wasn’t as attractive as I first thought.",
            "title_similarity": "0.70465195",
            "sentiment_compound": 0.6908
        },
        {
            "id": "how5fzz",
            "score": 1,
            "text": "My brain seems to be pretty generous when filling in the blank of what someone's lower face looks like. Then they take off the mask and I realize they don't look how I imaged.",
            "title_similarity": "0.559345",
            "sentiment_compound": 0.7783
        },
        {
            "id": "how5h6q",
            "score": 1,
            "text": "Ah! That’s why people are still wearing them?",
            "title_similarity": "0.14678863",
            "sentiment_compound": 0.0
        },
        {
            "id": "how5inj",
            "score": 1,
            "text": "Ngl the whole face mask thing has real driven home why some cultures still choose to wear things like burkas (and all their associated variations) even when they have th choice not to.\n\nI can imagine being incessantly judged on your looks is balls.",
            "title_similarity": "0.54466534",
            "sentiment_compound": 0.3612
        },
        {
            "id": "how6l0n",
            "score": 2,
            "text": "Letting their nodes stick out however makes them less attractive than they normally are.",
            "title_similarity": "0.52757657",
            "sentiment_compound": 0.3832
        },
        {
            "id": "how6xhx",
            "score": 1,
            "text": "They’re just trying to make us wear our masks!! \n\ns/",
            "title_similarity": "0.32753688",
            "sentiment_compound": 0.0
        },
        {
            "id": "how8l3i",
            "score": 1,
            "text": "Evolutionary. People also look better from a distance.\n\nBecause in mating game you miss 100% of the shots you do not make",
            "title_similarity": "0.68547887",
            "sentiment_compound": 0.3182
        },
        {
            "id": "how8mv8",
            "score": 1,
            "text": "Has anyone had the opposite experience, where someone looks average with mask on but really attractive once they take it off?",
            "title_similarity": "0.65344787",
            "sentiment_compound": 0.6474
        },
        {
            "id": "how95vd",
            "score": 2,
            "text": "Sex is Natural Eugenics, so, no surprise.",
            "title_similarity": "0.45009512",
            "sentiment_compound": 0.1744
        },
        {
            "id": "how99no",
            "score": 1,
            "text": "Make sense. Always known I actually look alright if I hide most of my face.",
            "title_similarity": "0.37590498",
            "sentiment_compound": 0.0772
        },
        {
            "id": "how9f4m",
            "score": 1,
            "text": "Stop telling me I have a mask kink. I know that",
            "title_similarity": "0.26516804",
            "sentiment_compound": -0.296
        },
        {
            "id": "how9hdx",
            "score": 1,
            "text": "This happened with one of my managers. The entire year I’ve known her I’ve never seen her without her mask on and when everything cooled down for a hot minute she wasn’t wearing it anymore and I had to do a double take because the lower half of her face wasn’t anything like I imagined it to be!",
            "title_similarity": "0.50087225",
            "sentiment_compound": 0.1511
        },
        {
            "id": "howc4cd",
            "score": 1,
            "text": "\"ugly people aren't that ugly anymore when you can't see half of their face\"",
            "title_similarity": "0.558209",
            "sentiment_compound": -0.1526
        },
        {
            "id": "howcfoz",
            "score": 1,
            "text": "I can't wear a mask due to severe  ptsd.  I can't imagine being paid or tipped based on looks vs service provided.",
            "title_similarity": "0.35804427",
            "sentiment_compound": -0.3818
        },
        {
            "id": "howcjgs",
            "score": 1,
            "text": "More attractive or just more intelligent and courteous for helping prevent Covid?",
            "title_similarity": "0.6493381",
            "sentiment_compound": 0.9072
        },
        {
            "id": "howclim",
            "score": 1,
            "text": "Now this looks like a job for me",
            "title_similarity": "0.3093834",
            "sentiment_compound": 0.3612
        },
        {
            "id": "howe0rt",
            "score": 2,
            "text": "I'm just going to put it out there at that in general I've started to tip more because pandemic and the fact they are working in the service industry",
            "title_similarity": "0.6670139",
            "sentiment_compound": 0.0
        },
        {
            "id": "howe7v6",
            "score": 1,
            "text": "this is because the wonky geometry of nose and mouth placement in unattractive faces, and of course the quality of those features, are hidden from view. the ratios are potentially perfect until proven otherwise.",
            "title_similarity": "0.52946794",
            "sentiment_compound": 0.2023
        },
        {
            "id": "howe9dm",
            "score": 1,
            "text": "As a server, I know we have all gotten very comfortable with the guests not being able to see our full facial expressions or reading our lips at the server stations. It will be quite the adjustment to be fully out there again. I think the tips were better before the masks went on though so I'm sure we will enjoy that.",
            "title_similarity": "0.63825864",
            "sentiment_compound": 0.9056
        },
        {
            "id": "howexbj",
            "score": 2,
            "text": "Yep. It’s crazy how much the jaw influences how good looking someone is.",
            "title_similarity": "0.61629134",
            "sentiment_compound": 0.4019
        },
        {
            "id": "howh5ks",
            "score": 1,
            "text": "For some reason, \"a practice widely adopted during the Pandemic\" really gets me. The wording sounds so formal and passive. Do you think that's how it'll be worded in history books?",
            "title_similarity": "0.5058366",
            "sentiment_compound": 0.2648
        },
        {
            "id": "howjp46",
            "score": 2,
            "text": "This has been killing my tips for two years!!!",
            "title_similarity": "0.3401121",
            "sentiment_compound": -0.7412
        },
        {
            "id": "howl15r",
            "score": 1,
            "text": "TL;DR: ugly people are pretty when you can't see their face",
            "title_similarity": "0.5537262",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hownfw2",
            "score": 2,
            "text": "‘Yo, you are better looking in the dark’",
            "title_similarity": "0.3504644",
            "sentiment_compound": 0.4404
        },
        {
            "id": "howo62o",
            "score": 2,
            "text": "Ah… science to justify blocking a smile.",
            "title_similarity": "0.34875125",
            "sentiment_compound": -0.0258
        },
        {
            "id": "howr3ll",
            "score": 1,
            "text": "What a pointless waste of time and money this is. Clearly whoever did this study has never worked in hospitality or retail as they would know good service takes you much further than just looking pretty. I'm much more likely to receive a tip or good review if I give the best service I can.",
            "title_similarity": "0.55496544",
            "sentiment_compound": 0.9201
        },
        {
            "id": "howr9iw",
            "score": 1,
            "text": "This study is in Spain",
            "title_similarity": "0.15664549",
            "sentiment_compound": 0.0
        },
        {
            "id": "howt8ig",
            "score": 1,
            "text": "I'm telling you guys, its about about the eyes",
            "title_similarity": "0.14863254",
            "sentiment_compound": 0.0
        },
        {
            "id": "howuaw0",
            "score": 1,
            "text": "I liked masks cause I'm in good shape but kinda ugly haha",
            "title_similarity": "0.6159831",
            "sentiment_compound": 0.3447
        },
        {
            "id": "howywed",
            "score": 2,
            "text": "It's always funny when I finally see someone without their mask, and they look nothing like I imagined.",
            "title_similarity": "0.4424876",
            "sentiment_compound": 0.1999
        },
        {
            "id": "hoxypxg",
            "score": 1,
            "text": "This has really helped me as a middle school teacher.",
            "title_similarity": "0.38153908",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoyobcm",
            "score": 1,
            "text": "How were they able to measure such a subjective metric?",
            "title_similarity": "0.25012645",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoywnq4",
            "score": 1,
            "text": "How does one obtain a “Taco Bell Distinguished Professor” position at WSU (noted in the release)? Can you get it at the drive thru or do you need to walk up?",
            "title_similarity": "0.2865903",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp152a7",
            "score": 1,
            "text": "My wife says I am more attractive when I wear a mask too.",
            "title_similarity": "0.6964553",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hp41fk8",
            "score": 1,
            "text": "“You look so much better with your face covered.”",
            "title_similarity": "0.4584984",
            "sentiment_compound": 0.4902
        }
    ]
}