{
    "Nursing homes with the highest profit margins have the lowest quality. The Covid-19 pandemic revealed that for-profit long-term care homes had worse patient outcomes than not-for-profit homes. Long-term care homes owned by private equity firms and large chains have the highest mortality rates.\n": [
        {
            "id": "how61jz",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.37566423",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hownoj8",
            "score": 2,
            "text": "I mean… “blank with the highest profit margins provide the worst product and have the most unhappy employees” is capitalism 101.  How did YOU think these guys get their profit margins up?  By *not* exploiting people??",
            "title_similarity": "0.76881313",
            "sentiment_compound": 0.1414
        },
        {
            "id": "howlgrj",
            "score": -9,
            "text": "A for profit model is needed for Healthcare functions where innovation drives generation of new things. All other aspects of healthcare where there is no real innovation, the for profit model just extracts Funds that could be better used for care.",
            "title_similarity": "0.53950214",
            "sentiment_compound": 0.8783
        },
        {
            "id": "howr816",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "0.08652004"
        },
        {
            "id": "howlnj4",
            "score": 5,
            "text": "Capitalism and privatisation has it's place. But everything related to People's health and infrastructure should be state owned or heavily regulated. If the incentive for worse conditions is money, the conditions will always be worse.",
            "title_similarity": "0.64581317",
            "sentiment_compound": -0.7227
        },
        {
            "id": "howqf46",
            "score": 0,
            "text": "That's a simple fix. Ban for-profit nursing homes. Nothing is going to change the quality of care in them, even more regulations will likely be bypassed as soon as they find a loophole.",
            "title_similarity": "0.4788542",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hoxc0mv",
            "score": 2,
            "text": "THIS is what people get from capitalism. Poor quality of life and premature death.",
            "title_similarity": "0.647896",
            "sentiment_compound": -0.7906
        },
        {
            "id": "howskyd",
            "score": -6,
            "text": ">“This study is not focused on the public or non-profit seniors’ facilities across Canada, but rather, the pension funds, private-equity firms, public companies, and other instruments treating long-term care as an asset class,” said August of Waterloo’s School of Planning. “When financial firms own and operate seniors housing, they prioritize profit at the expense of other goals.\"\n\nIf they are hyper focused on profits rather than care, then wouldnt you want to keep your crop as healthy as possible for as long as possible in order to take more of their money over a longer period of time?\n\nSeriously, if my entire bottom line revolved around stealing money from old people I am going to do everything in my power to keep those old people alive as long as possible and would not do anything to risk them dying so that my bottom line is better for longer.",
            "title_similarity": "0.5992093",
            "sentiment_compound": 0.9752
        },
        {
            "id": "howl3yw",
            "score": 37,
            "text": "[removed]",
            "title_similarity": "0.08652004"
        },
        {
            "id": "hoxj7qg",
            "score": -1,
            "text": "I paid nearly 10,000$us a month for my mom’s “rehabilitation” from a minor fall, and it was just a sad old nursing home that had privatized bought by hedge fund to squeeze out profit.  Sad.",
            "title_similarity": "0.7340159",
            "sentiment_compound": -0.5106
        },
        {
            "id": "how9qz2",
            "score": -22,
            "text": "This seems fishy. Then whats the impetus for seniors to look at for-profit LTCs anyway?\n\nI'd believe the author that financialized senior care aims to maximize real-estate and investment over health of seniors.\n\nAre not-for-profit LTCs not that available? Or in shorter supply? Or too remote?",
            "title_similarity": "0.66500205",
            "sentiment_compound": 0.6322
        },
        {
            "id": "howoy95",
            "score": 71,
            "text": "You can not mix profit motive and services with inelastic demand… \n\nYou can not mix profit motive and services with inelastic demand… \n\nYou can not mix profit motive and services with inelastic demand…",
            "title_similarity": "0.36928645",
            "sentiment_compound": -0.7366
        },
        {
            "id": "howk8um",
            "score": 4,
            "text": "Anyone surprised? And the people collecting on the dividends are more old farts. How’s any of this make sense?",
            "title_similarity": "0.4872765",
            "sentiment_compound": 0.3094
        },
        {
            "id": "hox68q2",
            "score": 0,
            "text": "Why would anyone be surprised by this this. Two factors here:\n\n1. Greed. No explanation needed.\n\n2. Youth obsessed culture. By the time you’re in your mid forties the culture of America sees you as irrelevant except as an earner. When that goes away you are irrelevant and broke, therefore of the lowest importance. You are not to be seen or heard and are a constant reminder in a youth obsessed culture that nothing lasts. You are then tossed in a facility with minimal oversight.\n\nThis is not how every culture treats it’s elders but it’s how we do it.",
            "title_similarity": "0.5863336",
            "sentiment_compound": -0.5647
        },
        {
            "id": "hozfjnc",
            "score": 0,
            "text": "I have the same theory on journalism",
            "title_similarity": "0.085035324",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp09zh8",
            "score": 0,
            "text": "Health care should not be for-profit.",
            "title_similarity": "0.35412177",
            "sentiment_compound": 0.4939
        },
        {
            "id": "howpqwk",
            "score": 1,
            "text": "That's it.. The day I find out I'm going into a \"home\" is the day I walk into the forest. At least the wolves in the forest will make it quick.",
            "title_similarity": "0.2570036",
            "sentiment_compound": 0.0
        },
        {
            "id": "howlh74",
            "score": 2,
            "text": "If the profit margins are high, there might not be enough competition. So this makes sense.",
            "title_similarity": "0.40673798",
            "sentiment_compound": 0.4404
        },
        {
            "id": "howptt0",
            "score": 2,
            "text": "Where you call it “mortality rate”, they call it turn over.",
            "title_similarity": "0.36801627",
            "sentiment_compound": 0.0
        },
        {
            "id": "howxhki",
            "score": -2,
            "text": "Anyone who puts a loved one into these places should be ashamed",
            "title_similarity": "0.42275518",
            "sentiment_compound": 0.2023
        },
        {
            "id": "how87vx",
            "score": 194,
            "text": "Interesting, certainly, but… is this surprising to anyone? _”What a shock! For-profit nursing facilities owned and run by large, cold corporations aren’t exactly the best place for health and thriving! Who knew?!”_ I mean…",
            "title_similarity": "0.6873883",
            "sentiment_compound": 0.8837
        },
        {
            "id": "howfq6c",
            "score": 80,
            "text": "Private equity firms should not be allowed to own anything in healthcare",
            "title_similarity": "0.38831413",
            "sentiment_compound": 0.0
        },
        {
            "id": "hox4iv4",
            "score": 2,
            "text": "I will forever hate nursing homes. My great grandmother ended up in one at the ripe old age of 98. She fell and broke her hip, that was it. She had been a spry older woman with a perfectly intact memory. They doped her. They doped her up on so many drugs that she had no idea who anyone was within 3 months of her being there. She was barely capable of speech. I know alot can happen in 3 months but not that. Then within a year of that she was dead.  A few months away from her 100th birthday actually. She also went in a multi millionaire and somehow in that year and dome change they took that and she was functionally broke by the time she died. It was disgusting. It would have been cheaper and better for her to stay at home with a nurse but i was 2 young to get a say.",
            "title_similarity": "0.64302844",
            "sentiment_compound": -0.9427
        },
        {
            "id": "howo40r",
            "score": 5,
            "text": "I don't mean to sound crude, but would they not all have the same mortality rates.. ie 100%",
            "title_similarity": "0.5449707",
            "sentiment_compound": -0.3291
        },
        {
            "id": "howoa9a",
            "score": 4,
            "text": "There are \"not-for-profit\" nursing homes? I had no idea. How do they survive?",
            "title_similarity": "0.47769728",
            "sentiment_compound": -0.3736
        },
        {
            "id": "howogn2",
            "score": 4,
            "text": "Surprising. I thought the ritzy one pay the cnas up to 25$ an hour. The public ones could never hold on to staff",
            "title_similarity": "0.67192936",
            "sentiment_compound": 0.1779
        },
        {
            "id": "how835b",
            "score": 39,
            "text": "Profit over everything",
            "title_similarity": "0.24075861",
            "sentiment_compound": 0.4404
        },
        {
            "id": "howvu2t",
            "score": 10,
            "text": "Hospices are also like this. If a loved one needs hospice services, go for the local non-profit. If your doctor does offer you a choice, demand it. A lot of the for profits hire doctors to be a medical advisor so they will funnel patients to them.  I am a retired hospice pharmacist with 30 years in as a pharmacist and volunteer with a non-profit.",
            "title_similarity": "0.5547356",
            "sentiment_compound": 0.8467
        },
        {
            "id": "hownvkw",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "0.08652004"
        },
        {
            "id": "howvzwp",
            "score": 10,
            "text": "B b b b but how is this possible capitalism most efficient and best system. Its well known that rich businessmen are the only people qualified to run everything.\n\nShocked pikachu face.",
            "title_similarity": "0.6584372",
            "sentiment_compound": 0.9512
        },
        {
            "id": "howlipq",
            "score": 37,
            "text": "[removed]",
            "title_similarity": "0.08652004"
        },
        {
            "id": "howozv4",
            "score": 14,
            "text": "[removed]",
            "title_similarity": "0.08652004"
        },
        {
            "id": "howd0wk",
            "score": 161,
            "text": "Wow, it's almost as if using a ruthless for-profit shareholder-serving model as the basis for providing care to vulnerable people who are essentially captive to their health needs isn't in *their* best interests.",
            "title_similarity": "0.6368219",
            "sentiment_compound": 0.5764
        },
        {
            "id": "howra88",
            "score": 15,
            "text": "I'm sure the free market will correct this any second now",
            "title_similarity": "0.11644152",
            "sentiment_compound": 0.6808
        },
        {
            "id": "howm7fz",
            "score": 245,
            "text": "Mortality Rates From COVID-19 Are Lower In Unionized Nursing Homes- \n\n[https://www.timesunion.com/news/article/Study-NY-s-unionized-nursing-homes-had-fewer-15571977.php](https://www.timesunion.com/news/article/Study-NY-s-unionized-nursing-homes-had-fewer-15571977.php)\n\nhttps://www.healthaffairs.org/doi/full/10.1377/hlthaff.2020.01011?utm\\_medium=press&utm\\_source=mediaadvisory&utm\\_campaign=CovidFasttrack&utm\\_content=Dean",
            "title_similarity": "0.7064925",
            "sentiment_compound": -0.296
        },
        {
            "id": "howp21s",
            "score": 48,
            "text": "It's almost like if you let the owners focus on profit they will cut as many corners as they can to maximise it or something. Who could've possibly predicted that the \"free market\" would end up being a race to the bottom on service in pursuit of a race to the top for profits. Except everybody.",
            "title_similarity": "0.56937486",
            "sentiment_compound": 0.8752
        },
        {
            "id": "howqdhl",
            "score": 18,
            "text": "Coincidentally, humans with the highest profit margins are also of the lowest quality.",
            "title_similarity": "0.6880306",
            "sentiment_compound": 0.0772
        },
        {
            "id": "howm5s6",
            "score": 66,
            "text": "[removed]",
            "title_similarity": "0.08652004"
        },
        {
            "id": "howlygn",
            "score": 308,
            "text": "Maybe we don't need profit maximisation-driven entities responsible for every provision of people's goods and services.",
            "title_similarity": "0.38518262",
            "sentiment_compound": -0.0274
        },
        {
            "id": "how97ru",
            "score": 624,
            "text": "Well obviously. You're not going to make a profit if you're spending the money on caring for the residents",
            "title_similarity": "0.43739527",
            "sentiment_compound": 0.802
        },
        {
            "id": "hownw7s",
            "score": 363,
            "text": "[removed]",
            "title_similarity": "0.08652004"
        },
        {
            "id": "howir1n",
            "score": 427,
            "text": "[removed]",
            "title_similarity": "0.08652004"
        },
        {
            "id": "howe1kx",
            "score": 950,
            "text": "[removed]",
            "title_similarity": "0.08652004"
        },
        {
            "id": "howl3lu",
            "score": 114,
            "text": "No one in Fire/EMS would be surprised by this finding.",
            "title_similarity": "0.23147452",
            "sentiment_compound": -0.0772
        },
        {
            "id": "how9ffm",
            "score": 4162,
            "text": "I work in healthcare and frequently attend nursing homes. \n\nThe charity-run ones? They don't look the best but the staff there are usually deeply committed to the care of their clients.\n\nThe for-profit ones look flash, have a hotel-like ambience and are almost universally shoddy in the \"care\" of the clients. If people had any idea how almost-inhumanely poor their level of \"care\" was, they wouldn't consider them for any member of their family unless they hated them. \n\nI have vowed to my parents that they will never be taken within coo-ee of one.\n\n(Edit of a word).",
            "title_similarity": "0.6848232",
            "sentiment_compound": 0.5934
        },
        {
            "id": "hown5el",
            "score": 472,
            "text": "That's the holy grail of today's business. Highest possible profit margin with lowest possible costs ... doesn't take a genius to foresee the quality of an outcome. Now you take monopoly into an account and limit competition, and you have something like cable companies that provide slowest internet for highest price.",
            "title_similarity": "0.7190702",
            "sentiment_compound": 0.4215
        },
        {
            "id": "howmhnb",
            "score": 2,
            "text": "Unbelievable, who was expecting profit above people?",
            "title_similarity": "0.44491452",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hownl5p",
            "score": 1,
            "text": "Isn't that the point of any business, get the most money for the least work?",
            "title_similarity": "0.611539",
            "sentiment_compound": 0.0
        },
        {
            "id": "howou7q",
            "score": 2,
            "text": "For profit care of people is not a good idea. Ever.",
            "title_similarity": "0.4803295",
            "sentiment_compound": 0.571
        },
        {
            "id": "howovo8",
            "score": 1,
            "text": "Wondering if this is true for hospitals, too.",
            "title_similarity": "0.28536057",
            "sentiment_compound": 0.4215
        },
        {
            "id": "howpv5c",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "0.08652004"
        },
        {
            "id": "howpy93",
            "score": 12,
            "text": "[deleted]",
            "title_similarity": "0.12825322"
        },
        {
            "id": "howq16s",
            "score": 1,
            "text": "Yeah, there was a movie about that staring Peter Dinklage wasn't there?",
            "title_similarity": "0.2954586",
            "sentiment_compound": 0.296
        },
        {
            "id": "howqb1t",
            "score": 2,
            "text": "File this in the obvious folder.",
            "title_similarity": "0.03866711",
            "sentiment_compound": 0.0
        },
        {
            "id": "howqoyt",
            "score": 1,
            "text": "It’s not profitable to do what you’re selling.  This shouldn’t be a surprise to anyone but pro covid idiots",
            "title_similarity": "0.42960277",
            "sentiment_compound": -0.0395
        },
        {
            "id": "howr7hy",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.086520046"
        },
        {
            "id": "howrrvh",
            "score": 1,
            "text": "Time to fund longevity science and shrink morbidity, so we can obsolete some of these places.",
            "title_similarity": "0.47714546",
            "sentiment_compound": -0.3535
        },
        {
            "id": "hows6zu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08652004"
        },
        {
            "id": "howsf8g",
            "score": 1,
            "text": "A person’s care rather it be elder care or care when sick should never be about profit over care provided. This model of lining the investors pockets at the expense of another’s suffering is unethical and immoral.",
            "title_similarity": "0.61366355",
            "sentiment_compound": -0.3195
        },
        {
            "id": "howsq22",
            "score": 1,
            "text": "Weird. It’s almost like they either care about the bottom line or the quality of care, but never both.",
            "title_similarity": "0.39707354",
            "sentiment_compound": 0.5351
        },
        {
            "id": "howtd4s",
            "score": 1,
            "text": "I worked for a not for profit water company, there was no lambos in the carpark all necessary travel was economy. And we didn't pass on government bailouts to the shareholders...unlike all the other UK water companies. Nice place to work too.",
            "title_similarity": "0.46441388",
            "sentiment_compound": -0.2037
        },
        {
            "id": "howtx7p",
            "score": 1,
            "text": "This is another reason for our current housing crisis. The older generation cannot afford to sell and move to long term care facilities like they used to. So they don’t sell their home and just stay there, removing what would have been inventory from the already limited pool.",
            "title_similarity": "0.6131027",
            "sentiment_compound": -0.0772
        },
        {
            "id": "howu1nz",
            "score": 2,
            "text": "Is there a resource to compare nursing home ownership types?",
            "title_similarity": "0.32410818",
            "sentiment_compound": 0.0
        },
        {
            "id": "howu458",
            "score": 1,
            "text": "Profit is inefficiency. It is money that is put into a system and isn't used to improve that system, by design.",
            "title_similarity": "0.5213281",
            "sentiment_compound": 0.1265
        },
        {
            "id": "howu48l",
            "score": 1,
            "text": "I wonder if any other scientists have noted the connection between privatization under capitalism and poor outcomes",
            "title_similarity": "0.5812683",
            "sentiment_compound": -0.4767
        },
        {
            "id": "howu6mu",
            "score": 1,
            "text": "What was the worst one? Gonna tell my parents to start behaving or imma throw their asses in there.",
            "title_similarity": "0.45533288",
            "sentiment_compound": -0.6249
        },
        {
            "id": "howu6mw",
            "score": 2,
            "text": "The nursing homes, ALFS and rehab centers that I get called to are horrendous. Nothing ever happens to them when they are constantly reported. Every time I take a PT out of there its either complete BS or they are circling the drain after horrible care.",
            "title_similarity": "0.53119445",
            "sentiment_compound": -0.6249
        },
        {
            "id": "howubey",
            "score": 1,
            "text": "One could say this of almost literally everything in existence. As soon as the leaches come in, quality goes to hell. Gotta pay The Man.",
            "title_similarity": "0.45600697",
            "sentiment_compound": -0.7184
        },
        {
            "id": "howulwi",
            "score": 1,
            "text": "There has to be some sectors where private equity firms should not be allowed to enter.",
            "title_similarity": "0.35569745",
            "sentiment_compound": 0.0
        },
        {
            "id": "howuop1",
            "score": 1,
            "text": "It's only going to get worse too. Yes, it will still be bad for the CURRENT generations that are now viewing Reddit(I'm talking to you reading this). Hopefully you will get old and not have to go through this, but some if not MOST of you WILL.  Imagine the future drone like humans having zero empathy, narcissistic mentality caring for you.  We can hope that machines or robots will be invented by then to care for the elderly by the time we reach it.",
            "title_similarity": "0.57226443",
            "sentiment_compound": 0.9474
        },
        {
            "id": "howutco",
            "score": 1,
            "text": "Oh...wow tell me how could we have let money take over our lives!",
            "title_similarity": "0.40818006",
            "sentiment_compound": 0.0
        },
        {
            "id": "howuwrj",
            "score": 2,
            "text": "One aspect that was pointed out when comparing the Covid-rates in norwegian and swedish nursing homes was that the swedish nursing homes had a higher degree of people working in mutliple homes than norwegian nursing homes had. This meant that an infected swedish employee would in average spread the virus to more pasients and more homes than an infected norwegian employee. Could the difference between norwegian and swedish nursing homes be comparable to the difference between profit and no-profit nursing homes?",
            "title_similarity": "0.73997486",
            "sentiment_compound": -0.5423
        },
        {
            "id": "howv20f",
            "score": 1,
            "text": "This one crazy trick works on the vast majority of industries.\nProfit margin inversely correlates to output quality and worker satisfaction. There are obvious reasons for this.",
            "title_similarity": "0.5675137",
            "sentiment_compound": 0.4939
        },
        {
            "id": "howv5z9",
            "score": 1,
            "text": "As someone who had worked in a number of homes this doesn’t surprise me at all. The love of money is the root of all evil.",
            "title_similarity": "0.44151747",
            "sentiment_compound": 0.296
        },
        {
            "id": "howvti6",
            "score": 1,
            "text": "Wonder if the same applies to Prison Systems as well.",
            "title_similarity": "0.18203332",
            "sentiment_compound": -0.296
        },
        {
            "id": "howvx45",
            "score": 1,
            "text": "Why am I not surprised..",
            "title_similarity": "-0.023481485",
            "sentiment_compound": -0.1695
        },
        {
            "id": "howw0d3",
            "score": 1,
            "text": "My Brother worked as a cleaner for nursing home. He was overworked and underpaid however for once  he took his day off. But when he returned the next day he was told to clean a room due to a accident. When he entered the room he noticed that the floor was caked in dried blood. You see that day off a older woman had slipped off her bed and cut herself on the medical equipment. She wasn't found till later that day and all the nurses did was get rid of the body. \n\nYeah that place is horrific.",
            "title_similarity": "0.60050315",
            "sentiment_compound": -0.802
        },
        {
            "id": "howw2ou",
            "score": 1,
            "text": "I used to work for SSL, at their corporate office. Dont send your parents to a SSL.",
            "title_similarity": "0.45088798",
            "sentiment_compound": 0.0
        },
        {
            "id": "howw3ir",
            "score": 2,
            "text": "Another case showing free market economics does not produce the best outcomes. Profit is king --> cut quality of care --> more profit, worse care.",
            "title_similarity": "0.68356526",
            "sentiment_compound": 0.8026
        },
        {
            "id": "howw5j6",
            "score": 2,
            "text": "When profits are involved, you never want to be a cost.",
            "title_similarity": "0.24901485",
            "sentiment_compound": 0.3975
        },
        {
            "id": "howw7ty",
            "score": 3,
            "text": "Is it seriously still a debate on whether or not anything for profit is good, answer: no it isn’t anything designed to make the person at the top money isn’t good for anyone other than the one profiting from it",
            "title_similarity": "0.48167512",
            "sentiment_compound": 0.5986
        },
        {
            "id": "howwasw",
            "score": 1,
            "text": "Which kind has the highest probability for a Ben Stiller type nurse...\n\nYour fingers hurt??? Well now your back is gonna hurt from yard duty.   Anybody else's fingers hurt???",
            "title_similarity": "0.61425066",
            "sentiment_compound": -0.7691
        },
        {
            "id": "howwjzz",
            "score": 2,
            "text": "there is no productivity opportunity in end of life care and therefore the tool that is capitalism won't work.\n\nend of life care should be a public private partnership with the 'private' being a owner owned partnership in which the people who work there are direct owners.  We pay ~$10,000 per month for a shared room.... $240,000 per year per room and yet the labor is paid... $15 per hour or something BS like that....",
            "title_similarity": "0.7010038",
            "sentiment_compound": 0.7482
        },
        {
            "id": "howwzt0",
            "score": 1,
            "text": "I work in one of these asca therapist 10000% agree its appalling",
            "title_similarity": "0.54643714",
            "sentiment_compound": 0.0
        },
        {
            "id": "howx1ky",
            "score": 1,
            "text": "But don't they all have a mortality rate of 100%?",
            "title_similarity": "0.49464232",
            "sentiment_compound": 0.0
        },
        {
            "id": "howx6eb",
            "score": 1,
            "text": "It's almost like capital markets aren't equipped to solve certain problems. \n\nHealth care, child care, elder care, school, policing, firefighting. Each of these services, which are not optional, require more resources to meet demand than the market can profitably support. To give dependant seniors the care and attention they needed (caretakers paid salaries commensurate with their training; facilities fully equipped to handle their personal and medical needs) the cost would be out of reach for most individuals and families. Elder care facilities can only operate because the income provided by social security and Medicare effectively subsidize some of these costs.  Even then, it's not enough. To remain profitable, they have to cut corners. Reduce the staff-to-resident ratio. Hire low-wage staff. Spend the bare-minimum on facilities and maintenance. The result: seniors left in their rooms without attention days at a time, physical and verbal abuse from the staff, incompetent medical care, slow response to emergencies, mold growing in the ceilings or rugs, and other dangerous/unsanitary conditions.\n\nPrivate for-profit facilities are fundamentally incapable of meeting our needs. If we care for our elderly, then we need to consider other solutions.",
            "title_similarity": "0.68843454",
            "sentiment_compound": 0.9748
        },
        {
            "id": "howxbdl",
            "score": 1,
            "text": "I would legit protest at a for profit place at this point.",
            "title_similarity": "0.41731614",
            "sentiment_compound": 0.2263
        },
        {
            "id": "howxc3z",
            "score": 1,
            "text": "Accounting should only ever be applied to healthcare and education as a subservient measurement, not authoritative metering.",
            "title_similarity": "0.3818136",
            "sentiment_compound": 0.0
        },
        {
            "id": "howxdk8",
            "score": 1,
            "text": "The nursing home where my dad lived (he died a few years ago, pre-pandemic) was forced to permanently close one of their buildings because Covid swept through and killed too many residents in a very short period. Their profit margins were too low to keep operating it for the remaining people who were left.\n\nIt was a very nice facility.",
            "title_similarity": "0.65950596",
            "sentiment_compound": -0.8024
        },
        {
            "id": "howxego",
            "score": 2,
            "text": "same with dialysis.  the for-profit operations had worse outcomes, and were worse at getting people timely transplants (I'm assuming due to the obvious conflict of interest)",
            "title_similarity": "0.6642419",
            "sentiment_compound": -0.6705
        },
        {
            "id": "howxq9m",
            "score": 14,
            "text": "Profits over people in this country. Always.",
            "title_similarity": "0.42178994",
            "sentiment_compound": 0.4404
        },
        {
            "id": "howxreg",
            "score": 1,
            "text": "I can't understand how a home can be a for profit home. The whole concept is just vile to me. Where is the profit coming from?! It means that people are paying way more than what they are getting. Also knowing how for profit organisations are always trying to find ways to make an ever higher profit, they will be constantly trying to reduce cost and thus will continuously lower their quality of care.",
            "title_similarity": "0.6983901",
            "sentiment_compound": 0.8313
        },
        {
            "id": "howxyeg",
            "score": 2,
            "text": "Any company that focuses solely on the highest profit margins will always have the lowest quality product",
            "title_similarity": "0.6521301",
            "sentiment_compound": 0.0772
        },
        {
            "id": "howy0z2",
            "score": 1,
            "text": "It's this not the case for almost all companies and products?",
            "title_similarity": "0.41881302",
            "sentiment_compound": 0.0
        },
        {
            "id": "howy2z2",
            "score": 1,
            "text": "Surprised pickachu face?",
            "title_similarity": "0.17054737",
            "sentiment_compound": 0.2263
        },
        {
            "id": "howy3jr",
            "score": 9,
            "text": "Flesh for cash I always say. This is well known fact among healthcare workers. For profit offer the worst hourly rates, have the highest turnover and provide substandard support to care for the people paying.",
            "title_similarity": "0.7595117",
            "sentiment_compound": 0.7003
        },
        {
            "id": "howy619",
            "score": 1,
            "text": "Gotta turn those tables!",
            "title_similarity": "0.09860287",
            "sentiment_compound": 0.0
        },
        {
            "id": "howy85g",
            "score": 1,
            "text": "Living in a country with government owned and run old age homes, this is ensuring. (Norway)",
            "title_similarity": "0.41193166",
            "sentiment_compound": 0.2732
        },
        {
            "id": "howyavr",
            "score": 1,
            "text": "My mom has worked in these places for a long time. She has told all of my siblings to never put her in any long term care facility. She would rather be at home.",
            "title_similarity": "0.47057572",
            "sentiment_compound": 0.4939
        },
        {
            "id": "howygz5",
            "score": 1,
            "text": "Almost like healthcare and capitalism don't mesh well, like if the fundamental motivating factors are completely different",
            "title_similarity": "0.602134",
            "sentiment_compound": 0.3576
        },
        {
            "id": "howyiwe",
            "score": 1,
            "text": "Two years ago my husband (then 43) spent 3 weeks in an SNF run by a big corporation after a massive heart attack and anoxic brain injury.\n\nWe made sure that a family member was there with him the entire time because the care was so poor otherwise. I took him home as soon as they let me, surprising the social worker and my in-laws.\n\nNever again.",
            "title_similarity": "0.5942588",
            "sentiment_compound": 0.3626
        },
        {
            "id": "howyklm",
            "score": 1,
            "text": "We are part owners of an assisted living community and my husband works there. I am all for capitalism but at the extreme end it devalues human life. We want to make a profit but my husband truly loves the residents. He often cries when they die. The families often ask him to speak at the funerals. He only hires people who have a great attitude and pays them accordingly. The residents are often vulnerable people and it is such an honor to be there for them at what is often the end of their life.",
            "title_similarity": "0.6140518",
            "sentiment_compound": 0.8885
        },
        {
            "id": "howykov",
            "score": 2,
            "text": "Pretty much anything owned by private equity is screwed. This is despicable.",
            "title_similarity": "0.5797276",
            "sentiment_compound": 0.0
        },
        {
            "id": "howynuu",
            "score": 2,
            "text": "Is there nothing private equity cannot make miserable?  It's almost as if PE were run by soulless monsters.... oh wait.",
            "title_similarity": "0.5078127",
            "sentiment_compound": 0.3875
        },
        {
            "id": "howyqld",
            "score": 1,
            "text": "To the absolute surprise to nobody",
            "title_similarity": "0.16461219",
            "sentiment_compound": 0.2732
        },
        {
            "id": "howz053",
            "score": 1,
            "text": "There are only finite amount of bed available. Number of filled bed = $$$. They can only make so much. \n\nThe only way to make more money is to reduce the expense.",
            "title_similarity": "0.612988",
            "sentiment_compound": 0.0772
        },
        {
            "id": "howz919",
            "score": 1,
            "text": "Private equity in healthcare is the nightmare scenario.\n\nThey are the people that need to do go against the wall first.",
            "title_similarity": "0.67379713",
            "sentiment_compound": 0.0
        },
        {
            "id": "howzaov",
            "score": 1,
            "text": "With not for profit it's caring. With for profit it's warehousing.",
            "title_similarity": "0.4187731",
            "sentiment_compound": 0.571
        },
        {
            "id": "howzbtw",
            "score": 1,
            "text": "i worked dietary for a profit nursing home for 6 hrs in my early twenties. the bread was like cardboard. the food seriously was like prison food. i wouldnt eat any of it and im not a picky person. there would be like 2 aides for 25 patients on most halls. and there are completely dependent people there. like people who need help urinating, eating etc. the rooms looked like prison cells. white painted brick with a small hospital bed. two patients for one room.. or  unless u had $ and did private pay then u could not only receive a menu w more food options but also have ur own room. it was disgusting the class based treatment at the facility. mostly i remember the stench of urine. wasnt the aides or patients fault. there was not enough help for the patients. some nursing homes are great im sure but some are deeply depressing inhumane places imo.",
            "title_similarity": "0.59555113",
            "sentiment_compound": -0.7921
        },
        {
            "id": "howzmp3",
            "score": 1,
            "text": "For anyone in the US it's important to know that if a facility deals with Medicare then they are subject to an annual survey and the survey results are published for all to see on the CMS website.\n\nwww.medicare.gov/care-compare\n\nThen search for a community, scroll down to health inspections, view inspection results, then view full report for the most recent inspection. That information is more accurate than anything anybody working for the facility can or will ever divulge.",
            "title_similarity": "0.50963914",
            "sentiment_compound": 0.2023
        },
        {
            "id": "howzoc2",
            "score": 2,
            "text": "Turns out this applies to LITERALLY EVERYTHING ON THIS PLANET. Profits always come before people. Capitalism kills.",
            "title_similarity": "0.53045475",
            "sentiment_compound": -0.1531
        },
        {
            "id": "howzpa8",
            "score": 1,
            "text": "These evil places charge so much money and then have the audacity to charge them for every meal.",
            "title_similarity": "0.51645887",
            "sentiment_compound": -0.6597
        },
        {
            "id": "howzqdb",
            "score": 1,
            "text": "This isn’t news if you work in healthcare. We treat our elderly abhorrently.",
            "title_similarity": "0.563972",
            "sentiment_compound": 0.4019
        },
        {
            "id": "howzs80",
            "score": 1,
            "text": "The rich only care about one thing……",
            "title_similarity": "0.35281396",
            "sentiment_compound": 0.7783
        },
        {
            "id": "howzuqr",
            "score": 1,
            "text": "Insert Fry shocked gif",
            "title_similarity": "0.18493375",
            "sentiment_compound": -0.3182
        },
        {
            "id": "howzvyy",
            "score": 1,
            "text": "I am shocked, shocked! Well, not that shocked",
            "title_similarity": "0.13304244",
            "sentiment_compound": -0.2095
        },
        {
            "id": "howzw16",
            "score": 1,
            "text": "Prices go up year to year so if they have a patient paying less than a new patient would have to pay its beneficial that they die. Also the fact is corners will also be cut to maximise profits whether its something Minor like quality of utilities or something major like missing out on peoples Meds or stopping them getting administered. Unlike big Pharma they lose money from giving people 10 pills everyday. If they can get away with giving them less or even if they die because of it somebody will take their place. I'm not sure but I think a lot of these places have long waiting lists too.",
            "title_similarity": "0.72807634",
            "sentiment_compound": -0.2671
        },
        {
            "id": "hox03xb",
            "score": 1,
            "text": "Nursing home staff around here went on strike for a year like 4 years ago. 3 people died and were not \"discovered\" days later. They just ignored the people dead in their beds thinking they were being moody and ignoring the scabs.",
            "title_similarity": "0.54981434",
            "sentiment_compound": -0.9246
        },
        {
            "id": "hox061a",
            "score": 1,
            "text": "Don't non profit care homes get special incentives from the government?",
            "title_similarity": "0.4260546",
            "sentiment_compound": -0.0088
        },
        {
            "id": "hox06kb",
            "score": 1,
            "text": "They're death factories, the money they charge people to die alone with inadequate care is disgusting.",
            "title_similarity": "0.637973",
            "sentiment_compound": -0.9136
        },
        {
            "id": "hox0clj",
            "score": 1,
            "text": "Sounds like capitalism.",
            "title_similarity": "0.2873901",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hox0dmf",
            "score": 1,
            "text": "Any for-profit essential service is going to be much lower quality than it needs to be. That's the point. Make as much money as possible, spend as little as possible.",
            "title_similarity": "0.5949909",
            "sentiment_compound": -0.296
        },
        {
            "id": "hox0g92",
            "score": 1,
            "text": "Lookin at you Life Care Centers of America. Especially in Rensselaer Indiana.",
            "title_similarity": "0.3731355",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hox0hsk",
            "score": 1,
            "text": "Ah so you mean capitalism and healthcare don't mix?? Wild.",
            "title_similarity": "0.5528089",
            "sentiment_compound": 0.0
        },
        {
            "id": "hox0jqd",
            "score": 2,
            "text": "This is a Canadian study about Canadian facilities. Extrapolating this study to care facilities anywhere else may not be accurate. Government regulations and oversight in care facilities differs country by country. In the US, CMS is very rigid in their inspections of Skilled Nursing Facilities that accept Medicare and Medicaid.\n\nThere are vast differences in the types of facilities. Adult care home, skilled nursing facilities, adult care communities, senior housing/apartments, hospital step-down units and ALFs are different and are regulated differently. \n\nThe fact remains, though, that you cannot provide quality care if you do not make a responsible profit.",
            "title_similarity": "0.5523044",
            "sentiment_compound": 0.9172
        },
        {
            "id": "hox0nzu",
            "score": 1,
            "text": "Obviously? Healthcare should be a right, not a for profit industry. Example number: 1004.",
            "title_similarity": "0.5099516",
            "sentiment_compound": -0.2746
        },
        {
            "id": "hox0x3n",
            "score": 1,
            "text": "Where I live, a nursing home housed like 80% of our cities early covid deaths. They're under investigation now.",
            "title_similarity": "0.58666587",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hox0y1p",
            "score": 1,
            "text": "Higer turnover = higher profit.",
            "title_similarity": "0.45766717",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hox12uf",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.08652004"
        },
        {
            "id": "hox1d7a",
            "score": 1,
            "text": "Did this study take on to account government policies that can be directly linked to the death in patients? NY for example?",
            "title_similarity": "0.5504527",
            "sentiment_compound": -0.644
        },
        {
            "id": "hox1dur",
            "score": 1,
            "text": "There's a large social side this as well. One of my friends worked in a building like this, she said the only people who care about these patients health less than the staff are the patients. \n\nI work in a SNF that is primarily short term rehab. We operate under the same license, but very different approaches to care. We have some of the best care around and are for profit. \n\nHowever, patients who are unfunded with no family support who have no where to go for LTC end up in places like this. These big corps buy up buildings and fill them with anyone that'll qualify for Medicaid. They're able to float the pending period by volume and a staggering low staffing rations. We're 1:5-7 depending on how acute the hall is. They're at like 1:32.\n\n\nI'm not saying what they're doing is right, just there's a huge need. Where does the homeless 70 year old with dementia go after a hospital stay? Sadly these places. The hospitals as they can't keep them there forever.",
            "title_similarity": "0.7126415",
            "sentiment_compound": 0.9653
        },
        {
            "id": "hox1f5g",
            "score": 1,
            "text": "high profit margin = poor quality is to be expected because profit = inefficiency in a system. A purely efficient system operates with no profit.",
            "title_similarity": "0.6592374",
            "sentiment_compound": 0.5247
        },
        {
            "id": "hox1hk0",
            "score": 1,
            "text": "I would be interested if anyone has read to study can note whether and how they controlled for location.",
            "title_similarity": "0.064075336",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hox1hmt",
            "score": 1,
            "text": "I wish I could say I’m shocked but let’s face it: if there’s a dollar to be made by cutting corners, that dollar will be made by cutting all the corners and the center if necessary.",
            "title_similarity": "0.47699875",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hox1jku",
            "score": 1,
            "text": "And no one is surprised by this",
            "title_similarity": "0.020049948",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hox1jn6",
            "score": 1,
            "text": "This is a no-brainer. I work in SNF (Skilled Nursing Facilities) and in their defense, you cannot have your cake and eat it too:\n\nIn an overly simplified explanation, either you provide great patient care (plenty of aids/staff, nice facility, good food) or you chase the dollar the government has dangling in front of you by skimping on the aforementioned and providing unnecessary therapies to bump that bottom line. I am NOT saying therapies (Speech, Occupational, and Physical) aren't necessary, I'm saying providing more than a given patient needs so we get that payback.",
            "title_similarity": "0.63570714",
            "sentiment_compound": 0.926
        },
        {
            "id": "hox1pgq",
            "score": 1,
            "text": "When you care about money you don’t care about people, if you care about people you care less about money.",
            "title_similarity": "0.4611591",
            "sentiment_compound": 0.9153
        },
        {
            "id": "hox1sap",
            "score": 1,
            "text": "for-profit long term care shouldn’t even be a thing",
            "title_similarity": "0.43421015",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hox1tzc",
            "score": 1,
            "text": "Right.  Because capitalism only works well for the people at the top.",
            "title_similarity": "0.5960944",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hox1v17",
            "score": 1,
            "text": "This is pure greed.  I work with a for profit nursing home chain run by a family that actually cares about residents  that even partnered with local hospitals to take in covid patients they couldn’t handle, and has spent thousands building full fledged covid units/isolation units/quarantine units with everyone being required to wear face masks and face shields daily.  Those facilities have had covid deaths because obviously we couldn’t stop all of them when it targets the elderly especially hard but I don’t think mortality was higher than other nursing homes in the area, some of which lost dozens of residents in brief periods of time.  \n\nI will also mention however that this for profit company has lost money during the pandemic and would be in a bad situation if not for government funding, especially because of staffing problems, one of the facilities is located in straight trump country where only like 1/3 of everyone is vaccinated and the other two had about 30% staff quit because of vaccine mandates.  Also the biggest moneymaker for most nursing homes, physical therapy, was pretty much cut during covid which ate into the margin.  Luckily before covid this company was very well run so a year of losses doesn’t send them to bankruptcy or anything.",
            "title_similarity": "0.7050185",
            "sentiment_compound": 0.26
        },
        {
            "id": "hox1x01",
            "score": 1,
            "text": "Let’s say it one more time for the folks in the cheap seats: housing and health care are human rights and any society that allows people to profit of either has failed.",
            "title_similarity": "0.6002084",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hox223x",
            "score": 1,
            "text": "# US-based nursing homes",
            "title_similarity": "0.27637213",
            "sentiment_compound": 0.0
        },
        {
            "id": "hox22cw",
            "score": 1,
            "text": "This is capitalism working as intended.  Who here is honestly surprised?",
            "title_similarity": "0.3411557",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hox24vc",
            "score": 1,
            "text": "Ontariariariooooooooo\n\nOh, the problems with this province. :-(",
            "title_similarity": "0.2972236",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hox2xz2",
            "score": 1,
            "text": "I told my kids if I get so bad you can't take care of me I want 24 hour camera surveillance in my room with 2 way speakers so they know my family is watching",
            "title_similarity": "0.4075095",
            "sentiment_compound": -0.7795
        },
        {
            "id": "hox32nu",
            "score": 1,
            "text": "None of this should come as any surprise.",
            "title_similarity": "0.05738668",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hox33r3",
            "score": 1,
            "text": "Aren't all nursing homes supposed to have a 100% mortality rate?\n\nUnless they mean specifically with coronavirus.",
            "title_similarity": "0.63250995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hox3a8v",
            "score": 1,
            "text": "To the shock and awe of absolutely nobody with any kind of understanding of how companies make profits.",
            "title_similarity": "0.43485588",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hox3e0u",
            "score": 2,
            "text": "Hey, it almost like capitalism is a totally inhumane system that has no regard for human life or any life at all whatsoever for that matter!",
            "title_similarity": "0.3740063",
            "sentiment_compound": 0.1025
        },
        {
            "id": "hox3m7v",
            "score": 1,
            "text": "And this isn't some complicated issue, they pressured everyone to come to work even when they were sick. That's what it came down to, they had sick people working in the homes during a pandemic.",
            "title_similarity": "0.5294653",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hox45oh",
            "score": 2,
            "text": "Am I the only one that feels like private equity firms and large chains should not be allowed to own nursing homes?",
            "title_similarity": "0.64020646",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hox4a2o",
            "score": 1,
            "text": "This is all just a dumber form of the Matrix when you privatize healthcare and expect it to print money.",
            "title_similarity": "0.6212832",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hox4k9q",
            "score": 1,
            "text": "I'm a pharmacist. We need mortality rates between chain pharmacies and independent pharmacists.",
            "title_similarity": "0.5413041",
            "sentiment_compound": 0.0
        },
        {
            "id": "hox4ln4",
            "score": 1,
            "text": "The whole idea of splitting up family units for profit is a sick game.",
            "title_similarity": "0.5211355",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hox4pul",
            "score": 1,
            "text": "Same goes for private prisons. Any privately owned and operated organization will put profit over everything and everyone, 100% of the time.",
            "title_similarity": "0.570324",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hox4r1v",
            "score": 1,
            "text": "Well of course. How do you think they make those profits. They neglect the care of their residents.",
            "title_similarity": "0.5303036",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hox4t1m",
            "score": 1,
            "text": "I work as an in-home care giver and let me urge everyone to keep your loved ones in their home or your home for as long as possible!! Care homes are alienating for the patient, filled with overworked and underpaid staff, and, as this article points out, most of them do not really care about your loved one. I'm not sure of the comparable cost of in-home care giving as opposed to a nursing home, but the emotional well being and care of your loved one will be 10x greater than that of a nursing home.",
            "title_similarity": "0.6827191",
            "sentiment_compound": 0.9779
        },
        {
            "id": "hox4wi1",
            "score": 1,
            "text": "The mortality rates are really 100% across the board.",
            "title_similarity": "0.50831586",
            "sentiment_compound": 0.0
        },
        {
            "id": "hox4wzn",
            "score": 1,
            "text": "We. Already. Knew. That.",
            "title_similarity": "-0.038584035",
            "sentiment_compound": 0.0
        },
        {
            "id": "hox4ztn",
            "score": 1,
            "text": "Well I am just shocked. It's almost like the profit motive corrupts all human endeavors",
            "title_similarity": "0.542053",
            "sentiment_compound": 0.5637
        },
        {
            "id": "hox51yg",
            "score": 1,
            "text": "I always wondered why nursing homes didn’t hire people to go in a few times a week and just visit with the older folks. I’m not talking about nurses or activities coordinators, but maybe hired teens or young adults to just sit there and compassionately talk and listen and be a companion for a few hours. Having a visitor can really make a difference. I’d love to have that as a part time job.",
            "title_similarity": "0.4721536",
            "sentiment_compound": 0.8847
        },
        {
            "id": "hox546w",
            "score": 1,
            "text": "The coldest, most evil threat I've ever heard was, \"I get to choose what nursing home we put you in.\"\n\nDon't worry, it was in a movie or TV show. But still. It's a good one.",
            "title_similarity": "0.5690058",
            "sentiment_compound": 0.0944
        },
        {
            "id": "hox5b1k",
            "score": 1,
            "text": "But but but... Free market!!!! If the poor corporations had worse outcomes, it was cause of da too big regulations!!!!!!! Big bad govament getting in the way!!! Shareholders have rights toooo!!!!!!!",
            "title_similarity": "0.6472179",
            "sentiment_compound": -0.8949
        },
        {
            "id": "hox5fya",
            "score": 1,
            "text": "Maybe also the comfort that rich people lived in their whole lives sometimes made them weaker",
            "title_similarity": "0.6200506",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hox5hkd",
            "score": 1,
            "text": "Tory scum already know, they don’t care",
            "title_similarity": "0.1756176",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hox5obl",
            "score": 1,
            "text": "Basically any for profit business model will sacrifice quality for more profits.  It’s a race to the bottom. And all the money just funnels upwards.",
            "title_similarity": "0.5257239",
            "sentiment_compound": 0.7574
        },
        {
            "id": "hox6ah0",
            "score": 1,
            "text": "I would say the expensive ones have a vested interest in prolonging life. When MIL checked into one for dementia, she is eating well and loving life again, boosted regularly. She will live a lot longer in this healthy environment.",
            "title_similarity": "0.44139752",
            "sentiment_compound": 0.9352
        },
        {
            "id": "hox6df7",
            "score": 1,
            "text": "Another great \"Feel Good Story\" for the holidays!!  Thanks, world!!",
            "title_similarity": "0.21708694",
            "sentiment_compound": 0.9283
        },
        {
            "id": "hox6fol",
            "score": 1,
            "text": "A great description of Capitalism",
            "title_similarity": "0.33038676",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hox6gwc",
            "score": 1,
            "text": "Is this not understood in that many places?  \"For-profit\", means... FOR PROFIT.  There are so many people complaining about \"needs mah stuff made in 'Merica\"!  And what happens when they see the cost?  You bet your b-hole they're grabbing the Mainstays brand instead.\n\nPoint is, businesses are run by people with a bullsh** facade about being wholesome, when in fact the business is trying to save evey penny it can.  That penny pinching mostly comes in the form of staffing.  Whether it's barely qualified and unmotivated staff, or just a lack of disgruntled staff altogether, it is just enough personnel to be legal.\n\nNinja ETA: we can just slap some COVID-19 in a \"study\" and call it science now.  I honestly thought I was in the politics or business sub.",
            "title_similarity": "0.62505394",
            "sentiment_compound": 0.7955
        },
        {
            "id": "hox6h44",
            "score": 1,
            "text": "How many times do we have to do studies only to find out that greed is bad?",
            "title_similarity": "0.59617066",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hox6hro",
            "score": 1,
            "text": "This is why science and people... NOT profits...should be the metrics used to run society.",
            "title_similarity": "0.43831387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hox6jep",
            "score": 2,
            "text": "Equity firms are owning care homes\n\nWe are beyond help",
            "title_similarity": "0.51350486",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hox6n0x",
            "score": 1,
            "text": "Wait. Are you telling me that extracting the maximum profit from a supposed care center leads to poor care?\n\nI'm honestly stunned. Are there other contradictions under capitalism?",
            "title_similarity": "0.69807446",
            "sentiment_compound": 0.782
        },
        {
            "id": "hox6xug",
            "score": 1,
            "text": "Obviously! If a school, nursing home, hospital, library (the list goes on and on) Has to focus on profit their focus can never be on guests/patients. Take away a hospitals focus on profit so they can focus on the health of the patients instead.",
            "title_similarity": "0.5516627",
            "sentiment_compound": 0.7263
        },
        {
            "id": "hox6yli",
            "score": 1,
            "text": "JFC, healthcare should not be a for profit endeavor.",
            "title_similarity": "0.37915275",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hox72ij",
            "score": 1,
            "text": "My wife and I both agree, we won't be put into a nursing home. Not ever. Better dead at home than suffering in a nursing home. No thanks.",
            "title_similarity": "0.4772963",
            "sentiment_compound": -0.2429
        },
        {
            "id": "hox72w9",
            "score": 1,
            "text": "They should be banned and replaced with non-profit versions.",
            "title_similarity": "0.28619152",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hox7391",
            "score": 1,
            "text": "It's almost like capitalism is failing those who can't afford quality healthcare... \n\nThis post is not pointing out that \"nice\" facilities are bad it is pointing out that those making the most money are poorly run!",
            "title_similarity": "0.76865584",
            "sentiment_compound": -0.474
        },
        {
            "id": "hox79ke",
            "score": 1,
            "text": "You can literally only focus on one thing:\n\n1. The profit\n2. The people\n\nYou *have* to choose just one.",
            "title_similarity": "0.36457533",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hox7dzo",
            "score": 1,
            "text": "How many non-profit nursing homes are there in the US? I have never seen one.",
            "title_similarity": "0.42621198",
            "sentiment_compound": 0.0
        },
        {
            "id": "hox7e7r",
            "score": 1,
            "text": "Honestly you’re basically comparing two piles of sh*t and asking which one smells the best.  Non profit should be described as “pure profit” they just pay fewer taxes.  “For profit” is exactly that without hesitation.  Skilled nursing is staffed to legal minimums in all situations.  And that can be as high as over 20 patients per CNA, double that for nurses.  It is a soul sucking career and the people doing the work take 100% of the complaints, anger etc. that they have zero power to control.  Every company is ludicrously top heavy with corporate fools and lawyers.  Do everything in your power to keep your loved ones and yourself out of “the system”.  You have no idea the power a nursing home has.",
            "title_similarity": "0.73793316",
            "sentiment_compound": 0.6921
        },
        {
            "id": "hox7ggu",
            "score": 1,
            "text": "Which is weird because wouldn't keeping your residents alive mean higher profit?",
            "title_similarity": "0.47872478",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hox7ja6",
            "score": 1,
            "text": "Nothing new, this was an issue pre covid as well, just the lack of a literal plague meant people weren't paying attention. \n\nGenesis in particular is a cancer on society",
            "title_similarity": "0.56238997",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hox7kg6",
            "score": 1,
            "text": "There is no possible way this is true. Anybody who has been to a not for profit home would know that they are pretty much old people prisons",
            "title_similarity": "0.54963243",
            "sentiment_compound": 0.3387
        },
        {
            "id": "hox7xtc",
            "score": 1,
            "text": "I work in Healthcare and used to visit nursing homes/assisted living and still perform lab testing on many of these same patients. \n\nWithout saying names of facilities there's 2 in mind. Not for profit in the town I work and for profit one in the small town neighboring ours. \n\nThe for profit one has been reported to our state health officials numerous times, I have personally witnessed patients being brought in from this particular facility with patients literally covered in their own caked-on feces and dried piss, not once but multiple times on the same patient. Clearly he is not even being paid attention to at this facility. \n\nThe not for profit one? People love it, gets great reviews and pays their employees fairly well. It has its issues but they are mostly staffing issues partially due to Covid-19 but also cuz we are rural.",
            "title_similarity": "0.5646515",
            "sentiment_compound": 0.9508
        },
        {
            "id": "hox82o7",
            "score": 1,
            "text": "Healthcare with the highest profit margins has the lowest quality, surprising Noh-Fu, king one of the independent republic of Jesuschristisntthatobviousland",
            "title_similarity": "0.7874309",
            "sentiment_compound": 0.34
        },
        {
            "id": "hox8f85",
            "score": 1,
            "text": "I like how it says worse outcome, literally if I'm in a nursing home I'm assuming I'm close to the end...",
            "title_similarity": "0.5510415",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hox8hhu",
            "score": 1,
            "text": "Pump and dump. Fill the room asap, patient dies, fill the room asap. Rinse and repeat.",
            "title_similarity": "0.42008758",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hox8jqu",
            "score": 1,
            "text": "Well yeah, the only way you maximize profit is providing minimum product for maximum price",
            "title_similarity": "0.40289488",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hox8seb",
            "score": 1,
            "text": "Yeah who would’ve thought, capitalism is awful for its treatment of elderly. Hm.",
            "title_similarity": "0.6672288",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hox8tpx",
            "score": 1,
            "text": "In what way is this surprising?",
            "title_similarity": "0.041797753",
            "sentiment_compound": 0.3346
        },
        {
            "id": "hox8z2k",
            "score": 1,
            "text": "What's that you say,  corporations don't care about people? Nooooo.",
            "title_similarity": "0.41074383",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hox90zn",
            "score": 1,
            "text": "How are people still surprised that greed is the enemy of every society?",
            "title_similarity": "0.50618565",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hox9a58",
            "score": 1,
            "text": "\"wE cAnT tRuSt ThE gOvErNmEnT!!1\"\n\nBusinesses:",
            "title_similarity": "0.5270959",
            "sentiment_compound": -0.5083
        },
        {
            "id": "hox9ama",
            "score": 1,
            "text": "I understand that this is “news”, but is this really news?",
            "title_similarity": "0.2605408",
            "sentiment_compound": 0.0
        },
        {
            "id": "hox9asr",
            "score": 1,
            "text": "This is almost as shocking as the groundbreaking scientific analysis that suggests trees are made of wood.",
            "title_similarity": "0.45442683",
            "sentiment_compound": -0.3446
        },
        {
            "id": "hox9fbu",
            "score": 1,
            "text": "Maybe it should be illegal to have for profit nursing homes the same way it should be illegal to have for-profit prisons.",
            "title_similarity": "0.54205525",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hox9iph",
            "score": 1,
            "text": "If you want to change things, you need to make it cost money for the bad actors to keep doing what they're doing.",
            "title_similarity": "0.48025733",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hox9iuo",
            "score": 1,
            "text": "I would bet the same is true for places that care for developmentally disabled. Back in 1997 before college I worked at a group home that was run by a local not-for-profit and their whole goal was getting the residents out of the house and more integrated with the town. After I worked there for nine months or so they got bought by a corporate 'non-profit'. Big difference. The food budget tripled, yet the quality of the food went way down. Perhaps this was because if the house managers kept the budget under a certain amount they got big bonuses. There was still lip service paid to getting the residents out in public, but for some reason (liability?) none of them were ever allowed to leave without staff, and we never seemed to have enough staff on at any given time to actually have that happen. You had to take three residents out at once to make sure there were still two staff members at the house to cover the other 12 residents. And because of their rules, you couldn't take MORE than three residents out at once. So you had to take exactly three or no one got to go. So if one or even two people wanted to go somewhere you couldn't take them. I wasn't particularly smart back then, but even I could see what was going on. People started quitting. Turnover was insane. And I worked a lot of double shifts. Morale was pretty low, both for staff and residents. But you wouldn't know that if you heard any of the higher ups talk about what we were doing... Horseshit. Anything that has to do with addressing anyone's actual NEEDS should not be privatized. Period. Management will almost always choose profit over providing actual care.",
            "title_similarity": "0.6398359",
            "sentiment_compound": 0.7043
        },
        {
            "id": "hox9mtw",
            "score": 1,
            "text": "I understand the importance of a scientific approaches in the search for verifiable truths, but surely the whole not-for-profit vs for-profit is kind of a no-brainer.   \nIf I spend all the money on patient care I get more patient care than if I put some of the money in my pocket. Right.  \nIt is only the people putting your money in their pockets that blather on about \"efficiencies\" and other such nonsense.",
            "title_similarity": "0.652847",
            "sentiment_compound": 0.9466
        },
        {
            "id": "hox9yce",
            "score": 1,
            "text": "Uh.. aren't nursing homes expected to have a high mortality rate?",
            "title_similarity": "0.7378651",
            "sentiment_compound": 0.0
        },
        {
            "id": "hox9zk4",
            "score": 1,
            "text": "I’m so fortunate I was in a position to take care of my father in his final years. He deserved the best care and had to settle for really good care with me, but leagues above what nursing homes were offering. My heart goes out to anyone dealing with this.",
            "title_similarity": "0.54236424",
            "sentiment_compound": 0.9519
        },
        {
            "id": "hoxa0jm",
            "score": 1,
            "text": "What’s especially alarming about this is in my experience, for-profit long term care facilities are more selective about patients they accept, at least in regards to patients being discharged from the hospital. The health care system I work for (nonprofit) just sold our long term care facilities and they have much stricter criteria patients must meet to be discharged. It’s really thrown a wrench in our length of stay.",
            "title_similarity": "0.7195275",
            "sentiment_compound": 0.8862
        },
        {
            "id": "hoxa8sq",
            "score": 1,
            "text": "Health care should never of been privatized...",
            "title_similarity": "0.4117373",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hoxa8yi",
            "score": 1,
            "text": "Wow, just like sherriffs departments spread throughout the country, many of the county sherriffs get to keep whatever was leftover from their budget the year prior.",
            "title_similarity": "0.39687118",
            "sentiment_compound": 0.743
        },
        {
            "id": "hoxab0t",
            "score": 1,
            "text": "I’m lazy. I didn’t read anything but the title.  Just wanted to say don’t let “for profit” and “not for profit” dictate your opinion about a company until you know the inner workings of it.  They both have to make money and do what they need to do to make money even if it doesn’t check all the ethical boxes.  I’m only saying this because I work in Behavioral Health and so many places work with like to make it known that they for “non profit” even though their higher ups are assholes and get bonuses while the quality of care is dooky.",
            "title_similarity": "0.609105",
            "sentiment_compound": 0.899
        },
        {
            "id": "hoxafde",
            "score": 1,
            "text": "Was there anyone that doubted this?",
            "title_similarity": "0.10478641",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hoxak5g",
            "score": 1,
            "text": "Any way to find out which nursing homes have the lowest profit margins?",
            "title_similarity": "0.7348188",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hoxas3a",
            "score": 1,
            "text": "Ate you telling me that when health is involved, operating in a capitalistic “business manner” with profit as a goal is not the best way?",
            "title_similarity": "0.6144011",
            "sentiment_compound": -0.12
        },
        {
            "id": "hoxavet",
            "score": 1,
            "text": "Of both customer chum and employee chum.",
            "title_similarity": "0.17672163",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoxbaq7",
            "score": 1,
            "text": "I talked to guy once who worked at a place like this is and on average a person in a nursing home does within 2 years of moving in. I don’t k low if it’s because of poor care or whether people wait as long as they can before moving into a facility and thus they are close to death, but 2 years isn’t long.",
            "title_similarity": "0.5284425",
            "sentiment_compound": -0.296
        },
        {
            "id": "hoxbgqk",
            "score": 1,
            "text": "Going to get buried, but I was contracted out to nursing homes for about 5 years. \nIn one of the first months that I worked, one of the social workers, who was also a contractor like me, asked me what my plan was for not ending up in a nursing home.  Later I worked at one that basically felt like Jordan Peele's 'Get Out,' which may be quite responsible for me becoming more involved in social justice related concerns. In another facility, they requested that I schedule medications for alternate hours on different wings, because they were not able to finish med pass in time for patients given how many patients each nurse had.\nFinally, I agree that the best nursing home I ever worked in? looked terrible, but was unionized and run by, I believe, the town itself. The staff retention there was actually quite amazing.  The roof was not.",
            "title_similarity": "0.5742372",
            "sentiment_compound": 0.9799
        },
        {
            "id": "hoxbj9q",
            "score": 1,
            "text": "Who says that the private sector does everything better?",
            "title_similarity": "0.49706227",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hoxbolf",
            "score": 1,
            "text": "All run by conservatives",
            "title_similarity": "0.42781144",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoxbs57",
            "score": 1,
            "text": "Work at nursing home. 1000% agree with these findings",
            "title_similarity": "0.41411006",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hoxbyso",
            "score": 1,
            "text": "Wow, it's almost like the profit motive is incompatible with ethical health care.",
            "title_similarity": "0.5824525",
            "sentiment_compound": 0.9342
        },
        {
            "id": "hoxc177",
            "score": 1,
            "text": "Surely this isn't surprising?",
            "title_similarity": "-0.030282779",
            "sentiment_compound": 0.27
        },
        {
            "id": "hoxcapq",
            "score": 1,
            "text": "For a business to make more profits it must create losses elsewhere. This could be from shareholders or company owner (lead shareholder), but often just goes to the consumer. After all, a business is in existent to make the shareholders more money. Who are the consumers for elder care? Elderly.",
            "title_similarity": "0.6658646",
            "sentiment_compound": 0.7267
        },
        {
            "id": "hoxcu4f",
            "score": 1,
            "text": "I prefer working as a home health therapist for this reason, those facilities across the board are tough living and working conditions.",
            "title_similarity": "0.5123883",
            "sentiment_compound": -0.128
        },
        {
            "id": "hoxcz28",
            "score": 1,
            "text": "I'm wondering if they are taking into account all of the DNR( do not resuscitate) orders for the residents.\n\nI worked at a senior retirement home for about 4 years and I would say about 40% of them had one. All of the staff deeply cared for the residents and it always hurt when we lost one.\n\nIt was the brookdale company.  I don't know about other locations but the one I worked at was well staffed.  I started in the kitchen and ended up in maintenance for the last year.  We made a lot of stuff from scratch and with little to no salt.  Which is actually hard to do and still make it have great flavor.\n\nAs for maintenance we made sure the rooms and facility were keep up to the best of our ability.   We would go so far to change out the lights bulbs in their lamps and the bulbs were free.\n\nI believed so much in the place that I worked I tried to convince my aunts to move my grandmother there.  We would have also gotten a discount because I worked there.",
            "title_similarity": "0.5937086",
            "sentiment_compound": 0.9755
        },
        {
            "id": "hoxd33e",
            "score": 1,
            "text": "It’s almost as if, bear with me, profit motive becomes the sole focus to the detriment of people. I wonder if anyone has written about this before?",
            "title_similarity": "0.48114544",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hoxd4cg",
            "score": 1,
            "text": "Of course they did. Capitalism doesn't care about human beings, just profit.",
            "title_similarity": "0.37461728",
            "sentiment_compound": 0.0701
        },
        {
            "id": "hoxdgz1",
            "score": 1,
            "text": "Those are usually the factory SNFs for Rehabilitation department. I'm a Physical Therapist Assistant. I worked at a private SNF and a big SNF that's extremely unsavory with high productivity rates, and it's a factory at the bigger ones. Unnecessary groups and concurrent a for the sake of higher reimbursement. Getting minutes  out of patients who can't really refuse and there's only so much you can do for them. However the smaller privately owned one, I feel like it's the job school trained me for. It's all patient centered care. I can actually talk and listen to my patients and build a rapport while giving them the best care I can give them.",
            "title_similarity": "0.66571856",
            "sentiment_compound": 0.9248
        },
        {
            "id": "hoxdjyo",
            "score": 1,
            "text": "Business kills quality.",
            "title_similarity": "0.41800702",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hoxdog4",
            "score": 1,
            "text": "Capitalism is the death panel. Remove it from medical care entirely.",
            "title_similarity": "0.5069792",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hoxdoni",
            "score": 1,
            "text": "Worked in nursing homes, I coulda told you that.",
            "title_similarity": "0.33339024",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoxe4wa",
            "score": 1,
            "text": "Leave em here, we’ll watch em",
            "title_similarity": "-0.046505403",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hoxeems",
            "score": 2,
            "text": "Healthcare and profit are fundamentally incompatible.",
            "title_similarity": "0.4926278",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hoxey4h",
            "score": 1,
            "text": "Idk. In general this is completely facility dependent and the charity ones make homeless camps look good.  Some of them are completely inhumane that I've been too.",
            "title_similarity": "0.60964507",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hoxf2a3",
            "score": 1,
            "text": "They just keep them sedated with pills and forget about them",
            "title_similarity": "0.28134456",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hoxfid9",
            "score": 1,
            "text": "Probably like a run like a for profit prison",
            "title_similarity": "0.44228566",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hoxft79",
            "score": 1,
            "text": "Now people understand why doctors were so angry with the ACA - it’s illegal for doctors to own hospitals (despite better outcomes). Lawyers can own law firms, business grads can own businesses, but healthcare operations are owned by non physicians only?",
            "title_similarity": "0.6025601",
            "sentiment_compound": -0.6832
        },
        {
            "id": "hoxg4nz",
            "score": 1,
            "text": "Wow just found this out?!  You can find same results private hospitals vs government funded hospitals.",
            "title_similarity": "0.4996282",
            "sentiment_compound": 0.6239
        },
        {
            "id": "hoxg8x0",
            "score": 1,
            "text": "You need to be careful with the “not for profit” tag. The most profitable healthcare organizations are in fact “non-profits”. This is due to tax cuts.",
            "title_similarity": "0.715835",
            "sentiment_compound": 0.3804
        },
        {
            "id": "hoxgltd",
            "score": 1,
            "text": "My grandfather killed himself to avoid going to a nursing home.",
            "title_similarity": "0.45626837",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hoxgmwl",
            "score": 1,
            "text": "As soon as you run out of money and become \"destitute\" and the state pays for your care, you have a very short time to live there.  I've seen it several times, they just stop trying to rehabilitate you, they just want to let you slump into no hope to recover and do nothing to slow down the eventual end.",
            "title_similarity": "0.54948646",
            "sentiment_compound": -0.0274
        },
        {
            "id": "hoxgvac",
            "score": 1,
            "text": "OK, now what is gong to be done about it? FOR PROFFIT  Health care , Prison systems, old folks homes etc. with no one policing them??? dumbest idea ever",
            "title_similarity": "0.52698445",
            "sentiment_compound": -0.7622
        },
        {
            "id": "hoxgvbp",
            "score": 1,
            "text": "Economic “efficiency” = death.",
            "title_similarity": "0.47871777",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hoxh0mi",
            "score": 1,
            "text": "I wonder if there’s an ideology that answers why that is?",
            "title_similarity": "0.09370971",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoxhebm",
            "score": 1,
            "text": "People for profit. Americans dirtiest secret. You should visit a medicaid facility. It should be illegal to keep people parked, barely alive just waiting for death. The only reason is so a few people can make a whole lot of money. Shameful.",
            "title_similarity": "0.63938475",
            "sentiment_compound": -0.8718
        },
        {
            "id": "hoxhqbz",
            "score": 1,
            "text": "I worked at an ALF as a server/dishwasher for two years so I didn't administer direct care but...yeah it's bad, especially when the new company took over. You'd have three servers (occasionally four for dinner) to serve almost 100 elderly people over the span of two hours. And if there was a problem, there were only at max three nurses who were in the building to help (only one per floor at my old workplace) and it got worse when the new company took over and cut that down to two. I recall once for Family Night (one night a month where the residents could invite their families over, which usually meant there were upwards of 200 people in the dining room, clearly pre-COVID times), a guest started choking and I attempted the Heimlich Maneuver because while we had more servers that night to help cater to everyone's needs, we still only had like three nurses on staff to help, and they were still trying to bring residents down as everyone had different meal times and all that.\nI worked there for a few months after the pandemic hit, but at that point the dining department had been hit with cuts and we now had TWO servers delivering meals to nearly 100 residents as we tried to keep them quarantined, and usually it was either myself or the one guy who had been there a decade working from 5am-6pm, covering from breakfast to dinner, several days a week, sometimes consecutively.\nTldr, it isn't always the ALFs themselves that are bad, but the ones running it, and everyone suffers as a result.",
            "title_similarity": "0.5983696",
            "sentiment_compound": -0.9295
        },
        {
            "id": "hoxhrcj",
            "score": 1,
            "text": " [good read](https://www.healthaffairs.org/doi/10.1377/hblog20201110.707118)",
            "title_similarity": "0.3551137",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hoxi2k9",
            "score": 1,
            "text": "I've worked at my nursing home for 14 years. When I started it was not-for-profit. Care was good but it was admittedly an ugly place. Then it got bought and sold a bunch of times. It looks pretty now, and we have 1/3 the staff we used to. Never had bed sores before, now they're common. All aspects of care aside from Rehab are just terrible now (Rehab gets better reimbursement.) Limited supplies, lots of rigging and improvising...\n\nThe whole system is sickening.",
            "title_similarity": "0.68768936",
            "sentiment_compound": -0.0129
        },
        {
            "id": "hoxig91",
            "score": 1,
            "text": "Wait, do not-for-profit nursing homes have less than a 100% mortality rate?",
            "title_similarity": "0.70333385",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoxijk7",
            "score": 1,
            "text": "Wait…you guys just figured this out?",
            "title_similarity": "0.026384026",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoxin03",
            "score": 1,
            "text": "I’ve worked in for profit and not for profit hospital systems as well and anecdotally the same holds true from my experience and observation. Just more overhead and focus on the bottom line (money) versus bottom line (patient safety and positive outcomes).",
            "title_similarity": "0.60459393",
            "sentiment_compound": 0.8955
        },
        {
            "id": "hoxisds",
            "score": 1,
            "text": "This is a story that is well-known, reiterated time and again across all kinds of sectors and has been ongoing for the past half century. It’s a fact rarely, if ever, stated, namely that the profit-motive has failed to deliver across most if not all metrics of relevance.\n\nThere is no scientific evidence to prove that the past decades of market liberalization, with privatization, deregulation, corporatization and (supposedly) increased competition, aswell as the introduction of profit-motives, has led to more efficient, more qualitative, inexpensive public services and utilities. \n\nIn fact, the opposite can often be seen time and time again; studies consistently show that public and non-profit operators are superior to for-profit actors across most if not all metrics, from Sweden to the U.S. , there [was even a study](https://www.sns.se/artiklar/konkurrensens-konsekvenser-vad-hander-med-svensk-valfard/) in 2011 published by the Swedish national business association representing, amongst others, for-profit corporations that proved this point; the authors were all subsequently fired or forced to resign and the corporate media suppressed it.\n\nOne example is higher education, where public and non-profit universities and institutions consistently outperform for-profit actors.\r  \nThis is because of two reasons; one is the natural tendency for concentration of wealth and market power in capitalism, which then creates a self-perpetuating oligopoly that exerts political power to retain the status quo. Second, these sectors of the economy, such as railroads, are more often than not natural monopolies with inelastic demand, even more so than other sectors, where access to seed money, insider information when bidding on public contracts and leases, networking and favourable legislation is highly skewed in favour of multi-nationals; through a dozen different methods the concentration of market power is retained; from [revolving doors](https://en.wikipedia.org/wiki/Revolving_door) and [regulatory capture](https://en.wikipedia.org/wiki/Regulatory_capture) to [interlocking directorates](https://en.wikipedia.org/wiki/Interlocking_directorate) and corruption of the procurement process with onerous demands meant to raise the barrier of entry to potential competitors.\r\n\r\nPublic-Private Partnerships (PPP) lead to [moral hazards](https://en.wikipedia.org/wiki/Moral_hazard), as public services cannot be allowed to reach the bottom of the barrel.\n\rExamples: \n1. The London Underground went [bankrupt](https://www.centreforpublicimpact.org/case-study/london-undergrounds-failed-ppp) in 2005 as a result of the moral hazard, speculation and mismanagement resulting from a Public-Private Partnership.\n\r2. The [railways](https://en.m.wikipedia.org/wiki/New_Zealand_Railways_Corporation) in New Zealand went bankrupt as a result of the same issues and was renationalized at a much higher bill than if adequate resources had been allocated from the beginning.\r\n\n3. The same issues can be seen with Amtrak and the Postal Service in the U.S., where they have been deliberately underfunded while being transformed into business entities in public hands, with onerous demands put on them, such as the pension scheme during the [Bush years](https://ips-dc.org/how-congress-manufactured-a-postal-crisis-and-how-to-fix-it/) on the Postal Service.\r\n\n4. Sweden’s regulator [shut down](https://www.mynewsdesk.com/se/swedac/pressreleases/swedac-aaterkallar-dekra-automotive-ab-s-ackreditering-3148070) and recalled the certificate of a private car inspection company due to systemic and deep flaws that have not been adressed since 2019 when they were first warned. Car inspections were a public monopoly up until 2010, after which they were privatized by selling off many of the profitable stations in urban areas, that were used to subsidize rural stations, while leaving the unprofitable ones in the public sphere.\nThe same history is applicable to pharmaceutical retailers, operating under a public monopoly until 2009, after which the same process was initiated, where 614 of the 945 pharmacies were sold off. [98%](https://www.tillvaxtanalys.se/publikationer/rapport/rapportserien/2012-11-12-geografisk-tillganglighet-till-lakemedel----en-analys-av-omregleringen-av-apoteksmarknaden---slutrapport.html) of new private pharmacies since then have opened in over-saturated urban areas, and 0 in rural areas.\n\nAnother less-stated fact is that we do not factor in the massive bureaucracies that need to be established, in order to control and inspect the profit-driven services and ensure that they abide by rules, regulations and laws. That is also a public cost which is inefficient, as it is unnecessary.\r  \nWhat we need is to bring societal services, such as railroads, banking, electricity, healthcare, education, elder care and retirement, child care, mass transportation, postal service, pharmacies, telecommunications and so on, under public control, through a combination of;\r  \n1. Strong and strict regulation, such as qualitative and staffing requirements and demands.\r  \n2. Direct ownership through the public sector, although we need a massive reformation meant to de-corporatize public services, to ensure all surpluses are exclusively re-invested into improving the utility rather than being siphoned off to the treasury, and democratize them, through having workers and employees being given greater power and autonomy and as much a say in managing, controlling and providing the service as politicians and officials. For examples of this, look to Norway that has successfully established methods for implementing this.\r  \n3. Economic democratization, through banning profit-motives and other such measures corporations will be driven out in favour of non-profit organizations such as cooperatives, credit unions and worker-run assocations, who can act as satellites to the public sector in providing services to the population, while simultaneously providing potential innovative and unique methods of delivery. Norway has a system that has replaced neoliberal [New Public Management](https://en.m.wikipedia.org/wiki/New_Public_Management) with democratized forms of management as part of the ”Trondheim Model”/”Modellkommunmetodiken”.\n\nI’d like to point out, as well, that the founder of market fundamentalism and neoliberalism in the Chicago School of Economics, Milton Friedman’s teacher Henry Calvert Simons, [noted](https://en.m.wikipedia.org/wiki/Henry_Calvert_Simons) that if you cannot regulate or trustbust oligopolies, then the only viable option in order to uphold free markets and free enterprise was nationalization and public ownership of the major actors in the market sector in question.",
            "title_similarity": "0.5859618",
            "sentiment_compound": 0.9913
        },
        {
            "id": "hoxj26r",
            "score": 1,
            "text": "Mortality rates are a terrible measure of nursing home success. Death is a blessing to these folks. What we should be concerned about is the quality of life. For those residents who cannot *live*, especially mentally, we should not be standing in the way of death but reducing suffering until it arrives.",
            "title_similarity": "0.6893053",
            "sentiment_compound": -0.7684
        },
        {
            "id": "hoxjj9t",
            "score": 1,
            "text": "I dated a CNA, who worked in a nursing home for awhile, and she told me they were always understaffed and she had to carry an obese patient and injured her back because of that. She also had to deal with insane patients.",
            "title_similarity": "0.6234406",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hoxkdd8",
            "score": 1,
            "text": "The one a family friend is in doesn’t even have an Xmas tree",
            "title_similarity": "0.30511558",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hoxklez",
            "score": 1,
            "text": "Capitalist at their finest! Where are the laws and oversight? Non existent cause both the left and the right are owned by said Capitalist..",
            "title_similarity": "0.46622157",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoxkzt6",
            "score": 1,
            "text": "Where I work, management admits anyone no matter how bad a fit they are.  They want to use up their medicare then offload them somewhere else once they extract all the money they can get from patients.",
            "title_similarity": "0.47821587",
            "sentiment_compound": 0.1093
        },
        {
            "id": "hoxl20h",
            "score": 1,
            "text": "Why is anyone surprised by this?",
            "title_similarity": "0.07387191",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hoxl5i3",
            "score": 1,
            "text": "McDonald's is still doing pretty well also.",
            "title_similarity": "0.15167414",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hoxlnb6",
            "score": 1,
            "text": "Same is true for literally everything.",
            "title_similarity": "-0.011303073",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hoxly3h",
            "score": 1,
            "text": "I think this applies to most businesses. \n\nAny business that is driven exclusively by maximum profit inevitably sacrifices quality, and humanity. \n\nIt’s a lie that the only way to have a successful business is to maximize profit at all costs.",
            "title_similarity": "0.5648079",
            "sentiment_compound": 0.8625
        },
        {
            "id": "hoxmhwq",
            "score": 1,
            "text": "Wait until you look into how many of these at risk patients are being diagnosed as paranoid schizophrenics, in their late 70’s/80’s, to medically justify heavily sedating them, to significantly reduced mandated nursing staff ratios.",
            "title_similarity": "0.6750398",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hoxmi4v",
            "score": 1,
            "text": "My abusive mother works in a private care facility. Her ways thrive there. She loves her job and has been suspended multiple times. She now works in the special needs wing of her center and LOVES it there... She would always say \"it's great when they can't snap back :)\" so scary ... The few others I know who have worked there and we're genuinely good people left for other, non profit places. They couldn't stand what they had to put up with.",
            "title_similarity": "0.5592618",
            "sentiment_compound": 0.9103
        },
        {
            "id": "hoxmw73",
            "score": 1,
            "text": "Government run is the best, isn't it?",
            "title_similarity": "0.42059186",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hoxnou7",
            "score": 1,
            "text": "I’m shocked. Shocked, I tell you.",
            "title_similarity": "0.16084278",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hoxnpsk",
            "score": 1,
            "text": "Not a single person was surprised",
            "title_similarity": "0.062332407",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hoxo05d",
            "score": 1,
            "text": "\"highest mortality rates\" raised too many questions to give that statement meaning. Is that highest average age at death, highest deaths per year? Doesn't elderly care expect 100% mortality? Does the payer make a difference?",
            "title_similarity": "0.71167123",
            "sentiment_compound": -0.7946
        },
        {
            "id": "hoxocjs",
            "score": 1,
            "text": "Time to shut them down than and get those who know how to build and run the non for profit ones to build more.",
            "title_similarity": "0.42834252",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hoxokfg",
            "score": 1,
            "text": "This is no joke. All of your grandparents are at risk. Elderly care is another place the USA is completely fucked on. Old people sitting in these places rotting away while laying in piss and feces. \n\nSource: EMT",
            "title_similarity": "0.5897354",
            "sentiment_compound": -0.8009
        },
        {
            "id": "hoxol91",
            "score": 1,
            "text": "Profits overs human lives.",
            "title_similarity": "0.41575813",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hoxomf8",
            "score": 1,
            "text": "There shouldn't be a profit margin in that kind of business.  That should be illegal shouldn't it?",
            "title_similarity": "0.4211142",
            "sentiment_compound": -0.7189
        },
        {
            "id": "hoxoqhb",
            "score": 1,
            "text": "This surprises absolutely no one.  \n\nI live when I hear people say “government should be run like a business”.  So, taxes as high as they can go combined with a bare minimum of services and the balance going into the pockets of an elite few?  For profit critical services don’t exist.  If it’s a critical service it should be non-profit.",
            "title_similarity": "0.58881396",
            "sentiment_compound": 0.0534
        },
        {
            "id": "hoxosbf",
            "score": 1,
            "text": "Healthcare for-profit and the COVID19 pandemic has shown how feeble the US healthcare system really is.",
            "title_similarity": "0.7429467",
            "sentiment_compound": -0.296
        },
        {
            "id": "hoxowbq",
            "score": 1,
            "text": "When you pay your employees like crap and offer the minimum to residents despite charging 4k a month. It isn't a real big surprise.",
            "title_similarity": "0.572556",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hoxoyhw",
            "score": 1,
            "text": "Almost like capitalism doesn't care about the individual and only the acquisition of wealth...",
            "title_similarity": "0.41111344",
            "sentiment_compound": 0.4174
        },
        {
            "id": "hoxpq0i",
            "score": 1,
            "text": "Good old private equity sticking it to everything they touch...",
            "title_similarity": "0.35317975",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hoxq5tn",
            "score": 1,
            "text": "Privatize the profits socialize the losses.\n\nThe government is just funneling profits to ppl who run these nursing homes when instead they should just own and operate nursing homes.\n\nThis is just more evidence that america is just one giant scam grifting money from the middleclass and funneling it to the 1%.",
            "title_similarity": "0.67670083",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hoxqfws",
            "score": 1,
            "text": "The movie I Care A Lot is fairly accurate",
            "title_similarity": "0.21456487",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hoxqh9s",
            "score": 1,
            "text": "Putting profits so far ahead of the law in favor of human lives is a deep corruption of this country's ideals. It sustains nothing.",
            "title_similarity": "0.56952095",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hoxqnow",
            "score": 1,
            "text": "Mad to think they're hoping you die quicker.",
            "title_similarity": "0.4217833",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hoxqqsa",
            "score": 1,
            "text": "It’s almost like capitalism kills people.",
            "title_similarity": "0.5424887",
            "sentiment_compound": -0.2568
        },
        {
            "id": "hoxqta3",
            "score": 1,
            "text": "I can completely believe this based on my experience of public sector industries going private and the being taking back under government control.",
            "title_similarity": "0.39149112",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoxqu3u",
            "score": 1,
            "text": "My family seriously believes that nursing homes offer 1-on-1 care.  I've offered to care for a sick family member as I am not working and have the time.  They've literally said to me, \"how can you provide the care a nursing home does?\"\n\nUgh.  I've worked in nursing homes.  The employees usually (sometimes) care, but administration and owners are usually real estate firms who only care about profit and will make you count even the diapers and restrict them.",
            "title_similarity": "0.6619127",
            "sentiment_compound": 0.8294
        },
        {
            "id": "hoxr1y1",
            "score": 1,
            "text": "I’m honestly not trying to be an asshole but worse outcomes? I thought there’s only one way out of a nursing home…",
            "title_similarity": "0.45490518",
            "sentiment_compound": -0.4854
        },
        {
            "id": "hoxr7gj",
            "score": 2,
            "text": "My law firm specializes in suing these places, disgusting what goes on in some of them.",
            "title_similarity": "0.4938916",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hoxrqmj",
            "score": 1,
            "text": "I worked as a nurse in one of these places. Understaffed like crazy. Couldn’t give quality care and couldn’t compromise with my principles. quit after 3 mnths.",
            "title_similarity": "0.5736985",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hoxrvw2",
            "score": 1,
            "text": "Is this... not completely obvious?",
            "title_similarity": "0.046770193",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoxs5nf",
            "score": 1,
            "text": "late stage capitalism is a hell of a drug.\n\n&#x200B;\n\nwait til it's the boomers going into elder care by the millions and younger people unable to provide any care what so ever.",
            "title_similarity": "0.7061538",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hoxsba2",
            "score": 1,
            "text": "It’s almost like… it’s hard to serve two masters…",
            "title_similarity": "0.38150036",
            "sentiment_compound": -0.0352
        },
        {
            "id": "hoxsh4h",
            "score": 1,
            "text": ">Nursing home with highest profit margins have the lowest quality\n\nHow many more examples of this do we need before we admit that our current economy actively rewards the poorest behaviors and the worst business ethics.\n\nThe highly profitable, problem free work place is such a rarity that it is starting to appear to be by design rather than the fluke it is presented as in the media.",
            "title_similarity": "0.828085",
            "sentiment_compound": 0.3976
        },
        {
            "id": "hoxt8tq",
            "score": 1,
            "text": "Capitalism has been so successful that the only way to increase profits is to underpay staff or reduce quality of service. This is late stage capitalism. You can’t expect increased growth year after year and continue to provide a quality product or service. You get one or the other.",
            "title_similarity": "0.6686833",
            "sentiment_compound": 0.9296
        },
        {
            "id": "hoxtekw",
            "score": 1,
            "text": "So the profit incentive didn’t magically produce the best results? Curious.",
            "title_similarity": "0.49144444",
            "sentiment_compound": 0.9089
        },
        {
            "id": "hoxtqqr",
            "score": 1,
            "text": "Crazy how the motivation for profit in medical care leads to worse care.",
            "title_similarity": "0.6369332",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hoxtt45",
            "score": 1,
            "text": "Private Non-Medical Institution. Look it up, then understand there is big business in tucking people away from society. They pretend it's about rehabilitation, but if I remember correctly there is a 1%  success rate to transition to a lower level of care. It is in the interest of the companies running the agencies to keep people in the bed as long as possible. 20 year olds in the prime of their lives, suffering from debilitating mental health are tricked into living in these homes, with the promise of moving to independent living. Doesn't happen, period. I have been in the field for 18 years, and any clients moving on end up back in the system or hospital just to do it over again. The staff overseeing the residents are ridiculosly underpaid and undertrained, often having their own mental illnesses but qualifying to work by having a pulse. It's a sad state of affairs, and the reason I'm getting out of the field.",
            "title_similarity": "0.6931107",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hoxu2kr",
            "score": 1,
            "text": "Private run healthcare tends to employ contractors because its more cost efficient than paying a full wage to permanent staff.\n\nYou can imagine the difference in care between permanent and contract workers. It would be like instead of familiarising yourself with a local doctor, each time a different guy is brought in from somewhere else.",
            "title_similarity": "0.6751421",
            "sentiment_compound": 0.8307
        },
        {
            "id": "hoxuc0i",
            "score": 1,
            "text": "Who could have guessed for profit healthcare would be worse than non profit healthcare? No one could have predicted this extremely obvious fact.",
            "title_similarity": "0.55797654",
            "sentiment_compound": 0.128
        },
        {
            "id": "hoxv8zq",
            "score": 1,
            "text": "To all those with family in a nursing home, “The squeaky wheel gets the oil.” I spent the first 3 years of my nursing career in two separate nursing homes and the results were similar. Patients are treated like real estate. You keep you beds full to make money. Staffing is unacceptable and ratios are ridiculous, often as high as 15-30 patients to one nurse. Complaints about ratios fall on def ears. Two of the nursing homes largest expenses are medicine and staffing. They skimp on medicine by making everything generic and they keep ratios excessively high to turn a larger profit. Nurse have asked for years for state mandated ratios but again, those complaints fall on deaf ears. The best thing you can do for family is be in there regularly checking on them and making sure what needs to be done is getting done. When looking for a facility for a loved one, don’t just talk to the representative that’s trying to sell you on the place, talk to a staff member that has worked there a couple years and be aware that you can look up the facilities deficiencies and reports made against them formally to the state online.",
            "title_similarity": "0.72469324",
            "sentiment_compound": 0.8922
        },
        {
            "id": "hoxvg4e",
            "score": 1,
            "text": "As a former long-term care ombudsman I could have told you this 5 years ago. For profit long-term care is the worst. All they care about is the money and not the patient care. Not only are non-profit better, so are privately owned homes.",
            "title_similarity": "0.77288365",
            "sentiment_compound": 0.8258
        },
        {
            "id": "hoxw0a7",
            "score": 1,
            "text": "Gee who would’ve thought that nursing homes that operate for profit, care more about money than the people they actually care for.",
            "title_similarity": "0.7571202",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hoxw4i1",
            "score": 1,
            "text": "As someone who works APS in Oregon, the really nice for profit chains are the worst. They're usually the one I have to go out and investigate multiple times. Oregon also have various facility's not just SNF. APS in oregon doesn't investigate those, that's a different entity. I investigate ALF, RCF and Memory care, and adult foster homes as well as community cases. Typically we have the most issues with memory care either due to poor training , and lately understaffed.",
            "title_similarity": "0.6596005",
            "sentiment_compound": 0.762
        },
        {
            "id": "hoxwgv6",
            "score": 1,
            "text": "I used to have an interest in real estate investing as a wealth strategy. I once attended a workshop on how to turn large homes into assisted living for the elderly. I was interested in being able to help the elderly community, and at first they sold it well. It's a great option for those who just need a little help, they can have nurses come in, they get to live in a house still, and they get the sense of community with other elderly people.\n\nThen they started talking about the profits. Because this form of group home is considered a \"luxury\", they charge $5-10k, per month, for the services! They could easily be cranking out a profit of $20,000 just from one home, per MONTH, and these leeches own multiple. They skim so much off the top, it's horrific. And people pay it because they need the help. These people are truly sociopathic.",
            "title_similarity": "0.64776194",
            "sentiment_compound": 0.9805
        },
        {
            "id": "hoxwi3k",
            "score": 1,
            "text": "I...I dont...this is news?",
            "title_similarity": "0.12890428",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoxx2by",
            "score": 1,
            "text": "I was in a nursing home after a stroke, from April to June of 2020. In a COVID ward. It was absolute hell. people dying left and right, staff not wearing PPE, no one allowed to visit me (that part I understood but it still sucked) The nursing home was disgusting and left me in my own waste for hours at a time. They also claimed I had BPD, from a psych np who talked to me for 5 minutes, when I still was not mentally okay from the stroke. Now I can't get that off my record.",
            "title_similarity": "0.6105539",
            "sentiment_compound": -0.8946
        },
        {
            "id": "hoxx3eo",
            "score": 1,
            "text": "I've read the article but not the publication associated with it as I only have access to the abstract, but my first thought is that it's difficult to establish that these outcomes are a result of the care facility without knowing the circumstances of the individuals being cared for (there are a lot of uncontrolled variables).\n\nFor example, is it possible that families choosing care facilities for family members they know probably won't live much longer decide to put them in more expensive facilities so they have a \"nicer\" (e.g. prettier scenery, whatever else) experience?\n\nTo me, this is a study indicating that there's some phenomenon going on that requires further study, and the hypothesis that it's the result of the type of care facility seems inline with much of the anecdotal evidence others have shared here, but this is a subreddit for science, and this is only one study.\n\nIts safe say that there's a thing happening here, and the theory is that its because of the type of care received due to the pressures of capitalism, but don't treat that as fact. There's no way to prove a scientific theory, only ways to disprove it, and no one has attempted to disprove this one from what I can tell.",
            "title_similarity": "0.5831704",
            "sentiment_compound": 0.9708
        },
        {
            "id": "hoxx5ro",
            "score": 2,
            "text": "That's entirely logical; the profits come from the reduction in quality.    \nIt's just another example of Americanised capitalism in action.",
            "title_similarity": "0.5398249",
            "sentiment_compound": 0.4877
        },
        {
            "id": "hoxxeyh",
            "score": 1,
            "text": "What's the mortality rate in your area? Here it's almost 1:1 things are looking bad.",
            "title_similarity": "0.6268791",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hoxxoje",
            "score": 1,
            "text": "Another study pointing out how making money off humans is bad. Yet, they will continue because MONEY!",
            "title_similarity": "0.5460625",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hoxxpnh",
            "score": 1,
            "text": "Gee I wonder why.\n\n\nIs this surprising to anyone? Profit over people",
            "title_similarity": "0.3639221",
            "sentiment_compound": 0.6457
        },
        {
            "id": "hoxxz68",
            "score": 1,
            "text": "True for hospitals as well.",
            "title_similarity": "0.17668799",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hoxy335",
            "score": 4,
            "text": "As a childless person without family that appears to care… this is a little frightening.",
            "title_similarity": "0.39297172",
            "sentiment_compound": -0.4417
        },
        {
            "id": "hoxyfpf",
            "score": 1,
            "text": ">large chains have the highest mortality rates.\n\nSorry, that bit made me laugh. It is called end of life care for a reason.\n\nIt is actually worse than you have laid out: 1a) the cost to stay there. 1b) though you might pay £1000+ a month to be there the staff are mostly on around minimum wage. 2) if you require incontinence pads (adult diapers/nappies) you only get 3 a day. 3) a lot of establishments have dementia patients when the homes are not set up for them nor the staff trained (technically illegal).",
            "title_similarity": "0.8104152",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hoxyjds",
            "score": 1,
            "text": "High prices doesnt mean higher quality \nIt can also mean the illusion of quality and.many buy into the BS",
            "title_similarity": "0.5692591",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoxyroi",
            "score": 1,
            "text": "at last a study that speaks the truth.",
            "title_similarity": "0.20011583",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hoxz0qi",
            "score": 3,
            "text": "I used to work as a CNA at a for-profit SNF. We were expected to do an impossible amount of work and care every shift, and that's even when we were lucky enough to be 'fully staffed.' Nursing homes don't exactly attract the best workers so there were many days where we worked short-staffed because someone called off or just didn't bother to show up, on top of the many other days where there just weren't enough people to work.\n\nThere are some incredible people working at SNFs that truly care about their residents, but many more people are there just to get a paycheck and do the least amount of work possible, even if they are compromising patient care. That's not to say the problem is bad workers; the SNFs are in a position to improve patient care but they choose money over values and do absolutely nothing that they aren't mandated to do.\n\nDo not send anyone you love to a SNF, especially a for-profit one.",
            "title_similarity": "0.6373312",
            "sentiment_compound": 0.9736
        },
        {
            "id": "hoxzojd",
            "score": 1,
            "text": "It’s almost as if, and stay with me here, basing an entire society around the tireless acquisition of wealth isn’t all its cracked up to be",
            "title_similarity": "0.46421814",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hoxzqcp",
            "score": 3,
            "text": "Careful.  You might get people using the scare word \"socialism.\"\n\nThis sounds like evidence that organizations that do it for profit don't do it for the patients/residents?  It's right there in that sentence.",
            "title_similarity": "0.5611145",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hoxzxa9",
            "score": 1,
            "text": "Who could have guessed?",
            "title_similarity": "0.0892375",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoy037p",
            "score": 5,
            "text": "I founded a startup working with LTC and AC facilities in integrating more tech into operations.\n\nOne of the first things that I quickly noticed is the quality of care patients receive in for profit facilities. I almost teared up at one point because of the way patients are treated. You can cut the tension with a knife in some of these places.\n\nI ended up shutting down after a few years because these for profit facilities are extremely reluctant providing adequate budgets for patient \"activities\". Also most patients in these facilities are on fixed-incomes, so long-term, it would have been extremely difficult to scale.",
            "title_similarity": "0.7188108",
            "sentiment_compound": 0.3975
        },
        {
            "id": "hoy0958",
            "score": 1,
            "text": "The part I don't understand is that I think letting paying customers die would be bad for business/profit? Coincidentally it seems that Rs don't realize this same thing about Republican voters.",
            "title_similarity": "0.63366395",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hoy0g7o",
            "score": 13,
            "text": "No offense to anyone...but this was a no brainer to me even without the research. For profit care has always been poorer quality. Hospitals in America are treated like businesses, and just look at the state of our Healthcare...",
            "title_similarity": "0.7414324",
            "sentiment_compound": 0.6848
        },
        {
            "id": "hoy1lq8",
            "score": 1,
            "text": "The study is behind a paywall but I think there is more to this than simply “for profit nursing homes are bad.” I worked as a rep for a large supplier of medical supplies for ltc and as a whole I think long term care needs a revamp. I had many customers on both sides and there are bad homes on both sides.\n\nThere could be a lot of factors that go into this but I think the biggest part would be that for profit homes want higher acuity patients because they get more reimbursement for those patients. Higher acuity patients could explain why they have higher mortality rates.",
            "title_similarity": "0.7339175",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hoy2e8d",
            "score": 1,
            "text": "Another fun fact.  The average nursing home spends less than 6$ A DAY on food per resident.  That’s all 3 meals and snacks.  Let that sink in.",
            "title_similarity": "0.61062104",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hoy2pm5",
            "score": 1,
            "text": "This doesn't sound like it should be news. By definition, profit is the extraction of value from a market. Whatever that market is it is made worse by the pursuit of profit.\n\nCompetition is supposed to drive profit to zero and make markets efficient, but obviously that doesn't happen without intentional policy to make it happen",
            "title_similarity": "0.56216043",
            "sentiment_compound": 0.592
        },
        {
            "id": "hoy2sod",
            "score": 1,
            "text": "Money is the root of nearly all the evils of this world.",
            "title_similarity": "0.5437688",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hoy2w0f",
            "score": 1,
            "text": "I’d honestly 100% rather die than ever go into one of those places.",
            "title_similarity": "0.3944648",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hoy2y2n",
            "score": 1,
            "text": "This is socialism’s fault for not wresting end of life care from capitalism.",
            "title_similarity": "0.56285524",
            "sentiment_compound": 0.128
        },
        {
            "id": "hoy3p6v",
            "score": 1,
            "text": "Well I guess they can increase their monthly rates once someone \"moves out\"\n\nGood old. Profit over people",
            "title_similarity": "0.48456347",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hoy46qw",
            "score": 1,
            "text": "I hope I get eaten by a shark before my kids ever put me in one of these. They're disgusting",
            "title_similarity": "0.39738226",
            "sentiment_compound": -0.128
        },
        {
            "id": "hoy48bj",
            "score": 1,
            "text": ">for profit care home\n\nIn my country we call that stealing from old people",
            "title_similarity": "0.59594786",
            "sentiment_compound": 0.34
        },
        {
            "id": "hoy4th0",
            "score": 1,
            "text": "What the Fug is wrong with our country? This is how we award our elderly?",
            "title_similarity": "0.5327982",
            "sentiment_compound": 0.1926
        },
        {
            "id": "hoy55kt",
            "score": 1,
            "text": "Not at all surprised.  My wife was poisoned unto death, it was followed up with a cover-up from the State. A State that proceeded to steal everything they could, including funds that were to go to the executor. I had to pay it! $3,500.oo IRS, cleared out our account. Then lost my business, I’m a therapeutic engineer for elderly and disabled, so I needed to say good bye to my patients. Then I lost our home. All because of overworked and underpaid staff in a corporate nursing facility! In the meantime I’ve beaten cancer 3 times and SARS/CoV2 once last year, in the hospital. Please, everyone, get your shots and wear a mask!",
            "title_similarity": "0.677454",
            "sentiment_compound": -0.9668
        },
        {
            "id": "hoy5eza",
            "score": 1,
            "text": "Anything that's \"For profit\" usually has bad outcome for someone. Prisons, Healthcare, schools, etc. Even businesses will have poor outcomes for employees and ultimately customers if the only motivation is profit. It's almost like capitalism sucks.",
            "title_similarity": "0.69619644",
            "sentiment_compound": 0.1458
        },
        {
            "id": "hoy5r8u",
            "score": 1,
            "text": "Doesn't surprise me in the least which is a very sad statement. You can still be profitable and provide quality care (so shareholders won't make quite as much...boo friggin hoo). Where's your humanity?!",
            "title_similarity": "0.4971249",
            "sentiment_compound": 0.2926
        },
        {
            "id": "hoy5txj",
            "score": 1,
            "text": "Interesting, isn't that the same for for-profit prisons?",
            "title_similarity": "0.47962454",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hoy66km",
            "score": 1,
            "text": "For profit healthcare strikes again.",
            "title_similarity": "0.51312685",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hoy6j14",
            "score": 1,
            "text": "I used to deliver Janitorial supplies to many Nursing home facilities. Some of them were nice upscale hotel type places with very nice facilities and staff. but then some were just absolutely disgusting. In one specific one  the area I delivered the chemicals was right by the kitchen which is in this unfished basement/boiler room area. Which I thought was a weird place for a kitchen anyways. But theres just trash everywhere outside the driveway area and the floors in there were greasy and had things stuck to em. Not sure how big the company is but I would avoid sending your loved ones to any home owned by Reliant Care Management.",
            "title_similarity": "0.6086027",
            "sentiment_compound": 0.1316
        },
        {
            "id": "hoy7e4t",
            "score": 1,
            "text": "Yeah when you can’t know if it would be revealed that it had \"theync\" in the car\" shortly after buying the new car.",
            "title_similarity": "0.32948178",
            "sentiment_compound": 0.296
        },
        {
            "id": "hoy7u31",
            "score": 1,
            "text": "Whyyyyyyyy???? What the hell are we doing?\nI HATE this.",
            "title_similarity": "0.23772183",
            "sentiment_compound": -0.8999
        },
        {
            "id": "hoy7v0p",
            "score": 1,
            "text": "One of the few benefits of being orphaned as a kid I don’t have to worry about this for my parents. The medical system was bad enough.",
            "title_similarity": "0.49123365",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hoy822o",
            "score": 1,
            "text": "If this is surprising to literally anyone then you seriously need to snap to reality because humans are nothing but wage slaves, we live to work and we die working, or in this case by being \"cared for\"",
            "title_similarity": "0.44750357",
            "sentiment_compound": -0.3506
        },
        {
            "id": "hoy8q06",
            "score": 1,
            "text": "This isn’t surprising, continues to confirm that private-for-profit medicine doesn’t work. Exploiting someone’s health to fatten your own pockets is sickening.",
            "title_similarity": "0.595845",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hoy8vxy",
            "score": 1,
            "text": "Capitalism ruins yet another industry by (shockingly!) choosing private profits over the of interest. We've seen studies confirming this for healthcare, mental care, transportation, housing, and now elder care. But I've got a really good feeling about higher education!",
            "title_similarity": "0.6863086",
            "sentiment_compound": 0.8977
        },
        {
            "id": "hoy98qt",
            "score": 1,
            "text": "All medical goods and services should be not-for-profit.",
            "title_similarity": "0.35120466",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoy9dn0",
            "score": 1,
            "text": "So getting money and not spending money leads to higher profits…whaaaa!!?!?",
            "title_similarity": "0.47834125",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoy9ztu",
            "score": 1,
            "text": "FOR PROVIT not equal for quality of life!",
            "title_similarity": "0.38251743",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoyah9y",
            "score": 1,
            "text": "I used to work for a management company that owned half a dozen SNFs, and it felt like most everyone really cared about treating the patients right (I wasn't patient-facing myself). Problem is, the smaller you are, the harder it is to eat random government costs, so when Medicare decided to retroactively decline some reimbursement they'd approved for 20 years, they had to either sell and dissolve or pay back something like 20 million dollars above normal operating costs that wasn't gonna happen. As soon as the big chain bought them out, things started going downhill and a whole lot of folks bounced.",
            "title_similarity": "0.703238",
            "sentiment_compound": 0.9004
        },
        {
            "id": "hoyc29b",
            "score": 1,
            "text": "Don’t all nursing homes have a 100% mortality rate?",
            "title_similarity": "0.59496504",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoyc6dc",
            "score": 1,
            "text": "It’s almost like profits are priority #1 for a business.",
            "title_similarity": "0.53748447",
            "sentiment_compound": 0.5898
        },
        {
            "id": "hoycc03",
            "score": 1,
            "text": "I used to work in a home that had 40 rooms dedicated to dementia patients. We had one LPN and 8 CNAs during the day. The CNAs were on their own for night shift. I was a CNA and I made $9.50/hr. I once heard that residents paid $5500-$6000 a month for care and that it was mostly private-pay. Idk how true the private pay part is but the care I witnessed there was pretty awful.",
            "title_similarity": "0.6694582",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hoycimi",
            "score": 1,
            "text": "Go figure! Another industry plagued with greed and money!",
            "title_similarity": "0.4944226",
            "sentiment_compound": -0.508
        },
        {
            "id": "hoycism",
            "score": 1,
            "text": "Anyone watched \"I care a lot?\"",
            "title_similarity": "0.14899531",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hoydema",
            "score": 1,
            "text": "When I worked as a private practice attorney, I had nursing homes harassing deceased residents’ family members for like $1000-2000 in unpaid bills. Blew my mind that they were that litigious over such a small sum, particularly with a family dealing with the death of a loved one.",
            "title_similarity": "0.6758355",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hoydu4b",
            "score": 1,
            "text": "My ex used to work in group homes for the mentally disabled.  The level of fraud, waste, and abuse that goes unreported is absolutely mind blowing.  Some are OK, but a lot should be shut down permanently.  And since it all goes unreported, you'll never know which are good or bad.\n\nI'm talking about clients getting raped.  Laptops, jewelry, anything of any value stolen regularly, clients ignored and abused (verbal and physical), unreported violence... that kind of stuff.",
            "title_similarity": "0.6086525",
            "sentiment_compound": -0.9841
        },
        {
            "id": "hoye5u3",
            "score": 1,
            "text": "Healthcare (hospitals, nursing homes, instututions, etc) having to make a “profit” and having to be run like a business is one of the biggest scams of neoliberalism that people just seem to somehow have accepted.",
            "title_similarity": "0.6755007",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hoyeji4",
            "score": 1,
            "text": "And yet NOTHING will be done about it. Let's move along to the next tragedy.",
            "title_similarity": "0.19273916",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hoyeoy2",
            "score": 1,
            "text": "Huh, it’s almost like profit and care of people is a conflict of interest…",
            "title_similarity": "0.46587247",
            "sentiment_compound": 0.6936
        },
        {
            "id": "hoyfct8",
            "score": 1,
            "text": "...wow, what a shock. For profit doesn't result in good health.",
            "title_similarity": "0.49237293",
            "sentiment_compound": 0.4007
        },
        {
            "id": "hoyff7o",
            "score": 1,
            "text": "Yet another area where profits are killing people and run counter to the public interest.",
            "title_similarity": "0.5124084",
            "sentiment_compound": 0.128
        },
        {
            "id": "hoyff87",
            "score": 1,
            "text": "Is there any surprises at all ? Profile first. Capitalism can be dangerous in time like this.",
            "title_similarity": "0.46329778",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hoyfhn1",
            "score": 1,
            "text": "Wow... it's almost like human needs (not wants) shouldn't be in a for-profit market becuase capitalism requires the ability to abstain from business for the market to regulate itself... capitalism ≠ democracy.",
            "title_similarity": "0.5080229",
            "sentiment_compound": 0.8078
        },
        {
            "id": "hoyg8hs",
            "score": 1,
            "text": "I honestly don't know, do non-profit assisted living facilities even exist in the US?\n\nHow do you find them?",
            "title_similarity": "0.3773791",
            "sentiment_compound": 0.5204
        },
        {
            "id": "hoyglxl",
            "score": 1,
            "text": "Welcome to late stage capitalism. The old eat the young and also the poor olds",
            "title_similarity": "0.51728785",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hoyh4d3",
            "score": 1,
            "text": "It’ll be interesting/very sad to watch as this market totally falls off a cliff in about 20-30 years. With guaranteed pensions and lifetime retirements being practically non existent now, and 401k’s for the average worker not being nearly enough to live off of, there will be a much much smaller pool to siphon money from. Add to the fact there are more workers in the labor market than ever before we’re headed for a elderly care pandemic that is going to be more disastrous and abysmal than it already is.",
            "title_similarity": "0.756719",
            "sentiment_compound": -0.624
        },
        {
            "id": "hoyh70r",
            "score": 1,
            "text": "Logic would suggest that you don't really want your nursing home making a huge margin.",
            "title_similarity": "0.49468905",
            "sentiment_compound": 0.2171
        },
        {
            "id": "hoyi4be",
            "score": 1,
            "text": "It’s almost like institutions that involve peoples mental, physical, and emotional health shouldn’t be for profit. Hm. Weird",
            "title_similarity": "0.52457887",
            "sentiment_compound": 0.6133
        },
        {
            "id": "hoyibrp",
            "score": 1,
            "text": "Why not outlaw for profit care facilities and only allow non profit one to be in operation? Seems like it would save lives.",
            "title_similarity": "0.41247237",
            "sentiment_compound": 0.8832
        },
        {
            "id": "hoyif0w",
            "score": 1,
            "text": "I can't actually understand how anyone thinks that 'for profit' means anything other than exactly that, for profit. If it's someone's fiduciary duty to provide investors with the most possible profit, it's impossible for anything else to be relevant.\n\nWhen you buy an item, you know it's costing you more than it costs to make, because you're supporting a business. You accept it. How can anyone with a shred of humanity think, \"I like these investors, I'll allow them to profit from the 'care' they'll provide my senior, even if it means their care comes second to the investors return on investment.\"",
            "title_similarity": "0.58919626",
            "sentiment_compound": 0.978
        },
        {
            "id": "hoyimw3",
            "score": 1,
            "text": "I work at a retirement community for low income seniors and while I don’t make as much as I would at a SNF or hospital, I really care about these people here and do what I can to make their golden years golden. All the staff here do.",
            "title_similarity": "0.5637686",
            "sentiment_compound": 0.3384
        },
        {
            "id": "hoyirua",
            "score": 1,
            "text": "My partner works at a nursing home. Your loved ones are not being cared for like you think.",
            "title_similarity": "0.50847846",
            "sentiment_compound": 0.6209
        },
        {
            "id": "hoyj89a",
            "score": 1,
            "text": "Derr when money becomes your God all else is a sin",
            "title_similarity": "0.47601786",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hoyjs8y",
            "score": 1,
            "text": "I worked in a LTC facility for one shift. I vowed to never go back. This was back before the pandemic. I walked in, first day on the job (no prior orientation) and was told that I was the supervisor for the entire facility. There was no description of what this entailed. I also had 42 patients that I was responsible for. 42!! That is insane and in no way possible to actually accomplish. I did the best that I could for that shift, charted “not completed” for tasks I was unable to get to and reported the tasks to the next shift so they could see those patients first. The manager told me that I HAD to chart that the task was done. I informed her that I would in no way falsify a legal document. I quit right then and there. NEVER again",
            "title_similarity": "0.5000396",
            "sentiment_compound": 0.6771
        },
        {
            "id": "hoykmp4",
            "score": 1,
            "text": "It should not be allowed to operate medical facilities for profit.",
            "title_similarity": "0.4163546",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hoykoyr",
            "score": 1,
            "text": "Why am i not surprised",
            "title_similarity": "-0.00249854",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hoylcd5",
            "score": 1,
            "text": "In a surprise to no one…..",
            "title_similarity": "0.085145555",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hoymecy",
            "score": 1,
            "text": "What did you think would happen when you have for-profit healthcare systems....\n\nIf patient care and quality of life are competing with profits, which one do you think will win out? \n\nBut yay capitalism, amiright?",
            "title_similarity": "0.6680065",
            "sentiment_compound": 0.8862
        },
        {
            "id": "hoymvm4",
            "score": 1,
            "text": "Which one has the highest profit margin. Looking for my mother in law…",
            "title_similarity": "0.59030807",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hoynacc",
            "score": 1,
            "text": "Thats because these \"homes\" are just real estate investments and they don't care if the patients are well because it's just money until they die and the next monthly payment moves in.",
            "title_similarity": "0.5958618",
            "sentiment_compound": -0.6628
        },
        {
            "id": "hoyntev",
            "score": 1,
            "text": "I have had the mixed pleasure of working in the Dietary end of this industry for 20 years. It breaks my heart to see the almighty dollar held in higher esteem than basic human compassion. My teams/crews have always done our best, as have Housekeeping and Nursing. Owners suck. They are NEVER on the front lines sweating with the rest of us, rather they weep over profits and bonuses at the expense of the residents and the staff that directly serves them.  Shame.   Shame on them. \nRant over…for now.",
            "title_similarity": "0.68433154",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hoyo591",
            "score": 1,
            "text": "Probably similar in the prison industrial complex",
            "title_similarity": "0.18929508",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hoyo7r3",
            "score": 1,
            "text": "Still better than a government-run nursing home would ever be.",
            "title_similarity": "0.5784233",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hoyo9pe",
            "score": 1,
            "text": "Killing people in the name of money, 'Merica",
            "title_similarity": "0.39919496",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hoyoagq",
            "score": 1,
            "text": "Worked in a “restaurant” in one of these retirement communities and got fired for documenting how gross everything was. Literal millionaires lived and paid 9000$ monthly rent. I couldn’t deal cos the residents started telling me they didn’t eat the dinners brought to them just bread and soup because everything else was gross low quality.\n\nThe irony now is I’m a caregiver and I’ve been called to fill in for the “Care team” at the place I worked. I turn down any client that lives there, I ain’t going back knowing how gross the food is.",
            "title_similarity": "0.6003259",
            "sentiment_compound": -0.9349
        },
        {
            "id": "hoypbik",
            "score": 1,
            "text": "Can’t see how this is a surprise to anyone.",
            "title_similarity": "0.10584216",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hoyq13k",
            "score": 1,
            "text": "Just like anyone else, these facilities prey on the affluent elderly. I work in a for profit facility and all these sentiments and worse are true.",
            "title_similarity": "0.6447844",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hoyq1ep",
            "score": 1,
            "text": "So why do care homes have profit margins again? Taking care of the weak and infirm while vacuuming their pension/savings. Power imbalance and predatory behaviour, what could go wrong?",
            "title_similarity": "0.6668935",
            "sentiment_compound": 0.6025
        },
        {
            "id": "hoyq7s6",
            "score": 1,
            "text": "I am in pharmaceuticals and one of the first things I noticed is how many more drugs the average elderly person in a long term care facility is on compared to one who lives at home.\n\nNow you may think “well they’re in a home because they need more help so logically they need more medicine”\n\nAnd id agree to an extent but you gotta see these differences.  Typical member may be on 1-3 drugs, LTC member easily on a cycle of 20 meds.",
            "title_similarity": "0.6479392",
            "sentiment_compound": 0.7874
        },
        {
            "id": "hoyqj6z",
            "score": 1,
            "text": "I work in an assisted living facility that costs about $5k per month to live in that's owned by a nation wide chain. Everything looks nice and shiny from the outside, but the quality of care is adequate at best. \n\nWe're constantly understaffed so we end up hiring the first warm body that walks through the doors which ends up with us hiring people who really don't have the disposition to care for the elderly. \n\nAfter seeing how things are run in the \"nice\" facilities, I'd never put my mother there. It's horribly sad. \n\nDefinitely doesn't surprise me that in the less expensive facilities you hear stories of the staff abusing the residents or running fight clubs in the memory care.",
            "title_similarity": "0.68644285",
            "sentiment_compound": 0.9228
        },
        {
            "id": "hoyrbu0",
            "score": 1,
            "text": "This seems to be the case with many things. As soon as something is for profit, their goal is profit by any means necessary. Cutting corners becomes acceptable if it means more profit.",
            "title_similarity": "0.29068637",
            "sentiment_compound": 0.8687
        },
        {
            "id": "hoyruxm",
            "score": 1,
            "text": "Makes sense, if you’re optimizing for profit, you’ll have worser care",
            "title_similarity": "0.4677554",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hoyrxjx",
            "score": 1,
            "text": "Wow! This is rotten news. Damn those companies to hell",
            "title_similarity": "0.4887991",
            "sentiment_compound": -0.7959
        },
        {
            "id": "hoys793",
            "score": 1,
            "text": "Is this really surprising you any of you? It doesn’t take a scientific study to realize “for profit” means cutting corners. Truly dumb",
            "title_similarity": "0.440036",
            "sentiment_compound": 0.1263
        },
        {
            "id": "hoyt1mr",
            "score": 1,
            "text": "If this is the case for profit nursing homes the for profit prisons must be like being in a dungeon",
            "title_similarity": "0.615179",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hoytcgv",
            "score": 1,
            "text": "I’ve worked in nursing homes for years. They are why I’m not growing old in this country.",
            "title_similarity": "0.47597867",
            "sentiment_compound": -0.1326
        },
        {
            "id": "hoytprq",
            "score": 1,
            "text": "My grandfather refused to go to any home. He had many physical issues but did fine with 2-3 visits a week from people dropping off food (minimum, normally family would stay with him for company.) he was much happier being able to mostly take care of himself",
            "title_similarity": "0.47350365",
            "sentiment_compound": 0.8885
        },
        {
            "id": "hoytu20",
            "score": 1,
            "text": "Honestly I wouldn’t send a dog to live in these places. Our older citizens deserve so much better and yet we have Minister Colbeck collecting a handsome salary and making things even worse.",
            "title_similarity": "0.6495656",
            "sentiment_compound": 0.7414
        },
        {
            "id": "hoyv5fk",
            "score": 1,
            "text": "Geeeere wonderrrrrr whyyyyyy. Corporations are evil",
            "title_similarity": "0.49584308",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hoyvqvm",
            "score": 1,
            "text": "Private equity firms should not be allowed to own nursing/medical facilities and residential property or mobile homes. I believe Australia has made the practice of PE backed residences illegal and thE US needs to consider it. They never will though.",
            "title_similarity": "0.4101184",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hoyw5mi",
            "score": 1,
            "text": "Remove profits when it comes to caring for people.",
            "title_similarity": "0.44444108",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hoyw8hm",
            "score": 1,
            "text": "In a surprise to nobody, corporate assholes abuse elderly for profit.  I'm surprised they don't use nursing homes as indentured servitude. Their families have to pay the company so the elderly can \"live\" there working for them until they die",
            "title_similarity": "0.6467966",
            "sentiment_compound": -0.8126
        },
        {
            "id": "hoywfhs",
            "score": 1,
            "text": "Did they control for admission policies?\n\nMy wife had to put her parents in a care home and the fact that her mom had advanced Alzheimer’s caused our options to shrink considerably.\n\nSome of the for-profit places basically said, “We’ll take her, but it’ll cost you an arm and a leg.” But all of the nonprofit places we talked to said, “Nope, we aren’t equipped to handle her.”\n\nNo clue if that’s typical, but if so, it might explain at least part of the difference.\n\nThat said, the quality of care was barely acceptable at the for-profit place we finally chose, despite costing ridiculous amounts of money. My wife literally got a check in the mail this week with her share of the proceeds from a class-action lawsuit against the place. So I’m by no means defending for-profit care homes here.",
            "title_similarity": "0.6912243",
            "sentiment_compound": 0.8963
        },
        {
            "id": "hoyx9e3",
            "score": 1,
            "text": "\"Company(ies) with the highest profits, churn out products and services with the worst quality. Onlookers, shocked!\"",
            "title_similarity": "0.7195337",
            "sentiment_compound": -0.5848
        },
        {
            "id": "hoyxv0h",
            "score": 1,
            "text": ">~~Nursing homes~~ with the highest profit margins have the lowest quality.\n\n\\*insert public service that has let the \"free market\" come in and let it be run like a for-profit business\\*",
            "title_similarity": "0.7630521",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hoyyfdp",
            "score": 1,
            "text": "This is showing what we knew all along. Capitalism doesn't make incentives for better products or services. It prioritizes cheap goods and services that can be price gouged the most",
            "title_similarity": "0.5481855",
            "sentiment_compound": 0.2354
        },
        {
            "id": "hoyylpm",
            "score": 1,
            "text": "It's the kind of place you'd expect to not be \"for-profit\". Noone should operate at a loss (i get it, i'm a realist to), but you'd hope as essentially a public service that profit would not be the focus. I don't find this surprising, if you treat care as a business the companies operating them will act like one, and focus on the profit margin.",
            "title_similarity": "0.53066796",
            "sentiment_compound": 0.9778
        },
        {
            "id": "hoyytk3",
            "score": 1,
            "text": "This is not a surprise. I recently worked with a Board and Care rep who was showing us smaller residential homes with 6-8 residents who are cared for, 24/7. He said these places are far better than the large assisted living places that look like resorts. At the larger places it's not uncommon to be left laying in your pee for 8 hours due to understaffing. The small Board and Care places come with their own concerns, but the level of care for my relative was very good.\n\nOne thing I'm going to say about the cost of running larger places though, is that a friend told me if someone gets a bed sore the facility is fined $25,000. I don't know how much of their operating costs go toward paying fines, but that was interesting.",
            "title_similarity": "0.6442113",
            "sentiment_compound": 0.9665
        },
        {
            "id": "hoyyyjl",
            "score": 1,
            "text": "Aleays chasing that bottom line",
            "title_similarity": "0.27176052",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoz10vg",
            "score": 1,
            "text": "How is this surprising? Of course for profit companies want to spend less.",
            "title_similarity": "0.58729917",
            "sentiment_compound": 0.6783
        },
        {
            "id": "hoz190h",
            "score": 1,
            "text": "The big scam is how hard it is to give uti as a cause of death. Someone goes into septic shock, uti is positive, they die. If you try to list UTI as cause of death without a blood culture, it gets rejected, but the cultures sometimes havent come back before patient has died. So you list heart attack as cause of death and no questions asked, no ekg required, no echo, they just accept it even if the thing that lead to cardiac arrest was uncontrolled septic shock. It falls usually on an overworked resident being  willing to set aside 20m of their time on hold to explain why its a uti. \n\nWhy would cardiac arrest or stroke or other \"random\" events get accepted without question but a UTI requires a urine culture, a matching blood culture and a conversation with a coroner who most likely is not available overnight.",
            "title_similarity": "0.6335567",
            "sentiment_compound": -0.9851
        },
        {
            "id": "hoz1mgf",
            "score": 1,
            "text": "Any nursing home or long term care home is low morale,because we don’t get paid enough or good health insurance in the healthcare industry.",
            "title_similarity": "0.7086655",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hoz2smn",
            "score": 1,
            "text": "Yes this is what I tell people is the \"capitalism tax\"\n\nA government will create an arbitrary tax to take money off the top to pay for useful things, and this is considered \"bad,\" \"stifling growth,\" etc. by means of propaganda. \n\nCapitalism is *designed* to take some off the top to go to maybe useful things, maybe not, who cares, it's not your money it's their money and they earned it. \n\nSo yes, *of course* this is the case. Of course the higher margins \"give\" less to the people consuming it. That's the *entire point* is to create the widest profit margin by kicking the bottom out of services rendered and jacking up prices.\n\nAnd that's coming from a staunch capitalist. I LOVE capitalism. But we need to understand what it's good for and regulate it where necessary.",
            "title_similarity": "0.6304537",
            "sentiment_compound": 0.9296
        },
        {
            "id": "hoz2yet",
            "score": 1,
            "text": "\"For-profit ____ results in lower-quality ____.\"\n\nWho would've thunk??",
            "title_similarity": "0.5606765",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoz34sy",
            "score": 1,
            "text": "A healthy society should socialize needed services and privatize wanted ones.",
            "title_similarity": "0.28389308",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hoz38v5",
            "score": 1,
            "text": "While I do think that there IS a place for for-profit medical care and the like - it provide an incentive and a reference point for cost efficiency that can be emulated by non-profits and not-for profit organizations... I'll try to avoid placing my mother in a for-profit nursing home and I'll stay the heck away from anything PE related.",
            "title_similarity": "0.5156431",
            "sentiment_compound": 0.886
        },
        {
            "id": "hoz3opv",
            "score": 1,
            "text": "Big surprise, much wow. I moved inside of Germany, paying double the rent now, to escape private clinics and not die.",
            "title_similarity": "0.58406764",
            "sentiment_compound": 0.8672
        },
        {
            "id": "hoz4baj",
            "score": 1,
            "text": "I am shocked and appalled.",
            "title_similarity": "0.1808531",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hoz4p67",
            "score": 1,
            "text": "For profit institutions should not exist.",
            "title_similarity": "0.2890104",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hoz4yhw",
            "score": 1,
            "text": "I thought it would be fairly obvious that companies who exist to make money would not offer the same standards of service than companies which exist only to provide the service.",
            "title_similarity": "0.5717118",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoz53zs",
            "score": 1,
            "text": "Take a look at the rest of America. Profit margin and quality of life don’t go together.",
            "title_similarity": "0.5312854",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hoz5a1w",
            "score": 1,
            "text": "Healthcare, much like firefighting, should not be a for-profit industry.",
            "title_similarity": "0.4468931",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hoz5xmc",
            "score": 1,
            "text": "I have a coworker that runs a non profit Adult Foster Care facility and the govt only provides them with enough funding to pay their employees $11/12 a hour (same as his and his wife’s pay) it’s sad but the people willing to work for that cheap are very passionate about what they’re doing. As opposed to a large company that can charge ~$3000 a month for its patients but has their main focus on profit. A company like that will incentivize cost cutting practices causing a neglective environment for the patients",
            "title_similarity": "0.6986834",
            "sentiment_compound": 0.9184
        },
        {
            "id": "hoz74gu",
            "score": 1,
            "text": "Probably the 1:50 nurse ratios",
            "title_similarity": "0.39090073",
            "sentiment_compound": 0.0
        },
        {
            "id": "hoz78rw",
            "score": 3,
            "text": "The _____ with the highest profit margins has the lowest quality. \n\nLiterally put anything there and this is the case.",
            "title_similarity": "0.7100291",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hoz8mkb",
            "score": 3,
            "text": "Huh. It's almost as if the facts keep suggesting that the blind pursuit of capital by faceless corporate amalgams will lead to incredible pain and suffering. It's almost as if maybe the willingness to kill or grossly neglect human life chasing profit is...maybe...not good?",
            "title_similarity": "0.6173521",
            "sentiment_compound": -0.9073
        },
        {
            "id": "hoz93k3",
            "score": 1,
            "text": "As a hopeful future elder — I would like to see a huge investment in this industry. We must respect our elderly population more than we do.",
            "title_similarity": "0.45784476",
            "sentiment_compound": 0.8807
        },
        {
            "id": "hoz9b4w",
            "score": 1,
            "text": "I have experience in this business. With how little some residents are able to \"pay\" (often it is not them paying) per month, it is VERY hard to maintain high quality standards and even harder to pay the deserved wages to direct care workers. \n\nNot an excuse necessarily, but profit margins are insanely low if you try to give healthy meals and events and everything the residents deserve.\n\nWe always strive to provide a family environment and the best care regardless.",
            "title_similarity": "0.6241665",
            "sentiment_compound": 0.9495
        },
        {
            "id": "hoz9six",
            "score": 3,
            "text": "Privatization kills.\nProfiting off of the suffering of human beings is immoral.",
            "title_similarity": "0.5394151",
            "sentiment_compound": -0.7906
        },
        {
            "id": "hozabne",
            "score": 1,
            "text": "To the absolute surprise of nobody",
            "title_similarity": "0.12566335",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hozbssv",
            "score": 1,
            "text": "*pretending to be shocked*",
            "title_similarity": "0.11084437",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hozc3a7",
            "score": 1,
            "text": "My dad had alzeimers and was in a nursing home. He fell and broke his hip and rather than do the expesnive surgury the nursing home refused to do surgury claiming \"He won't be able to recover becaus of his dimentia.\" Which is baloney because could easily been sedatedand helped. \n\nInstead they put him on hospice and pumped him full of opioid pain killers and he literallly died from not eatin. The staff didn't make sure he was fed. Just disgusting. With the excuse of, \"Comppsionate\" not forcing people to eat. He didn't know what he was doing orthinking. \n\nThe real reason is was wanting him to die so that they wouldn't have to keep paying to keep him alive and to free up space for the next resident.\n\nNursing homes in the United States are one of the greatest human rights abuses of our time.Andit's directlyrelated byThe greatest human rights abuse of our time, the lack of universal guaranteed access to healthcare for all Americans. Instead the predatory exploitative ystemwe have not only leaves millions without healthcare period but makes it orders of magnitudemoreexpennsivethan EVERY other healthcare system on theplanet. \n\nIt's a horrific abuse of human rights and the one greatest cause of poverty, suffering, drug abuse, crime in our country and the one thing hardly anybody is passionate about.",
            "title_similarity": "0.6028894",
            "sentiment_compound": -0.9854
        },
        {
            "id": "hozcg2o",
            "score": 1,
            "text": "Wait’ll you hear about equity firm hospitals.",
            "title_similarity": "0.3494938",
            "sentiment_compound": 0.0
        },
        {
            "id": "hozcw1g",
            "score": 1,
            "text": "This does not surprise me. It's the same with education, healthcare, whatever is for-profit. For-profits don't care about quality, they just care about....profits. That means they use the cheapest ways to keep money up, at the cost of the consumer/customer.",
            "title_similarity": "0.47748157",
            "sentiment_compound": -0.0624
        },
        {
            "id": "hozd3b6",
            "score": 1,
            "text": "I work for a hospice in the US and I’ll tell you that the stories the Nurses and Care Aides come tell us are heartbreaking. Residents who have broken bones with no recent falls, they are left in their soiled diapers all day, get yelled at and so much worse. The for-profit nursing homes are the worst. Money hungry administrators and shareholders are to blame for that. The not-for-profit Nursing homes are so much better. The staff gets treated really well and compensated nicely with salary and the residents have extra perks like fun days where they have entertainment the whole day, amongst other stuff. They also give back to the community with food drives.",
            "title_similarity": "0.66097295",
            "sentiment_compound": 0.2716
        },
        {
            "id": "hozd85o",
            "score": 1,
            "text": "You didnt need the pandemic to see that, i do health and safety work and the places that always failed for their state mandated legionella and their MBF and lead and asbestos testing were the flashy ones",
            "title_similarity": "0.590824",
            "sentiment_compound": -0.128
        },
        {
            "id": "hozdc06",
            "score": 1,
            "text": "They need to change the laws \n\nhttps://thetyee.ca/Opinion/2018/02/26/Chinese-Government-Control-BC-Senior-Homes/",
            "title_similarity": "0.3522793",
            "sentiment_compound": 0.0
        },
        {
            "id": "hozdzcm",
            "score": 1,
            "text": "Please tell me that nobody is actually surprised by this.",
            "title_similarity": "0.059311263",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hozeq9m",
            "score": 1,
            "text": "Who'd knew that better call saul got it right?\nA mean..\nA non profit better than a for profit...\nWht next..is justice only accecible for those that can afford to pay for it?\n\nSurreal",
            "title_similarity": "0.58353066",
            "sentiment_compound": 0.932
        },
        {
            "id": "hozfg75",
            "score": 1,
            "text": "I will never let anyone I love love in one of these places again.  I could write a novel",
            "title_similarity": "0.3557736",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hozfj4y",
            "score": 1,
            "text": "because they care .. for money",
            "title_similarity": "0.22103122",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hozfosl",
            "score": 1,
            "text": "This shouldn't surprise anyone",
            "title_similarity": "0.06270893",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hozg3st",
            "score": 2,
            "text": "I worked at a for-profit assisted living center and rent was upwards of $6K a month *and* the management would frequently lecture the residents on how much water and electricity they were using. The food was absolute garbage and I worked with some terribly lazy people, plus I was making $11/hour but that was years ago. \n\nIt was all pretty on the outside, but the place had some major flaws. And I think our head nurse was killing people via morphine overdose but I can’t prove that.",
            "title_similarity": "0.66198707",
            "sentiment_compound": -0.705
        },
        {
            "id": "hozgbz4",
            "score": 1,
            "text": "I mean, this was a given",
            "title_similarity": "-0.049700007",
            "sentiment_compound": 0.0
        },
        {
            "id": "hozhqx8",
            "score": 2,
            "text": "Capitalism doesn’t work period. Communism works.",
            "title_similarity": "0.44327787",
            "sentiment_compound": 0.0
        },
        {
            "id": "hozie4v",
            "score": 1,
            "text": "Our local “care” homes, even the nice ones, understaff. They use the fire department to subsidize them by providing “assessments” after non-injury falls (lift assists) among other things.",
            "title_similarity": "0.4760123",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hozkipc",
            "score": 1,
            "text": "Death panels are real and run by hedge funds.",
            "title_similarity": "0.41992605",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hozmk7d",
            "score": 1,
            "text": "Here's my shocked face.\n\n-_-",
            "title_similarity": "0.17436463",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hoznefe",
            "score": 2,
            "text": "If the profit comes from new inhabitants, and actually caring for people actually does cost money, so yeah the name already says it, they do it for-profit not to care about people.",
            "title_similarity": "0.5539893",
            "sentiment_compound": 0.746
        },
        {
            "id": "hozp8ga",
            "score": 2,
            "text": "“Banks actually don’t care about working class income”\n“Coal companies are the biggest polluters and hide carbon impact on global warming”\n“DeBeers doesn’t really care about African miners”\n“Republicans aren’t outraged by January 6th”\n“Pharma companies don’t care about jacking up insulin prices for profit while people die”\n\nPlease Americans on this thread- don’t put your elderly family in a nursing home. It’ll be hard, costly, and burdensome. But these are by-design death houses to extract your wealth and while unemotionally kill your parents.",
            "title_similarity": "0.65462124",
            "sentiment_compound": -0.8153
        },
        {
            "id": "hozqgfq",
            "score": 1,
            "text": "This is to me another example of big money makers actually being thieves. In capitalism we allow sociopaths and people with limited or no ethics to make big money stealing from the rest of us. I. Not advocating for socialism but as it stands now capitalism needs to reigned in. GREED, is definitely NOT good.",
            "title_similarity": "0.5833991",
            "sentiment_compound": -0.8522
        },
        {
            "id": "hozr6hs",
            "score": 1,
            "text": "How is that surprising ? How do people think margin are made ?",
            "title_similarity": "0.23778714",
            "sentiment_compound": 0.3527
        },
        {
            "id": "hozrhdo",
            "score": 1,
            "text": "Doing nursing care for old people I came up the ranks and got a bunch of promotions, raises and all that not from working hard or anything, there are definitely people who worked there that did way more work than me but, from just showing compassion and like I genuinely enjoyed taking care of them, because I did it was easy. They would constantly give me praise to the higher nurses about how good of an RA I was and all that but I wasn’t going the extra mile I was just showing up with a smile on my face and being polite and doing what they needed me to do. Way too many of my coworkers were hated because they would show up with bad attitudes, pissed off and take it out on residents or just wouldnt do cares. \n\nI worked assisted living so the rules are a little different, like you arent allowed to force them to do anything you just have to suggest things to them. So if a resident is constantly refusing cares there isn’t much we can do besides getting them moved to a long care facility, those are the only times I’ve seen residents truly mistreated but not because of anyone around them but because they didn’t have the facilities to take care of themselves with an “assist” \n\nI never saw blatant elder abuse or just being mean most of the RAs would respond to unruly residents the same way a mother tries to put shoes on a 3 year old.",
            "title_similarity": "0.5166385",
            "sentiment_compound": 0.9759
        },
        {
            "id": "hozrlay",
            "score": 1,
            "text": "That's because all they're in it for is the money they don't care about the health of the people they're taking care of",
            "title_similarity": "0.480349",
            "sentiment_compound": 0.1461
        },
        {
            "id": "hozvyyd",
            "score": 1,
            "text": "Most nursing homes these days are just bang em and bin en joints",
            "title_similarity": "0.43275303",
            "sentiment_compound": 0.0
        },
        {
            "id": "hozw7sz",
            "score": 1,
            "text": "\nIt’s very sad that America allows poor nursing home treatment to continue like it has been. Heard an informative podcast on The Daily by New York Times that explains how and why the quality is so bad in nursing homes.\n\nhttps://www.nytimes.com/2021/08/21/health/covid-nursing-shortage-delta.html",
            "title_similarity": "0.68157244",
            "sentiment_compound": -0.8585
        },
        {
            "id": "hozz7ed",
            "score": 1,
            "text": "Well, duuh.. old people are not exactly an investment. Capitalism doesn't work here.",
            "title_similarity": "0.48112476",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hozzofl",
            "score": 1,
            "text": "I am currently raising my son on my own and providing full care to my 85 yo grandma specifically to keep her from this situation, even though their demands and a 60 hr work week are wrecking my own health. I have a very large life insurance policy, and fully plan on offing myself at the first sign of significant decline so my boy isn’t in the same position.",
            "title_similarity": "0.5472952",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hp00q4t",
            "score": 1,
            "text": "Too many people what can ya do.",
            "title_similarity": "0.18843415",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp01v29",
            "score": 1,
            "text": "This was known 6 months into the pandemic. Glad it's getting some more attention but will just get swept under the rug like it did last time",
            "title_similarity": "0.45219094",
            "sentiment_compound": 0.6428
        },
        {
            "id": "hp039fh",
            "score": 1,
            "text": "How does one get funding to prove something that is already known",
            "title_similarity": "0.105453245",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp03rh0",
            "score": 1,
            "text": "I’m not surprised by this. \nI would also never send my child to a for profit daycare centre.",
            "title_similarity": "0.28002176",
            "sentiment_compound": 0.3036
        },
        {
            "id": "hp04c6p",
            "score": 1,
            "text": "Turns out that healthcare sucks when the focus is earning money rather than providing great care",
            "title_similarity": "0.656986",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hp0cl00",
            "score": 1,
            "text": "My health insurance for the last 20 has been through a major private sector company.  I lost my insurance for over a year because of a workers comp.  After they canceled my insurance I had to go to a non-profit smaller one.  I was blown away by the improved difference the non-profit health offered.  Everything was new and state-of-the-art and the doctors actually took time to hear everything I had to say.  I didn't feel rushed and felt like they actually cared.",
            "title_similarity": "0.6484754",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hp0e6u0",
            "score": 1,
            "text": "Just a thought but I would think the more expensive nursing homes probably have an older patient population due to more available resources. With their patient population being older that would mean they were more vulnerable to Covid.",
            "title_similarity": "0.6672947",
            "sentiment_compound": -0.4194
        },
        {
            "id": "hp0e9h3",
            "score": 1,
            "text": "Profits above people. I work in healthcare and that is how some companies run. Especially with nursing homes.",
            "title_similarity": "0.56829864",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hp0f4di",
            "score": 1,
            "text": "Worked for a couple of for-profit retirement \"gracious-communities\" that were all owned by hedge funds that just sucked everyone dry up until their death. Did that for six years and I try to tell everyone that will listen, only search for non profits!!!!",
            "title_similarity": "0.55774677",
            "sentiment_compound": -0.7326
        },
        {
            "id": "hp0gidk",
            "score": 2,
            "text": "Turns out capitalism and healthcare is a terrible combo",
            "title_similarity": "0.6733472",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hp0h0i7",
            "score": 1,
            "text": "*pretends to be shocked*",
            "title_similarity": "0.14591272",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hp0im1o",
            "score": 1,
            "text": "“Financial firms are in seniors’ housing for what they can take from it, not what they can contribute. This approach – and the prioritization of profits is what guides financial firms,” she said. “It’s at odds with the social and moral imperatives that underline the need to provide good homes, high-quality care and dignified environments for our elderly populations and the workers who care for them.”\n\nI wonder if there's a take away here that could be applied to a larger score, hmm... eh, it's probably nothing.",
            "title_similarity": "0.6334058",
            "sentiment_compound": 0.9371
        },
        {
            "id": "hp0jklc",
            "score": 1,
            "text": "Not me directly but my mum works in an aged care facility that prides themselves as being 5 stars. Constantly cutting corners, having bad/dangerous staff stay on after constant complaints from other workers, residents and family members. Consistently short staffed and even during the pandemic were getting agency staff in when they weren't allowed to.\n\nIf It's a public holiday or someone calls in sick to the lifestyle team (enrichment and exercise) they don't put anyone on.\nNo managers or higher up staff on a weekend or afternoon shifts so people get away with doing the bare minimum and doing things that are dangerous (putting someone into bed which takes 2 people operating the machine and only 1 person doing it for example) if that as there is no one there to oversee them. \n\nIs all for profits. Any type of home shouldn't be for profit but for people's wellbeing.",
            "title_similarity": "0.61671877",
            "sentiment_compound": -0.8723
        },
        {
            "id": "hp0l8i6",
            "score": 1,
            "text": "Healthcare worker here.\n\nThe for-profit model is NOT compatible with better healthcare outcomes on any metric but profit.\n\nPlease refer to the concept of \"teaching to the test\" for more information.",
            "title_similarity": "0.625831",
            "sentiment_compound": 0.7267
        },
        {
            "id": "hp0l8y0",
            "score": 1,
            "text": "Who is surprised by this? Time and time again mass privatization has proven to be worse for everyone but shareholders.",
            "title_similarity": "0.68175685",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hp0l9qe",
            "score": 1,
            "text": "Literally, the study does NOT compare non-profits!\n\n\"This study is not focused on the public or non-profit seniors’ facilities across Canada\"",
            "title_similarity": "0.35201293",
            "sentiment_compound": -0.3561
        },
        {
            "id": "hp0lxh2",
            "score": 1,
            "text": "Large scale for-profit corporations don't care for human life. I am in utter disbelief. Just shocked and appalled.",
            "title_similarity": "0.53534305",
            "sentiment_compound": -0.8015
        },
        {
            "id": "hp0mgz7",
            "score": 1,
            "text": "Not sending this to my co-worker who put her dad in a fancy living retirement home.\n\nAlso, why you should always have a hidden camera to check on how your elderly person is being treated (or not treated).",
            "title_similarity": "0.49303368",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp0re5s",
            "score": 1,
            "text": "I work as a CNA since covid it's been a nightmare. We are always understaffed but they are ALWAYS excepting new residents to the facility. I've had to take care of a total of 30 residents alone. That's toileting, showers, trashes and medication. It's so hard to do all of that. Especially when multiple people are calling all at once. And it sucks because on the nights I'm a lone I'm rushing from one spot to the next and sometimes I don't have time to get to everyone right away. Which is a serious problem because when they call you never know if it's for something small like closing their blinds or they are on the floor. I can't take care of them like I need or want to and it's heartbreaking.",
            "title_similarity": "0.5863557",
            "sentiment_compound": -0.8718
        },
        {
            "id": "hp0rwt7",
            "score": 1,
            "text": "How am I supposed to take this seriously, when the article literally contradicts the title!\n\n\"This study is not focused on the public or non-profit seniors’ facilities across Canada, but rather, the pension funds, private-equity firms, public companies, and other instruments treating long-term care as an asset class\"",
            "title_similarity": "0.5230975",
            "sentiment_compound": 0.728
        },
        {
            "id": "hp0sfy9",
            "score": 1,
            "text": "If I was gonna put anyone in a nursing home the first part of my search would be to look at it like an investor looking at a a particular asset class. I would take my results and reverse the order of my ratings to find a match for the person in my care.",
            "title_similarity": "0.48088056",
            "sentiment_compound": 0.802
        },
        {
            "id": "hp0vfe4",
            "score": 1,
            "text": "Who could of guessed Capitalists, gona Capitalists",
            "title_similarity": "0.37258172",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp0w6sj",
            "score": 1,
            "text": "I work for a for- profit retirement home and the conditions are absolutely dismal. Roach infestations, minimal maintenance, and almost no resident advocacy programs.",
            "title_similarity": "0.5347939",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hp0w7o1",
            "score": 1,
            "text": "Its almost like capitalism doesnt care about peoples well being.",
            "title_similarity": "0.43818554",
            "sentiment_compound": 0.1727
        },
        {
            "id": "hp1dh9k",
            "score": 1,
            "text": "There is also the deaths of staff. GF advised some have mentally ill patients and have been known to be randomly violent. GF worked for some. Damn scary.",
            "title_similarity": "0.5619107",
            "sentiment_compound": -0.9118
        },
        {
            "id": "hp1ith5",
            "score": 1,
            "text": "Not at all surprising",
            "title_similarity": "-0.0007292144",
            "sentiment_compound": -0.2057
        },
        {
            "id": "hp2jg2f",
            "score": 1,
            "text": "Not a huge surprise. Profit seeking on the back of basic human needs leads to choices of care that prioritizes profits. This is the underlying toxic framework that forms the foundation of American healthcare. The architecture of meeting the needs of human end-of-life care needs deep, systemic revision. We’re heading for a moment where the pursuit of profit will yield horrific consequences for people as they enter the most vulnerable phase of their lives.",
            "title_similarity": "0.6558225",
            "sentiment_compound": 0.6938
        },
        {
            "id": "hp2p16f",
            "score": 1,
            "text": "This is so sad. Where are we heading as the human race?",
            "title_similarity": "0.37049598",
            "sentiment_compound": -0.6113
        },
        {
            "id": "hq6zi0e",
            "score": 1,
            "text": "So subsidize healthcare. Got it.",
            "title_similarity": "0.26418334",
            "sentiment_compound": 0.0
        },
        {
            "id": "hqo740s",
            "score": 1,
            "text": "I've been working in the nursing field for a long time and I've never seen the staffing requirements met. It literally has only gotten worse due to an aging population (even retired nurses are being asked to pick up shifts)",
            "title_similarity": "0.5944507",
            "sentiment_compound": -0.4767
        }
    ]
}