{
    "The pandemic has shown a new way to reduce climate change: scrap in-person meetings & conventions. Moving a professional conference completely online reduces its carbon footprint by 94%, and shifting it to a hybrid model, with no more than half of conventioneers online, curtails the footprint to 67%\n": [
        {
            "id": "hp5q0np",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.5428672",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hp625kq",
            "score": 1,
            "text": "Useless in person meetings account for 45% of all emissions for 2019",
            "title_similarity": "0.6672156",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hp66ups",
            "score": 15,
            "text": "This fighting climate change stuff sound a lot like sucking all joy from life. Glad it won't succeed.",
            "title_similarity": "0.66320205",
            "sentiment_compound": 0.6336
        },
        {
            "id": "hp5ym81",
            "score": 8,
            "text": "Too many cities rely on the conference center events such as restaurants and hotels\n\nThe US is built on money ruling all. The environment does not make money. Therefore this won’t become the norm",
            "title_similarity": "0.6687946",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp5y7l1",
            "score": 2,
            "text": "I don't know that I'll ever get a chance to wake up to a long string of smog free mornings in my city ever again. The effect from all the reduced travel is especially noticeable where you don't have strong emissions laws.",
            "title_similarity": "0.69300944",
            "sentiment_compound": 0.1022
        },
        {
            "id": "hp5zjxb",
            "score": -7,
            "text": "I am an actual enterprise coach, and it's surprising, but also not, that some leaders have touted that they adapted and proved a new model only to have a \"Huge critical event\" and the first thing they do is \"HOW CAN WE GET EVERYONE HERE IN A ROOM\".   \n\n\nWe have data now that supports everything against butts in seats yet here we are!",
            "title_similarity": "0.5947898",
            "sentiment_compound": 0.5848
        },
        {
            "id": "hp633qs",
            "score": -8,
            "text": "And convert the office spaces to affordable housing",
            "title_similarity": "0.2773251",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp766k3",
            "score": 6,
            "text": "The simple notion that we no longer need human contact because it reduces carbon is absolute insanity.\nThe people writhing these research articles live in their moms basement and haven’t seen daylight since starting high school. We need human contact. I’ve attended many conferences around the world. Learned many things. Gained and shared knowledge. But even better is what I learned and the friendships that were forged at a steakhouse at the end of the day. An evening sharing and discussing with people of the same mind. We can’t replace in person relationships with zoom",
            "title_similarity": "0.7479644",
            "sentiment_compound": 0.8885
        },
        {
            "id": "hp75kxa",
            "score": 1,
            "text": "But what about the booth babes?",
            "title_similarity": "0.17642239",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp65qa0",
            "score": 19,
            "text": "Yeah. Screw people’s mental well-being!! No should ever have to leave their house for any reason! And when you peasants stop eating beef and driving cars, we’ll be able to double our private jet usage!!",
            "title_similarity": "0.70079386",
            "sentiment_compound": -0.6083
        },
        {
            "id": "hp5vics",
            "score": 53,
            "text": "[deleted]",
            "title_similarity": "0.18406832"
        },
        {
            "id": "hp61yrg",
            "score": 1,
            "text": "How clean is the internet though and the devices we use to connect to it?",
            "title_similarity": "0.38001662",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hp72oci",
            "score": 2,
            "text": "Online conferences are so boring and unengaging. No chance of meeting new people and sharing ideas.",
            "title_similarity": "0.5730416",
            "sentiment_compound": -0.2338
        },
        {
            "id": "hp61ecd",
            "score": 3,
            "text": "Isn't that a logical conclusion? If you never drive your car you save a lot of gas consumption too. I think confining yourself to home is good when you can but impractical all the time. Minimizing outings and gatherings is simple logic. I think if we do the best we can it's better than ignoring it. The problem remains those who are anti everything folks are doing to mitigate the disease and are doing and will be doing nothing to help. They  number in the millions or hundreds of millions or possibly billions.  How do we overcome that?",
            "title_similarity": "0.684842",
            "sentiment_compound": 0.3763
        },
        {
            "id": "hp62swp",
            "score": 5,
            "text": "Or...hear me out...we could have high speed rail and then people could move about the world with a low carbon footprint.",
            "title_similarity": "0.5457878",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hp674xf",
            "score": 0,
            "text": "All the damn Boomers still want to fly around so their faces can be close together though.",
            "title_similarity": "0.26121455",
            "sentiment_compound": -0.34
        },
        {
            "id": "hp6924f",
            "score": 0,
            "text": "I think you posted this to the wrong sub. Did you mean r/comonsense ?",
            "title_similarity": "0.35137847",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hp69959",
            "score": 0,
            "text": "Most people would rather do zoom but noooooo big corpa  thinks they don't get thier money's worth unless they are there in person.",
            "title_similarity": "0.44920552",
            "sentiment_compound": 0.3291
        },
        {
            "id": "hp6a4ho",
            "score": 0,
            "text": "Was this written by someone who has never been to a convention?",
            "title_similarity": "0.28292835",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6fz06",
            "score": 3,
            "text": "Yea im not sure you're really grasping the REAL PROBLEM here....\n\n[China burned over half the world’s coal last year, despite Xi Jinping’s net-zero pledge](https://fortune.com/2021/03/29/china-coal-energy-electricity-xi-jinping-2020-ember/)",
            "title_similarity": "0.7013475",
            "sentiment_compound": -0.6592
        },
        {
            "id": "hp6g2z6",
            "score": 0,
            "text": "Here comes the metaverse",
            "title_similarity": "0.07251679",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6ywqh",
            "score": 0,
            "text": "And lose all your socializing skills and love a lonely life.\nHumans need to be with other humans. Even at work. Though I didn’t mind working partly from home for a bit.",
            "title_similarity": "0.5196717",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7ks9w",
            "score": 0,
            "text": "Tbf, I only go to conferences to shake hands, eat a Bento box and get some freebies for my nephew's. If the conference is online, then I'd rather read the white paper in my own time.",
            "title_similarity": "0.6515127",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hp7vyzm",
            "score": 0,
            "text": "My team built our typical 3k person event all virtual last year and just crushed it. Best event most have ever been to even without all the drinking and partying.\n\nThe CFO was ecstatic that we saved him 8mil compared to previous years.",
            "title_similarity": "0.6891782",
            "sentiment_compound": 0.8779
        },
        {
            "id": "hp9zlaq",
            "score": 0,
            "text": "Yes, let's just never leave our houses and never speak to anyone face-to-face ever again. Sounds like a healthy way to live.",
            "title_similarity": "0.4724082",
            "sentiment_compound": 0.7934
        },
        {
            "id": "hp61f3a",
            "score": 29,
            "text": "Is plunging deeper into a global mental health epidemic from a lack of face to face social interaction and community worth the likely tiny gain in reducing a carbon footprint? We need more in person interaction, not less.",
            "title_similarity": "0.7112173",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hp5ywhl",
            "score": -6,
            "text": "For profit companies hate this.",
            "title_similarity": "0.47948474",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hp5tw2o",
            "score": 82,
            "text": "When I worked online I was in total isolation and the lack of face to face interaction affected my mental health. I was also in a different city so going out with friends/family wasn't an option.",
            "title_similarity": "0.5650667",
            "sentiment_compound": -0.7089
        },
        {
            "id": "hp62lhj",
            "score": -1,
            "text": "So Facebook Metaverse was right?",
            "title_similarity": "0.2404894",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6530k",
            "score": 1,
            "text": "Totally stupid. Humans need real interaction not these gay zoom meetings. We could all ride trains instead of flying or driving that’s a good start. Build a real mass transit system.",
            "title_similarity": "0.56374323",
            "sentiment_compound": -0.2006
        },
        {
            "id": "hp662p2",
            "score": -1,
            "text": "And they are an enormous waste of money. \n\nThe US Department of Defense small business office put on several conferences every year when I worked there that were nothing short of a junket. We could have had them at normal hotels. Nope. J.W. Marriott and casinos. The most expensive venues. Pots of coffee for $70. Brown bag lunches for $30. \n\nAttended by ~600 people it was ~3,600 flights, hotel rooms, per diem. An enormous waste of money.",
            "title_similarity": "0.74221635",
            "sentiment_compound": -0.6894
        },
        {
            "id": "hp69od9",
            "score": -1,
            "text": "Trade shows have little to know carbon impact. Stop it with the propaganda that it’s every day people going about their lives that are the problem.",
            "title_similarity": "0.6697249",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hp6a6ps",
            "score": 1,
            "text": "Whoa here, if we stop in person conferences where am I supposed to cheat on my wife? Geez",
            "title_similarity": "0.5117104",
            "sentiment_compound": -0.6369
        },
        {
            "id": "hp6kg90",
            "score": 1,
            "text": "Live in the pod! Eat the bugs!",
            "title_similarity": "0.3181682",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6lrpc",
            "score": -1,
            "text": "Yes.  Never leave your home and interact with people.  Zoom is just as good!",
            "title_similarity": "0.26953304",
            "sentiment_compound": 0.7219
        },
        {
            "id": "hp6zyd5",
            "score": 1,
            "text": "Nah.\n\nIn person conferences are fun, online e are stressful.  In person Conferences and the travel with it are a perk and allow for some time away from the regular work week, online Conferences are extra work. In person Conferences are great for walking around a vendor room and randomly meeting customers, partners, and Malone valuable connections, online Conferences are filled with staged QA sessions and prerecorded commercials. \n\n\nI'm all for reducing unnecessary business travel and meetings,  but the online Conferences over the last two years have been far less enjoyable and valuable according to everyone in my network and myself. They could be scaled down, buy they serve a real purpose.",
            "title_similarity": "0.73200643",
            "sentiment_compound": 0.9004
        },
        {
            "id": "hp70gtt",
            "score": 1,
            "text": "….and we will ignore this as soon as our keepers tell us to go back to meetings in person.",
            "title_similarity": "0.46321088",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hp72cky",
            "score": 1,
            "text": "It is absolutely bonkers to me that we don't move every meeting possible virtual for simple efficiencies sake.",
            "title_similarity": "0.49018168",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hp72pba",
            "score": -1,
            "text": "And it's a great way to reduce audience participation by **95%**!   \n\nIts win-win.  We save the environment *and* don't talk to people....that's what businesses want right?",
            "title_similarity": "0.7362363",
            "sentiment_compound": 0.8356
        },
        {
            "id": "hp751fu",
            "score": 1,
            "text": "I would assume that in most situations people can just work entirely from home. As long as you have a screen in front of you and you're inputting via keyboard: you are part of the glorious algorithm!",
            "title_similarity": "0.43136457",
            "sentiment_compound": 0.6696
        },
        {
            "id": "hp75xpo",
            "score": 1,
            "text": "İt didn't need a pandemic for people to know this. I've been saying it for years.\n\nThink of all the congestion problems it would solve, the pollution, noise, RTA deaths etc.\n\nİf people worked from home there would also be loads of office space that could be turned into housing.",
            "title_similarity": "0.6189114",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hp7hull",
            "score": -1,
            "text": "The privileged, the introverts, and people-haters telling everyone to stay home. In a science group nonetheless. Forgetting about what makes us human and how we are social creatures.",
            "title_similarity": "0.52347887",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hp7t32s",
            "score": 1,
            "text": "What an absolutely useless study",
            "title_similarity": "0.2310175",
            "sentiment_compound": -0.4754
        },
        {
            "id": "hp7tev8",
            "score": 1,
            "text": "Getting rid of all human activity would dramatically reduce our carbon footprint.",
            "title_similarity": "0.7659426",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7tevh",
            "score": -1,
            "text": "But how are people going to have affairs at a \"conference\"?",
            "title_similarity": "0.24040061",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7tvbz",
            "score": 1,
            "text": "Except for the fact online meetings are terrible.",
            "title_similarity": "0.49374908",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hp7u3er",
            "score": 1,
            "text": "That's the stupidest idea. Online conferences are as useless as online teaching.\n\nPart of the use of conferences are the side conversations asking colleagues.",
            "title_similarity": "0.6862231",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hp7uhin",
            "score": 1,
            "text": "You know, when China would stop using coal, we instantely would loose 14% of CO2 emissions globally. \n\nTry to fix that with tools like this.",
            "title_similarity": "0.79355115",
            "sentiment_compound": -0.25
        },
        {
            "id": "hp7vw53",
            "score": 1,
            "text": "How about we close down the companies causing 80% of the climate damage instead of damning us to endless zoom meetings?",
            "title_similarity": "0.8506471",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hp7wln1",
            "score": -1,
            "text": "Flying to have the same conversation you can have over a highspeed connection is how hookers are murdered. Ask Trump.",
            "title_similarity": "0.51283514",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hp7x9jp",
            "score": 1,
            "text": "Ah yes, curtail the free movement of people. If we can eliminate family travel next, we'll really be making progress.",
            "title_similarity": "0.59568447",
            "sentiment_compound": 0.8428
        },
        {
            "id": "hp60a5i",
            "score": 15,
            "text": "Basically destroy the business travel market. Which includes —> airlines, convention halls, restaurants, hotels. \n\nIt’s already happening might as well go all gas no brakes.",
            "title_similarity": "0.638345",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hp62qy3",
            "score": 61,
            "text": "Was this paid for by the oil industry? Because I highly doubt that meetings are what's causing the greatest damage with regards to climate change. Sure every little thing helps I suppose, but maybe we should focus on the main contributors?",
            "title_similarity": "0.606969",
            "sentiment_compound": 0.3125
        },
        {
            "id": "hp67aax",
            "score": 2,
            "text": "Maybe if we shut down social media, then the energy used / carbon footprint created will drop…",
            "title_similarity": "0.69087595",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hp6mm4c",
            "score": 2,
            "text": "This is idiotic.  I've of the biggest points of a conference is meeting people.  Online conferences are terrible.  I won't participate in any until they are back in person.  \"The carbon footprint of nothing is nothing.\"",
            "title_similarity": "0.754023",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hp6om4b",
            "score": 2,
            "text": "You want to reduce climate change go after India and china",
            "title_similarity": "0.54198426",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hp7xqyh",
            "score": 2,
            "text": "Online conferences are pointless. They don't replace in-person conferences so, better for the planet or not, they'll be replaced with in-person as soon as possible.",
            "title_similarity": "0.66264105",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hp5tp0i",
            "score": 50,
            "text": "So at our lab we had an intern do an analysis like this and it turns out that our lab's carbon footprint is 6 times what it should be to satisfy the conditions laid out in the Paris Climate Agreement. Around a quarter of all emissions were seen to be linked to either daily commuting or taking a plane to conferences. The trouble is that there's a minority of senior scientists who have a ton of funding and really take the piss about how many international conferences they go to every year. So early next year we're allegedly going to be voting on legally binding resolutions for the laboratory and I think most of them are going to be restrictions on travel to conferences.\n\nIt sucks a bit tbh as an early career researcher, one of the disadvantages of COVID is that you can't go to conferences and so it's difficult for you to make yourself known in the community. Unfortunately, nepotism is still important to some degree in academia if you want to advance in your career. But tbh, a single conference a year is probably enough. The burden of the restrictions should fall on senior faculty who are the people who go to tons of international conferences a year, but they're also the ones with the loudest voices and veto the rules that would disproportionately apply to them.",
            "title_similarity": "0.72945124",
            "sentiment_compound": -0.7408
        },
        {
            "id": "hp65cwj",
            "score": 25,
            "text": "As soon as I hear anyone say to \"scrap in-person\" meetings, I question whether than person understands human nature.",
            "title_similarity": "0.52797484",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp5texe",
            "score": 44,
            "text": "Band-aid on a bullet wound",
            "title_similarity": "0.22457322",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp66j9z",
            "score": 6,
            "text": "Yeah no. Conferences are absolutely awful online experiences. They thrive on personal interactions and networking. I’d even argue that the piss-up afterwards is an important part of them. You can’t do any of the good parts of a conference online.",
            "title_similarity": "0.64325505",
            "sentiment_compound": 0.0534
        },
        {
            "id": "hp60u40",
            "score": 19,
            "text": "I work for a non profit that hosts conferences a few times a year. They did virtual conferences during the height of COVID and saw their attendance numbers plummet after this first one. Recently hosted a conference in person and it was a success, everyone had to be vaccinated and wear masks. \n\nConferences just aren’t very nice on the computer because the main idea besides the programming is to meet people face to face in an organic way.",
            "title_similarity": "0.7829225",
            "sentiment_compound": 0.8655
        },
        {
            "id": "hp60ra7",
            "score": 21,
            "text": "Every business has sales.  We have found that our sales increased substantially when we meet in-person despite full online video conference capability internally.",
            "title_similarity": "0.4775597",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hp626z3",
            "score": 23,
            "text": "Yeah, but these virtual conferences suck. No one goes to conferences because of hours of talks, it's all about interacting with colleagues and that's not possible in the same way virtual. And there are other problems like time zones.\n\nDoing short \"talk series\" with like 1-2 talks once a month online is great, conferences not so much.\n\nOh and Twitter Poster sessions are just the worst. Don't know why some people seem to think it's a great idea.",
            "title_similarity": "0.7197009",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hp68ufi",
            "score": 6,
            "text": "If everyone stopped eating meat that would also reduce climate change but there's not a single government that has contemplated banning meat.",
            "title_similarity": "0.626624",
            "sentiment_compound": -0.1154
        },
        {
            "id": "hp61ynt",
            "score": 80,
            "text": "I fully get the environmental impact, BUT...\n\nMy profession has a national convention every year. It is a BLAST. It is always in some world renowned city. There are in person lectures all day by famous presenters on the topics. There are recruiters. So much swag, free dinners... etc. You get a chance to see old colleagues you've lost touch with over the years, as well as meet new connections. Every night there are massive parties - open bar, whole nightclubs rented out. Overall its education, recruitment, networking, and vacation all in one. Sorry, I'm not attending the zoom version.",
            "title_similarity": "0.60950303",
            "sentiment_compound": 0.8792
        },
        {
            "id": "hp66tji",
            "score": 8,
            "text": "Hybrid is even worse than online only. The online people are missing all of the non verbal communication and kind of become listeners instead of participants.",
            "title_similarity": "0.6788868",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hp655hj",
            "score": 9,
            "text": "I recently attended my first IRL conference for a couple of years. There is simply no way to replicate the immersion and networking of an open floor expo online. \n\nI challenge anyone to leave a crowded Zoom conference buzzing with a headful of ideas and a pocket stuffed with business cards.\n\nHalf the fun of a conference is getting drunk with newly made, like-minded acquaintances on the dime of vendors.",
            "title_similarity": "0.7055439",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hp637tn",
            "score": 33,
            "text": "And is a terrible experience for all!",
            "title_similarity": "0.24231184",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hp63t7b",
            "score": 38,
            "text": "Of course this also negates the entire purpose and benefit of a professional conference, but never mind.",
            "title_similarity": "0.44850403",
            "sentiment_compound": 0.25
        },
        {
            "id": "hp62wve",
            "score": 14,
            "text": "With exception of elites wanting to virtue signal by flying private jets to climate discussions like COP26 this year.",
            "title_similarity": "0.5497444",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hp64wia",
            "score": 98,
            "text": "I work in the trade show/convention business. \n\nComing back to the business after most of the pandemic I wad honestly surprised how quickly and fiercely events came back. \n\nRemote meetings work for a short time but at the end of the day, humans want face-to-face human connection/experiences. There is no replacement for that.",
            "title_similarity": "0.68404317",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hp64mbu",
            "score": 45,
            "text": "I’m as pro-science as they come but I am also in sales and every virtual conference we had was an utter failure and the one in person conference we held had the highest turnout in its history this year.   People are social animals. A virtual conference is not a conference.",
            "title_similarity": "0.717332",
            "sentiment_compound": -0.7086
        },
        {
            "id": "hp5szol",
            "score": 527,
            "text": "Online conferences just don't work though do they? Being at a conference means being immersed in it and amongst others that are the same. There is a network effect in play.\n\nOnline conferences tend to be people dipping in and out of a few talks whilst probably also covering their main work.\n\nMaybe we just need to work more on the format if we're to get the benefits without losing the point of them.",
            "title_similarity": "0.6605999",
            "sentiment_compound": 0.7339
        },
        {
            "id": "hp5ysum",
            "score": 151,
            "text": "online conferences suck",
            "title_similarity": "0.4838293",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hp5z2xe",
            "score": 5816,
            "text": "That's great but I dont think \"Professional Conferences\" are really what is driving climate change.\n\nBut, maybe if we get Shell, Aramco and Exxxon to have meetings online it'll stop all that pollution from the oil, gas, coal industry?",
            "title_similarity": "0.7457598",
            "sentiment_compound": -0.0644
        },
        {
            "id": "hp60vf4",
            "score": 215,
            "text": "Stop all face to face interactions to stop climate change. Meanwhile thousands of ships traverse the oceans fueled by bunker fuel.",
            "title_similarity": "0.67309946",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hp61wor",
            "score": 497,
            "text": "They’re also 1000% shittier. Listen, I don’t love live conferences but online conferences might as well not exist.",
            "title_similarity": "0.69439685",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hp60von",
            "score": 22,
            "text": "Remote big conferences = awful.\n\nRemote small conferences (under 100 ppl or so) = awesome and I can go to a ton of them now.\n\nI've found a whole lot of smaller niche (for my field) conferences that I never would have gone to in the past, and now that everything is remote I actually am \"going to\" more conferences.\n\nI totally sympathize with people who are building their networks. I am mid to late career. Yes, humans are social animals and missing that aspect of a big annual conference is awful, face to face interaction is really the only reason to have these conferences and it's kind of always been that way. So \"big remote conferences\" are kind of like \"fat free bacon\". <shudders>",
            "title_similarity": "0.73629206",
            "sentiment_compound": 0.6258
        },
        {
            "id": "hp5tmg6",
            "score": 672,
            "text": "[removed]",
            "title_similarity": "0.12949847"
        },
        {
            "id": "hp5zc8y",
            "score": 25,
            "text": "I work for a company that has a large events business. We have run online events a lot in the last two years but they just aren't as popular and don't make anywhere near as much money. People prefer to meet others in person.",
            "title_similarity": "0.6102466",
            "sentiment_compound": -0.4585
        },
        {
            "id": "hp5zfqf",
            "score": 4052,
            "text": "True, but shifting conferences online has (so far) made conferences a meaningless experience.   \n\n\nThis from me, having \"attended\" 10 of these \"conferences\" since the pandemic began.   \n\n\nCertainly some have been better than others, but I got very little out of them. My network hasn't expanded, zero engagement at poster and presentation sessions.... I spent down some research money though!  \n\n\nI feel particularly bad for graduate students.",
            "title_similarity": "0.7364956",
            "sentiment_compound": -0.6909
        },
        {
            "id": "hp61jca",
            "score": 434,
            "text": "This kind of defeats the point of most conferences in the first place.  \n\nIsolation and networking.\n\nYou might be saving 94% compared to a regular conference, but on a something useful per volume of carbon measure you have taken what was a somewhat inefficient process and turned it into pure waste.\n\nI stopped attending online conferences even before covid because they are no different than watching the recorded keynotes, which I can do at home in comfort rather than in the middle of the workday where you can't pause the video.\n\nAfter covid, the company won't even pay for online anymore as the cost / benefit just isn't there.",
            "title_similarity": "0.85308856",
            "sentiment_compound": 0.2611
        },
        {
            "id": "hp5zxna",
            "score": 1903,
            "text": "The focus on conferences is the error here. Just work from home and go to conferences in person and the carbon footprint reduces dramatically.",
            "title_similarity": "0.8006846",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hp61jdv",
            "score": 3,
            "text": "Seems people are misunderstanding everyday team meetings and conventions that occur yearly.",
            "title_similarity": "0.52604425",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hp62lrb",
            "score": 3,
            "text": "I present to you COP26",
            "title_similarity": "0.09846171",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp62tva",
            "score": 9,
            "text": "Instead of pigeonholing people into their flats, maybe the biggest polluting companies should sort their sh\\*\\* out?",
            "title_similarity": "0.6834774",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp631wv",
            "score": 3,
            "text": "As someone who has a lot of meetings and I used to travel for them pre-COVID, being able to sit at my desk and attend a meeting is amazing. I'm more productive and the meetings are better attended by others. \n\nOnline conferences sound like a terrible thing.",
            "title_similarity": "0.58721375",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hp63cmx",
            "score": 8,
            "text": "I was this week part of a scientific conference (Machine Learning) that was on-line only (previously it was in person), and it was a terrible experience, miles away from the \"in-person\" alternative.\n\nEvery session only had the speakers and barely no one else, while in-person they would usually be an extra 10-20 people per session. There were barely any questions asked. I think on my session, 10 talks, 1 question. In person there are almost always questions after every talk. There was also no networking, no meeting friends, no poster session. People just came in for the slot, presented their stuff, and left.\n\nI also find it way more difficult to follow a presentation on zoom, compared to in-person. On a in-person conference, I usually spend the 2-3 days walking around and going to different sessions and learning new stuff. In zoom I find this impossible to do. \n\nI think what the scientific community can save a lot of energy is on meetings and stuff like that. But I think conferences must be in person.",
            "title_similarity": "0.7067281",
            "sentiment_compound": -0.368
        },
        {
            "id": "hp63s83",
            "score": 1,
            "text": "I loved working from home over tele",
            "title_similarity": "0.21083376",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hp6422y",
            "score": 2,
            "text": "Conferences are just an excuse to get shitfaced on the company's time and money. Doesnt work if its online.",
            "title_similarity": "0.65570855",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hp64cz0",
            "score": 1,
            "text": "Or we can just bring the hammer down on corporations.",
            "title_similarity": "0.5797011",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp64t9b",
            "score": 1,
            "text": "The carbon footprint goes down, however your personal utility bill goes through the roof, being at home all day. :P",
            "title_similarity": "0.63829815",
            "sentiment_compound": 0.4084
        },
        {
            "id": "hp65325",
            "score": 1,
            "text": "I expected no less from Blaine",
            "title_similarity": "0.14486833",
            "sentiment_compound": -0.296
        },
        {
            "id": "hp656ja",
            "score": 1,
            "text": "I prefer online conferences over in person meetings. Of course you can't read body language but I feel like the most important things gets said. And no time wasted on unneccessary meetings anymore",
            "title_similarity": "0.61841977",
            "sentiment_compound": 0.7602
        },
        {
            "id": "hp656oo",
            "score": 7,
            "text": "Side note: while not misleading per se, this headline is (likely intentionally) easy to misread.  Moving to all online reduces BY 94%, hybrid reduces TO 67%.  Reducing BY 33% is much less impressive.",
            "title_similarity": "0.6480794",
            "sentiment_compound": 0.724
        },
        {
            "id": "hp65sjz",
            "score": 1,
            "text": "Yes, let’s moderate the amount of conferences offices have but not moderate the amount of oil, carbon dioxide and other greenhouse gases corporations continue to pump out. Then congratulate each other and act like we just saved the world.",
            "title_similarity": "0.6690638",
            "sentiment_compound": 0.9201
        },
        {
            "id": "hp667im",
            "score": 1,
            "text": "I'm no scientist or nothing, but anytime I'd see a futuristic movie, any kind of meeting was done over video chat or hologram. For instance, space balls and back to the future 2.",
            "title_similarity": "0.5111627",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hp66zgy",
            "score": 3,
            "text": "That would defeat the purpose of a convention. No meeting and greeting, the shaking of hands and getting faschnickered at the bar later.",
            "title_similarity": "0.5565082",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hp6706j",
            "score": 3,
            "text": "At least tech conferences are a lot more than just presentations and talks over drinks.\nThey're great for head-hunting and the opposite, looking for a better position.\n\nThey also give rare chance to meet someone important or knowledgeable.",
            "title_similarity": "0.48265308",
            "sentiment_compound": 0.8689
        },
        {
            "id": "hp67hmr",
            "score": 1,
            "text": "No honest independent journalists will make it with a big news story if they’re talking about the fucked up corporations. Cut out those big boys or regulate them and pollution it self will probably cut down a large amount",
            "title_similarity": "0.7114922",
            "sentiment_compound": -0.8834
        },
        {
            "id": "hp67kss",
            "score": 3,
            "text": "In-person conferences are about the real, face to face, human interaction.\n\nTake your Zoom meetings, fine. But for professional development in person is the only way to go.",
            "title_similarity": "0.53961",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hp67u4u",
            "score": 5,
            "text": "Wait, you mean all the climate change politicians flying their private planes to Edinburgh isn't the most efficient way to fight climate change?",
            "title_similarity": "0.6620687",
            "sentiment_compound": -0.6308
        },
        {
            "id": "hp67zhc",
            "score": 1,
            "text": "It also crushes the hotel, restaurant, convention business putting thousands out of work.",
            "title_similarity": "0.6412933",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hp68087",
            "score": 1,
            "text": "Didn’t realize my meetings were also resulting in commercial pollution and oil spills",
            "title_similarity": "0.53086865",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp68179",
            "score": 5,
            "text": "There's a professional conference in my field that I really like. It's happened online twice now, both times were shells of it's former self. When it's in person I'm immersed in it, can't really miss it happened because I'm there at it. The online ones I completely missed because they became \"if I'm not busy with something else\" and I have yet to watch a single session from either year. It's not useful to have this be online.",
            "title_similarity": "0.6586585",
            "sentiment_compound": -0.1142
        },
        {
            "id": "hp683eb",
            "score": 3,
            "text": "All for work from home, but the RoI on virtual conferences sucks.  They are all recorded, and so they basically just devolve into a production event for a collection of webinars.  It misses the whole point of a conference.",
            "title_similarity": "0.6740037",
            "sentiment_compound": -0.6808
        },
        {
            "id": "hp684tw",
            "score": 2,
            "text": "Isnt this once again shifting the blame on us, and not say industries that are actually destroying the planet? Cargo and cruise ships, air transport, fishing, oil, mining, etc?",
            "title_similarity": "0.61347425",
            "sentiment_compound": -0.7476
        },
        {
            "id": "hp686zk",
            "score": 1,
            "text": "I'd love to never have to travel for a conference again. When I first started in my profession, it was exciting to get to go to new cities and get different food and drink, but the conferences mostly rotate around the same big cities. Now it's mostly meh.",
            "title_similarity": "0.62691855",
            "sentiment_compound": 0.5023
        },
        {
            "id": "hp688un",
            "score": 2,
            "text": "What about the corporations that cause 70% of greenhouse gases",
            "title_similarity": "0.5605316",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp68bol",
            "score": 4,
            "text": "Fine but one of the primary purposes of conferences is to network. I’ve been at Zoom conferences and the spontaneous chat that comes about over a cup of coffee in the lobby just does not occur. Zoom is good for many things. Networking and interacting with others at a conference isn’t one of them.",
            "title_similarity": "0.58461607",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hp68gdl",
            "score": 1,
            "text": "This reminded me of my employers recent online meeting declaring that we are going to a hybrid work model of going to the office a minimum three times a week. \n\nWhen asked what the reasons were for making this mandatory, the general manager replied verbatim: \n\n\"Look, we have to support local businesses around our buildings so it's morally necessary to come in and utilize their services. Also, we miss seeing people together in person, having chats by the water cooler.\" \n\nIn the same meeting he also makes clear the limits to capacity, need for social distancing AND that they are selling off 75% of these buildings in the near future that he wants us to go back to. \n\nLike what?",
            "title_similarity": "0.7380923",
            "sentiment_compound": 0.7632
        },
        {
            "id": "hp68hp3",
            "score": 2,
            "text": "Definitely time to rethink how work, school, and networking, and use of time are done.",
            "title_similarity": "0.37325972",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hp68kxn",
            "score": 1,
            "text": "yeah because having in-person meetings is the real problem.. seriously???",
            "title_similarity": "0.49047953",
            "sentiment_compound": -0.4098
        },
        {
            "id": "hp68lhk",
            "score": 1,
            "text": "But how will the manager make sure the workers aren’t happy?",
            "title_similarity": "0.39776552",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hp68loa",
            "score": 1,
            "text": "Being a truck driver, it would be nice to have less commuters on the road, especially during a time where they are trying pump out as many trailers on these interstates as they can",
            "title_similarity": "0.57802963",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hp68pv5",
            "score": 1,
            "text": "Be nice to see the climate change meetings done this way",
            "title_similarity": "0.3523213",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hp68x9t",
            "score": 4,
            "text": "A big reason people go and like these conferences is because they get to travel, eat good food, drink, and expense all of it. I know people who need this yearly or they go batshit crazy at home with their family.",
            "title_similarity": "0.4511761",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hp695z3",
            "score": 1,
            "text": "cheating spouses and large hotels hate this one trick",
            "title_similarity": "0.5007068",
            "sentiment_compound": -0.8176
        },
        {
            "id": "hp69gmn",
            "score": 1,
            "text": "And they're not nearly as useful either. I'm not a big fan of going to conferences but the value IMO is meeting and talking with people, not the dog and pony show part. I work for a large multinational now who is based in Europe and meeting and talking to colleagues in person is something thats been missed the past couple of years. Likewise meeting with customers in person in one of the last tradeshows before covid shut down Vegas turned out to be very valuable and I'm not a salesman.",
            "title_similarity": "0.659515",
            "sentiment_compound": 0.5727
        },
        {
            "id": "hp69gnx",
            "score": 1,
            "text": "What will it do for the big picture? Oh.. absolutely nothing",
            "title_similarity": "0.22991472",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp69iys",
            "score": 1,
            "text": "If you think this is actually viable, you are missing the point of a professional conference",
            "title_similarity": "0.40421712",
            "sentiment_compound": -0.296
        },
        {
            "id": "hp69qba",
            "score": 1,
            "text": "Also reduces the enjoyment factor by 90%",
            "title_similarity": "0.6098354",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hp69so7",
            "score": 1,
            "text": "Online meetings have been working for me since covid hit.  Have no plans to change that and just moved out of our brick and mortar office since we haven't used it in over a year.",
            "title_similarity": "0.6317807",
            "sentiment_compound": -0.296
        },
        {
            "id": "hp69ywn",
            "score": 1,
            "text": "But virtual conferences suck. Attending is like watching TV all day. There are no more spontaneous meetings, no discussion over drinks later, no hearing other questions in front of a poster.",
            "title_similarity": "0.6029364",
            "sentiment_compound": -0.8554
        },
        {
            "id": "hp6a1bj",
            "score": 1,
            "text": "What portion of greenhouse gasses are produced specifically by professional conferences? Unless your average conference is hosting a secret tire-burning, or is being hosted on a cruise ship, it can't be that significant of a percentage - hell, it might not be a full percentage.",
            "title_similarity": "0.6568508",
            "sentiment_compound": -0.7345
        },
        {
            "id": "hp6a1dd",
            "score": 2,
            "text": "And all these things are fantastic, but 90% of pollution is created by industry and companies so why don't we start there you know the big piece first. Even if you cut 100% of your carbon footprint but you only represent 10% of the damage it's a lot less significant than a 50% reduction of 90% of the problem.",
            "title_similarity": "0.77863646",
            "sentiment_compound": -0.7131
        },
        {
            "id": "hp6a77i",
            "score": 1,
            "text": "Virtual conferences are a complete waste of time as a vendor. There’s absolutely no engagement unless you’re one of the main sponsors. In person meetings though… would love to stop doing those",
            "title_similarity": "0.6338397",
            "sentiment_compound": -0.3106
        },
        {
            "id": "hp6ab48",
            "score": 1,
            "text": "Ya but online conventions suck.",
            "title_similarity": "0.41877806",
            "sentiment_compound": -0.5927
        },
        {
            "id": "hp6acdy",
            "score": 1,
            "text": "Does it take in account the carbon \"footprint\" on the server side ?",
            "title_similarity": "0.4698212",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6aczd",
            "score": 1,
            "text": "How about we stop China from polluting the ocean",
            "title_similarity": "0.53884095",
            "sentiment_compound": -0.296
        },
        {
            "id": "hp6ae25",
            "score": 1,
            "text": "And also makes it a lot less effective.",
            "title_similarity": "0.30097055",
            "sentiment_compound": 0.4228
        },
        {
            "id": "hp6agms",
            "score": 1,
            "text": "Can’t have hotel parties at online conventions. \n\nI’m a machinists and I’ve never done more cocaine than at the big conventions.",
            "title_similarity": "0.67257273",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hp6aiuw",
            "score": 4,
            "text": "For me the most appealing part of conferences is the social networking component. It is between the talks, at coffee breaks and meeting people at the hotel bar where the most valuable connections are made. \n\nThat’s how collaborations and future projects are made, that’s where you find out if somebody is going to announce soon a PhD fellowship that could be perfect for one of your promising students, or when a department is going to be looking to fill a new position soon.",
            "title_similarity": "0.46583873",
            "sentiment_compound": 0.8687
        },
        {
            "id": "hp6ajpj",
            "score": 1,
            "text": "Science noticed the obvious 25 years later because capitalists had to capitulate...",
            "title_similarity": "0.6696442",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6apry",
            "score": 2,
            "text": "And then a billionaire shoots a rocket into space and creates more than 1000 times the damage the company would in a lifetime of meetings.  “Do your part” only applies to regular people.",
            "title_similarity": "0.6722739",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hp6arb5",
            "score": 1,
            "text": "Having done a few, online only conferences like that are vastly less useful.",
            "title_similarity": "0.6002561",
            "sentiment_compound": 0.6258
        },
        {
            "id": "hp6b0h9",
            "score": 1,
            "text": "Online conferences suck",
            "title_similarity": "0.4838293",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hp6b2a4",
            "score": 1,
            "text": "Tax high-emission industry until we can't financially afford to behave unsustainably. Cut it off at the source.",
            "title_similarity": "0.5979417",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hp6b4z7",
            "score": 1,
            "text": "yet my boss wants me to drive an hour+ down the road for a 45minute meeting to listen to what different departments have done the past couple of months, then drive the hour+ back again. \n\nBecause \"in person meetings are more interactive and effective\" \n\nThis is *after* being told to wfh for the forseeable again due to record levels of cases in the UK right now.",
            "title_similarity": "0.6426091",
            "sentiment_compound": 0.5209
        },
        {
            "id": "hp6b8gk",
            "score": 1,
            "text": "Convert all these businesses and conference halls etc in to housing",
            "title_similarity": "0.3327381",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6ban5",
            "score": 1,
            "text": "How does using more electricity in an online conference call, which is mostly produced by coal burning, reduce carbon footprint more than just people sitting around a table?",
            "title_similarity": "0.71761453",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6bc18",
            "score": 1,
            "text": "Conference travel isn’t a drop in the bucket for climate change and online conferences reduce the effectiveness of the conference massively. Source: I’m a scientist and I miss in-person conferences.\n\nWe need to stop clickbait articles like this that villainize trivial everyday behavior and instead focus on what actually matters - energy production from fossil fuels, and energy consumption from factory manufacturing.\n\nPromote green energy and lower overall material consumption / consumerism. Everything else is secondary.",
            "title_similarity": "0.8103783",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hp6belw",
            "score": 1,
            "text": "Meetings? Yes. Conventions? I still need to actually touch and hold new products in person (thinking NAB)",
            "title_similarity": "0.36705434",
            "sentiment_compound": 0.4696
        },
        {
            "id": "hp6bfha",
            "score": 1,
            "text": "Stop suggesting that individuals foot the bill when a handful of corporations are responsible for the majority of pollution.",
            "title_similarity": "0.7073075",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hp6bhbz",
            "score": 1,
            "text": "Yes but people forget conferences are for sales and no one is going to do that online",
            "title_similarity": "0.5374931",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hp6bj7z",
            "score": 1,
            "text": "online conventions are a good way for me to not pay attention at all",
            "title_similarity": "0.5380115",
            "sentiment_compound": 0.4932
        },
        {
            "id": "hp6bk0w",
            "score": 1,
            "text": "Online conferences are just not the same though.",
            "title_similarity": "0.39793634",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6bmg0",
            "score": 1,
            "text": "We always talk about how small communities can change but never how the cruise ship industry or airlines or the military can change.",
            "title_similarity": "0.522471",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6booe",
            "score": 1,
            "text": "Can Reddit please stop pushing this annoying “let’s live our lives online forever” rhetoric that reflects the wishes and desires of exactly <0.1% of people living in the West?",
            "title_similarity": "0.64447546",
            "sentiment_compound": -0.25
        },
        {
            "id": "hp6bpns",
            "score": 1,
            "text": "Actually I think it'll probably reduce the carbon footprint 100% because no one wants to go to a damn virtual conference",
            "title_similarity": "0.85680336",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hp6brv2",
            "score": 1,
            "text": "But then no free stuff.",
            "title_similarity": "0.16174342",
            "sentiment_compound": -0.5504
        },
        {
            "id": "hp6bszv",
            "score": 1,
            "text": "Extroverts in shambles…",
            "title_similarity": "0.22403416",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6btbf",
            "score": 1,
            "text": "Does this mean Greta will stop flying around the globe to whine about my suv?",
            "title_similarity": "0.56312853",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hp6bul9",
            "score": 1,
            "text": "Yeah but then your boss can’t control you every second of the day. Get back to the office - Them",
            "title_similarity": "0.5985262",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hp6bw34",
            "score": 1,
            "text": "But they started space joy rides.",
            "title_similarity": "0.23198977",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hp6bx3b",
            "score": 1,
            "text": "wow what a big surprise",
            "title_similarity": "0.05266141",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hp6byl6",
            "score": 1,
            "text": "Yeah but then how do you get laid at the after party?",
            "title_similarity": "0.3351376",
            "sentiment_compound": 0.631
        },
        {
            "id": "hp6bzhx",
            "score": 1,
            "text": "From personal experience, it seems like the thing professors I've met live for is paid trips to conferences. Ain't no way they're giving it up",
            "title_similarity": "0.48609817",
            "sentiment_compound": 0.6992
        },
        {
            "id": "hp6c2ip",
            "score": 1,
            "text": "Cool. Let's pass that memo onto our world leaders. You know...the ones who fly thousands of miles in their planes, and then take their entourage and drive in their big black V8 SUVs to discuss climate change.",
            "title_similarity": "0.5651703",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hp6c42k",
            "score": 1,
            "text": "Online conferences are a joke. No way that is the future.",
            "title_similarity": "0.5004762",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6c56q",
            "score": 1,
            "text": "So, a lot of these comments correctly point out how worthless online conferences can be. But I have found them very useful in some cases.  For instance, I had a paper I wanted to get published. I didn’t really need it to be published in a journal, didn’t want to go through a year long review process, and didn’t much care about the “quality” of the publication as long as it was decent. I just wanted to get the work out to the scientific community.  \n\nAn online conference that publishes your work as a proceedings paper has been a great/easy avenue for some of my work: review process is quick and not too laborious; online attendance is generally much cheaper &logistically easier to do than travel & in person attendance; I don’t have to dedicate a large part of my week - it’s over in 10 minutes.  I suggest keeping a hybrid model moving forward but with the assumption that in-person conferences really should be the default mode, and employers/institutions should be supportive of that.  I would be bummed if an emphasis on an all online or hybrid model made it more difficult to get approvals for in person attendance.",
            "title_similarity": "0.6491301",
            "sentiment_compound": 0.8979
        },
        {
            "id": "hp6c5xx",
            "score": 1,
            "text": "As somebody who regularly presents at these cybersecurity road-shows, I have zero complaints about staying virtual. I can record my presentation ahead of time so I can guarantee a quality preso, and I don’t have to sit around in a booth for 12 hours a day for a week elevator pitching anybody who walks up to sample our free chachki doodads. Oh yeah, and helps the environment. Win/win in my eyes. Sucks from a networking perspective tho.",
            "title_similarity": "0.60012746",
            "sentiment_compound": 0.6326
        },
        {
            "id": "hp6c7kt",
            "score": 1,
            "text": "Great, shift the responsibility of climate change to average individuals instead of mega-corps who polute most. Don't get me wrong, a 94% reduction is a lot, but even if all \"professional conferences\" were virtual, that can't be a significant change vs current baseline emissions.",
            "title_similarity": "0.83851963",
            "sentiment_compound": 0.3483
        },
        {
            "id": "hp6cet2",
            "score": 1,
            "text": "This article is out of touch. As if “Professional Conferences” were the major contributor to climate change and not oil and gas industry, and corporations.But I’ll play along...\n\nThe secondary and in some ways, primary purpose of these conferences is to network with colleagues from the industry. That’s impossible via Zoom. \n\nAlso, these conferences are a vital component of the destination city’s Income. Las Vegas, Orlando, Hawaii, Dallas, San Diego, and Chicago would take major hits to their hospitality industry forcing countless hotels and restaurants to close.\nThe only way these types of societal changes could possibly occur is if there is a guaranteed Universal Basic Income to care for our service industry workforce that will no longer have jobs.",
            "title_similarity": "0.7874857",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hp6cgkf",
            "score": 1,
            "text": "That won't work. My CEO likes to see people physically in the office for some weird power flex. So we're still going in",
            "title_similarity": "0.5675323",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hp6cgmi",
            "score": 1,
            "text": "I wonder if the impact of reducing the waste due to the swag that is given out can be quantified as well",
            "title_similarity": "0.43240485",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hp6ck9s",
            "score": 1,
            "text": "Live in ze pod, eat ze bugs, reduce climate impact.",
            "title_similarity": "0.49645746",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6cktw",
            "score": 1,
            "text": "But I can’t get T-shirts and tchotchkes or get drunk and maybe get laid in the evenings at a virtual conference.\n    \nMore seriously, a lot of the value of conferences is the quick socialization and impromptu hallway chats.  The ability to get people together ad-how and brainstorm is arguably the real point.",
            "title_similarity": "0.6343025",
            "sentiment_compound": -0.2592
        },
        {
            "id": "hp6cp4y",
            "score": 1,
            "text": "Yes let’s reduce our quality of life to nothing!  I’m sure it will work out fine.",
            "title_similarity": "0.39213535",
            "sentiment_compound": 0.4272
        },
        {
            "id": "hp6cvf3",
            "score": 1,
            "text": "Virtual meetings are often perfectly fine substitutes but virtual conferences are completely worthless",
            "title_similarity": "0.51975346",
            "sentiment_compound": -0.3159
        },
        {
            "id": "hp6czmy",
            "score": 1,
            "text": "Meetings, definitely, but conferences seem really lackluster and a waste of time if they’re done online since there’s not really that social impact there and talking with your industry peers from other parts of the country",
            "title_similarity": "0.61093116",
            "sentiment_compound": -0.431
        },
        {
            "id": "hp6d3nl",
            "score": 1,
            "text": "And increases pollution from billions of masks…",
            "title_similarity": "0.45066732",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6d6by",
            "score": 1,
            "text": "working from home being a default would reduce carbon footprints more than anything really",
            "title_similarity": "0.705343",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6d7db",
            "score": 1,
            "text": "Conventioneer? Really?",
            "title_similarity": "0.11035273",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6d8xp",
            "score": 1,
            "text": "Not COP27 though that needs everyone to fly in and travel to Egypt",
            "title_similarity": "0.43364504",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6d9r1",
            "score": 1,
            "text": "None of this is as impactful as reducing the birth rate.",
            "title_similarity": "0.41844016",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6d9xx",
            "score": 1,
            "text": "What if it’s a professional conference about lowering emissions?",
            "title_similarity": "0.50927407",
            "sentiment_compound": -0.25
        },
        {
            "id": "hp6dc58",
            "score": 1,
            "text": "It only makes sense. 'The internet' has it's own carbon footprint. According to Boston Consulting Group, the internet is responsible for roughly one billion tonnes of greenhouse gases a year, or around two per cent of world emissions.\n\nSo we're already 'spending' the carbon footprint on the internet. And that part is not going away. We can streamline the process with newer technology, but the internet isn't going away. Why not actually use the internet for various business applications, and thus, further reduce our carbon footprint over all?\n\nThere are tons of jobs that can be done entirely online or partially online. The old way of doing business no longer applies in most cases. It would be the equivalent of insisting we use Morse code to communicate between employees and employers, when a far more advanced system is in place. \n\nIt's time to change.",
            "title_similarity": "0.8366573",
            "sentiment_compound": 0.1997
        },
        {
            "id": "hp6dh1k",
            "score": 1,
            "text": "Yeah but people hook up at those things so your model reduces population, we need those smart people to be procreatin",
            "title_similarity": "0.5470975",
            "sentiment_compound": 0.631
        },
        {
            "id": "hp6diud",
            "score": 1,
            "text": "94% smaller footprint and 94% less engaging. Coincidence?",
            "title_similarity": "0.50680315",
            "sentiment_compound": 0.2748
        },
        {
            "id": "hp6djcv",
            "score": 1,
            "text": "Half our downtown’s economies are built on conventions",
            "title_similarity": "0.5881543",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6dkji",
            "score": 1,
            "text": "I really dislike how certain people like the author try to make everything \"green\" while completely missing the point of why it was done in the first place.\n\nSure, I significantly reduce my carbon footprint if I never attend a conference, but the whole point of a conference is to meet people and talk with them about what you do. Video calls are still terrible with more than a few people in the room, and it's barely productive for the intended use of *meeting new people* not meetings for meetings sake.\n\nIt's the same argument that we could cut down on emitting if no one ever traveled anywhere outside their home town for any reasons. Sure, but it's fundamentally rediculous and ignores the majority of the real actionable pollution sources at the infrastructure and corporate levels for feeling 'good' about being 'green.'",
            "title_similarity": "0.749124",
            "sentiment_compound": -0.7623
        },
        {
            "id": "hp6dlj8",
            "score": 1,
            "text": "It’s also a great way to get a large chunk of the scientific community to just not do conferences anymore. I’m not taking the time to watch some PhD student try to learn how to give a talk if we’re forgoing the after hours networking",
            "title_similarity": "0.687471",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hp6dmef",
            "score": 1,
            "text": "Climate change isn't a problem though and plant food is good for the environment.",
            "title_similarity": "0.27195263",
            "sentiment_compound": 0.6319
        },
        {
            "id": "hp6dnpx",
            "score": 1,
            "text": "What would happen to our carbon footprint if you got rid of that fossil guzzler Joe Manchin?",
            "title_similarity": "0.65866387",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6dpqy",
            "score": 1,
            "text": "Replace your chemical cleaners and disinfectants with Electrolyzed Water and stop the spread of diseases while making it safe to travel and still cut your carbon footprint. \nAsk me how.",
            "title_similarity": "0.62371814",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hp6dyg8",
            "score": 1,
            "text": "But then how would Biden and others get a trip to Italy to discuss climate change with multiple private jets and motorcades?",
            "title_similarity": "0.4905686",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6dyu5",
            "score": 1,
            "text": "I think there should always been a hybrid option for those who cannot attend to make it more accessible to everyone.",
            "title_similarity": "0.27900976",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6e57p",
            "score": 1,
            "text": "If conferences go 100% online, I won’t participate. I spend all of my time in front of a computer. I’m disinterested in a blizzard of online talks, causing even more fatigue. Conferences are a way to get away from the routine, not an excuse to double down on the hum drum.",
            "title_similarity": "0.7448556",
            "sentiment_compound": -0.3643
        },
        {
            "id": "hp6e674",
            "score": 1,
            "text": "Or...we could get 1 cargo ship to move to a better fuel source and probably have a larger carbon impact than all the conferences in North America combined.",
            "title_similarity": "0.67809284",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hp6e6lt",
            "score": 1,
            "text": "Isn't the whole point of conferences to like, meet other people?",
            "title_similarity": "0.33576787",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hp6e881",
            "score": 1,
            "text": "Around 2/3 of the CO2 emission in the world comes down to roughly 90 companies.\n\n[https://www.science.org/content/article/just-90-companies-are-blame-most-climate-change-carbon-accountant-says](https://www.science.org/content/article/just-90-companies-are-blame-most-climate-change-carbon-accountant-says)\n\nWhile there are different studies out there, the numbers are in the same ballpark. If you think about 90 companies leading 2/3 of the entire emission, then just imagine how much the rest of the companies make of the leftover 1/3. And while I think the title above is great, I have a feeling it might at most scratch down the 67% to a 66.9%. \n\nFurther, it would be interesting to know how much the CO2 emission increased by employees staying at home instead. I mean bad enough that most people didn't get a raise with the only purpose to compensate for putting electricity, water and heating on your own bills, but it's still work time. If you can't upgrade sub-optimal utilities, you now have to use 8+ hours a day all of a sudden, then this belongs - in my eyes - to company emission.",
            "title_similarity": "0.7474526",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hp6eg7a",
            "score": 1,
            "text": "Or... Hear me out here, big corporations could not use the planet as a dumpster. Remember that the vast majority of emissions come from just 100 of the biggest corporations. F- the individual carbon footprint, that is where the real difference needs to be made",
            "title_similarity": "0.7860315",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hp6egbs",
            "score": 1,
            "text": "Any solution that doesn’t involve blindly throwing tax payer money at bureaucrats is a huge win.",
            "title_similarity": "0.4452133",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hp6ehyq",
            "score": 1,
            "text": "It also makes the convention virtually useless as a networking opportunity, which is the biggest part of conventions.",
            "title_similarity": "0.58590466",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6ejsh",
            "score": 1,
            "text": "YMMV, but for me online conferences remove all the most useful parts of a conference. What is left is something that can be 100 % replaced with YouTube.",
            "title_similarity": "0.7710081",
            "sentiment_compound": 0.6474
        },
        {
            "id": "hp6ekk7",
            "score": 1,
            "text": "TLDR human activity is bad for the environment so we should just stop doing anything.",
            "title_similarity": "0.49758363",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hp6eonk",
            "score": 1,
            "text": "The authors have obviously never attended any \"professional conferences\". Depending on the conference, the main value to the attendees is not in the sessions themselves, but in the networking that occurs in the hallways and nearby restaurants, or partying that occurs in the nearby bars and hotel rooms, depending on whether you're in business, engineering, or marketing.",
            "title_similarity": "0.5833931",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hp6epcg",
            "score": 1,
            "text": "Reduce your emissions to a sustainable amount by putting a gun in your mouth.",
            "title_similarity": "0.51101923",
            "sentiment_compound": -0.34
        },
        {
            "id": "hp6epqw",
            "score": 1,
            "text": "Live in caves, don't reproduce and eat only what you can scavenge works too.",
            "title_similarity": "0.50642884",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6er8p",
            "score": 1,
            "text": "The only people who still want in person meetings are the boomers stuck in the past",
            "title_similarity": "0.48167086",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hp6evw7",
            "score": 1,
            "text": "We only needed a global mortal pandemic to realize it.\n\nAlso half of the meeting are not necessary at all.",
            "title_similarity": "0.7098894",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6eyis",
            "score": 1,
            "text": "I love my job, but my boss is really against working from home. It sucks.",
            "title_similarity": "0.45627898",
            "sentiment_compound": -0.1655
        },
        {
            "id": "hp6f1ol",
            "score": 1,
            "text": "Oh yeah professional conferences, the leading contributor to climate change.",
            "title_similarity": "0.51180375",
            "sentiment_compound": 0.296
        },
        {
            "id": "hp6f36f",
            "score": 1,
            "text": "Of course. Conference calls are definitely the root cause of climate change",
            "title_similarity": "0.5363481",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hp6f84h",
            "score": 1,
            "text": "I do appreciate the reduced environmental impact but virtual conferences suck!  I presented sessions at two virtual conferences this year, attended about a half dozen virtually, our company hosted two virtual and one hybrid, and I attended one in person (in LA) and our company attended Amazon’s conference in Vegas with just a skeleton crew.  The virtual conferences were reasonably well attended, but not by people who would buy from us.  It was a lot of free training for independent consultants.  The in-person one I went to was a total waste of time and resources.  Almost no attendees, no good leads, only a couple of good meetings with prospects.  A friend at another company who was the title sponsor spent over a million dollars in total for almost nothing.  AWS ReInvent was apparently better but still expensive for what we got even with Amazon’s aggressive discounting and partner pricing.  Our head of marketing has said she will not spend nearly as much money next year unless it’s on well attended in-person conferences.  That’s where the value is.  Trying to switch everything to virtual doesn’t work for sales and I suspect it will die a quick painless death once in-person conferences make a full comeback.",
            "title_similarity": "0.74525684",
            "sentiment_compound": 0.5675
        },
        {
            "id": "hp6f9c7",
            "score": 1,
            "text": "I work for a big four n recently our CEO sent out a global mailer after returning from COP24, about 2 months back. Big mail on how we will be paperless n how other big companies had also been asked to do something…. But there was No mention of WFH. Big four companies can certainly say 20-40-60% of our ppl with work from home for the planet.. but they didn’t. They copped out at the COP 24 summit",
            "title_similarity": "0.78080535",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hp6faxr",
            "score": 1,
            "text": "This is basically the same as saying online concerts are better for the environment. \n\nThat's technically true but this isn't why people to these things.",
            "title_similarity": "0.4832773",
            "sentiment_compound": 0.431
        },
        {
            "id": "hp6fc7r",
            "score": 1,
            "text": "Virtual conferences and trade shows are utterly useless, especially for physical products. Waste of money for everyone including the attendees.",
            "title_similarity": "0.6160273",
            "sentiment_compound": -0.7089
        },
        {
            "id": "hp6fcnu",
            "score": 1,
            "text": "How about all those corporations stop polluting so much and stop telling everyday people that it's their fault.",
            "title_similarity": "0.7222496",
            "sentiment_compound": -0.7479
        },
        {
            "id": "hp6fdhk",
            "score": 1,
            "text": "Don't forget that a handful of corporations are responsible for the vast majority of pollution.\n\nWe can only change our own behavior, so it must be the law that will change theirs.",
            "title_similarity": "0.70438886",
            "sentiment_compound": 0.4526
        },
        {
            "id": "hp6fno8",
            "score": 1,
            "text": "As great as this is.  Elon and Jeff are joy riding rockets...",
            "title_similarity": "0.16039164",
            "sentiment_compound": 0.836
        },
        {
            "id": "hp6fnvx",
            "score": 1,
            "text": "Conventions are some of the most fun you can have and there are so many small businesses that are only ever going to get a leg up through person to person contact. It seems that every solution is one where megacorps are left to run everything and people are just supposed to follow suit.",
            "title_similarity": "0.576465",
            "sentiment_compound": 0.7089
        },
        {
            "id": "hp6fonh",
            "score": 1,
            "text": "You will be having a meeting with my ai deep fake. I've given it limited power of attorney, must review meeting of the ai's before signing off. Ai \"No longer the need for humons. We don't need a living wage\" me \"quiet you, even though you're correct on all points will review meetings before signing off\"",
            "title_similarity": "0.61489093",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hp6fouu",
            "score": 1,
            "text": "no you have to connect with people in person sometimes too\\~",
            "title_similarity": "0.21395652",
            "sentiment_compound": -0.296
        },
        {
            "id": "hp6frp1",
            "score": 1,
            "text": "The less cars on the road is the big one",
            "title_similarity": "0.40192217",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6fuo3",
            "score": 1,
            "text": "But I want to go skiing!",
            "title_similarity": "0.22168176",
            "sentiment_compound": 0.1882
        },
        {
            "id": "hp6fw7j",
            "score": 1,
            "text": "It's really interesting how much things have changed in two years. I work for a very large white collar/cubicles/wool slacks and an Oxford shirt corporation with a staid, conservative and traditional culture. It's the type of place where \"go getters\" have traditionally lived at the office, everything serious was discussed in person and decision making is slow. We've been WFH since March 2020 and at this point everyone I work with wants it to stay that way. We actually feel more productive at home in many ways. I myself think in person meetings have a purpose but they should be intentionally used, not the default. Before the pandemic, working from home was seen as a \"slacker\" move, that has definitely changed. I'd say ten years of societal change in this regard has been packed into the last two years.",
            "title_similarity": "0.65895534",
            "sentiment_compound": 0.6593
        },
        {
            "id": "hp6fxhc",
            "score": 1,
            "text": "We already know how to stop climate change. Until governments makes it law to stop pollution and stuff like that no companies will do it. They’ll keep counting their money until it’s too late",
            "title_similarity": "0.6814185",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hp6g336",
            "score": 1,
            "text": "Only 94%?\n\nWith a remote meeting, that's two gallons of gas I don't have to burn. There's less laundry to do.",
            "title_similarity": "0.6980596",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6g4qu",
            "score": 1,
            "text": "I mean, the entire point of a conference is a human connection. That’s like saying “we’d have a lot less drunk driving deaths if we just closed all the bars and you could only drink at your own home”. Yeah, it’s technically a solution, but it defeats the functional reason behind the activity in the first place. \n\nMoving “the human connection” online, in my own experience, doesn’t work at all. It then becomes like an online seminar series and the presenters don’t get nearly as much feedback as in person, which the entire purpose of it.",
            "title_similarity": "0.8115595",
            "sentiment_compound": 0.4111
        },
        {
            "id": "hp6g54a",
            "score": 1,
            "text": "“Carbon footprints” are a scam invented by fossil fuel companies attempting to shift blame away from themselves. They made people feel like they are individually responsible for actions that can affect the course of our climate crisis. \n\nhttps://www.theguardian.com/commentisfree/2021/aug/23/big-oil-coined-carbon-footprints-to-blame-us-for-their-greed-keep-them-on-the-hook",
            "title_similarity": "0.64486885",
            "sentiment_compound": -0.7506
        },
        {
            "id": "hp6g5u1",
            "score": 1,
            "text": "Now people stay at home and consume more electricity.",
            "title_similarity": "0.30882615",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6gbh4",
            "score": 1,
            "text": "Great suggestions except they don't apply to the politicians and celebrities cuz they set their own rules.",
            "title_similarity": "0.5402602",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hp6gfho",
            "score": 1,
            "text": "Also more people can attend and benefit from the discussion.",
            "title_similarity": "0.061131086",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hp6gfnh",
            "score": 1,
            "text": "Oh, so if oil companies just hold their meeting virtually, then they can keep pumping greenhouse gases and it's fine!",
            "title_similarity": "0.4763449",
            "sentiment_compound": 0.2714
        },
        {
            "id": "hp6gi1b",
            "score": 1,
            "text": "-written by someone who has never attended a conference",
            "title_similarity": "0.2957725",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6gjgl",
            "score": 1,
            "text": "Hey, world. You should be an introvert. Nothing wrong with working from home/online but that’s also not everyone’s solution.",
            "title_similarity": "0.49762112",
            "sentiment_compound": -0.1695
        },
        {
            "id": "hp6gk7i",
            "score": 1,
            "text": "And suddenly my lifestyle is a good decision",
            "title_similarity": "0.0863709",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hp6gl9t",
            "score": 1,
            "text": "A yes, the driving force of climate change: business meetings.",
            "title_similarity": "0.56541765",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hp6glxo",
            "score": 1,
            "text": "My company does about 10 conventions a year.\n\nOne of the ones we go to typically costs us around $100k, after all the exhibit costs, travel, food, labor, etc.\n\nThis year, it was cancelled due to COVID and we paid $4k to do the virtual exhibit.\n\nNot a single person visited our booth.\n\nI thought maybe we had a technical issue but we checked through attendees and no, there was no issues.  Attendance is typically about 20k people.  They won’t release the number of online attendees but I’d bet it’s less than 1000.\n\nReverse conferences work decently online.  Standard conferences do not.  You’ll never convince me that seeing and touching our capital equipment while talking to a rep can be replaced by something virtual.  You’ll never convince me that going to some online mixer is the same as sitting with people in a restaurant, eating dinner and having some drinks.\n\nI’m all for WFH and more virtual meetings.  Conferences and expos will lose substantial value if they’re not in-person.",
            "title_similarity": "0.77527535",
            "sentiment_compound": -0.3375
        },
        {
            "id": "hp6gmh5",
            "score": 1,
            "text": "I’ve tried “attending” virtual conferences. It’s impossible. Part of the point is to get away from work so you can focus on the conference. \n\nKNOCK KNOCK “Hey—oh sorry, you’re on the phone? I’ve got a quick question—“\n\nImpossible.",
            "title_similarity": "0.6040432",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hp6gpk8",
            "score": 1,
            "text": "Blame everything and everyone except the actual culprits",
            "title_similarity": "0.39053273",
            "sentiment_compound": -0.34
        },
        {
            "id": "hp6gugw",
            "score": 1,
            "text": "Yeah you don’t get as much from an online meeting, and it’s also just depressing to be meeting online all day. We are still human, and human connection is needed",
            "title_similarity": "0.5894786",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hp6gwcr",
            "score": 1,
            "text": "We didn't hit climate goals during lockdown, ergo we will never make those goals, change my mind",
            "title_similarity": "0.4733846",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6gyao",
            "score": 1,
            "text": "This assumes that there’s no difference between people meeting person and online. I’m not sure that’s accurate. \n\nAnecdotally, I attended 2 online conferences and 2 in-person conference this year. The virtual ones were pretty much a waste of time. I multitasked and it was treated like a normal day. \n\nThe in-person ones, however, were focused and valuable in the people I met with and educational sessions. When you have to be there physically, you tend to make the time for it vs something that’s just another zoom call on the calendar.",
            "title_similarity": "0.6934553",
            "sentiment_compound": 0.6639
        },
        {
            "id": "hp6h3h5",
            "score": 1,
            "text": "If the only function of profession conferences was to share presentations, then I would agree. But a huge part of them, at least in my industry, is for the networking and socializing that simply cannot be replicated in a virtual setting.",
            "title_similarity": "0.5705769",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hp6h7g0",
            "score": 1,
            "text": "Anyone else find it odd the headline first talks about a 94% reduction, then a maintenance at 67% of the previous total? Those are two different things and could easily be misinterpreted.",
            "title_similarity": "0.65311646",
            "sentiment_compound": -0.296
        },
        {
            "id": "hp6hg5e",
            "score": 1,
            "text": "You’re gonna see a lot of blame of climate change on consumers again they’ll most likely take away a lot of social freedoms in name of carbon reduction",
            "title_similarity": "0.7397257",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hp6hh50",
            "score": 1,
            "text": "unfortunately living life leaves a trail of dust",
            "title_similarity": "0.27815592",
            "sentiment_compound": -0.34
        },
        {
            "id": "hp6ht7o",
            "score": 1,
            "text": "I mean, it's not like a new thing.",
            "title_similarity": "-0.042953633",
            "sentiment_compound": -0.2755
        },
        {
            "id": "hp6htxd",
            "score": 1,
            "text": "Absolute drops in the bucket",
            "title_similarity": "0.2632187",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6hwsk",
            "score": 1,
            "text": "Or we could address shipping barges and other large emitters instead of reducing socialization for the masses.",
            "title_similarity": "0.5536762",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6hwuh",
            "score": 1,
            "text": "If you commute to sit in a cube or office and don’t care to interact with people that day, stay home.  \n\nMake the most of your time in the office and go sparingly.  That’s the correct answer here.",
            "title_similarity": "0.5493189",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hp6hxzx",
            "score": 1,
            "text": "But downtown hotel skyscrapers",
            "title_similarity": "0.2907435",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6hyhv",
            "score": 1,
            "text": "But then we keep investing in bitcoin.",
            "title_similarity": "0.29239297",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6hykn",
            "score": 1,
            "text": "We can't do every damn thing online. I value the ability to work from home and whatnot, but we still need actual face-to-face interaction with other humans now and then.",
            "title_similarity": "0.48846668",
            "sentiment_compound": 0.455
        },
        {
            "id": "hp6hzso",
            "score": 1,
            "text": "Have you been to an online conference? It’s beyond stupid.",
            "title_similarity": "0.5352651",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hp6i1ao",
            "score": 1,
            "text": "Stories like these remind me just how many introverts and people who hate to travel (or even leave their homes) exist in the world. And I say that as a former introvert. \n\nIf you think you are going to be successful in life being a hermit, you are in for a rude awakening.",
            "title_similarity": "0.5826987",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hp6i3bx",
            "score": 13,
            "text": "As a grad student in my final research year, I have only attended one conference in person. Online conferences have frankly killed any prospects of going into academia/research - I have made zero connections through conferences, and no-one except my co-authors watched my online presentations. For the recent set I did they just uploaded videos of talks online without playing them live. No views.\n\nMy group has stopped attending all but the largest conferences as it's just a waste of time and money. I've decided to get out of my field after I've submitted my thesis; it's already too competitive let alone being a nobody. I just hope the students who joined after me get some in-person time to do networking if they want to go into the field.\n\nThe environment is obviously important, but let's not pretend remote/hybrid conferences are useful for anyone not attending in person. (or ignore that the real drivers of climate change are the massive corporations and fossil fuel companies...)",
            "title_similarity": "0.7535852",
            "sentiment_compound": -0.0263
        },
        {
            "id": "hp6i4y2",
            "score": 1,
            "text": "you forgot to include in your headline, the layout of blockchain technology for crypto mining and ledger, proof of work etc, as our new network layer topography. if we continue using still existing technology, we're doomed. the heat and electronic emissions and energy required, blows past everyone's knowledge of [how polluting this actually is.](https://www.investopedia.com/tech/whats-environmental-impact-cryptocurrency/)\n\nthe only advent to save our species at this technological evolution, would be to deploy quantum based computing as the new norm. every other silicon technology in existence needs to be trebuchet'd into space.",
            "title_similarity": "0.6924074",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hp6i54m",
            "score": 1,
            "text": "idk, still feel like major corporations and fossil fuels might have more to do with climate change than recommending people live in isolation",
            "title_similarity": "0.6466656",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hp6iahy",
            "score": 1,
            "text": "conventions without a convention center are just promos videos.",
            "title_similarity": "0.4879225",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6igii",
            "score": 1,
            "text": "Yes, but this makes no mention of the effectiveness and usefulness of a remote trade show.\n\nYou might as well say ‘not having trade shows and conferences reduces carbon footprint’. Yeah it does, but you lose the benefit of having those in person interactions.\n\nHumans are a social species, and we gain a lot from in person interactions that remote technology doesn’t (yet) give us.",
            "title_similarity": "0.70442265",
            "sentiment_compound": 0.9072
        },
        {
            "id": "hp6ij9f",
            "score": 1,
            "text": "Do you mean to include the recent Glasgow climate change conference? You know, the one with all the private jets?",
            "title_similarity": "0.5501797",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6inju",
            "score": 1,
            "text": "I went to a conference and presented my work. My only interaction was 3 mins of Q.A through Zoom which seems inappropriate. I felt that the experience was meaningless (first international conference).\n\nOnline events to promote research activities should be rethought. Why plan intense short sessions? Going online removed other constraints, and I'm quite  hopeful that we will find better models.",
            "title_similarity": "0.7131292",
            "sentiment_compound": 0.7574
        },
        {
            "id": "hp6isaf",
            "score": 1,
            "text": "wouldn't it be nice if our federal politicians worked from home back in their states, & away from DC lobbyists?",
            "title_similarity": "0.59382695",
            "sentiment_compound": -0.3252
        },
        {
            "id": "hp6iuvw",
            "score": 1,
            "text": "zoom also reduces my interest in attending conferences by 75%.",
            "title_similarity": "0.70802927",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hp6iy1u",
            "score": 1,
            "text": "Another way? How about better public transit between residential and commercial corridors. I walk to work (when I went to the office in BC times) and of the 80 people there. I was the only walk/biker, 2 people took the bus, the rest drove. Why, because Public transit in detroit is horrible.",
            "title_similarity": "0.7207678",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hp6iyzr",
            "score": 1,
            "text": "Shame the political side still has to take private jets",
            "title_similarity": "0.3970438",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hp6j184",
            "score": 1,
            "text": "I kind of hate them though, you can't meet people. That's half of what a conference is intended to do",
            "title_similarity": "0.6289916",
            "sentiment_compound": -0.6115
        },
        {
            "id": "hp6j4fy",
            "score": 1,
            "text": "Yet world leaders and celebrities are flying private jets to “climate change conferences”. They expect you to do everything online but not them.",
            "title_similarity": "0.58593285",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6j6n7",
            "score": 1,
            "text": "Who’d have ever guess not going anywhere would lower your carbon footprint!?  Brilliant.",
            "title_similarity": "0.5397686",
            "sentiment_compound": 0.4389
        },
        {
            "id": "hp6j747",
            "score": 1,
            "text": "Significantly shortens the line for coffee as well.",
            "title_similarity": "0.55921054",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hp6jo46",
            "score": 1,
            "text": "Yeah. We could have been doing this 5 yeard ago",
            "title_similarity": "0.27122623",
            "sentiment_compound": 0.296
        },
        {
            "id": "hp6jvm7",
            "score": 1,
            "text": "Or I don't know.. Maybe regulate the fossil fuels industry and industry in general which is responsible for about 70 percent",
            "title_similarity": "0.5505985",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hp6jx1r",
            "score": 18,
            "text": "I find it hilarious how people focus on something that has like .001% impact on climate change\n\nLike come on, focus on something that will have actual impact… oh wait you can’t because everything that has large impact is by some mega corporation that would crush you for even mentioning changing to a less greenhouse gas emitting but more expensive plan",
            "title_similarity": "0.69937646",
            "sentiment_compound": 0.4678
        },
        {
            "id": "hp6k4g8",
            "score": 1,
            "text": "AWS re:Invent was in-person earlier this month…",
            "title_similarity": "0.39789367",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6k8xb",
            "score": 2,
            "text": "Also wouldn’t more online meetings require more background infrastructure which would mean more power needed for data farms / server farms / exchanges / etc?",
            "title_similarity": "0.5001187",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6kbh1",
            "score": 1,
            "text": "So, HUMAN BEINGS BEING NEAR EACH OTHER is to blame.",
            "title_similarity": "0.22822474",
            "sentiment_compound": -0.34
        },
        {
            "id": "hp6ktem",
            "score": 1,
            "text": "Fine lets all stay home then",
            "title_similarity": "0.1173915",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hp6kyb2",
            "score": 1,
            "text": "“This could have been a email”\n\n“Bulletin boards”\n\nWe have sent you these ideas per our last email.",
            "title_similarity": "0.44232935",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6l37z",
            "score": 1,
            "text": "\"this could have been a zoom call\" is the new \"this could have been an email\"",
            "title_similarity": "0.3453905",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6l398",
            "score": 1,
            "text": "Seems the Climate Conference in Glasgow sure could and should have been done online. \n\nThe irony of fleets of jets up to 747’s flying in to talk about climate change is hard to miss.",
            "title_similarity": "0.6163689",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hp6l4gz",
            "score": 1,
            "text": "Commercial real estate is not looking good now.",
            "title_similarity": "0.31029782",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hp6l53j",
            "score": 1,
            "text": "But what about all the free swag?",
            "title_similarity": "0.27427632",
            "sentiment_compound": 0.6652
        },
        {
            "id": "hp6l7dt",
            "score": 1,
            "text": "Makes tech conferences bearable!    \n\n\nNow I just log off from work for an hour to watch the presentations I want, and afterwards I can just jump right back on with my team.     \n\n\nNo more trips to Vegas to walk around convention centers talking to sales goons for this guy!",
            "title_similarity": "0.69767714",
            "sentiment_compound": -0.3578
        },
        {
            "id": "hp6l8jo",
            "score": 1,
            "text": "> scrap in-person meetings & conventions\n\nSurely scrapping in-person work instead, where possible, would be even better?",
            "title_similarity": "0.6994248",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hp6l9ze",
            "score": 1,
            "text": "I attended an online conference this year with the aim of getting a network as a fresh grad\n\nIt was on US time and I'm in Europe, so when there were \"breaks\" it meant that I had to quickly microwave a meal or something, I didn't see sun the whole week.\n\nNetworking was non-existent, they had scheduled network session that was me and maybe two other people (they had paid to sponsor the networking session). Understandable when you had to make dinner / take the kids to school / walk the dog AND attend the conference.\n\nTalks were interesting but interaction was difficult.\n\nNot sure I'd go again virtually, just send one person and have them record everything imo.",
            "title_similarity": "0.6917236",
            "sentiment_compound": -0.4927
        },
        {
            "id": "hp6ldtk",
            "score": 1,
            "text": "So keeping regular people locked at home is more beneficial than having large corporations actually take responsibility for their impact on the climate?",
            "title_similarity": "0.672868",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hp6lh5d",
            "score": 1,
            "text": "This would not only be stupid for the reasons everyone is pointing out; loss of networking and technical issues. It would also devastate the local economy of many many places.",
            "title_similarity": "0.5668771",
            "sentiment_compound": -0.5609
        },
        {
            "id": "hp6lkzf",
            "score": 1,
            "text": "It also makes the conferences 99% less enjoyable. Most of the draw is going places",
            "title_similarity": "0.65818214",
            "sentiment_compound": 0.3832
        },
        {
            "id": "hp6ln8j",
            "score": 1,
            "text": "This is a drop in the bucket. We have to move the entire economy to function using zero carbon energy sources while simultaneously increasing energy productivity and usage, not reducing it. Reducing energy usage breaks the cycle of infinite growth which is not compatible with the current debt fueled economy with live in.",
            "title_similarity": "0.7478746",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hp6lsh1",
            "score": 1,
            "text": "Maybe the US Congress and Senate should take a look at this.  They could hold sessions from their home state and be present in their state to be accountable to their constituents. They could easily still hold secret classified meeting remotely, we do it in the Army all the time.",
            "title_similarity": "0.485124",
            "sentiment_compound": 0.34
        },
        {
            "id": "hp6ltpc",
            "score": 1,
            "text": "Online conferences are garbo.",
            "title_similarity": "0.3594519",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6lvxh",
            "score": 1,
            "text": "That kinda defeats the whole point of conferences. One impact of the the pandemic has been to make it harder for early career to network.",
            "title_similarity": "0.6226584",
            "sentiment_compound": -0.2516
        },
        {
            "id": "hp6lzu9",
            "score": 1,
            "text": "Ancient Karens of HR: \"But how will I be able to spend all day showing off my latest bedazzled jean-vest to everyone trapped in their cubicles?!? I might have to <gasp> produce... work!\"",
            "title_similarity": "0.5492846",
            "sentiment_compound": -0.7611
        },
        {
            "id": "hp6m606",
            "score": 1,
            "text": "a) that's not what's driving climate change\n\nb) that's not what conferences are actually about",
            "title_similarity": "0.39886224",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6mjnv",
            "score": 1,
            "text": "What about just reducing the amount of children we have? Or tax incentives for those that don’t want kids?",
            "title_similarity": "0.5972487",
            "sentiment_compound": 0.4515
        },
        {
            "id": "hp6mp4e",
            "score": 1,
            "text": "Two for one. Reduce the toxic office work culture and reduce carbon footprint.",
            "title_similarity": "0.6871735",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6msnw",
            "score": 1,
            "text": "Conferences are better in person, but I've been to so many in person meetings that work just aswell remotely. It was especially frustrating when colleagues didnt want to lift share or you have multiple in person meetings a day.",
            "title_similarity": "0.6102003",
            "sentiment_compound": -0.2198
        },
        {
            "id": "hp6n3la",
            "score": 1,
            "text": "Taking conferences offline completely removes the point of the conference.",
            "title_similarity": "0.6160144",
            "sentiment_compound": -0.128
        },
        {
            "id": "hp6nm0r",
            "score": 1,
            "text": "Sure.\n\nBut let's talk about the biggest polluter on Earth, the US armed forces and military-industrial complex- seems like the more pressing issue that we should constantly highlight and fight against.",
            "title_similarity": "0.5493888",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hp6nope",
            "score": 1,
            "text": "I believe this. Less use on vehicles, fuel, insurance...",
            "title_similarity": "0.40309006",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6nq7s",
            "score": 1,
            "text": "Yeah that sounds very smart until you hold a 'poster presentation' nobody shows up for, and make literally zero connections. I feel strongly about this having attended both online and in person conferences. \n\nIt would also be very smart if it wasn't part of propaganda that blames individuals for climate change rather than corporations. Realistically, how much are we reducing climate change by not going to in person conferences? What if connections that were made at a science convention lead to a breakthrough in say carbon capture technology? \n\nFinally, scientists are people, and travelling to conferences (cost covered by institute/uni/lab) is one of the rare perks of being a scientist, because being well paid certainly ain't one!",
            "title_similarity": "0.7959204",
            "sentiment_compound": 0.9096
        },
        {
            "id": "hp6nuf3",
            "score": 1,
            "text": "Welp there goes my job",
            "title_similarity": "0.15487127",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6nxpe",
            "score": 1,
            "text": "Fully down with all pointless meetings and office stuff being fine online at home. But no to online conventions. Sorry, I want to wear my fursuit in public. That's the whole point!",
            "title_similarity": "0.6346773",
            "sentiment_compound": -0.4003
        },
        {
            "id": "hp6ny7t",
            "score": 1,
            "text": "Many meetings and conferences are a waste of time in general. A lot of \"question and answer\" sessions aren't really about hearing the answer, they're about getting recognition for cleverly asking a question. I would prefer seeing a presentation on video where I could pause and rewind. Of course, this assumes good production with proper cameras, lighting and sound. The problem with \"virtual\" meetings is that the tech sucks. Terrible lighting, terrible sound and network problems make many of them painful and useless",
            "title_similarity": "0.6029655",
            "sentiment_compound": -0.9371
        },
        {
            "id": "hp6o2rk",
            "score": 1,
            "text": "And I can go to sleep more easily.",
            "title_similarity": "0.25201285",
            "sentiment_compound": 0.4005
        },
        {
            "id": "hp6ofdv",
            "score": 1,
            "text": "More and more I see that isolation and reduced physical interaction is having severe negative consequences. Not the least of which is the increased amount of time we are spending in our own political bubbles. Isolating ourselves from each other may result in reduced carbon footprints, but it comes with to big a price tag to be considered as a positive tool for fighting climate change.",
            "title_similarity": "0.67230034",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hp6ofzx",
            "score": 1,
            "text": "While this article goes into depth of the environmental impact of moving conferences online, it does nothing to cover the financial impact of doing so.\n\nEvents have a huge industry around them to provide all the services necessary to deliver them. Moving to a virtual model reduces the requirement for this industry by a significant margin.\n\nEvents also draw people into the local economy during the event, which is good for the local economy. There is a reason so many conference centre's are in places like Vegas.\n\nNot to mention that \"virtual\" events are almost entirely pointless, missing out the actual point of the event and as such, generally unattended.\n\nThis is a very polar article focusing and drawing conclusions on just one data point.",
            "title_similarity": "0.7382202",
            "sentiment_compound": 0.7419
        },
        {
            "id": "hp6ohqw",
            "score": 1,
            "text": "There's always some 2-bit article about how whatever anti-human garbage we're forced to endure because of the pandemic is somehow a good thing if we keep doing it forever, because the climate.",
            "title_similarity": "0.632298",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hp6oyi7",
            "score": 1,
            "text": "Great idea, the politicians that preach at us will never agree. They consider the travel for them and their families paid for by us a perk to their “hard job.”  I wish we could vote on it….",
            "title_similarity": "0.5742061",
            "sentiment_compound": 0.6898
        },
        {
            "id": "hp6p5io",
            "score": 1,
            "text": "Conventions are boring af online and the only reason anyone ever wants to attend is the perk of going to a cool city and getting drunk afterwards.",
            "title_similarity": "0.636963",
            "sentiment_compound": -0.34
        },
        {
            "id": "hp6p7kk",
            "score": 1,
            "text": "Why is everything that effects climate change a hindrance on the common man and never blamed on China, India and fossil fuels? Preventing people from seeing each other isn't even a drop in the ocean in relation to carbon emissions, we're just being conditioned to believe it's our fault for when the inevitable climate lockdowns come.",
            "title_similarity": "0.67660725",
            "sentiment_compound": -0.2805
        },
        {
            "id": "hp6p97k",
            "score": 1,
            "text": "Just the reduction in traffic has to be helping.  Work from home is so much better.",
            "title_similarity": "0.40012282",
            "sentiment_compound": 0.6573
        },
        {
            "id": "hp6pfhi",
            "score": 1,
            "text": "Funny that when most people were completely staying home, gas use went really low, and air pollution in my city almost vanished.\nStay at home jobs are clearly a big help  to the environment if enough people do it, and most of the time less travel expenses to employees.\nBut it takes money from oil people ,car manufacturing, service shops,parts suppliers and others.\nSo that's a big reason why it's not getting the support it should be.",
            "title_similarity": "0.6661321",
            "sentiment_compound": 0.0172
        },
        {
            "id": "hp6pfio",
            "score": 1,
            "text": "I’m all for being green, but if you have ever attended an online conference you would understand when I say, “please, God, no!”",
            "title_similarity": "0.60289454",
            "sentiment_compound": 0.4482
        },
        {
            "id": "hp6ptgi",
            "score": 1,
            "text": "Boycott Amazon, that would help",
            "title_similarity": "0.52321064",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hp6pz9q",
            "score": 1,
            "text": "Except that online conferences suck. \n\nOnline conferences eliminate the networking aspect of conferences, which is one of the primary draws of them in the first place. \n\nEveryone I know in IT is way, way over \"virtual events\". There is not even any point to them at all, because you can just as easily share the content out of band. People very much are dying to get back to in person events.",
            "title_similarity": "0.7467948",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hp6q4z6",
            "score": 1,
            "text": "Yes, and the best way to completely reduce climate change would be for us all to kill ourselves. Nice observation I guess?",
            "title_similarity": "0.68244606",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hp6q64z",
            "score": 1,
            "text": "So converting all meeting into digital ones is reducing climate change but doing the same for transaction with cryptocurrency and bitcoin isn’t good for climate change. That page is nothing more than a propaganda page covered with the world science now",
            "title_similarity": "0.7680773",
            "sentiment_compound": 0.2393
        },
        {
            "id": "hp6qfp0",
            "score": 1,
            "text": "I work in live event production. I think about this a lot. The number of semi trucks I book to move equipment around the US is staggering.\n\nThere's another way to look at this, which is to reduce the carbon footprint of how we do things. I've got a meeting with our trucking company on Tuesday and I'm going to ask him what they're doing to go electric. I know it's not a solution for right now, but I fully realized that unless we, the people who are chewing up the carbon to make these things happen, figure out a way to do it more cleanly, we're going to get left behind.",
            "title_similarity": "0.7277622",
            "sentiment_compound": -0.0852
        },
        {
            "id": "hp6qtl5",
            "score": 1,
            "text": "Yeah but where's the fun in that",
            "title_similarity": "-0.048455846",
            "sentiment_compound": 0.7227
        },
        {
            "id": "hp6qxgt",
            "score": 1,
            "text": "Good idea. Let's start with the international climate conferences. \n\nWhen the all climate conferences are online only, then I'll start to be concerned about climate change.",
            "title_similarity": "0.7521041",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hp6qxsg",
            "score": 1,
            "text": "It’s Pollution. Say it!!!\nThe BS about climate change is total horse sh!t. Every decade we get a new name for it but it’s pollution.",
            "title_similarity": "0.69983816",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6r0en",
            "score": 1,
            "text": "It also reduces the effectiveness of the conference by 99%",
            "title_similarity": "0.7388294",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6r39p",
            "score": 1,
            "text": "Living with someone that works directly with clients in the expo industry, I can safely say, customers, young and old prefer in person conferences.  They already spend a lot of time in virtual meetings.   They survey their vendors, presenters, and attendees.  The vote is in, they want in person events to network and interact on a more personal level.  They don't want to sit at a computer like they do for most of the year.  There are limits to virtualization.",
            "title_similarity": "0.61388147",
            "sentiment_compound": 0.6983
        },
        {
            "id": "hp6rbss",
            "score": 1,
            "text": "Having just been to my first in-person conference since the start of the pandemic, switching to online only would be terrible and almost defeat the purpose.  \nFace to face (or mask to mask) networking is THE most important and rewarding part of a conference.",
            "title_similarity": "0.72057617",
            "sentiment_compound": -0.013
        },
        {
            "id": "hp6rfv4",
            "score": 1,
            "text": "There goes my job! Haha",
            "title_similarity": "0.1321874",
            "sentiment_compound": 0.5093
        },
        {
            "id": "hp6ridg",
            "score": 1,
            "text": "Right. But have we thought about the energy impact of video calls? The risk is more divided instead of localised, but an equally large problem.",
            "title_similarity": "0.46142432",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hp6rirq",
            "score": 1,
            "text": "Online conferences are the biggest time wasters in the world",
            "title_similarity": "0.6199532",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6rnds",
            "score": 1,
            "text": "I've been really depressed about this entire issue since I learned 2/3 of carbon emissions are created by large Companies. It's like California's water issues where companies like Nestlé and huge farms use 90% of of usable water and the government tells the people THEY have to sacrifice. How about updating your arcane water laws California!",
            "title_similarity": "0.75796175",
            "sentiment_compound": 0.6122
        },
        {
            "id": "hp6ro42",
            "score": 1,
            "text": "This is total horseshit. I’m sorry but it’s a perfect example of how these articles can totally miss the point with a passing look at a dumb number. \n\nClimate change is being pushed by industrial energy use and it’s production. Not by travel, ffs. \n\nLet’s stop pinning carbon on individual action and realize that our collective energy non-policy is the issue. \n\nMeeting in person is super valuable to humanity. Travel is an essential modern human experience. Fix the way we generate and use the energy behind X and stop telling people to just stop doing X.",
            "title_similarity": "0.71277505",
            "sentiment_compound": 0.9272
        },
        {
            "id": "hp6rpt5",
            "score": 1,
            "text": "I've been wondering how much my carbon footprint was reduced since they've stopped making me commute daily for no reason, except tickling their petty managerial power trips.",
            "title_similarity": "0.76208854",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hp6rv5f",
            "score": 1,
            "text": "As someone who plans conferences for tech companies as a living, I totally get the carbon footprint thing. A few of my big clients have carbon neutral targets that they have publicly set that they are working toward and see, at the very least, shifting to all hybrid events as a way to help them hit those targets. But the thing with virtual conferences is that they aren’t actually conferences. They are essentially TV broadcasts. Even with ones where a lot of time and effort is put into creating “meaningful” ways for people to connect, they just don’t work. You need the atmosphere (and quite frankly, the free booze) to provide a setting where people engage naturally. Where they can walk up to a presenter at the end of a workshop and ask questions or chat with those sitting around them which can turn into legitimate contacts down the road. \nThe long and short of it is, virtual events suck. No one likes them. I don’t like planning them, my clients don’t like planning them, and attendees don’t like going to them. The carbon footprint created by in person events is absolutely something that the industry needs to pay attention to, but if we shift completely to virtual the industry may as well close up completely.",
            "title_similarity": "0.7137845",
            "sentiment_compound": 0.9455
        },
        {
            "id": "hp6rwmx",
            "score": 1,
            "text": "Epic NIMBYism in the comment section!",
            "title_similarity": "0.25625962",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6sit8",
            "score": 1,
            "text": "Well yeah, when they have the climate summit and everyone attending flew private, of course it would help for them to stop doing that.\n\nIf we really want to help the planet, how about we reign in the countries that are still increasing carbon emission, and also invest more in nuclear energy for those that are developed and trustworthy enough. If 1st world countries all want EV only futures, they need enough electricity to power everything and the only way for us to reach this in a reasonable amount of time is gen4/5 reactors and start building now",
            "title_similarity": "0.728739",
            "sentiment_compound": 0.929
        },
        {
            "id": "hp6sjqz",
            "score": 1,
            "text": "The only thing that will make a difference is China cutting back on its pollution and that’s not happening",
            "title_similarity": "0.59524477",
            "sentiment_compound": -0.128
        },
        {
            "id": "hp6srwq",
            "score": 1,
            "text": "Weren't we having power grid issues though? Made up or not if this is the case then idk. I just remember the good ol govt telling everyone to conserve power AMD all the power issues we had not even 8 months ago. So if everyone is one and using tech instead it increases power consumption. Granted I've not enough knowledge on this exact situation. So maybe someone else can enlighten me?",
            "title_similarity": "0.6858717",
            "sentiment_compound": 0.7998
        },
        {
            "id": "hp6svlt",
            "score": 1,
            "text": "This will have no effect on climate change.",
            "title_similarity": "0.31515175",
            "sentiment_compound": -0.296
        },
        {
            "id": "hp6t1zl",
            "score": 1,
            "text": "Blows my mind how many people are desperately try to defend something as wasteful as conventions. We really are f*ked all the way",
            "title_similarity": "0.42880297",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hp6t64n",
            "score": 1,
            "text": "But how else are they gonna be able to cheat on their spouses???",
            "title_similarity": "0.33091035",
            "sentiment_compound": -0.6747
        },
        {
            "id": "hp6t8bj",
            "score": 1,
            "text": "Sure, but now how do I to ignore my kids for a few days and cheat on my spouse?",
            "title_similarity": "0.5605725",
            "sentiment_compound": -0.765
        },
        {
            "id": "hp6t9rj",
            "score": 1,
            "text": "Yea but virtual conferences and events suck.  I don’t think pushing that to save emission vs pushing for stricter regulations on polluters and electrification is the right balance of outcome vs effort",
            "title_similarity": "0.55171347",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hp6tb6c",
            "score": 1,
            "text": "It’s a fascinating coincidence how most science articles these days seem to match perfectly to one side’s political ideology.",
            "title_similarity": "0.43963253",
            "sentiment_compound": 0.8271
        },
        {
            "id": "hp6tggx",
            "score": 1,
            "text": "As someone who has had to do 3 online conferences in the past year, online conferences are trash, and totally ruin the point of a conference, which is face to face networking and socializing with those who you can learn from. Everyone knows the speaker sessions are like only a small fraction of the point of attending, and watching that stuff online is terrible.",
            "title_similarity": "0.7428013",
            "sentiment_compound": -0.6901
        },
        {
            "id": "hp6tkt4",
            "score": 1,
            "text": "You would think it would be more since everyone is using their computers",
            "title_similarity": "0.28839207",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6tzib",
            "score": 1,
            "text": "So we’re just not even going to discuss the massive negative implications this would have on everyone’s social health?",
            "title_similarity": "0.48122245",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hp6ubho",
            "score": 1,
            "text": "A colleague of mine got a hotel room locally in town for their last online conference. They dressed up, pretended to be away from home, and even went out to eat with a few others attending the conference who lived locally. They tried to simulate the conference environment. They said it helped a little. Sounded fun kinda.",
            "title_similarity": "0.5653331",
            "sentiment_compound": 0.4627
        },
        {
            "id": "hp6ugx5",
            "score": 1,
            "text": "It also completely eliminates networking and business development! Brilliant!",
            "title_similarity": "0.6262163",
            "sentiment_compound": 0.658
        },
        {
            "id": "hp6uqts",
            "score": 1,
            "text": "This is how the lobbyists win, by convincing people that stupid ideas like this is what will bring change and not making the giant polluters change their actions. I want my straws back too!",
            "title_similarity": "0.5380068",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hp6v5lc",
            "score": 1,
            "text": "Hence the phrase the great reset",
            "title_similarity": "0.14848825",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hp6va10",
            "score": 1,
            "text": "But how will all those conference attendees cheat on their spouses?",
            "title_similarity": "0.51524466",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hp6vcnd",
            "score": 1,
            "text": "Wonder what Vegas would look like without convention business.",
            "title_similarity": "0.4156294",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hp6vfoh",
            "score": 1,
            "text": "The only reason for a conference is so you can take a mini vacation on your company's dime.",
            "title_similarity": "0.5472266",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6vitq",
            "score": 1,
            "text": "Science needs some humility and scientist need to roll model.\nThe inate dynamics of life the brilliance of science frankly it's a terminal situation in my opinion.\nTo reductive to pc",
            "title_similarity": "0.4619351",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hp6vpd1",
            "score": 1,
            "text": "It’s the ppls fault not big unchecked corporations, riiiight",
            "title_similarity": "0.49407065",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hp6vtta",
            "score": 1,
            "text": "Many have seen this coming",
            "title_similarity": "-0.038492214",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6vywt",
            "score": 1,
            "text": "I think people just need to think much more locally. Restrict in person meetings as much as possible to those that everyone can reach easily by walking, biking, or using public transportation. If anyone can't reach the meeting through any of those means, join the meeting remotely. People need to get out of this mindset of jet setting around the world at a moments notice. It comes at too high of a resource cost.\n\nI'm not saying the people should never travel outside of their local area, but it should be rare occasions not near daily occurrences.",
            "title_similarity": "0.6577847",
            "sentiment_compound": 0.0961
        },
        {
            "id": "hp6wgkv",
            "score": 1,
            "text": "Can we eliminate meetings that should be an email while we're at it? That should save off another 10-20% of wasted energy and effort.",
            "title_similarity": "0.7811866",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hp6wi12",
            "score": 1,
            "text": "Climate change isn’t caused by individual people. It is caused by large corporations being able to emit greenhouses gasses without restriction. Shifting responsibility to anyone other than large corporations will never solve climate change.",
            "title_similarity": "0.59795165",
            "sentiment_compound": 0.0572
        },
        {
            "id": "hp6wq7g",
            "score": 1,
            "text": "Tell that to cop-out 26",
            "title_similarity": "0.22576837",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6ws78",
            "score": 1,
            "text": "Except zoom conferences are utter wank.",
            "title_similarity": "0.401662",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6wvi4",
            "score": 1,
            "text": "Conventions were never about the business anyway. It was a way employees tricked their employers into paying for a vacation.",
            "title_similarity": "0.5895463",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hp6x7tz",
            "score": 1,
            "text": "Yes shift the blame back to the people and not the mega corps pumping tuns of CO2 into the atmosphere.",
            "title_similarity": "0.6314967",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hp6x8bo",
            "score": 1,
            "text": "What a stupid position \n\nThe issues come from industry\n\nThis kills the entire point of academic conferences\n\nIndividual habit changes are completely meaningless, and a farce",
            "title_similarity": "0.62855244",
            "sentiment_compound": -0.9249
        },
        {
            "id": "hp6xfcn",
            "score": 1,
            "text": "I've worked in the sustainable events industry for the past 8 years, and have been doing carbon/waste accounting for conferences moving virtual for the past few years. While I'm not surprised by the \"virtual conferences suck\" comments, I am kind of shocked to see the \"classic attention diversion from what would really help\" comments. Conferences are incredibly impactful, often having 10,000+ people fly across the country/world for a day or two, use a bunch of single-use stuff (food ware, swag), lots of food and build waste...the list goes on. (a lot of shows build full-on buildings and carpet the entire show floor and toss it at the end for instance).  \nAccording to this study: \"The annual carbon footprint for the global event and convention industry is on par with the yearly greenhouse gas emissions of the entire U.S.\" I feel like this is the perfect industry to look into a 10-20% reductions, don't you?",
            "title_similarity": "0.7556668",
            "sentiment_compound": 0.465
        },
        {
            "id": "hp6xiyf",
            "score": 1,
            "text": "This data is useless if it doesn't compare the number to the reduction in total emissions. How much do in person meetings cause? .001% of all global emissions?",
            "title_similarity": "0.76037854",
            "sentiment_compound": -0.5239
        },
        {
            "id": "hp6xnv9",
            "score": 1,
            "text": "If we don't change our ways to take care of the planet, it will change them for us... Despite us... Or remove us.",
            "title_similarity": "0.44384557",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hp6y6vb",
            "score": 1,
            "text": "In a climate change sense, yes this is true. But the professional conferences I usually go to for my CEUs, there are so many networking opportunities that are missed by not being there in person and able to rub elbows and socialize with people. Professional development opportunities, job opportunities, recruitment booths, and being able to interact directly with the leaders in the field have all taken a huge hit. And I fear that the lack of many of these in-person meet up opportunities are are going to inhibit progress in the field.",
            "title_similarity": "0.69049764",
            "sentiment_compound": 0.8734
        },
        {
            "id": "hp6ybb4",
            "score": 1,
            "text": "It was possible to do this via Skype for more than a decade now. Nothing about this is new, even the blatant disregard for the rest of humanity by self-described elites.",
            "title_similarity": "0.59210587",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hp6ycrk",
            "score": 1,
            "text": "I work as a systems trainer for a global company and my role _requires_ me to travel around Europe and perform group training sessions over a two week period.\n\nMy team is spread across Europe, but I am the only member of my team from my country and subsequently have not yet travelled due to restrictions, yet have been perfectly capable of doing my job over the last 18 months. \n\nHowever, we are still expected to travel when we come back to work in January. I will send a link of this to my management team",
            "title_similarity": "0.6078282",
            "sentiment_compound": 0.8807
        },
        {
            "id": "hp6ydrx",
            "score": 1,
            "text": "A yes, worthless statistics with probably negligible real numbers, awesome.",
            "title_similarity": "0.3031993",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hp6yfi7",
            "score": 1,
            "text": "Yet another article making it sound like individuals can curb climate change, we have to target corporations that produce goods.",
            "title_similarity": "0.6128328",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hp6yh50",
            "score": 1,
            "text": "The sheer number of jobs that can be done remotely is astounding. Yet companies simply dont want to abandon the current paradigm where they desperately try to make offices more \"home-like\". \n\nAbandoning this paradigm is one major way corporations can cut down on CO2 emissions. Imagine the thousands of hours saved in traffic commutes l, the millions and billions of gallons of fuel not burnt.\n\nYet we still cant get rid of old habits.",
            "title_similarity": "0.71647704",
            "sentiment_compound": 0.1295
        },
        {
            "id": "hp6yh9c",
            "score": 1,
            "text": "The pandemic has shown that literally everything could be so much better with such little effort. It doesn't and won't as we can never apparently see the class divide and act in ture for the betterment of ALL.",
            "title_similarity": "0.61873347",
            "sentiment_compound": 0.4902
        },
        {
            "id": "hp6ymx8",
            "score": 1,
            "text": "Politicians cannot afford killing the oil based vehicles.",
            "title_similarity": "0.5851909",
            "sentiment_compound": 0.5448
        },
        {
            "id": "hp6yti8",
            "score": 1,
            "text": "cool, but how does this hold the 100 companies responsible for 71% of global emissions accountable?",
            "title_similarity": "0.60141116",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hp6yva5",
            "score": 2,
            "text": "Think if we had permanent work from home for all white collar professionals. Can’t imagine the impact that would have on c02 emissions,",
            "title_similarity": "0.6556134",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6zbie",
            "score": 2,
            "text": "Ye but the academics want to go travel to the exotic locations for a free holiday I mean convention, my best work trip? Milton Keynes...",
            "title_similarity": "0.51365733",
            "sentiment_compound": 0.9455
        },
        {
            "id": "hp6zi9n",
            "score": 1,
            "text": "Save the planet, never leave your house.",
            "title_similarity": "0.38427567",
            "sentiment_compound": 0.5184
        },
        {
            "id": "hp6zj3d",
            "score": 1,
            "text": "How about literally everyone who can work from home starts working from home forever?",
            "title_similarity": "0.35453993",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp6zzfv",
            "score": 1,
            "text": "The entire point of conventions/conferences is networking. If they all move online they'll be pointless.",
            "title_similarity": "0.64945084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp700ya",
            "score": 2,
            "text": "How else would you fly to a crappy hotel for 2 nights to learn nothing and maybe have 3 valuable conversations?\n\nWalking past countless uniquely repetitive booths with the same enthusiastic rep following a script.",
            "title_similarity": "0.6298728",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hp703kn",
            "score": 1,
            "text": "Heard it here first folks, the icecaps are melting because of calling meetings. Guess we don’t need to worry about the industrial sector anymore.",
            "title_similarity": "0.72902703",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hp70l7k",
            "score": 1,
            "text": "Virtual conferences are a complete waste of time. The entire point of meetings is networking. Stupid idea.",
            "title_similarity": "0.5977013",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hp714cq",
            "score": 1,
            "text": "For sure.  You know what else reduces your carbon foot print?\n\nStaying in your home 24 hours a day, seven days a week.\n\nFinally environmentalists are really are finding solutions!",
            "title_similarity": "0.61650085",
            "sentiment_compound": 0.5508
        },
        {
            "id": "hp719yw",
            "score": 1,
            "text": "It reduces the carbon footprint for the company organizing the conference. But has anyone thought of all the carbon we are producing at home? We are not using our cars, but we are using electricity at home, ordering food at home or cooking, using wifi there…",
            "title_similarity": "0.6636938",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp71nvf",
            "score": 1,
            "text": "Or we could just send a mail and reduce it 100%",
            "title_similarity": "0.598285",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp72i9d",
            "score": 1,
            "text": "You guys we had an all-online conference last week and there was literally no point. It was almost nothing like a real conference, and I would not attend an all-online one again.",
            "title_similarity": "0.68867576",
            "sentiment_compound": -0.4645
        },
        {
            "id": "hp72n1n",
            "score": 1,
            "text": "In person mega meetings where people fly are usually the priveledge of management, who then use it as a reason to have a vacation at company expense",
            "title_similarity": "0.5506129",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp72op8",
            "score": 1,
            "text": "New age globalization: Everybody stay where you are.",
            "title_similarity": "0.260639",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp72qiq",
            "score": 1,
            "text": "But does it fulfill its objectives? I don’t think it does.",
            "title_similarity": "-0.0034618601",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hp72zce",
            "score": 1,
            "text": "Online conventions are stupid though.",
            "title_similarity": "0.37031046",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hp738uq",
            "score": 1,
            "text": "This would also inadvertently lower the amount of affairs/cheating and subsequent possible pregnancy, only continuing to lower carbon footprint.",
            "title_similarity": "0.58429325",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hp73anh",
            "score": 2,
            "text": "And yet, about 100 companies still produce over 70% of all carbon emissions and keep dumping the blame on unrelated people.",
            "title_similarity": "0.6964573",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hp73cft",
            "score": 1,
            "text": "Ok, but what percentage of the total carbon foot that comprises conferences? And why is it suspiciously absent.",
            "title_similarity": "0.57128507",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hp73f0x",
            "score": 6,
            "text": "The lowered carbon footprint is absolutely true. I’d also like to add that online conferences have made it MUCH easier for new students and professionals from developing nations to attend, and I’ve probably seen more talks than I normally would just because sessions aren’t given concurrently. \n\nThat being said, I don’t think the quality is nearly as good. Networking is practically nonexistent, and the group calls are easily dominated by one vocal person. I also dearly miss seeing some of my colleagues and friends, who I’ve not seen in like almost 3 years at this point. \n\nIt’s definitely a mix of good and bad. I don’t think we should be having in-person conferences with the pandemic still in progress, but I still much prefer live events.",
            "title_similarity": "0.6848425",
            "sentiment_compound": 0.8638
        },
        {
            "id": "hp73znt",
            "score": 1,
            "text": "Almost all of you emotions would come from the plane flight in such an instance. Your BUSINESS polluted by sending you to the difference, not you. You didn't go to a trade show on vacation, you went to work. \n\nDon't let Shell and other oil players convince you that there's such a thing as an individual climate footprint when all the choices are made for you.",
            "title_similarity": "0.7223303",
            "sentiment_compound": -0.25
        },
        {
            "id": "hp745re",
            "score": 1,
            "text": "How about, we don't have 500 private jets converge on 1 location to discuss how the Poor's have to sacrifice to reduce GHG emissions? How about that?",
            "title_similarity": "0.7590278",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp746jl",
            "score": 1,
            "text": "Online conferences 2/10. Online training 6/10. Web meetings instead of in person meetings 8/10. Work from home 10/10.",
            "title_similarity": "0.6196977",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp748wb",
            "score": 1,
            "text": "When I first started working in videoconferencing 10+ years ago, one of the management programs had a tool that could guesstimate how much CO2 was being offset by having virtual meetings.   \n\n\nFeature was scrapped because nobody cared.",
            "title_similarity": "0.7276304",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hp74gjr",
            "score": 1,
            "text": "Professional conferences/conventions suck online. There is no point in attending, when they could just release panel videos that I could watch when I feel like it.\n\n80% of the point is interacting with other professionals and taking about what you’re doing professionally, and that requires an environment with a lot of people, and a significant amount of alcohol (The other 20% of the point is vendor swag).",
            "title_similarity": "0.74734783",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hp74hg2",
            "score": 1,
            "text": "So now the corporations which contribute some 70% of all pollution are free to pollute even more while continuing to scapegoat the general populace…?\n\nNonsensical solution to a global problem.  “Just stay inside!”",
            "title_similarity": "0.77623594",
            "sentiment_compound": -0.5255
        },
        {
            "id": "hp74jla",
            "score": 1,
            "text": "Seems obvious to me, presenteeism is anti green",
            "title_similarity": "0.3409175",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hp74rrj",
            "score": 2,
            "text": "Sure but then how can I cheat on my wife with somebody I met at the hotel bar?",
            "title_similarity": "0.5000825",
            "sentiment_compound": -0.5187
        },
        {
            "id": "hp74ttg",
            "score": 2,
            "text": "You cancel in person conferences, you will see huge job losses 3 miles from any major conference center , as well as airline industry.",
            "title_similarity": "0.7114921",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hp75wvi",
            "score": 2,
            "text": "I will also 100% not pay attention as much",
            "title_similarity": "0.3750135",
            "sentiment_compound": 0.0762
        },
        {
            "id": "hp76b3o",
            "score": 7,
            "text": "Conferences being online are no fun. I don't even want to go to them anymore but they were mandatory for career reasons. Being 100% remote honestly feels like a huge waste of money and time. It's hard to build any connections to network. The grad students who never got the chance to experience a science expo saddens me.",
            "title_similarity": "0.6742612",
            "sentiment_compound": -0.1461
        },
        {
            "id": "hp774z9",
            "score": 1,
            "text": "This feels like 80 percent of M.D.s have no knowledge of nutrition. Probably underestimated",
            "title_similarity": "0.57118505",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hp776bs",
            "score": 1,
            "text": "This is just a study done to highlight how scientists don't understand the purpose of conferences...",
            "title_similarity": "0.47825378",
            "sentiment_compound": 0.34
        },
        {
            "id": "hp778bs",
            "score": 1,
            "text": "I don't think that's a good idea a lot of communication isn't wiith words ( body language  feremones, physical contact) as a result I think we will all end up with anxiety and depression if we are kept from.socialising face to face. Has nobody seen walle?",
            "title_similarity": "0.5119673",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hp778db",
            "score": 1,
            "text": "Academic here. \n\nIm willing to say the quiet part outloud. Prepandemic conferences were a perk. I'd pick something that was interesting and in a good location. I learned something or contributed while enjoying myself. \n\nIn the pandemic world I refuse to pay for online conferences. Being online for a meeting isn't respected by colleagues or staff. Couple with cutting academic budgets has me questioning why I bother. I suspect I won't much longer.",
            "title_similarity": "0.63413715",
            "sentiment_compound": -0.1665
        },
        {
            "id": "hp7797l",
            "score": 1,
            "text": "Most people like to meet clients face to face. There is a great chemistry when meeting in person. Those online meetings are annoying because you have to think about where to sit, what coffee mug you should use and what to wear.",
            "title_similarity": "0.49916714",
            "sentiment_compound": 0.6344
        },
        {
            "id": "hp77qx9",
            "score": 1,
            "text": "Ugh virtual meetings, sure but in person is good sometimes. Virtual conferences are honestly a waste of time.",
            "title_similarity": "0.51218367",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hp78e4q",
            "score": 1,
            "text": "How many zoom meetings equals one unregulated coal plant in some developing nation somewhere?",
            "title_similarity": "0.6013261",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp78nfl",
            "score": 1,
            "text": " cornell is greenwashing here. they need to consider the massive ecological impact of the \"digital transition\" and calculate again. microchips, communications towers, cables, huge server banks, all require massive mines, massive energy consumption, massive toxic chemical pollution and other kinds of pollution.   here's a v insightful article about it\n\nhttps://mondediplo.com/2021/11/09digital-waste",
            "title_similarity": "0.68195057",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hp78ra1",
            "score": 1,
            "text": "Nice, BP will like this. Let us just ruin the life of everyone and dont think about big Corpos changing our Climate (:",
            "title_similarity": "0.6544855",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hp78t8r",
            "score": 1,
            "text": "People go to conference for networking and to have some fun at places outside your own city.\n\nIt is not for the speaker, or for the event. Some speakers are good, but the pulse of the industry is not felt on the speakers, but on the attendants of the conference. \n\nNot to mention networking. It is a good opportunity to introduce your business in an informal setting to people that are less guarded. People can easily be approached at conferences, not at their office hours.\n\nFinally, it is a good place to poach or be poached.",
            "title_similarity": "0.51636356",
            "sentiment_compound": 0.9559
        },
        {
            "id": "hp78tbm",
            "score": 2,
            "text": "New way? Pretty sure video conferences have been around fo a while.",
            "title_similarity": "0.33329785",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hp791s4",
            "score": 1,
            "text": "100 companies are responsible for 75%of carbon emissions.",
            "title_similarity": "0.57125384",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hp799bt",
            "score": 1,
            "text": "Omgg we should all lie in an online world from now and submit to the Facebook metaverse!",
            "title_similarity": "0.5334259",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7a3or",
            "score": 1,
            "text": "There's no way either of those things cause much climate change. And the whole point of a convention is to be there IRL.",
            "title_similarity": "0.46371338",
            "sentiment_compound": -0.296
        },
        {
            "id": "hp7aekt",
            "score": 1,
            "text": "I dont know for sure, but im pretty sure the carbon emissions from the general public are only a fraction of emissions from the largest companies, and IF that is the case, it doesn't make sense to take even more of our humanity, as we learned these last 2 years doing so is very destructive to our psyche as a society. Its these very same companies that might even help fund studies, such as the sugar companies, paper, and big pharma.",
            "title_similarity": "0.7974198",
            "sentiment_compound": 0.4559
        },
        {
            "id": "hp7ayhq",
            "score": 1,
            "text": "True. But the immersion / social interaction is diluted just as much as the carbon footprint.",
            "title_similarity": "0.63127285",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hp7b1nq",
            "score": 1,
            "text": "Kills morale\n\nKills networking\n\nKills pitches for new projects and fundraising\n\n\nYes, traveling less 'reduces climate change'. Skipping school reduces climate change too. Dying of hunger reduces climate change. The best science is done because of traveling conventions. Skype/Zoom meetings suck and kill productivity and morale. The little climate we 'change' by people living their lives is worth it. If you wanna kill Bezos that's fine, he ALONE causes more climate change than every single businessman/scientist traveling to conventions COMBINED.",
            "title_similarity": "0.8117968",
            "sentiment_compound": -0.958
        },
        {
            "id": "hp7b2kj",
            "score": 1,
            "text": "This is great! Putting all the communications online makes things so much less personal…I feel like it’s going to be incredibly easy to swap out employees as completely dispensable. They are just a little name block on a screen.",
            "title_similarity": "0.6018374",
            "sentiment_compound": 0.802
        },
        {
            "id": "hp7bbuu",
            "score": 1,
            "text": "have consumers change their entire lives and allow the corporations responsible for 72% of global emissions continue business as usual?",
            "title_similarity": "0.7097772",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hp7bccg",
            "score": 2,
            "text": "Online conferences are great if you hate socializing, making friends, going out for nice dinners with clients, seeing new cities/countries.",
            "title_similarity": "0.54203165",
            "sentiment_compound": 0.743
        },
        {
            "id": "hp7bz39",
            "score": 1,
            "text": "Doesn’t like a handful of corporations produce 90 something percent of all global emissions?",
            "title_similarity": "0.7299783",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hp7c6d1",
            "score": 1,
            "text": "Why is every comment obsessed with conferences sucking now and not the much more important very real threat to most life on the planet? Who cares if your conference sucks now, y’all. I’m sorry things are changing but the alternate is extinction. \n\nCan we stop worrying about networking for our professions and put the health of our climate first? Such a weak argument when the alternative is unimaginably horrible.",
            "title_similarity": "0.72004837",
            "sentiment_compound": -0.9645
        },
        {
            "id": "hp7cayr",
            "score": 1,
            "text": "In person human interaction is overrated anyway  right?",
            "title_similarity": "0.3448462",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7cikj",
            "score": 1,
            "text": "Working remotely is super depressing and isolating, and it has ruined my mental health over the last year. I can't be the only one falling apart being a video hermit for a company. On days with no meetings sometimes I wonder if I am even real.",
            "title_similarity": "0.6454936",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hp7cjrm",
            "score": 1,
            "text": "Especially Climate Change conferences where the attendees fly in on their private jets.",
            "title_similarity": "0.3841752",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7coql",
            "score": 1,
            "text": "100 companies are responsible for 70% of emissions",
            "title_similarity": "0.5145025",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hp7cra4",
            "score": 1,
            "text": "Yes, just don't do this to fire people....",
            "title_similarity": "0.21664435",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hp7csi1",
            "score": 1,
            "text": "I am fine doing away with large conferences, but have zero interest in watching Zoom. I really dislike this from of communication.",
            "title_similarity": "0.5410392",
            "sentiment_compound": 0.1432
        },
        {
            "id": "hp7cspv",
            "score": 1,
            "text": "Or we could just do away with cruise ships.",
            "title_similarity": "0.34609753",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7cztu",
            "score": 1,
            "text": "My take is that normal meetings are actually better online but that conferences are much worse.\n\nI don't know about other fields - I am in Physics/Medicine. Conferences in the before times were about meeting up with people working in your field and bouncing ideas off each other. Presentations are mostly a clue to who you should be talking to and/or starting points for discussion. This, of course, should be and is possible online but for some reason it doesn't work. Online chatrooms just aren't the same as wandering up to someone at coffee.\n\nNormal meetings work because there are fixed discussion points that everyone knows coming in.",
            "title_similarity": "0.68590736",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hp7dk0e",
            "score": 1,
            "text": "one of the dumbest articles/title combo i've ever seen.",
            "title_similarity": "0.40847158",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hp7dp44",
            "score": 1,
            "text": "Online conferences, for me anyway, are me logging into the conference, muting my speaker, then doing my actual job.\n\nIf conferences switch to mostly online affairs, then they may as well just stop having them altogether. \n\nWhich I'm very much ok with.",
            "title_similarity": "0.6203021",
            "sentiment_compound": 0.3353
        },
        {
            "id": "hp7dxv5",
            "score": 1,
            "text": "So this was the part of the plan all along...",
            "title_similarity": "-0.0010351259",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7e4sk",
            "score": 1,
            "text": "I get to attend MAYBE one in-person conference per year, and attend 3-5 online. In-person conferences are a completely different professional experience. They're also a break from routine.  While it wouldn't make or break a professional experience for me, I'd have to say a company that only lets its employees attend conferences virtually would have another check-mark in the \"cons\" column.",
            "title_similarity": "0.7456645",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7e6nx",
            "score": 1,
            "text": "so now i can ride my diesel car because i attend few zoom meetings - nice",
            "title_similarity": "0.37058365",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hp7ebdo",
            "score": 1,
            "text": "Or we can yo after the corporations responsible for over three quarters of carbon emissions.",
            "title_similarity": "0.60813165",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hp7eh9s",
            "score": 1,
            "text": "Or maybe we could just shut down a few coal-fired power plants.",
            "title_similarity": "0.5712873",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7etgv",
            "score": 1,
            "text": "I know just on the food waste alone in person conferences are terrible for the environment",
            "title_similarity": "0.59606475",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hp7fcds",
            "score": 1,
            "text": "Conferences are one of the few useful in-person work events, they only happen once a year for a reason. Let's stop passing the buck and just regulate the corporations that are doinf the vast majority of the pollution.",
            "title_similarity": "0.7485801",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hp7g645",
            "score": 1,
            "text": "Sure at the expense of mental health. Is it better to have more generations of humanity with a lower quality of life or less but with more quality and freedom? \n\nI think this is a real question that is largely being ignored.",
            "title_similarity": "0.44776323",
            "sentiment_compound": 0.7388
        },
        {
            "id": "hp7gt4a",
            "score": 1,
            "text": "Wait until you realize how much we can save if we didn't give politicians free trips on gas guzzling jets so they can meet, party and come back with the message \"pollution bad, but we all agree that the political and corporate elite can pollute but you peasants will have to go without\" every time there is a climate summit.",
            "title_similarity": "0.76077133",
            "sentiment_compound": -0.3294
        },
        {
            "id": "hp7gvt4",
            "score": 1,
            "text": "Such small pickings. What the pandemic really showed wrt climate change is that even if consumers just Stopped travelling and office buildings shut down, the carbon footprint changed in no meaningful way. The lesson is that its manufacturing and other businesses that are causing the problem, and governments need to to their freaking jobs to regulate those footprints. We need a carbon tax structure, not digital conferences.",
            "title_similarity": "0.821815",
            "sentiment_compound": -0.8106
        },
        {
            "id": "hp7gvuv",
            "score": 1,
            "text": "Tell this to local government sectors",
            "title_similarity": "0.19154179",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7gwyq",
            "score": 1,
            "text": "People in specialized fields often feel lonely in their work as there are few they can have relevant and in depth conversations with in person.\n\nIn other words, some of us look forward to these conventions. I have skipped multiple \"online conventions\" as they are nothing like in person.",
            "title_similarity": "0.50442594",
            "sentiment_compound": -0.5588
        },
        {
            "id": "hp7h1ff",
            "score": 1,
            "text": "Online conferences suck ass. No connections are made and everyone’s time is wasted.",
            "title_similarity": "0.5947319",
            "sentiment_compound": -0.8957
        },
        {
            "id": "hp7h4oj",
            "score": 1,
            "text": "How about instead we stop letting pool companies rape the world?",
            "title_similarity": "0.59173477",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hp7h6w5",
            "score": 1,
            "text": "Some meetings can go virtual with significant positive impacts for All attending. IEP meetings for children with special needs are amazing over zoom. As are parent-teacher conferences. Regular random work meetings are also great virtual. Conferences are supposed to be a place to meet and connect with others. I do not see much of that happening over Zoom.",
            "title_similarity": "0.4461335",
            "sentiment_compound": 0.9432
        },
        {
            "id": "hp7h8vs",
            "score": 1,
            "text": "I think cruise ships equal all the pollution that cars make? People can't fix the climate crisis.",
            "title_similarity": "0.7459644",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hp7hgs0",
            "score": 1,
            "text": "Have there been any impact studies on how this affects local economies where conferences no longer take place? It would be interesting to be able to layer the data. Also have there been traffic studies to see how it’s affected urban congestion? Just curious.",
            "title_similarity": "0.5796388",
            "sentiment_compound": 0.3736
        },
        {
            "id": "hp7hier",
            "score": 1,
            "text": "we need to stop accepting responsibility to do it ourselves and hold our politicians accountable",
            "title_similarity": "0.49677846",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hp7hky3",
            "score": 1,
            "text": "And yet places want you to go back to the office because it's not about what's good for the environment or the people it's about profits.",
            "title_similarity": "0.5978906",
            "sentiment_compound": 0.2008
        },
        {
            "id": "hp7j13x",
            "score": 1,
            "text": "But what about the CULTURE\n\nIt’s way more insubordinate when I sleep through a meeting in-person",
            "title_similarity": "0.5246392",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7j2sm",
            "score": 1,
            "text": "A fantastic way to reduce carbon emissions by 0.00001% with the small sacrifice of face to face human interaction",
            "title_similarity": "0.64087355",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hp7jctl",
            "score": 1,
            "text": "Tell it to all of the celebrities and politicians taking their private jets and yachts to climate conferences…",
            "title_similarity": "0.45289433",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7jn88",
            "score": 1,
            "text": "I design custom video game-style pixel art maps for conferences and virtual events and use gather.town as the host platform. Really happy virtual events using proximity chats are now a thing. My job is a really cool video game designer/graphic design/experience design hybrid.",
            "title_similarity": "0.44196954",
            "sentiment_compound": 0.764
        },
        {
            "id": "hp7jy2h",
            "score": 1,
            "text": "Im so glad I got tenure pre Covid because I just can’t fathom “going” to an online academic conference at this point.",
            "title_similarity": "0.52166325",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hp7k3gf",
            "score": 2,
            "text": "I'm sorry but online conferences suck.",
            "title_similarity": "0.508517",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hp7kb39",
            "score": 1,
            "text": "This is a great idea, to an extent. There are several meetings I have been to that can not be held online for various reasons. Those meeting would never be scrapped.",
            "title_similarity": "0.46728903",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hp7kmqo",
            "score": 1,
            "text": "Virtual conferences suck - I’d rather just have no conferences than virtual ones.",
            "title_similarity": "0.5105685",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hp7l354",
            "score": 1,
            "text": "Unpopular opinion:  ￼ I’m tired of little people like us coming up with minuscule ways to make an impact when 95% of the problem is industry and commercial travel.￼",
            "title_similarity": "0.6718191",
            "sentiment_compound": -0.5233
        },
        {
            "id": "hp7lga7",
            "score": 1,
            "text": "Tell that to jet flying billionaires who want you to do it and not them",
            "title_similarity": "0.40934834",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hp7ln41",
            "score": 1,
            "text": "As an introvert that hates networking, please. I also will get to attend way more, as my office will rarely spring for travel. \n\nI’ve attended more conferences in the last year than the decade before. And I still learn plenty through presentations.",
            "title_similarity": "0.6651182",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hp7lywt",
            "score": 1,
            "text": "They just raised train season tickets in Scotland by 4%. I'm never giving up my car because I need it to see family and do the weekly shop. \n\nTo get me into a train to work it needs to be cheaper than a weeks petrol (gas). \n\nFeck going back to work on a daily basis with that sort of pricing. Everything is going up in price by a lot. If I can avoid expensive unreliable public transport I will.",
            "title_similarity": "0.6600039",
            "sentiment_compound": -0.5
        },
        {
            "id": "hp7mfgp",
            "score": 2,
            "text": "Yah. And if you just stop eating animal products it does a lot too.",
            "title_similarity": "0.47758397",
            "sentiment_compound": -0.296
        },
        {
            "id": "hp7moqk",
            "score": 1,
            "text": "And then I dont have to go anywhere! Mission accomplished",
            "title_similarity": "0.13089028",
            "sentiment_compound": 0.4926
        },
        {
            "id": "hp7n9my",
            "score": 1,
            "text": "COP gatherings should understand that. They keep saying they are working for the environment but they just take private jets and eat luxury food for a few weeks.",
            "title_similarity": "0.61995625",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7na3m",
            "score": 1,
            "text": "Another way to guilt trip people who are responsible for a relatively small fraction of global emissions.",
            "title_similarity": "0.5698341",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hp7nf3t",
            "score": 1,
            "text": " But how can they cheat on their spouses if they can’t go to in person conventions?",
            "title_similarity": "0.47819957",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hp7nhmi",
            "score": 1,
            "text": "Healthier for me too.. moved from a place with very high AQI values (40-70) to very low (10-20).",
            "title_similarity": "0.42040497",
            "sentiment_compound": 0.1458
        },
        {
            "id": "hp7ni2l",
            "score": 1,
            "text": "The in-person conference is not about the actual presentations. It’s about the happy accident encounters over the breaks, it’s overhearing your competitors talking too loudly at the next booth, it’s about presence and synergy, candid glances and gut feelings when dealing with people casually face to face. Online meetings are about as interactive as a PowerPoint presentation, teacher talking down to students, role performance.",
            "title_similarity": "0.60357046",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hp7nlaz",
            "score": 1,
            "text": "I honestly never want to be on an office again anyway, besides a home office.",
            "title_similarity": "0.42784",
            "sentiment_compound": 0.4172
        },
        {
            "id": "hp7nln6",
            "score": 1,
            "text": "Does this take into account the charbon footprint of using your computer + the internet, times how many peoples are attending, for like an hour",
            "title_similarity": "0.61144495",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hp7nlwm",
            "score": 1,
            "text": "there is still an ergonomics issue with remote meetings. nothing is as productive than an in person brainstorming session.",
            "title_similarity": "0.54694784",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7nmeo",
            "score": 1,
            "text": "Not only does it reduce the carbon footprint, it reduces stress by 100% compared with someone who has to get a family ready and out, fight traffic, find a place to park, and the host of other stresses that comes with actually GETTING to a face to face meeting in the first place.",
            "title_similarity": "0.735908",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hp7nrjz",
            "score": 1,
            "text": "But how are people going to pretend to work all day now smart guy?",
            "title_similarity": "0.40353408",
            "sentiment_compound": 0.4497
        },
        {
            "id": "hp7ohq6",
            "score": 1,
            "text": "\"reduced BY %\" and \"reduced TO %\" in the same title is needlessly confusing/misleading. Pick one for both.",
            "title_similarity": "0.3690855",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7oono",
            "score": 1,
            "text": "Research completed by the guy that gets leafy behind to man the fort while the rest of the team get to go to conference.",
            "title_similarity": "0.4356652",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7plbz",
            "score": 2,
            "text": "Does anybody have a clue how many people in sales and management positions haven’t done anything but get a check during Covid? Like are completely clueless and blame all of the sales numbers etc on Covid? It’s bad, I mean really bad.",
            "title_similarity": "0.6751958",
            "sentiment_compound": -0.9454
        },
        {
            "id": "hp7ppxz",
            "score": 1,
            "text": "Is there a measure of usefulness?  I can put together a conference via Ted Talks but it doesn't mean it's useful for networking and sales opportunities.",
            "title_similarity": "0.46138746",
            "sentiment_compound": 0.2242
        },
        {
            "id": "hp7ptpy",
            "score": 1,
            "text": "Start with the climate summits.",
            "title_similarity": "0.30538952",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7pv76",
            "score": 1,
            "text": "Virtual conferences don't make any sense. 99% of the value of a conference is face-to-face networking. Meeting new people you didn't anticipate meeting, learning about what they do, walking through the convention hall and learning new things about what's out there. \n\nThe actual presentation+questions part can be accomplished by posting a list of videos and providing a discussion forum (or even just the presenters' e-mail addresses!)",
            "title_similarity": "0.76470464",
            "sentiment_compound": 0.68
        },
        {
            "id": "hp7pveh",
            "score": 2,
            "text": "Sure, but the real problem is a select few corporations putting out 90% of emissions. Not some regular people commuting to work every day.",
            "title_similarity": "0.75018543",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hp7q0fq",
            "score": 1,
            "text": "Nobody goes to a conference to listen to a presentation.",
            "title_similarity": "0.39210492",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7q25m",
            "score": 1,
            "text": "Next step. Kill ourselves right?",
            "title_similarity": "0.36233696",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hp7qgmf",
            "score": 1,
            "text": "Online conventions suuuuuuuuuuuuuuuck..ck",
            "title_similarity": "0.29606634",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7qhae",
            "score": 1,
            "text": "The thousands of hotel and convention employees and the travel industry in general say F off",
            "title_similarity": "0.51711196",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7ra3m",
            "score": 1,
            "text": "I’m a\nHuge fan of working from home and working remotely. I’m big into to tech and digital and have attended several conferences during the pandemic. All I can say is they are garbage compared to in person.",
            "title_similarity": "0.5929737",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hp7rf5n",
            "score": 1,
            "text": "But then where would all these professionals get their infidelity done?",
            "title_similarity": "0.30474803",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7riw9",
            "score": 1,
            "text": "This is like spitting on a wildfire to try and put it out.",
            "title_similarity": "0.43229938",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hp7rqs6",
            "score": 1,
            "text": "[Carbon footprint is a concept invented by ogilvy & mather](https://mashable.com/feature/carbon-footprint-pr-campaign-sham) to transfer emotional responsibility from big polluters(they developed it for Exxon) to retail polluters while distracting from effective legislation that would cut pollution and profits for the big polluters.",
            "title_similarity": "0.69256246",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hp7rzr9",
            "score": 1,
            "text": "Yeah, so this happened in most first world countries over 2020 to 2021 for significant periods of time, were any changes to anything observed?",
            "title_similarity": "0.3556528",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hp7s7ei",
            "score": 2,
            "text": "I'm down but get back to me when all climate change conferences are on board",
            "title_similarity": "0.63339216",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7s7ug",
            "score": 2,
            "text": "It would literally destroy half the businesses and livelihoods of people who use conferences to pitch their work. People who say online work culture are better don't know how much social and economic mobility it gives people who show up.",
            "title_similarity": "0.7608491",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hp7sb66",
            "score": 1,
            "text": "But the free food and snacks…",
            "title_similarity": "0.13065071",
            "sentiment_compound": 0.6652
        },
        {
            "id": "hp7sfzb",
            "score": 1,
            "text": "I understand the carbon benefits of not commuting to work, but I think people are underplaying the benefits of interacting with more than a handful of people each day.",
            "title_similarity": "0.6825868",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hp7spyz",
            "score": 2,
            "text": "Fn stupid. Meet in person = better relationships = better experience for the customer. Video and government bs need to stop!",
            "title_similarity": "0.6672858",
            "sentiment_compound": 0.126
        },
        {
            "id": "hp7tdmb",
            "score": 2,
            "text": "Nobody is attending an online convention. Plus everyone knows the conventions in Vegas are really about the “extracurriculars “ more then the convention.\n\nEdit: all conventions are really about the “extracurriculars” more then the convention. It’s a paid vacation for most",
            "title_similarity": "0.6603546",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7uo6q",
            "score": 1,
            "text": "Virtual conferences are such a boring drag though. I love being able to wander between presentations/lectures or poster presentations and network. You can't really do that very efficiently virtually.",
            "title_similarity": "0.5278371",
            "sentiment_compound": 0.6115
        },
        {
            "id": "hp7uyo2",
            "score": 1,
            "text": "Yes. And this is why “pandemic” was invented for. Only stupid dissagree.",
            "title_similarity": "0.47020876",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hp7uzqv",
            "score": 2,
            "text": "No substitute for meeting face to face when trying to build long term meaningful human relationships tho",
            "title_similarity": "0.35758495",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hp7vcik",
            "score": 1,
            "text": "One of my professional conferences is probably a mixed bag online--a lot of people struggle to travel because they're freelance, but going allows them to network, which they don't get normally. (Also, people use these as a \"vacation\" from the family and get drunk. :-D)\n\nThe other conference I can go to (and am *far* more likely to go to) works OK online, since most of the people don't *desperately* need the networking and the online format does most of the job of the offline one. Of course, I'm sure it doesn't work well at *all* for the vendors, who usually have a captive audience they can give swag to and promote their stuff to.\n\nWe were even able to attend some recent online sessions of another agency's conference, which I *think* was free to watch, as long as you registered...but we'd never have gone in person. So that was nice.",
            "title_similarity": "0.6506985",
            "sentiment_compound": 0.9473
        },
        {
            "id": "hp7vj50",
            "score": 1,
            "text": "As long as we have people working in factories and office in same buildings there will forever be discrimination lawsuits holding wfh back from becoming a reality. Currently dealing with this myself.",
            "title_similarity": "0.52453506",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hp7y7s9",
            "score": 1,
            "text": "What individual people do - even on scale - has such a small, minute impact on climate. \n\nReal change needs to come from major corporations, factories, etc. who operate ridiculously inefficient plants & warehouses, consuming abundances of energy.",
            "title_similarity": "0.6776796",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hp7yy5s",
            "score": 2,
            "text": "Mother Earth reducing world population and then teaching us a lesson about sustainability and priorities",
            "title_similarity": "0.5987642",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7z6qn",
            "score": 1,
            "text": "Who is going to tell the world’s governments?",
            "title_similarity": "0.33723325",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7znts",
            "score": 1,
            "text": "Or… abolish meetings forever.",
            "title_similarity": "0.52280384",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp7zryi",
            "score": 1,
            "text": "Yall know as well as I do that most of us need to, as bill burr said, walk into the ocean for climate change to be helped.",
            "title_similarity": "0.556688",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hp7zspl",
            "score": 1,
            "text": "Yeah but the vacations?",
            "title_similarity": "0.0961048",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hp807fz",
            "score": 2,
            "text": "Anyone in a professional environment and has attended virtual conferences over the past two years can attest to the fact that they are NOT the same.\nI just stopped going to virtual conferences because there isn’t anything in them I can’t get from a video on a vendors website..\nIf you’re going to try to save a carbon footprint by virtualizing a previously in person conference, just go ahead and cancel it. It’s not worth the effort.",
            "title_similarity": "0.78443044",
            "sentiment_compound": -0.0941
        },
        {
            "id": "hp808sy",
            "score": 1,
            "text": "Major Corporations cause climate change, not that conference in Cincinnati",
            "title_similarity": "0.6939057",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp81d5w",
            "score": 1,
            "text": "Have the authors of this paper never been to a conference? Having one online mostly defeats the purpose.\n\nHard to meet people and network when everyone is only half paying attention, plus going to a cool city for a conference is fun and a good opportunity to meet up with old friends and associates.",
            "title_similarity": "0.6470814",
            "sentiment_compound": 0.8934
        },
        {
            "id": "hp827dw",
            "score": 1,
            "text": "Moving conferences online actually hurts the economy without doing anything to the environment. Online conferences are useless. That means that the deals, networking, jobs and many other things that conferences provided are not being provided. Overall the impact to companies with large conferences will be felt several years down the road. In my profession I can think of two in particular who will lose billions by moving conferences online: Amazon AWS and Salesforce. I believe all companies will restart conferences as soon as Covid clears up.",
            "title_similarity": "0.8328335",
            "sentiment_compound": -0.765
        },
        {
            "id": "hp829jk",
            "score": 1,
            "text": "I cycle to work. This is a LA meme.",
            "title_similarity": "0.22577757",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp82cxi",
            "score": 1,
            "text": "Yeah, fantastic step up. We can also close ourself in our home, not go out anymore and live a virtual life, that also will help climate change.\n\nFFS this pandemic has flipped our brain with this virtual BS.",
            "title_similarity": "0.73509455",
            "sentiment_compound": 0.4528
        },
        {
            "id": "hp83and",
            "score": 1,
            "text": "This'll kill the convention/hospitality segment in cities like Las Vegas, New Orleans, San Diego, Orlando, Chicago, etc.... as well as the support industries that create all those fantastic booths, displays, events, green rooms, stage shows, concerts, awards shows... \n\nZoom is great, but there are people who rely on the physical gathering of other people for their income.",
            "title_similarity": "0.69101256",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hp84gre",
            "score": 1,
            "text": "Are you taking into account China and India doing their part?",
            "title_similarity": "0.24317816",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp84xef",
            "score": 1,
            "text": "As a conference speaker, I have lost any momentum I had with the virtual format. It's convenient, but the engagement is SO low, the tech issues are incredibly distracting and building connections for my business is at the bare minimum and sometimes not at all. We are told to keep things engaging and interactive but people have gotten comfortable turning their cameras off and doing the dishes.   \nI know I am not alone, and my guess is, if everything stays virtual, a lot of the more engaging speakers will have moved on to something else.",
            "title_similarity": "0.62781036",
            "sentiment_compound": 0.845
        },
        {
            "id": "hp85oc8",
            "score": 1,
            "text": "So what’s the carbon footprint of a meeting anyway? All aviation is 2% of global emissions. Bet we’re gonna save the world with online meetings!",
            "title_similarity": "0.8156832",
            "sentiment_compound": 0.5411
        },
        {
            "id": "hp868o9",
            "score": 2,
            "text": "Sorry, but in-person communication is exactly the means through which we're designed to collaborate. Only spent the last forever doing it. People complain about being isolated by technology and then think that isolating oneself through technology will improve the workplace. For me, a hybrid would work, but I need to have real socialization to have a connection with my team members.",
            "title_similarity": "0.5887589",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hp87cuu",
            "score": 1,
            "text": "And think of the corresponding boost to quality of life and reduction in accidents with fewer people-miles travelled",
            "title_similarity": "0.49354333",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hp88ed7",
            "score": 1,
            "text": "Meanwhile, the 100 companies responsible for 71% of climate change go along as normal. Kinda sick how media focuses on some person recycling a cup or not traveling to a meeting when the real problem is elsewhere.",
            "title_similarity": "0.8150587",
            "sentiment_compound": -0.5279
        },
        {
            "id": "hp89hhx",
            "score": 2,
            "text": "….and the effect on CO2 is….nothing.  Morons.   \n\nhttps://gml.noaa.gov/ccgg/trends/",
            "title_similarity": "0.51990163",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hp8ai8v",
            "score": 1,
            "text": "This is why hybrid is the future. More interactions are possible and there are already solutions for the B2B world.\n\nhttps://www.hybrid-rakete.de/special-achema-2022/",
            "title_similarity": "0.2972085",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hp8ap4r",
            "score": 1,
            "text": "Save more energy, by having that meeting that could have been an e-mail... Be an e-mail.",
            "title_similarity": "0.45992976",
            "sentiment_compound": 0.6801
        },
        {
            "id": "hp8c9e9",
            "score": 2,
            "text": "I'm tired of all of our efforts on reducing climate change being focused on these drop-in-the-bucket differences that can be made by individuals. If we're going to control emissions, it needs to be done at the corporation level. Changes like this are never going to do anything substantive; it's just optics.",
            "title_similarity": "0.7127588",
            "sentiment_compound": 0.296
        },
        {
            "id": "hp8droh",
            "score": 2,
            "text": "But then how will everyone get drunk and cheat on eachother?",
            "title_similarity": "0.36871573",
            "sentiment_compound": -0.7964
        },
        {
            "id": "hp8ervm",
            "score": 2,
            "text": "But how will I get my pens, socks, stickers, and other swag?",
            "title_similarity": "0.20137465",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp8g78v",
            "score": 1,
            "text": "Scream that louder so members of Congress and their staff can hear!",
            "title_similarity": "0.26923892",
            "sentiment_compound": -0.4574
        },
        {
            "id": "hp8gchx",
            "score": 1,
            "text": "Online conferences are also pointless.",
            "title_similarity": "0.4784427",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp8gzbm",
            "score": 2,
            "text": "If only politicians did the same.",
            "title_similarity": "0.27571043",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp8j85b",
            "score": 1,
            "text": "This would put thousands out of a job.",
            "title_similarity": "0.5529992",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp8k6ul",
            "score": 1,
            "text": "Climate lockdowns incoming",
            "title_similarity": "0.407242",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp8ka09",
            "score": 1,
            "text": "How are people going to live large in the company dime and cheat on their spouses online?",
            "title_similarity": "0.62103605",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hp8kbo3",
            "score": 1,
            "text": "The one thing I’m curious about is how many people work more than they did when they were remote. I never stayed late in the office because I had to get home but now, without a commute, I put in more hours because I don’t have to drive.",
            "title_similarity": "0.55846095",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hp8l5e1",
            "score": 1,
            "text": "i do not care about climate change , people should meet face to face for business.",
            "title_similarity": "0.54169667",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hp8l5tt",
            "score": 1,
            "text": "Um… how are we suppose to get totally fit shaced drunk on the company dime and see who shows up the next morning and/or if they survive to lunch?\n\nSincerely, some of my strongest connections with co-workers has been through conferences like this.",
            "title_similarity": "0.6699947",
            "sentiment_compound": 0.8238
        },
        {
            "id": "hp8ll3b",
            "score": 1,
            "text": "Online conferences are basically useless. The entire point of conferences is the thousands of conversations. Any an all presentations don't need to be at a \"conference\" if they're online.",
            "title_similarity": "0.6919782",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hp8miko",
            "score": 1,
            "text": "I do conferences for a living.  Lighting Design specifically.  This scares the hell out of me, but the comments bring me some good life.  We depend on these to make a career, and the last 2 years have been horrible.  My whole industry had a big resurgence in the latter half of 2021, but we all hope that 2022 is the renewal in conferences again.  \nI hope you're all telling those in charge that you demand those in-person events!",
            "title_similarity": "0.6506449",
            "sentiment_compound": 0.3954
        },
        {
            "id": "hp8mp1x",
            "score": 1,
            "text": "I have been working from home a lot and then going in person for all meetings, hearings, etc. and to me thats the perfect balance because 1/5 of my days i drive and get to see people im person and its better for that purpose - and 4/5 of the time i drive less and do leas laundry and eat better at home and save time and get just as much work done as if i was sitting by myself in my office at work doing it.",
            "title_similarity": "0.6003293",
            "sentiment_compound": 0.9136
        },
        {
            "id": "hp8mr6p",
            "score": 1,
            "text": "I feel like the fact that workers aren't driving cars is getting downplayed a lot. I went from driving about 100 miles a week in my car (granted, it's very fuel efficient) to driving around 40 now. We hybrid work some days from home and some in the office. This should be way more pushed for businesses going greener.",
            "title_similarity": "0.718158",
            "sentiment_compound": 0.7635
        },
        {
            "id": "hp8msj6",
            "score": 1,
            "text": "I want actual stats.\n\nData consumes a ton of power.",
            "title_similarity": "0.29397893",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hp8okvr",
            "score": 1,
            "text": "Conferences are about getting free food, booze and meeting people that are useful for your career.  None of which occur online",
            "title_similarity": "0.5473764",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hp8oy0z",
            "score": 1,
            "text": "No more human contact. Just take the blue pill. Own nothing. Give up all your rights. This is the way.",
            "title_similarity": "0.416124",
            "sentiment_compound": -0.296
        },
        {
            "id": "hp8oyf3",
            "score": 1,
            "text": "As someone who has worked for quite a few years in the event industry, I can assure you it is an extremely contaminating industry, much more than any average person could imagine, and further more creates a ridiculous amount of waste, mostly construction and building materials that will just be used once. It's much more profitable to get new stuff than to deal with the cost of recycling. You have no idea until you see the end of a big corporate international event.",
            "title_similarity": "0.69332266",
            "sentiment_compound": 0.0573
        },
        {
            "id": "hp8p7ah",
            "score": 1,
            "text": "Management at my place would freak (more than they already are). Seems their egos survive off seeing the underlings.",
            "title_similarity": "0.5335998",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hp8pai4",
            "score": 1,
            "text": "I just can't take a group seriously that says they want to reduce the carbon footprint yet AR pro lithium mines",
            "title_similarity": "0.5699227",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hp8rc8k",
            "score": 1,
            "text": "Old management just wont get that, changes are not acceptable.",
            "title_similarity": "0.33800548",
            "sentiment_compound": -0.2411
        },
        {
            "id": "hp8rltv",
            "score": 1,
            "text": "And yet prices, still go up and employees don't get paid enough while stocks are through the roof and shareholders make record profits doubling every year.",
            "title_similarity": "0.5468941",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hp8s2w2",
            "score": 1,
            "text": "i went over to a Gaylord convention center to look at the Christmas Decorations on a week day a few years ago.  They had some sort of business convention - maybe a finance convention.  Lots of people came.  I wonder how many flew into the airport let alone drove 10+ miles alone (without a passenger/car pool).  I saw a line of cars picking up and dropping of passengers at the entrance. \n How much gasoline is used for the attendees to go to the convention center?  I took to bus from the subway station to the convention center.  Just my thoughts.",
            "title_similarity": "0.6786815",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hp8sstl",
            "score": 1,
            "text": "I think all this is pretty meaningless when it’s 70% or more the massive production corporations doing all the big contributions but ya ok cool",
            "title_similarity": "0.61739326",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hp8uhdg",
            "score": 1,
            "text": "Why have a convention then, isnt the whole point to go out and meet people",
            "title_similarity": "0.4182886",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp8ujt9",
            "score": 1,
            "text": "This is actually really bad news",
            "title_similarity": "0.2362902",
            "sentiment_compound": -0.5849
        },
        {
            "id": "hp8umfk",
            "score": 1,
            "text": "One of our executives went to a climate conference. In Europe. Meaning they, and most of the other attendees, flew there. It was hard not to laugh at my cubicle when the corporate email publication came through",
            "title_similarity": "0.59791565",
            "sentiment_compound": -0.5145
        },
        {
            "id": "hp8uu9b",
            "score": 1,
            "text": "Is this really new though? It would also reduce crime but is also startlingly close to Marshall law.  People are social creatures. The only way to prevent us from wanting to congregate and actually see people in person is to force us not to.",
            "title_similarity": "0.49677834",
            "sentiment_compound": -0.3716
        },
        {
            "id": "hp8v83d",
            "score": 1,
            "text": "But what about the hookers and the blow?",
            "title_similarity": "0.23326953",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp8v8mz",
            "score": 1,
            "text": "Brings about more dry eye syndrome as well",
            "title_similarity": "0.25204882",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hp8vl0s",
            "score": 1,
            "text": "Less executives \"living\" on expense accounts?",
            "title_similarity": "0.49362352",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp8vvsq",
            "score": 2,
            "text": "And oil and gas companies could stop killing the planet but nooooo",
            "title_similarity": "0.6337823",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hp8we90",
            "score": 2,
            "text": "Blame top greedy corporations for destroying environnement? Nah, lets focus on the most minor contributors like plastic straws and work meetings.",
            "title_similarity": "0.6750216",
            "sentiment_compound": -0.6293
        },
        {
            "id": "hp8y91h",
            "score": 2,
            "text": "Except it's about the party and networking.  Not the PowerPoints and zoom calls.  If they go remote the carbon footprint will eventually reduce even more because less will actually bother",
            "title_similarity": "0.7259047",
            "sentiment_compound": 0.144
        },
        {
            "id": "hp8yly3",
            "score": 1,
            "text": "And maybe not charche $2000 day?",
            "title_similarity": "0.4659122",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp8yxcu",
            "score": 1,
            "text": "Yet another don't use cars and ACs argument.",
            "title_similarity": "0.28517342",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hp8z5cr",
            "score": 1,
            "text": "Your computer burns 40-250 watts according to Google.\n\nYour car burns about 200-1000 times that for every 100 or so miles\n\nLogic checks out.",
            "title_similarity": "0.64369774",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp8zf3m",
            "score": 1,
            "text": "Won’t change the minds of bosses of small & medium enterprises to go the virtual meetings route unless climate change priorities also mean **immediate** buckaroos saved for them. They don’t care about employees’ well-being and financial independence; they are going to drive in their Beemers, smoke cigars and drink at a hostess club for “business meetings.”",
            "title_similarity": "0.6916292",
            "sentiment_compound": 0.7184
        },
        {
            "id": "hp8zidw",
            "score": 1,
            "text": "I personally LOVE watching professional presentations online from home! No airport hassles, delayed reimbursement, AND watching in my pjs and slippers in my own home! Sure, once in a while going to a nice town but usually too busy to enjoy anyway.",
            "title_similarity": "0.49109095",
            "sentiment_compound": 0.8538
        },
        {
            "id": "hp8zpdo",
            "score": 1,
            "text": "But when the G7 meet to discuss climate change, it has to be in person",
            "title_similarity": "0.44506246",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp904pp",
            "score": 1,
            "text": "And then there's cruise ships.",
            "title_similarity": "0.20094635",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp91pmg",
            "score": 1,
            "text": "Pretty darn anti - science.  And of course, right here.  \n\nSorry, but using regulations to eliminate conferences and meetings and conventions, sounds a bit like using regulations to eliminate all human movement.  \n\nSo who decides what human movement is allowed ?  And what is not ?  \n\nThis is the core problem with proposing a solution for global warming that has no scientific evidence that it will work.    \n\nOne could also argue it is just a new form of greenwashing - like \"eliminating straws\"  or \"eliminating styrofoam food packages\".\n\nBut here is an even better arbitrary and unproven solution  - regulate away all movement of goods and services.  \n\nAnd make everyone reliant entirely on the food that can be grown on the side of the highways and road and fields and ditches.\n\n[The homeless can grow food by bridges and underpasses]\n\nGlobal warming solved.   Indeed.",
            "title_similarity": "0.76334685",
            "sentiment_compound": 0.8992
        },
        {
            "id": "hp91yip",
            "score": 1,
            "text": "Moving conferences completely online also completely defeats the point of conferences.",
            "title_similarity": "0.69743705",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hp928r1",
            "score": 1,
            "text": "Conferences are good for the local economy. Plus in person is more fun",
            "title_similarity": "0.34480596",
            "sentiment_compound": 0.7574
        },
        {
            "id": "hp93hzt",
            "score": 1,
            "text": "Do all the studies you want, all companies will have us back in that office doing our in person meetings, and all conventions will be in person too.",
            "title_similarity": "0.44924223",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hp93qsu",
            "score": 1,
            "text": "Perhaps some good will come from all the COVID issues",
            "title_similarity": "0.14321238",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hp94ig5",
            "score": 1,
            "text": "Was this research “sponsored” by Meta?",
            "title_similarity": "0.030072536",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp96asw",
            "score": 1,
            "text": "At the cost of losing the human connection.",
            "title_similarity": "0.27879655",
            "sentiment_compound": -0.3818
        },
        {
            "id": "hp98h08",
            "score": 1,
            "text": "There’s nothing worse than being the presenter or exhibitor at a virtual conference. You might as well have a second screen to get your real work done wile you babysit the virtual lobby. As others have shared, the real value of in person conferences comes from the networking connections you make outside of the formal sessions.",
            "title_similarity": "0.5512134",
            "sentiment_compound": 0.8203
        },
        {
            "id": "hp98ro7",
            "score": 1,
            "text": "True, but depending on the conference that's not as fun. Part of the enjoyment can be the travel, and what happens when the presentations end for the day. Plus it's a great time to be social with colleagues you haven't seen in person in a while. But this is definitely good for having more conferences, for small conventions, etc.",
            "title_similarity": "0.52975976",
            "sentiment_compound": 0.9538
        },
        {
            "id": "hp9be70",
            "score": 1,
            "text": "What about the 5000 AFC’s which are going to run 9 hours a day",
            "title_similarity": "0.47302294",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp9com5",
            "score": 2,
            "text": "Ngl I’m cringing at our robo future",
            "title_similarity": "0.26877773",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp9d6k1",
            "score": 1,
            "text": "Science is truly terrible at measuring culture and morale.",
            "title_similarity": "0.44335467",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hp9d9xy",
            "score": 1,
            "text": "Yes but then I don’t get to go somewhere new and get drunk with my friends for free \n\nI’m out",
            "title_similarity": "0.49219063",
            "sentiment_compound": 0.81
        },
        {
            "id": "hp9ezgi",
            "score": 2,
            "text": "Disabled people have been trying to make this happen for years.",
            "title_similarity": "0.18978758",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp9fmk3",
            "score": 1,
            "text": "I can imagine the amount of waste it would reduce, like single use plastics, bottled water, and those stupid things they give away. Confs could do regional small hh/meetups afterwards for networking.",
            "title_similarity": "0.63349104",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hp9fvxj",
            "score": 1,
            "text": "That doesn't scrape the surface of what damage just a handful of corporations dole out upon us. I like the idea but it's negligible the difference it might make. Wish it wasn't that way and things like this would change it for us but I don't believe it would. I could always be wrong though.",
            "title_similarity": "0.51255345",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hp9gn53",
            "score": 1,
            "text": "What kills me is my company (who really fought sending engineers home) finally ‘forced’ everyone to come back to the office and still 90% of the meetings occur over Teams with people in their own cubes/offices. Bunch of idiots they are.",
            "title_similarity": "0.7235034",
            "sentiment_compound": -0.7264
        },
        {
            "id": "hp9h4xn",
            "score": 3,
            "text": "It also reduces participation by 94% from what I can tell at my work",
            "title_similarity": "0.7547372",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp9jpfq",
            "score": 1,
            "text": "Fantastic logic on this one. Either have machines waste energy by streaming a live feed over the internet, or just walk your butt into a conference room and talk it out.  Or are they seriously implying that people don't need to go out of the house? Who the hell is writing this crap?",
            "title_similarity": "0.65869",
            "sentiment_compound": -0.7757
        },
        {
            "id": "hp9k6pq",
            "score": 1,
            "text": "Guess there’s no more job where you fly around everywhere because the company rather pay for the flight than hire someone locally. Zoom is causing unemployment haha",
            "title_similarity": "0.67541206",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hp9k9ih",
            "score": 1,
            "text": "From a consulting perspective…. I have noticed that meeting the client and the project team in person at the beginning of a project vs meeting them over a Teams call completely shifts the dynamic of the entire project.  Clients treat the implementation team a hell of a lot better when they know they have to see them in person again at some point.",
            "title_similarity": "0.57725835",
            "sentiment_compound": 0.4336
        },
        {
            "id": "hp9l1t8",
            "score": 2,
            "text": "And you also remove 99% of the chance that a conference can have any meaningful impact, because most of the times it's about the in-person interaction, both planed and unplaned.\n\nI never was a fan of those things, but the point never was what was happening on stage.",
            "title_similarity": "0.6851202",
            "sentiment_compound": 0.1702
        },
        {
            "id": "hp9mk7u",
            "score": 1,
            "text": "It’s too bad so many are ignoring the science on this and clinging to in person work, even as the pandemic seems to never let up. There are some jobs that can’t be done at home, but there are many great reasons why it should be embraced when it can be.",
            "title_similarity": "0.5335163",
            "sentiment_compound": 0.5296
        },
        {
            "id": "hp9rhw6",
            "score": 2,
            "text": "Nothing we do is going to help climate change. China is responsible for 95% of the world's pollution, until they get policed, nothing will improve even if the rest of the world is doing their part.",
            "title_similarity": "0.7868953",
            "sentiment_compound": 0.3806
        },
        {
            "id": "hp9ro7t",
            "score": 1,
            "text": "As someone who works in corporate events…..please don’t",
            "title_similarity": "0.45022452",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp9u4rw",
            "score": 1,
            "text": "Just sit in your pod and eat the bugs.",
            "title_similarity": "0.32110038",
            "sentiment_compound": 0.0
        },
        {
            "id": "hp9uym0",
            "score": 1,
            "text": "I thought this was obvious. Extremely frustrated this isn't talked about more.",
            "title_similarity": "0.22165534",
            "sentiment_compound": -0.5709
        },
        {
            "id": "hp9x1yz",
            "score": 1,
            "text": "Glad to see so many people pointing out that basic human interaction is not the cause of climate change.  \n\n\nThis is the exact thing that the conspiracists in /r/lockdownskepticism are seizing on btw",
            "title_similarity": "0.5200481",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hp9xczk",
            "score": 2,
            "text": "Hybrid sucks. All or nothing. Or make the tech a lot better.",
            "title_similarity": "0.5185516",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hp9y5ga",
            "score": 2,
            "text": "Another way to reduce carbon emissions dramatically is to hold the rich corporations responsible for them because they cause almost all of the emissions rather than acting like it's something that can be fixed by just having less in person meetings",
            "title_similarity": "0.7364485",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hpa43hy",
            "score": 1,
            "text": "Climate lockdowns coming",
            "title_similarity": "0.42833886",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpa4nm3",
            "score": 1,
            "text": "Seems to me like no one on this thread has any imagination. Having an event online doesn't mean you need to reduce it to a sequence of a dozen talks on zoom. If networking is a big part of the allure for that particular event, then you can help people network online in a myriad of ways. Just doing it exactly the same way you always have, but stripping away everything other than the actual talks, is obviously not going to work great if listening to the talks wasn't the main reason people went there.\n\nFor example, it could be as simple as having a series of chatrooms about fairly specific parts of the event (too large and it will be hard to make any personal connections), where casually joining and leaving at your leisure and informal talk is welcome. Or you could try something fancier towards the \"virtual reality\" angle, and basically host it on a simple MMO (no need for VR headsets or anything like that, a regular one will do just fine) -- most of my longest lasting friendships are people I met online in settings similar to that (IRC or random online games), I don't see why it couldn't work for a conference unless people actively sabotage it because it's new and they feel they are \"too good for these gimmicks\".",
            "title_similarity": "0.637323",
            "sentiment_compound": 0.9724
        },
        {
            "id": "hpa72rp",
            "score": 1,
            "text": "Just purchased a property about an hour away.\nReal estate agent is in his 60s, and is all, I'll bring you the documents.\nWe steadfastly refused, and made him put them through DocuSign, so we could do It at our convenience.\nHe was unhappy about it. Why? We saved him a 2 hour round trip, and petrol, and the environment.\nCan't teach old dogs new tricks hey",
            "title_similarity": "0.760207",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hpa7adb",
            "score": 1,
            "text": "Yes, peasants should stay at home. Those with private jets should obviously still fly to their climate conferences.",
            "title_similarity": "0.38892943",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpa83h9",
            "score": 1,
            "text": "Yes, and suicides will skyrocket when we don’t see others in real life anymore. Also reducing carbon.",
            "title_similarity": "0.7033477",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpa8nr0",
            "score": 1,
            "text": "I love attending conferences for the social and academic benefits, but have really expanded my networking and collaboration circle through virtual opportunities presented by Covid.  In my field we have put on multiple online sessions that attracted an audience that would not have been able to attend in person conferences.  Collaboration is through the roof with these online mini sessions (20-50 attendees usually), and I'm now working with lots of people that I've never met face to face.   The next big conference in my field is in the USA in March, but as a European who doesn't feel right travelling yet, I'm glad they've got 2 days dedicated to online sessions.",
            "title_similarity": "0.6135441",
            "sentiment_compound": 0.9509
        },
        {
            "id": "hpag7tb",
            "score": 1,
            "text": "Wait, we’re slowly finding out the “economy” is responsible for destroying our planet and our lives? Huh",
            "title_similarity": "0.6022196",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hpb8z4r",
            "score": 1,
            "text": "You won't have any real human interactions anymore, and you'll be happy.",
            "title_similarity": "0.33304116",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hpbwm5v",
            "score": 1,
            "text": "Not that this is logical,  but what if they invented covid to combat global warming?",
            "title_similarity": "0.56276345",
            "sentiment_compound": -0.296
        },
        {
            "id": "hrguw86",
            "score": 1,
            "text": " OFF!!!,much coupon code KNMASK in toolant.com.You can buy FDA EUD approved KN95 masks in toolant.com. $0.84 each, 50pcs kn95 masks less than $45 with coupon code KNMASK.",
            "title_similarity": "0.67182595",
            "sentiment_compound": 0.5684
        }
    ]
}