{
    "Study: Watching a lecture twice at double speed can benefit learning better than watching it once at normal speed. The results offer some guidance for students at US universities considering the optimal revision strategy.\n": [
        {
            "id": "hpo1129",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.66023254",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hpo4hne",
            "score": 24,
            "text": "Would this not entirely be dependent on how a student learns at an individual level. Everyone doesn’t “learn” the same way, I don’t see how someone who learns better from reading textbooks would learn better from watching a lecture twice at fast speed.",
            "title_similarity": "0.7003623",
            "sentiment_compound": 0.7003
        },
        {
            "id": "hpogrkp",
            "score": 0,
            "text": "I use to watch lectures on quantum mechanics at double speed and when I'm very tired. The trick is to start at 1.25 and gradually increase. I don't pretend to understand fully, but at least I do get a lot from them than watching normally.",
            "title_similarity": "0.7458826",
            "sentiment_compound": -0.1357
        },
        {
            "id": "hpombh9",
            "score": 0,
            "text": "You can also 4x with Adderall and take your professor’s job and wife.",
            "title_similarity": "0.573614",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoacrz",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.042782888"
        },
        {
            "id": "hpo84v3",
            "score": 2,
            "text": "What if I’m at a non-US university? Would I still benefit?",
            "title_similarity": "0.418316",
            "sentiment_compound": 0.5204
        },
        {
            "id": "hpo5bpf",
            "score": 50,
            "text": "[removed]",
            "title_similarity": "-0.042782888"
        },
        {
            "id": "hpojxaj",
            "score": 5,
            "text": "[removed]",
            "title_similarity": "-0.042782888"
        },
        {
            "id": "hpoahqm",
            "score": 1,
            "text": "Once at double speed is the optimal.\n\nSource: Me",
            "title_similarity": "0.5140091",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpot8j1",
            "score": 7,
            "text": "I bet watching it twice at normal speed is even better.",
            "title_similarity": "0.62752974",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpob82p",
            "score": 0,
            "text": "Same goes for reading. Takes a little getting used to but definitely works",
            "title_similarity": "0.52415025",
            "sentiment_compound": 0.5499
        },
        {
            "id": "hpod0nj",
            "score": 0,
            "text": "I used to record the lectures then listen to them again later while at the gym or gaming kind of like listening to a podcast. It seemed to help.",
            "title_similarity": "0.6642866",
            "sentiment_compound": 0.6003
        },
        {
            "id": "hpofj23",
            "score": 0,
            "text": "I typically speed up most things on the YouTube that I watch. It saves time and I learn more quicker",
            "title_similarity": "0.6753711",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpofji0",
            "score": 0,
            "text": "This is how I do it on Pluralsight. Put on video, change to 1.5x speed, watch twice.",
            "title_similarity": "0.50314236",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpofm7a",
            "score": 0,
            "text": "That’s what I always did…or I sped it up even more and read the transcript.",
            "title_similarity": "0.5029951",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpog4mn",
            "score": 0,
            "text": "For me, when watching my lectures at normal speed, they actually talk as if the video is at half speed.  So i just OBS it and double speed to make it normal.",
            "title_similarity": "0.70908487",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpog952",
            "score": 0,
            "text": "I began watching on prof's lessons at 3x speed during lockdown. When we had in-person classes again I had to fight hard not to fall asleep because he spoke so slowly.",
            "title_similarity": "0.6526053",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hpogmaq",
            "score": 0,
            "text": "For Americans, \"revision\" is British for \"studying\".",
            "title_similarity": "0.46446276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpogvkm",
            "score": 0,
            "text": "I knew this , why know one asked?",
            "title_similarity": "0.107670605",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpogzrs",
            "score": 0,
            "text": "Once at 1.5x is better than once at 1x for me. People talk so slow I don’t even listen. If you are a lecturer, NEVER say - um , uh , basically , and , so - or other words that do not add value. Do not use fillers and people will stay engaged.",
            "title_similarity": "0.5058072",
            "sentiment_compound": 0.552
        },
        {
            "id": "hpoj4ot",
            "score": 0,
            "text": "i feel like i cant concentrate on what my prof is saying sometimes in real life speed so I like recordings and going 2x or 2.5x so I can stay focused.",
            "title_similarity": "0.6667683",
            "sentiment_compound": 0.7832
        },
        {
            "id": "hpoj5cf",
            "score": 0,
            "text": "We just need to take note taking skills.  I've seen plenty of people recording or transcribing lectures and in reality they just need a single page of notes for highlights and some Sun points for the stuff they don't understand immediately.  Spending hours rewarding lectures is a complete waste of time.",
            "title_similarity": "0.5993402",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hpojmd9",
            "score": 0,
            "text": "Yep. Can back this. Have been using this technique for training dense techy material.",
            "title_similarity": "0.4456118",
            "sentiment_compound": 0.296
        },
        {
            "id": "hpok4dj",
            "score": 0,
            "text": "We know. A coworker and I have both done this method at university.",
            "title_similarity": "0.5091189",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpokujz",
            "score": 0,
            "text": "It’s what I did in college",
            "title_similarity": "0.3552413",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoldfh",
            "score": 0,
            "text": "I watched every lecture at 1.5-2x speed depending on how fast the lecturer spoke. Saved loads of time, wish I figured it out at the beginning of my degree.",
            "title_similarity": "0.7418096",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hpoxwab",
            "score": 0,
            "text": "There are people who listen to Audiobooks at 2x or up to 4x speeds. I don't.\n\nI wonder of those people have a correlation with the results of this study.",
            "title_similarity": "0.5557779",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpozwts",
            "score": 0,
            "text": "I watch and listen to media at 2x speed. Replays, voice messages, YouTube videos, anything where timing isn't a factor (such as movies, comedy specials). Maybe it's the ADHD or just general impatience, but I feel like everything has gotten really slow and I need something to move things along.",
            "title_similarity": "0.623548",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hpp6lhw",
            "score": 0,
            "text": "Is it odd that I can’t seem to hold onto a single fact In online learning. I still can’t understand why tuition wasn’t reduced since it seems like half the university staff was laid off during the shutdown and NOBODY was on campus to use any utilities.",
            "title_similarity": "0.38038749",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hpp7zdp",
            "score": 0,
            "text": "If i watch a lecture twice as fast then I wouldnt understand anything. My professors are already VERY fast and this in math and physic...",
            "title_similarity": "0.6218108",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppfgis",
            "score": 0,
            "text": "the optimal revision strategy is studying with flashcards, as simple as that. \n\nThe repetitiveness ciments all the information into your brain.",
            "title_similarity": "0.5556774",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpqaxnq",
            "score": 0,
            "text": "I'll watch it at 2x speed but only once, take it or leave it.",
            "title_similarity": "0.5206872",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hpqeeoh",
            "score": 0,
            "text": "What this really says is most lectures are twice as long as they need to be.",
            "title_similarity": "0.4548175",
            "sentiment_compound": 0.0
        },
        {
            "id": "hprijsv",
            "score": 0,
            "text": "[deleted]",
            "title_similarity": "-0.0028780364"
        },
        {
            "id": "hpoj7cz",
            "score": 5,
            "text": "I’ve been doing this for years I find that cramming  at faster speed forces your mind to pay more attention. This works in the short term I just don’t know what it does for a long-term retention.",
            "title_similarity": "0.68245333",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hpod5po",
            "score": 1,
            "text": "Students today have it so much easier than those who were raised pre-Internet.",
            "title_similarity": "0.6347563",
            "sentiment_compound": 0.4728
        },
        {
            "id": "hpofah9",
            "score": 1,
            "text": "This is always why I prefer reading materials over video materials. You can set the pace on which you consume the information when you read. With a video, you're limited to the set time.",
            "title_similarity": "0.6852133",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hpojgil",
            "score": 1,
            "text": "Reading this headline as a self taught coder is amusing",
            "title_similarity": "0.51655924",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hpo9sga",
            "score": 23,
            "text": "[removed]",
            "title_similarity": "-0.042782888"
        },
        {
            "id": "hpojof7",
            "score": 8,
            "text": "Teachers should teach twice as fast",
            "title_similarity": "0.6089269",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoieea",
            "score": 10,
            "text": "Retention data one a longer period or who cares. \n\n2x on a rewatch might be a good idea for spaced repetition but I worry this boosts your test score and then 2 weeks later it's mostly gone.",
            "title_similarity": "0.705824",
            "sentiment_compound": 0.369
        },
        {
            "id": "hpoch7w",
            "score": 22,
            "text": "[removed]",
            "title_similarity": "-0.042782888"
        },
        {
            "id": "hpokvpo",
            "score": 4,
            "text": "Just wait until you find out about 3x speed",
            "title_similarity": "0.35453832",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpopozk",
            "score": 11,
            "text": "I've been preaching watching things on double speed for ages.  It really is shocking how well your brain adapts to it after a couple minutes.  If you're knowledgeable about the topic, it's even easier.  I watch all cooking videos on two times speed at this point and it feels like regular speed.",
            "title_similarity": "0.6834795",
            "sentiment_compound": 0.5302
        },
        {
            "id": "hpohmlv",
            "score": 14,
            "text": "If all you are doing is listening to the lecture, this makes sense. But my best students take notes, which would be much harder at 2X. The act of note-taking (and the research says it works better by hand than by laptop) forces students to analyze the material in real time, writing down just what’s most important.  I’d love to see a study comparing just listening to lectures at double speed with normal speed and note-taking.",
            "title_similarity": "0.8410287",
            "sentiment_compound": 0.9771
        },
        {
            "id": "hpol47f",
            "score": 5,
            "text": "I do this all the time! I tend to watch back lecture videos before reviewing for a test, as my teacher usually has in person lectures and videos as well. They always seemed to talk unbearably slow to me so in order to actually force myself to focus on it, I'd always set it to at least 1.5 -2.0 times speed depending on the teacher.",
            "title_similarity": "0.68229735",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hpoayj9",
            "score": 79,
            "text": "[removed]",
            "title_similarity": "-0.042782888"
        },
        {
            "id": "hpohvg5",
            "score": 11,
            "text": "[removed]",
            "title_similarity": "-0.042782888"
        },
        {
            "id": "hpoignm",
            "score": 12,
            "text": "Or 4 times the speed if you have ADHD haha",
            "title_similarity": "0.3315457",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpo5k19",
            "score": 216,
            "text": "is watching necessary or will listening suffice?",
            "title_similarity": "0.33627844",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpogesh",
            "score": 20,
            "text": "Something I liked from undergraduate philosophy modules was that each lecture was paired with a seminar and there was a list of relevant reading material for each pair. The lecture notes were also provided before the event so when you're in class listening to the teacher riff on the notes it isn't your first pass at the material.\n\nIn theory anyway, some modules had a fairly hefty reading list, and it was obvious in the seminars that a lot of the class hadn't read any of it, and lectures were poorly attended, but I found it really helpful on some of the more difficult modules like philosophy of language or metaphysics.",
            "title_similarity": "0.74843097",
            "sentiment_compound": 0.718
        },
        {
            "id": "hpol8vx",
            "score": 23,
            "text": "What about watching twice at normal speed?",
            "title_similarity": "0.43242943",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpodh16",
            "score": 193,
            "text": "[removed]",
            "title_similarity": "-0.042782888"
        },
        {
            "id": "hpoj2nd",
            "score": 66,
            "text": "/r/medicalschool , get in here! This is our life!",
            "title_similarity": "0.2615503",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoiioe",
            "score": 161,
            "text": "I work in IT and it requires constant learning of new technologies etc. Every cert i've ever sat for I watched the instructor videos at double speed. The only thing I ever run into is instructors with heavily accented english I may have to reduce it to 1.5 or 1.75 to understand them.",
            "title_similarity": "0.6310636",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoeqyp",
            "score": 569,
            "text": "I have ADHD that's bad enough for stuff like Adderall to barely put a dent in it and I find that if I want to actually get anything useful out of stuff that's vaguely educational (lectures, talks given at conferences, etc) I need to keep the information flowing faster than my mind can work to fill in the gaps between words with unrelated bs.",
            "title_similarity": "0.66115856",
            "sentiment_compound": 0.296
        },
        {
            "id": "hpo9hzf",
            "score": 136,
            "text": "[removed]",
            "title_similarity": "-0.042782888"
        },
        {
            "id": "hpo6z8y",
            "score": 6583,
            "text": "For those that would like to try this method: \"The timing mattered, though: only those who’d watched the 2x video for a second time immediately before a test, rather than right after the first viewing, got this advantage.\"",
            "title_similarity": "0.6785668",
            "sentiment_compound": 0.5789
        },
        {
            "id": "hpob9lq",
            "score": 1,
            "text": "I often advocate that teaching should be a two-pass operation, following on the theory that you're best able to learn something you almost already know. Listening on the first pass probably prepares your mind to know what it will be receiving. The precise process by which this preparation happens is something I'm not sure of, but I assume it to be an unconscious and not easily something that can be expressly manipulated. But on the second pass, you're going to both affirm previous neural connections and be able to take advantage of any prep that might have been done in the interim.\n\nEven at normal speed, if I were teaching (and I'm not a professional teacher but have done some ad hoc attempts at teaching people things), I like the idea of people having to sleep on an idea before it's presented a second time.  A variation on this experiment I'd like to see might be to introduce such a delay between the two viewings. Moreover, it might be that there's some advantage in going at normal speed on the second play and that the advantage is created by a fast review of the material to be discovered. Perhaps a 3x preview would do as well, as long as the second pass offered decent ability to do real intake. It seems worth exploring anyway. My hunch is that there's not just simple repetition afoot here, but a qualitative difference between what's happening on the first pass and on subsequent passes. But that could be wrong, of course, and it's why we research things.",
            "title_similarity": "0.7615675",
            "sentiment_compound": 0.9276
        },
        {
            "id": "hpodk09",
            "score": 1,
            "text": "If I saw this in like LPT I'd really have thought the poster was entirely wrong. Interesting.",
            "title_similarity": "0.3690245",
            "sentiment_compound": 0.2698
        },
        {
            "id": "hpodzsg",
            "score": 87,
            "text": "[removed]",
            "title_similarity": "-0.042782888"
        },
        {
            "id": "hpoel6t",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.042782888"
        },
        {
            "id": "hpoep0m",
            "score": 1,
            "text": "cool perspective on the whole, if a subject has known points within a presentation but a few particulars are needed by all means speed is the answer as it is when a presenter has facts yet no great grasp on being practically concise with your time.",
            "title_similarity": "0.5703168",
            "sentiment_compound": -0.5846
        },
        {
            "id": "hpofcc7",
            "score": 1,
            "text": "Where is a good source of free to view lectures?",
            "title_similarity": "0.5326958",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hpofco7",
            "score": 1,
            "text": "Doing *anything* multiple times tends to be a net benefit.  Hence the phrase \"practice makes perfect\"",
            "title_similarity": "0.53129965",
            "sentiment_compound": 0.7717
        },
        {
            "id": "hpofcq8",
            "score": 1,
            "text": "Old enough to remember speed reading, purported to do more or less the same thing. Doesn't ring a bell? My point exactly.",
            "title_similarity": "0.46818995",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpohoid",
            "score": 1,
            "text": "Maybe if really word/ math heavy lectures didn't last two damn hours..",
            "title_similarity": "0.59850335",
            "sentiment_compound": 0.3089
        },
        {
            "id": "hpoi0dp",
            "score": 1,
            "text": "Watch my lectures at double speed. Got it",
            "title_similarity": "0.5222256",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoic21",
            "score": 1,
            "text": "I watch all my lab videos at 1.8x just because they all talk so slow like they're explaining it to kindergartners.",
            "title_similarity": "0.59052444",
            "sentiment_compound": 0.4173
        },
        {
            "id": "hpoigg5",
            "score": 1,
            "text": "Up next. Watching 10 times at 10x speed",
            "title_similarity": "0.31017023",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoiox3",
            "score": 1,
            "text": "What about 100x at 100x speed?",
            "title_similarity": "0.24984361",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpojdww",
            "score": 1,
            "text": "I put quite a few \"how to\" or educational videos at 1.5X speed on Youtube. I know not everyone wants to just blurt stuff out, but  ***Gib Info Faster***",
            "title_similarity": "0.64769703",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpojfpw",
            "score": 1,
            "text": "What about watching it twice on normal speed? This seems like a pure repetition, of course you remember things better when you hear them twice.\n\nPersonally I learned best by reading through everything in the evening, immediately going to sleep, then reading through it again the next day. Despite not much effort I got pretty high marks, even in university for computer science.",
            "title_similarity": "0.74402744",
            "sentiment_compound": 0.9153
        },
        {
            "id": "hpojnnr",
            "score": 1,
            "text": "Why would this only work for students at US universities? Do they already do this elsewhere?",
            "title_similarity": "0.56410676",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpojoqc",
            "score": 1,
            "text": "Med students been doing this for years haha",
            "title_similarity": "0.37858033",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpok8yj",
            "score": 1,
            "text": "I graduated about a decade ago, so just before lecture recordings were becoming common.\n\nNow that I think of it, if I had a copy of lecture recordings to quickly rewatch before doing the relevant homework that week would have been a big help. Taking notes in class while trying to follow meant I could miss some stuff here or there. I also didn't have the luxury to usually do homework right after a lecture.",
            "title_similarity": "0.7269677",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hpoktnj",
            "score": 1,
            "text": "Have they tested watching a lecture twice @ normal speed for comparison?\nSurely doing anything more than once will encourage the brain to take it in more?",
            "title_similarity": "0.8288816",
            "sentiment_compound": 0.7622
        },
        {
            "id": "hpol4fe",
            "score": 1,
            "text": "Well listening to a professor slowly exhale doesn’t exactly make us geniuses.",
            "title_similarity": "0.37753943",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hpoliph",
            "score": 1,
            "text": "If YouTube pitch algorithm was better and cut out empty audio it could make videos even faster to watch",
            "title_similarity": "0.69269615",
            "sentiment_compound": -0.0
        },
        {
            "id": "hpom0h2",
            "score": 1,
            "text": "Two quickies better than one longy?",
            "title_similarity": "0.413627",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpom9l1",
            "score": 2,
            "text": "But what about watching it once at 2.5x speed",
            "title_similarity": "0.4211375",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpombhx",
            "score": 1,
            "text": "What if i watched it 3x at triple speed?!",
            "title_similarity": "0.3260787",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpomdcx",
            "score": 1,
            "text": "There was a study done several years ago which showed that when giving a presentation the speed used when speaking by the presenter increased comprehension of material. The faster the talking the better. When I taught classes I use this technique by increasing my speech pattern by 50% and it definitely seems to work better",
            "title_similarity": "0.67385006",
            "sentiment_compound": 0.9001
        },
        {
            "id": "hpomflk",
            "score": 1,
            "text": "But does watching it thrice at triple speed increase the benefit even more? And at what point it becomes diminishing?",
            "title_similarity": "0.527163",
            "sentiment_compound": 0.8079
        },
        {
            "id": "hpon5ec",
            "score": 1,
            "text": "Professor can you talk in X2 please?",
            "title_similarity": "0.4746338",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hponiby",
            "score": 1,
            "text": "So what I'm getting from this watching once at double speed is not that bad",
            "title_similarity": "0.5955677",
            "sentiment_compound": 0.431
        },
        {
            "id": "hponl00",
            "score": 1,
            "text": "And then watch two at once at triple speed for six times the learning! Then write all your year’s notes on a single notecard with the power of mucroscopes to ace that weed out course that has no business being as hard as it is, finish that up by spending $1,000,000 for every course and get into back breaking debt that uneducated people don’r want you to get debt forgiveness for like they can with everything in their lives.",
            "title_similarity": "0.5849331",
            "sentiment_compound": -0.4574
        },
        {
            "id": "hponw97",
            "score": 1,
            "text": "Can gives some credence to this theory. Took a few online classes with zoom lectures this year. Recorded the audio of the lectures on my laptop and would regularly listen to them at 2x speed (one prof was a notorious slow speaker...) while studying for tests. Helped quite a bit. Got A's!",
            "title_similarity": "0.75256324",
            "sentiment_compound": -0.4926
        },
        {
            "id": "hponx8x",
            "score": 1,
            "text": "Indeed it does. I passed two exams with this method in very little studying tine.",
            "title_similarity": "0.5053852",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoo183",
            "score": 1,
            "text": "Oh man so my interminable impatience and distraction have actually been helping me all along?!",
            "title_similarity": "0.4845875",
            "sentiment_compound": -0.5797
        },
        {
            "id": "hpoo5m4",
            "score": 1,
            "text": "Science has finally discovered my secret",
            "title_similarity": "0.43528998",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoobiz",
            "score": 1,
            "text": "I have done this its difficult to sit through a slow 50 minute lecture. Plus the professor will say something that you might have missed and you can rewind and review what was missed.",
            "title_similarity": "0.6339515",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hpoobq2",
            "score": 1,
            "text": "I'm more interested in the robustness of information retention at more discrete speeds. Think about how much more students could absorb if lessons were sped up even 25%.",
            "title_similarity": "0.7337804",
            "sentiment_compound": 0.4576
        },
        {
            "id": "hpoor04",
            "score": 1,
            "text": "Wow I’ve been doing this with Coursera and loved it because I hated how slow the lecturers were at 1X.",
            "title_similarity": "0.6180438",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hpooxpg",
            "score": 1,
            "text": "As a note taker that likes to consider the ideas presented...no.",
            "title_similarity": "0.40016085",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpop1aq",
            "score": 1,
            "text": "Professors who already speak quickly in lecture: \"I'd like to see you *try*\"\n\n(most professors go pretty slowly which I assume is why this works on average, but I had at least 2 over the course of undergrad where a full 2x speed would've been nearly unintelligible)",
            "title_similarity": "0.7535334",
            "sentiment_compound": 0.4555
        },
        {
            "id": "hpop5i9",
            "score": 1,
            "text": "It’s how I watch a majority of YouTube videos these days. People talk way too slow and I lose focus too easy",
            "title_similarity": "0.4782996",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hpop5s5",
            "score": 1,
            "text": "Makes sense. You’re still like to hear the words but you get it twice. Though it’d going to matter what the subject is too. I’d you’re going over algorithms or complex math stuff you’ve never read or heard about, you might need more time to understand it. But if you’re reviewing something you’ve gone over I imagine it can better",
            "title_similarity": "0.7046209",
            "sentiment_compound": 0.6956
        },
        {
            "id": "hpop8tv",
            "score": 1,
            "text": "So professors giving lectures in fast motion at twice their normal speed would be even better, right? \n\nScience rules.",
            "title_similarity": "0.78702265",
            "sentiment_compound": 0.6786
        },
        {
            "id": "hpopa5m",
            "score": 6,
            "text": "During dental school I found that my overall health (mental and physical) was better when I skipped in person lectures and watched the recording at faster speeds in the evenings. Instead of class I would sleep, study, workout, or practice hand skills. I also could rewind or slow down sections of lecture I didn't understand. But I saved a ton of time by spending a couple hours watching 1.5-2x speed lectures (depending on how easy it was to understand the speaker).\n\nI'm not familiar with communications research, is there a bigger body of research in the topic of sped up educational materials?",
            "title_similarity": "0.76339585",
            "sentiment_compound": 0.891
        },
        {
            "id": "hpopfqa",
            "score": 1,
            "text": "Back in the Stone Age (2006), our college only had one 'smart' room in our business hall that could record lectures (shoutout Jacobs 106, whaddup). So only select classes could offer digital lectures, but most would require 'live' viewing. But i loved being able to go out and have a fun night, only to watch class later on or the next day. Typically went 1.5x speed, knocked 3 hour lectures into 2 hours and rarely went too fast to keep up",
            "title_similarity": "0.6427382",
            "sentiment_compound": 0.9127
        },
        {
            "id": "hpophmr",
            "score": 1,
            "text": "I way prefer watching educational videos at 1.5 or 2x speed. Just fast enough that you feel you can’t afford to lose focus incase you lose track",
            "title_similarity": "0.7259693",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hpoppqg",
            "score": 1,
            "text": "They called me a madman…",
            "title_similarity": "0.16758251",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpopttb",
            "score": 1,
            "text": "Is it really a surprise that watching a video of relevant lecture materiel twice shortly before a test was more beneficial than watching it once a week before?\n\nThis is ridiculous.",
            "title_similarity": "0.74019516",
            "sentiment_compound": 0.4716
        },
        {
            "id": "hpoqax2",
            "score": 1,
            "text": "I do this but keep notes along the way, turned out not bad. AMA",
            "title_similarity": "0.39539337",
            "sentiment_compound": 0.5824
        },
        {
            "id": "hpoqpdx",
            "score": 1,
            "text": "Do this, then listen to it normal in the background",
            "title_similarity": "0.23177773",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoqpe4",
            "score": 1,
            "text": "Study: Watching a lecture once at double speed can save you\n **half the time with nearly the same grade!**",
            "title_similarity": "0.8201736",
            "sentiment_compound": 0.5411
        },
        {
            "id": "hpoqz1t",
            "score": 1,
            "text": "That's how most of my classmates and I watched all our lectures in med school. Most med schools have been doing it for years.",
            "title_similarity": "0.44788253",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoqzhy",
            "score": 1,
            "text": "What does watching it twice at normal speed yield?",
            "title_similarity": "0.47133362",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpor4vz",
            "score": 1,
            "text": "I think the TD bank used the same picture once for its online website",
            "title_similarity": "0.46086967",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpor5o7",
            "score": 1,
            "text": "Used to watch all of my college lectures at 1.75x speed. Made the video time shorter and helped to retain the information",
            "title_similarity": "0.72109383",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpor69s",
            "score": 1,
            "text": "I think the TD bank used the same picture once for its online website",
            "title_similarity": "0.46086967",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpor6cs",
            "score": 1,
            "text": "Also, take notes by hand, it really helps your memorization of the material.",
            "title_similarity": "0.57267463",
            "sentiment_compound": 0.7264
        },
        {
            "id": "hpor9h7",
            "score": 1,
            "text": "Speed watching is great for review (like this article suggests). I will sometimes listen to a lecture or video I've watched before at 3.5x which is way to fast to learn something new but is a good way to refresh on what I already do know. If I have trouble keeping up it normally indicates that I should slow down and really listen to that portion.",
            "title_similarity": "0.8191862",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hporhw4",
            "score": 1,
            "text": "I did this in vet school, listened to lectures sped up and wrote down everything. It definitely helped.",
            "title_similarity": "0.55773526",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hporkh7",
            "score": 1,
            "text": "Even better, read the chapter before attending the lecture.",
            "title_similarity": "0.7195841",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hporq2q",
            "score": 1,
            "text": "Its because on the 2nd view you have the context the knowledge chunks slot into",
            "title_similarity": "0.41692758",
            "sentiment_compound": 0.0
        },
        {
            "id": "hporqwt",
            "score": 1,
            "text": "Having gone through lectures in faster speed I can tell you that 2x in first viewing is pretty fast. 1.6x or so is really good speed for even your first viewing.",
            "title_similarity": "0.70522225",
            "sentiment_compound": 0.7688
        },
        {
            "id": "hporr44",
            "score": 1,
            "text": "This goes the same for listening to podcast in double speed as well",
            "title_similarity": "0.5009123",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hporxk2",
            "score": 1,
            "text": "This is how I watch Netflix shows but 1.5 hate filler",
            "title_similarity": "0.41212484",
            "sentiment_compound": -0.7227
        },
        {
            "id": "hpos4pz",
            "score": 1,
            "text": "Basically how my GF studies",
            "title_similarity": "0.29123408",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpos5np",
            "score": 1,
            "text": "I often will watch  youtube video at double speed just because the speaker is so slow.    They're trying to sound amiable and interesting, but I get distracted too easily.  When I speed it up I am able to pay attention.",
            "title_similarity": "0.70588076",
            "sentiment_compound": 0.0644
        },
        {
            "id": "hposdm1",
            "score": 1,
            "text": "The pace of some professors needs 4x just to get it moving",
            "title_similarity": "0.5978481",
            "sentiment_compound": 0.0
        },
        {
            "id": "hposdt4",
            "score": 1,
            "text": "Can’t get this to load, but I know watching my lectures at double speed was more engaging. I would lose focus and drift off during live lectures.",
            "title_similarity": "0.7574023",
            "sentiment_compound": -0.0027
        },
        {
            "id": "hposrf4",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "-0.0028780364"
        },
        {
            "id": "hpossw3",
            "score": 1,
            "text": "My medical school experience validated",
            "title_similarity": "0.4588173",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hposxj4",
            "score": 1,
            "text": "We can predict what they're about to say, and usually the whole paragraph.\n\nWe zone\n\nTwo or three paragraphs later... Wh? rewind Oh, meh, zone out, repeat\n\nDouble speed: Forces us to pay attention plus we can pause and take a note of novel ideas.",
            "title_similarity": "0.6308505",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hpotanm",
            "score": 1,
            "text": "Does the same go for porn?",
            "title_similarity": "0.33823222",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpotmy4",
            "score": 1,
            "text": "This works, My lettuce retained more water hydrating it twice a day.",
            "title_similarity": "0.503379",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hpotnhd",
            "score": 1,
            "text": "\"Video Speed Controller\" is an excellently simply chrome extension that allows u to vary playback speed of basically any videos online, even with keyboard shortcuts for it and all. Highly recommend.",
            "title_similarity": "0.5312532",
            "sentiment_compound": 0.7841
        },
        {
            "id": "hpotyk3",
            "score": 1,
            "text": "Dude, get a normal lock then",
            "title_similarity": "0.17862713",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpou02k",
            "score": 57,
            "text": "So as a teacher, should I speedrun my lessons and double them up?",
            "title_similarity": "0.69588023",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpou42x",
            "score": 1,
            "text": "I watch almost everything and listen to all Podcasts at 1.5 to 1.75 speed.",
            "title_similarity": "0.3819332",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoubc1",
            "score": 1,
            "text": "I'm currently doing the online CS50, but I gotta watch it at .75x just to understand. But then again, I'm old!",
            "title_similarity": "0.48860288",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpouda6",
            "score": 1,
            "text": "With Audio Books so easy to come by now I wonder if the same holds true for them. If listening to an audio book twice at double speed would enhance retention then that would definitely be the way I would go.\n\nEdit: Also wonder if the amount of information consumed in the repetition cycle would matter. Example: Listening to each chapter twice at 2X speed vs listening to the whole book twice at 2X speed.",
            "title_similarity": "0.7546587",
            "sentiment_compound": 0.8534
        },
        {
            "id": "hpoujwr",
            "score": 1,
            "text": "Slow lectures are infuriating. My attention is lost quite fast and its hard to bounce back.",
            "title_similarity": "0.45499974",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hpoupqw",
            "score": 1,
            "text": "This is literally how I finished both of my degrees.\n\nAlways skipped the live classes and just read the literature while I was working. Then at night 2x speed, repeat all lectures once on 2x speed a few days later and once more right before the exam and boommm 8.0 or higher at every exam.",
            "title_similarity": "0.5273229",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpov6a2",
            "score": 1,
            "text": "How about I watch the lecture at double speed once and then get on with my day",
            "title_similarity": "0.6666974",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpovgqz",
            "score": 1,
            "text": "While queuing for ranked and unranked i got my degree from university... you can too\n\nSponsored by riot",
            "title_similarity": "0.5299499",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hpovk83",
            "score": 1,
            "text": "Paid for by US universities trying to normalise pre-recorded class lectures. “Safety” and all that of course. \n\nIf I had a kid and I was paying the ridiculous fees, I would be livid.",
            "title_similarity": "0.6996259",
            "sentiment_compound": -0.7184
        },
        {
            "id": "hpovrpz",
            "score": 1,
            "text": "In my day we had to watch the lecture live from the teacher in a classroom",
            "title_similarity": "0.50627285",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpovvp1",
            "score": 1,
            "text": "I am reading the comments at 2x speed now in my head.",
            "title_similarity": "0.49364278",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpovylp",
            "score": 1,
            "text": "I do 1.25 speed once, works for me. Ymmv",
            "title_similarity": "0.5191953",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpovz14",
            "score": 1,
            "text": "I would literally just keep two notebooks for every class.\n\nOne I took to class to take perfect notes I, and one where I would transcribe those notes the day before the test.\n\nThat was studying for me and then I could pretty much see the few pages of material in my head.",
            "title_similarity": "0.5963588",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hpow2gv",
            "score": 1,
            "text": "Nice to see it proven by science.\n\nProfessors talk too slow and for too long.",
            "title_similarity": "0.5879594",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpow648",
            "score": 1,
            "text": "I watch almost every video on YouTube at 1.25 speed 1.5 if they talk really slow. Done this for about a year now feels normal. Definitely helpful when listening to a podcast that's long",
            "title_similarity": "0.56978774",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hpowfr1",
            "score": 1,
            "text": "I used to record lectures and do other work while in class. Then relisten at 1.5-2x speed multiple times if necessary",
            "title_similarity": "0.6855376",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpowgwl",
            "score": 1,
            "text": "Can't even focus for one lecture? Don't worry, just watch it twice really fast so your ADHD can keep pace!\n\nThe Zoomer generation is starting to pick up some steam.",
            "title_similarity": "0.6594716",
            "sentiment_compound": 0.4015
        },
        {
            "id": "hpowh4h",
            "score": 1,
            "text": "Is there a limit to what speed that the benefit diminishes? Some of my professors I could only handle 1.25x because they talk fast and others I could have even maybe done 2.25x.",
            "title_similarity": "0.74368644",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpowhdo",
            "score": 1,
            "text": "The strange thing is when u actually see your professor his voice is so low and intolerably slow",
            "title_similarity": "0.38425508",
            "sentiment_compound": -0.5486
        },
        {
            "id": "hpown6p",
            "score": 1,
            "text": "are universities are gunna start hiring auctioneers now?",
            "title_similarity": "0.48942488",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpowufe",
            "score": 1,
            "text": "And the best review strategy is whichever method you’ll actually use.",
            "title_similarity": "0.36845732",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hpowysy",
            "score": 1,
            "text": "Movies and music are the only thing I watch at 1X for the past several years.\n\nAnything else 1-5-2X. I can watch more in less time.  \n\nYou get used to it shockingly quick.  It’s the most underrated hack of all time.\n\nI don’t think it negatively impacts comprehension at all.",
            "title_similarity": "0.5401269",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hpox1jj",
            "score": 1,
            "text": "We didn’t have this luxury. We took notes. I’m jealous.",
            "title_similarity": "0.4356352",
            "sentiment_compound": -0.4588
        },
        {
            "id": "hpox1ow",
            "score": 1,
            "text": "If I know I'm going to be watching a video twice I'll probably be less inclined to pay full attention the first time around",
            "title_similarity": "0.6288909",
            "sentiment_compound": -0.0352
        },
        {
            "id": "hpox2s2",
            "score": 1,
            "text": "A rushed review better than nothing- science",
            "title_similarity": "0.434222",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpoxdlt",
            "score": 1,
            "text": "I usually speed up videos when someone is taking too long to make a point.",
            "title_similarity": "0.6023993",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoxgfb",
            "score": 1,
            "text": "I just watch all lecture videos at 1.5.",
            "title_similarity": "0.36049572",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoxghx",
            "score": 1,
            "text": "The real trick is to split the video up into 2-4 sections or start times, and then play them all back at once in order to compress the audio input even more.",
            "title_similarity": "0.56446314",
            "sentiment_compound": 0.296
        },
        {
            "id": "hpoxoxu",
            "score": 1,
            "text": "I recently started watching a lot of youtube videos in 2x speed if it's largely about the information the creator is trying to pass along. It's been amazing actually. I find that it matches the pace my brain is running at. I do have an attention/stimulation disorder(s) though so it's been one of the only ways I can bother to sit down and finish these things.",
            "title_similarity": "0.6946992",
            "sentiment_compound": 0.34
        },
        {
            "id": "hpoxqj5",
            "score": 1,
            "text": "I've been doing this for years with Udemy an online courses. I do a first run at 1.25. I go back to parts slower if I am missing something. Then I review at 1.5. If the video player is good you will barely notice.\nI also do this to catch up on Netflix series.",
            "title_similarity": "0.6340029",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hpoxtdt",
            "score": 1,
            "text": "Wow, who wouldve thought that uni students can ingest information faster than an old ass professor can speak",
            "title_similarity": "0.64425695",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hpoy6h6",
            "score": 1,
            "text": "I did this for all of my classes during the Pandemic and got As because of it. I can’t even sit through watching any lectures at 1x the speed anymore.",
            "title_similarity": "0.465861",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoy6y1",
            "score": 1,
            "text": "Once I learned I could speed up YouTube videos my life changed forever",
            "title_similarity": "0.5490882",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoygl2",
            "score": 1,
            "text": "Best i can do is double speed once….",
            "title_similarity": "0.44983387",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hpoyhd0",
            "score": 1,
            "text": "Okay as I person to regularly watches youtube videos at 1.5x, I am skeptical that this would work for certain types of lectures. The main reason why I watch videos at higher speeds is that I find a lot of youtube videos speaker speak slow. 1.5x is the perfect hasten speed without feeling too fast. For technical or information rich podcasts, I tend to prefer 1.25x speed. \n\nI could see this working for certain type of lectures that are more fact/info dump or memorizing based like history or philosophy. But this would not work for science and math lectures were the lecture points can be quite intricate and difficult to process immediately. For the latter case I tend to just pause and replay more often that just speeding up the video. If you watch a lecture multiple times, that is always beneficial compared to watch it once.",
            "title_similarity": "0.7409487",
            "sentiment_compound": 0.773
        },
        {
            "id": "hpoyqa1",
            "score": 1,
            "text": "Who else read that as lettuce and was quite confused?",
            "title_similarity": "0.34039038",
            "sentiment_compound": -0.3804
        },
        {
            "id": "hpoz0it",
            "score": 1,
            "text": "In college, my best way to learn was to read the chapter SUMMARY, to get the broad concepts, THEN the chapter proper to go deeper, then the summary again.\n\nTesting was like pulling the answers from my own mind. A whole different kind of cheating!",
            "title_similarity": "0.6746713",
            "sentiment_compound": 0.4765
        },
        {
            "id": "hpoz3fa",
            "score": 1,
            "text": "You need once at double speed. I identify points of attention then watch those at normal speed. Region of interest pooling",
            "title_similarity": "0.51746213",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpoz531",
            "score": 1,
            "text": "I do this on youtube at 3x",
            "title_similarity": "0.25182146",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoz5cg",
            "score": 1,
            "text": "I watched every lecture at 2x once schools went online. Made me realize how much of the class was filler",
            "title_similarity": "0.5851122",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpoz8gk",
            "score": 1,
            "text": "Does this mean we can make college two years instead of four?",
            "title_similarity": "0.55403286",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpozanh",
            "score": 1,
            "text": "I’m late finishing my degree right now, 1.5x speed on all lectures is the way to go.",
            "title_similarity": "0.5643362",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpozub9",
            "score": 1,
            "text": "I feel like this would largely depend on what type of learner someone is and how well a lecture is explained.",
            "title_similarity": "0.5869587",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hpp0a3e",
            "score": 1,
            "text": "Please do not make this a new normal. Young people are already burdened enough.",
            "title_similarity": "0.24945188",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hpp0jgq",
            "score": 1,
            "text": "But what about changing the teaching style?",
            "title_similarity": "0.40305573",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpp0l6v",
            "score": 1,
            "text": "As someone who's been doing it for about 2 years I can tell that the biggest but here is that hard speed values are meaningless. Some instructors talk with the speed of a normal human being at 2x and some sound like a chipmunk at 1.25. \n\nAlso, you require a certain acclimatization to the speed. You need to spend a couple of months doing 1.25, then 1.5 then 1.75. Honestly anything beyond 1.75x was too fast for me, but i imagine that depends on the person.",
            "title_similarity": "0.6793436",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hpp0upz",
            "score": 1,
            "text": "Well perhaps 1.5x to help with note taking at first then 2x for a quick review might help even better. University is a great time when you use the right study techniques. Challenge yourself and get smarter!",
            "title_similarity": "0.8306658",
            "sentiment_compound": 0.9523
        },
        {
            "id": "hpp16bi",
            "score": 1,
            "text": "the teletubbies were right",
            "title_similarity": "0.28823364",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpp1d3x",
            "score": 1,
            "text": "I did this at first because my teacher was such a slow talker. The I realized  I could cram a half semesters lectures in about 4 hrs so I would just play them fast when ever I had to wait around. Not only did I learn more but I retained more. I even had an incomplete because a back injury and came back and Aced the final. I wish I could do this with everything in life.",
            "title_similarity": "0.6896892",
            "sentiment_compound": 0.2722
        },
        {
            "id": "hpp1ewk",
            "score": 1,
            "text": "Well that would help a lot in revision",
            "title_similarity": "0.3867009",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hpp1rpw",
            "score": 1,
            "text": "But I am guessing that seeing a lecture twice at any speed would be more beneficial than a single viewing.",
            "title_similarity": "0.766631",
            "sentiment_compound": 0.6474
        },
        {
            "id": "hpp1s7w",
            "score": 1,
            "text": "That makes sense.\n\nSecond pass you know what's coming so you can engage with it actively rather than trying to keep track of what's being said.\n\nNot a method of study, but for comprehension",
            "title_similarity": "0.5361432",
            "sentiment_compound": 0.3573
        },
        {
            "id": "hpp1s82",
            "score": 1,
            "text": "How did they measure \"better learning\"? Better test scores?\n\nThat means _nothing_ in terms of actually learning.\n\nhttps://perell.com/essay/against-3x-speed/",
            "title_similarity": "0.5950366",
            "sentiment_compound": 0.7319
        },
        {
            "id": "hpp20c8",
            "score": 1,
            "text": "What about 2x speed once while skipping through a lot of it? That's the only way I've ever seen anyone study",
            "title_similarity": "0.37567842",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpp2ato",
            "score": 1,
            "text": "In general, review is an critical element in truly learning something. Usually performed often and at least 24 hrs after acquiring mew information.",
            "title_similarity": "0.6114962",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hpp2ged",
            "score": 1,
            "text": "my solution in university was to simply re-write my notes supported by text when it was a more challenging lecture. \n\nThis was when only only about 10% of students brought laptops to class and there was no video or taping even allowed.",
            "title_similarity": "0.51750565",
            "sentiment_compound": 0.5095
        },
        {
            "id": "hpp2jty",
            "score": 1,
            "text": "I’ve got ADHD, so my perspective is totally biased, but I find normal lectures *painfully* slow. That’s one good thing about online schooling, the recordings can generally be sped up (I find 1.5-1.75 best, 2x is usually a little too fast and I miss things).",
            "title_similarity": "0.6921433",
            "sentiment_compound": 0.5351
        },
        {
            "id": "hpp2mul",
            "score": 1,
            "text": "“Professor, can you speak faster?”\n\n“50 points from Gryffindor.”",
            "title_similarity": "0.4585",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpp2n88",
            "score": 1,
            "text": "Interesting study and great comments.  All this presumes that the artificial scarcity of the live-only lecture is eliminated by the recording - and a recording that is not locked down in a proprietary system to preclude listening at different speeds - just listening (instead of watching) - i.e. transforming the material that suits the students.  This is actually a big difference from just a few years ago.",
            "title_similarity": "0.7391614",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hpp2v8c",
            "score": 1,
            "text": "Damn I used to watch math videos half speed and still didn’t get it",
            "title_similarity": "0.5013669",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hpp31x0",
            "score": 1,
            "text": "My strategy is actually legit? Who knew",
            "title_similarity": "0.2531342",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpp33dv",
            "score": 1,
            "text": "I watch at at least 1.5x - normal speed is too slow and my mind wanders, I forget what I was watching. But 1.5x keeps me engaged.",
            "title_similarity": "0.58684564",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hpp4gc6",
            "score": 1,
            "text": "Double speed is too fast to understand in most cases.",
            "title_similarity": "0.3733395",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpp4nic",
            "score": 1,
            "text": "Pearson Math course videos at 2x speed all day. I only watch them once though, and barely pay attention so I don’t retain anything. Still pulling A’s don’t ask",
            "title_similarity": "0.4892407",
            "sentiment_compound": -0.0276
        },
        {
            "id": "hpp4qfs",
            "score": 1,
            "text": "This is how I got through medical school. For some lectures, it was at 3x speed. You get better over time",
            "title_similarity": "0.6733918",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpp4r5w",
            "score": 1,
            "text": "Seems like it would benefit only the attention for buzzwords and not for the benefit of context.\n\nThe results therefor could point out its use in the (unpractical) system or short term memorising, get the test passed and then forget, instead of getting the context and understand the whole thing.\n\nSo i guess we could have quite a toxic result here, luring us into the wrong direction.\n\nBut that's just my impression of the few given lines.",
            "title_similarity": "0.58516014",
            "sentiment_compound": 0.2168
        },
        {
            "id": "hpp56sq",
            "score": 1,
            "text": "Longer retention or more absorption of info?",
            "title_similarity": "0.37471014",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpp574e",
            "score": 1,
            "text": "So strange that this is specifically studying \"US universities\" yet they refer to a \"revision strategy.\"",
            "title_similarity": "0.561926",
            "sentiment_compound": -0.2716
        },
        {
            "id": "hpp5rl1",
            "score": 1,
            "text": "But it actually says they found no advantage and that watching the sped up video prior to the test was where e advantage presented itself.",
            "title_similarity": "0.5188383",
            "sentiment_compound": 0.1002
        },
        {
            "id": "hpp5ueu",
            "score": 1,
            "text": "Makes sense.\n\nThe first time gives you a quick rundown on the topic and what you'll learn/need to learn\n\nThen you can watch a second time knowing what details you should be paying attention to in order to get a better grasp of the topic",
            "title_similarity": "0.6429454",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpp60a3",
            "score": 1,
            "text": "I usually go for 1.5x but it mostly depends on the talker.",
            "title_similarity": "0.4613607",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpp60ey",
            "score": 1,
            "text": "Repetition is key.\n\nThe key is repetition.",
            "title_similarity": "0.29705504",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpp64vi",
            "score": 1,
            "text": "Spaced repetition is better than reading an article 4 times.  \nSo this seems equally pointless. Take notes while listening, ask yourself questions about what you learned and try to explain it to your rubber duck, use an app like Anki to make flashcards from all that info, answer your flashcards whenever anki asks them to you to start to shift information into longterm memory, proffit.",
            "title_similarity": "0.7090222",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hpp6bff",
            "score": 1,
            "text": "Fix the buffering the the 3rd party video playback software, then we're talking.",
            "title_similarity": "0.4998325",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpp72vx",
            "score": 1,
            "text": "Watch it at 3X three times.",
            "title_similarity": "0.2159132",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpp7ijk",
            "score": 1,
            "text": "Just gimme the power points and the reading please. Unless its a lab based class.",
            "title_similarity": "0.56259495",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hpp80hx",
            "score": 1,
            "text": "It seems like being able to comprehend and absorb information at double speed is itself a marker that a person is more likely to succeed at test taking.",
            "title_similarity": "0.7763244",
            "sentiment_compound": 0.7152
        },
        {
            "id": "hpp8hst",
            "score": 1,
            "text": "My impatience is paying off, then. Good to know. I think anything worth watching it worth watching 3x.",
            "title_similarity": "0.57510495",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpp8yr0",
            "score": 1,
            "text": "I just watch it once at double speed, thank you",
            "title_similarity": "0.5122943",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpp940j",
            "score": 1,
            "text": "I'm 47 got no timeto waste I watch all videos at x2 the speed.\nWish i started this 20 years ago.",
            "title_similarity": "0.48654008",
            "sentiment_compound": 0.4276
        },
        {
            "id": "hpp94xv",
            "score": 1,
            "text": "Watching a lecture in real time sucks. The student gets bored when the teacher is spending too much time on stuff the student already knows and gets lost if the teacher leaves out the one missing piece of the puzzle the student needs. Well produced and indexed video lectures with the ability to contact the teacher for clarification are much better",
            "title_similarity": "0.7170045",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hpp9uqn",
            "score": 1,
            "text": "I always watch tutorials in double speed.\n\nI dont need your slow talking and breathing.",
            "title_similarity": "0.5312355",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpp9vzf",
            "score": 1,
            "text": "I watch *PBS Space Time* at 1.25x speed. \"Aint nobody got time for that\".... at normal speed.",
            "title_similarity": "0.3914116",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppaabm",
            "score": 1,
            "text": "Worked for me for bar prep.",
            "title_similarity": "0.32186425",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppad0f",
            "score": 1,
            "text": "Teacher and Instructor just need to talk faster then.",
            "title_similarity": "0.56797427",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppains",
            "score": 1,
            "text": "But all of the lectures I watch are given by the micro machines guy...",
            "title_similarity": "0.38368702",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppavqm",
            "score": 1,
            "text": "What if I set it to 3x speed and half watch it",
            "title_similarity": "0.4267493",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppbkem",
            "score": 1,
            "text": "Learned to code this way. It works.",
            "title_similarity": "0.3940392",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppbq51",
            "score": 1,
            "text": "Ah, I have to be at an American University for this to work. Dang.",
            "title_similarity": "0.36385423",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppbum0",
            "score": 1,
            "text": "I have language processing issues and when I’m required to deal with language in multiple ways (listening, writing, etc.) at the same time I have more issues. I used to watch my history lectures slowed down and still had to pause all the time to let my brain catch up.\n\nI think I just found it easier when lecturers provided transcripts because even though I’m a slow reader, it felt like reading a lecture and taking notes was so much quicker, and I felt like I was able to process the information better.",
            "title_similarity": "0.78481656",
            "sentiment_compound": 0.8658
        },
        {
            "id": "hppc6w2",
            "score": 1,
            "text": "I'm making this thread have 666 replies because I made a thread yesterday go to 667 for the opposite reason.\n\nAll things balanced as it should be.",
            "title_similarity": "0.48630434",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppcfe8",
            "score": 1,
            "text": "Doesn't this study just mean the same thing as \"Lectures should be half the time and repeat the material twice over\" for better retention?",
            "title_similarity": "0.7890159",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hppcjwc",
            "score": 1,
            "text": "I watch a lot of YouTube tutorials on 1.5x \\~ 2x speed depending on how horrendously slow the narrator speaks. Generally most of a tutorial is remedial and I only need to see one relevant part of it, which I will then review a couple times as needed.",
            "title_similarity": "0.6017122",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hppcmge",
            "score": 1,
            "text": "This is the kind of headline people will read, and then go on to watch lectures at double speed once, and claim they're both saving time and learning better.",
            "title_similarity": "0.8293478",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hppctkv",
            "score": 1,
            "text": "I do this with podcasts and find it just as informative one time at 2X or 1.5 X",
            "title_similarity": "0.5293599",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppcuys",
            "score": 1,
            "text": "Watched medschool lectures (option to go to class in person or watch recorded lecture) at 1.5 x eventually 3x speed was great. Could fit in multiple of same lectures before exams.\nOfc this is preclinical year not during rotations at hospitals and clinics.",
            "title_similarity": "0.64240766",
            "sentiment_compound": 0.765
        },
        {
            "id": "hppcwsh",
            "score": 1,
            "text": "I know someone who can listen to two lectures at 2x speed at the same time and retain almost all the key information of both.",
            "title_similarity": "0.6021791",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppd3x1",
            "score": 1,
            "text": "Nah not double 1.25x That way you're not listening to Alvin and the Chipmunks 3",
            "title_similarity": "0.25796473",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hppd410",
            "score": 1,
            "text": "Trying his best to get the true endings .",
            "title_similarity": "0.33957154",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hppd9wq",
            "score": 1,
            "text": "Humans can understand hundreds of words per minute without being able to speak anywhere near that quickly.\n2x speed also helps me pay more attention as long pauses and thought gathering break my focus.",
            "title_similarity": "0.6299269",
            "sentiment_compound": 0.296
        },
        {
            "id": "hppdifi",
            "score": 1,
            "text": "how about 4 times at 4x speed?",
            "title_similarity": "0.2438302",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppdpmz",
            "score": 1,
            "text": "Watching videos(even multiple times) is still a form of passive learning.  Active learning is provably superior.  Everybody learns best by doing.",
            "title_similarity": "0.61844766",
            "sentiment_compound": 0.9042
        },
        {
            "id": "hppdxuc",
            "score": 1,
            "text": "This makes sense. I know when I read in my head I do it faster. But if I were to speak the words in the book I would go twice slow. So I think watching the video it in accelerated speed maybe matches your internal brain speed?",
            "title_similarity": "0.7747043",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppe1r4",
            "score": 1,
            "text": "For the average person. Make the 1%",
            "title_similarity": "0.29097742",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppe43k",
            "score": 1,
            "text": "I found the best was watching a video twice at 1.5x and again much later at 2x.",
            "title_similarity": "0.60243666",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hppe526",
            "score": 1,
            "text": "Watching it once at double speed is the same as normal speed with the benefit of getting it over with in half the time",
            "title_similarity": "0.6189819",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hppe6nx",
            "score": 1,
            "text": "3 times at triple speed",
            "title_similarity": "0.19477478",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppequs",
            "score": 1,
            "text": "I would really like to read some studies on text flashing one word at a time, on screen. I feel like it would help me read 10x faster, but I’ve heard that people don’t retain the info.",
            "title_similarity": "0.7279271",
            "sentiment_compound": 0.5418
        },
        {
            "id": "hppexsl",
            "score": 1,
            "text": "How about they stop teaching and testing us on crap we don’t need",
            "title_similarity": "0.35181898",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hppey18",
            "score": 1,
            "text": "Smells like productivist BS to me. Sorry I’ll take it easy but constantly from the very beginning so I don’t have to stress.",
            "title_similarity": "0.47558132",
            "sentiment_compound": -0.2846
        },
        {
            "id": "hppf0xq",
            "score": 1,
            "text": "This is so misleading. Those who watched it at double speed engaged with the material twice, including right before the test. Anytime you watch something twice, including recently, you will recall more than if you watched it carefully a while ago. I guarantee you that students who watched it twice at regular speed fared better than those who watched it twice at 2x speed. Stop encouraging people to cut corners with misleading studies and headlines.",
            "title_similarity": "0.78254855",
            "sentiment_compound": 0.252
        },
        {
            "id": "hppf0zx",
            "score": 1,
            "text": "Matrix learning curve…I KNOW KUNG FU…",
            "title_similarity": "0.40877068",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppg046",
            "score": 1,
            "text": "I once did some work at a radio station that had a blind guy operating stuff and he had a computer that had voice assistance, where the computer talks at you, the speed at which the speech synthesis gave him instructions was practically unintelligible to any normal individual… I’m talking super super fast speech synthesis….\n\nWould love to see a caste of blind individuals, who just spend time absorbing as much information as possible at super high speeds, and they just know so much about everything that they advise world leaders about how to run the world properly and efficiently…. Would make for a great sci-fi concept maybe",
            "title_similarity": "0.5745487",
            "sentiment_compound": 0.9485
        },
        {
            "id": "hpph8kt",
            "score": 1,
            "text": "maybe the lecturer just need to talk faster and get to the point already",
            "title_similarity": "0.56719714",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppi6yv",
            "score": 1,
            "text": "Benefit learning or grading?",
            "title_similarity": "0.4717829",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hppic9q",
            "score": 1,
            "text": "I prefer the strategy of watching once at double speed...",
            "title_similarity": "0.6067298",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppimyn",
            "score": 2,
            "text": "In med school our lectures were videotaped and we had a printed syllabus to go along with it. We could pause, FF, all that. A lot of us would watch/listen to them at double speed, often several times before an exam. Always seemed to make sense. Guess it helped?",
            "title_similarity": "0.6762912",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppiuo7",
            "score": 1,
            "text": "I've been doing this for ages. In my opinion, the best thing that YouTube & similar websites have done is granted its users the ability to adjust the play speeds on all content. I enjoy the hear/learn/understand experience when I can choose my listening pace. \n\nI'm glad that so many others have finally caught up!",
            "title_similarity": "0.63665843",
            "sentiment_compound": 0.9468
        },
        {
            "id": "hppjh7m",
            "score": 1,
            "text": "I think I'll watch it at 1.5x speed. and watch it 1.5 times.",
            "title_similarity": "0.41468263",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppjpki",
            "score": 1,
            "text": "Funny I did this at 3x after someone called me an idiot for wasting time attending lectures.",
            "title_similarity": "0.5181801",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hppku0y",
            "score": 1,
            "text": "Medical students have joined the chat",
            "title_similarity": "0.454432",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppkxtp",
            "score": 1,
            "text": "What about watching twice at normal speed?",
            "title_similarity": "0.43242943",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppl6un",
            "score": 1,
            "text": "I do this with almost all YouTube videos",
            "title_similarity": "0.26929426",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppl927",
            "score": 1,
            "text": "1.75x speed works best for me, I find double speed can distort the voice unless they talk ridiculously slow.",
            "title_similarity": "0.6605154",
            "sentiment_compound": 0.128
        },
        {
            "id": "hppm8ol",
            "score": 1,
            "text": "I'm gonna stick with my normal speed when I can manage it, gives my brain time to process what's being said",
            "title_similarity": "0.4551474",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppmc2z",
            "score": 1,
            "text": "Where were these studies when I was in college",
            "title_similarity": "0.4136648",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppmmhr",
            "score": 1,
            "text": "I preferred just to pay attention the first time, then revise using the textbooks.",
            "title_similarity": "0.58795244",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hppmoyf",
            "score": 1,
            "text": "Youtube is quite convenient for allowing changing speed without making people sound like cartoon characters.",
            "title_similarity": "0.52304214",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hppn31f",
            "score": 1,
            "text": "I wonder how this translates to high school and middle school",
            "title_similarity": "0.4144026",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppnxhb",
            "score": 1,
            "text": "r/medicalschool feels good about themselves now",
            "title_similarity": "0.41681868",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hppo3uc",
            "score": 1,
            "text": "What happens if I watch it backwards?",
            "title_similarity": "0.21484882",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppo5l7",
            "score": 1,
            "text": "Interesting. I didn’t really do this in highschool but I did listen to lectures as a sleep aid to help me remember certain things and it worked.",
            "title_similarity": "0.6434336",
            "sentiment_compound": 0.7935
        },
        {
            "id": "hppo7ma",
            "score": 1,
            "text": "As someone with ADHD, i exclusively do this",
            "title_similarity": "0.13962147",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppofda",
            "score": 1,
            "text": "So…..if…….I…….lecture……slower……..now……",
            "title_similarity": "0.34847677",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppqpe2",
            "score": 1,
            "text": "*”I taped a 20-minute workout on my machine and played it back at high speed so it only took ten minutes. I got a great workout.”*",
            "title_similarity": "0.5645442",
            "sentiment_compound": 0.7579
        },
        {
            "id": "hppr0mg",
            "score": 1,
            "text": "I always watched videos at twice the speed, because I need to get my work done and learn, and slower speeds felt like a waste of time.  Why sit around listening to an hour lecture, when I could make it 30 minutes instead?",
            "title_similarity": "0.6716115",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hpps7d2",
            "score": 1,
            "text": "Failed outa college after highschool, didn't care wasn't ready nor mature.\n\nWent back in my early 30s and it was so much easier. On top of treating it like a job I learned to study each professor, figure out what they wanted from you put of class and do it. On top of that I learned looking back only about 15mins of every class was useful the rest was filler. If you caught on and pay attention those 15 minutes your golden.",
            "title_similarity": "0.69218576",
            "sentiment_compound": 0.762
        },
        {
            "id": "hppslcz",
            "score": 1,
            "text": "I watch my share of lectures on YouTube, and I am mildly embarrassed to admit that I do not have the patience to sit through most of them at normal speed. At the risk of sounding frivolous, I wonder if the better results for watching lecture videos at double speed have anything to do with people being unable to maintain attention at normal speed.",
            "title_similarity": "0.7100496",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hpptv3e",
            "score": 1,
            "text": "Med students have known this for ages",
            "title_similarity": "0.31807637",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppu5zo",
            "score": 1,
            "text": "Experienced this in a technical training pilot program. Not speeded up but ran though a processor that removed spaces between words, pauses, etc. in lecture. Listened on headphones in a booth with two screens flashing illustrations. Received a one hour lesson in 25 minutes and came out of the booth sweating from the concentration. Retention was phenomenal. I still remember schematics and technical specs to this day. That was in 1995.",
            "title_similarity": "0.6741545",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpputhz",
            "score": 1,
            "text": "TBF, if they have other guidance",
            "title_similarity": "0.2801985",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppvcir",
            "score": 1,
            "text": "I was ahead of the curve all along.",
            "title_similarity": "0.12285644",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppvhpv",
            "score": 1,
            "text": "I tried asking my professor to teach twice as fast and go over everything twice and he didn't appreciate the suggestion.",
            "title_similarity": "0.6128771",
            "sentiment_compound": -0.3089
        },
        {
            "id": "hppxaoz",
            "score": 1,
            "text": "I sometimes have trouble remaining focused watching lectures at 1x speed.\n\n1.5x or 2x speed gets through 5he information more quickly and my brain has less opportunity to get bored and start thi king of something else.\n\nAlso, being able to take a day and rewatch 8 to 16 weeks of lectures in one shot is great for exams.",
            "title_similarity": "0.8194802",
            "sentiment_compound": 0.6605
        },
        {
            "id": "hppyb1h",
            "score": 1,
            "text": "I'm just wondering how you can even understand the lecture at twice the speed.",
            "title_similarity": "0.62137914",
            "sentiment_compound": 0.0
        },
        {
            "id": "hppycuv",
            "score": 1,
            "text": "All my med school friends watch/listen to lectures on 2x or higher speeds and anytime I witness it it makes me feel like an insane person.",
            "title_similarity": "0.5491705",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hppzz0d",
            "score": 1,
            "text": "So what about half of the lecture at 4x speed?",
            "title_similarity": "0.45023003",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpq0uvs",
            "score": 1,
            "text": "It's like skimming a book 2-3 times instead of 1 close read.",
            "title_similarity": "0.41784388",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpq0x33",
            "score": 1,
            "text": "I had to listen to my Biology teacher for a community college class at like 2.5x speed because she would just drag on and I would lose interest. An hour long recorded lecture done in like 40minutes (from having to pause and take notes).",
            "title_similarity": "0.6157719",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hpq1wz1",
            "score": 1,
            "text": "Speedrunning Learning",
            "title_similarity": "0.40753523",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpq2vhu",
            "score": 1,
            "text": "What about 100 times at 100x?",
            "title_similarity": "0.187695",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpq4ajy",
            "score": 1,
            "text": "I would also consider novel, or the difficulty of the topic and the awareness of the viewer in this kind of study. The focus of an individual can even fluctuate depending on the beginning, middle and end. \n\nI often watch my easy lectures (I always record), youtube videos, etc at least double the speed. However, if the class is something new and difficult or I'm just tired/distracted, I'm watching at normal speed. Unless, seemingly unimportant sections of the lectures are kind of dull.",
            "title_similarity": "0.7790121",
            "sentiment_compound": -0.6115
        },
        {
            "id": "hpq4p5p",
            "score": 1,
            "text": "Voice artist here: the voice can get a “drone” if you speak for too long about any topic. We are trained to avoid it with vocal tricks, but the average prof probably doesn’t know them. Their voice is boring and dull. Speed them up and those pauses and vocal atonality disappear.",
            "title_similarity": "0.56654954",
            "sentiment_compound": -0.8658
        },
        {
            "id": "hpq4yfo",
            "score": 1,
            "text": "That’s good, now tell employers the info is being retained",
            "title_similarity": "0.41980565",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpq62ph",
            "score": 1,
            "text": "> The researchers do also add a few caveats. While 2x viewing was fine for learning about the material in their studies — real estate appraisals and the Roman Empire — perhaps it might not work for more complex subject matter; again, only more research will tell.\n\nMy exact criticism is conceded in the article.  Show me image processing formulas with fourier transforms 10 times at 2x speed and I will still not get it.  I need to pause often and go over it closely at a slow pace to really understand.  I suspect this probably works way better for learning straightforward material that is mostly just committing a few facts that are pure nlp based memorization and not and not more complex math and logic heavy concepts.",
            "title_similarity": "0.76281923",
            "sentiment_compound": -0.0
        },
        {
            "id": "hpq6jo7",
            "score": 1,
            "text": "This probably depends a lot on the nature of the lecture and the specific lecturer.",
            "title_similarity": "0.53756547",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpq6khv",
            "score": 1,
            "text": "Perhaps because one tends to drift off while waiting for the lecturer to get to the point?",
            "title_similarity": "0.4886081",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpq6psb",
            "score": 1,
            "text": "So 5 times at 5x speed is even better?",
            "title_similarity": "0.41806757",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpq6qp1",
            "score": 1,
            "text": "So if I watch it at 10X speed 10 times, I'll be super optimal?",
            "title_similarity": "0.46953416",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hpq781f",
            "score": 1,
            "text": "What about 15 times at 1.25 speed (I have adhd)",
            "title_similarity": "0.3615816",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpq78gv",
            "score": 1,
            "text": "This makes absolutely no sense.",
            "title_similarity": "-0.103086755",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hpq7bcv",
            "score": 1,
            "text": "I think there should be a clear disclaimer that there is inconclusive evidence for maths, physics and likewise subject matter where imagination and making arguments is involved.",
            "title_similarity": "0.37251762",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpq7lg5",
            "score": 1,
            "text": "honestly I'm pretty sure watching it once at 1.5 speed would be better for me just as a matter of attention because professors talk so slow and I end up losing focus after like a minute",
            "title_similarity": "0.714942",
            "sentiment_compound": 0.886
        },
        {
            "id": "hpq80iy",
            "score": 1,
            "text": "Now you're just making things up.",
            "title_similarity": "0.23526792",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpq8coe",
            "score": 1,
            "text": "Tl;d: people speak too much and too slow",
            "title_similarity": "0.27902514",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpq8jtm",
            "score": 1,
            "text": "It has to be that fast to keep up with our ADD.",
            "title_similarity": "0.37073493",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpq8zp1",
            "score": 1,
            "text": "I listen to podcasts and watch most youtube videos at 2x speed. I find that I will pay attention more because I really need to focus to understand what they are saying or I'll miss it. Plus, it'll zip through my backlog of episodes sooo fast :)",
            "title_similarity": "0.67676383",
            "sentiment_compound": 0.25
        },
        {
            "id": "hpq9v1x",
            "score": 1,
            "text": "Min maxing your study strat",
            "title_similarity": "0.4036974",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpq9zow",
            "score": 1,
            "text": "I must be 4x as smart if I watched the lectures twice at regular speed. Sweet!",
            "title_similarity": "0.6576525",
            "sentiment_compound": 0.7177
        },
        {
            "id": "hpqc0yl",
            "score": 1,
            "text": "I think this is more to do with the effects of repetition. The idea is that reviewing some material, right around the lapse time when your brain almost forgets it, is helpful for cementing the information in your memory.\n\nThis theory was doing the rounds when I was in high school (in the UK no less) in the 90s.",
            "title_similarity": "0.748988",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hpqcmor",
            "score": 1,
            "text": "That’s how I watch every YouTube tutorial video",
            "title_similarity": "0.38734162",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpqee79",
            "score": 1,
            "text": "I just watch it at 3x speed once and I'm good! Didn't understand a word of it, but the science doesn't lie",
            "title_similarity": "0.52755773",
            "sentiment_compound": 0.3054
        },
        {
            "id": "hpqere6",
            "score": 1,
            "text": "That's super interesting, I need to screen presentations and usually at 2x speed for the sake of time management and I can usually remeber them pretty well days after if I need to go back and look for something.",
            "title_similarity": "0.70889497",
            "sentiment_compound": 0.8979
        },
        {
            "id": "hpqfum8",
            "score": 1,
            "text": "My former boss watched a lot of videos on YouTube at double speed. He’s a know it all who always goes around saying he was a college dropout and learnt everything he knows now from YouTube. He’s very proud of it too.",
            "title_similarity": "0.584808",
            "sentiment_compound": 0.5256
        },
        {
            "id": "hpqgjjd",
            "score": 1,
            "text": "I podcasted all my med school lectures at 1.8x speed (2 was a bit fast…). I would watch once during the day and again later in the evening. After doing this for about a month, I couldn’t tolerate going to lectures in person, it felt like I was watching life in slow motion.",
            "title_similarity": "0.58513117",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpqgxfc",
            "score": 1,
            "text": "Pretty much my hack for everything - Youtube, podcasts, etc.  2x is a bit much though.  I'm more a 1.5x kind of dude.",
            "title_similarity": "0.5170145",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hpqhh1q",
            "score": 1,
            "text": "Do it a third time a you have a close reading.  I am putting an additional sentence on here so the auto bots don’t sensor me because my comment was too sort.",
            "title_similarity": "0.6403469",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hpqia8r",
            "score": 1,
            "text": "This is my ADHD hack. I cannot sit through a lecture at normal speed. If I speed it up, I'm good to go.",
            "title_similarity": "0.6735904",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpqigwa",
            "score": 1,
            "text": "I used the Bhang Method. Smoke the bhang before you learn, while you study and before you test. 30 year successful career. Still killing it. Looking forward to retirement and double dipping toward my million dollar dream.",
            "title_similarity": "0.54972935",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hpqj2ae",
            "score": 1,
            "text": "I always watch lectures and Ted talks at 1.5x to 2x depending on the speed, style and accent of the speaker.\n\nWould love an extension that cuts down pregnant pauses",
            "title_similarity": "0.65863484",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpqj4eu",
            "score": 1,
            "text": "I once studied for five minutes right before a chemistry final and received a B+. Another gal in my class studied for a total of 12 hours leading up to the day of the final, and literally received a F-. The brain is an interesting landscape.",
            "title_similarity": "0.5310104",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpqkanp",
            "score": 1,
            "text": "I'm honestly thankful for 2x speed on YouTube. So many tutorials where people don't just get to the point. Great way to learn new programs.",
            "title_similarity": "0.73812723",
            "sentiment_compound": 0.8957
        },
        {
            "id": "hpqm3fi",
            "score": 1,
            "text": "I liked doing this it works really well",
            "title_similarity": "0.32542172",
            "sentiment_compound": 0.6361
        },
        {
            "id": "hpqnhhy",
            "score": 1,
            "text": "What about watching it 4 times on x4 speed?",
            "title_similarity": "0.36192626",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpqnqph",
            "score": 2,
            "text": "Being able to slow content down, rewind, repeat, pause and find clarification before proceeding to the next context *helps* learning?  What a concept. \n\nI hate my lectures in college. Get so lost.",
            "title_similarity": "0.6637821",
            "sentiment_compound": -0.6238
        },
        {
            "id": "hpqo0g4",
            "score": 1,
            "text": "How? I've never come across anyone who absorbs complex information even at the rate they can speak, let alone read. Feels like you'll gain the very easily understood concepts but completely miss the more impactful and important things...but I guess if you're self reporting you'd not know what you'd missed.\n\nIt feels like the author never read the paper they're writing about. I didn't come to the same conclusion (nor did the authors).",
            "title_similarity": "0.39720953",
            "sentiment_compound": 0.6127
        },
        {
            "id": "hpqonso",
            "score": 2,
            "text": "I learned way more in online classes because I could pause the video and take detailed, step-to-step annotations on OneNote. I’m an Engineering Management undergraduate student.",
            "title_similarity": "0.67820716",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpqpm20",
            "score": 2,
            "text": "I dont have the patience to watch something twice.\n\nYou want to cram relevant material.  Watch it once,  write down what's relevant.",
            "title_similarity": "0.479527",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hpqryo1",
            "score": 1,
            "text": "pure lecture courses are the worst way to learn period.  but, it's cheap for the universities, one teachers with 300+ students in one class.",
            "title_similarity": "0.5900178",
            "sentiment_compound": -0.3716
        },
        {
            "id": "hpqs2gj",
            "score": 2,
            "text": "I do it all the time but I have ADHD so.",
            "title_similarity": "0.29963356",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpqxyp5",
            "score": 1,
            "text": "Interesting. Hypothetically speaking, if you had an exam in 10 hours, and 20 hours of lectures, how would you approach this? Once at x2 speed or twice at x4 speed?",
            "title_similarity": "0.58049524",
            "sentiment_compound": 0.4696
        },
        {
            "id": "hpr21ae",
            "score": 1,
            "text": "old news. watching at 4x speed 4 times is where it’s at",
            "title_similarity": "0.3978206",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpr6riu",
            "score": 1,
            "text": "I find it incredibly distracting because the normal cadences of the human voice and movement are also doubled. It triggers the uncanny valley for me.",
            "title_similarity": "0.53282845",
            "sentiment_compound": -0.3597
        },
        {
            "id": "hpr6vrl",
            "score": 1,
            "text": "Sometimes I speed up 4x especially if someone is either a slow speaker or stops a lot.",
            "title_similarity": "0.5248411",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hpr991q",
            "score": 1,
            "text": "I do this when I can ...\n\nOnce to get the gist for understanding, the purpose for motivation, the layout for orientation.   \nA second time for the details. I helps immesly to know where to look the second time round.\n\nOften do other stuff while doing the first run.\n\nHaving lectures on video or another medium I can adjust my time with also helps greatly.Often you dose off or get distracted in lectures without noticing. At your point of refocus I would like to choose the point of reentry into the subject, which I cannot do in lectures.\n\nI would like to have preselected and vetted source material so sift through layed out for me with an estimation of time I should need to process it and a questionaire or list to guide me to the important parts I will need to show proficiency for in examns, and have a lecturer for questions if they come up only.\n\nI had **one** course that did this in all my Bachelors and Masters lectures and it was the best course I've had in terms of learning accomplishment.I visited this course thrice all semester, because I had questions.The lecturer was a hard-ass, the examn was incredibly hard compared to all the others I wrote, which much transfer knowledge being demanded. I aced that test completely unexpectedly. Not only did I learn much about the subject, but also about organization and learning itself seemlessly along the way. It was vastly superior to any other learning method I was subjected to.\n\nAlso, while this would mean additional work for lecturers to collect, vet and organize the information, work for the alloted time of the lecture itself is alleviated. We had sessions where few questions crept up and all was over in 20 mins, instead of 90.It would take load of from professors, which imo have so many things to do already, at least in my country.\n\nThe focus of lectures would also require lecturers to actually know their stuff to answer questions and not copying a source in their lecture, having a reading (which ironically \"reading\" would be the exact translation for our word for \"lectures\" in uni to english) and then pointing to another source to dodge the question to basically say: Work it out yourself. I've had those professors and those are useless.",
            "title_similarity": "0.77771723",
            "sentiment_compound": 0.8102
        },
        {
            "id": "hpra3p8",
            "score": 1,
            "text": "I asked to record my classes in college and had a voice recorder.  I would listen to the lecture in twice the speed and it assisted with notes and recalling what the lecture was.",
            "title_similarity": "0.72044337",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpraid5",
            "score": 1,
            "text": "Education online will never replace real teachers in real life. Watch them all as many times as you like.",
            "title_similarity": "0.4199224",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hprajet",
            "score": 1,
            "text": "Yup.  This is what got me through medical school.  Well this and a bunch of other strategies.  But this was definitely in the mix.  Good times.  And by good times I mean I gave up my 20’s.",
            "title_similarity": "0.5879495",
            "sentiment_compound": 0.9153
        },
        {
            "id": "hprd4od",
            "score": 1,
            "text": "I watch almost all videos at 1.5-2x speed depending on how slow and meandering the speaker is. It just sounds better and is more easily digestible for my adhd brain",
            "title_similarity": "0.6716559",
            "sentiment_compound": 0.6801
        },
        {
            "id": "hprhcfx",
            "score": 1,
            "text": "Abstract\nWe presented participants with lecture videos at different speeds and tested immediate and delayed (1 week) comprehension. Results revealed minimal costs incurred by increasing video speed from 1x to 1.5x, or 2x speed, but performance declined beyond 2x speed. We also compared learning outcomes after watching videos once at 1x or twice at 2x speed. There was not an advantage to watching twice at 2x speed but if participants watched the video again at 2x speed immediately before the test, compared with watching once at 1x a week before the test, comprehension improved. Thus, increasing the speed of videos (up to 2x) may be an efficient strategy, especially if students use the time saved for additional studying or rewatching the videos, but learners should do this additional studying shortly before an exam. However, these trends may differ for videos with different speech rates, complexity or difficulty, and audiovisual overlap.",
            "title_similarity": "0.7861135",
            "sentiment_compound": 0.7839
        },
        {
            "id": "hprhf2i",
            "score": 1,
            "text": "An equally important study would be- if a student has the option of watching at increased speed, what is the increases likelihood that they will attend to the video start to finish, keeping eyes on screen 80% or more of the duration.  When I’m forced to watch a video at 1x speed, there is a high likelihood that I will get out my phone and scroll as I let the lecture play and listen just enough to get through the comprehension questions.  The problem with many of these studies is that that they are conducted in a scenario where an undergraduate goes into a room for 30 minutes and uses strategy A or Strategy B.  In reality, most study time occurs in a free operant situation where you can choose to study or not.   That’s the flaw with those studies that say listening to music while you study doesn’t help you learn— maybe you learn a little less efficiently than studying with silence, but if listening to music while you study makes you more likely to actually start studying or to study for a longer time, it works.  I just get enraged at videos locked at 1x because it’s torture, and I can’t listen- and I like to learn. I imagine the decision is made by some academic beurocrat who should have retired long ago who thinks fondly of his slow boring lectures and says that’s the way should be, and judges fast video watchers as cheaters who just want to get out of lecture time, and thinks no one could possibly get the genius of what he’s saying at an increased speed.  But in in-person lectures actually have a lot more information -beyond the words of the speaker - most people are looking at the other students to see their reactions to what is said, or you might consider a question to ask.  Listening to the information in recorded lecture is not that different from reading a book, but a lecture happens at 150 wpm and college students read at 250-300 wpm.  If you want me to listen to a person talking- fine- I’m happy to consume information that way but LET ME SPEED IT UP!",
            "title_similarity": "0.71972436",
            "sentiment_compound": 0.4689
        },
        {
            "id": "hps2bjd",
            "score": 1,
            "text": "me who doesnt believe everything i read",
            "title_similarity": "0.23185907",
            "sentiment_compound": 0.0
        },
        {
            "id": "hps2kjz",
            "score": 1,
            "text": "Only in US y'all... Sorry no 2x speed available in other countries",
            "title_similarity": "0.30011886",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hps4oqf",
            "score": 1,
            "text": "Good thing I do this anyway to save time.",
            "title_similarity": "0.46180192",
            "sentiment_compound": 0.7269
        },
        {
            "id": "hpu5jud",
            "score": 1,
            "text": "I always take notes on my first watch but as I never reread them I question their value.  I also have gotten a lot out of watching lectures again as review for the final.  At the very least I enjoy the feeling of now understanding what initially confused me.",
            "title_similarity": "0.687148",
            "sentiment_compound": 0.7647
        },
        {
            "id": "hyhnjsv",
            "score": 1,
            "text": "This is how I managed to learn Differential Equations. Professor Leonard at two times speed.",
            "title_similarity": "0.6458757",
            "sentiment_compound": 0.0
        }
    ]
}