{
    "A field experiment in India led by MIT antipoverty researchers has produced a striking result: A one-time boost of capital improves the condition of the very poor even a decade later.\n": [
        {
            "id": "hptozy4",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.42545462",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hpu67fm",
            "score": 12,
            "text": "That's why Capitalists make it a point to gut any social programs they can. People that did not grow up in crushing poverty require more work before they can be broken and enslaved.",
            "title_similarity": "0.4802977",
            "sentiment_compound": -0.891
        },
        {
            "id": "hpv0y6d",
            "score": 0,
            "text": "Being poor is expensive. Capitalism will eat itself, it's an inevitability because the actual system isn't sustainable. Money is fake and doesn't need to exist.",
            "title_similarity": "0.40513197",
            "sentiment_compound": -0.7351
        },
        {
            "id": "hpv2wxj",
            "score": 1,
            "text": "Wow, maybe we shouldn't let little bald-headed men hoard all the capital",
            "title_similarity": "0.36478186",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hpurki7",
            "score": 0,
            "text": "So poor peoples lives improve with more money copy that",
            "title_similarity": "0.63923407",
            "sentiment_compound": -0.1263
        },
        {
            "id": "hpums1l",
            "score": 9,
            "text": "Which is why I think that we should not talk about universal basic income, but universal basic capital. If everyone in the USA got $25000 at birth it would make $1miliion by the time they retire. We shouldn't fight capitalism. We should make it work for as many as we can. Compound interest and exponentials should be one of the first things kids learn in school.",
            "title_similarity": "0.65294266",
            "sentiment_compound": 0.7767
        },
        {
            "id": "hptrzcw",
            "score": -17,
            "text": "Its an interesting study for sure, but I can’t help but feel like this isn’t something that would easily translate to other regions of the world.",
            "title_similarity": "0.36832482",
            "sentiment_compound": 0.9081
        },
        {
            "id": "hpu2c8i",
            "score": -15,
            "text": "Let’s not let the government get away with only giving one time boosts. It should be consistent boost done multiple times a year or at least once a year.",
            "title_similarity": "0.65098697",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hpty4yi",
            "score": 21,
            "text": "Why does everything have to be for profits and consumerism.",
            "title_similarity": "0.43949527",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpunuuh",
            "score": 0,
            "text": "You mean giving poor people money helps them?!? Shocker! What's the next article, giving starving people food makes it so they don't die??",
            "title_similarity": "0.5670712",
            "sentiment_compound": 0.7053
        },
        {
            "id": "hptr0ci",
            "score": 22,
            "text": "I actually got 1200 dollars last year and now my grandchild owns a Fortune 500 company thanks donnie",
            "title_similarity": "0.6072476",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpur90s",
            "score": 14,
            "text": "Haven't we given Africa trillions?",
            "title_similarity": "0.3385389",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpuby9o",
            "score": 38,
            "text": "BUt tHe pOOrs wILL jusT speNd cHarITY on hOokerS anD blOw.",
            "title_similarity": "0.4380721",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hpu2wgd",
            "score": 30,
            "text": "This kinda stuff needs a sub for it. How about r/yeahnoshit",
            "title_similarity": "0.19769078",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpuy2ej",
            "score": -5,
            "text": "Time to redistribute wealth from the rich to people who will actually do worthwhile things with it.\n\nEDIT: or keep sucking their dicks and hope that things magically get better I guess.",
            "title_similarity": "0.657941",
            "sentiment_compound": 0.9325
        },
        {
            "id": "hpu97hs",
            "score": 11,
            "text": "Ahh banerjee duflo et AL. Let's give the poor a little bit of money. Radical thinking for an economist, a tired (if necessary and agreed) first step for a political economist.\n\nWhile it's great economists are rediscovering this, it's continually sad that they repackage this as THE solution. Capital is a vital first step but this is not a surprising finding nor one that should distract from the vital next steps of creating a system of robust institutions which allow an increasing swath of society to benefit from the returns to capital which make capitalism the unrivaled most successful system of wealth creation in human history.\n\nHowever, far too many of these economists (even well intentioned nobel prize winners) think that just sprinkling some capital is the solution, the end, that it (because this is an easy intervention to implement and measure, while large social structural change is diffuse and difficult to publish fancy methods papers on).\n\nTldr, good job, you've once again retread that idea that in order to float first you need water. Now let's build boats too rather than being shocked to find that water helps you float.",
            "title_similarity": "0.63415974",
            "sentiment_compound": 0.9923
        },
        {
            "id": "hpu3lgj",
            "score": 72,
            "text": "Wow imagine improving poverty, an economic state of being defined by its lack of wealth and/or income, could be done by just giving money",
            "title_similarity": "0.57682097",
            "sentiment_compound": 0.765
        },
        {
            "id": "hpv28dv",
            "score": 1,
            "text": "Damn, corporations and lobbyists aren't gonna wanna hear about this one.\n\nI noticed this with the COVID money 2 years ago. I had more money in my bank than ever before and I didn't want to spend any of it. I wanted to see it grow.\n\nI think always running on a deficit or just barely scraping by promotes overspending, because you figure you can't afford anything anyways, might as well spend the last bit on something you'll enjoy. A cycle of poverty.",
            "title_similarity": "0.59363353",
            "sentiment_compound": -0.3582
        },
        {
            "id": "hpvo7n5",
            "score": 1,
            "text": "Funny it is all solved by Socialism and good public policy but MIT can't say that.",
            "title_similarity": "0.5190296",
            "sentiment_compound": 0.5346
        },
        {
            "id": "hpup403",
            "score": 15,
            "text": "My theory is that those in power largely know this works but intentionally keep people poor to maintain the surplus labor pool. They don't want people to be financially independent because it would disturb the heirarchy.",
            "title_similarity": "0.44459188",
            "sentiment_compound": -0.8415
        },
        {
            "id": "hpubq5a",
            "score": 27,
            "text": "Isn't this what the government did with the \"40 acres and a mule\". \n\nPeople forget where they got their wealth, and definitely don't want to admit it was stolen or handed to them at the beginning",
            "title_similarity": "0.45455518",
            "sentiment_compound": -0.0036
        },
        {
            "id": "hpumqs9",
            "score": 6,
            "text": "Bailouts for individuals not for banks and corperations?\n\nSomeone with no money is either going to spend a bailout on themselves, their family/friends, their home, holidays, new business everything that fuels the worlds economics, creates employment.",
            "title_similarity": "0.538597",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hpunlci",
            "score": -3,
            "text": "Wow no way giving the poor money improves their life I never saw that coming",
            "title_similarity": "0.44769484",
            "sentiment_compound": 0.068
        },
        {
            "id": "hpv0enx",
            "score": 1,
            "text": "And once again, this proofs that some nations are ‘kept’ poor by the rich.",
            "title_similarity": "0.51034445",
            "sentiment_compound": 0.128
        },
        {
            "id": "hpv95bt",
            "score": -2,
            "text": "Karl Marx was right, bourgeois are the very thong that brong the system down, if you need to give capitol to people just to make things work, its not capitalism, its now more akin to marxist theories of labour. R\\science, omfg what are you turning into...",
            "title_similarity": "0.50242424",
            "sentiment_compound": 0.0
        },
        {
            "id": "hptq76r",
            "score": 125,
            "text": "Somebody send this to Manchin",
            "title_similarity": "0.22595343",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpv3fv9",
            "score": 6,
            "text": "I will never cease to be amazed at how many people are surprised that giving poor people money, makes them less poor",
            "title_similarity": "0.5963901",
            "sentiment_compound": 0.1513
        },
        {
            "id": "hpukv15",
            "score": 96,
            "text": "The title is misleading. They got livestock and Additionally, the households received 30-40 weeks of consumption support, some access to savings, and weekly consultations with staff from India-based Bandhan Bank for 18 months.\n\nThis is way beyond just handing out cash.",
            "title_similarity": "0.582656",
            "sentiment_compound": 0.0
        },
        {
            "id": "hptx0dj",
            "score": -12,
            "text": "[removed]",
            "title_similarity": "-0.0153326765"
        },
        {
            "id": "hpv34sr",
            "score": 3,
            "text": "This is as Keynesian as you get.",
            "title_similarity": "0.41890493",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpus8k1",
            "score": 8,
            "text": "It's so funny to see social scientists publish \"groundbreaking research\" that has been mainstream in economics departments for decades...",
            "title_similarity": "0.7171916",
            "sentiment_compound": 0.4927
        },
        {
            "id": "hpus9cv",
            "score": 3,
            "text": "Economists discover the hot water.",
            "title_similarity": "0.4865182",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpuv5qf",
            "score": 4,
            "text": "Unfortunately in the U.S. we hate the poor.",
            "title_similarity": "0.3140245",
            "sentiment_compound": -0.8481
        },
        {
            "id": "hpuyj0m",
            "score": 0,
            "text": "this is why some criminals in my country start some sort of busisness and be very sucessfull to be later killed by new criminals/former enemies",
            "title_similarity": "0.38733894",
            "sentiment_compound": -0.9081
        },
        {
            "id": "hpvaxgl",
            "score": 0,
            "text": "Helping the poor helps the poor? That can’t be right",
            "title_similarity": "0.33923095",
            "sentiment_compound": -0.34
        },
        {
            "id": "hpw6khd",
            "score": 0,
            "text": "For the most part it would be better to do away with most aid programs and just straight up give poor people cash",
            "title_similarity": "0.4745496",
            "sentiment_compound": 0.1779
        },
        {
            "id": "hpumv8q",
            "score": -1,
            "text": "Any researchers fancy trying that with me?",
            "title_similarity": "0.3568215",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpuo5u3",
            "score": -1,
            "text": "This is possibly the least \"striking\" piece of information I've heard all year. \n\n\nPLANET IN SHOCK AS MONEY HELPS POOR",
            "title_similarity": "0.643705",
            "sentiment_compound": -0.5904
        },
        {
            "id": "hpuprxu",
            "score": -1,
            "text": "I don't know how much more evidence we need before we finally admit that the filthy rich hoarding capital is bad for all of society.",
            "title_similarity": "0.4532965",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hpuwqmd",
            "score": -1,
            "text": "It's why I keep repeating that redlining from the 50s still effects black people today",
            "title_similarity": "0.4462276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpuxx0q",
            "score": 1,
            "text": "$0 to $1 makes a huge difference, $1,000 + $1 makes little difference. Small numbers but you people should get the point but hey I guess there's precedent now. So it's kind of a stupid study.",
            "title_similarity": "0.64912814",
            "sentiment_compound": -0.6059
        },
        {
            "id": "hpuxzqu",
            "score": -1,
            "text": "I literally might be dead if it wasn't for the covid stimulus\n\nEdit: I was in a grateful mood, my bad I guess?",
            "title_similarity": "0.5759989",
            "sentiment_compound": -0.7003
        },
        {
            "id": "hpvek0d",
            "score": 1,
            "text": "How weird that giving people the resources necessary to participate in your system makes it better.",
            "title_similarity": "0.5794711",
            "sentiment_compound": 0.5574
        },
        {
            "id": "hpu9pni",
            "score": 59,
            "text": "If a capital infusion helps a population a decade later, what does several generations of wealth extraction and opportunity limitation do to other populations?..",
            "title_similarity": "0.74132836",
            "sentiment_compound": 0.7506
        },
        {
            "id": "hpuoit2",
            "score": 2,
            "text": "Did they spend it all on Jordans though?",
            "title_similarity": "0.25639433",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpuouys",
            "score": 2,
            "text": "Yeah. Perhaps there, with those specific people, that have the culture and customs that THEY have.  You think that would work for a vast majority of drug addicts and homeless in the inner cities in the US?  You're dreaming.  This is a problem of welfare state ruining people.  The solution here is complicated.  It's certainly not \"give them all money, and we're good to go.\"",
            "title_similarity": "0.5394742",
            "sentiment_compound": 0.6249
        },
        {
            "id": "hpuuq46",
            "score": 2,
            "text": "A while back there was a study of studies done in this area. The result is not always the same. Different locations did different things with the money, not always resulting in a long term benefit.",
            "title_similarity": "0.35226387",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpuvsvs",
            "score": 2,
            "text": "We should do away with most aid programs and straight up give poor people cash",
            "title_similarity": "0.48132408",
            "sentiment_compound": -0.296
        },
        {
            "id": "hpuw5cg",
            "score": 2,
            "text": "Is anyone surprised that helping people out of poverty actually makes their lives better? Because I’m not.",
            "title_similarity": "0.5497811",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hptuqud",
            "score": 551,
            "text": "As I suspected:\n\n>Ultimately 266 participating households were offered a one-time boost of assets; about 82 percent of those households chose livestock. Additionally, the households received 30-40 weeks of consumption support, some access to savings, and weekly consultations with staff from India-based Bandhan Bank for 18 months\n\nThey gave back productive capital to the poor and the poor were better off for it. \n\nIt reaaaaally isn't rocket science and the fact that the MIT had to run an experiment to prove this shows how deep the whole \"trickle down\" bs runs.",
            "title_similarity": "0.7637035",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hpunru2",
            "score": -5,
            "text": "Shhh don't tell Republicans, their bootstraps might fall off if they don't believe in them anymore.",
            "title_similarity": "0.41359794",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpvm7xa",
            "score": 6,
            "text": "Conversely, you can bet that hording vast wealth privately or in large capitalist organizations worsens poverty globally.\n\n\nDo the Koch Brothers or the Waltons or Bezos or Gates families care that homelessness and abject poverty can be ended?  Unfortunately,  their concerns may be more that mass survival of poor people could leave less resources for their consumption and exploitation.",
            "title_similarity": "0.57419723",
            "sentiment_compound": -0.8402
        },
        {
            "id": "hpvd0gv",
            "score": 21,
            "text": "Because, contrary to popular belief, when poor people get a big check they buy the expensive thing they've needed for years that can improve their life dramatically. We don't go wasting it. We get a car, a washing machine, a decent computer, maybe a nice mattress. All the things rich people take for granted. I was 35 before I had my first dishwasher. Do you have any idea how much a dishwasher improves your life? I added an hour to almost every day.",
            "title_similarity": "0.7351147",
            "sentiment_compound": 0.9332
        },
        {
            "id": "hpu5ykh",
            "score": 588,
            "text": "In Germany we are currently discussing a public \"inheritance\" at the age of 18 of about 20.000€. I think that is a genius idea. Better than universal income.",
            "title_similarity": "0.6775258",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpup178",
            "score": 180,
            "text": "This is why I believe in micro loans and have done it for years.  I use KIVA but there are other sites.  No more than $25.  Some countries you can live on a dollar a day.  Liberia for example.  So $25 is a huge sum in these places.  And they pay it back.  It isn't charity, it is a loan.",
            "title_similarity": "0.6382556",
            "sentiment_compound": -0.5343
        },
        {
            "id": "hpux0ts",
            "score": 32,
            "text": "Plants grow where sun shines,, weird.",
            "title_similarity": "0.2492935",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hpu7qlq",
            "score": 1035,
            "text": "This is focused on a temporary capital shock, but it’s consistent with research into permanent wealth/income shocks; similar findings exist for the benefits of socialized medicine, in that it improves health/economic outcomes for generations to come.\n\nPaper detailing the impact of permanent income shocks, commonly referred to as UBI:\n\nhttps://www.nber.org/system/files/working_papers/w24312/w24312.pdf\n\nSame author, but this time discussing marginal effects on health/social outcomes:\n\nhttps://rooseveltinstitute.org/wp-content/uploads/2020/07/RI-No-Strings-Attached-201705.pdf\n\nEdit: and there are plenty more studies into this, from numerous disciplines. I’ll go into my folder and pull some out, if anyone’s interested. I just happened to have this author’s work handy at the moment.",
            "title_similarity": "0.73730177",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hpupygw",
            "score": 200,
            "text": "I read years ago about the reverse, how wealth perpetuates itself for, literally, centuries. \n\nThis is evident in Hollywood today where so may second and third generation young people are assuming positions of power. No doubt they are talented but it becomes more and more difficult for someone - perhaps even more talented - on the outside to breakthrough.",
            "title_similarity": "0.62962955",
            "sentiment_compound": 0.6818
        },
        {
            "id": "hpvdonl",
            "score": 46,
            "text": "Its almost like giving poor people money helps them.",
            "title_similarity": "0.44505915",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hptsgy2",
            "score": 3714,
            "text": "Funny, isn't it—how people who aren't under duress find themselves able to make more thoughtful decisions which can benefit them long-term.",
            "title_similarity": "0.56164956",
            "sentiment_compound": 0.8313
        },
        {
            "id": "hpuz4ez",
            "score": 188,
            "text": "If the results of this experiment excited you, please consider giving to Give Directly, an organization that specializes in direct cash transfers and is one of the highest rated charities.\n\ngivedirectly.org",
            "title_similarity": "0.63689184",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hptvnom",
            "score": 3051,
            "text": "[removed]",
            "title_similarity": "-0.0153326765"
        },
        {
            "id": "hpuh921",
            "score": 222,
            "text": "My first reaction to this was a sarcastic \"I wonder what the WallStreetBets crowd will look like in ten years.\"  But once I thought about it, I decided that it would actually be an interesting study.",
            "title_similarity": "0.64858043",
            "sentiment_compound": 0.5859
        },
        {
            "id": "hpuop8m",
            "score": 1,
            "text": "The rag drops will continue until morale improves.\"",
            "title_similarity": "0.45766625",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpuq7nu",
            "score": 1,
            "text": "Tell me more about results the ultra rich nor any politician could care any less about.",
            "title_similarity": "0.47367245",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hpuro70",
            "score": 2,
            "text": "[GiveDirectly](https://www.givedirectly.org/) is an awesome non-profit that is working on executing and scaling precisely this idea! They mostly work in African countries for now and rely on donor funds for unconditional cash transfers to the extreme poor.",
            "title_similarity": "0.5503061",
            "sentiment_compound": 0.2498
        },
        {
            "id": "hputdin",
            "score": 1,
            "text": "This is not hard to believe at all.",
            "title_similarity": "0.17872259",
            "sentiment_compound": 0.0762
        },
        {
            "id": "hpuu8rp",
            "score": 1,
            "text": "I've been told the poor will just spend it on drugs.",
            "title_similarity": "0.35340932",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hpuuuwq",
            "score": 1,
            "text": "Does anyone know how much was given initially to the poor?",
            "title_similarity": "0.41765082",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hpuuw9t",
            "score": 1,
            "text": "In case you want to give very poor people money: https://www.givedirectly.org/",
            "title_similarity": "0.45466575",
            "sentiment_compound": -0.4754
        },
        {
            "id": "hpuuyyf",
            "score": 1,
            "text": "Better to spend money to go to Mars I guess.",
            "title_similarity": "0.364123",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpuv8s7",
            "score": 1,
            "text": "You know what would really improve the conditions of the poor in India? Force the British to repay everything they stole.",
            "title_similarity": "0.6546872",
            "sentiment_compound": 0.024
        },
        {
            "id": "hpuvc4r",
            "score": 1,
            "text": "Would it work in a wealthy country like USA or Canada? Severely impoverished in a bleak land with no spending opportunities may use capital very sparingly, whereas the temptations we have here may be too much for the poor. Might need a geo-specific study.",
            "title_similarity": "0.5781665",
            "sentiment_compound": -0.6688
        },
        {
            "id": "hpuvn60",
            "score": 1,
            "text": "Striking but not surprising",
            "title_similarity": "0.2650388",
            "sentiment_compound": -0.3007
        },
        {
            "id": "hpuww8d",
            "score": 1,
            "text": "I always wondered if there was a good organization the would distribute money to the families of severely poor countries. More like a UBI for area that needs it. \n\nIf someone can point me in the right direction it would be greatly appreciated.",
            "title_similarity": "0.59162426",
            "sentiment_compound": 0.4915
        },
        {
            "id": "hpux1tj",
            "score": 22,
            "text": "The opposite is well studied -- recovery from economic crises is very difficult.\n\nCapital stock is hard to rebuild.",
            "title_similarity": "0.4291705",
            "sentiment_compound": -0.2716
        },
        {
            "id": "hpux48s",
            "score": 1,
            "text": "what does that even mean? one-time capital boost? like, giving out free money?",
            "title_similarity": "0.58182716",
            "sentiment_compound": 0.887
        },
        {
            "id": "hpux9r2",
            "score": 1,
            "text": "Is this a joke? Who would even suggest it doesn't? Seems like common sense?",
            "title_similarity": "0.27950406",
            "sentiment_compound": 0.1606
        },
        {
            "id": "hpuxa1x",
            "score": 1,
            "text": "Didn’t even care for their followers.",
            "title_similarity": "0.0643146",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hpuxu24",
            "score": 1,
            "text": "This same principle applies to boot strap argument. Where you start/getting a boost makes a huge difference.",
            "title_similarity": "0.46094522",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpuy2ay",
            "score": 1,
            "text": "In general, I absolutely love the Poverty Action Lab (J-PAL). Their research, motives, open-ness to new ideas, and creativity are top-notch.\n\nI really wish I would have gotten that job with them out of grad school :/  The only research group I will always read every time.",
            "title_similarity": "0.6349739",
            "sentiment_compound": 0.6276
        },
        {
            "id": "hpuzn8h",
            "score": 3,
            "text": "We know how to improve the material conditions of the poor and we know that doing so benefits society. We choose not to so that the threat of poverty can be used to scare people into accepting being exploited.",
            "title_similarity": "0.5671971",
            "sentiment_compound": -0.8125
        },
        {
            "id": "hpv058w",
            "score": 1,
            "text": "These articles about studies that prove common sense are tremendous.",
            "title_similarity": "0.40866566",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpv0rvt",
            "score": 1,
            "text": "Giving people money makes them less poor, huh?",
            "title_similarity": "0.51144594",
            "sentiment_compound": -0.1045
        },
        {
            "id": "hpv0uv6",
            "score": 1,
            "text": "Has anyone studied how result vary by culture or country? I'm going to guess some areas (India) see greater results than others (inner city USA).",
            "title_similarity": "0.6002672",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hpv0uxj",
            "score": 1,
            "text": "I think it's hardly applicable to western economies. People of Third World are obviously capital-starved and providign them with capital obviously improves their quality of life tremendously. These people received around 1000 USD, but that's two years of their income.",
            "title_similarity": "0.75685227",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hpv1ez8",
            "score": 1,
            "text": "I can see conservatives latching on to this and saying since we got those stimulus checks why don't we have houses yet.",
            "title_similarity": "0.5780821",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpv1hxs",
            "score": 1,
            "text": "I think \"striking result\" is maybe a bit hyperbolic.",
            "title_similarity": "0.2762633",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpv1jzp",
            "score": 1,
            "text": "I have to think there's more to this right? Most lotto winners are broke a year or two later with their chance of suicide going up 5x or something.",
            "title_similarity": "0.5730078",
            "sentiment_compound": -0.4445
        },
        {
            "id": "hpv1kay",
            "score": 1,
            "text": "I was _just_ talking about this kind of experiment! We've got a pile of examples that prove this, we just never admit that it's the way to go",
            "title_similarity": "0.3662319",
            "sentiment_compound": -0.2225
        },
        {
            "id": "hpv1kh9",
            "score": 1,
            "text": "I'm gonna guess that they didn't spend that \"one-time boost\" on iphones or flat screen TVs from Walmart.",
            "title_similarity": "0.40532023",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpv23ag",
            "score": 1,
            "text": "The result should not be striking.  It should be common sense.  A lot of people assume someone poor needs assistance their entire life, which is false.   You only need that boost in the beginning, and most people can take it from there.",
            "title_similarity": "0.4825996",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hpv29oo",
            "score": 1,
            "text": "I think along with the one time capitol, you give them something more important, hope. They start to see possibilities with money and maybe invest better.",
            "title_similarity": "0.62389517",
            "sentiment_compound": 0.8004
        },
        {
            "id": "hpv34in",
            "score": 1,
            "text": "To me its kinda seems obvious but I guess I had no proof to back my viewpoint. Kinda gives credit to the phrase \"It takes money to make money\".",
            "title_similarity": "0.43221688",
            "sentiment_compound": 0.0471
        },
        {
            "id": "hpv38xm",
            "score": 1,
            "text": "If you give one guy in a village a pile of money, then 10 years later that one guy is richer than his neighbour...\n\nBut are his neighbours less well off?\n\n\nIs there any way to measure this effect?   How much if a zero sum game is it? (Where the giving of money just causes localized inflation).",
            "title_similarity": "0.67765975",
            "sentiment_compound": 0.7935
        },
        {
            "id": "hpv3d39",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.031732008"
        },
        {
            "id": "hpv3k8j",
            "score": 1,
            "text": "Makes sense. When your THAT poor a decent sum of money would help people establish themselves forever",
            "title_similarity": "0.6296991",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hpv4hit",
            "score": 1,
            "text": "Wow.\n\nA big chunk of money helps poor people.\n\nWho'd have thunk it...",
            "title_similarity": "0.5946446",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hpv4i7v",
            "score": 1,
            "text": "Who would've thought that having even a small bit of money for a down payment for a home or paying off student loan could have lasting effects?",
            "title_similarity": "0.53497493",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpv4wo0",
            "score": 1,
            "text": "Unconditional giving is the most effective form of charity",
            "title_similarity": "0.47819203",
            "sentiment_compound": 0.8221
        },
        {
            "id": "hpv573e",
            "score": 1,
            "text": "“But what about them using the money to buy drugs”",
            "title_similarity": "0.23173088",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpv5j4e",
            "score": 1,
            "text": "The study also included 18 months of coaching sessions or something like that. They were paid in cows. Total cost was around 2.3k. Much more energy than just giving them a certain amount of money.",
            "title_similarity": "0.5392622",
            "sentiment_compound": 0.8122
        },
        {
            "id": "hpv63fb",
            "score": 1,
            "text": "Capital beats a small monthly payment every time. Communities protect capital with ongoing effort and productivity. A payment however causes laziness and dependent behavior.",
            "title_similarity": "0.5995733",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hpv675u",
            "score": 1,
            "text": "Don’t let American poor people find out, they’re gonna think they’re the ones that have to give the money.",
            "title_similarity": "0.41896063",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hpv6j17",
            "score": 1,
            "text": "Antipoverty is such a weird word to describe these researchers. It implies these researchers are biased.",
            "title_similarity": "0.30325693",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hpv6m3z",
            "score": 1,
            "text": "Apparently money is the solution to not having enough money. Who knew.",
            "title_similarity": "0.43542907",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hpv73ej",
            "score": 1,
            "text": "Too bad the goal of basically all US politicians is to stay in power & not make the country better. It's probably easier for them to keep people polarized when they keep them poor.",
            "title_similarity": "0.45470187",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hpv7686",
            "score": 1,
            "text": "Being poor isn't an inherent trait - it's typically due to circumstance - generally the situation you're born into.\n\nWith this in mind, is it any surprise that poverty stricken communities benefit greatly from an injection of what they're lacking - wealth?\n\nMaybe it would be of benefit to us all to tax corporations and the rich more (fairly), and redistribute that wealth to communities that need it, and will have to spend it, stimulating the economy rather than sitting idle in an offshore account, contributing to the next zero in a billionaire's net worth.",
            "title_similarity": "0.6554897",
            "sentiment_compound": 0.9042
        },
        {
            "id": "hpv7oax",
            "score": 1,
            "text": "Argument for reparations incoming..........",
            "title_similarity": "0.27654874",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hpv9c2m",
            "score": 1,
            "text": "It is truly pitiful how slowly we are coming to such obvious realizations. \"Giving poor people money improves their lives? Write that down! I think we're onto something.\"",
            "title_similarity": "0.59791213",
            "sentiment_compound": 0.2714
        },
        {
            "id": "hpvahig",
            "score": 1,
            "text": "The “if you give poor people money they just lose it” argument has always seemed silly. Even a couple of thousand dollars once is enough to reduce debt a bunch, purchase a better car that will lead to less repairs, or start paying a mortgage. \n\nIt’s great to have evidence so directly tho. Poor people arn’t dumb, give them a bigger piece of the pie and they make something of it.",
            "title_similarity": "0.6607127",
            "sentiment_compound": -0.8542
        },
        {
            "id": "hpvaoxj",
            "score": 1,
            "text": "Gee, imagine if the “poor” had the same advantages as the wealthy?  We would quickly see that wealth is not earned but merely the result of privilege.",
            "title_similarity": "0.5332022",
            "sentiment_compound": 0.7814
        },
        {
            "id": "hpvarwh",
            "score": 1,
            "text": "Oh boy here come the musk hunters",
            "title_similarity": "0.2732851",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpvaugn",
            "score": 1,
            "text": "Wow, amazing! You make a one-time investment and it has returns?! No one could have possibly predicted this!",
            "title_similarity": "0.58597076",
            "sentiment_compound": 0.8061
        },
        {
            "id": "hpvay35",
            "score": 1,
            "text": "Someone should read up on what the Indian government has been doing for the very poor and the poor regarding skill building and then giving capital, ensuring food security during the pandemic, and so forth.\n\nA lot of good has been done by the government in the past 10 years, but it is largely ignored because of political and ideological bias within the academia and scientific community, both in india and worldwide.",
            "title_similarity": "0.67331123",
            "sentiment_compound": -0.4398
        },
        {
            "id": "hpvb0sa",
            "score": 1,
            "text": "***YOU DON'T SAY*** (Nicholas Cage)",
            "title_similarity": "0.10007251",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpvb442",
            "score": 1,
            "text": "Wow, it's almost as if money is the answer to poverty!",
            "title_similarity": "0.50800455",
            "sentiment_compound": 0.2003
        },
        {
            "id": "hpvbcw6",
            "score": 1,
            "text": "Did these guys finally get around to reading “Hitch”?",
            "title_similarity": "0.29153234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpvbv81",
            "score": 1,
            "text": "Poverty is a capitalist construct",
            "title_similarity": "0.3560898",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hpvc6hb",
            "score": 1,
            "text": "Now do a parallel experiment where they teach a group financial skills and business development skills.\n\nThen compare and contrast.",
            "title_similarity": "0.41736838",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpvcwzx",
            "score": 1,
            "text": "This isn't striking. Bill and Melinda gates have known this for over a decade",
            "title_similarity": "0.4406519",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpvd8bt",
            "score": 1,
            "text": "The [Grameen Bank](https://en.m.wikipedia.org/wiki/Grameen_Bank) has been offering microfinancing since the 80's with very good results.  This study seems to be directed at offering goods instead, but the results are similar.",
            "title_similarity": "0.74029225",
            "sentiment_compound": 0.2724
        },
        {
            "id": "hpvf7vo",
            "score": 1,
            "text": "MIT Proves: Money makes you less poor. Next up experts declare:Sky Blue",
            "title_similarity": "0.62446463",
            "sentiment_compound": -0.4228
        },
        {
            "id": "hpvfhwe",
            "score": 2,
            "text": "This doesn't surprise me. I lost my mom earlier this year and although I'd definitely rather have her back, the insurance money is going to change my life. No more debt, I'll be able to stop living paycheck to paycheck, I'll also probably buy a house and use the money for a down-payment so no more rent. I'll be in a much better place financially this time next year, just because of a one time financial gain.",
            "title_similarity": "0.70843625",
            "sentiment_compound": 0.2553
        },
        {
            "id": "hpvfyeq",
            "score": 1,
            "text": "Giving capital to the very poor in a capitalist system helps them long term is perhaps the biggest “DUUUUUUH!” in the history of academia.",
            "title_similarity": "0.6732255",
            "sentiment_compound": 0.2261
        },
        {
            "id": "hpvhvh0",
            "score": 1,
            "text": "The secret the United States corporate cartel doesn’t want you to know.",
            "title_similarity": "0.25806105",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hpvi352",
            "score": 1,
            "text": "Imagine being part of the control group...\n\nUgh...",
            "title_similarity": "0.17965364",
            "sentiment_compound": -0.4215
        },
        {
            "id": "hpvieis",
            "score": 1,
            "text": "Also water turns out to be wet!",
            "title_similarity": "0.15164235",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpvieiy",
            "score": 1,
            "text": "Title needs more context",
            "title_similarity": "0.14207812",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpvjns7",
            "score": 1,
            "text": "Too bad the billionaires on the planet are more interested in playing astronauts than helping the rest of humanity.",
            "title_similarity": "0.43466014",
            "sentiment_compound": 0.4131
        },
        {
            "id": "hpvjx1t",
            "score": 1,
            "text": "So when the English came and essentially raped the Indian subcontinents economy, they caused the opposite while setting up England to be as rich as it is today. Think maybe a bit of repayment for outstanding theft is due?",
            "title_similarity": "0.65695125",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hpvksyd",
            "score": 1,
            "text": "No thanks. I’ll stick with trickle down.",
            "title_similarity": "0.1440177",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hpvl9i3",
            "score": 1,
            "text": "I’m here to express my disdain for M.I.T’s students and culture of anti intuitive actions.",
            "title_similarity": "0.25972545",
            "sentiment_compound": -0.6597
        },
        {
            "id": "hpvla0b",
            "score": 1,
            "text": "this seems to be evidence that poverty is a state that is constantly forced upon people",
            "title_similarity": "0.3217184",
            "sentiment_compound": -0.743
        },
        {
            "id": "hpvlux6",
            "score": 1,
            "text": "i discovered that having children makes life harder for the poverty stricken\n\ni dont think i am the only one to notice this",
            "title_similarity": "0.46968532",
            "sentiment_compound": -0.765
        },
        {
            "id": "hpvmppk",
            "score": 1,
            "text": "We studied this in business school. Micro-loans. Giving third-world business owners a $25 loan to buy supplies for a business like basket weaving ended up in less defaults on loans than the average in developed countries",
            "title_similarity": "0.631361",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hpvmryu",
            "score": 1,
            "text": "What Classifies as a one time boost?",
            "title_similarity": "0.35495442",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hpvn295",
            "score": 1,
            "text": "Question is where does the money come from and how it’ll affect the economy. No politic or billionaire is gonna take it out of their pockets so they just print more money causing inflation. Ain’t gonna work long term",
            "title_similarity": "0.5412301",
            "sentiment_compound": -0.296
        },
        {
            "id": "hpvng3p",
            "score": 1,
            "text": "Is it saying that money can improve your life? Is that the striking part?",
            "title_similarity": "0.6306995",
            "sentiment_compound": 0.504
        },
        {
            "id": "hpvngho",
            "score": 1,
            "text": "I helped in the data collection for this study. AMA.",
            "title_similarity": "0.38822994",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpvnlbg",
            "score": 1,
            "text": "Crossposted to r/Billionaires",
            "title_similarity": "0.37695676",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpvnpay",
            "score": 1,
            "text": "Microfinance is a sham",
            "title_similarity": "0.21471092",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpvomj8",
            "score": 2,
            "text": "I'd love something like this for the down payment on a house.\n\nThe mortgage on a 4br house near me is significantly cheaper than rent on a 800ft^2 1br apartment. But those crazy apartment rents keep me living paycheck to paycheck, so I can't save up for a down payment.\n\nIf I could get that down payment I could save money on living expenses while building an asset instead of flushing money down the drain on rent. It would transform my life.",
            "title_similarity": "0.66619873",
            "sentiment_compound": 0.6075
        },
        {
            "id": "hpvopgj",
            "score": 1,
            "text": "Good. We don't even have carpets.",
            "title_similarity": "0.10626508",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpvouq6",
            "score": 2,
            "text": "Money makes money; poverty breeds poverty.",
            "title_similarity": "0.41424888",
            "sentiment_compound": -0.765
        },
        {
            "id": "hpvpt0o",
            "score": 1,
            "text": "This is what the charity [Give Directly](https://www.givedirectly.org/) does all over the world!\n\n/u/give-directly",
            "title_similarity": "0.37066048",
            "sentiment_compound": 0.4753
        },
        {
            "id": "hpvq2b2",
            "score": 1,
            "text": "The joestars have great taste in women improves.",
            "title_similarity": "0.4764619",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hpvqyrn",
            "score": 2,
            "text": "I love this!\nIts incredible what people can do with a much needed financial boost when they have been on the rails of near poverty for so long.\nYou start to just think about what you specifically need, unlike when you are rolling in the steady pay and become accustomed to the money.\n\nKinda thinking of it as the ( the more you make the more you spend) but the random financial gift can get you that extra step out of \" the hole\"",
            "title_similarity": "0.6839963",
            "sentiment_compound": 0.7385
        },
        {
            "id": "hpvsg7p",
            "score": 1,
            "text": "I know that without needing to do any field experiment, its called common sense.",
            "title_similarity": "0.20656988",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpvshxc",
            "score": 1,
            "text": "Breaking! Giving poor people money makes them less poor!",
            "title_similarity": "0.536126",
            "sentiment_compound": -0.6238
        },
        {
            "id": "hpvso5o",
            "score": 2,
            "text": "Pay really poor people and those poor people find a way to lift themselves upward. If Ebenezer Scrooge can pay the mortgage of his lowly paid bookkeeper, other rich people can become empathic to the plight of their fellow man.  That money paid for a better diet for Tiny Tim who recovered from TB and survived the lethal illness.  Maybe we should just help people for no better reason than the greater good.",
            "title_similarity": "0.64872825",
            "sentiment_compound": 0.5425
        },
        {
            "id": "hpvtgcr",
            "score": 1,
            "text": "You mean they didn’t just spend it all on drugs? *Shocked Joe Manchin Face*",
            "title_similarity": "0.32770738",
            "sentiment_compound": -0.3182
        },
        {
            "id": "hpvtzya",
            "score": 1,
            "text": "New study shows! Giving poor people stuff helps em be less poor! Extra extra read all about it!!",
            "title_similarity": "0.6812094",
            "sentiment_compound": -0.4723
        },
        {
            "id": "hpvx4za",
            "score": 1,
            "text": "Being poor is expensive. See Terry Pratchett in boots.",
            "title_similarity": "0.37806562",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hpvy1nu",
            "score": 1,
            "text": "“You only have to make a lot of money once”",
            "title_similarity": "0.3656522",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpw3dx3",
            "score": 1,
            "text": "'Striking' result? Good to hear that evidence is piling up.",
            "title_similarity": "0.46061385",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpw3orc",
            "score": 1,
            "text": " Not surprised.  The thing poor folks need most is money.",
            "title_similarity": "0.45080382",
            "sentiment_compound": -0.5812
        },
        {
            "id": "hpw430o",
            "score": 1,
            "text": "A one time boost of tossing out credit scores perhaps?",
            "title_similarity": "0.51493526",
            "sentiment_compound": 0.6486
        },
        {
            "id": "hpw43r8",
            "score": 1,
            "text": "So trickle up works better than trickle down?  But how did the poor people hide money in offshore accounts to avoid taxes & such?",
            "title_similarity": "0.5542331",
            "sentiment_compound": -0.8131
        },
        {
            "id": "hpw4jty",
            "score": 2,
            "text": "It’s almost as if the owners of Capital always have the advantage in Capitalism and make sure that the poor never get their hands on it while simultaneously exploiting them to produce more capital for themselves.",
            "title_similarity": "0.54933035",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hpw4qgm",
            "score": 1,
            "text": "wait for a decade.\n\nFun concept though.",
            "title_similarity": "0.595814",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hpw7j2c",
            "score": 1,
            "text": "Or we could just not have global capitalism….. you don’t need MIT researchers to solve this problem…",
            "title_similarity": "0.40925103",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hpw7m2v",
            "score": 1,
            "text": "it's almost as if giving poor people money makes them less poor.",
            "title_similarity": "0.51733345",
            "sentiment_compound": -0.5818
        },
        {
            "id": "hpw7szf",
            "score": 1,
            "text": "\"When you give poor people money, they become less poor\"\n\nIts kind of amazing how much cultural narrative is built up around denying that simple, self-evident fact.",
            "title_similarity": "0.5575483",
            "sentiment_compound": -0.5859
        },
        {
            "id": "hpw9wb1",
            "score": 2,
            "text": "Those stimulus checks helped me out more than anything back then",
            "title_similarity": "0.53231084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpw9y6x",
            "score": 1,
            "text": "lottery winners will beg to differ",
            "title_similarity": "0.26501793",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hpwaqj6",
            "score": 1,
            "text": "This investment gives autonomy about how the money is spent and the amount is proportional to a step they can make.\nAs a sensible one given the person and their circumstances.\nThat riot they had about big farmer taking over culture and\nTradition ,the underlying concerns could be addressed by such gifts occasionally .",
            "title_similarity": "0.5449294",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hpwc6z0",
            "score": 1,
            "text": "Id be willing to bet the reverse is also true",
            "title_similarity": "0.34332368",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hpwdadu",
            "score": 1,
            "text": "I like these experiments. Just give charity and measure how much it helps. Make the sample size bigger",
            "title_similarity": "0.6194061",
            "sentiment_compound": 0.7845
        },
        {
            "id": "hpweuy9",
            "score": 1,
            "text": "Indians have better money sense than the bottom 99% of Americans.",
            "title_similarity": "0.5877087",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hpwfjy1",
            "score": 1,
            "text": "“that’s communism!” \n-every republican trump supporter",
            "title_similarity": "0.40474486",
            "sentiment_compound": 0.3382
        },
        {
            "id": "hpwfpwo",
            "score": 1,
            "text": "Give poor people money to improve their situation\n\n\nWoah! Slow down there egghead",
            "title_similarity": "0.54608303",
            "sentiment_compound": -0.126
        },
        {
            "id": "hpwfw28",
            "score": 2,
            "text": "Oh you mean like cancelling student loans? Crazy",
            "title_similarity": "0.34405488",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hpwg4mf",
            "score": 2,
            "text": "IT was left over student loans for me.   When I graduated college, I had a lot of loan money left over.  THey gave me way too much.   I took that money and started a business with it and became very successful.    At the time , the interest rates for student loans were ridiculously low so I figured I could pay it back if the business failed.    Having just $15,000 to invest was life changing for me.",
            "title_similarity": "0.6617688",
            "sentiment_compound": -0.0276
        },
        {
            "id": "hpwgjhx",
            "score": 2,
            "text": "Proof free will doesn't exist",
            "title_similarity": "0.038786",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hpwhz8v",
            "score": 2,
            "text": "So hey guys, it turns out when people have to get by on very little, they get really really good at making the most of opportunities!",
            "title_similarity": "0.50626445",
            "sentiment_compound": 0.7678
        },
        {
            "id": "hpwisgf",
            "score": 3,
            "text": "Its almost like this myth that poor people will immidiately spend a large sum of money on hookers and blow only exsists in the mind of the upper classes?!\n\nSeriously if I got a large onetime cash injection into our economy I would immidiately pay off my home, no mortgage means more disposable income and better financial ratings, which will benefit our entire family and my kid's future as well.\n\nI wish there was a GoFundMe where applicants could just post their financial plan for getting free of debt and securing a stable future economy for themselves, and then donors can fund it, when the applicants straigthen out their finances, thay can then become donors themselves. Bypass the banks and their ratings system. It wouldnt be a place to fund a new invention or buisness plan for your bicycle seat store, just solely to pick people up and put them back on more stable ground.",
            "title_similarity": "0.67495644",
            "sentiment_compound": 0.9117
        },
        {
            "id": "hpwituv",
            "score": 1,
            "text": "Why is this a shocking result? It's literally just math.",
            "title_similarity": "0.28018636",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hpwj1nk",
            "score": 1,
            "text": "Does that capital go to the government? Or the people? Because I can guarantee that one of those groups are corrupt.",
            "title_similarity": "0.46805406",
            "sentiment_compound": 0.3313
        },
        {
            "id": "hpwkvjq",
            "score": 1,
            "text": "Poor people need money? WHO KNEW!?",
            "title_similarity": "0.347493",
            "sentiment_compound": -0.5792
        },
        {
            "id": "hpwl243",
            "score": 1,
            "text": "I’m shocked, shocked I tell you. Who could have predicted it",
            "title_similarity": "0.20496994",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hpwm8z8",
            "score": 1,
            "text": "It has been proven time and again that most people in poverty do not choose to be in that predicament.  Once you are there, it is very difficult to climb out without some type of boost. Imagine if governments around the world gave every citizen that turns 25 say $1 million dollars and a couple of appointments with a financial advisor.  Doesn't matter your circumstances.  Imagine the impact this could have on economies.  You know, buying a house, car etc.  Setting yourself up.  Ending world hunger and poverty is achievable - just if people are willing to do it.  Pay off student loans.  Universal healthcare.",
            "title_similarity": "0.66485274",
            "sentiment_compound": -0.7981
        },
        {
            "id": "hpwmmb0",
            "score": 3,
            "text": "#Trickle UP economics works!",
            "title_similarity": "0.53872216",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpwmsoa",
            "score": 1,
            "text": "I'll quote a famous leader: put the poor on the budget",
            "title_similarity": "0.5287239",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hpwmt3e",
            "score": 1,
            "text": "America basically proved this with the GI bill from ww2 that many black veterans were denied.",
            "title_similarity": "0.46187583",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hpwp5cz",
            "score": 2,
            "text": "As someone once said… “well duuuhhhh”",
            "title_similarity": "0.20271331",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpwpzbn",
            "score": 1,
            "text": "Guess that whole classist. “Give money to a poor person & it’s gone, give it to a rich person & it turns into more” maxim goes out the window then huh",
            "title_similarity": "0.52084357",
            "sentiment_compound": 0.128
        },
        {
            "id": "hpwr3wz",
            "score": 1,
            "text": "Pulling people out of the slums of socialism through capitalistic investment.",
            "title_similarity": "0.46258885",
            "sentiment_compound": 0.0
        },
        {
            "id": "hpwr9at",
            "score": 1,
            "text": "I volunteered in Haiti with a group that did this. I believe they're called Fonkoze (spelling may be wrong). They gave money to women who were in the class of Ultra Poor and helped them build businesses, invest that money and better themselves.\n\nWe met a woman who was at the start of the program and another woman who was months into the program and the difference was shocking. \n\nI got to ride Motorcycles out to different people's houses to give them nursing care as they had wounds or needed treatment as they were sick. I really saw the impact a bit of money can do for those in the ultra poor.\n\nTruly eye opening.",
            "title_similarity": "0.5422761",
            "sentiment_compound": -0.743
        },
        {
            "id": "hpwrrcr",
            "score": 2,
            "text": "This is why the rich must fight harder now than ever to prevent wages from rising,   Allowing the poor to have a gratifying existence will lower their ambition to produce the thneeds…l",
            "title_similarity": "0.50409514",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hpwtyr0",
            "score": 2,
            "text": "\"You can't give money to the poor, they'll just waste it!\"\n\n_runs out of things to spend money on so hides billions in the Cayman Islands_",
            "title_similarity": "0.39483207",
            "sentiment_compound": -0.8143
        },
        {
            "id": "hpxaliq",
            "score": 1,
            "text": "Wait isn’t it supposed to be better if it trickles down?",
            "title_similarity": "0.33644274",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hpxvsuq",
            "score": 1,
            "text": "Wow. Give the poorest actual cash and it improves their lives even a decade later?? That was a study?? That we’ll file away and do literally nothing about??? Cool…",
            "title_similarity": "0.80457026",
            "sentiment_compound": 0.6199
        },
        {
            "id": "hpy8qet",
            "score": 1,
            "text": "Seize the means of production",
            "title_similarity": "0.19173668",
            "sentiment_compound": 0.0
        },
        {
            "id": "hq0w145",
            "score": 1,
            "text": "Of course it would depend entirely upon the amount of the boost and the character/intellect of the recipient. One could go out and spend it all on wants and spend all of it immediately. Another could use it to further education making possible better-paying jobs. Still another might invest it or use it to fund an idea or invention. So many choices.",
            "title_similarity": "0.57536626",
            "sentiment_compound": 0.4019
        }
    ]
}