{
    "Study: School days should begin later in morning. School closures had a negative effect on the health and well-being of many young people, but homeschooling also had a positive flipside: Thanks to sleeping longer in the morning, teenagers reported improved health and health-related quality of life.\n": [
        {
            "id": "hrqvksw",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.56676245",
            "sentiment_compound": 0.7088
        },
        {
            "id": "hrrpwt7",
            "score": -7,
            "text": "If school starts earlier then how about going to bed early and building a healthy habit of not going to bed at 3am?",
            "title_similarity": "0.69923544",
            "sentiment_compound": 0.4019
        },
        {
            "id": "hrrv1kp",
            "score": 1,
            "text": "Teenagers should go to bed earlier. Problem solved.",
            "title_similarity": "0.5902846",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hrrkgy0",
            "score": -5,
            "text": "Is there something magical about waking up at 9 am?  \n\n\nOr maybe something magical is in getting ENOUGH SLEEP at it has little to do if someone wakes up at 8 or at 9?",
            "title_similarity": "0.6313629",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs1cnr",
            "score": -4,
            "text": "How about just going to bed earlier",
            "title_similarity": "0.3767196",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrrxdt9",
            "score": -2,
            "text": "Would going to bed earlier not do the same thing? Won’t the time they go to bed just shift due to the lack of need to get up?",
            "title_similarity": "0.5845293",
            "sentiment_compound": -0.3939
        },
        {
            "id": "hrr0kot",
            "score": 6,
            "text": "[removed]",
            "title_similarity": "-0.015226215"
        },
        {
            "id": "hrs86gr",
            "score": 1,
            "text": "This study is more about students should go to bed earlier than it is about school should start later.",
            "title_similarity": "0.64282835",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrr1owo",
            "score": -2,
            "text": "[removed]",
            "title_similarity": "-0.01522617"
        },
        {
            "id": "hrrpm5t",
            "score": -15,
            "text": "These are all valid points but the same benefit can be obtained by going to bed earlier. There seems to be a desire in everyone: kids, teens, and adults to fight going to bed. This bedtime procrastination and revenge bedtime procrastination as well as societal “norms” are also to blame. Whether we are justifying it by sacrificing sleep so we can “enjoy life” or feeling we have earned it because we work long and hard and it isn’t fair so we “deserve” this extra time it is still an attempt to justify what is unhealthy behavior. Don’t get me wrong I am all for a healthy work-life balance and a reduced work week. Let’s be honest people tend to both brag and seek sympathy for getting less sleep. While sometimes justified in seeking sympathy especially when dealing with chronic insomnia which can be a spiraling situation as poor/little sleep leads to poor decision making, as a society we need to stop treating it is cool/tough to sacrifice sleep for some other objective; it is toxic and ultimately detrimental to our physical and mental health.\n\nEdit: Let’s be honest eventually people/society would ultimately shift their bed-time to address a later start time for work/school.",
            "title_similarity": "0.7053373",
            "sentiment_compound": 0.8402
        },
        {
            "id": "hrrt6s3",
            "score": -11,
            "text": "This study is just stupid everyone knows that the problem isn't early classes but is instead going to bed late; it's like people complaining about a road where the speed limit is 50km/h being dangerous because they are driving at 100km/h",
            "title_similarity": "0.66051984",
            "sentiment_compound": -0.7311
        },
        {
            "id": "hrru1nn",
            "score": -6,
            "text": "Governments don’t care about facts, they’d rather follow their puritanical beliefs.",
            "title_similarity": "0.33316982",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hrrzfk3",
            "score": 3,
            "text": "Do teenagers need more hours of sleep per night, but still on a 24hr cycle? Or is this about teens having a circadian rhythm that's longer than 24 hours? If it's the latter, how does it help them if they regularly wake at 9am rather than 6am for example? Since it's still a 24hr cycle.",
            "title_similarity": "0.71181035",
            "sentiment_compound": 0.6237
        },
        {
            "id": "hrrklvx",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "-0.01522617"
        },
        {
            "id": "hrsg30x",
            "score": 0,
            "text": "Yeah, but people don't care about their kids enough to push for that.",
            "title_similarity": "0.41972512",
            "sentiment_compound": -0.4295
        },
        {
            "id": "hrr0p49",
            "score": 32,
            "text": "[removed]",
            "title_similarity": "-0.01522617"
        },
        {
            "id": "hrrta85",
            "score": 6,
            "text": "Wow nee research from decades ago. Teenagers literally have a different circadian rhythm while they go through puberty, the stay up late and sleep late, it's not their fault it's biology.",
            "title_similarity": "0.6835366",
            "sentiment_compound": 0.7234
        },
        {
            "id": "hrrxa5z",
            "score": -13,
            "text": "Maybe the kids could go to bed earlier and get the se amount of sleep.  Genius thought there",
            "title_similarity": "0.6319008",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrt0mkx",
            "score": -3,
            "text": "I don't know why we keep \"studying' this.  There's a new one a couple of times every year going back to when I was in school, and I'm 55.  It seems like it's a low effort way to publish a paper, like a last minute book report on \"Call of the Wild\"\n\nWe're not going to change school start times, too much of society hinges on agreement between parents work day and kids school day.\n\nThere's a simple solution though... Have kids go to bed earlier.  More sleep is more sleep.  If we're not willing to make that simple change  , reworking our entire social schedule isn't a better option",
            "title_similarity": "0.7073075",
            "sentiment_compound": 0.7179
        },
        {
            "id": "hrrtkuu",
            "score": -14,
            "text": "Adolescence is supposed to prepare you for adult life, and most adults (at least here in America) deal with things like erratic work schedules and chronic sleep deprivation. If your first experience of such is in a job setting, you're probably not going to perform very well, and may even get fired (for instance, by oversleeping and being late). Maybe it's better that kids learn to cope while they're still teens, the stakes are lower and the world is more forgiving?",
            "title_similarity": "0.8157028",
            "sentiment_compound": 0.3369
        },
        {
            "id": "hrrtsqh",
            "score": 14,
            "text": "Everyone is so negative here with the \"doesn't matter nothing will change\" and I'm going to call BS on that. A handful of local schools did it this year where I am and it's not as simple as \"change the start times\". Schools are a very time demanding aspect of family life. When you make them start later and end later you change family time for any member of the family that's in school and the adults are still going to go to work. So because the school schedule changed here there are a couple hundred kids every day that show up to school two hours before classes start and get home way later. It's a serious decision and it naive to think that this is an easy one stop fix all solution to mental health for students. I would say that the results are mixed where I am of how successful it is.",
            "title_similarity": "0.6397644",
            "sentiment_compound": -0.3805
        },
        {
            "id": "hrrcra2",
            "score": -4,
            "text": "The issue here is pragmatic. People need to work so at least until 12 15 yo children has to go to school at same time.\nMany national laws prohibit to leave minors unattended so even buses aren't an option.\nI know that many of us walked alone to school before that age but this cannot be anymore.",
            "title_similarity": "0.6613056",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hrrkuxx",
            "score": -5,
            "text": "Here in the US, we have politicians and academics saying parents shouldn't have a say in education and a major teacher union closing down a major school district for nothing. It's not about education or the kids. Hasn't been for years now. Hence why our public education performance in the US has rapidly declined over the last 30 years and studies like this have been released for decades with no changes.",
            "title_similarity": "0.5968642",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hrsjbtp",
            "score": -5,
            "text": "Sorry, most jobs start at 8, so they need to learn that getting up at 6 is normal.",
            "title_similarity": "0.56169164",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hrr3oxg",
            "score": -29,
            "text": "How about instead of complaining about the lack of sleep...just make the kids go to bed earlier.",
            "title_similarity": "0.65620404",
            "sentiment_compound": -0.4767
        },
        {
            "id": "hrrsunr",
            "score": 1,
            "text": "This has been talked about for decades and the reasons the current system continues are 1) the bus schedule- someone has to be early and it makes even less sense for it to be the younger kids, 2) teenagers often have other things after school like sports, jobs, extra currics, 3) parents have to work, and that’s tied into #1",
            "title_similarity": "0.68856806",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hrs993k",
            "score": 1,
            "text": "Imagine if teenagers were free to interact outside of the ~~prison~~ school system!",
            "title_similarity": "0.39818507",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrrxqv1",
            "score": 7,
            "text": "It's not about work. It's about sports. Until we can separate athletics from education, the athletics departments will demand early starts so that they can have students for hours after school.",
            "title_similarity": "0.5504557",
            "sentiment_compound": -0.128
        },
        {
            "id": "hrr1x9d",
            "score": 49,
            "text": "[removed]",
            "title_similarity": "-0.015226185"
        },
        {
            "id": "hrs11o2",
            "score": -6,
            "text": "Research done by single people with no kids.  Part of start times factors in parents ability to drop kids off before work. \n\nAlso doesn’t talk about the social repercussions of homeschooling, and the impact to that part of a kids development.",
            "title_similarity": "0.60549414",
            "sentiment_compound": -0.25
        },
        {
            "id": "hrrw2lf",
            "score": -5,
            "text": "I have an idea, stop using social media until midnight every night. You know it’s still possible to get 7+ hours of sleep even if you have to wake up at 7, right?",
            "title_similarity": "0.53379154",
            "sentiment_compound": -0.296
        },
        {
            "id": "hrrz07n",
            "score": 6,
            "text": "This abstract posits that more sleep is beneficial for students, which I do not doubt, but what do this and other studies say about waking up later versus going to sleep sooner? Is it only the amount of sleep that matters or does the time at which the sleep occurs make a difference somehow? Since this study shows a clear benefit during the period examined, is there an explanation for why students didn't just go to sleep later, thus getting the same amount of sleep? Surely someone has thought to interrogate these things scientifically before.",
            "title_similarity": "0.7944424",
            "sentiment_compound": 0.939
        },
        {
            "id": "hrr4f4d",
            "score": 4,
            "text": "[removed]",
            "title_similarity": "-0.015226185"
        },
        {
            "id": "hrs1nl9",
            "score": -3,
            "text": "It’s because parents don’t make their kids go to bed early anymore",
            "title_similarity": "0.6318132",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrrtqsm",
            "score": 8,
            "text": "I'm running a theory a big purpose of schooling is just to prepare kids for working life.",
            "title_similarity": "0.48101896",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrrokc9",
            "score": 177,
            "text": "Pushing start times later doesn’t exactly solve the problem if we are talking about cumulative hours of sleep, we need to address the insane homework demands as well then because any teen who plays a sport or has after school activities has just shifted the timeline later.",
            "title_similarity": "0.7244203",
            "sentiment_compound": -0.128
        },
        {
            "id": "hrtc684",
            "score": 9,
            "text": "Everything should start later in the day. We as a society are obsessed with “up and early” because of out dated needs like getting all the agricultural work done before it gets dark.",
            "title_similarity": "0.46339607",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hrs1nfb",
            "score": 32,
            "text": "School mainly is used for conditioning obedience. The economy wouldn’t thrive if we all started caring about our mental and physical health.",
            "title_similarity": "0.6382375",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hrro14x",
            "score": -4,
            "text": "But kids are taught by adults…What time of day do adults function better? On an airplane they say put oxygen on your face before assisting others….This could be the same case.",
            "title_similarity": "0.5406715",
            "sentiment_compound": 0.5927
        },
        {
            "id": "hrrrkxt",
            "score": 0,
            "text": "When this was brought up in the district I used to work in (no longer in k12 fortunately), they decided not to proceed because of after school activities (sports, band, etc).",
            "title_similarity": "0.6104286",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrrutyk",
            "score": 0,
            "text": "We just used to call that ditching, no wonder we felt better haha",
            "title_similarity": "0.51281714",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hrrwzve",
            "score": 0,
            "text": "I've been saying this the whole way through the education system but my life would've been way easier if school started at like 10 and ended at 5ish. that or school worked on a 35 hour day cycle or something like that",
            "title_similarity": "0.6681706",
            "sentiment_compound": 0.8807
        },
        {
            "id": "hrsbgbu",
            "score": 0,
            "text": "This won't work if their adults have to leave at 6 for work. \n\nWork From Home has all sorts of positive downstream effects for our society.",
            "title_similarity": "0.73254824",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hrt4yrh",
            "score": 0,
            "text": "Cant kids just go to bed earlier?",
            "title_similarity": "0.47652358",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrt9jn5",
            "score": 0,
            "text": "Or kids need to go to bed earlier...",
            "title_similarity": "0.47381154",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrtjbt0",
            "score": 0,
            "text": "The entire world is obsessed with this crap about they day starting at the crack of dawn or some arbitrary early hour. It's probably super unhealthy for a lot of people - not just teens (but definitely especially bad for developing teens). I absolutely hate this myself as an adult. Every pointless corporate meeting has to start at 8:00am to have the appearance of productivity and then anything involving overseas colleagues in different time zones winds up having to slot in at like 7:00am or earlier and hey - what's the big deal it's just one hour earlier than \"usual\" you should be able to do that on the regular...\n\nI seriously believe years of this has appreciably reduced my overall life span to to direct, secondary, and tertiary effects.\n\nI guess I'm saying, truly, we live in a society. But also f early morning \"norms.\" It's the bane of my existence.",
            "title_similarity": "0.6126294",
            "sentiment_compound": -0.6097
        },
        {
            "id": "hrtq3cv",
            "score": 0,
            "text": ">School closures had a negative effect on the health and well-being of many young people\n\nDid we really need research on this? Surely everyone who's ever been to school knows this because we've experienced it first hand and everyone we've ever known have the same experience.",
            "title_similarity": "0.71926117",
            "sentiment_compound": 0.4357
        },
        {
            "id": "hrrni3a",
            "score": 25,
            "text": "The timing is for the convenience of the parents and teachers.  The students are a distant third in this race.",
            "title_similarity": "0.6368502",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrrzo7a",
            "score": 54,
            "text": "Correction - everything should begin later in the morning",
            "title_similarity": "0.37420592",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrrw5g6",
            "score": 29,
            "text": "I agree with starting later being better, but it doesn’t necessarily take into account extracurriculars. Students who play sports/do clubs are getting home at 6 many days, later if playing a sport that has a game in a different town. If we push the start of school back, students may be getting home extremely late.",
            "title_similarity": "0.71709955",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hrss4ie",
            "score": 6,
            "text": "Our state (CA) is supposed to start later times for HS/MS starting Fall 2022, although now there is talk of a waiver or extension. Most teachers I hear are against it. It dissapoints me that most attitudes are “I had to wake up early, so can they” or “the lazy kids will still come in late”. Like, can we at least try to progress and change in hopes of a positive outcome?",
            "title_similarity": "0.72614676",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hrsj07r",
            "score": 21,
            "text": "I've been reading this for 20 years yet not a school in the world considers it.",
            "title_similarity": "0.34399724",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrrpd2d",
            "score": -1,
            "text": "[removed]",
            "title_similarity": "-0.01522617"
        },
        {
            "id": "hrrs5xa",
            "score": 1,
            "text": "Waking up and having to be to school by 7:20 sucked. I look back on it now and I don’t know how I worked and went to school and got decent grades. I worked 30-35 hours a week. Was in several extra curricular activities. And still managed to have a social life. I don’t even wanna work 40 hours now. Damn.",
            "title_similarity": "0.66611",
            "sentiment_compound": -0.6908
        },
        {
            "id": "hrrtapy",
            "score": -1,
            "text": "If my college schedule was anything to go by, I will go to bed too late and only wake up just in time and still not sleep enough whether the first class was 7:30 or 10:30. I say that to frame my question: Does this study include any control on that kind of schedule drift? \n\nIt seems like a human nature thing to go to bed too late for when you have to wake up, and not an immutable truth that 7 is always too early and that 10 will never be.",
            "title_similarity": "0.654998",
            "sentiment_compound": 0.1376
        },
        {
            "id": "hrrx2w7",
            "score": -1,
            "text": "I get the sleep thing,  for sure. I wonder how much consideration they gave to the fact that these better rested, healthier kids were also pretty much quarantined during that time,  too.",
            "title_similarity": "0.77297324",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hrs1akz",
            "score": -1,
            "text": "I'm 21 I wake up at 6am everyday for work and I'm convinced humans weren't meant to wake up before sunrise. I will get 8 hours of sleep and be exhausted all day. Today I had to wake up at 8:30 I'm running on like 5 hours of sleep and I feel 100x more rested. It's crazy how what time you wake up effects your energy. In high school I would wake up at like 6am everyday too and I was perpetually up until senior year.",
            "title_similarity": "0.6585052",
            "sentiment_compound": 0.5627
        },
        {
            "id": "hrscy20",
            "score": -1,
            "text": "Ok, isn’t this just because kids stay up later than they should because their days are long? Wouldnt a later start just push everything back? Isn’t the real solution to decrease work loads?",
            "title_similarity": "0.75538635",
            "sentiment_compound": 0.4291
        },
        {
            "id": "hrtatys",
            "score": -1,
            "text": "This is so misleading. If more kids went to bed at a decent hour then the problem would be solved as well.",
            "title_similarity": "0.78482354",
            "sentiment_compound": -0.4572
        },
        {
            "id": "hrtu14n",
            "score": 1,
            "text": "Um, they could go to bed earlier…",
            "title_similarity": "0.38597775",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrtwk56",
            "score": 1,
            "text": "Or kids go to bed earlier?",
            "title_similarity": "0.47802773",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrrtjke",
            "score": -2,
            "text": "Schools won't do this because then they won't have time for sports practices after school.",
            "title_similarity": "0.49600136",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs1lbj",
            "score": -2,
            "text": "Just 2 weeks to flatten the curve….",
            "title_similarity": "0.28719532",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrrpthz",
            "score": 41,
            "text": "Switched our daughter to online high school, much better schedule and more control over her life. Gets socialization from gymnastics and acting classes.",
            "title_similarity": "0.59115934",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hrsv2ir",
            "score": 10,
            "text": "Yeah, but the real issue is that parents want their government babysitter. That's the real issue some parents are so vocal. They want their day care nice and early",
            "title_similarity": "0.6133344",
            "sentiment_compound": 0.8978
        },
        {
            "id": "hrrzokg",
            "score": -3,
            "text": "Or school kids should go to bead earlier?",
            "title_similarity": "0.46694332",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs92zj",
            "score": -2,
            "text": "Go to bed earlier how bout dat",
            "title_similarity": "0.36042434",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrtkbx7",
            "score": 3,
            "text": "School begins when it does because it’s convenient for capitalism to make sure the kids are stowed away in school in time for the parents to get to work. That’s also why we’re never going to see this very obvious and common sense change happen at a large scale, at least in America.",
            "title_similarity": "0.6277362",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hrrcish",
            "score": 29,
            "text": "[removed]",
            "title_similarity": "-0.015226185"
        },
        {
            "id": "hrrzm81",
            "score": -4,
            "text": "Well, just to bed earlier.",
            "title_similarity": "0.34972644",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hrtiso8",
            "score": 4,
            "text": "This thread really shows the problem with modern education in most places.. School and childhood as a whole is suppose to be for learning, and growing as a person. But so many just treat it as a training program to be a work drone.",
            "title_similarity": "0.62828475",
            "sentiment_compound": 0.5129
        },
        {
            "id": "hrs3yii",
            "score": 35,
            "text": "It doesn’t take a scientist to know a 14 year old waiting for the bus at 6am isn’t healthy and shouldn’t be encouraged. \nWhat it DOES accomplish is getting that child used to going in early staying all day and not asking questions about why.",
            "title_similarity": "0.6913256",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hrrzm40",
            "score": 5,
            "text": "That’s good to know, but we’ll do what we always do, which is continue the status quo which we know to be harmful.",
            "title_similarity": "0.3430004",
            "sentiment_compound": 0.2382
        },
        {
            "id": "hrs52k7",
            "score": 6,
            "text": "Teacher here. \nMiddle Schools and High Schools should move to either less hours per day or less days per week.\nWould never happen though, because schools are viewed as babysitting services.",
            "title_similarity": "0.6176544",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrr38yd",
            "score": -8,
            "text": "[removed]",
            "title_similarity": "-0.01522617"
        },
        {
            "id": "hrrc5px",
            "score": 44,
            "text": "[removed]",
            "title_similarity": "-0.01522617"
        },
        {
            "id": "hrrxfhm",
            "score": 118,
            "text": "School starts around the same time work does for most people. Big coincidence.",
            "title_similarity": "0.46959764",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrrwzpi",
            "score": 10,
            "text": "we have been saying this for so long, we're no longer teenagers",
            "title_similarity": "0.3211691",
            "sentiment_compound": -0.3535
        },
        {
            "id": "hrrmt1q",
            "score": 125,
            "text": "Also small class sizes, skill based modules rather than age based, also co-teaching, also alternating curricular schedules, also student autonomy — there’s probably 100 years of incredible work in educational research, but unfortunately most parents treat school like daycare k-12 and politicians / school boards are hell bent on stifling actual teaching and learning.",
            "title_similarity": "0.71185803",
            "sentiment_compound": -0.5077
        },
        {
            "id": "hrrgzyr",
            "score": 1003,
            "text": "I feel like the problem here isn't optimal child health, it's logistics.\n\nLogistically, school *has* to start before the parents have to be at work, otherwise there'd be no one to make ready and drop off the kids at school.\n\nAm I wrong?",
            "title_similarity": "0.62947494",
            "sentiment_compound": -0.7359
        },
        {
            "id": "hrqy62d",
            "score": 1184,
            "text": "[removed]",
            "title_similarity": "-0.015226185"
        },
        {
            "id": "hrrtyzc",
            "score": 98,
            "text": "[removed]",
            "title_similarity": "-0.01522617"
        },
        {
            "id": "hrrzz2p",
            "score": 307,
            "text": "This is due to an altered circadian rhythm in adolescents. It’s a physiological cause and has been found in other mammalian species. \n\nIf you’re blaming the teens for going to bed late, you’ve forgotten that this is a science forum. \n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC2820578/",
            "title_similarity": "0.751564",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hrsd7xc",
            "score": 82,
            "text": "Note, it's teenagers. Younger students would benefit from early start times according to the research.\n\nHowever, it should be noted that a later start would inconvienience athletics and extra curriculars. And they would move to the mornings and negate any benefit. \n\nUntil we solve that, the system is entrenched.",
            "title_similarity": "0.7620838",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hrrt5le",
            "score": 212,
            "text": "[removed]",
            "title_similarity": "-0.015226185"
        },
        {
            "id": "hrrxtpe",
            "score": 399,
            "text": "I taught virtually during the pandemic. My 7th graders would log in, turn their cameras off, and go to sleep. So my first 2 classes had zero interaction with me whatsoever.",
            "title_similarity": "0.51446724",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrrt0dq",
            "score": 1326,
            "text": "As a self-employed parent of a new student who starts school at 7am (we walk to the bus for 6:50am) I've realized that schools start early to accommodate a working 9-5 society. They are in a lot of ways complicated daycare centers so the adults can keep the machine running. This has never been more clear than during covid times.",
            "title_similarity": "0.715058",
            "sentiment_compound": -0.3401
        },
        {
            "id": "hrrtuwm",
            "score": 353,
            "text": "[removed]",
            "title_similarity": "-0.015226185"
        },
        {
            "id": "hrqvyug",
            "score": 2861,
            "text": "[removed]",
            "title_similarity": "-0.015226185"
        },
        {
            "id": "hrrw8t9",
            "score": 557,
            "text": "[removed]",
            "title_similarity": "-0.01522617"
        },
        {
            "id": "hrr1sye",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "-0.01522617"
        },
        {
            "id": "hrrkzmy",
            "score": 10,
            "text": "[removed]",
            "title_similarity": "-0.01522617"
        },
        {
            "id": "hrrtbuz",
            "score": 1,
            "text": "Yes been saying this for years. 630 every day for years. It’s insane.",
            "title_similarity": "0.29219237",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrrtm0f",
            "score": 1,
            "text": "The biggest reasons for the early start are kids sports and other extra-curriculars (if the school started later, the kids wouldn’t get home after practice or whatever until 7 or 8 at night. Also, at least it used to be this way, early schools meant kids could get jobs after school if they wanted.",
            "title_similarity": "0.6771215",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrrwg8c",
            "score": 2,
            "text": "I had 5 kids being home schooled by me. \nMy eldest was 12 and his report just as closures began said he wasn't doing so great. Not bad but mostly C grades. \n\nI'm not the sharpest tool in the box we worked through things together and if we didn't know the answer we went to Google or YouTube for how to get a better understanding. \n\nHis first report after going back to school was A-C grades. \n\nThen he moved in with his dad's (I'm 200miles away now) and he's slipped a little to B grades but he's learnt how to get answers he doesn't know because I was able to give him the tools to correctly research.\n\nStill- don't know if I could not work and home school again. It's a LOT of work especially with more than one kid at different ages.",
            "title_similarity": "0.7175697",
            "sentiment_compound": 0.8413
        },
        {
            "id": "hrrxqtg",
            "score": 1,
            "text": "That’ll never happen as school is mostly  a public babysitting program so parents can go to work",
            "title_similarity": "0.5140213",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrryd4b",
            "score": 1,
            "text": "As corporations have adjusted to the pandemic with remote work, flexible days in the office/home, and work/life balance programs so should schools. There were some good things that came from home schooling and one of them was increased sleep. We saw it first hand with our children. However, most public institutions refuse to adapt and make change.",
            "title_similarity": "0.8231984",
            "sentiment_compound": 0.7675
        },
        {
            "id": "hrrzdj4",
            "score": 1,
            "text": "They are changing start times in California next year to accommodate for this. My local high school starts at 7:50 this year and next year it will be moved to 8:30. This is statewide so a lot of high schools are shifting schedules.",
            "title_similarity": "0.51725954",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrrzlmy",
            "score": 1,
            "text": "This is not new information.  We have known this for decades!  The problem is that if the school day started later, there would be less daylight for outside sports.  Sports drive everything.",
            "title_similarity": "0.63722944",
            "sentiment_compound": -0.4574
        },
        {
            "id": "hrrzw9b",
            "score": 1,
            "text": "So what should be the right time now I am curious?",
            "title_similarity": "0.0920093",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hrrzwep",
            "score": 1,
            "text": "I just skipped first period. Sure I got into trouble but my grades were fine... So not much they could say or do",
            "title_similarity": "0.67320627",
            "sentiment_compound": 0.25
        },
        {
            "id": "hrs07hn",
            "score": 1,
            "text": "Cool, so we can start the work day later too?",
            "title_similarity": "0.39883015",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hrs0ee8",
            "score": 1,
            "text": "Kids need their sleep, especially teens. I hope the options of remote learning are open to them for a long time.",
            "title_similarity": "0.6660737",
            "sentiment_compound": 0.4877
        },
        {
            "id": "hrs0f1y",
            "score": 1,
            "text": "These were the same studies 10+ years ago when I was in HS. Nothing changed, except the pandemic and school from home.",
            "title_similarity": "0.55260235",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs0m3f",
            "score": 1,
            "text": "So by home schooling, we mean virtual classes at home, that cuts down on a couple of hours of getting ready and travel time, right?  Because if we are talking about parent led home schooling, I might have a problem with that.",
            "title_similarity": "0.68930316",
            "sentiment_compound": -0.34
        },
        {
            "id": "hrs0uze",
            "score": 1,
            "text": "I never really thought about it until someone said after being asked what would you do if money want needed and they said wake up with the sun.\n\nI now think that's just how our bodies are supposed to work.",
            "title_similarity": "0.46677068",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hrs11oj",
            "score": 1,
            "text": "I’m 37.\n\nI hate getting up early,  but on my way to work I see these poor kids out in the cold and snow just waiting on the yellow bus to take them to their medical ore education.\n\nIt’s sad.   They do middle schoolers the worst.  Why is a bud picking kids up at 6:30, pitch ass black darkness.",
            "title_similarity": "0.63465726",
            "sentiment_compound": -0.9765
        },
        {
            "id": "hrs1a1g",
            "score": 1,
            "text": "I would have probably done so much better in school if I could have studied at home.",
            "title_similarity": "0.66428643",
            "sentiment_compound": 0.4902
        },
        {
            "id": "hrs1svn",
            "score": 1,
            "text": "I’ve been hearing this for years, because teens and young people have brains work better later in the day.",
            "title_similarity": "0.63159084",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hrs28m7",
            "score": 1,
            "text": "California recently passed a law requiring high schools to start later because of studies like this. We ignore the data all the time when it comes you our school system because we don’t actually value the education, we need a place to keep our kids while their parents run the rat race. We know that k tree r start times improve outputs, we know standardized tests hurt rather than help, we know classroom size is a huge issue, we know homework serves no function other than increasing stress on kids and teachers. There is ample data for all of those points but nothing happens to adjust to the information.",
            "title_similarity": "0.6879461",
            "sentiment_compound": 0.1154
        },
        {
            "id": "hrs2bp8",
            "score": 1,
            "text": "This has been known by scientists and whatever other professionals for many, many years. The problem is implementing later start times, given the typical work schedule of parents and having to accommodate after-school sports and activities.\n\nStill, I'd love for it to be worked out somehow, because it's important for teens to be getting the rest they need.",
            "title_similarity": "0.67965513",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hrs2c7f",
            "score": 1,
            "text": "Less hours of school and no homework should be heavily promoted",
            "title_similarity": "0.5312257",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hrs2fsz",
            "score": 1,
            "text": "Why is the solution specific to sleeping in but not going to bed earlier?",
            "title_similarity": "0.5089148",
            "sentiment_compound": 0.1655
        },
        {
            "id": "hrs2iwv",
            "score": 1,
            "text": "Living in a world that has a 24 hour work cycle, I’ve always wondered why schools only follow one general time. Adults have night schools but wouldn’t it be beneficial if schools became a 24 hour thing too?\n\nOf course there’s a lot more to that like paying the teachers properly etc… but it’s weird most of the world operates midnight to midnight but certain industries are Monday-Friday 9-5 and that’s that",
            "title_similarity": "0.63927656",
            "sentiment_compound": 0.844
        },
        {
            "id": "hrs2mvh",
            "score": 1,
            "text": "Having just gone through this with my kids at home I have to say my experience is my kids got an inferior education but we’re well rested.  Maybe need to find a happy medium.",
            "title_similarity": "0.7596697",
            "sentiment_compound": 0.7814
        },
        {
            "id": "hrs2q91",
            "score": 1,
            "text": "Or they could go to bed earlier, I remember when I was in school I hated the fact that my parents made me go to bed earlier than any of my friends, no matter how much better it was for me.",
            "title_similarity": "0.72153616",
            "sentiment_compound": 0.1842
        },
        {
            "id": "hrs2taz",
            "score": 1,
            "text": "its almost as if sleep is good for us",
            "title_similarity": "0.46284798",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hrs2ua7",
            "score": 1,
            "text": "It’s almost like giving people time to meet their physiological needs is good for them or something. CAN’T BE DOING THAT! BACK TO THE MILL AT 0400 SLAVES!",
            "title_similarity": "0.6072061",
            "sentiment_compound": 0.7791
        },
        {
            "id": "hrs31vq",
            "score": 1,
            "text": "I think schools in the USA start earlier than here in Canada",
            "title_similarity": "0.49875358",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs33bh",
            "score": 1,
            "text": "Yet another study that won’t change the time that school starts",
            "title_similarity": "0.48929518",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs35bw",
            "score": 1,
            "text": "I think it's possible that this effect is more about the total number of hours that teens are working, rather than reflecting their circadian rhythm.\n\nTypically a teenager will get up early in the morning to eat breakfast and complete their commute. Then they'll put forth a whole school day of cognitive work, interspersed with \"breaks\" where they're working equally hard on their social and emotional development. Then they commute again and typically return home to work a few more hours as childcare until their parents are available. By this point they've put forth ten or more hours of mandatory, focussed activity; they're tired and naturally they procrastinate before starting their homework late in the evening, and work right up until bedtime, leaving them no time to relax or wind down in the hours before bed.\n\nWhen schools were closed, teens were able to skip their commutes, avoid childcare responsibilities, didn't work on their social development, and probably skipped some hours of schoolwork as well. They were simply working far fewer hours per day and were able to spend their evenings winding down. Surely it's not surprising that they slept better in consequence.\n\nTl;dr I think abolishing homework would work equally well to help teens get more sleep.",
            "title_similarity": "0.7046164",
            "sentiment_compound": 0.8335
        },
        {
            "id": "hrs3g7r",
            "score": 1,
            "text": "So at what time should the parents make it to work? 11?",
            "title_similarity": "0.38077646",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs3gfw",
            "score": 1,
            "text": "I think we’ve known this for decades, it’s just impossible to implement. What are we going to do, change the start time of like 60% of jobs simultaneously? This is one of those things where to make this change, you would have to change EVERYTHING and get EVERYONE, including big greedy corporations and people resistant to change, to buy in.",
            "title_similarity": "0.46575725",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hrs3iji",
            "score": 1,
            "text": "But how will we fit sports in?   Before school or at night?",
            "title_similarity": "0.33169705",
            "sentiment_compound": 0.5588
        },
        {
            "id": "hrs3qkw",
            "score": 1,
            "text": "School being early nearly made me drop out. I have pretty bad insomnia. And on top of that, my schoolbus used to pick me up at 630am. So I wasn't falling asleep untill like 2am most nights. This caused me to be way too tired to actually participate in anything. I'm so happy all of that is over and I get to sleep in most days now:)",
            "title_similarity": "0.79186326",
            "sentiment_compound": 0.665
        },
        {
            "id": "hrs3upo",
            "score": 1,
            "text": "The issue is, School is essentially a daycare for working families.",
            "title_similarity": "0.50618804",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs3v4g",
            "score": 1,
            "text": "There’s a large body of research on this. Elementary age kids do better in the morning, middle schoolers generally a bit later, and teens are at their best in the afternoon/later in the day. \n\nTo me it makes sense to adjust school schedules - I used to take my younger siblings to school as a teen and it would have been easier if their school started earlier. It would probably add to the number of kids in aftercare for school, at least until we make adjustments to work schedules too. Which is a bummer",
            "title_similarity": "0.80727935",
            "sentiment_compound": 0.8225
        },
        {
            "id": "hrs4a1e",
            "score": 1,
            "text": "Circadian rhythm is set for adults but not teens. It’s biology.",
            "title_similarity": "0.38574588",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs4cpk",
            "score": 1,
            "text": "If kids are allowed to get up later then they'll stay up later. Change my mind on that.",
            "title_similarity": "0.54838073",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs4fh7",
            "score": 1,
            "text": "I love these “studies” that remind us of things we’ve known for 2000 yrs",
            "title_similarity": "0.40971178",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hrs4lx8",
            "score": 1,
            "text": "I’m aware that it’s an unpopular opinion, but this is one of the reasons I love online teaching, along with others such as time saved not having to commute which can then be used for extra revision etc. I know some people like the interaction you get with face-to-face and I understand that, but I think the option of online should remain for those who want it.",
            "title_similarity": "0.6199261",
            "sentiment_compound": 0.9349
        },
        {
            "id": "hrs4pdv",
            "score": 1,
            "text": "He discovered this like 50 years ago and nothing is ever done",
            "title_similarity": "0.20323431",
            "sentiment_compound": 0.4357
        },
        {
            "id": "hrs4rk5",
            "score": 1,
            "text": "Teenagers need to go to bed earlier",
            "title_similarity": "0.53530955",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs4zwn",
            "score": 1,
            "text": "i know studies like this with seemingly obvious results are essential for the pyrposes of proving a commonly known fact in an academic setting so itll be more widely accepted as legitinate evidence\n\nbut\n\nlike\n\n_no shit_",
            "title_similarity": "0.48700064",
            "sentiment_compound": -0.0544
        },
        {
            "id": "hrs5183",
            "score": 1,
            "text": "It’s because parents need to be at work early so kids get to go to school early.",
            "title_similarity": "0.59588623",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs54en",
            "score": 1,
            "text": "If school days are later in the morning, then the whole job market would have to adapt to this change. Corporations won’t let that happen.",
            "title_similarity": "0.6348539",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs57v1",
            "score": 1,
            "text": "Every teenager has know this since teenagers were invented.",
            "title_similarity": "0.20145084",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs5aqa",
            "score": 1,
            "text": "This is a total shock to me (!)",
            "title_similarity": "0.1108077",
            "sentiment_compound": -0.4914
        },
        {
            "id": "hrs5gox",
            "score": 1,
            "text": "This is 100 percent accurate. Why in gods name do we force them to get up super early? They should be going to school after grade school kids and middle school kids.",
            "title_similarity": "0.5529366",
            "sentiment_compound": 0.5994
        },
        {
            "id": "hrs5k60",
            "score": 1,
            "text": "Now do one that work days should only be 6hrs a day or 8 hrs 4 days a week.",
            "title_similarity": "0.4013734",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs5lbo",
            "score": 1,
            "text": "Kids get up early for school because because they have to be out the door before parents have to start work.\n\nTeach your kids the importance of going to bed on time. If they don't have to get up until 8 you can bet they'll stay up until 4.",
            "title_similarity": "0.70127726",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hrs5mo3",
            "score": 1,
            "text": "This has been known for years. There’s been a significant amount of studies that show how much lack of sleep affects teenagers. Some researchers even claim that “teen angst” is entirely a lack of sleep issue. But schools AND parents, don’t care.\n\nI helped my sister make a case with her kids’ private school to change the start time. I complied all the research, wrote summaries, etc. Not only did the parents very strongly oppose it, the teachers acted like my sister was crazy. This was in Mexico, where school can start as early as 7am.",
            "title_similarity": "0.72424036",
            "sentiment_compound": 0.758
        },
        {
            "id": "hrs5of1",
            "score": 1,
            "text": "If you want school days to start later, then have work days start later. Lets say school starts at 10, work at 1030, revamp the 8 hour work day to 4 hour. Most people become unproductive after 4 hours during their shift and then get very little sleep because they have to spend 8 hours a day at work and that productivity continues to decline while stress rises. Humans are not meant to work 40 hours a week. Hell we shouldn't even be working jobs just to work them which seems like 80% of the jobs out there nowadays, useless jobs that make the people working them feel worthless.",
            "title_similarity": "0.72151065",
            "sentiment_compound": -0.8834
        },
        {
            "id": "hrs64ma",
            "score": 1,
            "text": "Go to bed earlier. Problem solved",
            "title_similarity": "0.4661806",
            "sentiment_compound": -0.1531
        },
        {
            "id": "hrs692b",
            "score": 1,
            "text": "Wouldnt the healthiest time theoretically be approx an hour after sunrise?",
            "title_similarity": "0.40144876",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs6bjp",
            "score": 1,
            "text": "They should have 2 schools on for early risers and one for me",
            "title_similarity": "0.41001755",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs6dxt",
            "score": 1,
            "text": "Very true, but teenagers stay up late; even though they still need a good night sleep for the continued brain development. No doubt they’d be more attentive at school if it started mid morning",
            "title_similarity": "0.7723607",
            "sentiment_compound": 0.8206
        },
        {
            "id": "hrs6jn4",
            "score": 1,
            "text": "I remember having to eat lunch at 10:20 in high school…yeah it was too early",
            "title_similarity": "0.542964",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs6w7g",
            "score": 1,
            "text": "It's never been about results for kids. It's always only been about childcare.",
            "title_similarity": "0.31669095",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs6zis",
            "score": 1,
            "text": "Haven’t we known this for decades. Who cares, just do something about it",
            "title_similarity": "0.24955557",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hrs751p",
            "score": 1,
            "text": "Kids could just, you know, go to bed earlier?",
            "title_similarity": "0.5052035",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs79k7",
            "score": 1,
            "text": "Scientists and teachers have been saying this for a while now in the states but unknow the politicians hear rarely listen to Science",
            "title_similarity": "0.55811197",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs7cnx",
            "score": 1,
            "text": "“We can do that… for money!!” \n- Schools Districts probably",
            "title_similarity": "0.34320283",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs7f79",
            "score": 1,
            "text": "Wouldn’t this also save money for parents? If the school days starts later than it ends later also. Ending closer to when a parent gets out of work. Less money for daycares/baby sitters. Better mental health for students. Why haven’t start times been adjusted?",
            "title_similarity": "0.79458195",
            "sentiment_compound": 0.755
        },
        {
            "id": "hrs7g7r",
            "score": 1,
            "text": "My kids school starts at 10:30am, and my job allows me to go to work at 11am and come home at 7pm. It is honestly so, so much more refreshing this way. Mornings aren't terrible anymore.",
            "title_similarity": "0.6674784",
            "sentiment_compound": 0.6761
        },
        {
            "id": "hrs7nsx",
            "score": 1,
            "text": "This only works if the parents day starts later as well, as a lot of working adults have a fairly tight schedule to get kids to school and back.",
            "title_similarity": "0.69477457",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hrs7rvp",
            "score": 1,
            "text": "I am waiting for the 8 hour school day with no home work. Kids attend schools while parents work.  No one works in the evening.",
            "title_similarity": "0.4995278",
            "sentiment_compound": -0.5267
        },
        {
            "id": "hrs7scn",
            "score": 1,
            "text": "I mean, that’s great but how are the parents supposed to accommodate that scheduling change if they work outside the house and their work begins at 8?  The existing schedule is a compromise.",
            "title_similarity": "0.5780752",
            "sentiment_compound": 0.3716
        },
        {
            "id": "hrs7yzu",
            "score": 1,
            "text": "Starts too early but what about how much time they are spending on it. 7-8 hours of school and then easily 1-2 hours of homework, sometimes maybe pushing 3. Classroom time should be more practice based.",
            "title_similarity": "0.64365196",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hrs83iq",
            "score": 1,
            "text": "Let kids out at 5 pm during peak traffic hours.",
            "title_similarity": "0.40499276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs8acu",
            "score": 1,
            "text": "If all the helicopter parents could stop taking 15-17 year olds in cars to avoid making a line and let them ride the bus for those whom it’s available to I would be so happy.",
            "title_similarity": "0.583624",
            "sentiment_compound": 0.3272
        },
        {
            "id": "hrs8nwe",
            "score": 1,
            "text": "HIGH SCHOOL start times should be later.  Long standing research shows little kids can get up at the ass crack of dawn like adults and be fine.  Same long standing research has shown for DECADES that teenagers can NOT do that.",
            "title_similarity": "0.7295843",
            "sentiment_compound": -0.0516
        },
        {
            "id": "hrs8qrb",
            "score": 1,
            "text": "Similarly, from personal experience- ability to work from home means I spend less time getting ready to go to work and I don’t have to account for the commute. That shaves off at least a half hour to 45 minutes of the time between getting out of bed and sitting at my desk. Especially since I don’t have to dress or groom to “at the office” standards. And I can have breakfast at my desk. \n\nSo, it just flat out gives me that much more time to sleep or do other things in my day. \n\nStarting my day at the office later would not improve anything at all for me otherwise; I start on the early side because I want to get out of work earlier.",
            "title_similarity": "0.6869823",
            "sentiment_compound": 0.3464
        },
        {
            "id": "hrs8qx5",
            "score": 1,
            "text": "High school student during the beginning of the pandemic here. The pandemic is horrible and all but it did usher in a little bit of good. You have no idea how much waking up two hours later helped me. I went from not being able to stay awake during first and second block to only nodding off when I *legitimately* didn't get enough sleep. It also helped me focus on stuff and I was more able to do work on my own time (having adhd, this was really helpfup as i can focus in the evening much easier than the morning and afternoon)",
            "title_similarity": "0.85099125",
            "sentiment_compound": -0.189
        },
        {
            "id": "hrs8v0c",
            "score": 1,
            "text": "This has been known for so long that teenagers have different circadian Rhythms and that they do much better if they start school later in the day. It would never happen though because it would inconvenience adults too much.",
            "title_similarity": "0.7793063",
            "sentiment_compound": 0.1027
        },
        {
            "id": "hrs94rc",
            "score": 1,
            "text": "I languished with 7:15-7:45 start times my entire youth. The district changed to 9:30 the year after I graduated. I am still not a morning person.",
            "title_similarity": "0.48200125",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrs95vi",
            "score": 1,
            "text": "Yeah but how are supposed to get our kids ready for the soul crushing careers they’ll have after high school?",
            "title_similarity": "0.54065865",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hrs9ex3",
            "score": 1,
            "text": "I don’t miss starting school at 7:30 every morning. Having to get up at 4:30 to shower and walk a half mile to the bus stop to catch it at 5:30 because I lived rural and it took a minute to get to school. Yeah definitely would’ve benefited from a later start.",
            "title_similarity": "0.6369064",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hrs9jem",
            "score": 1,
            "text": "It's all about the machine aka system, and making obedient workers that won't question the reality. Young, healthy, rested and straight mind is dangerous for the people in power",
            "title_similarity": "0.5298321",
            "sentiment_compound": 0.128
        },
        {
            "id": "hrs9kbj",
            "score": 1,
            "text": "There’s a difference between eliminating commute time and postponing it though. There are a lot of factors that could correlate with the optimal time is for school - local sunrise and sunset, student meal times, or late evening routines. All of those are more plausible than the mere position of the clock hands. With on-demand entertainment there’s no longer the likelihood that students are staying up for late-night TV.",
            "title_similarity": "0.7013342",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hrs9nyb",
            "score": 1,
            "text": "How are you going to get them ready for capitalism, though",
            "title_similarity": "0.2730855",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hrs9rk1",
            "score": 1,
            "text": "Why is the solution to not enough sleep always \"school start later\" and not \"go to bed earlier\"?",
            "title_similarity": "0.6347145",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hrsap79",
            "score": 1,
            "text": "I remember being extremely tired the first hour or two of school all the time",
            "title_similarity": "0.51231956",
            "sentiment_compound": -0.4927
        },
        {
            "id": "hrsask7",
            "score": 1,
            "text": "We've known this for at least 30 years. We clearly don't care to change it.",
            "title_similarity": "0.2840483",
            "sentiment_compound": 0.0186
        },
        {
            "id": "hrsau34",
            "score": 1,
            "text": "But I had to get up at 5.30 to walk 4miles back and forth to the bus stop. These young kids should suffer too because elders hated young people as do I.",
            "title_similarity": "0.5922542",
            "sentiment_compound": -0.9109
        },
        {
            "id": "hrsav4z",
            "score": 1,
            "text": "I wrote a research paper senior year about this. Kids would definitely benefit if we adjusted school time schedules and reformed or abolished standardized testing",
            "title_similarity": "0.6869472",
            "sentiment_compound": 0.6908
        },
        {
            "id": "hrsawd3",
            "score": 1,
            "text": "Defending schools as a thing sounds more of a sales job of the education industry trying to preserve the status quo. \n\nEducation should come from elsewhere and socialization should be a separate thing from education.  \n\nChildren learn academically much better alone on a computer. The social skills learning can be done separately in institutionalized frames like all year round summer camps. \n\nEducators lump everything together resulting in poor academic learning and poor social learning in the public K-12 model designed to create drone workers for the Industrial Age and maintain an expensive industry that does little to advance or evolve education of children.",
            "title_similarity": "0.66530144",
            "sentiment_compound": -0.1779
        },
        {
            "id": "hrsaypg",
            "score": 2,
            "text": "We have high school going earliest- School starts at 7:15.\nWhen I was in high school I actually preferred going in earlier because then I could ~at least~ get to bed at 3am after the extra curriculars/work, making dinner/doing chores, and then homework.\nProper times for school start/length is kind of a crappy situation all around for both the students and the parents :/ I wish school length was shorter and less homework was given--- but then parents have trouble figuring out childcare. One argument for having the highschoolers start/finish early was so that highschoolers could provide afterschool care for their siblings.",
            "title_similarity": "0.76396227",
            "sentiment_compound": -0.5647
        },
        {
            "id": "hrsbbkl",
            "score": 1,
            "text": "But how else will they be ready to wake up early for work for the rest of their lives?!",
            "title_similarity": "0.49042338",
            "sentiment_compound": 0.5487
        },
        {
            "id": "hrsbbz2",
            "score": 1,
            "text": "Good luck getting doing it with the minimum number of busses and coordinating their routes so that school can start later.",
            "title_similarity": "0.58525187",
            "sentiment_compound": 0.7351
        },
        {
            "id": "hrsbns6",
            "score": 1,
            "text": "Most later start schedules just don’t work for the parents of younger kids. Most parents have to be at work around 8 and my schools always started around 7:30am. Pushing the start by a few hours would have screwed up like half my schools ability to actually get there as they were dropped off by parents.",
            "title_similarity": "0.6517768",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hrsbpuw",
            "score": 1,
            "text": "Teens happy with longer sleep after TicToking till 3am...",
            "title_similarity": "0.650007",
            "sentiment_compound": 0.5719
        },
        {
            "id": "hrsbqw0",
            "score": 1,
            "text": "[\"Association Between Homeschooling and Adolescent Sleep Duration and Health During COVID-19 Pandemic High School Closures\"](https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2787630), Albrecht et al 2022:\n\n> **Question**:  Were sleep gains among adolescents during COVID-19 pandemic high school closures associated with better health-related characteristics?\n>\n> **Findings**:  In this survey study of 8972 adolescents from Swiss high schools, during the COVID-19 lockdown, participants slept significantly longer and had better health-related quality of life and less caffeine and alcohol use than before the pandemic. Longer sleep duration was significantly associated with better health-related characteristics, although this was offset by an association of depressive symptoms with worse health-related characteristics and increased caffeine consumption.\n>\n> **Meaning**:  In this study, sleep gains were associated with better health-related characteristics among youths, but depressive symptoms were associated with a worsening of the same health-related characteristics.",
            "title_similarity": "0.7318044",
            "sentiment_compound": -0.3612
        },
        {
            "id": "hrsbt9j",
            "score": 1,
            "text": "School closures had negative effect on their health and wellbeing? I just be so stoked when school closed",
            "title_similarity": "0.7174915",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hrsc5e3",
            "score": 1,
            "text": "They’ll never do it. Schools start early so parents can go to their jobs.\n\nIt’s as simple and stupid as that. It’s not for the kids’ benefit at all.",
            "title_similarity": "0.52263796",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hrsc5xv",
            "score": 1,
            "text": "High school shouldn’t start until 9 am. I’m quite certain my grades would have improved considerably. I carried a 2.8 gpa in high school and was always falling asleep in class. In college I had a 3.5 and only two Cs ….both were 8am classes. I would have received an A based on all exams and assignments in one of those classes, but I was hit with a C for missing 1/3 of all classes.",
            "title_similarity": "0.7164179",
            "sentiment_compound": -0.0909
        },
        {
            "id": "hrsc7ez",
            "score": 1,
            "text": "Home school is such a freedom in many more ways than not starting early. This would work for public but not to push time back to getting out super late. We can do all homeschool work within 2 hours be 6 school hours but there’s something to be said for the social aspect.",
            "title_similarity": "0.69039667",
            "sentiment_compound": 0.8381
        },
        {
            "id": "hrsc9d5",
            "score": 1,
            "text": "Doesn’t matter. They will keep doing it because that’s the way they have always done it.",
            "title_similarity": "0.24051553",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hrscd80",
            "score": 1,
            "text": "IT won’t matter to the people in charge of making these decisions. Plus, I’m sure a lot of parents will throw a fit because a large amount of them do not care what their child does at school anyway.",
            "title_similarity": "0.5780865",
            "sentiment_compound": 0.312
        },
        {
            "id": "hrsch46",
            "score": 1,
            "text": "Or, we just give everybody nap time!",
            "title_similarity": "0.35129175",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsck1l",
            "score": 1,
            "text": "Pretty sure studies were already reporting this 30 years ago and yet nothing has changed. (In the US.)  Schools seem to be designed primarily around parents' schedules since they've become essentially childcare for most people.",
            "title_similarity": "0.5038225",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hrsclat",
            "score": 1,
            "text": "Teenagers have been telling us this for years.",
            "title_similarity": "0.32815796",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsd1hm",
            "score": 1,
            "text": "While the family was more rested I don’t think the quality of the schooling was better and the lack of social interaction was horribly damaging.",
            "title_similarity": "0.7190033",
            "sentiment_compound": -0.7269
        },
        {
            "id": "hrsd2hb",
            "score": 1,
            "text": "Can't they just go to sleep earlier to get more sleep?",
            "title_similarity": "0.53714484",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsd2hm",
            "score": 1,
            "text": "Now this generation of kids so t have to get out of bed?",
            "title_similarity": "0.478244",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsd3mk",
            "score": 1,
            "text": "Yeah but my parents go to work at 8a so sleeping in isn't really an option.",
            "title_similarity": "0.49845204",
            "sentiment_compound": 0.1531
        },
        {
            "id": "hrsd48n",
            "score": 1,
            "text": "I never understood why as a little kid who happily got up at 6:30 my school started at 9 but as a surly teen to struggled to get up before 10 my school started at 8",
            "title_similarity": "0.66697633",
            "sentiment_compound": -0.2339
        },
        {
            "id": "hrsd4i1",
            "score": 1,
            "text": "I swear next we're going to find that going to work has negative health consequences and try to cancel work.",
            "title_similarity": "0.47266644",
            "sentiment_compound": -0.7096
        },
        {
            "id": "hrsd6qv",
            "score": 1,
            "text": "My school was supposed to start this beginning this year, but COVID royally screwed up those plans. I can attest to the fact that waking up later helps me feel better during the day, though. Each month we get a two-hour delay for teachers to plan a bit, and I feel so much better those days coming in at 9:30 instead of 7:30. Even waking up at 7 during virtual learning was better than my normal schedule.",
            "title_similarity": "0.81491035",
            "sentiment_compound": 0.8449
        },
        {
            "id": "hrsdmg5",
            "score": 1,
            "text": "just go to sleep earlier?",
            "title_similarity": "0.39600766",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsdwyd",
            "score": 1,
            "text": "The kids are not alright. My son has ADHD, and having outbursts in class, the principal suspended him as a 2nd grader. He has a classmate who is extremely sweet, and she said she would shoot herself in the head because she can't finish the work fast enough. It's extremely hard for them right now.",
            "title_similarity": "0.648233",
            "sentiment_compound": -0.5632
        },
        {
            "id": "hrse1jq",
            "score": 1,
            "text": "I remember reading similar articles in high school. I’m 25 now, and nothing has changed. It’s the way it is because of parents who drop their kids off at school on their way to work, and teachers who prefer working 7-3:30 instead of 8-4:30",
            "title_similarity": "0.63731563",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hrse4px",
            "score": 1,
            "text": "Circadian rhytms is what decides it I would say wikipedia is your friend",
            "title_similarity": "0.36263585",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hrselv1",
            "score": 1,
            "text": "The biggest quality of life improvement I experienced was when I no longer needed to wake up at 4 am to get ready to listen to some asshole who tried to shame for not wanting to exercise at  6 am. School needs reform",
            "title_similarity": "0.7709363",
            "sentiment_compound": 0.0516
        },
        {
            "id": "hrseq7y",
            "score": 1,
            "text": "Oh but they don’t care because it’s designed to help parents who are working",
            "title_similarity": "0.48718512",
            "sentiment_compound": 0.8338
        },
        {
            "id": "hrsezzy",
            "score": 1,
            "text": "And they learned nothing because they largely blew off school. Take away anyone's responsibilities and their mental health improves.",
            "title_similarity": "0.62582093",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hrsf3ye",
            "score": 1,
            "text": "I recall a US study, in the 2000s maybe, that spoke to this and one of the take was that after school sports are too important!?!?! Forget mental and physical heath—we need football!",
            "title_similarity": "0.5878582",
            "sentiment_compound": -0.3875
        },
        {
            "id": "hrsf7rw",
            "score": 1,
            "text": "They have literally been saying that since before I was in highschool and I graduated 10 years ago",
            "title_similarity": "0.43296862",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsf7wd",
            "score": 1,
            "text": "I dont see anything wrong with high school days being 9-5. Yeah, that's a later closing time, but not so late as to not allowing for after school activities. Also, if you schedule your study hall at the end of the day, then just get out an hour early",
            "title_similarity": "0.65180683",
            "sentiment_compound": 0.335
        },
        {
            "id": "hrsf915",
            "score": 1,
            "text": "Yeah, this was known over 20 years while I was still in school.",
            "title_similarity": "0.29073727",
            "sentiment_compound": 0.296
        },
        {
            "id": "hrsfayr",
            "score": 1,
            "text": "The problem is that parents’ work days start at about 8 or 9. If you have a young child, you can’t just leave them alone and hope they get on the bus to the morning on time. Or if you have a kid that has problems getting up, or doesn’t want to go to school, like…yeah it would be nice to have kids start later, but it’s not realistic.",
            "title_similarity": "0.7337759",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hrsfnhl",
            "score": 1,
            "text": "Maybe because they weren’t worried about being late, being bullied, consequences of not completing their homework, etc.",
            "title_similarity": "0.5906005",
            "sentiment_compound": -0.743
        },
        {
            "id": "hrsfnnu",
            "score": 1,
            "text": "Because we are on reddit, going only by all the studies posted in r/science---despite being from dubious sources like \"https://www.media.uzh.ch/\" I have concluded the following:\n\n* School should begin late.\n* Work week---if it should exist at all, should be 3 days a week.\n* There should be guaranteed income.\n* Marijuana has endless benefits for the human mind and body.\n* A super-efficient magic battery is JUST around the corner.\n* A cure for Alzheimer’s disease is just around the corner.\n* Archaeological evidence shows women were in charge or warriors in all ancient tribes.\n* Being a Trump voter means you are less intelligent.\n* Anti-Vaxxers are stupid.\n* People obsessed with celebrities are stupid.\n* If you are Liberal, Democrat, or Progressive, that means you have a high IQ.\n* Religion is a mental illness.\n* Social media is bad for you.\n\n* Etc.",
            "title_similarity": "0.6339302",
            "sentiment_compound": -0.8553
        },
        {
            "id": "hrsft3x",
            "score": 1,
            "text": "My school did this for a while. Students complained about missing out on going to jobs after. They also, still arrived late to school.",
            "title_similarity": "0.6788477",
            "sentiment_compound": -0.5994
        },
        {
            "id": "hrsfvwk",
            "score": 1,
            "text": "I cant afford before school care though. Good idea but employers wont accommodate",
            "title_similarity": "0.5519802",
            "sentiment_compound": 0.4678
        },
        {
            "id": "hrsg0ha",
            "score": 1,
            "text": "I remember when a study came to this exact same conclusion in the 90's.\n\nThe problem is, schools also serve the purpose of being daycares so mom and dad can be at work a 9.",
            "title_similarity": "0.62631005",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hrsg3ax",
            "score": 1,
            "text": "Does it matter what the kids want or what's good for them because for the adults it's more convenient to have it the way that it is. It's a shame but we are a country full of selfish narcissists that would rather something bad stay in place as long as it doesn't inconvenience them.",
            "title_similarity": "0.6234821",
            "sentiment_compound": -0.7984
        },
        {
            "id": "hrsg7nm",
            "score": 1,
            "text": "When I was in elementary school, the day started at 9:15 and we got out at 4. Now, being a teacher, getting out at four sounds late, but not starting until after nine would be amazing! My kids start coming in the door at 7:40.",
            "title_similarity": "0.59531116",
            "sentiment_compound": 0.7574
        },
        {
            "id": "hrsg80q",
            "score": 1,
            "text": ">teenagers reported improved health and health-related quality of life \n\nI bet their parents (aka teachers) did too!",
            "title_similarity": "0.74335563",
            "sentiment_compound": 0.5255
        },
        {
            "id": "hrsgb9u",
            "score": 1,
            "text": "This has been known for ages, but it won't pass because teachers are kind of addicted to their work schedule and love to discipline pupils about being slow in the morning.",
            "title_similarity": "0.71911734",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hrsgyqh",
            "score": 1,
            "text": "Counter point is won't kids just stay up even later and then have the same issue?",
            "title_similarity": "0.52122015",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrshgjs",
            "score": 1,
            "text": "Our whole way of life is set to capitalism’s clock. \nHumans aren’t meant to be awake when it’s dark out. That’s when we are supposed to sleep.",
            "title_similarity": "0.5182749",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrshk2w",
            "score": 1,
            "text": "On the flipside, after spending a few days?",
            "title_similarity": "0.24895737",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrshq77",
            "score": 1,
            "text": "My kids at up before 6am.  I’d rather school start an hour earlier.",
            "title_similarity": "0.55405444",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrshtnm",
            "score": 1,
            "text": "One of the reasons school starts early is to condition you for the regular working hours. Your parents get up, you get up. If the majority of the jobs would have you start your work at 9, then school would start at a similar time too.",
            "title_similarity": "0.6674763",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrshwfg",
            "score": 1,
            "text": "I heard this 11 years ago when I was first in high school, and I’ll hear it again in another 11 when nothing has changed.",
            "title_similarity": "0.44473094",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsi7ey",
            "score": 1,
            "text": "We’ve known this for years but it won’t change because schools are scheduled as daycares and conveniences for parents and other societal issues as opposed to being valued as places where kids go to be educated about the world around them. Hell if nothing more times should be reversed (smaller kids go earlier because their brains wake up earlier than teens) but it won’t change because many parents need older kids to come home first so they’ll babysit their younger siblings when they get home from school.",
            "title_similarity": "0.73638713",
            "sentiment_compound": -0.5499
        },
        {
            "id": "hrsis10",
            "score": 1,
            "text": "What does \"sleeping in\" have to do with anything - how about \"needing more sleep\"?",
            "title_similarity": "0.39339274",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsiu5w",
            "score": 1,
            "text": "I get to go to school at 9:30am, compared to everyone else who arrives at 8:30am I’m a lot happier in the morning than they are",
            "title_similarity": "0.70818084",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hrsj2lj",
            "score": 1,
            "text": "Did this study take into account bed times?\nMany of the teenagers in my circles could probably benefit from going sleeping later, but they are also regularly staying up until 2 am on school nights texting and scrolling on their phones.",
            "title_similarity": "0.7251363",
            "sentiment_compound": 0.25
        },
        {
            "id": "hrsj8ti",
            "score": 1,
            "text": "Sleeping in is known to be good for teenagers. But there is homeschooling and then there is homeschooling. I worked in a library and this christian group of homeschooled kids came in. They weren't interested in the neat Harry Potter event we put on because those books were verboten as they would lead to witchcraft and devil worship. \n\nSo the adults believed that witchcraft and magic is real even when portrayed in fiction and I don't even know what else after that as i had to go in the back room to not say something inappropriate. \n\nI do know intelligent rational parents who have done a good job homeschooling their children as well but mostly down here in TN it's religious nutjobs.",
            "title_similarity": "0.69872165",
            "sentiment_compound": 0.8505
        },
        {
            "id": "hrsk1co",
            "score": 1,
            "text": "Our schools changed from 8:50 to 7:50 start times this year. All the kids are tired and grumpy. The political pressure to start earlier so workers can be productive outweighs the health and happiness of children.",
            "title_similarity": "0.76121116",
            "sentiment_compound": -0.128
        },
        {
            "id": "hrsk49y",
            "score": 1,
            "text": "Not treating school like a full time job leads to better quality of life? No way",
            "title_similarity": "0.6146052",
            "sentiment_compound": -0.1053
        },
        {
            "id": "hrsk9im",
            "score": 1,
            "text": "True, but I immediately knew what it meant.",
            "title_similarity": "0.006465357",
            "sentiment_compound": 0.2263
        },
        {
            "id": "hrskgjm",
            "score": 1,
            "text": "“The students in the lockdown group rated their health-related quality of life higher, and the amount of alcohol and caffeine.”\n\nI’d wager sleep has nothing to do with their  alcohol consumption. Their parents always being at home with them on the other hand…",
            "title_similarity": "0.7230159",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrskog0",
            "score": 1,
            "text": "I can picture it now, the sun sets at lunch time during the winter because I got to school at 11am.",
            "title_similarity": "0.51956606",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrskqui",
            "score": 1,
            "text": "I'm pretty sure the best method of schooling is to have a small(er) local group of kids meeting up every once and a while, while being adequately homeschooled.",
            "title_similarity": "0.561762",
            "sentiment_compound": 0.8658
        },
        {
            "id": "hrskrs6",
            "score": 1,
            "text": "My elementary kid’s bell rings at 7:55am. Middle schooler’s at 8:30am.",
            "title_similarity": "0.44827735",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsll0l",
            "score": 1,
            "text": "Didn't suicide rates for school age children go down with remote learning?",
            "title_similarity": "0.6412176",
            "sentiment_compound": 0.5559
        },
        {
            "id": "hrsllwi",
            "score": 1,
            "text": "My 10 year old has to be at the bus stop before 7am and to do so, has to be up by 6. Pretty crazy",
            "title_similarity": "0.5461897",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hrsltoa",
            "score": 1,
            "text": "What!? The 9-5 lifestyle is toxic? Shocking!",
            "title_similarity": "0.37961715",
            "sentiment_compound": -0.5638
        },
        {
            "id": "hrsm78h",
            "score": 1,
            "text": "Meanwhile a bunch of people want to switch to permanent daylight savings time which would push most of the school year to start one hour earlier. Go figure.",
            "title_similarity": "0.6047278",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hrsm92v",
            "score": 1,
            "text": "We have known this for decades with numerous studies to back it up. \n\nWhy has this never impacted policy?",
            "title_similarity": "0.32626772",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsmhf9",
            "score": 1,
            "text": "I'm a professional youth worker who spends a lot of time with teenagers. Many of the teens I work with stay up too late using electronics. Every time I see research like this, I have to ask if the same quality of life increases could be found if kids went to bed earlier, got off of their electronics, and practiced better sleep hygiene.",
            "title_similarity": "0.76567435",
            "sentiment_compound": 0.6597
        },
        {
            "id": "hrsmplu",
            "score": 1,
            "text": "Or….go to bed on time.",
            "title_similarity": "0.30950618",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsn9o0",
            "score": 1,
            "text": "The current school schedule is directly because of the economic order of the world. As such, it doesn’t actually care about the human bodies that inhabit it.",
            "title_similarity": "0.5150761",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hrsnxm2",
            "score": 1,
            "text": "you guys know school is to babysit kids while parents work right?\n\nif school started later parents woupd have to take them later and work later , your entire schedule would look the same but be shifted one hour later",
            "title_similarity": "0.66273063",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsocuq",
            "score": 1,
            "text": "The general sentiment in the comments here seems to be that it would be a nice idea, but it would be problematic for the parents morning work schedules, and that kids need to be conditioned to these hours to prepare them for a full-time work week as adults. (This doesnt take into consideration that college class schedules completely disrupts this, though).\n\nBut what if we flipped school sports and activites to take place in the morning, and push the class start time later? The teens who don't participate in school teams could to use the extra time to do homework/study/eat breakfast, etc.\n\nThis way the family routines won't be interrupted, physical activity in the AM is encouraged, and people would be less rushed/tired/grumpy in general. Just a thought...",
            "title_similarity": "0.8003347",
            "sentiment_compound": 0.3883
        },
        {
            "id": "hrsohaj",
            "score": 1,
            "text": "Most of what school is like is for the convenience of parents, not kids. Starting time included- it's earlier than most offices so parents can drop their kids off before work.\n\nIn my country, covid made that especially clear - our governmznt is dead set on keeping schools open so parents don't have to skip work to sit them.",
            "title_similarity": "0.66992617",
            "sentiment_compound": -0.3117
        },
        {
            "id": "hrspc7t",
            "score": 1,
            "text": "Funny how we need science to tell us this common sense thing. Everyone knows sleeping in and naturally waking is more beneficial to the body and mind.",
            "title_similarity": "0.6805806",
            "sentiment_compound": 0.7264
        },
        {
            "id": "hrspkqr",
            "score": 1,
            "text": "Unfortunately the US will not adopt these sensible measures. Because they're sensible.",
            "title_similarity": "0.43527675",
            "sentiment_compound": -0.4438
        },
        {
            "id": "hrspohn",
            "score": 1,
            "text": "This has been shown time and time again, for decades, every time it's studied.",
            "title_similarity": "0.18473068",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrspqhj",
            "score": 1,
            "text": ".... or maybe just don't stay up til midnight?",
            "title_similarity": "0.34847578",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrspv1y",
            "score": 1,
            "text": "Night owl by nature. Teenage years were hell- got physically sick in the mornings. I’m very awake between 9pm-2am. Morning birds always win.",
            "title_similarity": "0.62557876",
            "sentiment_compound": -0.6249
        },
        {
            "id": "hrsq213",
            "score": 1,
            "text": "Yep. Matthew walker's book \"why we sleep\" talks about how a later start time not only improves health but also saves lives. (Less car accidents)",
            "title_similarity": "0.78560555",
            "sentiment_compound": -0.3815
        },
        {
            "id": "hrsqjah",
            "score": 1,
            "text": "They've known this for decades and haven't done anything.",
            "title_similarity": "0.19386594",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsqjfd",
            "score": 1,
            "text": "All vestiges from an inhumane past. People can be just as productive on 30-hour workweeks and kids can learn just as much in 5-6 hours of school a day. We are stifling the potential of our species because the people in charge care more about money than life.",
            "title_similarity": "0.71877843",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hrsr6kk",
            "score": 1,
            "text": "I'd like to not stay at school until after dinner, thank you",
            "title_similarity": "0.42992824",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hrsrbci",
            "score": 1,
            "text": "The school day was always about being convenient/possible for the schedules of working PARENTS.  The primary purpose of schools has historically not been education or socialization but DAYCARE.  \n\nAround 1890-1910, as urbanization happened in much of Europe/America, and adults worked in specialized factory jobs that had little to no use for child-laborers/apprentices, packs of young children roaming the streets became a public nuisance.  To address that nuisance, mandatory schooling was instituted across most western cultures.  The resulting public schools became the playground of progressive do-gooders mostly because nobody else cared. The do-gooders were only allowed to control the schools because success or failure of their education mission was irrelevant to the main point of those schools which was always to simply get the kids off the street.  If school children ended up learning manners or reading along the way, that was just gravy.",
            "title_similarity": "0.6702416",
            "sentiment_compound": 0.5216
        },
        {
            "id": "hrsrhcc",
            "score": 1,
            "text": "Yea but isn’t the main issue that it starts when it does so parents can drop their kids off before their work starts",
            "title_similarity": "0.5342997",
            "sentiment_compound": -0.467
        },
        {
            "id": "hrsrs5m",
            "score": 1,
            "text": "Is not the point of having kids/teens going to schools at certain hours to make it easir on the parents who work regular jobs?to accomodate to the parents to move their offspring tho and fro without affecting their job",
            "title_similarity": "0.6035996",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hrsrw7d",
            "score": 1,
            "text": "This has been known for decades. Again, not new science or discovery...",
            "title_similarity": "0.2774447",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrss26g",
            "score": 1,
            "text": "My kid starts elementary school at 7:40 am Mon-Fri.  As a kid I started on average at 8:45~9:00 am.  FML",
            "title_similarity": "0.4771828",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrss3ph",
            "score": 1,
            "text": "Until we stop using school as the only option for child care that is never going to happen. Scientists have been suggesting this for decades and it has always fallen on the deaf ears of administrators and parents. People have to work and they can't do that if their kids don't go to school early. Instead of ignoring these things like we've always done we should maybe try to come up with a solution that works for everyone and gives our kids the best chance possible for a healthy and positive future.",
            "title_similarity": "0.67921656",
            "sentiment_compound": 0.9201
        },
        {
            "id": "hrss96g",
            "score": 1,
            "text": "School happens at the time it happens because parents need to go to work after they get their kids ready for school.",
            "title_similarity": "0.49727964",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hrssje1",
            "score": 1,
            "text": "I can definitely relate. Went to a regular public high school that started 7:15 straight into classes every day when it was still pitch black outside, absolute misery every morning. Moved to a place that started 8:30 with half an hour of study hall and lo and behold, school was far more enjoyable and my grades improved.",
            "title_similarity": "0.6837242",
            "sentiment_compound": 0.7346
        },
        {
            "id": "hrssmtl",
            "score": 1,
            "text": "I remember this study from 5, 10 and 20 years ago",
            "title_similarity": "0.26539528",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrstb0c",
            "score": 1,
            "text": "But school is just preparing young people for the workforce.",
            "title_similarity": "0.46083507",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrstye7",
            "score": 1,
            "text": "So basically teens go to bed too late.",
            "title_similarity": "0.52418613",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrstymm",
            "score": 1,
            "text": "However that won't happen, because ultimately school is a training ground for work, and employers aren't going to want to start later. As is always the way, science says \"here is how you could increase your efficiency\" and business goes \"nuh-uh, this is how we've always done things and we refuse to change\". See also; home working, shorter working weeks, less rigid control of employee time during work hours (toilet 'allowances' for example) etc etc.",
            "title_similarity": "0.668328",
            "sentiment_compound": 0.2894
        },
        {
            "id": "hrstzxu",
            "score": 1,
            "text": "you don´t say...  \n\n\na study was needed for this!?",
            "title_similarity": "0.14600973",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsuwdo",
            "score": 1,
            "text": "Who could have possibly known",
            "title_similarity": "0.013790965",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsuyxe",
            "score": 1,
            "text": "That’s not gonna work when you have children that need to be dropped off by their parents who generally do that before they go to work",
            "title_similarity": "0.5273476",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsv61s",
            "score": 1,
            "text": "Obligatory plug for the [B-Society](https://www.b-society.org/)",
            "title_similarity": "0.17924291",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsvyig",
            "score": 1,
            "text": "Workdays in general should follow the sun. People should be able to get up when it’s light, not have to get up at 5am so they can commute to work or school in the dark.",
            "title_similarity": "0.62416273",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsw8e7",
            "score": 1,
            "text": "Unfortunately, schools have become free childcare for the overworked lower classes. I'm a teacher and I'm 100% in full support of starting school later, but how can we make it happen when both parents need to be at work at 7am, or are working multiple jobs, or whatever. That's the majority of the issue, not just that 'parents don't like it' (though in my experience, parents are typically unwilling or unable to look beyond their individual struggles to see the larger problems).",
            "title_similarity": "0.74939156",
            "sentiment_compound": -0.8301
        },
        {
            "id": "hrswjlf",
            "score": 1,
            "text": "School is daycare, society had forced both parents to work or starve.\n\nIt must sadly reflect working hours due to the un-ending inflation and taxation crushing the middle class.",
            "title_similarity": "0.62636906",
            "sentiment_compound": -0.8807
        },
        {
            "id": "hrswnxf",
            "score": 1,
            "text": "People always say an important part of school is giving you responsibility and the habit of working a regular job. Wouldn’t it make more sense to have school be 9 am to 5 pm then instead of 7 am to 3 pm?",
            "title_similarity": "0.61900496",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hrsx2xp",
            "score": 1,
            "text": "But then how are mommy and daddy going to get to work if public child care doesn't start early!\n\nSchool has never been about learning and education, it's a place for kids to go while their parents slave away at their menial jobs.",
            "title_similarity": "0.56560373",
            "sentiment_compound": 0.68
        },
        {
            "id": "hrsx5c5",
            "score": 1,
            "text": "I knew getting up early was a scam",
            "title_similarity": "0.3620482",
            "sentiment_compound": -0.5719
        },
        {
            "id": "hrsx9p6",
            "score": 1,
            "text": "Their opinions of the their own mental health should taken with a grain of salt. Humans have evolved with the rising sun and probably should stay with it. Just because Timmy feels better for sleeping in doesn't mean it's effective. They could also just go to bed earlier. As a nocturnal person myself, I don't think it is the most healthy thing for us. We need sunlight to survive and the modern world is not based on what we were evolved for.",
            "title_similarity": "0.71007717",
            "sentiment_compound": 0.517
        },
        {
            "id": "hrsxq8c",
            "score": 1,
            "text": "Teachers already work so late afterschool though, they'd be there all night.",
            "title_similarity": "0.50960547",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsxvjd",
            "score": 1,
            "text": "one huge problem is that Athletes want time on the playing field while the sun is still up. There's a substantial % of the student body that prioritize competitive sports in America, and their schedules need to be taken into consideration too.",
            "title_similarity": "0.5272456",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hrsy1lb",
            "score": 1,
            "text": "Anyone else think that if school started later, kids would eventually just stay up later creating a net zero effect and a new norm?",
            "title_similarity": "0.650274",
            "sentiment_compound": 0.296
        },
        {
            "id": "hrsy62w",
            "score": 1,
            "text": "Interesting. I'm very grateful that I got up so early in the morning. I went to Mormon Seminary at 6 am every school day. I still regularly get up a 5am. I love being a morning person ; ).",
            "title_similarity": "0.5830814",
            "sentiment_compound": 0.8805
        },
        {
            "id": "hrsyrk5",
            "score": 1,
            "text": "With the current bus driver shortage, this would be really hard to implement in public schools in the USA. a lot of school districts use the same bus drivers to take kids to and from school, that’s why the start and end times for elementary middle and high school are all different if they are in the same district",
            "title_similarity": "0.65846324",
            "sentiment_compound": -0.4005
        },
        {
            "id": "hrsz3vg",
            "score": 1,
            "text": "Maybe stupid question but. Couldn't teenagers go to bed earlier and get the same benefits ? \n\nI would guess starting school later will only make them sleep later as well. Speaking from my own anecdotal evidence, I used to be sleep deprived, but still would stay awake just to play video games...",
            "title_similarity": "0.7357026",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hrsz8u0",
            "score": 1,
            "text": "Wish there was a hybrid system my daughter has thrived these last two years being virtual and I dread the day she has to go back.",
            "title_similarity": "0.6337936",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hrszhg2",
            "score": 1,
            "text": "Wait how did they sleep longer in the morning? Wouldn’t zoom schooling start at the same time?",
            "title_similarity": "0.66314274",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrszm6x",
            "score": 1,
            "text": "The biggest reason why this doesn't happen is sports.",
            "title_similarity": "0.35604697",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrsztz8",
            "score": 1,
            "text": "Isn’t most public school just daycare? \n\nLike the smart kids teach themselves pretty much. The trouble-makers get all the attention/time/effort. And the rest of the kids are just tired/bored.\n\nIt’s just daycare. Rich people don’t want and educated population. They want a working population. And sitting at daycare all day prepares you for sitting at work all day. \n\nHow can the problem be solved? Make everyone’s jobs start later in the day?",
            "title_similarity": "0.73560524",
            "sentiment_compound": 0.9107
        },
        {
            "id": "hrt0df4",
            "score": 1,
            "text": "It also makes the opposite of sense that, in a lot of places, high school starts earliest and elementary school starts later since younger children naturally wake up earlier than teenagers.",
            "title_similarity": "0.6717958",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrt0kcb",
            "score": 1,
            "text": "On a cynical note, a study with similar results comes out every few years. School districts that care might even debate about pushing School Opening times, but then inevitably working parents speak up and say \"Well, how am I supposed to get to work by 9, then drop my kid at school at 9:30?\" Then by the time you account for common commute times and everything you're right back to where you started.\n\nI know some people will say that better busing will solve the issue, but parents aren't necessarily comfortable with leaving their kids alone (especially if those kids are likely to skip school).\n\nNot saying it's impossible, just that I've seen it come up before and it always ends up stuck in the mud.",
            "title_similarity": "0.7508497",
            "sentiment_compound": -0.5111
        },
        {
            "id": "hrt14j5",
            "score": 1,
            "text": "And they don’t need to last as long, either. My son took 5 classes instead of 4 so that he could graduate a semester early. He started his online classes around noon and was usually finished by 3:30 or so. He got  everything done, was always n schedule - sometimes ahead even - working 3 1/2 to 4 hours a day. So why did he need to be at regular school from 8:15 til 3:30  - 7+ hours - to take one less class?",
            "title_similarity": "0.63796234",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrt18cj",
            "score": 1,
            "text": "School is in many ways training kids to get up at a certain time to be at work. I am not a morning person, but I also will get fired if I’m not at work before 7AM.\n\nIf we open later, a lot of parents wouldn’t be able to drop off their kids, leaving them unsupervised at home or out on the street for hours.\n\nIt’s the perfect time to practice sleep hygiene and not staying up until 3AM playing video games. Most times, parents don’t seem to know their kid is sleep deprived until we call home and discuss our concern. The kids hate it because it always leads to computers, consoles, and phones leaving the bedroom.",
            "title_similarity": "0.72844326",
            "sentiment_compound": -0.8735
        },
        {
            "id": "hrt1nzv",
            "score": 1,
            "text": "We must arrive before 7 am at my school in Vietnam. That means some of us must wake up at 5 am in order to not getting late for school. Classes only ended after 5:30 pm and most of the students have to attend cram school after school. We often get back home after 9pm, eat some leftover and do our homework until midnight. I think schools should reckon the importance of sleep on students’ physical and mental health.",
            "title_similarity": "0.69155896",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hrt2h5t",
            "score": 1,
            "text": "Now do the same study on adults and send it to my employer. Thanks.",
            "title_similarity": "0.40296263",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hrt2nft",
            "score": 1,
            "text": "Imagine all the other benefits: No bullies (for most families), no time and energy consuming hours of travel, only motivated (and not yet jaded) teachers giving you much more of their attention, and so on.\n\nThat said, schools are great to have. They're simply really poorly implemented in most cases. Largely due to being tied up in public policy, rather than based on the particular consumer interests of parent and child being delivered by a dedicated principal and their teachers.",
            "title_similarity": "0.69176805",
            "sentiment_compound": 0.9404
        },
        {
            "id": "hrt3bhh",
            "score": 1,
            "text": "I'm fed up with the dictatorship of the larks.\n\nOwls should demand equal rights.",
            "title_similarity": "0.39998993",
            "sentiment_compound": -0.128
        },
        {
            "id": "hrt3quv",
            "score": 1,
            "text": "My daughter is in elementary school, and their day starts at 7:30. Luckily she is pretty good about waking up, but it seems way too early for these kids to be starting school. If my daughter has trouble sleeping for some reason, I just let her sleep extra and take her a little late. \n\nI’ve never understood why we expect kids to perform in the morning. We should prioritize healthy living over establishing arbitrary regiments.",
            "title_similarity": "0.7616797",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hrt49uh",
            "score": 1,
            "text": "So how do parents get their kid to school if it starts later and they need to be at work",
            "title_similarity": "0.5008191",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrt4bdk",
            "score": 1,
            "text": "How about not making online assignments due at midnight?  Better commission a study…",
            "title_similarity": "0.42510492",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hrt4smn",
            "score": 1,
            "text": "I am going publish a study showing that adults that don't need to work and can sleep longer into the morning are happier.",
            "title_similarity": "0.76128006",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hrt4wy4",
            "score": 1,
            "text": "The problem w elementary and middle school kids is if their day starts later then the work day has to start (and end) later. Schools are to teach and watch children to educate the next generation and free up the current to be productive. So yes, it is better for them to sleep in later but is it better for adults to work later, get off later, and have kids get home later. Middle school kids already get off the bus around 430 on avg. Are we going to add school buses to the post 5PM rush hour?",
            "title_similarity": "0.76828086",
            "sentiment_compound": 0.8098
        },
        {
            "id": "hrt57zw",
            "score": 1,
            "text": "Lack of healthy sleep is a problem, the bigger problem is that kids don't learn adequate skills in school. Especially in the United States. It's just a conditioning program to make people submissive in the workplace and vote for whatever team their parents chose. Kids do not learn skills like:\n\nBalancing a checkbook, home loans, school loans, car loans, and the difference of all three.\n\nHow to cook healthy meals, nutrition, ways to avoid or decrease: obesity, diabetes, high blood pressure.\n\nHealthy ways to communicate in the workplace versus in loving relationships. Stress, anger, fear.\n\nEscapism, drug addiction, mental health and treatment options.\n\nCitizen rights are glossed over entirely, it's mostly just false history lessons for 12 years straight. But the time kids are \"old\" enough to understand more accurate history, they are burned out on all the fake Christopher Columbus and Pilgrim tales of childhood.\n\nBias in the news, the right of a free press, and how easy it is to insert bias in a news story. Being able to determine real news from opinion pieces and editorializations.\n\nThe ways in which this country are deeply flawed: no ranked choice voting, corporate backed elections, corporate sponsored politicians creating laws for corporations rather than people; stagnant minimum wages, stagnant wages, extreme wealth inequality between CEOS and the average worker, poor worker conditions in factories such as Amazon; the low and falling rate of unions and the companies that block union organization, worker rights, basic human rights, etc.\n\nA tax system that is deeply flawed that rewards cheating and punishes the poor.\n\nA complete lack of maternity care and paternity care, a system that punishes new parents, expensive day care, and the rate of poverty to have children in the US. A healthcare system that benefits health insurance companies at the expense and poor health of every single citizen. How this health system is 40 years behind all European countries and 30 industrialized nations.\n\nThe rate in which college education has become more expensive over the past 40 years, the reasons why, ways to improve education overall.\n\nSo much more.",
            "title_similarity": "0.6934992",
            "sentiment_compound": -0.9624
        },
        {
            "id": "hrt5k9h",
            "score": 1,
            "text": "We have know this for sometime but that doesn’t matter as if the parents work at 8 the kids will need to be at school before that time. Modern school is not about learning as much as it is a partial daycare for parents children. Though this study is great it will not happen unless society buys into it and I don’t see America doing this anytime soon.",
            "title_similarity": "0.67854637",
            "sentiment_compound": 0.7783
        },
        {
            "id": "hrt5q8b",
            "score": 1,
            "text": "This has been known for awhile. GL",
            "title_similarity": "0.09343875",
            "sentiment_compound": 0.4648
        },
        {
            "id": "hrt6cj1",
            "score": 1,
            "text": "Our littlest chose to stay in remote learning because it was so much easier to manage and she enjoys her sleep",
            "title_similarity": "0.5868419",
            "sentiment_compound": 0.749
        },
        {
            "id": "hrt6oxl",
            "score": 1,
            "text": "I could go right now and find dozens of Jr. High/high school kiddos that are up at 430a.m. for studying or athletic practice and they are KILLING it (doing better than I did at their age, easy).  Every couple of years someone comes along and throws this out there and it's bologna.",
            "title_similarity": "0.6055685",
            "sentiment_compound": -0.0857
        },
        {
            "id": "hrt6rab",
            "score": 1,
            "text": "It's all about the work schedule of adults.",
            "title_similarity": "0.20880276",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrt71yv",
            "score": 1,
            "text": "I agree. As someone who isn't a morning person it was very difficult and often felt physically painful to consistently wake up that early for school. I'm quite sure it affected my mental health at a time when it was already fragile",
            "title_similarity": "0.6944067",
            "sentiment_compound": -0.3535
        },
        {
            "id": "hrt777n",
            "score": 1,
            "text": "That is not going to prepare them for real life. Most of us out here in reality get up around 5AM actually.",
            "title_similarity": "0.5206682",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrt7gso",
            "score": 1,
            "text": "I homeschool my boys and we start around 9-10 am. Why bother trying when they’re too sleepy to focus? Never understood why we do it like that anyway in the school system, wouldn’t teachers/parents prefer a later start/later end anyway?",
            "title_similarity": "0.7523267",
            "sentiment_compound": 0.1179
        },
        {
            "id": "hrt7ipo",
            "score": 1,
            "text": "I've been hearing about this study maybe as early as 2005. It ain't even gonna happen.",
            "title_similarity": "0.38906205",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrt97au",
            "score": 1,
            "text": "Ohhh OHH REALLY? Oh no way sorry our bad we'll _totally_ fix school hours to reflect this incredible surprising information. Guess we really missed the mark on that one huh, thank god covid pointed it out. Silver linings amirite",
            "title_similarity": "0.64231867",
            "sentiment_compound": -0.4502
        },
        {
            "id": "hrt9w6x",
            "score": 1,
            "text": "But how does that prepare you for life in the real world? Majority of people start work at 8am...",
            "title_similarity": "0.48206693",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrtavoj",
            "score": 1,
            "text": "As a teacher, that’d be great!  As the oldest of three siblings with working parents, how are the little ones going to get to school?",
            "title_similarity": "0.5494759",
            "sentiment_compound": 0.6588
        },
        {
            "id": "hrtayk7",
            "score": 1,
            "text": "YES.\n\nHey, all of society, we should all start sleeping in!",
            "title_similarity": "0.28050557",
            "sentiment_compound": 0.5754
        },
        {
            "id": "hrtb4wp",
            "score": 1,
            "text": "Ive only been saying this my entire academic career.",
            "title_similarity": "0.1965587",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrtb9wh",
            "score": 1,
            "text": "School doesn't start at the time it does by coincidence,it's starts at the time it does to enable a smooth transition from school into the workforce.",
            "title_similarity": "0.55562484",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrtbgcl",
            "score": 1,
            "text": "We've been saying this for years and still no one does it. No one obviously wants to shake up the system to accommodate such an action so why waste the time and resources to do these studies in the first place",
            "title_similarity": "0.45681703",
            "sentiment_compound": -0.8008
        },
        {
            "id": "hrtbmoz",
            "score": 1,
            "text": "How are you going to train the next generation in the 9-5 workday and to sit still in a cubicle to sell widgets",
            "title_similarity": "0.48391712",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrtbskl",
            "score": 1,
            "text": "They didn’t report it to their friends cause they aren’t making any.",
            "title_similarity": "0.31734604",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hrtco6v",
            "score": 1,
            "text": "There's also studies that people are more likely to choose careers that were associated with later course times during the day, while in college, and fewer career choices towards classes that they had first thing in the morning.",
            "title_similarity": "0.73986125",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrtcsoz",
            "score": 1,
            "text": "When I went to high-school, my classes started at 8:15 and ended at 18:30 (portugal).\nI didn't had time for hobbies or any personal growth, winter time I didn't even see the sunrise. I was pretty burned out all the time.\nNow my kids complain when it's past 14 (08:10-14:30) , I live in Denmark now",
            "title_similarity": "0.5699378",
            "sentiment_compound": 0.5106
        },
        {
            "id": "hrtcwp8",
            "score": 1,
            "text": "Old news. Most research is decades old regarding how teens should be allowed to sleep and school districts don't allow teens to sleep because of other concerns like traffic or having to wake up grinchy toddlers, elementary kids and middle schoolers that aren't teens yet.",
            "title_similarity": "0.6881838",
            "sentiment_compound": 0.2105
        },
        {
            "id": "hrtczpq",
            "score": 1,
            "text": "I’m a little too old for that to matter anymore personally. \n\nI do agree 100% though, trying to do mathematical theorems in the morning, coupled with my teachers soothing sleep drone voice is one of the reasons I still struggle in math.\n\nThat and being a dumb kid who’d rather be doing anything fun at any given time. That hasn’t changed much.",
            "title_similarity": "0.7499949",
            "sentiment_compound": 0.3818
        },
        {
            "id": "hrtdca5",
            "score": 1,
            "text": "We're in luck! Due to a lack of bus drivers and subs and teachers quitting in droves, my husband's school district has been having to stagger opening elementary/middle/high schools and have later start times...",
            "title_similarity": "0.6954028",
            "sentiment_compound": 0.2481
        },
        {
            "id": "hrtdhx1",
            "score": 1,
            "text": "Same dumb report has been said since the 90’s.\n\nNothing is changing. No one will advocate for teens.",
            "title_similarity": "0.3713853",
            "sentiment_compound": -0.3425
        },
        {
            "id": "hrtdjoo",
            "score": 1,
            "text": "To the absolute surprise of no one. Hasn’t everyone been saying this for years? I remember this being a hot topic when I was a teen and that was a while ago.",
            "title_similarity": "0.43927127",
            "sentiment_compound": -0.0258
        },
        {
            "id": "hrtdli0",
            "score": 1,
            "text": "The primary role of government funded schooling is not to educate but to provide secure storage for children so their parents can go to work.  It's amazing how many people don't understand this basic concept in any modern society.  That is the school day is what it is and will remain so.",
            "title_similarity": "0.62111056",
            "sentiment_compound": 0.8519
        },
        {
            "id": "hrtdytq",
            "score": 1,
            "text": "Can we align them finishing when pearants at work do to?",
            "title_similarity": "0.23405829",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrtf5gg",
            "score": 1,
            "text": "My daughter had to get up at 5:30 every day to have breakfast and catch the bus to high school. Her senior year it was all remote learning, and she didn't get up until 8:30. It made a huge difference in her quality of life.",
            "title_similarity": "0.6605847",
            "sentiment_compound": 0.3182
        },
        {
            "id": "hrtfsnf",
            "score": 1,
            "text": "There’s always the option of…sleeping earlier?",
            "title_similarity": "0.35329574",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrtglno",
            "score": 1,
            "text": "I mean, could there be another correlation? I get that it makes sense to sleep more leads to better health but we also where wearing masks and being cautious fitting this time period. It could be more than just sleep.",
            "title_similarity": "0.68750376",
            "sentiment_compound": 0.1235
        },
        {
            "id": "hrtgzwr",
            "score": 1,
            "text": "I agree; students elementary and highschool need their sleep. I don't know why America starts school at 7:30 in many places. Now that is crazy!\n\nSchools normally start at 8:30, but even I think 9AM is more acceptable. I remember eagerly looking forward to late start Wednesdays, where we start 20 past 9 in the morning.",
            "title_similarity": "0.71364826",
            "sentiment_compound": 0.7982
        },
        {
            "id": "hrth18w",
            "score": 1,
            "text": "Schools have the hours they do for the adults involved, not the kids.",
            "title_similarity": "0.51443195",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrthaxq",
            "score": 1,
            "text": "Okay, normally I don’t think my comment would be allowed here… but I seriously have to question the logic, so I think it might be this time. I get the sense this makes of everyone went to sleep at like 11pm every night. Or 2am or something. But a set time. But that’s not realistic. \n\nIf school started at say 10am, I wouldn’t have gone to sleep until like 5am instead of 2am. It wouldn’t make a difference.",
            "title_similarity": "0.7019656",
            "sentiment_compound": 0.7096
        },
        {
            "id": "hrthxlp",
            "score": 1,
            "text": "Did all virtual for a whole school year and it was awesome. Didn't have to worry about being sick and was able to chill at home, listen to music during class with my good headphones and use my own bathroom.",
            "title_similarity": "0.5448178",
            "sentiment_compound": 0.7274
        },
        {
            "id": "hrti3m5",
            "score": 1,
            "text": "Or.. they can go to bed earlier…",
            "title_similarity": "0.3750397",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrtifwx",
            "score": 1,
            "text": "We’ve known this for a _long_ time. Just no one wants to do anything about it",
            "title_similarity": "0.22400202",
            "sentiment_compound": -0.296
        },
        {
            "id": "hrtihgc",
            "score": 1,
            "text": "Exactly what I thought 20 years ago and waking up at 5am to wait for the school bus in the freezing cold ...",
            "title_similarity": "0.46706158",
            "sentiment_compound": -0.1027
        },
        {
            "id": "hrtjpym",
            "score": 1,
            "text": "I’ve always disliked headlines like this, because they try to take a very specific person-to-person need and apply it generally. Sure shifting start times later would mentally benefit most students, but it would also harm some. Sleep time is a pretty ingrained thing and your internal clock’s natural bed time can’t be manipulated at will. Healthiest would be people working when they are most awake. That time is different for everyone, so I really don’t see the benefit in large group generalizations like this.",
            "title_similarity": "0.7545038",
            "sentiment_compound": 0.8481
        },
        {
            "id": "hrtjram",
            "score": 1,
            "text": "In college I always took classes that were no earlier than 11:00am.  Was MUCH happier during that time than in high school.",
            "title_similarity": "0.6720741",
            "sentiment_compound": 0.296
        },
        {
            "id": "hrtk1fd",
            "score": 1,
            "text": "School is about the staff, not the kiddies.  No adult wants to work past 5pm.",
            "title_similarity": "0.48931968",
            "sentiment_compound": 0.2235
        },
        {
            "id": "hrtkcuz",
            "score": 1,
            "text": "I just wanna say that I was sleep deprived throughout high school... I’m still sleep-deprived now but I was in high school too",
            "title_similarity": "0.6549754",
            "sentiment_compound": -0.2617
        },
        {
            "id": "hrtlzwp",
            "score": 1,
            "text": "I have been seeing studies saying this since I was a teenager in high school myself, 40 years ago. It is not new.",
            "title_similarity": "0.4400044",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrtms0p",
            "score": 2,
            "text": "The fact that teens would do well with a much later start is well known, but no one is willing to change anything.  Teachers do not want to work later and the fact is, all after school activities would have to be later as well and no one wants to be coaching football until 10pm. So no matter how beneficial,  there is unlikely to be any type of change, although this is a good ad for the benefits of home schooling.",
            "title_similarity": "0.71162033",
            "sentiment_compound": 0.8732
        },
        {
            "id": "hrtmz0m",
            "score": 1,
            "text": "I remember driving to work as a teenager and starting to fall aslep at the wheel because I could never get enough rest.",
            "title_similarity": "0.54350215",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrtn79a",
            "score": 1,
            "text": "I went to a combined school (6th thru 12th grades), and we all started at 9:10, and finished at 4pm. Got dropped off on the way to work, and was picked up from the bus stop when my mom was on her way home. \n\nBeing able to sleep in was a huge benefit. I swapped schools to go to the alternative one, and my well-being benefited from the time change. Can’t support the findings of this study enough.",
            "title_similarity": "0.7664869",
            "sentiment_compound": 0.7906
        },
        {
            "id": "hrtn9ds",
            "score": 1,
            "text": "So educating our youth with their health and well being in mind, is better than conditioning them to wage-slavery? Who'd have thunk it.",
            "title_similarity": "0.6820304",
            "sentiment_compound": 0.6124
        },
        {
            "id": "hrtnc2r",
            "score": 1,
            "text": "Well it’s backed consistently by decades so you can bet we’ll never implement it in American policy.",
            "title_similarity": "0.40296942",
            "sentiment_compound": 0.296
        },
        {
            "id": "hrtolgy",
            "score": 1,
            "text": "Unfortunately, business hours and making money is more important (and their lobbies are the most influential), so working parents cannot stay home late enough in the morning to allow student schedules to leave home for school at a healthier time.",
            "title_similarity": "0.712829",
            "sentiment_compound": 0.5553
        },
        {
            "id": "hrtoueg",
            "score": 1,
            "text": "It's more archaic policy that needs to change. \n\n Start school later and have it run longer.. we also need to shorten summer break significantly so that there isn't a complete reset every year. \n\n Our education system is failing and some of it has to do with scheduling designed for 1900s farmers.",
            "title_similarity": "0.6886443",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hrtp2pt",
            "score": 1,
            "text": "Bruh the only reason students like me got more sleep during online school was because it was primarily asynchronous. AKA you work on your own schedule. Starting later means nothing if the number of hours in a school day stays the same. Starting later just pushes back extracurriculars to later in the day",
            "title_similarity": "0.73411584",
            "sentiment_compound": 0.3134
        },
        {
            "id": "hrtpqqp",
            "score": 1,
            "text": "Why is the work day set to start at 8 am?",
            "title_similarity": "0.3130536",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrtpzw7",
            "score": 1,
            "text": "Its frustrating to watch how slow change is on this for the educational system, at least in the US. SO much data has, for years, pointed to this outcome as a thing. Yet so many kids are still waking up before dawn. The regular workweek time has shifted as well. 9-5 is hardly the standard anymore.",
            "title_similarity": "0.75034446",
            "sentiment_compound": -0.2023
        },
        {
            "id": "hrtpzwe",
            "score": 1,
            "text": "This may be true but constantly posting it to Reddit isn't going to get your school pushed back later.  Might want to try another avenue if you want anything to happen before you graduate.",
            "title_similarity": "0.60010123",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hrtq06w",
            "score": 1,
            "text": "American public schools are state run daycares. So starting later would destroy the main purpose and function of the “school”",
            "title_similarity": "0.5323751",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hrtq3xf",
            "score": 1,
            "text": "8th grade teacher here in the largest district in the country and I second this. School absolutely needs to begin later, and it needs to be shortened. We don't make adults study for 7 hours straight or take 5-6 back-to-back classes with no breaks. Why are we doing this to children? No wonder there are severe behavior problems all across the country. Let them be children and have unstructured play time, full morning rest, and let school be just for serious learning a few hours at most, not BS like advisory periods that serve absolutely no purpose other than holding kids until its time to go.",
            "title_similarity": "0.6855707",
            "sentiment_compound": -0.8613
        },
        {
            "id": "hrtq6ga",
            "score": 1,
            "text": "Serious Question: how much of their need for sleep has to do with liberal bed times and sleeping in deep into early afternoon?",
            "title_similarity": "0.65610725",
            "sentiment_compound": -0.0772
        },
        {
            "id": "hrtqcsn",
            "score": 1,
            "text": "They should end earlier too. I was always checked out by last period at 4 pm and could barely pay attention.",
            "title_similarity": "0.5685448",
            "sentiment_compound": -0.0276
        },
        {
            "id": "hrtqqpp",
            "score": 1,
            "text": "I wonder how much of this benefit comes from spending the day in your pjs, not having to run from class to class and taking breaks when you need to versus when the bell rings",
            "title_similarity": "0.65951216",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hrtqsao",
            "score": 1,
            "text": "Fascinating outcome considering the other studies out there showing that mental health issues in teens have been massively on the rise.   The working theory was blaming covid but I think it's not so simple.",
            "title_similarity": "0.70127165",
            "sentiment_compound": 0.0387
        },
        {
            "id": "hrtr06x",
            "score": 1,
            "text": "this goes back to how work has long been forced to be \"get to work by 7-8am\", which is so stupid. There is no need to start work so early, allow a morning to start at say 10am + give people the choice of WFH so those who might have to commute long distances don't have to\n\nby doing this, parents will be able to have their kids start school later, which means kids can get more sleep and not have to wake up so early\n\nit's an archaic idea of starting work/school so damn early, plus issues like how kids are dumped with homework and how outdated the school system itself is with tests on tests that only have kids memorise words and never actually learn anything (and their interest in learning is destroyed)... ya, there needs to be a big change",
            "title_similarity": "0.73850226",
            "sentiment_compound": -0.9058
        },
        {
            "id": "hrtr95z",
            "score": 1,
            "text": "Improved “sloth-like” laziness?",
            "title_similarity": "0.41829005",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hrtrugd",
            "score": 1,
            "text": "Where were these scientists when I was in school. I had an incredibly difficult time waking up early. My grades suffered, my health suffered. I was always in detention for falling asleep during class. School was miserable.",
            "title_similarity": "0.6744223",
            "sentiment_compound": -0.9381
        },
        {
            "id": "hrts0yr",
            "score": 1,
            "text": "How am I supposed to get my kids to school later if my work starts at sunrise? They need to shorten all workdays as well if they want to do later school hours.",
            "title_similarity": "0.6248546",
            "sentiment_compound": 0.34
        },
        {
            "id": "hrts1jq",
            "score": 1,
            "text": "if I recall there've been a few studies that school starts much too early for effective learning.",
            "title_similarity": "0.649794",
            "sentiment_compound": 0.4767
        },
        {
            "id": "hrtskql",
            "score": 1,
            "text": "Make the school day an hour shorter. It's alright. It will work out.",
            "title_similarity": "0.5189796",
            "sentiment_compound": 0.25
        },
        {
            "id": "hrtt8vg",
            "score": 1,
            "text": "Yeah. I remember being miserable every morning at school cause of fatigue. In elementary, my mom had work by 7 (30 mins commute) so I would usually be at school by 630 when class didnt start til 8. I suffer from chronic fatigue as an adult and I often question if it's due to never getting enough sleep as a child. I also remember my first day of kindergarten; at the end of the day, I remember bawling when my mom picked me up cause I didn't get a nap like I did in preschool. Little did I know how much Kindergartener Me and Adult Me would be alike... :(",
            "title_similarity": "0.71084756",
            "sentiment_compound": -0.836
        },
        {
            "id": "hrtveoo",
            "score": 1,
            "text": "My last year of high-school we started at 9:15. That was a nice year. I definitely felt better in my morning classes without having to go to bed at 9pm for a whole nights rest",
            "title_similarity": "0.7195189",
            "sentiment_compound": 0.8126
        },
        {
            "id": "hrtwkc3",
            "score": 1,
            "text": "Upset that school got said by almost no student",
            "title_similarity": "0.47763717",
            "sentiment_compound": -0.5434
        },
        {
            "id": "hrtx4d0",
            "score": 1,
            "text": "Don't they start later in CA?",
            "title_similarity": "0.1901405",
            "sentiment_compound": 0.0
        },
        {
            "id": "hru039s",
            "score": 2,
            "text": "It's just impractical tho. As a highschool student in california I am dreading the mandated later start next year. Even though I know it'll be nice to sleep in a little bit, I really hate the idea of staying even longer for after school sports, and especially after time changes, it's gets dark way too early.",
            "title_similarity": "0.6939144",
            "sentiment_compound": -0.6801
        },
        {
            "id": "hru064u",
            "score": 1,
            "text": "Whoa crazy how tricking kids into a 9-5 work schedule was bad for kids! Wild!",
            "title_similarity": "0.5507115",
            "sentiment_compound": -0.7494
        },
        {
            "id": "hru0fl0",
            "score": 2,
            "text": "I would have wanted an earlier start, not later. I know I’m in the minority here but if my schooling was from 5:30am until 1230pm or so I would have been a Rhodes scholar.",
            "title_similarity": "0.5961823",
            "sentiment_compound": 0.0
        },
        {
            "id": "hru0vqg",
            "score": 2,
            "text": "I thought school was too much, and then I started working and realized life it just too much",
            "title_similarity": "0.56132174",
            "sentiment_compound": 0.0
        },
        {
            "id": "hru15wt",
            "score": 1,
            "text": "Hasn’t test scores been in the can the last year??",
            "title_similarity": "0.3552372",
            "sentiment_compound": 0.0
        },
        {
            "id": "hru1cei",
            "score": 1,
            "text": "No disrespect but I could have told you that not only for free but several yard earlier than the report came out.",
            "title_similarity": "0.45384705",
            "sentiment_compound": -0.438
        },
        {
            "id": "hru1ul2",
            "score": 1,
            "text": "I mean this isn't new. I graduated over 10 years ago and this was being preached.",
            "title_similarity": "0.43025348",
            "sentiment_compound": 0.0
        },
        {
            "id": "hru2815",
            "score": 1,
            "text": "The amount of homework and the early start times really killed me as a teenager. But school times are pinned to work times so I’m not sure how we could change them without some significant changes to society (which I am all in favor of). \n\nI’d also say that I would have been much more eager to go to school in the morning had I not been so overworked constantly, and absolutely would have gone under my own power without needing my parents to roust me and take me there.",
            "title_similarity": "0.78165257",
            "sentiment_compound": 0.1572
        },
        {
            "id": "hru34bk",
            "score": 1,
            "text": "If school started at 10 am. I would have not been as truant as I was.",
            "title_similarity": "0.63418674",
            "sentiment_compound": 0.0
        },
        {
            "id": "hru3a7e",
            "score": 1,
            "text": "Kids being better rested is good for them???  Who’d of guessed.\n\nNow to convince legislators.",
            "title_similarity": "0.6779436",
            "sentiment_compound": 0.8095
        },
        {
            "id": "hru3ooi",
            "score": 3,
            "text": "In New Zealand public high schools start around 8.45am (usually, could be between 8.30-9am) and finish at around 3.15pm.In Christchurch, high schools finished early on Wednesday at 2.30pm for inter school sports, anyone who didn’t do sports still got to finish then. \nI really can’t wrap my head around just how early schools start and how many after school, school related activities there are and how late they can go in America. It’s insane to me.",
            "title_similarity": "0.60471445",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hru4ibx",
            "score": 1,
            "text": "I never thought it made sense to send teenagers to school when they are tired and half asleep and then let them out at 3 when they’re wide awake, horny, and unsupervised.",
            "title_similarity": "0.6514325",
            "sentiment_compound": -0.4404
        },
        {
            "id": "hru53me",
            "score": 1,
            "text": "They've been saying this since I was in highschool. And I graduated in THE YEAR 2000!",
            "title_similarity": "0.3564765",
            "sentiment_compound": 0.0
        },
        {
            "id": "hru65rf",
            "score": 1,
            "text": "The negative health and well-being could be more related to schools having such an inability to function virtually, on average.  Teachers just are not savvy enough, generally.  There is a value to virtualizing school going forward, at least partially. \n\nAnother issue is parents use school more as a daycare than anything, and their demands for staying open and fully functioning are more related to that.",
            "title_similarity": "0.7852744",
            "sentiment_compound": -0.6124
        },
        {
            "id": "hru8e69",
            "score": 1,
            "text": "It should also, like work, be several hours shorter",
            "title_similarity": "0.5221703",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hru8kc2",
            "score": 2,
            "text": "Do children/adolescents in a natural state sleep much past sunrise? I'm a morning guy, and I pose this question in candor.\n\nFrom what I gather from my fiancée (a mental health therapist specializing with 7-14 year olds) a vast majority of school aged children (at least near Denver) are on their phones well past midnight.\n\nI'm predisposed, but it seems to that parents don't set boundaries with bed time, yet claim their kids need more time to sleep in.\n\nAm I wrong?",
            "title_similarity": "0.7022147",
            "sentiment_compound": -0.4956
        },
        {
            "id": "hru94to",
            "score": 1,
            "text": "We've known for many years that teens do better when they sleep later in the morning, but society is set up for parents to work 9-5 and those teens need to be home to watch the elementary aged kids when they get off of school. \n\nNow, if we had some sort of child care available for parents, something inexpensive or even free if the parents couldn't afford it, then we could change things so our students would do better in school. The older kids could start later and the younger kids could start earlier (which is also shown to be good for them scholastically).",
            "title_similarity": "0.84840417",
            "sentiment_compound": 0.9581
        },
        {
            "id": "hruc14m",
            "score": 1,
            "text": "Not just students. Everybody should sleep later.",
            "title_similarity": "0.43523818",
            "sentiment_compound": 0.0
        },
        {
            "id": "hruc4op",
            "score": 2,
            "text": "I'd rather go to school earlier and arrive earlier.\n\nIt's not fun to leave for school in the dark and come home in the dark during the winter. \n\nBesides, starting school later will just mean people sleep for longer, rather than being productive.",
            "title_similarity": "0.65149295",
            "sentiment_compound": -0.3724
        },
        {
            "id": "hrucqoe",
            "score": 1,
            "text": "They should start later because they don’t drink coffee, unlike adults",
            "title_similarity": "0.5392728",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrucygl",
            "score": 1,
            "text": "It’s just another product if unchecked capitalism. School starts early so parents can get to their factory shifts on time. And then school is ebbed structured to prepare them for it. Education has changed a lot since the fifties, but structure has not.",
            "title_similarity": "0.71189517",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrudicu",
            "score": 1,
            "text": "Will this bring about any change? Probably not unfortunately.",
            "title_similarity": "0.20955992",
            "sentiment_compound": 0.2584
        },
        {
            "id": "hruezpz",
            "score": 1,
            "text": "This was a well-known fact when I started high school 20 years ago.  No one cares enough to change anything.",
            "title_similarity": "0.38352814",
            "sentiment_compound": -0.569
        },
        {
            "id": "hruf3x0",
            "score": 2,
            "text": "Preface: I am talking from experience in the US school system\n\nOne thing EVERYONE seems to forget is that homework exists and students have to be in school for a certain amount of time. The idea of an 8-8-8 schedule cannot exist for students who that are having 6 hours of school + 5 hours of homework (plus time to get home + eating + other menial things). Plus you take in clubs and sports and teens don’t have the time in a day to be teens. And students HAVE to get that work done regardless of sleep because the US school system values letters and numbers over the health and well-being of their students. \n\nAnd this isn’t even talking about all the expectations many students are faced with in regards to their futures.",
            "title_similarity": "0.73571676",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hrug5sx",
            "score": 1,
            "text": "They paid people to \"prove\" this, like it was some great mystery or something?",
            "title_similarity": "0.32937932",
            "sentiment_compound": 0.7891
        },
        {
            "id": "hruhaka",
            "score": 1,
            "text": "I the Vikings were right all along",
            "title_similarity": "0.18354239",
            "sentiment_compound": 0.0
        },
        {
            "id": "hruikw6",
            "score": 1,
            "text": "I was so fortunate to go to high school at the latest starting high school in the state of Wisconsin at 8:45am.",
            "title_similarity": "0.47952136",
            "sentiment_compound": 0.5777
        },
        {
            "id": "hrukqmb",
            "score": 1,
            "text": "Well. This is known for an eternity. Especially youths are known to be more or less night active so waking up before like 8-9 is no good.",
            "title_similarity": "0.5024127",
            "sentiment_compound": 0.5597
        },
        {
            "id": "hruni9o",
            "score": 1,
            "text": "I read about this when I was in high school. 30 years ago. This isn't news it's just a reminder that schools are largely just to babysit kids so the workforce can work. Which they can't do if kids sleep in.",
            "title_similarity": "0.668046",
            "sentiment_compound": 0.0
        },
        {
            "id": "hruygd4",
            "score": 1,
            "text": "They’ve been saying this since I was in high school. It’s been over a decade. Why have they not implemented a later start time yet?",
            "title_similarity": "0.4172763",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrv1lw8",
            "score": 1,
            "text": "Does anyone truly believe this? I mean just looking at some of the kids around here, the rate of obesity has increased, the rate of mental illness has increased, the rate of depression has increased.",
            "title_similarity": "0.56555164",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hrv4nld",
            "score": 1,
            "text": "Hasn't there been studies about this for decades? I heard about this in elementary school 20+ years ago.",
            "title_similarity": "0.39802378",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrv6dml",
            "score": 1,
            "text": "Ima sleep regardless and when the teachers had a problem with it I’d go to the office and sleep",
            "title_similarity": "0.4900488",
            "sentiment_compound": -0.4019
        },
        {
            "id": "hrvazot",
            "score": 1,
            "text": "My question is: is it just a later start time, or would the same effect be had if the teenagers went to bed early?",
            "title_similarity": "0.61380875",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrvceh2",
            "score": 1,
            "text": "I agree! Why did I have to start school at 7:40 am just to be done by 1:50.",
            "title_similarity": "0.50358635",
            "sentiment_compound": 0.4199
        },
        {
            "id": "hrvdsol",
            "score": 1,
            "text": "My school starts at 8:40. Nice.",
            "title_similarity": "0.43665472",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hrvea9c",
            "score": 1,
            "text": "Unfortunately public schools function as childcare for working parents.",
            "title_similarity": "0.55460316",
            "sentiment_compound": -0.34
        },
        {
            "id": "hrvfno6",
            "score": 1,
            "text": "Wait don’t send kids to school at 7am?",
            "title_similarity": "0.37679237",
            "sentiment_compound": 0.0
        },
        {
            "id": "hrvgldg",
            "score": 1,
            "text": "The issue is the kids stay up on their computer, Xbox,  phone,etc.until 1-2am.  Yes getting up at 6-6:30 when you are going on 5 hours of sleep a night is difficult.  Bit you delay school until 9am, the kids will stay up until 3am, so all you do is move the hours of sleep,  no change the total hours of sleep. Home schooled student are either more controlled by their parents (or not controlled or taught), so their hours are probably managed by their parents.",
            "title_similarity": "0.71502095",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hrvgo9q",
            "score": 1,
            "text": "You know, people have know this for a very long time. It’s been in the literature for decades. But our education policies in the US are not about what’s best for the students. School districts/school boards are often lead my people who have never had actual education and experience in the field. It’s all about politics and money and personal advancement. And money. \nCrying’ fuckin’ shame.",
            "title_similarity": "0.5659336",
            "sentiment_compound": -0.8658
        },
        {
            "id": "hrvgsyx",
            "score": 1,
            "text": "The title claims school closures had a negative and a  positive effect on well being. Skip reading this one.",
            "title_similarity": "0.7067744",
            "sentiment_compound": 0.25
        },
        {
            "id": "hrvn9t1",
            "score": 1,
            "text": "It always stuns me how early US schools start. Most schools here start at 9, although my daughter’s middle/high school bases their methods on current research, so they start at 9:30.",
            "title_similarity": "0.5977161",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hrvrq39",
            "score": 1,
            "text": "I have been saying this for almost 40 years. The science has said this for almost as long. Teenagers especially have different internal clocks. The only reason school doesn't start later is working parents would be screwed.",
            "title_similarity": "0.65470517",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hrvz9v6",
            "score": 1,
            "text": "You should sleep late. It's much easier on your constitution.",
            "title_similarity": "0.5972815",
            "sentiment_compound": 0.4215
        },
        {
            "id": "hrwf6z2",
            "score": 1,
            "text": "the adults can keep the machine running. This has never been more clear than during covid times.",
            "title_similarity": "0.35411283",
            "sentiment_compound": -0.3401
        },
        {
            "id": "hrwszpv",
            "score": 1,
            "text": "Another study about best practices ignored completely.",
            "title_similarity": "0.36206022",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hrwwoti",
            "score": 1,
            "text": "Mathew walker talked about this extensively in his book why we sleep. If you don’t know how Important sleep is read that book it will blow your mind.",
            "title_similarity": "0.6492945",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hrx9ys1",
            "score": 1,
            "text": "tell that to the parents who have to be at work at a certain time each morning.",
            "title_similarity": "0.48216724",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hrxmt1h",
            "score": 1,
            "text": "Something like this is posted every year.\n\nSchool should start later, work should be shorter, etc etc.\n\nHowever, I have 0 faith it would even be implemented because people can’t stand, and I mean CANNOT stand, even the slightest deviation from their norm. \n\nSo unfortunately this always falls on deaf ears and we’ll just keep doing harm to people because some shmuck is always going to pull the “WELL I DID IT AND IM FINE” line.",
            "title_similarity": "0.6443656",
            "sentiment_compound": -0.3218
        },
        {
            "id": "hrxunio",
            "score": 1,
            "text": "Soon they will accommodate what students co.plain about to the point where they learn how to read and count to 100 = graduated college.  Back social media apps...........",
            "title_similarity": "0.5024353",
            "sentiment_compound": 0.0
        },
        {
            "id": "hs3ymth",
            "score": 1,
            "text": "I was in high school from 1996 to 2000. They had studies saying high school started too early back then. The research isn't enough to move policymakers. There needs to be activism.",
            "title_similarity": "0.68548197",
            "sentiment_compound": 0.0
        },
        {
            "id": "hsh2mcu",
            "score": 1,
            "text": "How about going to sleep earlier?",
            "title_similarity": "0.3573619",
            "sentiment_compound": 0.0
        }
    ]
}