{
    "Chemical pollution has passed safe limit for humanity, say scientists\n": [
        {
            "id": "ht5wjof",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.48423123",
            "sentiment_compound": 0.7088
        },
        {
            "id": "ht7aqdy",
            "score": 1,
            "text": "[deleted]",
            "title_similarity": "0.17558897"
        },
        {
            "id": "ht64obw",
            "score": -17,
            "text": "The earth is overpopulated. Period.",
            "title_similarity": "0.21432355",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6gngh",
            "score": 5,
            "text": "I'm so glad I don't have kids.",
            "title_similarity": "0.45063496",
            "sentiment_compound": 0.5095
        },
        {
            "id": "ht6ok40",
            "score": 0,
            "text": "Honestly, we deserve what we're going to get.",
            "title_similarity": "0.3982467",
            "sentiment_compound": 0.4588
        },
        {
            "id": "ht6q8hz",
            "score": 1,
            "text": "And? Nothing is stopping this capitalist hellstorm until it fails",
            "title_similarity": "0.5124991",
            "sentiment_compound": -0.3304
        },
        {
            "id": "ht6jwun",
            "score": -22,
            "text": "[removed]",
            "title_similarity": "0.14494684"
        },
        {
            "id": "ht5yug2",
            "score": -17,
            "text": "... and it is too late to change anything.",
            "title_similarity": "0.30222398",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht62wp1",
            "score": -3,
            "text": "[removed]",
            "title_similarity": "0.14494684"
        },
        {
            "id": "ht678i9",
            "score": -10,
            "text": "The human race will need to become extinct for this planet to recover and it’ll take tens of thousands of years for it to do that after we’re gone. Chernobyl area alone will take 50k yrs.",
            "title_similarity": "0.44757688",
            "sentiment_compound": -0.25
        },
        {
            "id": "ht65eqj",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "0.14494684"
        },
        {
            "id": "ht65a2u",
            "score": 5,
            "text": "now we know why we cant or will never find any aliens out there.\n\nthey all killed themselves via pollution, war, or my fave... social media.",
            "title_similarity": "0.4846987",
            "sentiment_compound": -0.7579
        },
        {
            "id": "ht691to",
            "score": 5,
            "text": "\"Yeah? We'll that's just, like, your opinion man\" - Republicans probably",
            "title_similarity": "0.42496157",
            "sentiment_compound": 0.5719
        },
        {
            "id": "ht6etr6",
            "score": -2,
            "text": "You can have your fancy things and this pollution or you can not have your fancy things and probably still have this pollution. Choose one and stop whinging.",
            "title_similarity": "0.52782935",
            "sentiment_compound": -0.296
        },
        {
            "id": "ht6k1b6",
            "score": 1,
            "text": "Have you ever tried to be on a diet but you say to yourself, \"you're going to die anyway... you are already fat and McDonald tastes great\" so you end up eating more? Well that is how I'm starting to feel about this like... Yeah we are going to die  we are doomed whatever I don't care.",
            "title_similarity": "0.45544204",
            "sentiment_compound": -0.7643
        },
        {
            "id": "ht727qr",
            "score": 2,
            "text": "Sometimes I think, what if the Europeans didn’t find America. I’d think my family would’ve been better off.",
            "title_similarity": "0.48580664",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ht71jjq",
            "score": 8,
            "text": "Capitalism doesn't care.  Them businessmen gotta squeeze every last drop out,  even if it kills their grandchildren.",
            "title_similarity": "0.4812435",
            "sentiment_compound": -0.8035
        },
        {
            "id": "ht6f71q",
            "score": 3,
            "text": "Micro-plastics are gonna kill us",
            "title_similarity": "0.46120986",
            "sentiment_compound": -0.6908
        },
        {
            "id": "ht6h58j",
            "score": 3,
            "text": "Human survival is dependent on humans acting in our best interest as a species.\n\nIn other words, we're fucked.",
            "title_similarity": "0.44826794",
            "sentiment_compound": 0.4215
        },
        {
            "id": "ht7gxm6",
            "score": 1,
            "text": "\"But we would lose profits if we had to reduce pollution.\"\n\n\"Don't you mean you'd lose money instead of making profits?\"\n\n\"Oh, heavens, no. Obviously we'd still make massive profits. I mean that we wouldn't make ever increasing profits. Instead of a 30% margin, it would be like 20%. We can't have any of that.\"\n\n\"But, you're killing all life on the planet!\"\n\n\"Well, I'm beholden to my investors and...\"\n\n&#x200B;\n\nNarrator: \"And then everyone died forever and ever.\"",
            "title_similarity": "0.5730374",
            "sentiment_compound": 0.722
        },
        {
            "id": "ht7krf4",
            "score": 1,
            "text": "But what about billionaires and their stock?",
            "title_similarity": "0.31716877",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6gtys",
            "score": -18,
            "text": "[removed]",
            "title_similarity": "0.14494684"
        },
        {
            "id": "ht6bweg",
            "score": 27,
            "text": "i'm in law school and when I see stuff like this I get really sad because I wonder if i'm wasting my time in a long term degree when I might not even live to see retirement.",
            "title_similarity": "0.37126958",
            "sentiment_compound": -0.5563
        },
        {
            "id": "ht7d5ro",
            "score": 2,
            "text": "Yea you can't even drink from freshwater streams anymore. Or a garden hose if you get well water. Poor kids.",
            "title_similarity": "0.33917424",
            "sentiment_compound": -0.25
        },
        {
            "id": "ht65bot",
            "score": -19,
            "text": "And tell me Mr scientist, who invented these chemicals?",
            "title_similarity": "0.5645237",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht67nyf",
            "score": 22,
            "text": "Have we tried just not looking up?",
            "title_similarity": "0.14391837",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6av9i",
            "score": 47,
            "text": "[removed]",
            "title_similarity": "0.14494684"
        },
        {
            "id": "ht62n6c",
            "score": 337,
            "text": "No offense to the Guardian, but there probably was never a safe period since we industrialised. Romans had 10x the lead, Londoners regularly had 'pea soup' chemical fogs, rivers were much worse, loads more acid rain. Pesticides were based on lead and arsenic.\n\nIn most aspects pollution has improved, with main exception of more and more newly introduced pollutants like microplastics and various nano materials. Increases in diesel engines has probably been harmful but are on their way out.\n\nI think in the domain of pesticides the issue here is that the active is tested but not the formulation, which means they can be orders of magnitude more toxic than realised, and we have synergy that is affecting wildlife. In developing countries pollution is often terrible.\n\nIn terms of the impact to nature, this is a different story. \n\nBut we can solve this by creating an economy that wants to collect plastic.\n\nIts simple, pay people to collect and return it to the shop or the distributer. The economic costs would be huge, though, no? I don't think so. I think the economic benefits will outweigh the costs. The solution would be to pass the collected plastic to local manufacturers for free, as long as they can use it efficiently along with renewable energy and recycle it mostly for things used by the local economy. \n\nMost western and consumer countries run a trade deficit and in the long run this is a threat to economic growth. Bringing back manufacturing, as green manufacturing creates jobs and this can help pay for the collection overhead.\n\nWe currently spend billions on building roads, which is another environmentally destructive activity. Its been shown in several studies (don't ask me for them, they aren't easily found on the internet) that after a point, which we have already crossed, that building more roads is economically negative and increases congestion more than the capacity added, because the construction of new roads initially greatly increases average speed, businesses and residents relocate in a sprawling and inefficient fashion, increasing average distance travelled and cost of living. Then the congestion returns and further economic costs of time wasted in travel.\n\nSo, by switching from road building (BTW, the major highway network construction programs were successfully promoted by oil companies) to paying people to collect waste you have improved economic and environmental benefits - a double bubble, for no extra cost or taxation burden. By paying people already going to a supermarket to take in their packaging waste you distribute economic benefits more evenly.",
            "title_similarity": "0.6563337",
            "sentiment_compound": 0.8627
        },
        {
            "id": "ht6f10i",
            "score": 4,
            "text": "Is there more bad news for humanity than ever before? Or are we just more aware of it?",
            "title_similarity": "0.49519897",
            "sentiment_compound": -0.6313
        },
        {
            "id": "ht6f7zb",
            "score": 3,
            "text": "Humanity has passed the safe level for humanity, let's be honest.",
            "title_similarity": "0.7642602",
            "sentiment_compound": 0.7351
        },
        {
            "id": "ht6lqgl",
            "score": -4,
            "text": "Cool. Can we give up now?",
            "title_similarity": "0.2887537",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ht715bm",
            "score": 3,
            "text": "Have these scientists collectively assessed the pollution output of the recent Tonga volcanic eruption and accounted for this in their chemical pollution findings?",
            "title_similarity": "0.61201215",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht7bdw8",
            "score": 3,
            "text": "Easy way to fix that, just don’t have kids.",
            "title_similarity": "0.42622715",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ht6d6hz",
            "score": 0,
            "text": "[removed]",
            "title_similarity": "0.14494684"
        },
        {
            "id": "ht6gho1",
            "score": -6,
            "text": "We don't deserve this planet anyways. I've come to accept that, thanks Reddit.",
            "title_similarity": "0.535453",
            "sentiment_compound": 0.6705
        },
        {
            "id": "ht6ispo",
            "score": 0,
            "text": "We all going to die. Got it",
            "title_similarity": "0.32312638",
            "sentiment_compound": -0.5994
        },
        {
            "id": "ht6qcvl",
            "score": 0,
            "text": "Maybe we must just start over, back to the basics as a wise man once said.",
            "title_similarity": "0.4963438",
            "sentiment_compound": 0.4767
        },
        {
            "id": "ht6wkyd",
            "score": 0,
            "text": "I've given up on thinking about this. I just want to party and not have kids now.\n\nMay God help us all.",
            "title_similarity": "0.37203872",
            "sentiment_compound": 0.7783
        },
        {
            "id": "ht924br",
            "score": 0,
            "text": "Have we just decided to Speedrun exinction",
            "title_similarity": "0.32536882",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht92ns2",
            "score": 0,
            "text": "The only right answer is to colonize other planets.. so that we have another 1000 or so years before we destroy those.. rinse/repeat.. but with only one planet and two moons viable.. we better figure out FTL in the next 200 years or so.. or humans at least in this solar system will be gone for good.",
            "title_similarity": "0.5489428",
            "sentiment_compound": 0.7543
        },
        {
            "id": "ht9gfqm",
            "score": 0,
            "text": "If mircroplastics make up one part per billion of everything, including what you ingest. And assuming the body cant break it down and holds it somewhere. By the time you are 30 you are made up of 0.01% plastic",
            "title_similarity": "0.5170712",
            "sentiment_compound": 0.0
        },
        {
            "id": "hta2bnl",
            "score": 0,
            "text": "Jokes on y'all I welcome death",
            "title_similarity": "0.40918797",
            "sentiment_compound": 0.0258
        },
        {
            "id": "ht68q5i",
            "score": 12,
            "text": ".. what's gonna kill humanity first?",
            "title_similarity": "0.35796428",
            "sentiment_compound": -0.6908
        },
        {
            "id": "ht65l0k",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.17558897"
        },
        {
            "id": "ht69y8e",
            "score": -1,
            "text": "t is pretty cool if you look t this news in the light of a science fiction writing prompt.  \"A shapeshifting race of lizard people want to terraform and cleanse a planet of a hostile lifeform.\"",
            "title_similarity": "0.5134514",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ht9988n",
            "score": 1,
            "text": "This is why I can’t in good conscience have a child.\n\nI will adopt or foster because I want kids so bad.\n\nBut geez. I can’t bring another life into this corrupt and intoxicated world. There is no healthy future for our environment. It’s so so so heartbreaking and so sad.",
            "title_similarity": "0.3402174",
            "sentiment_compound": -0.9407
        },
        {
            "id": "ht99sm1",
            "score": 1,
            "text": "Well, just hope we get our head out of our asses and start doing something about it. It's so sad, we are still discussing business models, cryptocurrency, tax wars sponsored by taxes. Democracy, religion...we are the only species on the planet that actively kills itself and continue to do it while not accepting facts...the irony! When we all die we will finally give back what we have taken out of the earth at least Carbon, hydrogen, Oxygen and nitrogen and water",
            "title_similarity": "0.5604304",
            "sentiment_compound": -0.9005
        },
        {
            "id": "ht9o1r9",
            "score": -1,
            "text": "Everything is chemicals... This sub is such a joke.",
            "title_similarity": "0.456286",
            "sentiment_compound": 0.296
        },
        {
            "id": "htaks05",
            "score": -1,
            "text": "So, are we done for, finished?",
            "title_similarity": "0.33665037",
            "sentiment_compound": 0.0
        },
        {
            "id": "htbyw5n",
            "score": -1,
            "text": "So when will people start dying out by the millions each day?",
            "title_similarity": "0.38881376",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6bg6o",
            "score": 8,
            "text": "The solution would require a drastic change in the world’s society. Unity between governments and peoples.\n\nSince that’s a pipe dream we better hope some technology is released that will save our asses",
            "title_similarity": "0.6008044",
            "sentiment_compound": 0.9062
        },
        {
            "id": "ht6gy6x",
            "score": 9,
            "text": "Why do I feel like each day we step closer to some kind of headline saying we all have 3 years to live before we feel the effects of disease from all the plastic we have ingested and are doomed to some horrible death?",
            "title_similarity": "0.49690437",
            "sentiment_compound": -0.8779
        },
        {
            "id": "ht6d9km",
            "score": 6,
            "text": "Don’t look up has really changed the way I look at these things",
            "title_similarity": "0.21104443",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6er19",
            "score": 9,
            "text": "And now Russia want to go make it worse by starting war for more power and money, ostensibly on behalf of oligarch billionaires who will never have enough.\n\nMeanwhile in the west our oligarchs toodling around in Spaceships.\n\nMaybe that should be Netfix’s next political commentary piece: “Space is Not Enough; Don’t Look Up, Deux.”",
            "title_similarity": "0.4074794",
            "sentiment_compound": -0.7717
        },
        {
            "id": "ht6x91j",
            "score": 8,
            "text": "This paper is exceptionally vague and problematic.  The idea that you can collectively set a limit on \"novel entities\" is absurd.  Each chemical needs to be evaluated individually for its environmental impact and where applicable grouped with related chemicals/impacts.  Climate change works this way: CO2, CH4, H2O, etc.",
            "title_similarity": "0.5266104",
            "sentiment_compound": -0.3729
        },
        {
            "id": "ht6779j",
            "score": 48,
            "text": "Feels like humanity has generally passed the safe limit for humanity at this point.",
            "title_similarity": "0.68323314",
            "sentiment_compound": 0.6597
        },
        {
            "id": "ht644re",
            "score": 525,
            "text": "And obviously nothing is going to be done because governments and large companies can't be bothered to put the money into solving the issue",
            "title_similarity": "0.36096805",
            "sentiment_compound": 0.5207
        },
        {
            "id": "ht6cotk",
            "score": -2,
            "text": "*giggles* \"were in danger\"",
            "title_similarity": "0.26814696",
            "sentiment_compound": -0.3818
        },
        {
            "id": "ht6ef3k",
            "score": -2,
            "text": "Well we had a good run earth, here's hoping Mars is better!",
            "title_similarity": "0.5971334",
            "sentiment_compound": 0.8748
        },
        {
            "id": "ht6hjxi",
            "score": -2,
            "text": "This has to stop, this year. If we don't begin taking Andreas Malm's ideas seriously at this point, we are 100% going to face mass extinction with no way to avert it. If there has ever been any justifiable excuse for war, and there hasn't, it's this.",
            "title_similarity": "0.52519405",
            "sentiment_compound": -0.8555
        },
        {
            "id": "ht6rskm",
            "score": 2,
            "text": "Mind blowing how cool we are with causing our own extinction. The elites must know something we dont",
            "title_similarity": "0.6563078",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ht7cp1x",
            "score": 2,
            "text": "Y’all gonna see a daybreak scenario where some eco fascists create a polycarbon eating nano bot or amoeba that wipes out modern tech as we know it",
            "title_similarity": "0.4850737",
            "sentiment_compound": 0.0772
        },
        {
            "id": "ht8iply",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "0.14494684"
        },
        {
            "id": "ht9jjqw",
            "score": 2,
            "text": "Had a class on pollution in college. Some days we’d come in and the things that were said were genuinely terrifying. 97% of pollution comes from industry, only 3% is what we see as consumers. If every person in the world stopped producing waste today, we’d only solve 3% of the problem...",
            "title_similarity": "0.5670365",
            "sentiment_compound": -0.8519
        },
        {
            "id": "ht685pw",
            "score": 20,
            "text": "Nothing will happen until there is a cataclysmic event.",
            "title_similarity": "0.40548533",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6da7b",
            "score": 2,
            "text": "I wonder if this is why I throw up when my dust and mold allergies act up (which is often, living by the coast). Legit had an allergy appointment yesterday and the nausea baffled my doctor. Maybe I'm a lucky person who gets sick cuz of the chemicals. In fact I've resorted to sleeping in a mask sometimes (which helps yet my doc doesn't want me doing for a couple reasons). At any rate, I wonder when allergists will start picking up on this.",
            "title_similarity": "0.5328793",
            "sentiment_compound": 0.2211
        },
        {
            "id": "ht6biw0",
            "score": -4,
            "text": "[deleted]",
            "title_similarity": "0.17558897"
        },
        {
            "id": "ht6grbk",
            "score": 4,
            "text": "Its the way it is. To bad, we had a chance and all of us collectively **** ourselves beyond help.",
            "title_similarity": "0.47532862",
            "sentiment_compound": 0.0516
        },
        {
            "id": "ht6j21d",
            "score": 4,
            "text": "that's some r/collapse material.",
            "title_similarity": "0.25759375",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6rrqp",
            "score": 5,
            "text": "It's fine, says Billionare who profits from lax regulations.\n\nAnd so, nothing was done.",
            "title_similarity": "0.63266784",
            "sentiment_compound": 0.5719
        },
        {
            "id": "ht6cphd",
            "score": 31,
            "text": "I'm fine with this, I'll just find scientists that say the opposite, and then somehow become a prominent politician for some reason",
            "title_similarity": "0.56066406",
            "sentiment_compound": 0.4767
        },
        {
            "id": "ht6l4p4",
            "score": 16,
            "text": "*Bezos, Musk, and Branson warm up their space shuttles*",
            "title_similarity": "0.30473554",
            "sentiment_compound": 0.2263
        },
        {
            "id": "ht72oj8",
            "score": 7,
            "text": "This is where we create nanomachines to break down all plastics in the world. this also leads to the eventual grey goo apocalypse.",
            "title_similarity": "0.43448436",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ht61agx",
            "score": 93,
            "text": "[removed]",
            "title_similarity": "0.14494684"
        },
        {
            "id": "ht5zj1n",
            "score": 126,
            "text": "[removed]",
            "title_similarity": "0.14494684"
        },
        {
            "id": "ht6otzn",
            "score": 7,
            "text": "But we the people need to sacrifice so these billion dollar companies can continue to make ridiculous amount of $$$ at the cost of our planets and our health right",
            "title_similarity": "0.49907088",
            "sentiment_compound": -0.5023
        },
        {
            "id": "ht79sju",
            "score": 6,
            "text": "If I don’t die from being impoverished, I’m gonna die from the chemical pollution. Or being scorched/frozen to death by the extreme weather conditions during the climate catastrophe. Great…",
            "title_similarity": "0.5335201",
            "sentiment_compound": -0.9524
        },
        {
            "id": "ht6ds0m",
            "score": 181,
            "text": "Donate to places like TeamSeas that are proactively removing garbage and plastics from the ocean. So far, in the span of about 6-ish months, they have removed over 30 million pounds of trash from the ocean. \n\n[https://teamseas.org/](https://teamseas.org/)\n\n[https://teamtrees.org/](https://teamtrees.org/)\n\n&#x200B;\n\nThese are both spearheaded by Youtubers: Mark Rober, and Mr. Beast. It's drops in the bucket, sure, but it's better than doing nothing.",
            "title_similarity": "0.50460964",
            "sentiment_compound": 0.7391
        },
        {
            "id": "ht66bbg",
            "score": 10,
            "text": "This likely happened 30 years ago",
            "title_similarity": "0.2695448",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6l1gn",
            "score": -9,
            "text": "Honestly, I know this sounds stupid, but I think cancer is just plastic binding with our body on a molecular level.",
            "title_similarity": "0.5764058",
            "sentiment_compound": -0.8074
        },
        {
            "id": "ht6brzx",
            "score": 898,
            "text": "People with young children...How do you feel about the world your kids will inherit? I don't think our parents (33 male here) really considered the environment, but now most of us do.",
            "title_similarity": "0.46293837",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6j1zv",
            "score": 13,
            "text": "“The only way to keep a cool head is to adopt an apocalyptic stance today…” Zizek",
            "title_similarity": "0.48870182",
            "sentiment_compound": -0.34
        },
        {
            "id": "ht5xd77",
            "score": 2145,
            "text": "Words words words, but no action! The leaders of this world are pathetic",
            "title_similarity": "0.32955638",
            "sentiment_compound": -0.8459
        },
        {
            "id": "ht6hic0",
            "score": 47,
            "text": "If anyone is still around in a few millenia they'll find a thin layer of hydrocarbons, bones, and sand marking the beginning and end of the Plasticene.",
            "title_similarity": "0.45669597",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht62gms",
            "score": 172,
            "text": "It was always going to happen eventually. No one had a problem with this pollution that is definitive, until we got to the point, we knew that will come. I mean... there is something really wrong with our civilization, that makes us hit every dark prediction one after another.",
            "title_similarity": "0.5836786",
            "sentiment_compound": -0.807
        },
        {
            "id": "ht6535l",
            "score": 271,
            "text": "The [full study](https://pubs.acs.org/doi/10.1021/acs.est.1c04158) itself.\n\n> **We submit that the safe operating space of the planetary boundary of novel entities is exceeded since annual production and releases are increasing at a pace that outstrips the global capacity for assessment and monitoring**. The novel entities boundary in the planetary boundaries framework refers to entities that are novel in a geological sense and that could have large-scale impacts that threaten the integrity of Earth system processes. We review the scientific literature relevant to quantifying the boundary for novel entities and highlight plastic pollution as a particular aspect of high concern. An impact pathway from production of novel entities to impacts on Earth system processes is presented. We define and apply three criteria for assessment of the suitability of control variables for the boundary: feasibility, relevance, and comprehensiveness. We propose several complementary control variables to capture the complexity of this boundary, while acknowledging major data limitations.\n>\n> We conclude that humanity is currently operating outside the planetary boundary based on the weight-of-evidence for several of these control variables. The increasing rate of production and releases of larger volumes and higher numbers of novel entities with diverse risk potentials exceed societies’ ability to conduct safety related assessments and monitoring. We recommend taking urgent action to reduce the harm associated with exceeding the boundary by reducing the production and releases of novel entities, noting that even so, the persistence of many novel entities and/or their associated effects will continue to pose a threat.\n\nSome interesting details.\n\n>  Production of novel entities is rapidly increasing. The chemical industry is the second largest manufacturing industry globally. **Global production increased 50-fold since 1950, and is projected to triple again by 2050 compared to 2010**. Material extraction as feed stocks for novel entities was approximately 92 billion tonnes globally in 2017, and is projected to reach 190 billion tonnes by 2060.\n>\n> **There are an estimated 350 000 chemicals (or mixtures of chemicals) on the global market**. Nearly 70 000 have been registered in the past decade; many chemicals (nearly 30 000) have only been registered in emerging economies, where chemical production has increased rapidly, but chemicals management and disposal capacity often are limited. The production of intended chemicals entails the unintended production of byproducts, transformation products, and impurities which may not be considered under chemicals assessments and management measures.\n\nAnd yet\n\n> Reliable information for the various relevant aspects that describe more or less the entire impact pathway along the chemical’s life cycle is not available for most chemicals. **However, the total cumulative chemical pressure on biosphere integrity is likely to be dominated by a limited number of chemicals** (reflecting the quantities produced, used and released to the environment in combination with the inherent characteristics of the chemicals like persistence, mobility and toxicity). Posthuma and colleagues **investigated the toxicity pressure from more than 12 000 chemicals in over 22 000 European water bodies and found that 15 compounds explained nearly 99.5% of the cumulative ecotoxicity pressure**. Walters et al. modeled the biomagnification potential of organic chemicals, thus contributing with another tool for screening. While such studies are based on modeling with several limitations such as the interaction of novel entities, the approach could help to prioritize substance classes, regional patterns, or effect trends. \n>\n> To make the monitoring of the planetary boundary operational, chemicals that dominate cumulative impacts could be used as “indicator” chemicals. These would be identified in a prescreening process, combining estimates for production volume or capacity (e.g., market statistics) with environmental persistence (e.g., using the inverse of degradation half-life estimates as proxy) and impact potency (e.g., chronic ecotoxicity test data). To consider the transformation of various chemicals into persistent transformation products, total production data could be combined with metabolism rates for chemicals that contribute to the formation of such persistent “indicator” chemicals. And finally, the ratio of the cumulative chemical impact and the available space within the boundary for a given biosphere compartment could define whether the boundary is transgressed and to what extent, while allowing the main contributing chemicals to be identified.\n\nAnd this.\n\n> Another effect-focused control variable could consider plastics’ disturbances to biosphere integrity, through physical and toxic effects of plastics and resulting changes in species distribution. **While the perception of impacts of marine debris is larger than the accumulated evidence of ecological impacts, reviews and meta-analyses of published experimental data show that microplastics do have negative effects in numerous species**. Impacts of microplastics on individual organisms and communities have been studied using numerous laboratory models, providing understanding of mechanisms of toxicity in marine organisms ranging from zooplankton to large vertebrates. Although there are still mismatches between the concentrations and types of microplastics documented in the environment and those used in laboratory effect studies, meta-analyses allow for some generalized understanding of the toxicity of microplastic particles. Newly developed mathematical models account for the large diversity in microplastic particles themselves, by applying extrapolation factors to account for underestimation in concentrations, and including species sensitivity distribution based on ecotoxicity data, allowing for more robust comparison of data sets.\n>\n> Traditional risk assessment of chemical substances uses the ratio between predicted environmental concentration versus a predicted no effect concentration (PEC/PNEC), an approach that has been applied to microplastics exposure scenarios, **finding that 0.17% of global ocean surface waters are at risk, and increasing to 1.62% by the end of the century**. Additionally, the limitations inherent to commonly used sampling methods (i.e., focusing on larger sized-microparticles), together with technical limitations in detecting smaller, nanoscale particles, **are likely leading to an underestimation of the concentrations of both micro- and nanoplastics in the environment,  indicating that exposures and therefore risks are likely larger**. Furthermore, the seafloor and sediments are thought to be the ultimate sink for plastics, through uptake in marine ecosystems and changes in particle density and sinking rates due to biofouling, so these niches and the organisms inhabiting them are predicted to suffer higher exposures. Quantifying these environmental concentrations, exposure routes and ecological fates (including additional niches) requires more data, and will be important for assessing exposure scenarios driving disturbances to biosphere integrity. Several different approaches could be applied to deal with data gaps. A toxicity-based threshold would be set at PEC/PNEC = 1, with NE-PB exceedances already evident in several regions. However, additional deliberations would be necessary for considering changes in distribution of species or sensitivities, moving beyond toxicity to biodiversity and functionality.",
            "title_similarity": "0.5676957",
            "sentiment_compound": -0.5798
        },
        {
            "id": "ht6ts6r",
            "score": 27,
            "text": "There is no end to the production either. I hate how the planet was destroyed out of greed.",
            "title_similarity": "0.47392872",
            "sentiment_compound": -0.8957
        },
        {
            "id": "ht6kl6i",
            "score": 68,
            "text": "[removed]",
            "title_similarity": "0.14494684"
        },
        {
            "id": "ht6ooi3",
            "score": 447,
            "text": "What’s sad is that nobody will listen to the scientific warning. Everyone is fixated on wants, at all costs. Governments are too busy infighting and taking kickbacks from the corporations. Most first world countries just want their stuff, so they shift there production to third world countries that are so corrupt with almost zero regulations that pollute the earth like it’s no big deal. Look at North America, we shifted most of our manufacturing to China so we could say, see pollution numbers are down, look what we did. When in fact they transferred their pollution to China, India, Indonesia, etc. Very sad to read this.",
            "title_similarity": "0.49140513",
            "sentiment_compound": -0.8908
        },
        {
            "id": "ht67jww",
            "score": 60,
            "text": "I used to eat lots of mussels. I’m 59. Lord only knows how much of me is plastic.",
            "title_similarity": "0.32403934",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht5z0w8",
            "score": 3680,
            "text": "it reminds me of something I read from K. Vonnegut:\n\n“Kilgore Trout once wrote a short story which was a dialogue between two pieces of yeast. They were discussing the possible purposes of life as they ate sugar and suffocated in their own excrement. Because of their limited intelligence, they never came close to guessing that they were making champagne.”\n\nexcept we're killing ourselves and everything else on a planetary scale and there won't be champagne at the end, just heaps of rubbish in the desert",
            "title_similarity": "0.42416304",
            "sentiment_compound": -0.6234
        },
        {
            "id": "ht66cty",
            "score": 2469,
            "text": "I just watched Dark Waters and the danger of PFOA C-8 and teflon and stuff, i'd will stay clear of any non-stick, water repellant object in the future. Crazy to think 99% of the living thing have it inside of them",
            "title_similarity": "0.5264833",
            "sentiment_compound": -0.4939
        },
        {
            "id": "ht6oegj",
            "score": 901,
            "text": "Speaking of.. my neighbors have poured gallons of scented/perfumed chemical liquids off their balcony to combat \"smokers, covid and make the world smell better\" to a point where people and animals are getting Ill\n\nThe police, city, and even condo management won't even do anything and would rather people quit smoking and vaping inside and outside their units, as to not disturb the psychopaths. \n\nYay Canada",
            "title_similarity": "0.44278103",
            "sentiment_compound": 0.52
        },
        {
            "id": "ht6biig",
            "score": 292,
            "text": "Is there a reason we can’t just revert back to glass over plastic?",
            "title_similarity": "0.30818176",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht68bz6",
            "score": 1371,
            "text": "[removed]",
            "title_similarity": "0.14494684"
        },
        {
            "id": "ht6lu5f",
            "score": 153,
            "text": "Treating the Earth like a chemical toilet since the industrial revolution is a bad thing? Who knew./s",
            "title_similarity": "0.5856133",
            "sentiment_compound": -0.25
        },
        {
            "id": "ht5x349",
            "score": 18407,
            "text": " “...the total mass of plastics now exceeds the total mass of all living mammals.\" Well now that's a thoroughly depressing statistic.",
            "title_similarity": "0.4356464",
            "sentiment_compound": -0.2006
        },
        {
            "id": "ht665s4",
            "score": 1,
            "text": "…Add it to the pile. No, not THAT pile, the one next to it!",
            "title_similarity": "0.28479326",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht69j9d",
            "score": 1,
            "text": "Then stop shitting all over to steal a dollar.",
            "title_similarity": "0.41595417",
            "sentiment_compound": -0.802
        },
        {
            "id": "ht6b6v9",
            "score": 2,
            "text": "I'm sure this is just a natural process completely unrelated to human industry",
            "title_similarity": "0.38729894",
            "sentiment_compound": 0.5859
        },
        {
            "id": "ht6bhvr",
            "score": 1,
            "text": "Time to buy another gun…",
            "title_similarity": "0.25607562",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6c4vd",
            "score": 1,
            "text": "We should collect all the mask floating in our oceans and make one giant earth mask.",
            "title_similarity": "0.3553234",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6cp71",
            "score": 1,
            "text": "*phew*... I'm glad we passed, could you imagine if we failed?",
            "title_similarity": "0.6131838",
            "sentiment_compound": -0.0772
        },
        {
            "id": "ht6do1t",
            "score": 1,
            "text": "Who could have ever seen this coming",
            "title_similarity": "0.22538775",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6dok6",
            "score": 1,
            "text": "But and here me out here line go up",
            "title_similarity": "0.09442435",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6esc1",
            "score": 2,
            "text": "So uh the governments are going to implement new regulations to do something about it right? Right?",
            "title_similarity": "0.4544006",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6ey9c",
            "score": 2,
            "text": "Wait until the millions upon millions of electric car batteries begin to leach…not to mention the pollution from mining the elements they require - some very toxic and persistent pollutants. E cars are good in theory, we just need better technology for powering them",
            "title_similarity": "0.6460901",
            "sentiment_compound": 0.7003
        },
        {
            "id": "ht6fd0m",
            "score": 7,
            "text": "But think of the profits! \\*lights cigar\\*",
            "title_similarity": "0.37399974",
            "sentiment_compound": 0.63
        },
        {
            "id": "ht6fg3y",
            "score": 1,
            "text": "Most governments: Oh really? How dire, let's tax everyone. Anyway.",
            "title_similarity": "0.44433618",
            "sentiment_compound": -0.507
        },
        {
            "id": "ht6fq4r",
            "score": 2,
            "text": "The great filter seems like it’s a head of us.",
            "title_similarity": "0.34894705",
            "sentiment_compound": 0.765
        },
        {
            "id": "ht6fxrg",
            "score": 1,
            "text": "Now who wants to start the band \"Chemical Pollution\" with me?",
            "title_similarity": "0.43807477",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6g2h0",
            "score": 1,
            "text": "The earth doesn’t have a warning bell more useful than it’s inhabitants dying of cancer and want. Think twice before you buy plastic. Recycling is broken. Reduce. Reuse. Trade. Boycott. Plan.",
            "title_similarity": "0.5861275",
            "sentiment_compound": -0.8275
        },
        {
            "id": "ht6gfe0",
            "score": 1,
            "text": "so we can expect more weird mutations to our genome then",
            "title_similarity": "0.40839478",
            "sentiment_compound": -0.2484
        },
        {
            "id": "ht6gzu6",
            "score": 1,
            "text": "...but....profit margins....",
            "title_similarity": "0.30238003",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6hd00",
            "score": 1,
            "text": "And to think most of us will still be around in 2050. Now that's going to be a crazy time. And if we don't have aliens by then , I'll be super pissed off.",
            "title_similarity": "0.46565652",
            "sentiment_compound": -0.4019
        },
        {
            "id": "ht6hmvi",
            "score": 1,
            "text": "Oh darn. I should have recycled and done my part.",
            "title_similarity": "0.500005",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6ht4f",
            "score": 1,
            "text": "I see this stuff every week.",
            "title_similarity": "0.20901522",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6i7li",
            "score": 1,
            "text": "That's pretty metal, at least",
            "title_similarity": "0.3722852",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ht6i9c8",
            "score": 2,
            "text": "\"It's time for an environmental apocalypse.\"\n\n\"You've already had an environmental apocalypse.\"\n\n\"Yes but what about *second* environmental apocalypse.\"!",
            "title_similarity": "0.49663973",
            "sentiment_compound": 0.2828
        },
        {
            "id": "ht6ip1b",
            "score": 1,
            "text": "So, the solution to pollution isn’t dilution?",
            "title_similarity": "0.4713415",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ht6ir8u",
            "score": 1,
            "text": "I guess we are living in a Barbie world.",
            "title_similarity": "0.27365273",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6j1sx",
            "score": 10,
            "text": "Sweet! Manmade horrors beyond my comprehension!",
            "title_similarity": "0.29565516",
            "sentiment_compound": -0.3147
        },
        {
            "id": "ht6jf4u",
            "score": 1,
            "text": "they kept saying all the levels were safe, but refused to look into the accumulation over decades.\n\ntechnology won't solve something until it's profitable, and even then it's never profitable to give it away. \n\nit's our economic system that is the culprit. it is our leaders and our business tycoons that are the results of the system they built, tweak and protect to keep them in profits. we need to break the system by the only means it has ever been done before, but that is too scary, so just enjoy what you have while you have it. forget a rosy future, war and death is the only guarantee.\n\nenvironmentalists and eco conscious consumers for the last 80 years have achieved nothing of note because it's not profitable to be so. changing your habits won't achieve a god damn thing except make the niche profit seeker more profits. as long as life is about profit, life won't get better for those without profits, and by the nature of profits there will never be enough for all to have the same good life.",
            "title_similarity": "0.5754503",
            "sentiment_compound": 0.1808
        },
        {
            "id": "ht6jg9b",
            "score": 1,
            "text": "Those responsible will live fat and happy in their bunkers. Change doesn’t happen until the metaphorical (or physical) guillotine comes out.",
            "title_similarity": "0.5234168",
            "sentiment_compound": 0.7184
        },
        {
            "id": "ht6jnlx",
            "score": 1,
            "text": "Phew, I'm glad we made it passed the safe threshold!",
            "title_similarity": "0.59093714",
            "sentiment_compound": 0.7345
        },
        {
            "id": "ht6kcw8",
            "score": 1,
            "text": "Yaaaay! Ive already bought my body bag. Just waiting for the end :) woot! Cant do anything about it yaaay! Wish i could i have a million ideas but I am POOOOOOR YAAAAAAY! See you all in hell in like 6 years when this place turns into a literal hell.",
            "title_similarity": "0.39131236",
            "sentiment_compound": -0.8741
        },
        {
            "id": "ht6klff",
            "score": 1,
            "text": "After the COVID-19 travesty “scientist” is a pejorative term.",
            "title_similarity": "0.47492185",
            "sentiment_compound": -0.5719
        },
        {
            "id": "ht6kz0l",
            "score": 1,
            "text": "Watching Ryan's world or the myriad of endless unboxing videos on You Tube really brings home how much plastic junk we produce. \n\nIt's depressing really.",
            "title_similarity": "0.3539592",
            "sentiment_compound": -0.3818
        },
        {
            "id": "ht6m11n",
            "score": 1,
            "text": "Yay i love capitalism it's so fun!!!",
            "title_similarity": "0.43436307",
            "sentiment_compound": 0.9289
        },
        {
            "id": "ht6m5ol",
            "score": 1,
            "text": "Commenting to save this article",
            "title_similarity": "0.43471718",
            "sentiment_compound": 0.4939
        },
        {
            "id": "ht6mdf8",
            "score": 1,
            "text": "And nothing will change",
            "title_similarity": "0.3024245",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6mm8g",
            "score": 1,
            "text": "Imagine that decades of companies dumping anything and everything they want into the environment and the people living in it get no say whatsoever and there's never any fixing it. The companies just keep buying and dumping more.",
            "title_similarity": "0.38659954",
            "sentiment_compound": -0.6705
        },
        {
            "id": "ht6mydd",
            "score": 1,
            "text": "Time to raise the Safe limits i guess....",
            "title_similarity": "0.3982753",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ht6n21a",
            "score": 1,
            "text": "Watch now as we as a human race band together and do NOTHING to stop this. The countries who produce the least waste will have the best recycling and environmental recovery programmes, but the contries with the most pollution will do little to stem the flow of garbage into water resorvoirs and the ocean and throw whataboutisms at the rest of the world.",
            "title_similarity": "0.6753669",
            "sentiment_compound": 0.5733
        },
        {
            "id": "ht6n5iz",
            "score": 1,
            "text": "Geez. We're just doing ourselves in with every single last thing we can - global warming, chemicals, species extinction, you name it. We really, really need to clean up our own house.",
            "title_similarity": "0.5210667",
            "sentiment_compound": 0.552
        },
        {
            "id": "ht6n6bn",
            "score": 1,
            "text": "It's a good thing people listen to scientists when situations are tough, otherwise I might be worried",
            "title_similarity": "0.54463553",
            "sentiment_compound": 0.0516
        },
        {
            "id": "ht6oryn",
            "score": 2,
            "text": "The article is correct about regulation. It’s an after-the-fact correction. We needed preventative measures in 1970. \n\nThere is a saying: “Every regulation is written in blood”. The meaning is of course, that every regulation we have is because somebody has already paid the price for the mishap. It scares me that we have some preventative measures in place but they have had their teeth taken out.\n\nI would tell you to check out the case that pretty much birthed the modern day Clean Air Act, a little town called Donora, Pennsylvania. This was a microcosm of the bigger picture of air pollution and cost about 2,000 lives due to industrial refusal to pace production.\n\nHere is the wiki link:\n\nhttps://en.m.wikipedia.org/wiki/1948_Donora_smog\n\nAs someone who has worked in the industrial sector dealing with air quality regulation, this is an important part of history. While it aided in bringing down acid rain damage to buildings and cancer and emphysema rates, all that’s really happened is that industries have found ways around the CAA. \n\nThat and we put the smoke higher into the sky.",
            "title_similarity": "0.5453181",
            "sentiment_compound": -0.4678
        },
        {
            "id": "ht6p4so",
            "score": 1,
            "text": "We are all already full of bpa and microplastics, should have been the headline before I was even born ffs.",
            "title_similarity": "0.43016976",
            "sentiment_compound": -0.5859
        },
        {
            "id": "ht6ps5j",
            "score": 1,
            "text": "\"Does it make the shareholders money? if not - ignore it. It'll go away\"",
            "title_similarity": "0.4717395",
            "sentiment_compound": 0.2755
        },
        {
            "id": "ht6ptau",
            "score": 1,
            "text": "ah yes nothing like a nice dose of existential dread in the morning",
            "title_similarity": "0.41529077",
            "sentiment_compound": -0.5778
        },
        {
            "id": "ht6pztc",
            "score": 1,
            "text": "It’s time..with beyond taking off making lab meat we are so much closer to the Manga “BioMeat” than ever before.",
            "title_similarity": "0.48558757",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6q1l9",
            "score": 1,
            "text": "Wait, there’s a “safe limit?”",
            "title_similarity": "0.35824078",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6qgke",
            "score": 2,
            "text": "Too little too late. That's how we're gonna do this and everything else",
            "title_similarity": "0.36552474",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6r9pt",
            "score": 3,
            "text": "This is gonna get buried but this is a great piece of non-fiction on the subject. https://www.terrain.org/2021/nonfiction/the-17th-day/",
            "title_similarity": "0.47044694",
            "sentiment_compound": 0.7684
        },
        {
            "id": "ht6rz9i",
            "score": 1,
            "text": "My crohns would like to say hello, and they’ll be visiting your community.",
            "title_similarity": "0.3167243",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ht6rzpj",
            "score": 1,
            "text": "Every day I think how baller it would be to be able to lift my hand up and pull all the loose plastic and garbage in the world into a giant ball in the sky, squeeze my fist and watch it be densely packed into the size of a bowling ball. The ln launch that mf into space...but then again this is reality, and it's extremely depressing",
            "title_similarity": "0.3078677",
            "sentiment_compound": -0.2484
        },
        {
            "id": "ht6s45x",
            "score": 1,
            "text": "Ope, time to make more!!!",
            "title_similarity": "0.22363797",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6scqp",
            "score": 1,
            "text": "Phew. Finally safe again.",
            "title_similarity": "0.41177493",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ht6sgu7",
            "score": 1,
            "text": "Why haven't we banned single use plastics yet? \n\nSeriously, glass, aluminum, cartons, etc, all better than plastic for recycling and consumers. We need to ditch plastics three decades ago. The 10,000th best time is now.",
            "title_similarity": "0.6373048",
            "sentiment_compound": 0.8351
        },
        {
            "id": "ht6soos",
            "score": 1,
            "text": "Awww existential dread for breakfast?? You shouldn’t have. No really, you shouldn’t have.",
            "title_similarity": "0.34737754",
            "sentiment_compound": -0.6767
        },
        {
            "id": "ht6ssyg",
            "score": 1,
            "text": "What can I, as an individual, do to try and fix this? Is it even possible for us as individuals to do anything?",
            "title_similarity": "0.2965492",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6t180",
            "score": 1,
            "text": "Anyone have access to this paper?",
            "title_similarity": "0.14857417",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6tvur",
            "score": 1,
            "text": "Yeah but look at the ECONOMY",
            "title_similarity": "0.20583703",
            "sentiment_compound": 0.1531
        },
        {
            "id": "ht6u2ix",
            "score": 2,
            "text": "I'm really worried about plastic. In 100 years people are going to be like \"THEY HEAT UP FOOD IN WHAT?!\"",
            "title_similarity": "0.49801445",
            "sentiment_compound": 0.077
        },
        {
            "id": "ht6u53y",
            "score": 1,
            "text": "Cool another one for the list",
            "title_similarity": "0.35427877",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ht6uhqb",
            "score": 1,
            "text": "Oh I'm glad it passed its test. That's a relief",
            "title_similarity": "0.5882026",
            "sentiment_compound": 0.7269
        },
        {
            "id": "ht6upvf",
            "score": 1,
            "text": "Danimer Scientific.. save us now, plz!",
            "title_similarity": "0.4984225",
            "sentiment_compound": 0.5848
        },
        {
            "id": "ht6v2gm",
            "score": 1,
            "text": "If only we had known this was going to happen for 40+ years.",
            "title_similarity": "0.42185435",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6w84t",
            "score": 1,
            "text": "Don’t worry, I’ll change my Facebook image with a banner about this. Problem solved.",
            "title_similarity": "0.5147821",
            "sentiment_compound": -0.6027
        },
        {
            "id": "ht6w9uu",
            "score": 1,
            "text": "Until all the Trumpsters and rich old white career politicians are gone, we’re still on this crazy train to the bottom. I’m in CA with 39 million others. My voice feels like a drop in the ocean.",
            "title_similarity": "0.41594172",
            "sentiment_compound": 0.3071
        },
        {
            "id": "ht6wa44",
            "score": 1,
            "text": "Oh we’re way past the safe limits.",
            "title_similarity": "0.37445414",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ht6wbsa",
            "score": 1,
            "text": "In our lifetimes we are exposed to something like a 400 times greater variety of chemical compounds than out grandparents were.\nObviously not all of them were studied for effect..especially in the long term and many were in use before government could even begun evaluations.\nWe are also the first generation expected to have shorter lives than our parents.\n\nSo yeah... thats probably a pretty good indicator that we are in trouble.",
            "title_similarity": "0.55508405",
            "sentiment_compound": 0.874
        },
        {
            "id": "ht6wif7",
            "score": 1,
            "text": "The problem, as always, is capitalism and the ruthless companies and governments that support it.  Articles like this tend to place a too heavy burden on individuals and produce inertia and hopelessness.  The only global solution is to move away from consumerism and capitalism.  Not having children also helps.",
            "title_similarity": "0.47348636",
            "sentiment_compound": -0.1531
        },
        {
            "id": "ht6wl7g",
            "score": 1,
            "text": "I mean there’s a pretty glaring flaw with all this. They obviously failed to consider all the profits capitalists are making that justifies it all.",
            "title_similarity": "0.4428774",
            "sentiment_compound": 0.4215
        },
        {
            "id": "ht6wyh9",
            "score": 1,
            "text": "3M in Maplewood, MN just polluted another water tower in Woodbury, MN.",
            "title_similarity": "0.43633986",
            "sentiment_compound": -0.4588
        },
        {
            "id": "ht6x5ns",
            "score": 1,
            "text": "Fast fashion needs to die",
            "title_similarity": "0.31876487",
            "sentiment_compound": -0.5994
        },
        {
            "id": "ht6x9c3",
            "score": 1,
            "text": "i’d say a ghost broke it.",
            "title_similarity": "0.35755074",
            "sentiment_compound": -0.6249
        },
        {
            "id": "ht6xfjj",
            "score": 1,
            "text": "I wake up in LA every day and look at my weather app and it says poor air quality. Ok... now what. Dont breath at work today?",
            "title_similarity": "0.40080845",
            "sentiment_compound": -0.4767
        },
        {
            "id": "ht6xhsr",
            "score": 1,
            "text": "“And then nothing changed.”",
            "title_similarity": "0.2389104",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6xmjv",
            "score": 1,
            "text": "I'm really curious which \"safe\" chemicals are gonna be discovered to be causing a major health issue.",
            "title_similarity": "0.5511316",
            "sentiment_compound": 0.6962
        },
        {
            "id": "ht6xyrp",
            "score": 1,
            "text": "“Why don’t we just build big fans and blow the chemicals into space?” ~some politicians probably",
            "title_similarity": "0.46761984",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6yo66",
            "score": 1,
            "text": "Feels great to be part of the fall of the human race",
            "title_similarity": "0.6156621",
            "sentiment_compound": 0.6249
        },
        {
            "id": "ht6yspg",
            "score": 1,
            "text": "I think the generation born after the Zoomer generation should be called the Doomers. We done fucked it up for them.",
            "title_similarity": "0.5479909",
            "sentiment_compound": -0.6597
        },
        {
            "id": "ht6z32o",
            "score": 6,
            "text": "Don't need grandkids I guess",
            "title_similarity": "0.36561784",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6z5tp",
            "score": 1,
            "text": "A race to see how we wipe ourselves out first",
            "title_similarity": "0.33393693",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6zbom",
            "score": 1,
            "text": "The consequence of reaction.",
            "title_similarity": "0.13541397",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht6zmmx",
            "score": 1,
            "text": "It's just a little dirty, it's still good it's still good!",
            "title_similarity": "0.41155893",
            "sentiment_compound": 0.54
        },
        {
            "id": "ht6zwu3",
            "score": 1,
            "text": "… As if this is the first time scientists have demonstrated something like this. I’m old AF and they’ve been impotently shouting this since before I was born.",
            "title_similarity": "0.44277886",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ht70b7n",
            "score": 1,
            "text": "This is a really important issue and I just wanted to shoutout https://retailerreportcard.com. They evaluate 50 major companies on their toxic chemical policies and give them a grade from A to F every year. It’s well written, easy to understand and they give advice on how every company can improve and show the progress they’ve made.",
            "title_similarity": "0.5368299",
            "sentiment_compound": 0.8955
        },
        {
            "id": "ht70k9y",
            "score": 1,
            "text": "Oh good. Good morning to you guys too.",
            "title_similarity": "0.4118954",
            "sentiment_compound": 0.7003
        },
        {
            "id": "ht70p5t",
            "score": 1,
            "text": "When do we get the cool leather wearing apocalypse we've been promised? I'm sick and tired of this go to work until the world dies apocalypse.",
            "title_similarity": "0.48022577",
            "sentiment_compound": -0.34
        },
        {
            "id": "ht70vcl",
            "score": 1,
            "text": "Shall we crowd fund a lawsuit? Use our crypto for something useful instead of story bibles of fuckin Dune...",
            "title_similarity": "0.3933639",
            "sentiment_compound": 0.25
        },
        {
            "id": "ht713l5",
            "score": 1,
            "text": "The people in power would rather die rich than work to make the world a better place.",
            "title_similarity": "0.49147415",
            "sentiment_compound": 0.3818
        },
        {
            "id": "ht718am",
            "score": 1,
            "text": "Underwriters salivating at the adjusting death tables",
            "title_similarity": "0.24945846",
            "sentiment_compound": -0.5994
        },
        {
            "id": "ht71g7e",
            "score": 1,
            "text": "We're not having kids for many reasons, but one of the big ones is: why have them when they'll inherit a wasteland of a planet?",
            "title_similarity": "0.428585",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht71j7s",
            "score": 3,
            "text": "when are we gonna, ya know, stop?",
            "title_similarity": "0.19448103",
            "sentiment_compound": -0.296
        },
        {
            "id": "ht720dn",
            "score": 1,
            "text": "Whoa. Thank you for this explanation.",
            "title_similarity": "0.4022197",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ht723br",
            "score": 1,
            "text": "Corporatism at its finest.",
            "title_similarity": "0.39774394",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht72cax",
            "score": 7,
            "text": "Yes, mankind needs to stop shitting in its nest.",
            "title_similarity": "0.4262851",
            "sentiment_compound": -0.3182
        },
        {
            "id": "ht72oey",
            "score": 1,
            "text": "Thank you for my cancer, may I have another?",
            "title_similarity": "0.5579712",
            "sentiment_compound": -0.4404
        },
        {
            "id": "ht73blk",
            "score": 1,
            "text": "I hope we die fast and painless, if we will.",
            "title_similarity": "0.508093",
            "sentiment_compound": 0.0516
        },
        {
            "id": "ht73dr2",
            "score": 1,
            "text": "Hope I stay alive long enough to watch the bodies start to hit the floor.",
            "title_similarity": "0.43309674",
            "sentiment_compound": 0.6705
        },
        {
            "id": "ht73ka2",
            "score": 1,
            "text": "Are there industries or companies that are trying to combat or find solutions? I don’t know what I could do in my daily life to make an impact, but I’d be interested in working somewhere to help.",
            "title_similarity": "0.37867075",
            "sentiment_compound": 0.775
        },
        {
            "id": "ht7410a",
            "score": 1,
            "text": "This isn't news, is it?",
            "title_similarity": "0.15615925",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht74atb",
            "score": 1,
            "text": "“So far, no quantitative boundary has been defined for the novel entities boundary, although, some specific chemicals are quantified under other planetary boundaries, such as greenhouse gases and CFCs.”\n\nBasically they’re guessing that a worldwide threshold has been crossed, but there are a lot of dependencies. This isn’t to downplay the severity of the situation, it is to point out the lack of data.",
            "title_similarity": "0.57450014",
            "sentiment_compound": -0.4404
        },
        {
            "id": "ht7534l",
            "score": 1,
            "text": "50 years ago. Thanks Dupont #m for poisoning every single human on the planet and every water supply. We are now different then we were 50 years ago. the fact that in the us alone there are 80,000 unregulated chemicals is appalling. imagine what the rest of the world is ? Plastics and chemicals everywhere and I just cant put my finger on where all the cancer is come from...",
            "title_similarity": "0.537518",
            "sentiment_compound": -0.8689
        },
        {
            "id": "ht75h3r",
            "score": 1,
            "text": "With all these countries moving to legalize cannabis, hemp plastics will be much more accessible and affordable. Hopefully they take advantage of it and we can stop using the non bio plastics.",
            "title_similarity": "0.6288721",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ht75mxn",
            "score": 1,
            "text": "So when do we take matters into our own hands? When does shirking the systems of control become self defense? Are we really prepared to allow our planet to die for a small group of greedy assholes to have enough money to bring their failures to another planet? When KS enough enough? Our children's children will never breath, are we ok with that? All the animals we know, ready to be made extinct, is this the meaning of humanity? \n\nFor shame all that have perpetuated this, for shame you never stood for anything.",
            "title_similarity": "0.45342407",
            "sentiment_compound": -0.91
        },
        {
            "id": "ht75tcm",
            "score": 1,
            "text": "Plastic and oil execs should be tried for environmental crimes. Disgusting.",
            "title_similarity": "0.49113545",
            "sentiment_compound": -0.5267
        },
        {
            "id": "ht764ol",
            "score": 1,
            "text": "Not really news.  I'm laying odds on human extinction in the next fifty - one hundred years.",
            "title_similarity": "0.47649235",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht7689v",
            "score": 1,
            "text": "Beneath the Great Pacific Garbage Patch, there is now a geologic layer of plastic that future geologists will be able to study.",
            "title_similarity": "0.46643686",
            "sentiment_compound": 0.6249
        },
        {
            "id": "ht76b1p",
            "score": 1,
            "text": "I hope humanity kills itself off before we begin colonizing in space. I don’t think the rest of the Universe needs our stink in it.",
            "title_similarity": "0.54488325",
            "sentiment_compound": -0.5106
        },
        {
            "id": "ht76e0u",
            "score": 1,
            "text": "Well that's no problem, we'll just move to a place with no pollution.",
            "title_similarity": "0.43835336",
            "sentiment_compound": 0.2865
        },
        {
            "id": "ht76orv",
            "score": 1,
            "text": "Huzzah! We are all DOOMED! No point in trying anymore. Who wants to join my fat, greasy, smelly orgy?",
            "title_similarity": "0.32610023",
            "sentiment_compound": -0.7592
        },
        {
            "id": "ht77195",
            "score": 1,
            "text": "As humanity, we have let the petrochemical companies dominates our world economy. This may not be too late but the damage to our home is already there.....",
            "title_similarity": "0.6846521",
            "sentiment_compound": -0.6369
        },
        {
            "id": "ht77reg",
            "score": 1,
            "text": "Don't worry, the people who have the power to do anything about it will be dead before the worst effects take place.",
            "title_similarity": "0.51945734",
            "sentiment_compound": -0.7902
        },
        {
            "id": "ht77tf1",
            "score": 1,
            "text": "Really? I feel alright still, keep those toxins coming!!",
            "title_similarity": "0.46286348",
            "sentiment_compound": 0.4306
        },
        {
            "id": "ht78nij",
            "score": 1,
            "text": "Only way to stop this chemical perversion of life is to TAKE back our freedom from the corrupt governmental system & Burn it down",
            "title_similarity": "0.5254743",
            "sentiment_compound": 0.1779
        },
        {
            "id": "ht78vjp",
            "score": 1,
            "text": "My generation going to have one of the highest suicide rates in history.",
            "title_similarity": "0.50073224",
            "sentiment_compound": -0.6705
        },
        {
            "id": "ht7alc4",
            "score": 1,
            "text": "The wealthy army even going up be bothered by this because they think it won't impact them.",
            "title_similarity": "0.5041726",
            "sentiment_compound": 0.0516
        },
        {
            "id": "ht7bbjc",
            "score": 1,
            "text": "It was always humanities destiny to create plastic for Earth because she can’t do it herself. Mission Accomplishitfucked",
            "title_similarity": "0.39680642",
            "sentiment_compound": 0.2732
        },
        {
            "id": "ht7bk44",
            "score": 1,
            "text": "I read this as a positive about 2 hours ago. Finally got me a second time…",
            "title_similarity": "0.47734857",
            "sentiment_compound": 0.5574
        },
        {
            "id": "ht7bqa6",
            "score": 1,
            "text": "We will evolve into an extinct species.",
            "title_similarity": "0.35157147",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht7bt73",
            "score": 1,
            "text": "George Carlin was spot on.\n\nThe Earth + Plastic.",
            "title_similarity": "0.35955387",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht7cfaw",
            "score": 1,
            "text": "Perhaps we should tax all new plastic created and use that money to invest in recycling and disposal programs and research. If they don’t want to be responsible to solve the problems they cause, tax their profits and fund solutions.",
            "title_similarity": "0.5447892",
            "sentiment_compound": 0.743
        },
        {
            "id": "ht7cqz2",
            "score": 1,
            "text": "I've long suspected that plastics or microplastics would be our downfall.\n\nSome type of bacteria, etc. evolves to eat it freely in the open environment and then POW goodbye civilization.",
            "title_similarity": "0.55986583",
            "sentiment_compound": 0.25
        },
        {
            "id": "ht7cun4",
            "score": 1,
            "text": "Will humanity actually do anything about it though? Nope!",
            "title_similarity": "0.318803",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht7dvv0",
            "score": 1,
            "text": "I really hate that money is a motivating factor for everything",
            "title_similarity": "0.29885024",
            "sentiment_compound": -0.2006
        },
        {
            "id": "ht7dz1z",
            "score": 1,
            "text": "It was predicted by the MIT team in \"Limits to Growth\" in 1972. They were ridiculed back there, but 50 years later and we're tracking their predictions.",
            "title_similarity": "0.537624",
            "sentiment_compound": 0.0129
        },
        {
            "id": "ht7e8i9",
            "score": 1,
            "text": "The stupid and the greedy always have and always will outnumber the smart and the selfless.\n\nThe qualities of the people who attain power have a biological imperative that applies to the individual, i.e. themselves and not the species.\n\nFor anyone else that gives a damn, it may be too late to save the rest of us. Or at least, the series of events required to do so would require flipping the world on its head.",
            "title_similarity": "0.5364611",
            "sentiment_compound": -0.3612
        },
        {
            "id": "ht7ewev",
            "score": 1,
            "text": "Don’t have kids folks",
            "title_similarity": "0.12381293",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht7f7s0",
            "score": 1,
            "text": "Please keep going I want to watch it all burn",
            "title_similarity": "0.27290052",
            "sentiment_compound": 0.3818
        },
        {
            "id": "ht7gyui",
            "score": 1,
            "text": "It's time to wear PPE forever!",
            "title_similarity": "0.26304924",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht7hikz",
            "score": 1,
            "text": "It's been killing millions per year since the 1800s.\n\nUnless you mean that fossil fuels aren't chemicals...",
            "title_similarity": "0.49692044",
            "sentiment_compound": -0.6597
        },
        {
            "id": "ht7hmbz",
            "score": 1,
            "text": "oh well. its rough here. so lets not fix the couple of things wrong here but instead lets fly to another planet and try to adapt to living in a completely hostile environment on mars.",
            "title_similarity": "0.34276867",
            "sentiment_compound": -0.653
        },
        {
            "id": "ht7imi1",
            "score": 1,
            "text": "Do you think we should stop now, neh we're already passed might as well stay rich.",
            "title_similarity": "0.46615356",
            "sentiment_compound": 0.5423
        },
        {
            "id": "ht7jpqs",
            "score": 1,
            "text": "Sometimes I just wanna die reading all this :/",
            "title_similarity": "0.29903996",
            "sentiment_compound": -0.7684
        },
        {
            "id": "ht7lw10",
            "score": 1,
            "text": "Walked on top of snow recently and it felt weird like walking on plastic. Knew it was a wrap",
            "title_similarity": "0.3039524",
            "sentiment_compound": 0.3818
        },
        {
            "id": "ht7men8",
            "score": 1,
            "text": "Keep buying plastic. Phone cases, sodas, products wrapped in plastic, fast food cups",
            "title_similarity": "0.27091515",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht7mhoq",
            "score": 1,
            "text": "Why is this not blowing up everywhere",
            "title_similarity": "0.2638374",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht7mwpq",
            "score": 1,
            "text": "Yeah we passed that in the 1950s",
            "title_similarity": "0.2250985",
            "sentiment_compound": 0.296
        },
        {
            "id": "ht7n35f",
            "score": 1,
            "text": "Who determines that yesterday, there were 10 plastic bottles on Mt. Everest, but today there are 15, which is passed the safe limit of plastic on earth….?\n\nFuckin fear mongering.",
            "title_similarity": "0.48582584",
            "sentiment_compound": -0.5434
        },
        {
            "id": "ht7n4s2",
            "score": 2,
            "text": "Yeah but what are we going to do? Absolutely nothing. We crave our conveniences and we cannot be blame because our collected conveniences tell us how achieved we are and give us gratification. It's taught to us.",
            "title_similarity": "0.5599495",
            "sentiment_compound": 0.7618
        },
        {
            "id": "ht7nbvm",
            "score": 1,
            "text": "Maybe we can engineer a bacterium or nanomachine that breaks down microplastics in our bodies or carries them out via the digestive tract",
            "title_similarity": "0.4705736",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht7oj8k",
            "score": 1,
            "text": "Well chinas the #1 polluter on the planet so let’s start there",
            "title_similarity": "0.6080971",
            "sentiment_compound": -0.1779
        },
        {
            "id": "ht7onkv",
            "score": 1,
            "text": "Humanity has passed safe limits for humanity. Guess what happens next.",
            "title_similarity": "0.67985594",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ht7p7pm",
            "score": 1,
            "text": "Good, humanity sucked anyways",
            "title_similarity": "0.35755277",
            "sentiment_compound": -0.0258
        },
        {
            "id": "ht7pf3i",
            "score": 1,
            "text": "When do humans start dying? Can we FF to that part?",
            "title_similarity": "0.35866803",
            "sentiment_compound": 0.5984
        },
        {
            "id": "ht7phe7",
            "score": 1,
            "text": "I've not read the article but, I read heard that plastic isn't our highest problem, green house gases are definitely above plastic and replacing plastic straws and stuff like that won't have that big of an impact.",
            "title_similarity": "0.6385401",
            "sentiment_compound": 0.8653
        },
        {
            "id": "ht7pqfl",
            "score": 1,
            "text": "And boomers wonder why fewer people are having kids..",
            "title_similarity": "0.37115234",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht7q1cq",
            "score": 1,
            "text": "As a confirmed misanthrope, good.",
            "title_similarity": "0.3825159",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ht7q586",
            "score": 1,
            "text": "Great. Thanks successive governments, you have been abject failures.",
            "title_similarity": "0.48774832",
            "sentiment_compound": 0.7269
        },
        {
            "id": "ht7qu5h",
            "score": 1,
            "text": "If this concerns you, find a political group in your country that's fighting pollution, get involved, don't sit and watch.",
            "title_similarity": "0.40953016",
            "sentiment_compound": -0.3612
        },
        {
            "id": "ht7r4f9",
            "score": 1,
            "text": "To be honest I can't really understand how much a threat microplastics pose from the study or article, seems rather speculative. Of course we should move towards a reuse economy, but its not clear that these chemicals are a doomsday type scenario at all.",
            "title_similarity": "0.54526377",
            "sentiment_compound": -0.8328
        },
        {
            "id": "ht7zsxw",
            "score": 1,
            "text": "Is there anything we can do to collectively and effectively call for an end to single use plastic production and plastic fabrics?",
            "title_similarity": "0.4053575",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ht803vy",
            "score": 1,
            "text": "Yay, more depressing news! This is one of the many reasons I changed my mind about having kids",
            "title_similarity": "0.40004104",
            "sentiment_compound": 0.202
        },
        {
            "id": "ht89hx9",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.14494684"
        },
        {
            "id": "ht8nkuu",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.14494684"
        },
        {
            "id": "ht92gmy",
            "score": 1,
            "text": "Capitalists by nature care about money, not the air they breathe. If they cannot breathe they will merely see that as another capital venture to profit from…it’s sickening.",
            "title_similarity": "0.4478141",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ht92pig",
            "score": 1,
            "text": "Simple fix: release new study that increases safe limits.",
            "title_similarity": "0.63618183",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ht92pst",
            "score": 1,
            "text": "This is stupid. What’s your reference?",
            "title_similarity": "0.18556648",
            "sentiment_compound": -0.5267
        },
        {
            "id": "ht93ihv",
            "score": 2,
            "text": "Calm down. Live your life.",
            "title_similarity": "0.33020848",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ht93p6m",
            "score": 1,
            "text": "Honey, pass the petroleum enriched sea salt please.",
            "title_similarity": "0.48255917",
            "sentiment_compound": 0.3182
        },
        {
            "id": "ht94iz5",
            "score": 1,
            "text": "This is why I don’t abide by covid rules. Why save those that have such huge microplastic impacts which truly fucks ecosystems for generations to come",
            "title_similarity": "0.48882538",
            "sentiment_compound": 0.6486
        },
        {
            "id": "ht94jks",
            "score": 1,
            "text": "How long until the world falls apart hope fully 200 years soo I don’t witness it",
            "title_similarity": "0.40758497",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ht94kev",
            "score": 1,
            "text": "If i am made up of 80% pfas do i become immortal?",
            "title_similarity": "0.36633903",
            "sentiment_compound": 0.25
        },
        {
            "id": "ht94kkh",
            "score": 1,
            "text": "How is this not the 1. Headline everywhere?",
            "title_similarity": "0.22887935",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9505k",
            "score": 2,
            "text": "Capitalism: creates pollution crisis for profit motive\n\nAlso capitalism: we will innovate future technology that will solve everything! DON’T STOP BUYING",
            "title_similarity": "0.6040814",
            "sentiment_compound": 0.3091
        },
        {
            "id": "ht952w1",
            "score": 1,
            "text": "What can I do as an individual to help?",
            "title_similarity": "0.15067707",
            "sentiment_compound": 0.4019
        },
        {
            "id": "ht97hbt",
            "score": 1,
            "text": "Had to check if this was r/collapse but nope, this is good ol' science.",
            "title_similarity": "0.6978706",
            "sentiment_compound": -0.4782
        },
        {
            "id": "ht97oz8",
            "score": 1,
            "text": "Now all the common folk buckle down and walk to work millionaires, billionaires and corporations as you where.",
            "title_similarity": "0.37419835",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht97wwd",
            "score": 1,
            "text": "Are you guys ready for 70+ years of debating whether chemicals are real?",
            "title_similarity": "0.48959374",
            "sentiment_compound": 0.3612
        },
        {
            "id": "ht98d8j",
            "score": 1,
            "text": "What is an effective way to get someone who is addicted to consuming from giving my kids cheap plastic crap that they deem too cheap to pass up?  I've tried to appeal to and explain to them the unrealized personal and environmental costs of continuing to vote with their money like this.  I've tried to ask directly not to consume on behalf of my kids. But it still continues.  When I continually bring it up I am treated like the bad guy for denying the love language of gift giving...\n\nConsumer addiction is really fuelling this to a large extent and how do we effectively stop it?",
            "title_similarity": "0.49108166",
            "sentiment_compound": 0.9226
        },
        {
            "id": "ht99g6h",
            "score": 1,
            "text": "Sigh....we are so fucked man. All we have to do is convert to fungi to replace plastic, why is it so hard to get rid of this plastic?!",
            "title_similarity": "0.4044572",
            "sentiment_compound": -0.8305
        },
        {
            "id": "ht99k0l",
            "score": 2,
            "text": "This is my 2nd reading this exact post. But in my stupid morning stooper, I read it as a good thing. Like we were now entering safe levels. Reading it now I realize the depressing truth. Sigh",
            "title_similarity": "0.5750524",
            "sentiment_compound": 0.7227
        },
        {
            "id": "ht99kfp",
            "score": 1,
            "text": "I rarely ever throw out garbage. It rots here, yet due to the clutter, I rarely use what could be garbage. Not because of being a hoarder. It's because it emotionally hurts to throw out",
            "title_similarity": "0.35785782",
            "sentiment_compound": -0.4767
        },
        {
            "id": "ht99yae",
            "score": 1,
            "text": "...I don't want to be alive anymore.",
            "title_similarity": "0.14154574",
            "sentiment_compound": 0.3352
        },
        {
            "id": "ht9ap9p",
            "score": 2,
            "text": "Cotton,  linen,  hemp, leather and bamboo are all alternatives to plastic clothing... how about we outlaw polyester and any synthetics that contain plastic?  \n\nIt may need to be gradual to give time for societal adjustment",
            "title_similarity": "0.42176607",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9b98d",
            "score": 1,
            "text": "Team seas better step it up, if I was president I would make sure our tax dollars didn’t go to scummy politicians such as Nancy pelosi. And instead went towards more important things like cleaning the oceans.",
            "title_similarity": "0.5452838",
            "sentiment_compound": 0.8425
        },
        {
            "id": "ht9c08m",
            "score": 2,
            "text": "Ay bro one depressing world catastrophe at a time",
            "title_similarity": "0.31681284",
            "sentiment_compound": -0.7906
        },
        {
            "id": "ht9c5so",
            "score": 2,
            "text": "Not in my life time , 37.... we good. Future people...not so much.",
            "title_similarity": "0.43286213",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ht9cllk",
            "score": 2,
            "text": "Tight, I guess I’ll hide inside and buy a giant bubble",
            "title_similarity": "0.30456054",
            "sentiment_compound": -0.1779
        },
        {
            "id": "ht9dp1r",
            "score": 1,
            "text": "Yeah, but … stock market. Have some priorities. Sheesh.",
            "title_similarity": "0.26798254",
            "sentiment_compound": 0.1531
        },
        {
            "id": "ht9e7re",
            "score": 1,
            "text": "This ***ENTIRE*** thread really thinks by *doing your part* you will be making a positive impact.\n\nUntil the big companies producing 70% of all pollution are made to change, your less than .001% of an impact will be merely an extra effort on your part to feel better about consequences completely out of your control.\n\nIt's good that you're all trying, but if you really want to make an impact you'll need to help stop the big players from not doing their part.  Nothing else will ever be enough short of a technological revolution in recycling.",
            "title_similarity": "0.7128066",
            "sentiment_compound": 0.7808
        },
        {
            "id": "ht9g2xu",
            "score": 1,
            "text": "A certain plastic in fragrances and cosmetics is causing small genitals in fetuses, pregnant women who ingest a lot of this chemical have children with this side effect. Most children grow up to have fertility issues, apparently it's easy to tell if someone has this defect at birth too, it causes a small space between the genitals and anus. We can literally blame plastics for small penis size and infertility in women.",
            "title_similarity": "0.4746939",
            "sentiment_compound": -0.0387
        },
        {
            "id": "ht9g8q7",
            "score": 1,
            "text": "Everybody gotta die sometime-SSG Barnes (Platoon)",
            "title_similarity": "0.32927966",
            "sentiment_compound": -0.5994
        },
        {
            "id": "ht9gy01",
            "score": 2,
            "text": "It's awful because I read the headline and moved on... not even checking the comments or the story.. just go on my day",
            "title_similarity": "0.44836938",
            "sentiment_compound": -0.4588
        },
        {
            "id": "ht9hz4i",
            "score": 1,
            "text": "This is all because of corporations. They are killing our planet for profit and all we do is sit back and give them our money.",
            "title_similarity": "0.4885198",
            "sentiment_compound": -0.3612
        },
        {
            "id": "ht9mglp",
            "score": 1,
            "text": "This article is a patent lie. We passed the safe limit in 1951 when DuPont contaminated nearly ever single person on the planet with C8 from Teflon.",
            "title_similarity": "0.61355996",
            "sentiment_compound": 0.4404
        },
        {
            "id": "ht9mtdc",
            "score": 1,
            "text": "deflect and invest in cancer detection and management!",
            "title_similarity": "0.47162747",
            "sentiment_compound": -0.69
        },
        {
            "id": "ht9obyr",
            "score": 1,
            "text": "Who could have ever seen this coming. Who? WHO??? \n\nOh, oil and coal execs knew the whole time? Oh okay.",
            "title_similarity": "0.44786853",
            "sentiment_compound": 0.4329
        },
        {
            "id": "ht9r0mt",
            "score": 1,
            "text": "What can we do about it ?",
            "title_similarity": "0.14167511",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9t6ws",
            "score": 1,
            "text": "The alarm is ringing and getting louder!",
            "title_similarity": "0.13947855",
            "sentiment_compound": -0.4003
        },
        {
            "id": "ht9t74r",
            "score": 2,
            "text": "“Why is everyone getting cancer and getting sick all of a sudden?” -News",
            "title_similarity": "0.39368054",
            "sentiment_compound": -0.8271
        },
        {
            "id": "ht9u8cc",
            "score": 1,
            "text": "So what can each one of you do to decrease you plastic footprint? \n\ns/",
            "title_similarity": "0.4039716",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9y1c8",
            "score": 1,
            "text": "You wouldn’t say that if you were an interplanetary archeologist.",
            "title_similarity": "0.3570122",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9yg3u",
            "score": 1,
            "text": "What about bio sludge?",
            "title_similarity": "0.40475762",
            "sentiment_compound": 0.0
        },
        {
            "id": "ht9zylb",
            "score": 1,
            "text": "Well, that’s one way to say that we’re fucked.",
            "title_similarity": "0.35250795",
            "sentiment_compound": -0.5106
        },
        {
            "id": "hta0no1",
            "score": 1,
            "text": "Micro plastics are also in consumer products like toothpaste. We can control to some extent what we buy/ consume.\n\nAnother source-housepaint. Vinyl, Acrylic, Latex-all petroleum based plastics, that are going to get sanded, or chipped off etc, creating more.\n\nGood thing we ditched all those oil based (biodegradable plant oils like Linseed Oil, Tung Oil, Pine Tar, etc.) for those low VOC petroleum based paints.",
            "title_similarity": "0.5167279",
            "sentiment_compound": 0.807
        },
        {
            "id": "hta0r7y",
            "score": 1,
            "text": "I guess the solution for pollution is no longer dilution.",
            "title_similarity": "0.5451499",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hta1m5f",
            "score": 2,
            "text": "honestly I would be depressed about this but I've pretty much just accepted that humanity won't have nice things soon enough",
            "title_similarity": "0.45182523",
            "sentiment_compound": 0.5862
        },
        {
            "id": "hta54j1",
            "score": 1,
            "text": "You can blame corporate greed for this. A few hundred selfish greedy corporate CEOs have done all of that damage to the planet when they found new ways to profit by dumping the waste products of the oil industry on the the ordinary people by converting them into plastics that no one asked for because they were more than happy with the products they had been using for hundreds of years made from glass, wood, metal and pottery.",
            "title_similarity": "0.5758742",
            "sentiment_compound": -0.9026
        },
        {
            "id": "hta86zh",
            "score": 1,
            "text": "[removed]",
            "title_similarity": "0.14494684"
        },
        {
            "id": "htaav5p",
            "score": 1,
            "text": "Really the REAL problem is COWS. All they do is eat and crap all the time. taking a crap whenever they please. Eating up all the grass n pooping. all day.. Helloo like this was ok like 100 years ago but they gotta get with the program.",
            "title_similarity": "0.3097005",
            "sentiment_compound": 0.0434
        },
        {
            "id": "htabpi1",
            "score": 1,
            "text": "What exactly is the problem? We get to maybe die sooner.",
            "title_similarity": "0.3777571",
            "sentiment_compound": -0.765
        },
        {
            "id": "htafesw",
            "score": 1,
            "text": ">We submit that the safe operating space of the planetary boundary of novel entities is exceeded since annual production and releases are increasing at a pace that outstrips the global capacity for assessment and monitoring.\n\nI think this is what is really sad about the study. They presented multitude of variables that are needed for accessment of a planetary boundary for novel entities and then they write THIS as their conclusion? They litterally say we crossed the boundary for novel entities since people began synthesising chemicals. Because assessment and monitoring of chemicals are a -very- recent development.\n\nEven worse, they contradict themselves in te paragraph before that:\n\n>We conclude that the nature of the\r\nplanetary boundary for novel entities demands several different control variables, and that jointly, our set of control variables\rform the basis of a feasible strategy to alert planetary risks and\r\ninform action.\n\nThat would have been the scientifically correct accessment and could have been the end of the study. I am not sure why they needed to undermine themselves with the following paragraph.",
            "title_similarity": "0.6118568",
            "sentiment_compound": -0.1913
        },
        {
            "id": "htafvil",
            "score": 1,
            "text": "Remember that movie Don't Look Up? Yea....we have a habit of ignoring problems until they become insurmountable.",
            "title_similarity": "0.41554135",
            "sentiment_compound": -0.6597
        },
        {
            "id": "htah7tx",
            "score": 1,
            "text": "Literally everyone already knows this. It isn't up to us, it's up to corporations.",
            "title_similarity": "0.38756785",
            "sentiment_compound": 0.0
        },
        {
            "id": "htah9v0",
            "score": 1,
            "text": "Well now that's a thoroughly depressing statistic.",
            "title_similarity": "0.21629585",
            "sentiment_compound": -0.2006
        },
        {
            "id": "htamaeh",
            "score": 1,
            "text": "Ok sure but would it really make sense to cut into chemical profits?",
            "title_similarity": "0.5662927",
            "sentiment_compound": 0.5346
        },
        {
            "id": "htanucj",
            "score": 2,
            "text": " Well now that's a thoroughly depressing statistic.",
            "title_similarity": "0.21629585",
            "sentiment_compound": -0.2006
        },
        {
            "id": "htavy8c",
            "score": 1,
            "text": "Cool, lets continue anyway cause making the rich richer and sucking politicians dicks is more important.",
            "title_similarity": "0.47527212",
            "sentiment_compound": 0.8858
        },
        {
            "id": "htbbqco",
            "score": 1,
            "text": "This has always been a balancing act, as polyester blended clothing is more durable and possibly longer lasting. Growing more cotton has its environmental impacts as well (more water, pesticides [carcinogenic ones too] and runoff to ground water).\n\nPeople forget that plastic grocery bags were championed as a way to save trees from deforestation and we switched from papep to plastic and now were back to paper. \n\nSame thing is to be said with transporting of goods in glass vs plastic. Even your aluminum coke cans have a plastic film layer inside of them. \n\nImpact and feasibility studies should be done to improve on this to figure out what type of rules could be a benefit as it also could have negative impacts on poorer communities due to cost.\n\nFrom a clothing perspective, maybe washers should come with this type of filtration (but that raises cost/maintenance) I was under the impression that the biggest contributor of plastics into the ocean and in the form of dust was from garbage and recycling aspects that make there way in through storm and shipping overseas (and in very poor countries the dumping of garbage into water ways). Then the water cycle does the rest.",
            "title_similarity": "0.5795149",
            "sentiment_compound": -0.4921
        },
        {
            "id": "htbf07s",
            "score": 1,
            "text": "Okay all doomerposting aside, what can we actually do about it? Because i hate seeing posts like this where it’s all doom and gloom. I want to see at least the idea that tho can be fixed (to an extent) instead of us saying “we’re screwed”",
            "title_similarity": "0.38069504",
            "sentiment_compound": -0.743
        },
        {
            "id": "htbk5v3",
            "score": 1,
            "text": "As a scientist i think this is bs. And someone was mad that they never got any recognition for their publications, and they are just attention grabbing in the media",
            "title_similarity": "0.51251936",
            "sentiment_compound": -0.4939
        },
        {
            "id": "htbnwjd",
            "score": 2,
            "text": "I encourage everyone to consider stopping purchase of all low priced junk off Amazon, buy quality products that can be used for many years or a lifetime. Amazon pumping cheap Chinese made crap onto the world is a problem.",
            "title_similarity": "0.55645657",
            "sentiment_compound": -0.3182
        },
        {
            "id": "htbst4o",
            "score": 1,
            "text": "I want to say one word to you.  Just one word ….",
            "title_similarity": "0.30080223",
            "sentiment_compound": 0.0772
        },
        {
            "id": "htbwhli",
            "score": 1,
            "text": "Du pont is going to hate this exposure",
            "title_similarity": "0.27529585",
            "sentiment_compound": -0.5719
        },
        {
            "id": "htbzufp",
            "score": 1,
            "text": "Yeah yeah yeah, Goodluck fighting the Fascist in the US to stop this.",
            "title_similarity": "0.3454115",
            "sentiment_compound": -0.4019
        },
        {
            "id": "htc7q6k",
            "score": 1,
            "text": "Comments here did not disappoint",
            "title_similarity": "0.33319998",
            "sentiment_compound": 0.3089
        },
        {
            "id": "htcarsb",
            "score": 1,
            "text": "So, like, genuinely asking, as someone who just entered my 20’s… is there going to be a future? Like is there any point in anything if we don’t reverse the destruction caused to our planet?",
            "title_similarity": "0.5567795",
            "sentiment_compound": 0.168
        },
        {
            "id": "htdazga",
            "score": 1,
            "text": "Oh good, I’m glad that it passed the limit where it is now safer.",
            "title_similarity": "0.57406104",
            "sentiment_compound": 0.8271
        },
        {
            "id": "htdjbws",
            "score": 1,
            "text": "I think the focus should be on single use plastics. Plastic gets used in so many ways it’s pretty hard to just remove it all. Plastics can be so extremely useful and at the same time cheap to replace at all with other materials like metal is not even realistic.\n\nAlso there have been bio degradable plastics that I think should be used more often. While these plastics don’t degrade that fast they still degrade in several years  and don’t leave micro plastics. I would hate for rules to ban these types of plastics in some kind of sweeping legislation.",
            "title_similarity": "0.628304",
            "sentiment_compound": -0.76
        },
        {
            "id": "htyaob3",
            "score": 1,
            "text": "I'm glad it's finally passed the safe limit. All these years we have been living in a dangerous time. Good job everyone keep it up",
            "title_similarity": "0.5920532",
            "sentiment_compound": 0.6908
        }
    ]
}