{
    "Antibiotic resistance killed more people than malaria or AIDS in 2019\n": [
        {
            "id": "htfslxy",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.349033",
            "sentiment_compound": 0.7088
        },
        {
            "id": "htg4a17",
            "score": 35,
            "text": "Eating meat is one of the causes according to this article. Environmental risks, health risks, non-violence reasons, not to mention if people didn’t eat meat this pandemic wouldn’t have happened (we are assuming here of course the wet market cause, which is also the cause of so many pandemics/ viruses that jumped from animal to human)…now this threat to humanity, when will people realize it’s just not worth it?\n\nhttps://www.newscientist.com/article/mg22530143-900-superbug-risk-from-tonnes-of-antibiotics-fed-to-animals/",
            "title_similarity": "0.53040016",
            "sentiment_compound": -0.8345
        },
        {
            "id": "htge0ef",
            "score": 0,
            "text": "I love how medical people try to make antibiotics seem like they are a good thing for you. People blindly take the just because doctors say they are good.",
            "title_similarity": "0.31252912",
            "sentiment_compound": 0.91
        },
        {
            "id": "htfxfn9",
            "score": -19,
            "text": "I blame the people who didn't take antibiotics for antibiotics becoming resistant.",
            "title_similarity": "0.5641031",
            "sentiment_compound": -0.34
        },
        {
            "id": "htg5dj5",
            "score": 2,
            "text": "Phage therapy when? Seriously.  We've known this for years.",
            "title_similarity": "0.32690984",
            "sentiment_compound": -0.1779
        },
        {
            "id": "htfwcnu",
            "score": 58,
            "text": "[deleted]",
            "title_similarity": "0.078636065"
        },
        {
            "id": "htghp6r",
            "score": 0,
            "text": "Step up your game, AIDS.",
            "title_similarity": "0.13994679",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgkhry",
            "score": 0,
            "text": "And who do you blame SCIENCE and doctors for giving it away online candy for absolutely everything for years and believing they we right to do it……… think on that",
            "title_similarity": "0.5365139",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgzq2o",
            "score": 0,
            "text": "Go vegan, the majority of antibiotics used are fed to animals that are forced to live in terrible conditions",
            "title_similarity": "0.51088774",
            "sentiment_compound": -0.7269
        },
        {
            "id": "htgieg8",
            "score": 4,
            "text": "That's a poorly worded title. Antibiotic resistance doesn't kill anyone. Bacteria do. Saying that antibiotic resistance killed someone is almost like saying an ineffective insecticide gave you malaria.\n\nA better title might have been: \n\nIn 2019, more people died of infection due to antibiotic resistance, than the number that died of AIDS or Malaria.\n\nAnd this fact could be saying more about progress in the treatment of HIV and Malaria, than the worsening problem of anti-biotic resistance.",
            "title_similarity": "0.70212436",
            "sentiment_compound": -0.7879
        },
        {
            "id": "htg7ih7",
            "score": 1,
            "text": "Quick question from the fairly uneducated on this topic. Bacterial infections are individual to each person that get it correct? So for some people antibiotics might work and others it won’t? Or in this instance are they saying that most bacteria will eventually be resistant regardless of the person?",
            "title_similarity": "0.4810921",
            "sentiment_compound": 0.0
        },
        {
            "id": "htg4nul",
            "score": 4,
            "text": "When a dog starts getting 21 days of amoxicillin for a UTI. Maybe Hoomans need more also.(Hawaii)",
            "title_similarity": "0.50568795",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgbmi8",
            "score": -4,
            "text": "Super bacteria is going to be a huge problem after 2 years of obsessively using hand sanitizer and wearing masks everywhere.\nI wear a mask around other people but never use hand sanitizer. I just wash my hands like I always have.\n\nThis overuse of hand sanitizer is bad.",
            "title_similarity": "0.5615864",
            "sentiment_compound": 0.3628
        },
        {
            "id": "htgecwp",
            "score": 8,
            "text": "Doctors have been horrible at overprescribing antibiotics for the last 30 years, at least, and we wonder why this is happening?  In 2014 alone, there were over 30,000,000 prescriptions of CIPRO, one of the most powerful antibiotics out there.  Really. That many people had life threatening complicated infections?  In reality, Doctors, including mine, have admitted they prescribed CIPRO like water.  We are in a bad situation.  Doctors, both human and veterinary, are supposed to be trustworthy, but they are the ones who have gotten us into this problem.",
            "title_similarity": "0.7107711",
            "sentiment_compound": -0.7544
        },
        {
            "id": "htg5zmw",
            "score": 2,
            "text": "ELI5: If I have never taken an antibiotic will I still have resistance?\n\n*\\*Thank you, everyone*",
            "title_similarity": "0.4654756",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htgbe9j",
            "score": 11,
            "text": "Yet another detrimental side effect of large scale animal agriculture. It's something that unnecessarily harms most of the human and natural world.",
            "title_similarity": "0.46335942",
            "sentiment_compound": -0.1779
        },
        {
            "id": "htgds9a",
            "score": 13,
            "text": "Maybe we should stop factory farming and pumping an abscene amount of antibiotics into those animals all the time..",
            "title_similarity": "0.512607",
            "sentiment_compound": -0.296
        },
        {
            "id": "htg9ssm",
            "score": -3,
            "text": "Can we please stop with the scare stories? Oxford U is researching new AB and theres a natural substance that aids in preventing resistance.",
            "title_similarity": "0.35436514",
            "sentiment_compound": -0.1779
        },
        {
            "id": "htgc3ew",
            "score": 0,
            "text": "Slava Epstine and his company [Novobiotic](http://www.novobiotic.com/) has developed a technology to produce DOZENS of new classes of antiobiotics.  If we can just funnel enough money into developing these new drugs, this problem is solved.",
            "title_similarity": "0.55597866",
            "sentiment_compound": -0.2323
        },
        {
            "id": "htgf952",
            "score": 3,
            "text": "For everyone upset about human medical practices, it's important to remember that animal agriculture is a MUCH bigger problem. From /u/friend_of_kalman/\n\n>>\"Of all antibiotics sold in the United States, approximately 80% are sold for use in animal agriculture; about 70% of these are “medically important” (i.e., from classes important to human medicin\"(https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4638249/)\n\nFarmers buy antibiotics by the bucket. Literally.",
            "title_similarity": "0.67312384",
            "sentiment_compound": 0.0258
        },
        {
            "id": "htgif12",
            "score": 4,
            "text": "I find it very strange that this is so often discussed without mentioning that 50% of the worlds antibiotics are fed to cattle.\nThis is partially due to the condition in factory farming essentially being a perfect petri dish for breeding disease, but it's also due to certain antibiotics leading to cattle reaching slaughter weight slightly quicker.\nAdditionally, rather than determine which animals are actually sick, antibiotics are given to the whole group, as it's an easier process.\n\nAll this to say that antibiotic resistance is largely being driven by animal agriculture, and while there has been some basic legislation to try and curb this in the EU, this has many holes that will likely be exploited by factory farmers. \n\nWe will see more Pandemics in our lifetimes, and they will be driven by the meat and dairy industry.",
            "title_similarity": "0.5600463",
            "sentiment_compound": -0.0249
        },
        {
            "id": "htglh79",
            "score": 0,
            "text": "Hmm. It's almost as if lifeforms adapt and you shouldn't prematurely turn to pharmaceutical products unless you absolutely need to.",
            "title_similarity": "0.2892427",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgo5w9",
            "score": 0,
            "text": "Im not the brightest guy when it comes to science but for those of you who are …..is this the best thing to be posting right now?  Im smart enough to know about antibiotic resistance to a minor degree just from discussions with my doctor.  I know it is real and exists but we have a huge misinformation campaign targeting vaccines right now to a group of people that are scared to get the shot from all sorts of flawed sources.  there are many of you on this sub that could be writing creatively (to hopefully get the dummies to listen through a unique example or something) to get people immunized.  When i read this i feel it feeds the anti vax crowd despite the fact that this is completely different and true.  I dont know about the specifics being cited here but overall i know that antibiotic resistance is a true and real thing.",
            "title_similarity": "0.5252351",
            "sentiment_compound": 0.9167
        },
        {
            "id": "htgy4d7",
            "score": 0,
            "text": "Cannabis can be used to fight antibiotic resistance but you know, cannabis bad. \n\nhttps://www1.racgp.org.au/newsgp/clinical/cbd-shown-to-kill-antibiotic-resistant-bacteria",
            "title_similarity": "0.4395101",
            "sentiment_compound": -0.7615
        },
        {
            "id": "htinity",
            "score": 0,
            "text": "I've been dealing with a MRSA sinus infection for almost a year now. It was \"downgraded\" to heavy staph, but my last culture found MRSA again. Its still sensitive to doxycycline, which I've been on both orally and through a PICC line to no avail. \n\nI just had my second surgery to re-open my sinuses (AGAIN), remove infection, and my doctor found polyps that weren't there over the summer.\n\nThe problem is being allergic to most antibiotics, including what it's most sensitive to, Sulfa drugs.",
            "title_similarity": "0.645574",
            "sentiment_compound": -0.8462
        },
        {
            "id": "htg71dw",
            "score": 14,
            "text": "So stop industrial farming.",
            "title_similarity": "0.22861743",
            "sentiment_compound": -0.3597
        },
        {
            "id": "htgfgpk",
            "score": 10,
            "text": "And the cattle industry is to blame",
            "title_similarity": "0.36227864",
            "sentiment_compound": -0.34
        },
        {
            "id": "htgdazg",
            "score": 40,
            "text": "Majority of antibiotics are currently being used to prop up the cruel, unsustainable industry of factory farming. Please reduce your consumption of animal products. We will all pay dearly (as if covid wasn’t enough) for our gluttony.",
            "title_similarity": "0.54034615",
            "sentiment_compound": -0.0258
        },
        {
            "id": "htg5mo8",
            "score": 49,
            "text": "*glances at India and China using last-line antibiotics as casual every day tools*",
            "title_similarity": "0.43778697",
            "sentiment_compound": 0.2023
        },
        {
            "id": "htgeapu",
            "score": 32,
            "text": "One of the biggest issues facing modern civilization and it barely ever gets talked about. Factory farmers are continuing their awful practices and putting the rest of us at greater and greater risk.",
            "title_similarity": "0.5179488",
            "sentiment_compound": -0.0258
        },
        {
            "id": "htgg434",
            "score": 10,
            "text": "Most antibiotics are used on animals. If you care about this **go vegan** and stop supporting an industry that causes so much harm to animals, our environment, and you!",
            "title_similarity": "0.50124025",
            "sentiment_compound": 0.1062
        },
        {
            "id": "htg754h",
            "score": 1,
            "text": "Antibiotic resistance includes all bacteria. These are two other microorganisms. Is that fair as a statistic?",
            "title_similarity": "0.4106143",
            "sentiment_compound": 0.3182
        },
        {
            "id": "htghyr5",
            "score": 1,
            "text": "My high school chemistry teacher, in 2005, told us that there have been no real advancements in antibiotic development in years so this is just going to continue to get worse.",
            "title_similarity": "0.56850797",
            "sentiment_compound": -0.6486
        },
        {
            "id": "htit9aa",
            "score": -1,
            "text": "I think this says more about how effective we've become at treating AIDS and malaria. Antibiotic resistance is only comparable now because of the advancements we've made on those fronts.",
            "title_similarity": "0.4757981",
            "sentiment_compound": 0.5209
        },
        {
            "id": "htg50q3",
            "score": 100,
            "text": "thanks animal agriculture",
            "title_similarity": "0.033421673",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htg3orx",
            "score": -16,
            "text": "these hand sanitizers that kill 99.9% of germs is so dangerous. i don’t want to deal with the surviving germs",
            "title_similarity": "0.58572453",
            "sentiment_compound": -0.6113
        },
        {
            "id": "htgbo0b",
            "score": 8,
            "text": "There are plenty of new antibiotic candidates waiting for their time to shine, and the necessary funding and will to progress them to the clinic. Everyone knows that they aren’t sexy recurring revenue streams. We only have our own healthcare system to thank for this state of affairs.",
            "title_similarity": "0.47903216",
            "sentiment_compound": 0.8271
        },
        {
            "id": "htgtrs1",
            "score": 7,
            "text": "funfacts:\n\n80% of antibiotics are fed to livestock (in an attempt to counteract the filthy conditions they’re forced to live in)\n\nbillion to trillions of animals are unnecessarily killed each year for markets that exploit them, us, and the planet for money \n\nanimal agriculture (and other industries that exploit animals) are responsible for most pandemics and diseases. the top human diseases are from a diet that includes the intake of animal parts\n\nbetter solutions: \n\nstop using animals. choose instead to buy the products and services that do not capitalize on animals and their enslavement",
            "title_similarity": "0.7022985",
            "sentiment_compound": -0.5859
        },
        {
            "id": "htg601c",
            "score": -2,
            "text": "What is the value or purpose of putting common antibiotics behind a prescription paywall if doctors are gonna Rx them regardless of whether it's an appropriate course of action? \n\nWhy can I go get acetaminophen or dextromethorphan on the shelf - despite their wide potential for misuse and overdose - but need a note to get Zithromax, which I could near about get an infinite supply of as long as I pay my copay to ask a doctor for it each time?",
            "title_similarity": "0.50287795",
            "sentiment_compound": 0.1179
        },
        {
            "id": "htgmh5i",
            "score": 2,
            "text": "I can't see this changing any time soon.\n\nFor any individual, it's rational to err on the side of overusing antibiotics. The side effects are fairly minor and it might fix whatever is bothering you. Even if a sense of social responsibility stops some people, there will always be plenty of people who don't care.\n\nDoctors are then faced with either having to prescribe antibiotics that they know don't help the patient or risk that patient leaving. That's not only an obvious loss of income but it may remove the doctors ability to provide care that the patient actually does need.\n\nIn the absence of some external mechanism (eg doctors can get censured for over prescribing antibiotics) it's logical to expect that people will keep acting as the incentives push them to act.",
            "title_similarity": "0.47340453",
            "sentiment_compound": 0.6659
        },
        {
            "id": "htgsgc2",
            "score": -3,
            "text": "Antibiotic resistance doesn’t kill anyone. Sepsis/infection, which is normally treated with antibiotics, kills people.",
            "title_similarity": "0.5095574",
            "sentiment_compound": -0.8481
        },
        {
            "id": "htgzq48",
            "score": 3,
            "text": "The way the NHS uses antibiotics creates antibiotic resistant diseases. \n\nI expect people reading this dont believe me, heres how. They prescribe antibiotics for one week. If this does not completely cure you, they dont issue a further course of antibiotics until it has fully returned. They will then give you another week course of antibiotics, exactly the same as the first. If this doesnt cure you they say they are not going to give you any more antibiotics and you have to live with it. If you get something else that needs antibiotics they will give you some for that thing. If you tell them if reduces the existing condition or cured it but it came back they stick to the stance of not giving further treatment. I have known several people say this to me including some who say after having them several times over years of an underlying infection antibiotics no longer has any affect on their infection. So as I said, the NHS creates antibiotic resistant diseases.",
            "title_similarity": "0.63296",
            "sentiment_compound": -0.2856
        },
        {
            "id": "htg6eb2",
            "score": 4,
            "text": "It's only going to get worse.",
            "title_similarity": "0.19349465",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htg3s19",
            "score": 20,
            "text": "It's not over prescription that's the main problem. It's when they are not prescribed but available to buy singly OTC. That's what builds resistance. And routinely adding them to animal feed.",
            "title_similarity": "0.347424",
            "sentiment_compound": -0.2144
        },
        {
            "id": "htggvug",
            "score": 102,
            "text": "Why is no one here talking about how animal agriculture is responsible for 80% of antibiotic resistance? Factory farms are the main culprit for this",
            "title_similarity": "0.6307162",
            "sentiment_compound": 0.0258
        },
        {
            "id": "htgjgx9",
            "score": 12,
            "text": "Think about every time you've had to take an antibiotic for something considered trivial. How many times over would you have been dead if those antibiotics had been ineffective or unavailable? I'd be dead like ten times, I think. Maybe more.",
            "title_similarity": "0.7376034",
            "sentiment_compound": -0.8271
        },
        {
            "id": "hth32hv",
            "score": 13,
            "text": "More reasons to go vegan.",
            "title_similarity": "0.23883846",
            "sentiment_compound": 0.0
        },
        {
            "id": "htg52l7",
            "score": 367,
            "text": "\"More than a million people died from antibiotic resistant infections across the globe in 2019, hundreds of thousands more than malaria or HIV/AIDS, according to a new estimate.\"\n\nI get *why* they picked that headline, but I initially read it as a success story against malaria (which has had remarkable philanthropy work in the last decade or two) and AIDS (which is no longer a death sentence in developed countries) than a cautionary tale of antibiotic over-use.\n\nThat \"more than a million\" definitely scares me, though - as far as I can tell, this isn't something that's really in the public eye, and we've had some other pretty alarming news in the last decade of factory farmers having to reach pretty far down the chain of backup-backup-backup antibiotics. The writing is on the wall.",
            "title_similarity": "0.81037664",
            "sentiment_compound": 0.886
        },
        {
            "id": "htg8we1",
            "score": 60,
            "text": "There isn't much research into new antibiotics due to its low profitability for drug companies. They would rather spend the R&D funds for a drug that has to be taken over a lifetime rather than acutely.\n\nEdit: an interesting article on this: https://www.nature.com/articles/d41586-020-02884-3",
            "title_similarity": "0.52116024",
            "sentiment_compound": 0.4019
        },
        {
            "id": "htg9rfx",
            "score": 66,
            "text": "ID doctor here. I'll preface this by saying I could write paragraphs about this stuff but I'm trying to keep posts short and to the point so people read them.  \n\nThis is another reason why azithromycin for COVID-19 is bad. Think of antibiotics like guns. Penicillins and cephalosporins are your little guns. Azithromycin is what we call broad spectrum. It covers a lot of gram positive, gram negative bacteria, and atypicals. It's a bomb. It needs to be held in reserve. Gonna end here so I don't write a book.",
            "title_similarity": "0.45859665",
            "sentiment_compound": -0.7876
        },
        {
            "id": "htg4byb",
            "score": 1488,
            "text": "For the record, the EU has been enacting legislation towards a reduction of antibiotics in cattle for a couple years now. Would be nice if someone could also enact regulations in the US without being called a commie.",
            "title_similarity": "0.5525855",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htg3997",
            "score": 324,
            "text": "That's what happens when you mistake antibiotics for gummy bears.\n\nIt is WAY too overused.",
            "title_similarity": "0.36243066",
            "sentiment_compound": -0.34
        },
        {
            "id": "htgi5aq",
            "score": 129,
            "text": "Did you guys know that about 80% of all antibiotics go straight to livestock farms to be injected into animals? I wonder if that has something to do with it.",
            "title_similarity": "0.6235843",
            "sentiment_compound": 0.2263
        },
        {
            "id": "htgafp4",
            "score": 405,
            "text": "Am I really gonna die from some funky chicken at 40 because people like my family stop taking their medicine halfway through a prescription and pass around the rest when someone gets sick?",
            "title_similarity": "0.5946498",
            "sentiment_compound": -0.8214
        },
        {
            "id": "htfzhqg",
            "score": 173,
            "text": "Can Bacteriophage help?",
            "title_similarity": "0.21984333",
            "sentiment_compound": 0.4019
        },
        {
            "id": "htfxm0v",
            "score": 117,
            "text": "Unusually for me I saw the positive side and thought it was good that we were winning against aids and malaria.",
            "title_similarity": "0.32571268",
            "sentiment_compound": 0.872
        },
        {
            "id": "htg1pdk",
            "score": 1042,
            "text": "Fun fact: MRSA evolved resistance naturally due to a battle with fungi on hedgehogs long before human antibiotic use.\n\nhttps://www.sciencedaily.com/releases/2022/01/220105111403.htm",
            "title_similarity": "0.46485895",
            "sentiment_compound": 0.1779
        },
        {
            "id": "htfumdl",
            "score": 3979,
            "text": "It's so scary. I don't think people realise this could take us back to pre-antibiotic era.",
            "title_similarity": "0.47579092",
            "sentiment_compound": -0.5413
        },
        {
            "id": "htgfx86",
            "score": 198,
            "text": "An article on r/science that discusses my passion! I’m an infectious diseases pharmacist and clinician-researcher that primarily focuses on antimicrobial stewardship to support appropriate antibiotic use.  Factors contributing to antibiotic resistance are multifaceted, but prevalence studies have shown that a good portion of it is driven by inappropriate use and anywhere from 30%-50% of use in hospitals is inappropriate. The US actually has a national action plan for combatting antibiotic resistance that’s been around for a while and Antibiotics awareness week occurs every November. With general information about how we can combat resistance as a society and as individuals",
            "title_similarity": "0.5878979",
            "sentiment_compound": 0.5983
        },
        {
            "id": "htg2hun",
            "score": 295,
            "text": "[removed]",
            "title_similarity": "0.025887012"
        },
        {
            "id": "htg2f23",
            "score": 5213,
            "text": "Imagine not being able to do longer surgeries because antibiotic resistance would almost guarantee contamination and sepsis.",
            "title_similarity": "0.54618484",
            "sentiment_compound": 0.1796
        },
        {
            "id": "htg74qc",
            "score": 1,
            "text": "Super bugs are growing",
            "title_similarity": "0.24965468",
            "sentiment_compound": 0.6808
        },
        {
            "id": "htg9g5s",
            "score": 1,
            "text": "I hate when people can’t",
            "title_similarity": "0.17959267",
            "sentiment_compound": -0.5719
        },
        {
            "id": "htgcf6r",
            "score": 16,
            "text": "Lost my uncle to MRSA. He was rear ended by a truck so hard it severed his spinal cord. He had several surgeries and was growing used to being confined to a wheelchair but he did it all with a smile because he thought the worst was over. His wounds kept getting worse until it was just eating his body. He said he wished he would have gone in the wreck as opposed to surviving and spending the next year and a half being operated on. Then he passed away from MRSA infections going down to the bone.",
            "title_similarity": "0.60148036",
            "sentiment_compound": -0.9045
        },
        {
            "id": "htgcgi7",
            "score": 1,
            "text": "That number will keep going up drastically unless we innovate",
            "title_similarity": "0.32052106",
            "sentiment_compound": 0.5423
        },
        {
            "id": "htgdx5n",
            "score": 1,
            "text": "As someone who hasn't had any before, is this still relevant to me? Passed through parents? Or are germs in general just tougher now because of society using antibiotics?",
            "title_similarity": "0.52767867",
            "sentiment_compound": 0.3049
        },
        {
            "id": "htgecog",
            "score": 9,
            "text": "This needs to be way higher in the news cycle, especially with soooo many people going to the hospital right now.",
            "title_similarity": "0.471974",
            "sentiment_compound": 0.0
        },
        {
            "id": "htged6o",
            "score": 3,
            "text": "Doctors have been overprescribing antibiotics for years.  It doesn’t help that many patients insist on getting them, even when they have a virus that isn’t affected by antibiotics.  My dad is a family physician, and I remember his office having all sorts of PSA posters about this issue to educate patients when I was a kid.  I’m 30 and he’s still fighting that battle.",
            "title_similarity": "0.5802937",
            "sentiment_compound": -0.4588
        },
        {
            "id": "htgezm7",
            "score": 3,
            "text": "This is something that I have been discussing with the laboratories for more than 20 years, ATB should have the same pharmaceutical status as psychopharmaceuticals. Unfortunately it's too late to complain now we have to go looking for alternatives to piperacillin and tazobactam injection",
            "title_similarity": "0.588223",
            "sentiment_compound": -0.5994
        },
        {
            "id": "htgf000",
            "score": 1,
            "text": "Not good - this seems like something that’s going to become a much bigger issue in the next few decades",
            "title_similarity": "0.46551904",
            "sentiment_compound": 0.0243
        },
        {
            "id": "htgfbm9",
            "score": 1,
            "text": "Guess what a common anti malaria drug is?",
            "title_similarity": "0.3147077",
            "sentiment_compound": -0.3182
        },
        {
            "id": "htgfczh",
            "score": 11,
            "text": "\"Whoa-oh, MRSA, MRSA me...things ain't what they used to be..\"",
            "title_similarity": "0.19759992",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgfh85",
            "score": 2,
            "text": "We need to prohibit extensive antibiotics usage in animal farming and tighten hygienic standards in hospitals.",
            "title_similarity": "0.40916348",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgfqlb",
            "score": 1,
            "text": "Phage therapy could solve this!",
            "title_similarity": "0.18788481",
            "sentiment_compound": 0.2714
        },
        {
            "id": "htggicq",
            "score": 1,
            "text": "yikes this should be bigger news than it is. I know in the UK the doctors are trying to cut back on its use unless absolutely needed.",
            "title_similarity": "0.5171546",
            "sentiment_compound": -0.2732
        },
        {
            "id": "htghlni",
            "score": 1,
            "text": "I've had to take antibiotics a lot this year because of dental work.   About only time i take them really over so many years.  Maybe when I had my appendix out in 2016 was last time.  \n\nI'm also allergic to amoxicilin...",
            "title_similarity": "0.6235025",
            "sentiment_compound": -0.296
        },
        {
            "id": "htghpcc",
            "score": 1,
            "text": "Anyone find it interesting how no one here is saying this is a non issue because car crashes or cancer, the deep state or xyz kill more people per year.",
            "title_similarity": "0.6925906",
            "sentiment_compound": -0.8625
        },
        {
            "id": "htgifjg",
            "score": 1,
            "text": "Well that's terrifying",
            "title_similarity": "0.057560004",
            "sentiment_compound": -0.3818
        },
        {
            "id": "htgiysi",
            "score": 1,
            "text": "This is my \"why aren't we talking about this\" topic",
            "title_similarity": "0.06680174",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgja4b",
            "score": 1,
            "text": "Nate’s fantasy’s about 100 miles of malaria",
            "title_similarity": "0.5490782",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgjb83",
            "score": 1,
            "text": "This post is very timely. I’ve developed a bacterial infection a day or two after my booster shot, and I’m currently on my penultimate day on antibiotics.",
            "title_similarity": "0.5650346",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgjmjk",
            "score": 1,
            "text": "I work for a Pharma company in India handling the AI portfolio, and trust me, our main communication has always been about effectively using AI to patients. Doctor's while do agree, not much is being done to support AMR. Hopefully this changes in the post COVID world.",
            "title_similarity": "0.4080385",
            "sentiment_compound": 0.9201
        },
        {
            "id": "htgjvvo",
            "score": 1,
            "text": "Sometimes I wonder if I'll ever get a break from the world is ending news.  Antibiotic resistance, global warming, covid, no money, and the list goes on.",
            "title_similarity": "0.5404679",
            "sentiment_compound": -0.1531
        },
        {
            "id": "htgkbgw",
            "score": 1,
            "text": "Without antibiotics there will be more deaths.",
            "title_similarity": "0.60928404",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgkl39",
            "score": 1,
            "text": "Is there any further work being done in bacteriophage treatment?",
            "title_similarity": "0.30556107",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgkowo",
            "score": 2,
            "text": "Help educate my ignorance please. How does mis-prescribing and taking antibiotics for a virus make a particular bacteria strain (which isn't present in that person, since they have a virus) resistant to antibiotics?",
            "title_similarity": "0.4326188",
            "sentiment_compound": 0.3182
        },
        {
            "id": "htgkz4i",
            "score": 1,
            "text": "This terryifing and has been discussed for years and years as an issue. Over prescribing has played its part and antibiotics in the meat industry. :/ phages a partial solution maybe?",
            "title_similarity": "0.44152978",
            "sentiment_compound": 0.3182
        },
        {
            "id": "htgl5rl",
            "score": 1,
            "text": "ELI5, Could this be overcome by new research  and medicines?",
            "title_similarity": "0.3629849",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgl98w",
            "score": 1,
            "text": "This is the most terrifying news. Why isn't literally everyone freaking out?",
            "title_similarity": "0.39377058",
            "sentiment_compound": -0.3941
        },
        {
            "id": "htgldbc",
            "score": 1,
            "text": "Good thing we’re already getting practice isolating during a pandemic. If antibiotics loose all effectiveness then we’ll pretty much have to create a society where every individual person lives at home 24/7 unless we want to return to pre-Victorian mortality rates",
            "title_similarity": "0.58675885",
            "sentiment_compound": 0.7351
        },
        {
            "id": "htgldq8",
            "score": 1,
            "text": "Lets increase investment/research in phage therapy.  Could be the silver bullet to defeat these monsters once and for all. Turns out bacteria that are resistant to anti biotics are very vulnerable to phages and visa versa, we could trap the bastards in a catch 22.",
            "title_similarity": "0.5549922",
            "sentiment_compound": -0.8883
        },
        {
            "id": "htgltwh",
            "score": 1,
            "text": "The future is here finally",
            "title_similarity": "0.06731332",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgm4tk",
            "score": 1,
            "text": "Can we all agree to quit sharing sources with paywalls?  If GOP Qanon toilet bowls can share their lies for free, what is preventing us from sharing the truth for free?",
            "title_similarity": "0.3874176",
            "sentiment_compound": 0.9399
        },
        {
            "id": "htgmkfz",
            "score": 1,
            "text": "wait til they hear what happened in 2020 and 2021",
            "title_similarity": "0.24026297",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgn8ec",
            "score": 1,
            "text": "I am allergic to all -cillin antibiotics. It's awful, as I wasn't always.",
            "title_similarity": "0.45702815",
            "sentiment_compound": -0.6369
        },
        {
            "id": "htgnagu",
            "score": 1,
            "text": "This is why you shouldn't take drugs that do nothing for whatever illness you are suffering.\n\nI.e. taking Ivermectin to treat covid. Yeah Ivermectin probably won't hurt the person taking it but they are risking potential antibiotic resistance.",
            "title_similarity": "0.3219036",
            "sentiment_compound": -0.0085
        },
        {
            "id": "htgnl5k",
            "score": 1,
            "text": "If people stop abusing and not finishing antibiotics that’d be helpful.",
            "title_similarity": "0.30739373",
            "sentiment_compound": -0.34
        },
        {
            "id": "htgnwim",
            "score": 1,
            "text": "Can anyone tell me whether antibiotic resistance is an individual's issue or do these resistant bacteria propagate and there is nothing an individual can do? In other words: Do I have to worry myself when I never injected antibiotics into me? I was never sick enough to get a prescription.",
            "title_similarity": "0.46898842",
            "sentiment_compound": -0.1426
        },
        {
            "id": "htgo25f",
            "score": 1,
            "text": "The superbugs are coming for us!",
            "title_similarity": "0.19993493",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgogxu",
            "score": 1,
            "text": "Does anyone know how much animal agriculture contributes to this problem?",
            "title_similarity": "0.33805996",
            "sentiment_compound": -0.481
        },
        {
            "id": "htgosx8",
            "score": 1,
            "text": "I remember back around the year 2000, many experts were saying \"in 50 years antibiotics may no longer work\".  Bacteria are smart and learn to resist what they're against over time, hopefully the medical industry comes up with a new version of antibiotics by then.",
            "title_similarity": "0.61371505",
            "sentiment_compound": 0.4939
        },
        {
            "id": "htgp0e9",
            "score": 1,
            "text": "Does this happen when people take too many antibiotics?",
            "title_similarity": "0.5056219",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgp1y4",
            "score": 3,
            "text": "This is why you should always, *always* completely finish any round of antibiotics you've been prescribed even after you feel better.\n\nYou could unwittingly give the vestiges of whatever made you sick in the first place the time and resources to start mutating against the antibiotics.",
            "title_similarity": "0.458561",
            "sentiment_compound": -0.1027
        },
        {
            "id": "htgp4ca",
            "score": 1,
            "text": "Nobody tell them about 2021",
            "title_similarity": "0.24229717",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgp7oj",
            "score": 2,
            "text": "For those who wish to read the actual study and missed the DOI at the end of the article, the link is here - https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)02724-0/fulltext",
            "title_similarity": "0.28880328",
            "sentiment_compound": 0.128
        },
        {
            "id": "htgp7u4",
            "score": 2,
            "text": "We continue to have a major problem with outpatient prescribing of abx for upper respiratory ailments and minor ear infections.   Some interventions have been attempted, but it seems like foregoing the guidelines and treating mom's apprehension takes priority too often.  \n\nWhat can be done differently?\n\n\n https://pubmed.ncbi.nlm.nih.gov/34279868/",
            "title_similarity": "0.4360752",
            "sentiment_compound": -0.4398
        },
        {
            "id": "htgpx92",
            "score": 1,
            "text": "Funny story. My Dad refused to let his kids have antibiotics. He said people need to fight off sickness naturally. Hes been dead for almost 20 years and he's still fkn right about everything. Miss you Dad.\nEdit: He passed away at the age of 98 from natural causes. Oh and he recommended not bathing more than once a week because it washes off the \"good bacteria.\" Guess what? He was fkn right about that too.",
            "title_similarity": "0.59819686",
            "sentiment_compound": -0.1531
        },
        {
            "id": "htgpysa",
            "score": 1,
            "text": "You hear that guys? We're winning the fight against malaria and AIDS!",
            "title_similarity": "0.4621649",
            "sentiment_compound": 0.2714
        },
        {
            "id": "htgpzaq",
            "score": 1,
            "text": "Bring on the phages then.",
            "title_similarity": "0.112173766",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgqnmh",
            "score": 1,
            "text": "Oh yeah. An antibiotic resistant infection almost killed me at age 21 and it’s been 6 years, my body still aint the same. No one ever talks about this giant threat to our humanity 🤷‍♀️",
            "title_similarity": "0.6338955",
            "sentiment_compound": -0.6725
        },
        {
            "id": "htgqrqv",
            "score": 2,
            "text": "Meanwhile, my Karen relatives still take their children to hospital and scream for antibiotics when they have a common cold because “last time the doctor gave them antibiotics and the cold went away” with no understanding that colds are VIRUSES. I have explained this. They continue to insist that it works.",
            "title_similarity": "0.53503686",
            "sentiment_compound": -0.5994
        },
        {
            "id": "htgr28h",
            "score": 1,
            "text": "Is this their excuse for early covid treatment not existing?",
            "title_similarity": "0.19333775",
            "sentiment_compound": 0.0772
        },
        {
            "id": "htgrecv",
            "score": 1,
            "text": "It's so alarming. why this happen??",
            "title_similarity": "0.125078",
            "sentiment_compound": -0.2853
        },
        {
            "id": "htgrmjy",
            "score": 3,
            "text": "Finish. Your. Damn. Antibiotic. Course.",
            "title_similarity": "0.29442325",
            "sentiment_compound": -0.4019
        },
        {
            "id": "htgrp6d",
            "score": 1,
            "text": "I \"had\" MRSA (I've done 2 rounds of different antibiotics over the course of a year So here's hoping it's gone now), and it sucked. I could lose a limb from a simple cut or scratch because there isn't anything to treat it.",
            "title_similarity": "0.65905267",
            "sentiment_compound": -0.7166
        },
        {
            "id": "htgrqra",
            "score": 1,
            "text": "This is why I avoid antibiotics unless absolutely necessary. As a kid I had recurring athlete’s foot and was given antibiotic fungal cream multiple times. I’d use it until everything seemed clear, but then it would come back a month or two later.\n\nAfter this happened 3-4 times, I noticed each time it took longer for my athlete’s foot to clear up. By the end, I used the cream even after everything seemed clear and it never returned again.",
            "title_similarity": "0.57598764",
            "sentiment_compound": 0.7906
        },
        {
            "id": "htgrttd",
            "score": 1,
            "text": "This study looks suspect.",
            "title_similarity": "0.116827466",
            "sentiment_compound": -0.296
        },
        {
            "id": "htgrwxs",
            "score": 1,
            "text": "Thanks to agribusiness and people consuming ridiculous amounts of cheap unethically raised meat.",
            "title_similarity": "0.43439186",
            "sentiment_compound": 0.1027
        },
        {
            "id": "htgsubx",
            "score": 1,
            "text": "This is a serious issue and it is getting worse.",
            "title_similarity": "0.20392841",
            "sentiment_compound": -0.5267
        },
        {
            "id": "htgsz7z",
            "score": 2,
            "text": "“The key to tackling antimicrobial resistance is multifaceted, says Naghavi. “Developed countries need to prescribe fewer antibiotics and develop more vaccines for infectious diseases,” he says.”\n\nDevelop more vaccines… the last year or so makes me think that avenue may not work very well. For whatever reason, vaccines have become the boogeyman to many people. I don’t think many people understand the danger we will soon face in public health because of this one fact.\n\nVaccines used to be a necessity for the vast majority of people, but they have now been trivialized in the publics eyes, ironically due to the success of vaccination. \n\nAs a culture, we must pivot from focusing on treatment to focusing on prevention before we destroy our ability to treat many diseases, not just with vaccination, but with general health and nutrition. Keeping people from getting sick is far far better than treating someone after they are infected. \n\nI try to stay hopeful for the future, but this scares me. We are battling against a powerful natural process of which bacteria are masters. We need to unite as a people, if that is at all possible at this point.",
            "title_similarity": "0.6799735",
            "sentiment_compound": 0.5283
        },
        {
            "id": "htgt249",
            "score": 8,
            "text": "And that’s why we should stop eating animals in the first place! We simply damaging ourselves by doing it.",
            "title_similarity": "0.35617176",
            "sentiment_compound": -0.6996
        },
        {
            "id": "htgt5p0",
            "score": 7,
            "text": "80% of antibiotics in the US is fed to livestock just to fatten them up. The places they live in are also huge cess pools filled with feces and therefore bacteria, where could all these antibiotic resistant bacteria emerge from?",
            "title_similarity": "0.61229235",
            "sentiment_compound": 0.3182
        },
        {
            "id": "htgt7ki",
            "score": 2,
            "text": "I actually wrote a research proposal about this recently and let me tell you, we are completely and utterly fucked. By the year 2050 it's predicted that antimicrobial-resitant (AMR) bacteria will kill more people than cancer worldwide. It isn't just a matter of people abusing antibiotics either. The agricultural industry is pumping farm animals full of antimicrobial drugs 24/7. Not only does this make their bodies petri-diashes for super-bugs, but about 70% of the antimicrobial drugs pass through the animals' waste. That waste is turned into manure and sprayed onto the topsoil which creates the opportunity for an even acceleration acceleration of antimircrobial resistannce. Then it rains and those antimicrobials drugs in the manure seap into the ground water, and on, and on, and on.",
            "title_similarity": "0.7669457",
            "sentiment_compound": -0.8945
        },
        {
            "id": "htgtke2",
            "score": 1,
            "text": "That's gonna be a big problem for the next decades",
            "title_similarity": "0.3999108",
            "sentiment_compound": -0.4019
        },
        {
            "id": "htgu1ke",
            "score": 1,
            "text": "Sucks but it also saved generations of people being wiped off the face of the earth as well",
            "title_similarity": "0.48525897",
            "sentiment_compound": 0.6808
        },
        {
            "id": "htgus9m",
            "score": 2,
            "text": "I mean I'm not surprised. I've heard plenty of people say they've stopped giving their pets meds because \"oh it seemed like they were fine now\" only for the issue to come back because they didn't finish their prescription.\n\nYou can't tell me there are people that don't do the same for themselves or their kids.",
            "title_similarity": "0.49463367",
            "sentiment_compound": 0.4826
        },
        {
            "id": "htgw1vx",
            "score": 3,
            "text": "Been looking for a place to drop this besides on my friends.\n\nI used to get MRSA outbreaks every 1-3 months. Sometimes multiple infections at a time. It forms first as a zit, but then very quickly grows into a full infection. It was never a break on skin or a cut. Allergic to Vancomycin, so I was treated with Clindamycin. It was to the point that I didn't need to go to the doctor. A call to the office and a trip to Walgreens was it. About three years ago I decided not to call the doctor. I kept the area warm, raised and didn't mess with it. It cleared up faster than any time before, albeit I took a little extra effort to rest. The frequency and intensity of infections dropped. Today, I can not remember the last time I had an infection. \n\nI don't know how this is fully relevant, but it's been on my mind this week.",
            "title_similarity": "0.57549393",
            "sentiment_compound": 0.1692
        },
        {
            "id": "htgwgrr",
            "score": 2,
            "text": "Fun fact, my microbial physiology professor last semester told us about how he used to study antibiotics trying to find narrow spectrum options. The kicker: He got laid off because companies would rather focus on drugs that make money than things that are important.",
            "title_similarity": "0.57153356",
            "sentiment_compound": 0.6249
        },
        {
            "id": "htgwyl6",
            "score": 1,
            "text": "\"Wide variety of diseases killed more than these two diseases\"",
            "title_similarity": "0.6663054",
            "sentiment_compound": -0.6705
        },
        {
            "id": "htgx8g2",
            "score": 1,
            "text": "Weren't there some studies into using bacteriophages instead of antibiotics? How is that going?",
            "title_similarity": "0.3818153",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgxfgi",
            "score": 1,
            "text": "And yet doctors are still giving out medicine for super minor infections.",
            "title_similarity": "0.36667046",
            "sentiment_compound": 0.743
        },
        {
            "id": "htgxyh5",
            "score": 1,
            "text": "We need to stop using it for animals or at least animal agriculture. No matter if you are eating meat or not, the price (human lives), is to high to do that",
            "title_similarity": "0.4606123",
            "sentiment_compound": -0.3125
        },
        {
            "id": "htgy1mo",
            "score": 1,
            "text": "This is why I froth at the mouth whenever I see Cipro being used as prophylaxis and want to strangle the doc who prescribed it.",
            "title_similarity": "0.41652396",
            "sentiment_compound": 0.0772
        },
        {
            "id": "htgy9ej",
            "score": 1,
            "text": "Can you get vaccine resistance due to, too many boosters. I don’t know how this works and am not a scientist. So it’s a genuine question.",
            "title_similarity": "0.47168618",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgyewj",
            "score": 1,
            "text": "But, hey, keep eating so much meat that we need to factory farm and pump animals full of antibiotics constantly. Keep demanding antibiotics for a small cold. Use all of that antibacterial hand soap. \n\nJust keep on keeping on. I'm sure nothing bad will come of it if we don't do anything different.",
            "title_similarity": "0.40852147",
            "sentiment_compound": 0.8649
        },
        {
            "id": "htgyfuy",
            "score": 1,
            "text": "\"...and other diseases that don't kill that many people anymore.\"",
            "title_similarity": "0.5550129",
            "sentiment_compound": 0.5773
        },
        {
            "id": "htgym2c",
            "score": 1,
            "text": "This really scares me. I’m allergic to 8 common antibiotics…and those are just the ones I know about. I have to use older, out-of-common-use antibiotics that have to be specially compounded by a hospital pharmacy. It’s expensive and still carries the risk that I’ll have an allergic reaction. As antibiotics become obsolete due to antibiotic resistance, the pool of antibiotics that are available to me becomes much smaller. Yikes!",
            "title_similarity": "0.56669784",
            "sentiment_compound": -0.8653
        },
        {
            "id": "htgz0re",
            "score": 1,
            "text": "Go vegan if you care about this.",
            "title_similarity": "0.14203566",
            "sentiment_compound": 0.4939
        },
        {
            "id": "htgz3m7",
            "score": 1,
            "text": "We need alot more investment into phage therapy? It is the long term answer to antibiotic resistant bacteria.",
            "title_similarity": "0.47370887",
            "sentiment_compound": 0.0
        },
        {
            "id": "htgzbg6",
            "score": 2,
            "text": "Is that good or bad?  Does it mean that Malaria and AIDS is becoming more treatable and less deadly?",
            "title_similarity": "0.42862147",
            "sentiment_compound": -0.2406
        },
        {
            "id": "hth0vid",
            "score": 3,
            "text": "Finish.Your.Antibiotics. PLEASE.\n\nPeople still try to \"save\" or dispense it to someone else.",
            "title_similarity": "0.29878533",
            "sentiment_compound": 0.7378
        },
        {
            "id": "hth1jh4",
            "score": 2,
            "text": "While we live in a capitalist world, we always will wait until it's too late, take COVID as a example. Unfortunately, money speaks too loud to government to take good initiatives of research, and climate laws, etc. At least as far I notice, seems that this is the way we all die. Unless people mind change and actually notice how wrong the world is right now. I can only hope for.",
            "title_similarity": "0.5060272",
            "sentiment_compound": -0.5574
        },
        {
            "id": "hth1p1b",
            "score": 1,
            "text": "ELI5: Why haven't we tried switching to bacteriophages if that's the case? I saw a Kurzgesagt video a few years ago about them and I wanted ro know if that's still a relevant option or has it been since disproven as a viable option, and if so, why?",
            "title_similarity": "0.42812508",
            "sentiment_compound": 0.0
        },
        {
            "id": "hth3e4l",
            "score": 1,
            "text": "Not to discount these figures but aren’t we pretty well versed on most facets of malaria and AIDS?  In addition to these being pretty regionalized (malaria especially).\n\nIs this truly a good comparison?",
            "title_similarity": "0.43263814",
            "sentiment_compound": 0.9702
        },
        {
            "id": "hth3e81",
            "score": 2,
            "text": "At this point, my survival kit is just going to be a pistol and one bullet for the future",
            "title_similarity": "0.36763033",
            "sentiment_compound": 0.0
        },
        {
            "id": "hth47cs",
            "score": 1,
            "text": "Meanwhile in China antibiotics are given to live stock and some western nations continue give them out like smarties for viral chest infections that antibiotics do literally 0 for. \n\nShould really get more focus this as it’s just another disaster we’re sleep walking into.",
            "title_similarity": "0.54421496",
            "sentiment_compound": 0.0258
        },
        {
            "id": "hth5in4",
            "score": 1,
            "text": "I’m not taking any damn antibiotics, give me liberty or give me death",
            "title_similarity": "0.30998343",
            "sentiment_compound": 0.1921
        },
        {
            "id": "hth5mhf",
            "score": 1,
            "text": "Always finish your antibiotic course. Even if you're feeling better, finish the tabs you're prescribed by the doctor.",
            "title_similarity": "0.35239056",
            "sentiment_compound": 0.5267
        },
        {
            "id": "hth5xk7",
            "score": 1,
            "text": "Who to blame for this?",
            "title_similarity": "0.08743436",
            "sentiment_compound": -0.34
        },
        {
            "id": "hth6irx",
            "score": 1,
            "text": "Do animal antibiotics also pass through milk?",
            "title_similarity": "0.2879331",
            "sentiment_compound": 0.0
        },
        {
            "id": "hth6u8f",
            "score": 3,
            "text": "I'm not sure if anyone has already mentioned this but,\n\nIf you are ever dying from an antibiotic resistant bacteria and they tell you there is nothing you can do and to get your affairs in order, don't give up. Look into countries that offer phage therapy. Simply put, a phage is a virus that can be targeted to infect a certain bacteria. \nThere are trials in the USA but drug companies aren't very interested in phage therapy because it needs to be tailored to the individual and your specific infection.  You can't just slap it in a bottle and mass market it so it's not easy profit. It's also difficult (maybe impossible?) for the FDA to approve a therapy that is constantly modified for different bacteria. \n\nIf they can target your specific infection, it works and has saved lives.\n\nOf course the use of a self replicating virus is not zero risk and it is costly to fly overseas but I'm posting this here as an alternative to dying since some people mentioned in this thread that they had loved ones die from antibacterial resistant infections.\n\nHere is the Wikipedia entry for phage therapy:\n\nhttps://en.wikipedia.org/wiki/Phage_therapy",
            "title_similarity": "0.5009612",
            "sentiment_compound": -0.8048
        },
        {
            "id": "hth8rif",
            "score": 1,
            "text": "Thanks every country that allows people to buy antibiotics over the counter! I hope you're happy",
            "title_similarity": "0.34080264",
            "sentiment_compound": 0.8687
        },
        {
            "id": "hth91jg",
            "score": 1,
            "text": "And yet as a healthcare provider, I get patients all the time who come into my office demanding antibiotics for conditions that don’t require them, and will even leave nasty online reviews after explaining to them that I can’t prescribe them for these exact reasons. Sometimes you can’t win.",
            "title_similarity": "0.4644421",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hth91zi",
            "score": 2,
            "text": "And more deaths than COVID in 2021.",
            "title_similarity": "0.77559364",
            "sentiment_compound": 0.0
        },
        {
            "id": "hthadrh",
            "score": 1,
            "text": "This is my nightmare and I worry about it every time I get sick. I had chronic ear infections as a kid and they pumped me full of antibiotics to make it go away. Now, I'm super resistant. I still get ear infections, but I have to take an extremely strong antibiotic to even have a little effect.",
            "title_similarity": "0.54906213",
            "sentiment_compound": 0.6416
        },
        {
            "id": "hthak4o",
            "score": 1,
            "text": "Is the kind of thing an mRNA vaccine could cure fairly easily?",
            "title_similarity": "0.369264",
            "sentiment_compound": 0.34
        },
        {
            "id": "hthbkwa",
            "score": 3,
            "text": "And by 2050, antibiotic resistance will most likely kill more people annually than all cancers combined.",
            "title_similarity": "0.89268786",
            "sentiment_compound": -0.7165
        },
        {
            "id": "hthbt6y",
            "score": 1,
            "text": "Though technically true, most probably it is the same fallacy like saying that medical mistakes are the most probable cause of death in the hospital.  \nSome people are so ill, any bug will kill them. But of course, if it is a resistant bug, then it might be really difficult to treat their pneumonia or UTI.",
            "title_similarity": "0.5528178",
            "sentiment_compound": -0.6654
        },
        {
            "id": "hthcal4",
            "score": 2,
            "text": "Of course antibiotic resistant bacteria arise. That started happening soon after penicillin was being administered. That’s how evolution works. The rise of antibiotic resistant strains is not the problem. The problem is that there are few monetary incentives for Pharma to screen for new antibiotics. They effectively stopped doing it because no one is going to fund it to the level it needs to be successful.",
            "title_similarity": "0.51996595",
            "sentiment_compound": 0.5037
        },
        {
            "id": "hthcrgx",
            "score": 4,
            "text": "Quick let’s add more antibiotics to all the meat because they don’t take care of the animals. We need that survivability rate to be zero dammit/S",
            "title_similarity": "0.541443",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hthcs1b",
            "score": 1,
            "text": "Quick let’s add more antibiotics to all the meat because they don’t take care of the animals. We need that survivability rate to be zero dammit/S",
            "title_similarity": "0.541443",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hthd772",
            "score": 7,
            "text": "Big reason we need to stop eating meat (and dairy and eggs), factory farms with animals full of antibiotics are the perfect breeding grounds for bacteria",
            "title_similarity": "0.39920482",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hthd9lf",
            "score": 1,
            "text": "This is it. This is the end, folks.",
            "title_similarity": "0.0699835",
            "sentiment_compound": 0.0
        },
        {
            "id": "hthdy4c",
            "score": 1,
            "text": "I am glad to see the folks here know it's the virus with the resistance, not the person",
            "title_similarity": "0.2936635",
            "sentiment_compound": 0.4588
        },
        {
            "id": "hthfziz",
            "score": 3,
            "text": "The title is misleading.   It's not antibiotic resistance that kills people.  It's the things that are resistant to antibiotics that are killing people.  But, point made.  We are in increasing danger from \"bugs\" that are more resistant or completely resistant.",
            "title_similarity": "0.49870193",
            "sentiment_compound": -0.886
        },
        {
            "id": "hthg83p",
            "score": 1,
            "text": "This would be much scarier if bacteriophages didn't exist",
            "title_similarity": "0.3689833",
            "sentiment_compound": 0.0
        },
        {
            "id": "hthge3k",
            "score": 1,
            "text": "Does this have anything to do with MCR 9?",
            "title_similarity": "0.16300058",
            "sentiment_compound": 0.0
        },
        {
            "id": "hthgn9u",
            "score": 13,
            "text": "Antibiotic resistance! Brought to you by [animal agriculture](https://www.who.int/news/item/07-11-2017-stop-using-antibiotics-in-healthy-animals-to-prevent-the-spread-of-antibiotic-resistance), everyone who still eats meat, and people who insist on taking anti**biotics** for viral infections.",
            "title_similarity": "0.46032166",
            "sentiment_compound": 0.0
        },
        {
            "id": "hthhfhx",
            "score": 1,
            "text": "The good news is: Medicine has come a long way.\n\nThe Bad news is: We've gotten so much less healthy as a populous. Especially 'Merica",
            "title_similarity": "0.57877076",
            "sentiment_compound": 0.2665
        },
        {
            "id": "hthhfms",
            "score": 1,
            "text": "I had quite a bit of antibiotics when I was younger.",
            "title_similarity": "0.4097697",
            "sentiment_compound": 0.0
        },
        {
            "id": "hthhw61",
            "score": 1,
            "text": "Yeah I work in a Hospital Microbiology lab, and I see so many sensitivity's done where things are just so resistant. It's scary. There's this one person, in their 40's, who has multiple MDRO's all over her body. In her urine cultures, respiratory cultures. I see so much MRSA and VRE too.",
            "title_similarity": "0.50533915",
            "sentiment_compound": -0.3102
        },
        {
            "id": "hthhxnl",
            "score": 1,
            "text": "TBH Doctors kinda did this to themselves. For years they were over-prescribing antibiotics and have been warned that this day would come. And it did.",
            "title_similarity": "0.49751526",
            "sentiment_compound": -0.2732
        },
        {
            "id": "hthi1sa",
            "score": 1,
            "text": "The more we come up with antibiotics doesn’t our body become more immune to them therefore making this happen? I read something like that somewhere that the more we use them the more likely they will\nStart to not work",
            "title_similarity": "0.5139952",
            "sentiment_compound": 0.6115
        },
        {
            "id": "hthjkqa",
            "score": 1,
            "text": "I'm aware of doctors still prescribing antibiotics for viruses and lingering mystery illnesses. There must be some kind of proof of infection protocol for local gps put in place.",
            "title_similarity": "0.36179718",
            "sentiment_compound": -0.4939
        },
        {
            "id": "hthk25m",
            "score": 1,
            "text": "Wow!! Amazing job that we made so much progress on malaria and aids.",
            "title_similarity": "0.40585843",
            "sentiment_compound": 0.9055
        },
        {
            "id": "hthl6es",
            "score": 1,
            "text": "Isn’t infection the killer, not antibiotic resistance?",
            "title_similarity": "0.3535244",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hthlvv5",
            "score": 1,
            "text": "They pop antibiotics like tic tacs in the middle east",
            "title_similarity": "0.33012235",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hthmnhs",
            "score": 1,
            "text": "That’s why you can’t buy antibiotics over the counter in the US",
            "title_similarity": "0.46799833",
            "sentiment_compound": 0.0
        },
        {
            "id": "htho0pq",
            "score": 1,
            "text": "This is sadly just the beginning, and too make things worst I expect the same reaction antivaxers  had to covid when antibiotic resistant Bacteria become a more frequent thing.",
            "title_similarity": "0.4926641",
            "sentiment_compound": -0.7845
        },
        {
            "id": "hthoe8r",
            "score": 1,
            "text": "What theories are out there as to what or why this resistance is happening?",
            "title_similarity": "0.10824748",
            "sentiment_compound": 0.0
        },
        {
            "id": "hthozlr",
            "score": 1,
            "text": "Is it possible for bacteria to just keep adding on resistances, indefinitely? Like a database with no limit.",
            "title_similarity": "0.2968284",
            "sentiment_compound": 0.0772
        },
        {
            "id": "hthp9im",
            "score": 1,
            "text": "But, where are the deaths occurring, purely geographically?",
            "title_similarity": "0.2885199",
            "sentiment_compound": 0.0
        },
        {
            "id": "hthpcom",
            "score": 1,
            "text": "The trouble is that we want a lot of food (animal source) we want it cost affordable no matter what happen. Intensive breeding cares of animals only on paper and marketing, but are disgusted by animals they breed, much more interested on money, money money. Then antibiotic is pushed on animals in very low dose so that animals live at least to be ready to be killed and microbs ready to get enforced cycle by cycle. Then we want be our doctor, so we buy antibiotics and take em as candies. Or simply we buy much more antibiotics than needed and take much more antibiotics or we stop to take antibiotics sadly as soon... since we see effects as some people are worried by antibiotics. A lot of people are concerned by covid by very few are aware from pigs, chicken and other animals with bacterial infections rising up and up.\nI would like to have meat, chicken or fish at the right cost without having to push any antibiotics... and eat much more protein vegetables.",
            "title_similarity": "0.51296633",
            "sentiment_compound": -0.8637
        },
        {
            "id": "hthpuwu",
            "score": 1,
            "text": "Isn’t the majority of antibiotics prescribed by dermatologist?",
            "title_similarity": "0.42612296",
            "sentiment_compound": 0.0
        },
        {
            "id": "hthqh72",
            "score": 1,
            "text": "It’s cuz doctors give antibiotics out like candy.",
            "title_similarity": "0.2601351",
            "sentiment_compound": 0.3612
        },
        {
            "id": "hthrcag",
            "score": 1,
            "text": "Better go get that vaccine",
            "title_similarity": "0.27334034",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hthsu4s",
            "score": 1,
            "text": "Guess we need to start producing Bacterophages then... Good thing we've had a sudden spike in Biomedical research of late!",
            "title_similarity": "0.5196782",
            "sentiment_compound": 0.4926
        },
        {
            "id": "htht1vi",
            "score": 1,
            "text": "exactly, so stop using antibiotics to treat every tiny cold.",
            "title_similarity": "0.29252294",
            "sentiment_compound": 0.0534
        },
        {
            "id": "htht8jr",
            "score": 1,
            "text": "\"AIDS huh thats pretty retro\"",
            "title_similarity": "0.23041126",
            "sentiment_compound": 0.4939
        },
        {
            "id": "hthtfq5",
            "score": 1,
            "text": "Dude when do they start making Pills to end your suffering as quick and painless as possible?\nThey should come in handy in a few years...",
            "title_similarity": "0.49822575",
            "sentiment_compound": -0.2263
        },
        {
            "id": "hthujxx",
            "score": 1,
            "text": "Scrolling through the comments has me wondering if people are really ignorant of where most antibiotics go, or if they're just trying to be funny.",
            "title_similarity": "0.32174158",
            "sentiment_compound": 0.1298
        },
        {
            "id": "hthuw61",
            "score": 1,
            "text": "Now do ADE for the mrna injections.",
            "title_similarity": "0.10675962",
            "sentiment_compound": 0.0
        },
        {
            "id": "hthvop7",
            "score": 1,
            "text": "A huge contributing factor is lack of affordable medical care in countries like the US. Many families spread out medication simply because they can't afford more. We absolutely need to bring medical costs down to prevent stuff like this.",
            "title_similarity": "0.6132221",
            "sentiment_compound": 0.8074
        },
        {
            "id": "hthwg2f",
            "score": 2,
            "text": "Um, no. Infections killed them.",
            "title_similarity": "0.38948947",
            "sentiment_compound": -0.6705
        },
        {
            "id": "hthwgpe",
            "score": 1,
            "text": "This tells me that we’ve made quite a bit of progress against HIV. We’re not done, but that virus has taken a beating, which is good.",
            "title_similarity": "0.45581603",
            "sentiment_compound": 0.1901
        },
        {
            "id": "hthwoo5",
            "score": 1,
            "text": "Sounds like the best case to stop eating meat if I've ever heard one",
            "title_similarity": "0.36778045",
            "sentiment_compound": 0.6705
        },
        {
            "id": "hthxnzd",
            "score": 1,
            "text": "I’ve been hearing stories about MRSA from my mother since I was a little kid. This apocalypse has been a long time coming. Soon we’ll return to the days where drinking from the wrong cup or standing in the rain too long might be a death sentence",
            "title_similarity": "0.52815163",
            "sentiment_compound": -0.7717
        },
        {
            "id": "hthy9iz",
            "score": 1,
            "text": "Last week my gf felt \"sick\" and went to get a covid test. Well they sent it off because reasons and she didn't even know IF she had covid or the flu or anything.\n\nBUT.\n\nThey gave her a prescription of anti-biotics. I made sure she didn't go get them/take them.\n\nHow outrageous. They don't have any idea what was wrong with her on that day and only being at the clinic for around 20 mins they prescribed her antibiotics. Not the first time they've done it to her and they've done this to some of my friends too.\n\nThey are lucky I wasn't there with her at the time.",
            "title_similarity": "0.6332712",
            "sentiment_compound": 0.0644
        },
        {
            "id": "hthyir5",
            "score": 1,
            "text": "Hopefully this will get my family to stop buying antibacterial soap",
            "title_similarity": "0.37702394",
            "sentiment_compound": 0.128
        },
        {
            "id": "hthz82a",
            "score": 1,
            "text": "I'm sure doctors will band together to fight this problem by over prescribing antibiotics even more!",
            "title_similarity": "0.3943472",
            "sentiment_compound": -0.5743
        },
        {
            "id": "hthz96p",
            "score": 1,
            "text": "Too many people throwing out the bottle when they ‘feel’ better. Didn’t yo mama teach you to take antibiotics til they gone?",
            "title_similarity": "0.55610985",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hthzexb",
            "score": 1,
            "text": "Considering there's a vaccine for malaria now and exceptional treatment for AIDS, is it all that surprising?",
            "title_similarity": "0.47802907",
            "sentiment_compound": 0.2732
        },
        {
            "id": "hti04dp",
            "score": 1,
            "text": "Here’s what aKtuAlLy killed him!",
            "title_similarity": "0.34982958",
            "sentiment_compound": -0.6996
        },
        {
            "id": "hti14pa",
            "score": 1,
            "text": "Virus will be used as antibacterials in the future.",
            "title_similarity": "0.33284461",
            "sentiment_compound": 0.0
        },
        {
            "id": "hti1577",
            "score": 1,
            "text": "Are there things you can do to minimize the chances of becoming antibiotic resistant?",
            "title_similarity": "0.2682726",
            "sentiment_compound": 0.2023
        },
        {
            "id": "hti1zc9",
            "score": 1,
            "text": "Could starts happening with the jab. Oh wait, nvm! That’s been the case sinds the beginning.",
            "title_similarity": "0.22044826",
            "sentiment_compound": 0.0
        },
        {
            "id": "hti22d5",
            "score": 2,
            "text": "I was literally just listening to an interview with an infectious disease specialist. She was talking about how stressed out she is. Now people are coming to her with scratches/cuts that get infected with antibiotic resistant bacteria. \n\nShe said when she started 20 years ago, these were all people that she'd send home with a prescription. Now she's sending people home to hospice care for infections we understand well because none of the antibiotics they've tried will work on them. \n\nImagine that. You scrape your foot on your bed frame and it gets infected. You go to the hospital thinking it will just be some simple antibiotics and you'll be at work tomorrow. Little do you know, you're never going to leave the hospital. You're going to die from a scratch on your foot.",
            "title_similarity": "0.5655279",
            "sentiment_compound": -0.8048
        },
        {
            "id": "hti26km",
            "score": 1,
            "text": "Good job we're not handing them out like candy to healthy farmed animals.",
            "title_similarity": "0.24687427",
            "sentiment_compound": 0.7964
        },
        {
            "id": "hti27q6",
            "score": 1,
            "text": "Great another thing for the stupid anti-vaxxers to use as \"evidence\" for their arguments.",
            "title_similarity": "0.29487765",
            "sentiment_compound": -0.25
        },
        {
            "id": "hti4jk4",
            "score": 1,
            "text": "Question, does eating food like pork and other meats of animals that were fed lots of antibiotics affect the person eating it? For example, the last time I’ve used antibiotics was probably for an ear infection as a young kid, but I like meat and does the antibiotics the pigs and cows eat get into me, making me susceptible to antibiotic resistance?",
            "title_similarity": "0.5150006",
            "sentiment_compound": 0.6553
        },
        {
            "id": "hti4u5s",
            "score": 3,
            "text": "For those playing at home, this is how we all die. It won’t be a meteor, it won’t be war or a virus or even climate change.\n\nUnfinished antibiotic regimens.\n\nPeople stop taking their antibiotics as soon as they feel okay, but the bacteria hasn’t gone away- it adapts and resists the next time antibiotics are used.\n\nIdiots like this will destroy themselves and then everyone else. Woo.",
            "title_similarity": "0.5478761",
            "sentiment_compound": -0.25
        },
        {
            "id": "hti4w2o",
            "score": 1,
            "text": "Recommend donating to these guys to help fund the research: https://www.antibioticresearch.org.uk/",
            "title_similarity": "0.32263687",
            "sentiment_compound": 0.6369
        },
        {
            "id": "hti4y3d",
            "score": 1,
            "text": "maybe they should stop resisting",
            "title_similarity": "0.025583303",
            "sentiment_compound": -0.296
        },
        {
            "id": "hti5eca",
            "score": 1,
            "text": "Isn’t malaria a neglected disease and AIDS on a record low of deaths??",
            "title_similarity": "0.6075279",
            "sentiment_compound": -0.7059
        },
        {
            "id": "hti7927",
            "score": 1,
            "text": "Cool, so malaria and AIDS are no longer a problem. That was sarcasm.",
            "title_similarity": "0.25184134",
            "sentiment_compound": -0.5423
        },
        {
            "id": "hti8ztu",
            "score": 1,
            "text": "Well that's terrifying.  And people are still eating them like Skittles every time they get a cold.  Not to mention, the Chinese using the \"last one\" (used when nothing else will work) on their pigs.",
            "title_similarity": "0.46406293",
            "sentiment_compound": -0.0258
        },
        {
            "id": "htibg4g",
            "score": 1,
            "text": "Well time to switch to phage therapy",
            "title_similarity": "0.18814856",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htibizs",
            "score": 1,
            "text": "We came back full circles from world war 1",
            "title_similarity": "0.4097509",
            "sentiment_compound": -0.5994
        },
        {
            "id": "htibjbo",
            "score": 1,
            "text": "I’m just saying. \n\n\nIt aint 2019 anymore",
            "title_similarity": "0.18111897",
            "sentiment_compound": 0.0
        },
        {
            "id": "htibjim",
            "score": 2,
            "text": "The rise and prevalence of MRSA in hospitals and health care facilities is a huge and serious problem that you never hear about. Another reason to avoid hospital stays if possible.",
            "title_similarity": "0.5445864",
            "sentiment_compound": 0.0772
        },
        {
            "id": "htibtk0",
            "score": 1,
            "text": "Just another way Big  Pharm is killing us.",
            "title_similarity": "0.501425",
            "sentiment_compound": -0.6597
        },
        {
            "id": "htid3v4",
            "score": 1,
            "text": "Never used them and even I know you finish the course and use when prescribed",
            "title_similarity": "0.18574426",
            "sentiment_compound": 0.0
        },
        {
            "id": "htidfn1",
            "score": 2,
            "text": "Unfortunately it's all about covering your ass in the hospital and handing out antibiotics like it's no big deal. Practicing all this ridiculous defensive medicine yields increase opportunity for bacteria to adapt.",
            "title_similarity": "0.4245404",
            "sentiment_compound": -0.5065
        },
        {
            "id": "htievhd",
            "score": 1,
            "text": "<Morgan Freeman’s voice>\nAnd it would kill even more the next year.",
            "title_similarity": "0.6629739",
            "sentiment_compound": -0.6908
        },
        {
            "id": "htigw46",
            "score": 1,
            "text": "More reason to double mask and quadruple vaccinated",
            "title_similarity": "0.3781942",
            "sentiment_compound": 0.0
        },
        {
            "id": "htihdja",
            "score": 1,
            "text": "That’s kind of a funny thing to compare to. Malaria which isn’t an issue in 90% of the world and AIDS which hasn’t been extremely deadly for over 20 years now due to good treatment options",
            "title_similarity": "0.6574657",
            "sentiment_compound": 0.7003
        },
        {
            "id": "htii8jr",
            "score": 1,
            "text": "about 80% of antibiotics are given to farm animals not humans. We gotta stop killing and eating animals to avoid a climate collapse. Animal agriculture is the main cause of deforestation and extinction of species.",
            "title_similarity": "0.7061275",
            "sentiment_compound": -0.9001
        },
        {
            "id": "htijany",
            "score": 1,
            "text": "Thanks to stupid people insisting on being prescribed antibiotics when they have a virus, and thanks to hospitals allowing these idiots access to antibiotics for fiscal gain, we now have this problem. I don't blame the doctors that are forced to do this in a hospital setting, I blame the administrators and the board. Shame on you, assholes.\n\nIt should be ILLEGAL to prescribe antibiotics for a viral infection.",
            "title_similarity": "0.50453365",
            "sentiment_compound": -0.9173
        },
        {
            "id": "htil5b5",
            "score": 1,
            "text": "Antibiotics, they're wonderful pills.\nBut don't ever think they'll cure all of your ills.\nGot a cold? Caught the flu or feeling under the weather?\nThat'll be a virus, they can't make that better...\nTake them for the wrong thing, that's dangerous to do.\nBecause when you really need them, they may stop working for you...",
            "title_similarity": "0.50186384",
            "sentiment_compound": -0.942
        },
        {
            "id": "htim1hh",
            "score": 1,
            "text": "Jokes on me! I'm allergic anyway.",
            "title_similarity": "0.23684253",
            "sentiment_compound": -0.126
        },
        {
            "id": "htinrp4",
            "score": 1,
            "text": "Isn’t there a bias in antibiotics resistance and deaths from it in old people however, whereas malaria and AIDS do target younger populations?",
            "title_similarity": "0.59986734",
            "sentiment_compound": -0.1027
        },
        {
            "id": "htir8i0",
            "score": 1,
            "text": "And so it begins. Slowly. One day Covid will be the bright past. And antibiotic resistance will kill many more humans. At least it our population returns to normal levels then maybe we have a chance to live on this planet longer.",
            "title_similarity": "0.6628126",
            "sentiment_compound": -0.2023
        },
        {
            "id": "htirgni",
            "score": 1,
            "text": "Delete this before anti vax Karen seees it",
            "title_similarity": "0.28212804",
            "sentiment_compound": -0.3182
        },
        {
            "id": "htirz5n",
            "score": 1,
            "text": "Wont crisper be able to help too?",
            "title_similarity": "0.19063647",
            "sentiment_compound": 0.4019
        },
        {
            "id": "htisxkp",
            "score": 1,
            "text": "This is way scarier than Covid ever will be",
            "title_similarity": "0.39955992",
            "sentiment_compound": 0.0
        },
        {
            "id": "htiu30d",
            "score": 1,
            "text": "The rise and prevalence MRSA in hospitals and health care facilities is a huge and serious problem that nobody talks about, but is another reason to avoid hospital stays if at all possible.",
            "title_similarity": "0.49415973",
            "sentiment_compound": -0.2617
        },
        {
            "id": "htiu6hg",
            "score": 1,
            "text": "This is why I only take antibiotics once every 6 months at most. The days of once a month are over sadly",
            "title_similarity": "0.62427926",
            "sentiment_compound": -0.4215
        },
        {
            "id": "htiu7ex",
            "score": 1,
            "text": "I've met many people who pop Z-paks like candy for any ailment.",
            "title_similarity": "0.2894467",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htiuuh6",
            "score": 1,
            "text": "If we don’t want to go back to a pre-antibiotic era we need to end factory farming now",
            "title_similarity": "0.42697948",
            "sentiment_compound": 0.0772
        },
        {
            "id": "htivbpa",
            "score": 1,
            "text": "I think the moderators are pretty level-headed when it comes to removing posts from 2019 unless it's from ATB or scientific black-eyed beans...clap clap",
            "title_similarity": "0.42271772",
            "sentiment_compound": 0.4939
        },
        {
            "id": "htivx8r",
            "score": 1,
            "text": "My big problem is this: I fear, as nothing but a perhaps thoughtful individual without medical/research credentials, that the standard practice of admonishing to \"take the full course\" of all prescribed antibiotics is contributing to this. The simple fact is that the longer people are exposed to antibiotics, including the time instantiated through actual antibiotic regiments, the longer humanity and bacteria species get a chance to develop resistance. I feel this should be regarded as an independent factor, measured in and along with whatever benefits, in terms of development of resistance, may be derived from taking the full course prescribed. This is leaving aside the obvious matter of the benefits in terms of resolving an infection, of course. \n\nSome infections must be treated aggressively. Some can be treated simply by taking the antibiotic until symptoms are relieved. This *leaves aside* whether stopping short of the full course encourages development of resistance. \n\nI welcome replies to this, but I don't really want to specify the basic distinctions I've made here. This is a speculative observation, it is not based on research. There was some press in this direction a few years back, but was not followed up on, as far as I know. I saw one article quoting an epidemiological researcher saying they found the status quo concerning antibiotic prescriptions to be very questionable. Other articles noted that the history of the length of treatment is murky and not well grounded in research. \n\nI can't help imagining that some considerable exposer to resistance encouraging antibiotics occurs simply through the actual length of the prescriptions and the perhaps questionable belief that taking the whole course will somehow assure that all are killed off, thereby eliminating a chance for the development of resistance. I once saw a comment somewhere about how taking the full course made sure that some sub-set of the infecting bacteria were  killed, but I felt that that was murky as well; it could be true, but I felt strongly that it was not thought through well enough. \n\nGiven the gravity of the stakes here, I think the *prima facie* questions, such as I have sketched out in a minimal form here, must be developed fully and freely, without research, in a way, but to serve as a ground for necessary research when matured properly.",
            "title_similarity": "0.4908244",
            "sentiment_compound": 0.9625
        },
        {
            "id": "htiy4iu",
            "score": 1,
            "text": "Would MDR Tuberculosis be counted in the numbers? I'd expect it would, but just wanted to ask.",
            "title_similarity": "0.42660993",
            "sentiment_compound": 0.0
        },
        {
            "id": "htizbiw",
            "score": 2,
            "text": "I live in Singapore and growing up there was a huge problem with GPs prescribing antibiotics for EVERYTHING. \n\nMy family wised up early on and last year the health promotion board finally started running campaigns to tell people that antibiotics weren’t the answer to everything, but I dread to think how much damage has been done over the years by overeager doctors.",
            "title_similarity": "0.602349",
            "sentiment_compound": -0.8126
        },
        {
            "id": "htj181g",
            "score": 1,
            "text": "Please explain what we can do to solve this issue",
            "title_similarity": "-0.0023589656",
            "sentiment_compound": 0.4767
        },
        {
            "id": "htj4s17",
            "score": 1,
            "text": "Time to start using viruses to kill them",
            "title_similarity": "0.40417197",
            "sentiment_compound": -0.6908
        },
        {
            "id": "htj6fna",
            "score": 1,
            "text": "Nature wants us sooooo dead.",
            "title_similarity": "0.23972464",
            "sentiment_compound": -0.6486
        },
        {
            "id": "htjbwtn",
            "score": 1,
            "text": "Antibiotic resistant bacteria are freaking terrifying. I spent 3+ years of my life campaigning against antibiotic overuse in factory farms, and, while mostly successful, it definitely wasn't enough on its own.  \n  \nWe ligitimately are close to dying from everyday cuts and pokes. We're just running out of reliably effective antibiotics.",
            "title_similarity": "0.6410624",
            "sentiment_compound": 0.2263
        },
        {
            "id": "htjbwxu",
            "score": 1,
            "text": "That's not at all surprising, as the drug industry (like most other industries) depends on \"growth\", regardless of whether or not the medication is actually necessary. Just look at how they overprescribed opiods to the point that people today who would actually benefit from them have to jump through hoops and are treated as drug addicts. \n\nI wonder how both medical errors and missed workdays due to COVID compare.  Just the other day (after the \"winter storm\"), several nursing home residents near where I live were found either dead (at least 2)  or very close to dead (at least 2 more), because a few hours' worth of ice prevented a proper amount of staff from coming in.  It seems that COVID would've caused a lot more than a couple of short shifts, and medical errors are generally a lot higher on the list than the average person would expect. \n\nOh, and then there's all the missed treatments and delayed diagnoses that happened, though I've yet to see a reasonable attempt at reporting those figures, and we've certainly seen a spike in violent crimes in the ~year or so since things pretty much opened back up. \n\nAt some point, there needs to be a full accounting of the data to figure out if the response to COVID did more harm than good.",
            "title_similarity": "0.69330204",
            "sentiment_compound": -0.8845
        },
        {
            "id": "htjd8dm",
            "score": 2,
            "text": "I feel like this topic is talked way to little about!",
            "title_similarity": "0.077270746",
            "sentiment_compound": 0.4199
        },
        {
            "id": "htjgbvi",
            "score": 2,
            "text": "COVID would have been a walk in the park by comparison.",
            "title_similarity": "0.16905501",
            "sentiment_compound": 0.0
        },
        {
            "id": "htjnztn",
            "score": 2,
            "text": "We need to get into bacteriophage therapy ASAP",
            "title_similarity": "0.30993378",
            "sentiment_compound": 0.0
        },
        {
            "id": "htjzyrb",
            "score": 1,
            "text": "I am more optimistic after reading about the research they’re doing on powerful microorganisms in the soil that have antibiotic properties. Now we just need to stop overfeeding them to cattle all the time…https://directorsblog.nih.gov/2018/02/20/powerful-antibiotics-found-in-dirt/",
            "title_similarity": "0.45581612",
            "sentiment_compound": 0.4927
        },
        {
            "id": "htk536y",
            "score": 1,
            "text": "Yay this sub is talking unfunded science again",
            "title_similarity": "0.2998314",
            "sentiment_compound": 0.5267
        },
        {
            "id": "htkbxbe",
            "score": 1,
            "text": "we need to stop eating animals asap",
            "title_similarity": "0.297912",
            "sentiment_compound": -0.296
        },
        {
            "id": "htkejx2",
            "score": 1,
            "text": "A problem that started in India when patients buy otc antibiotics for ailments in the belief its better",
            "title_similarity": "0.41503376",
            "sentiment_compound": 0.0516
        },
        {
            "id": "htkpe1d",
            "score": 1,
            "text": "This is the fear many scientists have. We over use antibiotics. It’s only a matter of when not if, antibiotic resistant infections become the norm. And we are back in the middle ages again.",
            "title_similarity": "0.5910654",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htktm2e",
            "score": 1,
            "text": "Yay! Haven't taken any in my entire life now I won't be able to because people who should've been Darwin'd are still alive.",
            "title_similarity": "0.45331377",
            "sentiment_compound": 0.7424
        },
        {
            "id": "htpl7fe",
            "score": 1,
            "text": "What the drugs killing more than the disease big pharma is so amazing",
            "title_similarity": "0.6096091",
            "sentiment_compound": 0.1195
        },
        {
            "id": "htr5k3z",
            "score": 1,
            "text": "The really big problem here is that drug companies are all shuttering (or already have) their antibiotic research divisions. The flood of new antibiotics slowed to a trickle when drug companies realized there is no profit in them. Why invest a billion dollars (not atypical to bring a new drug to market) on a new antibiotic that bacteria will develop resistance to in 6 months when you can develop a new erectile dysfunction drug that will last forever? Until we can change the economics of drug development companies will not do the hard research. \n\nThe second problem is creating a culture of appropriate use for antibiotics that doesn't favor using antibiotics as panaceas to take two or three times when you get a headache.",
            "title_similarity": "0.66068393",
            "sentiment_compound": -0.864
        }
    ]
}