{
    "Only four times in US presidential history has the candidate with fewer popular votes won. Two of those occurred recently, leading to calls to reform the system. Far from being a fluke, this peculiar outcome of the US Electoral College has a high probability in close races, according to a new study.\n": [
        {
            "id": "htljyk4",
            "score": 1,
            "text": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are now allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will continue be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) still apply to other comments.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "title_similarity": "0.44355133",
            "sentiment_compound": 0.7088
        },
        {
            "id": "htlr0t0",
            "score": -14,
            "text": "I understand why we have the electoral college. But the reasons that support it are very old and seem to be a mask for the racist history of our country. Under the current system, we don’t have a representative democracy in the slightest. The GOP leverages a majority despite never gaining more than ~40% of the vote.",
            "title_similarity": "0.7645856",
            "sentiment_compound": -0.1208
        },
        {
            "id": "htlt1ah",
            "score": -8,
            "text": "I prefer it when presidential candidates have to campaign to all Americans, not just those living in the largest cities.",
            "title_similarity": "0.56317544",
            "sentiment_compound": 0.0
        },
        {
            "id": "htlxy1c",
            "score": 2,
            "text": "[removed]",
            "title_similarity": "-0.009327672"
        },
        {
            "id": "htlko73",
            "score": 145,
            "text": "It should be obvious to anyone that believes in democracy that the person with the most votes should be the winner in any election.  The tortured arguments in favor of the current system cannot justify the simplicity and common sense of, \"One person, one vote\".",
            "title_similarity": "0.588122",
            "sentiment_compound": 0.0516
        },
        {
            "id": "htm7n2y",
            "score": -4,
            "text": "It's somewhat simple; low population conservative states are over-represented in electors, and high population liberal states are under-represented by electors.\n\nIf state A has 10 electors representing a total population of 1000, that's 1 elector for every 100 people.  If state B has 20 electors for a population of 50000, that's 1 elector every 2500 people.  That means that the vote of a person from state A has significantly more value than the vote of a person from state B.\n\nThat's how it is in America.  Most low-population, conservative leaning states tend to have massively skewed voter representation, so the weight of a single vote from them is simply worth more than the weight of a voter from NY or CA.  It's why there are some states that you nearly forget exist until it's time to campaign, then suddenly they're the most important places in the country... because they've got both a high individual vote value AND a mix of both liberal and conservative voters.\n\nThis translates to exactly what is described in the article; conservatives are simply more heavily favored in this regard, so they can have less total votes but a greater total voter value.  Of course, this isn't an isolated issue... there's significant voter apathy, especially among certain demographics that liberals depend on, with voter turn out among them often as low as around 12%.  Combine both of these with the fact that the left isn't nearly as united and hegemonic as the right, so there is a tendency for some otherwise liberal voters to essentially throw away their votes on purpose (spite that they're guy didn't win the primaries, over critical of the centrist candidate, or any number of self-imposed \"ethical\" reasons), and you get... well, 2016.  Just barely over 50% of eligible voters even bothered to vote, and less than half of them voted for the guy who won.  That means that roughly 25% of the US voting population (probably about 20% of the total US population, but that's an estimate) determined the fate of the world in 2016.",
            "title_similarity": "0.6870874",
            "sentiment_compound": 0.8966
        },
        {
            "id": "htlzvcf",
            "score": 4,
            "text": "And it always favors one side. Weird how that keeps happening.",
            "title_similarity": "0.27821296",
            "sentiment_compound": 0.0772
        },
        {
            "id": "htlwx42",
            "score": -19,
            "text": "It’s quite simple really.  1 person = 1 vote.  Candidate with the most votes wins… you know, like every other type of voting in the world… \n\nInstead we have this ridiculous electoral college system.",
            "title_similarity": "0.6501286",
            "sentiment_compound": -0.0964
        },
        {
            "id": "htlziib",
            "score": -6,
            "text": "If you know what the popular vote was then you know who should’ve won the election…",
            "title_similarity": "0.5413414",
            "sentiment_compound": 0.7579
        },
        {
            "id": "htm9t35",
            "score": 3,
            "text": "The Electoral College was instituted PRECISELY to make sure you can't win an election by simply appealing to the overly populous location.\n\nCalifornia should not decide national policy by virtue of their overcrowding, and one snake oil salesman choosing to tell them what they want to hear.\n\nYou want to complain about the Florida rigging in 2000, sure.\n\nBut don't act like this method of election is a surprise or that your gripe has any principle behind it besides you don't like Trump.",
            "title_similarity": "0.5048487",
            "sentiment_compound": -0.242
        },
        {
            "id": "htmpwr9",
            "score": 1,
            "text": "I don't understand why people fail to examine history and why the electoral college exists in the first place. It is designed to give disproportionate weight to less densely populated and often ignored states. It wasn't mistakenly adopted - it was adopted for a reason. Rural states often have much different perspectives and needs than urban states. Even our forefathers recognized that. The urbanization of America has only heightened that divide. However, the big urban states RELY upon those small states for a significant amount of resources (and vice versa to a lesser degree). The EC was designed to give those smaller states leverage when the executive was chosen so that they didn't feel completely isolated. Isolating them is good for nobody. I realize people don't really love the fact that the \"popular\" candidate didn't win the last several elections but we are an almost evenly split nation on most issues these days. The EC was put in as a system to give the \"tie to the runner\" in some cases - thus balancing the scales.",
            "title_similarity": "0.62888604",
            "sentiment_compound": -0.237
        },
        {
            "id": "htmht3h",
            "score": 17,
            "text": "The Electoral College is genius. It balances the power and should continue. We can’t have NY and CA dictating every election.",
            "title_similarity": "0.5555194",
            "sentiment_compound": 0.0
        },
        {
            "id": "htm71au",
            "score": -2,
            "text": "Voting in the U.S.A is like \"who's line is it anyway\".\n\nThe tally's made up and your vote doesn't matter.",
            "title_similarity": "0.39416265",
            "sentiment_compound": 0.3455
        },
        {
            "id": "htlv24x",
            "score": 43,
            "text": "Friendly reminder we are a republic not a pure democracy. Popular vote is not meant to be the “be all end all”",
            "title_similarity": "0.4458753",
            "sentiment_compound": 0.7184
        },
        {
            "id": "htmc43q",
            "score": 9,
            "text": "[removed]",
            "title_similarity": "-0.009327692"
        },
        {
            "id": "htm89of",
            "score": -1,
            "text": "I don't understand why it's not 1 person 1 vote nationwide. A majority winner of the votes should never lose an election just because a certain podunk shitsville state in the bible belt is worth more points.",
            "title_similarity": "0.62585586",
            "sentiment_compound": 0.8425
        },
        {
            "id": "htmcfjw",
            "score": 0,
            "text": "Good luck with that chinese shills, far lefties, and bots.",
            "title_similarity": "0.34171382",
            "sentiment_compound": 0.7096
        },
        {
            "id": "htm5mut",
            "score": 3,
            "text": "The whole point of the EC was that the winner didn't necessarily get the most total votes nationwide, but more votes spread out across the nation. It did its job, and they think its broken? Hillary had more votes than Trump, but they were almost entirely from 2 or 3 states. The other 47 states were close or lost by her. The EC gives voice to the minority.",
            "title_similarity": "0.80989164",
            "sentiment_compound": -0.6908
        },
        {
            "id": "htm03xl",
            "score": -6,
            "text": "[deleted]",
            "title_similarity": "0.022836467"
        },
        {
            "id": "htm1995",
            "score": 7,
            "text": "Reading the comments here only reinforces my belief that it’s a good thing we are a constitutional republic. \n\nNo offense, but if your going to run elections based purely off popular vote you will be left with basically 4 states calling the shots for everyone else. \n\nWhat’s the point of being part of a union. \n\nThe same people bitching about voting rights are quick to take other people voices out of the political process.",
            "title_similarity": "0.652913",
            "sentiment_compound": 0.5842
        },
        {
            "id": "htlzgyf",
            "score": -10,
            "text": "Rural votes weigh more than urban/suburban votes. \nIn America, Land DOES vote.",
            "title_similarity": "0.5745248",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmitsa",
            "score": 5,
            "text": "[deleted]",
            "title_similarity": "0.022836465"
        },
        {
            "id": "htm3jv0",
            "score": 35,
            "text": "The 2000 election was a heads up.  When it happened to Hillary that confirmed a pattern, taken together with the increases in gerrymandering. And it's only going to grow more and more common and more extreme.  Until the electoral college is abolished, that is.",
            "title_similarity": "0.6348205",
            "sentiment_compound": 0.0
        },
        {
            "id": "htm35a2",
            "score": 8,
            "text": "\"reform the system\" Those who call to reform do so out of ignorance as to WHY the system is the way it is.\n\nBasic civics will explain why America is a Constitutional Republic and not a \"Pure Democracy\".",
            "title_similarity": "0.50199306",
            "sentiment_compound": -0.4144
        },
        {
            "id": "htmkwpl",
            "score": 1,
            "text": "Electoral College is some anti democratic BS as I see it 'They won, but we don't like that guy'\n\n^(Disclaimer: have no stake in US politics, I just hate people who suck corporate schlong to save their own skins, rather than do something crazy like help people.)",
            "title_similarity": "0.5161393",
            "sentiment_compound": -0.6873
        },
        {
            "id": "htmp8so",
            "score": 1,
            "text": "**National Popular Vote Interstate Compact**. We can prevent this from happening again. We only need a couple more states to sign on and we'd have enough for it to go into effect",
            "title_similarity": "0.55826205",
            "sentiment_compound": 0.4404
        },
        {
            "id": "htlyuc6",
            "score": 27,
            "text": "Just as a reminder, the USA is a Republic. It is made up of states. The founding fathers gave the states the right to elect the President, not the people.",
            "title_similarity": "0.46561497",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmb84l",
            "score": 37,
            "text": "This is such a misunderstood topic. The US presidential election is not one election, but a collection of 50 separate elections. Look to any parliamentary  system and you see the same thing (i.e. most of the developed world). Sitting here in Canada and the last election saw one party lose the popular vote nationally but still won (Liberals 32.6% and Conservatives 33.7%). This is more common than people think. A straight popular vote essentially means large cities decide elections. Do you really want NYC, Chicago, LA and Houston deciding for the rest of the country?",
            "title_similarity": "0.7355728",
            "sentiment_compound": 0.9431
        },
        {
            "id": "htm0ni4",
            "score": 54,
            "text": "This is by design.  If presidential elections were decided by pure popular vote the other 48 or so states in the union would have no incentive to be part of a union governed by the populations of two states.  It was an incentive for smaller states to become part of the united states—just like the US Senate prior to it being elected by popular vote.   This is to prevent one party rule and tyranny of the majority throughout the entire country.  Much easier to move out of a state whose laws and policies you don’t like than to flee a country.",
            "title_similarity": "0.63066757",
            "sentiment_compound": 0.9545
        },
        {
            "id": "htm4ynz",
            "score": 12,
            "text": "It has been like this because the huge population centers have grown in more recent times. The point of the electoral college is to prevent tyranny of the majority. People living in monster metropolitan areas, shouldn’t just be able to bludgeon people living in less dense areas, into living how they want.",
            "title_similarity": "0.57357603",
            "sentiment_compound": 0.6369
        },
        {
            "id": "htm0jc2",
            "score": 3,
            "text": "That’s the whole point, the founding fathers never wanted a true democracy. Nobody should. The real problem is the first past the post methodology, and the whole state goes to one person. If 20 million people in California vote Republican and 20,050,000 vote Democrat, than the vote goes to the Democrats. So now these 20 million Republicans are feel they aren’t represented.\n\nWhat it should be is like Missouri and Maine, where it’s proportional, this will also help deal with the two party system. Which George Washington warned against anyways. But none of this will happen because the current system benefits the Republicans and the Democrats.",
            "title_similarity": "0.61332273",
            "sentiment_compound": 0.5837
        },
        {
            "id": "htm3ili",
            "score": -3,
            "text": "Biden barely won this election if you ignore PA, basically came down to 20-30k people in a few states. Look at his approval record right now, paints a pretty awful picture of recapturing the magic. Even though he get millions of more votes. Hillary same story.",
            "title_similarity": "0.7183795",
            "sentiment_compound": 0.6378
        },
        {
            "id": "htm6t4a",
            "score": 31,
            "text": "In American  your vote is not equal to everyone else’s.  It’s part of the reason we have minority rule.",
            "title_similarity": "0.54845023",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmd83f",
            "score": 0,
            "text": "It was designed this way though. This isn't a flaw. It's a feature.",
            "title_similarity": "0.12425317",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto034d",
            "score": 0,
            "text": "I mean, the system was set up this way to prevent tyranny of the majority. Seems to be working. Thank God Biden won, but I'm completely for this system vs a pure popular vote.",
            "title_similarity": "0.5565429",
            "sentiment_compound": 0.8126
        },
        {
            "id": "htlzm9a",
            "score": 0,
            "text": "It was pretty crazy to see all of the Democratic candidates admit they don’t think the person with the most votes should win because it looked like Bernie Sanders would win popular vote.  The whole system is a scam.  No way to change it without a bunch of plutocrats getting screwed out buying elections.",
            "title_similarity": "0.6124201",
            "sentiment_compound": 0.7693
        },
        {
            "id": "htlyjil",
            "score": -1,
            "text": "[deleted]",
            "title_similarity": "0.022836467"
        },
        {
            "id": "htlompy",
            "score": -25,
            "text": "This article is pretty much just BS. It talks on and on how it actually benefitted democrats for most of history while describing southern slave owners suppressing black votes. \n\nNo, those are just republicans again.",
            "title_similarity": "0.6305114",
            "sentiment_compound": 0.7096
        },
        {
            "id": "htm1yvk",
            "score": -7,
            "text": "Can we just drop the electoral college? Why does their vote matter more than ours?",
            "title_similarity": "0.5317398",
            "sentiment_compound": -0.3313
        },
        {
            "id": "htlvw7c",
            "score": -14,
            "text": "Popular vote = mob rule.  The electoral college exists to prevent that.",
            "title_similarity": "0.4527541",
            "sentiment_compound": 0.4404
        },
        {
            "id": "html1fz",
            "score": 28,
            "text": "It’s also worth noting that the system is intentionally designed in a way that allows for this.\n\nBalancing the electoral college voting power by giving every state 2 electors for their senators makes the president more beholden to the geographic entirety of the US, not just its most populous centers.\n\nIf the system were not designed in this way, you would never see the candidates even pretend to care about an issue from a low population state ever again, and we’d be looking at presidents who are largely just the Kings and Queens of Texas, California, and New York.",
            "title_similarity": "0.64156",
            "sentiment_compound": 0.6124
        },
        {
            "id": "htm6s2x",
            "score": 1,
            "text": "Interesting read. We are a republic and not a pure democracy, people forget this.  Unless you live in Texas, New York, Florida, or California you do not want electoral college removed.  You will never see a presidential candidate visit your state again and your states interests will not be a priority.  Effectively those four states will control the rest of the Union which will speed up divisions as smaller states residence will feel voiceless when it comes to presidency.",
            "title_similarity": "0.640641",
            "sentiment_compound": 0.6681
        },
        {
            "id": "htm5m91",
            "score": 37,
            "text": "[deleted]",
            "title_similarity": "0.022836467"
        },
        {
            "id": "htlqnx1",
            "score": 21,
            "text": "Not a bug its a feature?",
            "title_similarity": "0.1374493",
            "sentiment_compound": 0.0
        },
        {
            "id": "htlw66f",
            "score": -8,
            "text": "No kidding.  That's why so many of us believe it's long past time to eliminate that anachronism.",
            "title_similarity": "0.40264553",
            "sentiment_compound": -0.0762
        },
        {
            "id": "htmt3x3",
            "score": 7,
            "text": "This is the United States of America, not the United State of America.  \n\nThe Founding Fathers intended Presidential elections to be determined by the most popular candidate among each state...not by the most popular candidate among the majority of American citizens.  \n\nWe're a very large, diverse nation.  Do you think an Inuit from Alaska who has obtained citizenship, has the same culture, same interests, same goals as a Cuban immigrant in Southern Florida as a valley girl from SoCal as a male PoC from the Bronx as a corn farmer from Nebraska?  Of course not.  This is exactly why the Electoral College is so important.",
            "title_similarity": "0.6640194",
            "sentiment_compound": 0.9085
        },
        {
            "id": "htlxx03",
            "score": 3,
            "text": "What is even worse is that the EC makes it so that our national priorities for political debates get all twisted up as well.  For example the reason we can normalize relations with Cuba is because of the EC, something that is overwhelmingly popular with most the nation.  The Parties end up focusing on political favors primarily in the swing states. that are the most relevant to swing states.",
            "title_similarity": "0.5675423",
            "sentiment_compound": 0.6124
        },
        {
            "id": "htmj0gt",
            "score": 0,
            "text": "I mean that’s also the point of the electoral college. To give voice to the otherwise underrepresented. Whether you agree with the concept or not, it’s doing what it’s intended to do",
            "title_similarity": "0.3902591",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htnezib",
            "score": -1,
            "text": "Look folks, sure Russia is probably about to roll tanks, aircraft, and 100k soldiers into Ukraine, the market’s s falling apart, and the wealth gap between the rich and poor is greater than ever. Thing is, we need to talk about Donald Trump again, because our number one priority should be, focusing all of the nations governing power, in the most densely populated areas, because rich people know better than you. Trust us, we’re from the government and we’re here to help.",
            "title_similarity": "0.6143049",
            "sentiment_compound": 0.9623
        },
        {
            "id": "htnk6ej",
            "score": 1,
            "text": "Founding fathers understood what mob rule was, and Democrats will be celebrating this fact when they are in the minority again.",
            "title_similarity": "0.4848029",
            "sentiment_compound": 0.5719
        },
        {
            "id": "htly8va",
            "score": 9,
            "text": "I have a couple questions for which I'm not sure we have clear answers; just something to think about.\n\n1. Other than the first time in 1824 when the political parties we have now were not a thing, every time the Republican candidate lost the popular vote but won the electoral college. It seems that the Republican candidate took the swing states. That is certainly what happened in 2016, which I clearly remember. Is there a reason for this?\n\n2. Assuming that it's not rigged somehow, does it really matter as long as both sides play by the same rules? I would expect an outcry here on Reddit because the users are largely Democrat leaning. Would we view this in the same light if the winning parties were switched?\n\n3. In sports where a series of games are played, a team can win even if they score fewer points overall. This is an extreme example, but let's take the best-of-7 MLB World Series as an example. One team could win the first game 15-0, and then lose four games 1-0. They lose the series, although outscoring the winning team 15-4. Is there any correlation here?\n\n4. Edit: I thought of something else I'd like to add. The US is set up much differently than other countries. It is comprised of 50 states. The states are much like countries. The US could be compared to the EU, and the states compared to the countries making up the EU. Do the citizens of EU countries vote on EU matters? Does a vote from a citizen of Malta or Luxemburg hold exactly the same power as a vote from a citizen of Germany or France? I actually don't know; I'm asking how it works.",
            "title_similarity": "0.77851903",
            "sentiment_compound": 0.9927
        },
        {
            "id": "htmgjs1",
            "score": 0,
            "text": "People don’t vote for President, states do.",
            "title_similarity": "0.50323015",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmi1n2",
            "score": 0,
            "text": "This might be the dumbest title I've ever seen on Reddit.\n\n\"Far from a fluke, flooding has a high probability of occurring during periods of intense rainfall.\"",
            "title_similarity": "0.5405587",
            "sentiment_compound": -0.4588
        },
        {
            "id": "htmu5a8",
            "score": 0,
            "text": "That means the electoral college is working. Otherwise a few highly populated areas could decide who the president is for the rest of the country. Don't understand why people don't get this.",
            "title_similarity": "0.66195726",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmvxn2",
            "score": 0,
            "text": "Science shouldn't use poltical rhetoric. \n\nThere is no popular vote. We count up the votes within each state and present it as a total, but it doesn't exist as it's own electoral vote. This isn't a \"peculiar\" outcome of the EC because it's meant to be not of worth, it's not to be counted.\n\nYou can profess to replace the Electoral College with a popular vote, but don't use language as to denote current outcomes based upon the desired system as if such was currently applicable.",
            "title_similarity": "0.5382842",
            "sentiment_compound": 0.5697
        },
        {
            "id": "htnryxw",
            "score": 0,
            "text": "If Americans pulled their head out of their asses for one second they’d realise that the popular vote winner doesn’t win in other countries all the time either",
            "title_similarity": "0.6886195",
            "sentiment_compound": 0.886
        },
        {
            "id": "htns37c",
            "score": 0,
            "text": "I'm biased because I live in a flyover state but popular voting would mean states would pack themselves with undocumented people and tell them that xyz party is good while the other party is bad.\n\n\nThe only suggestion I might like is Andrew Yang's idea for a ranking system where everyone ranks a list and we take the winner from that.  The 2 party system is the only problem I have these days.",
            "title_similarity": "0.64464366",
            "sentiment_compound": 0.9571
        },
        {
            "id": "hto2c90",
            "score": 0,
            "text": "Why don't you Americans just get it over with already. Split your country into 2 halves and each side can take a half. Then we can see which side really runs the country better, Let's face it neither side are ever gonna compromise or get along with the other so just split already!",
            "title_similarity": "0.48106638",
            "sentiment_compound": 0.4926
        },
        {
            "id": "htmeygl",
            "score": 23,
            "text": "This would be a non-issue if voters hadn’t encouraged massive growth of the federal government and states hadn’t so willingly ceded authority to the fed. The federal government is a bloated disaster, and the country was designed to run on small government. A left liberal shouldn’t be voting for things that have an overt impact on a conservative rural farmer in Oklahoma. The fact that either of those people think they know what’s best for the other is absurd. It’s also really easy to win the popular vote when you’re running on a feel-good platform of emotion based decision making promising to give people free everything vs encouraging people to work and provide for themselves. We’ve given and enabled way to much power to the Executive Branch.\n\nThe article also fails to capture that the parties have changed an absurd amount in the past forty years, and even more-so in the past twenty. The left has become a champion of a “zero-accountability” state where no one is actually responsible for their own actions or decisions while the right has turned into an idiotic religious theocracy that only cares about fiscal conservatism when they’re standing on their soap box. Bill Clinton would probably be considered a conservative at this point and Reagan would be called a fascist by most today. The centrist majority in this country flip flops every election as seen in the last presidential election on the hopes Biden would be a moderate and people still don’t seem get that damn near half the country still voted for Trump and he earned more votes then any Republican in history. In a country of nearly 330 million, Biden only beat Trump by less then 7 million votes, we shouldn’t pretend that’s some definitive statement of approval for the masses.\n\nAnd why is this on a SCIENCE thread?",
            "title_similarity": "0.6521183",
            "sentiment_compound": 0.9759
        },
        {
            "id": "htlx35z",
            "score": 39,
            "text": "Without rewriting a large chunk of the constitution, a simple fix is to allow the seats of Congress to grow again. Here's why.\n\n>Since 1789, when the federal government began operating under the Constitution, the number of citizens per congressional district has risen from an average of 33,000 in 1790 to over 700,000 as of 2018.\n\n>In 1929 Congress (with Republican control of both houses of Congress and the presidency) passed the Reapportionment Act of 1929 which capped the size of the House at 435 (the then current number) and established a permanent method for apportioning a constant 435 seats.\n\nhttps://en.m.wikipedia.org/wiki/United_States_congressional_apportionment\n\nSo basically, the least populace states that only ever have 1 seat in Congress, have an increasing advantage in representing less and less people, but maintain the same voting power. There are 7 states like this: Alaska, Delaware, Montana, North Dakota, South Dakota, Vermont, and Wyoming.\n\nI understand there is an issue of physical space, but we are a REPRESENTATIVE government! Simply restrict the number of Congress members the same way we do now, but allow them to REPRESENT multiple districts. This way, members of Congress can carry more than one vote, and there is no need to actually grow the number of people in Congress. Gerrymandering would be much harder too because you couldn't lump 700,000 like minded voters into a single district. You would have to break that single district into something like 20 districts (35,000 per district).\n\nIt's not the perfect solution, but it would definitely reduce the chances of having a an election not aligning with the popular vote.",
            "title_similarity": "0.6813511",
            "sentiment_compound": 0.7534
        },
        {
            "id": "htlz8pg",
            "score": 255,
            "text": "Barack Obama also beat Hillary Clinton in the '08 primary with a higher electoral count but less popular votes. People never seem upset about this until it gets to the president but it happens downstream",
            "title_similarity": "0.8106512",
            "sentiment_compound": 0.7216
        },
        {
            "id": "htm0y13",
            "score": -10,
            "text": "All I keep seeing in this thread is this same argument: “if we didn’t have the electoral college or structure Congress the way we do, then Californians and New Yorkers would rule over the hapless Montanans.”\n\nI am kind of mystified by this argument. We have amendments to the Constitution to protect the rights of minorities against the domineering will of the majority. These amendments also protect people from Montana. \n\nWe have federal agencies and a commerce clause and a congressional budgetary system and, critically, national defense concerns that ensure agriculture and rural industry is kept healthy to keep food supplies high and ensure infrastructure is not neglected.\n\nThe way things are in 2022 is not some clever feature, it is a bug. It sprang up when we were trying to strengthen the union of states when this country was first created. We do things the way we do in 2022 because slave owners 250 years ago knew they would be pushed out of power if they didn’t hold disproportionately higher power, so they refused to join the union unless they were given said power.\n\nBut it is 2022. We have since discarded the 3/5ths compromise. We will inevitably view similar features of our Republic as what they are: tyranny of the minority born out of a desperate series of bargains, and the debts on those bargains have been paid.",
            "title_similarity": "0.5535036",
            "sentiment_compound": -0.245
        },
        {
            "id": "htn7p5n",
            "score": 3,
            "text": "Since all 4 times it benefitted the Republican candidate, we won’t be able to fix it.  If it benefitted both parties randomly, we might get a reform.  Understand if it had always benefited the Democrats we’d have the same problem. Not casting aspersions to one side.",
            "title_similarity": "0.781742",
            "sentiment_compound": 0.6597
        },
        {
            "id": "htm2x9i",
            "score": -3,
            "text": "Damn it’s almost like the system was intentionally designed to suck by the genocidal slaveowners who wrote the constitution.",
            "title_similarity": "0.34047198",
            "sentiment_compound": -0.5256
        },
        {
            "id": "htm3gcq",
            "score": -3,
            "text": "We need a new constitution!",
            "title_similarity": "0.22411603",
            "sentiment_compound": 0.0
        },
        {
            "id": "htm8y2q",
            "score": 55,
            "text": "Wait till they see how “even” the representation is in the senate. One side represents a sizeable margin more than the other and yet it’s a 50/50 split in power.",
            "title_similarity": "0.5931907",
            "sentiment_compound": 0.0
        },
        {
            "id": "htm1i7z",
            "score": 7,
            "text": "\"oh you won California by less than a percent? Here, have ALL of their votes\"\n\nThis is the problem, this is why it needs to be done away with. It does the exact opposite of what it's original intention was. It's no longer needed, technologically speaking either.",
            "title_similarity": "0.5630006",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htlyic4",
            "score": -5,
            "text": "Maybe keep political issues to political subreddits? This is a  science sub and this has nothing to do with science.",
            "title_similarity": "0.37165037",
            "sentiment_compound": 0.0
        },
        {
            "id": "htlzms8",
            "score": -5,
            "text": "Republicans use this fact as the basis of their entire election strategy. It’s based on maximizing resources in less populous states to secure electors. Because it’s easier to convince 2 million out of 3 million people to vote for you than it is to convince 20 million out of 30 million to vote for you.",
            "title_similarity": "0.67805624",
            "sentiment_compound": 0.802
        },
        {
            "id": "htm19tt",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.022836467"
        },
        {
            "id": "htmykr1",
            "score": 6,
            "text": "People talk about this stuff like it was an unintended consequence when the founding fathers formulated the country. To the contrary, they absolutely knew that this could happen, it’s to ensure smaller states can stand up to big states.",
            "title_similarity": "0.44671848",
            "sentiment_compound": 0.6249
        },
        {
            "id": "htm6jt8",
            "score": 4,
            "text": "Politics and science what a happy marriage",
            "title_similarity": "0.37796867",
            "sentiment_compound": 0.5719
        },
        {
            "id": "htmkpvw",
            "score": -4,
            "text": "One of those Presidents who won, despite losing the popular vote, was Abraham Lincoln. Thank God for the Electoral College!",
            "title_similarity": "0.6247046",
            "sentiment_compound": 0.8148
        },
        {
            "id": "htmljlg",
            "score": 5,
            "text": "at a certain point you have to just accept that it's a badly designed system",
            "title_similarity": "0.16364771",
            "sentiment_compound": 0.1531
        },
        {
            "id": "htnkk2p",
            "score": 5,
            "text": "Science? /confused Pikachu\n\nThe USA is a representative republic, not a true democracy. The Electoral College exists to balance the system so that the interests of densely populated areas don't dictate what happens to the entire country. There are counties in California that have a higher population than entire states. \n\nThe system is fine. Just because the party in power throws a hissy fit every election season doesn't mean there's a need for reform.",
            "title_similarity": "0.66357017",
            "sentiment_compound": 0.562
        },
        {
            "id": "htm7kpt",
            "score": -1,
            "text": "“there's a built in advantage for any party that wins small states”.   \n\nSo, for example, a vote in Wyoming counts as heavily as fifty votes in California, the rural rednecks will continue to be the thumb on the scale deciding presidential elections.",
            "title_similarity": "0.6467966",
            "sentiment_compound": 0.8126
        },
        {
            "id": "htmbkil",
            "score": 265,
            "text": "The popular vote doesn’t matter. No presidential candidate is actually even trying to win the popular vote. If you change the rules of the game then the strategies will change along with it. You can’t retroactively apply the results of the past elections and assume they would have been the same under new rules. For an analogy: in football the team with the most points at the end of the game wins. So every team has a strategy to get the most points. But if field goals all of a sudden are worth 8 points and touchdowns are worth 3 points then the game play would change completely.  You can’t go back and apply the new rules to old games because they would have been played totally different. For a political example: Many republicans candidates don’t even bother to campaign in California, they don’t spend money in California, and many Republican voters in California don’t bother to vote. If the popular vote decides the president then those things would likely change.",
            "title_similarity": "0.6396981",
            "sentiment_compound": 0.8481
        },
        {
            "id": "htlv6se",
            "score": -18,
            "text": "I really wish the US would split up already.  Let the West Coast and New England do their own things, while the idiots in the middle can drag themselves down without taking the coasts with them.",
            "title_similarity": "0.35296524",
            "sentiment_compound": 0.2716
        },
        {
            "id": "htlut2l",
            "score": 34,
            "text": "\"Only four times.\"\n\nIt's happened 5 times.",
            "title_similarity": "0.50674605",
            "sentiment_compound": 0.0
        },
        {
            "id": "htm372n",
            "score": 139,
            "text": "We need to go to ranked choice voting and have more representation than being forced into two trash parties. I’d also like to see an “Against All” option in elections where if it wins, the election is scrapped and new candidates must be chosen.\n\nThe electoral college is an archaic institution that needs to be dismantled, but it doesn’t fix this problem. That just redistributes a disproportionate amount of federal power to a few high population states that should have remained with individual states to begin with.",
            "title_similarity": "0.5994063",
            "sentiment_compound": -0.3044
        },
        {
            "id": "htlxsi9",
            "score": 50,
            "text": "Planting the seeds early this election cycle.",
            "title_similarity": "0.36026865",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn8jo5",
            "score": 23,
            "text": "Unpopular opinion: the fact is that, if the point of the election were to win the popular vote and not the electoral vote, the results would invariably be different. \n\nThat doesn't necessarily mean the *outcome* (i.e. who wins) would be different - but the *result* (i.e. number of votes won by each candidate) would certainly be different.\n\nThe objective of US presidential campaigns is to win the electoral vote, so candidates spend virtually all their time campaigning in the large swing states - like Ohio, Pennsylvania, Michigan, Florida, and Wisconsin. A Republican could win tons of additional popular votes by campaigning in California and New York - but it wouldn't net them any additional electoral votes, so they don't campaign there.\n\nIf candidates focused on the popular vote, they would both stick to the large population centers, as there would no longer be \"swing states\". \n\nBad analogy, but complaining about winning the popular vote but losing the election is like complaining that your football team racked up more offensive yards but still scored fewer points. The objective is to win.",
            "title_similarity": "0.7115605",
            "sentiment_compound": 0.9893
        },
        {
            "id": "htm75fn",
            "score": 3,
            "text": "[deleted]",
            "title_similarity": "0.022836465"
        },
        {
            "id": "htmcekh",
            "score": 0,
            "text": "The EC should be abolished entirely, and the popular vote should be used.  Keeping the EC consolidates power into fewer people's hands, which is only ripe for abuse.\n\nWant to remove waste from government?  Remove all taxpayer dollars related to having and maintaining the framework of the EC.",
            "title_similarity": "0.44917622",
            "sentiment_compound": -0.5627
        },
        {
            "id": "htmr73o",
            "score": 5,
            "text": "How is this on science?",
            "title_similarity": "0.20184954",
            "sentiment_compound": 0.0
        },
        {
            "id": "htngdst",
            "score": 0,
            "text": "Most of yall should've never passed high school civics and it shows.",
            "title_similarity": "0.5375659",
            "sentiment_compound": 0.0
        },
        {
            "id": "htp61zb",
            "score": 0,
            "text": "It’s intentional shenanigans by the republicans, aka cheat-to-win",
            "title_similarity": "0.44057488",
            "sentiment_compound": 0.0
        },
        {
            "id": "htp98v0",
            "score": 0,
            "text": "Can’t wait for the electoral college to get changed and for it to backfire on the libs that are still bitter about losing in 2016!",
            "title_similarity": "0.5035553",
            "sentiment_compound": -0.69
        },
        {
            "id": "hx9pwb5",
            "score": 0,
            "text": "The only republican to win a popular vote in the last 30+ years was Bush's second term, and yet these are the people that cry about affirmative action?",
            "title_similarity": "0.73954153",
            "sentiment_compound": 0.5423
        },
        {
            "id": "hx9q54n",
            "score": 0,
            "text": "We needed the electoral college 200 years ago because it wasn't feasible to count every vote, ie a democracy. So each district elected someone to represent them in larger elections, ie a republic.\n\nThe electoral college breaks the 1 vote = 1 vote ethos. Each vote in, say Wyoming, is almost 4x stronger than a vote in California or New York.\n\nhttps://www.thestreet.com/personal-finance/how-much-voting-power-do-you-really-have-in-your-state\n\nWell, we have ways to count every vote now. The electoral college is antiquated, worthless and useless and should be abandoned with extreme prejudice.",
            "title_similarity": "0.77780306",
            "sentiment_compound": -0.8347
        },
        {
            "id": "htlwo4h",
            "score": -4,
            "text": "Would you voluntarily join an association where you have little no say in how things are run but you’re bound by the rules they make? If you eliminate the electoral college the less populace states will have little to no say in federal elections. Why would a state stay in the union if they have little to no say in presidential elections?",
            "title_similarity": "0.58378196",
            "sentiment_compound": -0.6096
        },
        {
            "id": "htm5hlj",
            "score": 30,
            "text": "Abolish Super PACs and ban lobbying",
            "title_similarity": "0.30368203",
            "sentiment_compound": -0.0
        },
        {
            "id": "htmniux",
            "score": 5,
            "text": "Fun Fact: Every single time the elected president didn't win the popular vote, with our modern system the winner was a Republican.\n\nHayes\n\nHarrison\n\nBush\n\nTrump",
            "title_similarity": "0.729898",
            "sentiment_compound": 0.4011
        },
        {
            "id": "htnr03p",
            "score": 5,
            "text": "Leave the electoral college alone. If it were not in place, New York and California would decide every presidency from that point forward. The point is to have representation for all of Americans, not just the most populated states.",
            "title_similarity": "0.56112504",
            "sentiment_compound": -0.296
        },
        {
            "id": "htlxoxd",
            "score": 828,
            "text": "Our electoral college system was not designed for the federal government to have massive amounts of power like it does right now. You can argue that it was for rural and agrarian societies all you want but the truth is it was designed at a time when the states weren't as big as they are right now. It was also designed at a time where there was more of a republican (in the classical sense not the party) view of the federal government. \n\nSince the civil war the federal government has been milking the commerce clause for all its worth usurping more and more power from the states. Whether that's good or not depends a lot on your political position.",
            "title_similarity": "0.6665592",
            "sentiment_compound": 0.0292
        },
        {
            "id": "htlw19j",
            "score": -5,
            "text": "[removed]",
            "title_similarity": "-0.009327692"
        },
        {
            "id": "htlzu72",
            "score": -1,
            "text": "Ah yes, another listener to the AEA podcast :)",
            "title_similarity": "0.22307865",
            "sentiment_compound": 0.6908
        },
        {
            "id": "htm0duc",
            "score": -1,
            "text": "Reading the click-through to the actual paper is a bit of a riot IMO.  The paper itself is terribly written.  They seem like the type of scientists that start with something clearly written and then try to obfuscate the crap out of it to seem incontestable.\n\nBut looking at the charts and their conclusions, I don't see a body buried here.  In what way is it not obvious that very close elections are going to be prone to outliers due to counting rules (such as electoral vs. popular)?\n\nPut another way: Elections that have a large voting gap between contestants mathematically can't be prone to the electoral-only win.\n\nHonest question: What am I missing?",
            "title_similarity": "0.6079347",
            "sentiment_compound": 0.8782
        },
        {
            "id": "htm0lua",
            "score": -1,
            "text": "I have 0% confidence that anything will be done about this",
            "title_similarity": "0.3055023",
            "sentiment_compound": 0.5106
        },
        {
            "id": "htm2irp",
            "score": 1,
            "text": "With approximately 250 million eligible voters, the 500,000 delta in Bush versus Gore was close.  Clinton clobbered Trump by +3 million votes and Biden stomped him even harder (+7 million).  \n   \nIs the nation a republic based on the fundamental principles of democracy or not? If we are one, we need to find a way to have the principle of popular sovereignty reinforced rather than gotten around.  \nThe concept of an electoral college is outdated and  ought to be repealed and replaced with a national popular vote tally. Until, then the House size ought to be increased so 'rightsize' the influence of the 100 electoral votes attached to the Senate seats.",
            "title_similarity": "0.70175445",
            "sentiment_compound": 0.7717
        },
        {
            "id": "htm34gg",
            "score": 1,
            "text": "Why do we always need new studies to prove things that are immediately obvious by just living through life?",
            "title_similarity": "0.33209994",
            "sentiment_compound": 0.0
        },
        {
            "id": "htm3i14",
            "score": 1,
            "text": "When the electoral college gives 1 elector to a state with a small population.   And less to a state with high population it’s not a fluke. It’s a feature \n\nJerry rigging within certain states explains the rest",
            "title_similarity": "0.6754164",
            "sentiment_compound": 0.2732
        },
        {
            "id": "htm3n3h",
            "score": 1,
            "text": "Yes, sadly, we knew all along.",
            "title_similarity": "0.035264827",
            "sentiment_compound": -0.0258
        },
        {
            "id": "htm42jm",
            "score": -1,
            "text": "It was made that way for a reason.",
            "title_similarity": "0.058599748",
            "sentiment_compound": 0.0
        },
        {
            "id": "htm49jb",
            "score": -1,
            "text": "It probably happened recently because we have better computer modeling, which allows for political candidates to better target spending in order to win.\n\nIf there were a strict popular vote system, candidates would campaign differently and smaller states would be left behind.\n\nIt would lead to greater inequality.",
            "title_similarity": "0.5772678",
            "sentiment_compound": 0.9313
        },
        {
            "id": "htm50lg",
            "score": -1,
            "text": "The Electoral College is anything but a fair process where the candidate with the most votes wins - BY DEFINITION!\n\nThat’s the whole point of it!\n\nIt was established in part when slave owners worried that slavery would be put to the popular vote where they knew it wouldn’t stand a chance.",
            "title_similarity": "0.60171485",
            "sentiment_compound": 0.6909
        },
        {
            "id": "htm5745",
            "score": -1,
            "text": "The whole point of it is to prevent majority rule. So if you want to win the game, play by the games rules.",
            "title_similarity": "0.34070355",
            "sentiment_compound": 0.7823
        },
        {
            "id": "htm5rpx",
            "score": -1,
            "text": "no need for a scientist to know that 2 parties that have pretty much no difference are going to have closer and closer races in the information era",
            "title_similarity": "0.4659113",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htm86pr",
            "score": 1,
            "text": "> has a high probability in close races  \n\noh wow swimming underwater is also closely related to swimming under water, it has a high probability even",
            "title_similarity": "0.34069043",
            "sentiment_compound": 0.5859
        },
        {
            "id": "htm8n6m",
            "score": 1,
            "text": "We are fucked and it's only going to get worse. Watching our rights stripped away in real time with no recourse.",
            "title_similarity": "0.23222904",
            "sentiment_compound": -0.8658
        },
        {
            "id": "htm9ctt",
            "score": 1,
            "text": "When I was a kid and first learned of electoral college I thought it was dumb: why not just go by the popular vote? Can't remember the explanation I got, but I do remember not being satisfied by the answer. Watching these elections play out as an adult just reinforces what I've always felt abt it.",
            "title_similarity": "0.6065484",
            "sentiment_compound": -0.0382
        },
        {
            "id": "htm9gb1",
            "score": 1,
            "text": "Maybe electoral votes should be weighted more equally in regards of state's populations? \n\nCA has 55 electoral votes for almost 40 million people, while Wyoming has 3 electoral votes for 500,000 people. Wyoming people's vote has 4x more influence in comparison. As American people move around from state to state, the voting populations change, the electoral college votes should be adjusted accordingly.",
            "title_similarity": "0.71962345",
            "sentiment_compound": 0.0
        },
        {
            "id": "htm9sgo",
            "score": 1,
            "text": "Why not just use the normal vote system every other country has? Why do still that clusterfuck voting system that was invented so you could easier vote by using one dude on a horse voting for a bunch of other people?",
            "title_similarity": "0.5657387",
            "sentiment_compound": 0.5305
        },
        {
            "id": "htm9t22",
            "score": 1,
            "text": "I saw a graph/table once of blue and red squares, showing a staggered line through the middle of how you can get the least votes but still win overall.\n\nSuch a stupid system in the US.  Should be total %age of votes, end of story.",
            "title_similarity": "0.6602278",
            "sentiment_compound": 0.1531
        },
        {
            "id": "htmalzm",
            "score": 1,
            "text": "The Electoral College's purpoae was to prevent the poor from affecting rich white slave owners from having their power treated. It's been extremely affective. This is just the extreme margins, but grey area has always affected us.",
            "title_similarity": "0.51603585",
            "sentiment_compound": 0.0247
        },
        {
            "id": "htmavxf",
            "score": 1,
            "text": "What if, and hear me out here, we abolished the electoral college as the outmoded and fundamentally flawed relic that it is and had a real representative democracy?",
            "title_similarity": "0.47678125",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htmbxl4",
            "score": 1,
            "text": "I consider myself a reasonable and intelligent person. And still to this day no one can explain to me how and why the electoral college makes any kind of sense",
            "title_similarity": "0.47892943",
            "sentiment_compound": 0.2023
        },
        {
            "id": "htmd9jb",
            "score": 1,
            "text": "...and this is what happens when your country has the oldest active constitution in the world, and was written by slaveowners to only allow white landowning men to vote.",
            "title_similarity": "0.5246537",
            "sentiment_compound": 0.5574
        },
        {
            "id": "htmebcf",
            "score": 1,
            "text": "And every time, the more-trees-and-sheep-than-people hillbilly states get the undemocratic win.\n\nPersonally, I don't think this is sustainable as a nation. Hillbillies have way too much electoral (and Senate!) power.",
            "title_similarity": "0.63735425",
            "sentiment_compound": 0.6239
        },
        {
            "id": "htmfatt",
            "score": 1,
            "text": "If only there were some kind of electoral system that guaranteed the popular vote winner won the election",
            "title_similarity": "0.54356205",
            "sentiment_compound": 0.8834
        },
        {
            "id": "htmfjjf",
            "score": -1,
            "text": "Is our country simply too big for our government system at this point?  It's always struck me as odd that we have over 200 million people in our country and elect one to essentially run it.",
            "title_similarity": "0.5884751",
            "sentiment_compound": -0.5106
        },
        {
            "id": "htmg09g",
            "score": 1,
            "text": "seems like a good reason to get rid of it",
            "title_similarity": "0.11820689",
            "sentiment_compound": 0.6597
        },
        {
            "id": "htmg928",
            "score": 1,
            "text": "The electoral college was created specifically to prevent populists like Trump from winning. It failed it's purpose and should be abandoned.",
            "title_similarity": "0.3636681",
            "sentiment_compound": 0.1779
        },
        {
            "id": "htmifsx",
            "score": 1,
            "text": "Never mind the electoral college, the fact that a Californian’s vote counts for only 1/3 of a vote from Wyoming or Alaska is beyond ridiculous, and perpetuates minority rule.",
            "title_similarity": "0.6407995",
            "sentiment_compound": -0.3612
        },
        {
            "id": "htmj7oi",
            "score": 1,
            "text": "We'll never get reform because it favors the Republican Party and, rather change to better reflect the beliefs of the nation, they'd rather keep the system rigged. \n\nBecause it's an authoritarian fascist party.",
            "title_similarity": "0.43169165",
            "sentiment_compound": 0.4939
        },
        {
            "id": "htmqgff",
            "score": -1,
            "text": "the original design of the US federal government was to ensure that the constituent states played nice with each other.  The US was supposed to be what the EU is today: a federation of nations who have a common military, open internal borders, and no tarraffs allowed between member states.\n\nUnder that system, the voice of individual states as well as the voice of the people needed to be taken into account.  Which is why you have the senate + house system.  Senate is the congress of the states, and the house is the congress of the people.  And it makes sense that the leader of the federal government should be selected based on the same proportions.\n\nThe major governing power was to be delegated to the states (hence the 10th amendment).",
            "title_similarity": "0.4434417",
            "sentiment_compound": 0.8402
        },
        {
            "id": "htnelwp",
            "score": 1,
            "text": "happened in my US government class when we ran a mock election, I was very salty as I was the candidate with the most votes and the other person had bribed the “electoral college” to give them the “presidency”…it took a High School class to show me I couldn’t trust the way my government’s run. still salty to this day about it, but mostly because it was a huge eye-opener.\n\nteacher used that opportunity to show us how it was all unfair, and how our election system was messed up. she was a good teacher.",
            "title_similarity": "0.61671543",
            "sentiment_compound": 0.5423
        },
        {
            "id": "htno96b",
            "score": 1,
            "text": "When did the Republican Party last win the popular vote?",
            "title_similarity": "0.60019875",
            "sentiment_compound": 0.8519
        },
        {
            "id": "htnpo4y",
            "score": 1,
            "text": "We have to get rid of the electoral college. I will continue to support  any movement to end it.",
            "title_similarity": "0.27013636",
            "sentiment_compound": 0.4019
        },
        {
            "id": "htnr5ay",
            "score": -1,
            "text": "Cool but the US isn’t a democracy so this article is pointless.",
            "title_similarity": "0.3163913",
            "sentiment_compound": 0.1655
        },
        {
            "id": "htnro9t",
            "score": 1,
            "text": "And it favors republicans",
            "title_similarity": "0.26597077",
            "sentiment_compound": 0.25
        },
        {
            "id": "htogono",
            "score": -1,
            "text": "We don’t live in a direct democracy. The electoral system prevents the skewed viewpoints of a concentrated urban center from having complete federal power over all rural areas or vice versa depending on how your population is spread out.  There’s are reasons why there should be general state-by-state agreement as opposed to just pure majoritarian mob rule on a national scale.  Similar to why the 60 vote limits exists to override a filibuster: federal scale governance should have wide agreement across segments of society, not dependent on a razor thin 50/50 plus tiebreaker margin that will probably flip several times in the near future.  What you absolutely do not want is a bifurcation of society where today only NYC/LA urbanites have any say whatsoever over the entire executive branch of the govt, and the rest of America is completely disregarded. That’s not a recipe for long term success. Compromise across different parts of society is a better recipe for long term success. Diversity of ideas stemming from diversity of lifestyles factor into how national security should be done broadly. When the population is almost 50/50 split, you’ll get these types of situations because of that protection of compromise between diversity of ideas. If the population continues to urbanize, this will probably stop happening as rural states will lose electoral votes to urban states. There are 538 electoral votes, over 80% of which are already based directly on population, so we’re already pretty far skewed towards direct democracy with minimal forcing of compromise.",
            "title_similarity": "0.5857787",
            "sentiment_compound": 0.9391
        },
        {
            "id": "htojsba",
            "score": -1,
            "text": "It’s there for a reason",
            "title_similarity": "0.022427259",
            "sentiment_compound": 0.0
        },
        {
            "id": "htowxuo",
            "score": 1,
            "text": "Something that seems to be missed in this discussion is that the United States is a representative republic not a democracy. The founding fathers understood that mob rule was a bad thing.",
            "title_similarity": "0.4741657",
            "sentiment_compound": -0.4404
        },
        {
            "id": "htp17sm",
            "score": 1,
            "text": "It’s the United States of America. It’s not what does this person want and that person wants…but rather what does this state want and what does that state want. And then based on size their strength is weighted. I am not sure why people don’t seem to understand that or why it was established as the states electing vs the total individuals of the country.",
            "title_similarity": "0.60092616",
            "sentiment_compound": 0.713
        },
        {
            "id": "htlpw9s",
            "score": 2154,
            "text": "5 of the last 6 presidential elections in USA, democrats won the popular vote.\n\n\nEdit* The majority vote was wrong as most people pointed out correctly.",
            "title_similarity": "0.7247102",
            "sentiment_compound": 0.5267
        },
        {
            "id": "htls4nm",
            "score": -8,
            "text": "A high probability in close races? Wow surely not, an astonishing find.",
            "title_similarity": "0.43287146",
            "sentiment_compound": 0.7717
        },
        {
            "id": "htni6e1",
            "score": 35,
            "text": "This feels like the wrong place for this thread",
            "title_similarity": "0.10819248",
            "sentiment_compound": -0.1531
        },
        {
            "id": "htm2v45",
            "score": 2,
            "text": "The frustrating thing for me about the electoral college is that every presidential election, I know my vote doesn't matter. Why? Because I live in Utah and the state is certain to give all its electoral votes to the Republican. \n\nBeyond that, the EC discourages voting unless you happen to live in a swing state. Utah had one of the worst turnouts in 2020 of any state (only six were worse - all but Florida that were states hardly in doubt) and a big reason is that voters know their vote truly doesn't matter. At least at the presidential level. This despite the state having universal mail-in ballots delivered straight to you.\n\nBeyond all that, as we saw with the 2020 election, the EC is significantly flawed to the point that it can be manipulated even more to override the will of the people. Since electors have to be approved, and some politicians in some states have pushed passing laws that change how they're approved at the state-level, we're really positioning ourselves for a very contested and ugly situation.\n\nThat should never happen, regardless if you believe in more local control of federal elections or not. But it's scary how some politicians are working to allow the ability for the legislature to circumvent the old process and appoint their own electors even if Candidate A wins the state. \n\nAll these reasons lead me to believe that the process is failing and that's scary.",
            "title_similarity": "0.5617185",
            "sentiment_compound": -0.5696
        },
        {
            "id": "htm65us",
            "score": 2,
            "text": "The US senate is a sham chamber at the moment. Due to the hyper partisan divide, the minority side isn’t willing to come to the bargaining table. The filibuster at this time is the biggest obstacle in the federal government.\n\nRepublicans do not want to work with democrats as they make more fundraising dollars on fighting them than they do working with them. It’s all about money. That and if they do work across the aisle, they’re labeled traitors and are ripe for primary challenges from former celebrities, college football coaches, and the GQP Twitter flavor of the month.",
            "title_similarity": "0.6070115",
            "sentiment_compound": -0.6023
        },
        {
            "id": "htmf9jy",
            "score": 2,
            "text": "The electoral college was specifically set up this way by the founding fathers to give more weight to rural areas,  literally read the Federalist papers, they explain it was included because of how rural areas in Britain got absolute ignored in British parliament and how politicians focused solely on urban areas. It’s 100% a feature of our republic and it’s not going anywhere absent the tearing up the constitution, which is also not going to happen absent a civil war or destruction of the country because getting 3/4ths of all the states legislatures agreeing to getting rid of the electoral college is never going to happen. Its not even a conversation worth engaging in because of how low of a likelihood of it happening.",
            "title_similarity": "0.5796684",
            "sentiment_compound": -0.5719
        },
        {
            "id": "htmhuui",
            "score": -2,
            "text": "This is a feature not a bug. States rights > federal/overall populace rights.",
            "title_similarity": "0.2056436",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmloy3",
            "score": 2,
            "text": "It's almost as if the system was designed that way...",
            "title_similarity": "0.10195026",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmonsw",
            "score": 2,
            "text": "But this is directly tied to gerrymandering which is a bigger issue because it affects Congress as well. \n\nThe less political a boundary, the less likely there will be “close races”. Look at data on what people want vs what congress votes for.",
            "title_similarity": "0.6050459",
            "sentiment_compound": 0.4767
        },
        {
            "id": "htmrq08",
            "score": -2,
            "text": "Doesn’t belong in this sub. Ban OP.",
            "title_similarity": "0.07171315",
            "sentiment_compound": -0.5574
        },
        {
            "id": "htms2m9",
            "score": 2,
            "text": "Imagine if in 2000 and 2016 it was the Republican candidate who won the popular vote and lost the election via the Electoral College (or via the Supreme Court).  \n\nRepublicans would be frothing at the gob to eliminate the EC, and you can be sure there would have been significant violence in the streets after those elections.",
            "title_similarity": "0.6618612",
            "sentiment_compound": 0.7783
        },
        {
            "id": "htmvr9z",
            "score": -2,
            "text": "the electoral college is perfect as it is because it allows smaller states to create electoral college rules so that they can leverage to have a relatively bigger voice so larger states with more population don't completely rule them. Without it California and NY would control elections. We don't live in a pure democracy, never did because our forefathers understood how fickle and uneducated most people are. The fact that people don't understand the EC proves this is still true and they were right.",
            "title_similarity": "0.608276",
            "sentiment_compound": 0.8225
        },
        {
            "id": "htmwbxi",
            "score": 2,
            "text": "Is it not popular opinion to just eliminate the electoral college?",
            "title_similarity": "0.41365498",
            "sentiment_compound": -0.3252
        },
        {
            "id": "htmyat2",
            "score": -2,
            "text": "New York and California should NOT decide every election. People calling for changes to the electoral system are ignorant on the history of our republic. It’s designed this way for a reason.",
            "title_similarity": "0.49406874",
            "sentiment_compound": -0.2732
        },
        {
            "id": "htmz6sz",
            "score": -2,
            "text": "The electoral college is a really good thing for the USA. Where there are two coasts and a vast amount of land between them which one party likes to refer to as \"flyover states\". We will not be bullied by the tyranny of the majority.",
            "title_similarity": "0.5255893",
            "sentiment_compound": 0.8998
        },
        {
            "id": "htn28gx",
            "score": 2,
            "text": "And the last time a Republican won the popular vote was 30 years ago and that was because people didn't want power changing hands in the middle of a war.",
            "title_similarity": "0.64211464",
            "sentiment_compound": 0.3352
        },
        {
            "id": "htn9kmx",
            "score": -2,
            "text": "Which is working as intended. It is not an empire of fully coequal subdivisions of a national level authority. Its an association of distinctly separate authorities who have weighted their respective powers in determining national authority by agreement. The terms of that agreement are not simply by gross population. If they were, why on earth would many of the smaller states have agreed to join the US? As much as people like to look down on people of the past, they weren't idiots. They weren't going to throw away their sovereignty to become a vassal of New York. Yet the larger states saw value in getting absolutely everyone on board, and so the compromise was reached.   \n\n\nChanging the system after the fact without a constitutional amendment isn't substantively different from literally invading the smaller states. You would be violating the agreement that was the basis for them joining. Why  the same people who are so appalled that the US violated treaties with the Native Americans also at the same time want the US to violate its agreements with the smaller states I have no idea.",
            "title_similarity": "0.55237246",
            "sentiment_compound": 0.8551
        },
        {
            "id": "htnb79v",
            "score": -2,
            "text": "Jerry Brown made ballot harvesting legal in CA in 2016 and Newsom just made mass mail in ballots permanent in CA.  A Republican will never win the popular vote again.  It's the United States, States have rights thanks to the Electoral College. It is the only thing standing between corrupt one party rule. Amazing how the same people who claim to support democracy advocate removing power from the people and the states.",
            "title_similarity": "0.660169",
            "sentiment_compound": 0.8749
        },
        {
            "id": "htnbi9f",
            "score": -2,
            "text": "Popular votes don’t matter in a union of states, that’s why we are united. Stop trying to divide, this would cause the central states to have no say in any election.",
            "title_similarity": "0.43054202",
            "sentiment_compound": 0.3182
        },
        {
            "id": "htndejp",
            "score": 2,
            "text": "There was nothing close about the race when the electors gave Trump the presidency. \n\nClinton won by 7 million votes if memory serves.",
            "title_similarity": "0.6457609",
            "sentiment_compound": 0.5719
        },
        {
            "id": "htnp8zr",
            "score": 2,
            "text": "I get that \"minority rule\" is out of control, and agree in some sense that it is, but I'm currently reading some of the Federalist Papers (which were published as an attempt to convince New York to ratify the Constitution), and it is becoming more clear that the intent was never to have \"pure\" majority rule. If that were the intent, the country could and probably would simply have one big national presidential election. The intent of our government was to balance individual state power (a \"federal\" system) with individual citizen power (a \"national\" system), and it was not lost on the framers that some states were larger than others, and thus a balance of states could outweigh the desires of the pure majority of citizens. I'm not saying this is the best way to run a government, but the goal was to unify, in government, a bunch of independent states, not to transform all states into one big national entity where the majority always rules. The founders believed that under that type of system, the minority would be eternally powerless and would likely revolt against the system. I think they were onto something with that. (Also, the smaller existing states might have refused to ratify a constitution in that form.)\n\nUnfortunately, our system is far from ideal. Between gerrymandering, voter disenfranchisement, an overly political judiciary (especially the Supreme Court), etc., the minority has manipulated the system to the point of being essentially a corrupt usurpation of power; but still, pure majority rule or abolishing the electoral college is not necessarily the answer, when the intent is to divide decision-making authority among the individual citizens and the individual states. Citizens of small (population-wise) states that comprise mostly minority-party citizens would surely get the shaft in that situation. Maybe some reform of how electors are chosen is in order, but I don't know.\n\nThis is the same logic for having 2 senators for every state, no matter how populous or sparse, and the representatives in the House being proportional. People complain about Montana having as many senators as California (and as a Californian, I agree due to my bias), but that is exactly the intent. Otherwise, you would just turn Congress into one big House of Representatives, and the framers understood that.\n\nI'm not advocating for a particular solution, but it can be helpful to understand the logic behind the current one, and to understand that government chosen by a pure majority of citizens was never the intent. (And I'm not getting into the non-participation of slaves, women, non-landowners, etc., or even ex-felons and other disqualified people. I get that not every U.S. resident is or was a citizen, and not every adult citizen is or was an eligible voter. I'm just talking about the basic design.)",
            "title_similarity": "0.64512324",
            "sentiment_compound": 0.9647
        },
        {
            "id": "htnrdpi",
            "score": 2,
            "text": "The unpopular party with horrible ideas doesn't want reform.",
            "title_similarity": "0.3550712",
            "sentiment_compound": -0.2551
        },
        {
            "id": "htnxodc",
            "score": 2,
            "text": "Bet its going to get worse. \n\nChanging counties positions and sizes to suppress vote is getting pretty popular in red states.",
            "title_similarity": "0.51079965",
            "sentiment_compound": 0.4404
        },
        {
            "id": "hto6gkf",
            "score": 2,
            "text": "Should be 1 person 1 vote",
            "title_similarity": "0.27200338",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoefxv",
            "score": -2,
            "text": "Most of the lead for the popular vote comes from California and New York. If the electoral college is replaced with a popular vote system, then we may as well only let those two states vote.",
            "title_similarity": "0.5928193",
            "sentiment_compound": 0.7717
        },
        {
            "id": "htoirlh",
            "score": -2,
            "text": "I think election integrity is fundamental to our Democratic Republic functioning.  We want this form of government by design instead of a pure democracy because it protects against tyranny of the masses.  A successful US candidate must be popular across the nation rather than just in heavily populated regions. \n\nAgain, we must ensure free, fair, and transparent elections rather than the kind we had in 2020.",
            "title_similarity": "0.5404389",
            "sentiment_compound": 0.9698
        },
        {
            "id": "htooxla",
            "score": -2,
            "text": "Biden stole the election. That's why he'd so focused on who counts the vote and not who votes as he's Said in his recent press Conference.",
            "title_similarity": "0.5475434",
            "sentiment_compound": 0.5214
        },
        {
            "id": "htp31ya",
            "score": 2,
            "text": "[deleted]",
            "title_similarity": "0.022836467"
        },
        {
            "id": "htp63ho",
            "score": 2,
            "text": "I am by no means a conservative apologist, but I hate this argument. It's like saying, \"if a 3-point basket was worth 10 points, we would have won the title.\" \n\n\nOk,  *maybe*, but if those were the rules, how do you know the other guys wouldn't have taken more threes?  When you change thw rules of the game, you change how people play it.  \n\nThe same principle applies in politics, both for candidates and voters.  If you change the rules of the election, you change how candidates campaign, and you change how people vote.",
            "title_similarity": "0.6453929",
            "sentiment_compound": 0.5086
        },
        {
            "id": "htnmvsy",
            "score": 71,
            "text": "Why is this in /r/science?",
            "title_similarity": "0.22118601",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmq09e",
            "score": 28,
            "text": "What does this have to do with science?",
            "title_similarity": "0.19760084",
            "sentiment_compound": 0.0
        },
        {
            "id": "htlxo1h",
            "score": -11,
            "text": "Buyden is the most popular president in American history. Ever. According to Buyden.",
            "title_similarity": "0.59531677",
            "sentiment_compound": 0.4754
        },
        {
            "id": "htm3336",
            "score": -3,
            "text": "[deleted]",
            "title_similarity": "0.022836467"
        },
        {
            "id": "htm39vt",
            "score": -3,
            "text": "My team got more yards on the board. Never mind the goals.",
            "title_similarity": "0.41014555",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnacgl",
            "score": 4,
            "text": "Fun fact. Ross Perot had almost 19% of the popular vote(over 19 million votes), and received 0 Electoral college votes. \n\nElectoral college is a mess.",
            "title_similarity": "0.6463149",
            "sentiment_compound": 0.5574
        },
        {
            "id": "htn4hmk",
            "score": 3,
            "text": "[removed]",
            "title_similarity": "-0.009327672"
        },
        {
            "id": "htowseo",
            "score": 3,
            "text": "The Electoral College is doing what it's designed to do, preventing the tyranny of the majority, so obviously we must abolish it! It's keeping the tyrants from gaining absolute power! Those poor poor tyrants, why doesn't anyone think of the tyrants you heartless countryside serfs who want a say in how your government operates!",
            "title_similarity": "0.4450572",
            "sentiment_compound": -0.8061
        },
        {
            "id": "htmozne",
            "score": 6,
            "text": "Roger Stone planned on manipulating this.   Are we a democracy at all?   I'd say no.",
            "title_similarity": "0.43050107",
            "sentiment_compound": -0.3612
        },
        {
            "id": "htmcrap",
            "score": 1134,
            "text": "It’s been said time and time again, a reform would be nigh impossible because of the pushback from those who benefit from the current system. An unpopular senator would likely disagree with a change in the system, and considering the approval rating of a majority on current elected officials, it’s safe to assume any major changes would get shot down before they have a change to reach implementation.",
            "title_similarity": "0.5862066",
            "sentiment_compound": 0.7579
        },
        {
            "id": "htlxgnu",
            "score": 1070,
            "text": "It's because electoral votes for a single state all go to the winner of that state. If electoral votes were cast for candidates based on the percentages of the popular vote for the candidate in that state, this would become less of an issue and the electoral results would more closely match the overall popular vote.",
            "title_similarity": "0.64189065",
            "sentiment_compound": 0.8555
        },
        {
            "id": "htp5w7m",
            "score": 8,
            "text": "Urban areas and rural areas have many dissimilar conditions (social economic racial theological etc,) and wildly differing issues of importance.\n\nLet’s be completely honest, NYC hipsters couldn’t care any less about issues that face, say, South Dakota. A pure popular vote would basically nullify rural voices, with disastrous results.",
            "title_similarity": "0.52525127",
            "sentiment_compound": 0.8016
        },
        {
            "id": "htm1dos",
            "score": 3795,
            "text": "It has happened 5 times, not 4. This article for some reason ignores the 1824 election (the \"Corrupt Bargain\" election).",
            "title_similarity": "0.58465195",
            "sentiment_compound": -0.0772
        },
        {
            "id": "htnipse",
            "score": 25,
            "text": "What's the science in this news?",
            "title_similarity": "0.23466817",
            "sentiment_compound": 0.0
        },
        {
            "id": "htm46xu",
            "score": 1,
            "text": "\"this peculiar outcome of the US Electoral College has a high probability in close races, according to a new study\"  \n\n\numm.. thats a mathematical certainty.",
            "title_similarity": "0.588549",
            "sentiment_compound": 0.3818
        },
        {
            "id": "htm4gck",
            "score": 1,
            "text": "Only 4? I thought it was 5.\n\nAlso, we've only had 46 Presidents, so either way, roughly 10% isn't exactly trivial.",
            "title_similarity": "0.6527903",
            "sentiment_compound": 0.0191
        },
        {
            "id": "htm52ke",
            "score": 1,
            "text": "John Quincy Adams - 1824\n\nRutherford B Hayes - 1876\n\nBenjamin Harrison - 1888\n\nGeorge W Bush - 2000\n\nDonald J Trump - 2016\n\nI’m not sure why the article discounts the 1824 vote.",
            "title_similarity": "0.55576867",
            "sentiment_compound": -0.2411
        },
        {
            "id": "htm6re4",
            "score": 2,
            "text": "Perhaps a weird coincidence.  But in Canada there are also four times that the person with the lower popular vote formed government.... two of those times were within the last 3 years (other two times were Joe Clark beating Trudeau in 1979, John Diefenbaker beating Louis St Laurant in 1957 and if you want to count it Mackenzie King beating Arthur Meighan just by refusing to give up the title of Prime Minister) .... and is the main reason why the current government abandoned proportional representation (can't have \"radicals\" running the government).\n\nI think, as far as an electoral system goes, if this popular vote is a problem to you... it's really best to adjust it in places where it's appropriate.  In Canada electoral reform is really a niche issue and the number of people who are really calling for it is incredibly small.  We add ridings to try and balance off proporitions but we're constitutionally constrained by PEI (who get two minimum seats), Newfoundland (who get a minimum of 7 seats) and Quebec, Manitoba and Saskatchewan (which have grandfathered seats).\n\nThe electoral college is probably fine because it does what it was intended to do.  If popular vote is a problem it's best to reform the house of the populace, the Congress.  Perhaps ridings should be drawn state-blind.  Most of the power imbalances are in places like Florida, California and randomly Montana where they don't have enough seats for their population (but if they add one more seat they have too many seats).  Getting rid of state lines and just carving up interstate boundaries could resolve that problem.",
            "title_similarity": "0.78978014",
            "sentiment_compound": 0.1567
        },
        {
            "id": "htma0zj",
            "score": 1,
            "text": "This is why we need to dramatically increase the number of US Representative seats.  #PragmaticRepresentation",
            "title_similarity": "0.3352532",
            "sentiment_compound": 0.3818
        },
        {
            "id": "htma79h",
            "score": 1,
            "text": "\"system is working as designed\"",
            "title_similarity": "0.018290358",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmao4b",
            "score": 1,
            "text": "Oh, the popular decision is always the right one?",
            "title_similarity": "0.22634101",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htmavq3",
            "score": 1,
            "text": "Imagine if you will the party that used the filibuster a record amount of times in 2019-2020 is trying to change the rules of it now. I wonder why? Midterms are going to be amazing!",
            "title_similarity": "0.46414167",
            "sentiment_compound": 0.7777
        },
        {
            "id": "htmawb4",
            "score": 1,
            "text": "The convoluted electoral college and gerrymandering and lack of transparency is the problem",
            "title_similarity": "0.42679203",
            "sentiment_compound": -0.6124
        },
        {
            "id": "htmazhv",
            "score": 1,
            "text": "I just don’t like the fact that for the most part everything comes down to Ohio and Florida for who becomes the president. Especially considering how rampant gerrymandering is in those states.",
            "title_similarity": "0.49953535",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htmbmol",
            "score": 1,
            "text": ">\tBut another quantitatively more important explanation, which operates alongside this, is the winner-takes-all awarding of votes by states. A candidate that wins just shy of a majority of the state's vote gets zero Electoral College votes in the final tally, whereas the candidate who wins just the barest majority gets all the Electoral College votes. That doesn't mean that we should expect an advantage to any particular party. But in practice, in the last several decades, when Democrats win large states, they tend to win those large states by large margins, and when they lose them, they tend to lose them by small margins.\n\nThis is a interesting quote especially wrt to the winner-take-all system. It'd be an interesting experiment to see how elections would change in absence of it.",
            "title_similarity": "0.76620775",
            "sentiment_compound": 0.9867
        },
        {
            "id": "htmbr72",
            "score": 1,
            "text": "This is why voting districts and especially gerrymandering should be removed from the system.",
            "title_similarity": "0.25692263",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmbvu6",
            "score": 1,
            "text": "This is the whole point of the Electoral College.  It was created to give rural states with lower population more power in an effort to create balance, and it is inherently broken.",
            "title_similarity": "0.45489582",
            "sentiment_compound": -0.296
        },
        {
            "id": "htmby4j",
            "score": 1,
            "text": "Republicans have won the popular vote once since 1988 with Gwb’s second term only.",
            "title_similarity": "0.7651763",
            "sentiment_compound": 0.7579
        },
        {
            "id": "htmbyhx",
            "score": 1,
            "text": "Abraham Lincoln lost the popular vote too if I’m not mistaken…",
            "title_similarity": "0.56823033",
            "sentiment_compound": 0.128
        },
        {
            "id": "htmc3c9",
            "score": 1,
            "text": "I'm more interested in the local and state elections, the president is a puppet of the elite. R's are and have been handily winning middle American in local/state elections. When your ideological positions and policies focus on the coastal elites and globalists, you lose well over half the country. As we saw with the Obama years.",
            "title_similarity": "0.7234731",
            "sentiment_compound": 0.6997
        },
        {
            "id": "htmcrgh",
            "score": 1,
            "text": "Anyone who tells you the U.S is a democracy is either lying to you or not following U.S politics closely enough",
            "title_similarity": "0.5029542",
            "sentiment_compound": -0.5267
        },
        {
            "id": "htmcu73",
            "score": 1,
            "text": "Both recent times it benefitted the Republicans so it's not gonna change any time soon!",
            "title_similarity": "0.4833948",
            "sentiment_compound": 0.4574
        },
        {
            "id": "htmdcgh",
            "score": 1,
            "text": "And 5 of the 9 justices currently on the Supreme Court were nominated by popular vote losers.",
            "title_similarity": "0.6670156",
            "sentiment_compound": 0.4588
        },
        {
            "id": "htmdq9a",
            "score": 1,
            "text": "So it’s a feature of the system, and that’s why a minority that wins the majority keeps it in place.",
            "title_similarity": "0.41555858",
            "sentiment_compound": 0.5719
        },
        {
            "id": "htmdw48",
            "score": 1,
            "text": "The system is set up exactly how the founding fathers wanted it to be.  \n\nWhile they promoted democracy, they did not want mob rule as they thought the working class/peasants would overwhelm them so this exact system was set up to prevent it.\n\n\nTimes have changed so yes the system needs to be revamped but let's not get delusional thinking this was never the intent.",
            "title_similarity": "0.45159537",
            "sentiment_compound": 0.4088
        },
        {
            "id": "htmdzl3",
            "score": 1,
            "text": "This is a science sub. You should all know better. You can NOT apply new rules to the old game. You can’t possibly apply past election results to a new set of rules. Yes, the democrats won 5/6 popular votes - but no one was trying to win the popular vote. All the political strategies from spending to messaging to campaign stops are based on a strategy to win the electoral votes, not the popular votes. If you change the rules of the game to win the popular votes then the strategies will change completely and you will have a completely different set of results.",
            "title_similarity": "0.63691443",
            "sentiment_compound": 0.976
        },
        {
            "id": "htme49h",
            "score": 1,
            "text": "Human Beings just hate losing, they want to win, seek dominance. That's why every November I go to Europe for a month, I let America figure itself out for a month. Tired of \" my party is better because x y y\" Both of your Goddamn parties are controlled by the very same Elites who want to control you. Let me know when someone from the projects win a primary.",
            "title_similarity": "0.5778849",
            "sentiment_compound": 0.7184
        },
        {
            "id": "htmeexw",
            "score": 1,
            "text": "It's almost as if the antiquated systems of our Government haven't held up over time (Electoral College, The Senate, SCOTUS, Campaign Finance).",
            "title_similarity": "0.66482526",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmfion",
            "score": 1,
            "text": "Everytime it's happened there has also been extremely shady controversy too",
            "title_similarity": "0.3519567",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmfths",
            "score": 1,
            "text": "And that was helped along in the 2000 election by the Republican SecState of Florida Katherine Harris, who quietly purged the Florida voter rolls of tens of thousands of voters prior to the election.\n\nLike many truly evil plots, this one had a thin patina of fairness on the top. Harris said she was purging the rolls of ineligible voters: people who were dead, had moved elsewhere, that kinda thing. And who could argue with that, right?\n\nBut the way she went about it was by casting a *ludicrously* wide net. Do you have the same name as an ineligible voter? That's a disenfranchisement. Do you live at the same address where an ineligible voter used to live? That's a disenfranchisement. Does your name work out to the same numerical value as an ineligible voter when the widely-discredited Soundex algorithm is applied? You better believe that's a disenfranchisement.\n\nAnd when the dust had settled, by \"total coincidence,\" pretty much every single person who had been kicked off the rolls was registered Democratic. Hallelujah! It's a miracle! Al Gore lost Florida, and hence the election, by a mere 537 votes...or rather, we THINK he did, because the Republicans had the Supreme Court step in and halt further recounts at a time when Bush was ahead.\n\nHarris' stealth purge was so successful that other Republican-dominated states have since adopted the practice, in addition to the numerous other tactics they use to suppress opposition votes.\n\n[It is theoretically possible to win the presidency with just 21% of the popular vote.](https://www.npr.org/2016/11/02/500112248/how-to-win-the-presidency-with-27-percent-of-the-popular-vote)\n\nOur democracy is being stolen right under our noses. It's been going on for over 20 years, and it's only now, when it's almost certainly too late, that people are *finally* beginning to wake up and realize it.",
            "title_similarity": "0.5956397",
            "sentiment_compound": 0.9913
        },
        {
            "id": "htmfxgb",
            "score": 1,
            "text": "The system was not designed for population density of this magnitude - and gerrymandering has exasperated the flaws. \n\nEdit - I am not a statistician.",
            "title_similarity": "0.38335335",
            "sentiment_compound": -0.4215
        },
        {
            "id": "htmg2re",
            "score": 1,
            "text": "Welcome to the Republic known as America.",
            "title_similarity": "0.14061783",
            "sentiment_compound": 0.4588
        },
        {
            "id": "htmgfry",
            "score": 1,
            "text": "This will never change.",
            "title_similarity": "0.038760386",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmgt7h",
            "score": 1,
            "text": "What are some proposed solutions to fix / replace the current system?",
            "title_similarity": "0.21006246",
            "sentiment_compound": 0.1779
        },
        {
            "id": "htmgxif",
            "score": 1,
            "text": "You also need to remember that the teams (candidates) play with the rules given to them. If electoral votes were apportioned as opposed to winner-take-all, Republican candidates would spend far more money and time in CA, NY, etc. and Democrats would spend more time in red strongholds.\n\nIt's disingenuous to say the elections were not representative of the people when the voters who actually got out to vote, whether through get out the vote campaigns, advertising, belief their vote matters, etc, don't represent the population.\n\nThe only way one can fairly say \"X won the popular vote so should be president\" is if those were the rules going into the election. Otherwise it's like rescoring a football game after it's over assigning 3 points to touchdowns, 2 to PATs, 28 pts to safeties and FGs worth 4.",
            "title_similarity": "0.6779551",
            "sentiment_compound": 0.9423
        },
        {
            "id": "htmhjsf",
            "score": 1,
            "text": "And close races are the point of disenfranchising a class of potential voters.",
            "title_similarity": "0.45249575",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmi3pd",
            "score": 1,
            "text": "It will always be a very close race, because the candidates are interchangeable. While they are not interchangeable in character (you know who), they are almost interchangeable in policy.\n\nAs such, it's a question of sympathy and for very large numbers, that boils down to a 50-50 split, more or less.\n\nBeing from Europe, the US system seems *weird* at best, but upon closer look, it's not that easy to find a \"better\" system - not the least for the lack of definition of what exactly constitutes \"better\"....\n\nBTW: I live in Switzerland, but I am German. While Switzerland has come as close as possible to what one could describe a \"perfect\" democracy, the system has its limits, too - and they are showing (if you know where to look).\n\nIt's unclear if the US (or any large country really) could be efficiently governed with such a system.",
            "title_similarity": "0.55947745",
            "sentiment_compound": 0.9207
        },
        {
            "id": "htmi4zk",
            "score": 1,
            "text": "It's because the house of reps was meant to grow in size to match the population. Capping at 435 was nonsense.",
            "title_similarity": "0.5407573",
            "sentiment_compound": -0.4019
        },
        {
            "id": "htmi9zc",
            "score": 1,
            "text": "All a well orchestrated scam",
            "title_similarity": "0.18076646",
            "sentiment_compound": -0.3818
        },
        {
            "id": "htmikcg",
            "score": 2,
            "text": "Is there really a solution to the electoral college? I live in rural MT and have nothing in common with CA or NY and don't want them representing me.  Any practical solution?",
            "title_similarity": "0.39125526",
            "sentiment_compound": 0.6145
        },
        {
            "id": "htmjbau",
            "score": 1,
            "text": "Did this really need a statistical breakdown? I figured the math out on this when i was like 10",
            "title_similarity": "0.43442422",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htmjee0",
            "score": 1,
            "text": "Never in the history of democratic votes",
            "title_similarity": "0.42531323",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmkgjg",
            "score": 1,
            "text": "Systematic evidence of gerrymandering's effectiveness?",
            "title_similarity": "0.21818048",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmklg6",
            "score": 1,
            "text": "The entire system is broken.  2 senators for every state was the biggest mistake the founding fathers made…the US isn’t really a democracy",
            "title_similarity": "0.6094988",
            "sentiment_compound": -0.6705
        },
        {
            "id": "htmkq9a",
            "score": 1,
            "text": "Given proper historical context this should not be a surprise to anyone because this is intentional. Larger population states having proportionally less voting power in the electoral congress is a political compromise. If every vote mapped the same to the electoral college then it would give the most populous states, at the time Virginia, much greater political power and the ability to bend national politics to it's will. \n\nRemember, the US was formed as a union of at least theoretically sovereign states. Smaller states weren't inclined to join if it just meant the larger ones would tell them what to do. Before the revolution the colonies had each dealt directly with the crown and didn't have political power over one another. Nobody was inclined to trade one master for another so several compromises were designed to limit the possibility of larger states imposing a tyranny of the masses on the smaller ones. \n\nThose compromises included the bicameral nature of the legislature where proportional representation of the house is tempered by fixed representation in the senate. As well as scaling the votes in the electoral college. \n\nFor an example of how national politics would look if these compromises weren't in place one only needs to look at the states who are dominated by large cities. NY state politics are driven by NYC. Just like how Chicago dominates Illinois politics.",
            "title_similarity": "0.6340097",
            "sentiment_compound": 0.6703
        },
        {
            "id": "htmljx7",
            "score": 2,
            "text": "Term limits that actually exist for people. No man should be on office 30 years sorry that \n Is fucked",
            "title_similarity": "0.5230555",
            "sentiment_compound": -0.7845
        },
        {
            "id": "htmlvth",
            "score": 1,
            "text": "That's the point. We have a system that takes the people and the states into consideration. Having it off of the popular vote will make it so you only have to pander to cities.",
            "title_similarity": "0.45694697",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htmlyf4",
            "score": 1,
            "text": "In the current system, do people vote for the presidents, or do they vote for what their state should vote for presidents? \n\nIs the president really the president of the people or just the president of the United States?",
            "title_similarity": "0.53616977",
            "sentiment_compound": 0.4871
        },
        {
            "id": "htmmcn9",
            "score": 1,
            "text": "This study is useless since it doesn’t considers the Gerrymandering factor",
            "title_similarity": "0.24038318",
            "sentiment_compound": -0.4215
        },
        {
            "id": "htmmoy8",
            "score": 1,
            "text": "The system is working exactly how it's supposed to.",
            "title_similarity": "0.10773989",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmmtid",
            "score": 1,
            "text": "It is really similar to taxation without representation. The majority should rule",
            "title_similarity": "0.42463565",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmmx8x",
            "score": 1,
            "text": "Or - sparsely populated farmland whose political policies are vastly different from the majority of the US, which is urban. See how that works? Two sides.",
            "title_similarity": "0.3985355",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmmyd7",
            "score": 1,
            "text": "The \"funny\" part?  \n\n- When/if Florida becomes a dependable narrowly-carried \"blue state\" in the EC...the GOP will need to run an otherwise flawless campaign to win a general election.\n\n- When/if Florida AND *Texas* become  dependable narrowly-carred \"blue states\" in the EC... it'll be essentially impossible for the GOP to win a general election (barring any sort of unexpected sea change...such as Illinois flipping red).\n\nI'd say that we're still 10-20 years from this coming to pass... but if/when it does?  We'll start to see the EC's most ardent supporters transform into the system's loudest critics, likely overnight.",
            "title_similarity": "0.6387395",
            "sentiment_compound": 0.9362
        },
        {
            "id": "htmn11u",
            "score": 1,
            "text": "Simple solution. Only allow LA and New York votes to count. Scrap the rest.",
            "title_similarity": "0.36765546",
            "sentiment_compound": 0.4939
        },
        {
            "id": "htmn6fa",
            "score": 1,
            "text": "I’m all for the popular vote but you need media telling the truth as not to influence or gaslight the population so the people know what/who they are really voting for and not just the sensational headlines they read.",
            "title_similarity": "0.48809266",
            "sentiment_compound": 0.5927
        },
        {
            "id": "htmng8d",
            "score": 1,
            "text": "4 is four times too many",
            "title_similarity": "0.533797",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmnjaa",
            "score": 1,
            "text": "Arguably GW Bush was a \"sitting war-time president\" after the events of September 11. \n\nIf we consider those \"exigent circumstances\" and excuse the 2004 election as an anomaly, the Republican party has not won the popular vote in a presidential election since the 80s. \n\nIt's a national trend that somehow the Supreme Court alignment contradicts. We wouldn't be talking an overturn of Rowe v Wade if the  GOP didn't  pressed a technical advantage and flip-flop their stance on election year nominations. \n\nAnd for all talk of election fraud, people's memory is certainly selective. Al Gore was well within the margin of error when the courts ordered the stopping of recounts and when Bush's brother used his governorial powers in Florida to halt the evaluation of uncounted voted in democratic areas.  Its entirely possible that hand recounts would've flipped those results. \n\nI really don't understand why conservatives feel so empowered.  Its true that political ideologies wax and wane, but a party that still has re-criminalizing gay marriage buried in their agenda they really don't seem to see the comet coming.",
            "title_similarity": "0.73309195",
            "sentiment_compound": 0.665
        },
        {
            "id": "htmnjxf",
            "score": 1,
            "text": "The ol’ tyranny of the majority debacle.",
            "title_similarity": "0.26693177",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmnrw9",
            "score": 1,
            "text": "Remember people - your local/state officials has more of a impact on your lives than a president.",
            "title_similarity": "0.6167562",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmnxe5",
            "score": 1,
            "text": "It's a consequence of capping the house of representatives size and by extension the electoral college.  Solution here is up the limit on reps, which means larger states aren't as diluted in power as the current system structures things to be.",
            "title_similarity": "0.6507459",
            "sentiment_compound": 0.3182
        },
        {
            "id": "htmo835",
            "score": 1,
            "text": "\"The Electoral College does exactly what it was designed to do' is hardly shocking news.",
            "title_similarity": "0.40207398",
            "sentiment_compound": -0.3415
        },
        {
            "id": "htmovbh",
            "score": 1,
            "text": "Yes, this was the founding father’s design. The US is not a direct democracy, we are a republic.",
            "title_similarity": "0.37145287",
            "sentiment_compound": 0.4019
        },
        {
            "id": "htmpk93",
            "score": 1,
            "text": "It's like people don't understand what the difference between a republic and a democracy are. The republic system is designed to prevent extremist populist politicians from taking over. Democracy has always failed and will lead to tyranny",
            "title_similarity": "0.44821984",
            "sentiment_compound": -0.1779
        },
        {
            "id": "htmpp6c",
            "score": 1,
            "text": "New election system: If republican candidate is losing, republican candidate is declared the winner^(1)  \n(1): With the condition that the candidate be louder and insult everybody opposing them, including but not limited to his opponent, the voters, minorities, immigrants, minorities.",
            "title_similarity": "0.56601244",
            "sentiment_compound": -0.2385
        },
        {
            "id": "htmqp65",
            "score": 1,
            "text": "I’d like to see split electoral votes across the country like they do in Nebraska and Maine. \n\nDoubt we’ll ever see it. I figure the DNC nor GOP would want that.",
            "title_similarity": "0.51264787",
            "sentiment_compound": 0.3134
        },
        {
            "id": "htmqpwf",
            "score": 1,
            "text": "What a dumb article. The entire point of the electoral college is to give a voice to other areas of the county other than a few major cities. Additionally, using the visa cast in the current system as a true popular vote isn't exactly meaningful since we don't conduct popular vote elections. No one ever has in this country. We have no idea what the outcome would be since red voters in blue states start 3 home, as so blue voters in red states. The majority of the citizens in this country don't even live in swing states. The current popular vote tally is absolutely meaningless.",
            "title_similarity": "0.6436192",
            "sentiment_compound": -0.6991
        },
        {
            "id": "htmqv9d",
            "score": 1,
            "text": "We are actually going in the opposite direction. \n\nSome states are trying to enact changes to elections process where they can disregard the votes and just send their own electorates I think you can guess which states are doing this",
            "title_similarity": "0.49147832",
            "sentiment_compound": -0.2732
        },
        {
            "id": "htmraiv",
            "score": 1,
            "text": "From an European standpoint, the American system does not seem like an democratic system at all.\n\nThe \"First-Past-The-Vote\" seems like the worst possible way, of allocating representation.\n\nThe whole principal of having three distinct part of government with Congress, Senate and a President further exacerbates this, and ensures a larger and larger polarization over time.\n\nMoney in politics. Letting companies dictate both legislature and candidates by sheer volume of available Capital.\n\nAnd the last point, which European systems are quite queal, \"Leading by example\"\nWe have laws because of a lack of morality.\n\" it's not illegal therfore it's ok to do so\" will always be the lowest form of argumentation and by escalation leads to a cumbersome legal landscape impossible to navigate by any private person or smaller company, without any benefits to society.",
            "title_similarity": "0.5740005",
            "sentiment_compound": -0.6334
        },
        {
            "id": "htmrpmf",
            "score": 1,
            "text": "One vote should be one vote. Someone voting in Nebraska shouldn't get more say than someone in California.",
            "title_similarity": "0.5518722",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmrraw",
            "score": 1,
            "text": "\"High probability\" must mean under 50% in this context because a random vote in the college would be 50/50 in a close race.\n\nBut considering that the electors are supposed to vote in accordance with the best interest of the country, we may assume that is partly aligned with appeasing the populace - so they shouldn't vote against the plurality in most cases.",
            "title_similarity": "0.6121557",
            "sentiment_compound": 0.917
        },
        {
            "id": "htmrsbh",
            "score": 1,
            "text": "I don’t understand how the electoral college doesn’t violate the due process under the 14th amendment since all votes are not equal. The only votes that matter of those from like 5 swing states. You are essentially disenfranchising voters in 45 states",
            "title_similarity": "0.66228616",
            "sentiment_compound": -0.1531
        },
        {
            "id": "htmrv8c",
            "score": 1,
            "text": "There is a good YouTube video explaining the quirks with both the Hamilton and the Jackson system which causes these mathematical errors based on representation changes. Wish I could find the link.",
            "title_similarity": "0.4242785",
            "sentiment_compound": 0.4939
        },
        {
            "id": "htms1rv",
            "score": 2,
            "text": "I don't understand why all the electoral votes of a state go to a single party. Why wouldn't it be proportionate to the number of reps?",
            "title_similarity": "0.58015996",
            "sentiment_compound": 0.4588
        },
        {
            "id": "htmsxp7",
            "score": 1,
            "text": "Replace winner take all voting with ranked choice voting, and use multi winner RCV for congress and other multi seat elections",
            "title_similarity": "0.5338866",
            "sentiment_compound": 0.8225
        },
        {
            "id": "htmtahb",
            "score": 1,
            "text": "Abolish the Senate (Ralph Nader)",
            "title_similarity": "0.22915782",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmtfr7",
            "score": 1,
            "text": "The difference in votes is like ~1% and thats mostly made up of Los Angeles county and NYC. Its not earth shattering that the person that wins more counties in a tight margin can win the election.",
            "title_similarity": "0.71498525",
            "sentiment_compound": 0.875
        },
        {
            "id": "htmtm5s",
            "score": 1,
            "text": "Three times.  The 2000 election was never properly finished and we still don't know who actually won because the Republicans on the Supreme Court awarded it to Bush with no justification at all.",
            "title_similarity": "0.6080166",
            "sentiment_compound": 0.8316
        },
        {
            "id": "htmtq58",
            "score": 1,
            "text": "That is 4 times too many.",
            "title_similarity": "0.4610374",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmtrdl",
            "score": 1,
            "text": "This two party system is killing .. Coke and diet coke",
            "title_similarity": "0.31186742",
            "sentiment_compound": -0.4019
        },
        {
            "id": "htmtxgk",
            "score": 1,
            "text": "Was the U.S. election system ever intended to be a popular vote system at the Presidential level?",
            "title_similarity": "0.5577998",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htmu3v4",
            "score": 1,
            "text": "As a Utah Democrat, I know my vote for president doesn't count.",
            "title_similarity": "0.55781496",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmujz9",
            "score": 1,
            "text": "Don’t mistake plurality and majority. In all of these cases, nobody won a majority of popular vote. It still would have resulted in some sort of runoff. \n\nIn parliamentary systems, this happens all the time. It results in all sorts of deal making and you never know who will be running the government in the end.",
            "title_similarity": "0.69758415",
            "sentiment_compound": 0.6249
        },
        {
            "id": "htmulhg",
            "score": 1,
            "text": "Only Americans define it a democracy, while it is pretty much nothing like a democracy.",
            "title_similarity": "0.51074326",
            "sentiment_compound": 0.2709
        },
        {
            "id": "htmupbw",
            "score": 1,
            "text": "Clearly we need to do away with the electoral college, as well as institute ranked choice voting.",
            "title_similarity": "0.34998116",
            "sentiment_compound": 0.5859
        },
        {
            "id": "htmuxii",
            "score": 1,
            "text": "This is only going to happen more and more. With mass communication where it’s at and candidates having access to so much data, they know exactly what to say to get the most votes, whether they mean it or not. I doubt we’ll ever have a landslide election again.",
            "title_similarity": "0.5939864",
            "sentiment_compound": 0.2755
        },
        {
            "id": "htmv25y",
            "score": 1,
            "text": "So what you're saying is Republicans statistically can't win without cheating.",
            "title_similarity": "0.55440533",
            "sentiment_compound": -0.67
        },
        {
            "id": "htmv8e6",
            "score": 1,
            "text": "They broke the electoral college by allowing \"winner-take-all\" rules at the state level instead of distributing the electorate by percentage.",
            "title_similarity": "0.54390097",
            "sentiment_compound": -0.4215
        },
        {
            "id": "htmv8nh",
            "score": 1,
            "text": "The last Republican to win the popular vote was George Bush in 2004.",
            "title_similarity": "0.618518",
            "sentiment_compound": 0.765
        },
        {
            "id": "htmvvly",
            "score": 1,
            "text": "Deciding the election by popular vote only makes sense if 100% of voters vote. Then everyone's votes are heard equally. Since everyone does not vote, the electoral college is in place to cover for those that don't. The idea is that districts of people tend to vote similarly, so if you don't vote, your neighbor's votes tend to match your own. So your vote is still represented by the whole district. Then votes are weighted to control for population distribution. This made a lot more sense before cars, let alone internet, became commonplace, making it much easier for more eligible voters to actually vote.",
            "title_similarity": "0.6649474",
            "sentiment_compound": 0.5574
        },
        {
            "id": "htmw8d2",
            "score": 1,
            "text": "Ironically Hilary losing the election was actually not bad since she was corrupt POS.",
            "title_similarity": "0.5277791",
            "sentiment_compound": 0.0644
        },
        {
            "id": "htmwdsv",
            "score": 1,
            "text": "A president being able to win without the popular vote is specifically by design. It's a feature not a bug. If Germany had the same system Hitler would have had a much harder time gaining power.",
            "title_similarity": "0.62774783",
            "sentiment_compound": 0.6449
        },
        {
            "id": "htmwed8",
            "score": 1,
            "text": "Make 2 different votes then. \n\n1 for the presidential candidates \n1 for whomever is running for state.",
            "title_similarity": "0.5729481",
            "sentiment_compound": 0.0
        },
        {
            "id": "htmwu1e",
            "score": 1,
            "text": "Clearly we need to do away with the electoral college, as well as institute ranked choice voting.",
            "title_similarity": "0.34998116",
            "sentiment_compound": 0.5859
        },
        {
            "id": "htmwyso",
            "score": 1,
            "text": "Can we fix gerrymandering as well? Cutting districts equally has been mathematically solved since the 70's yet no party has pushed for a fix to this district manipulation that decreases our voting power regardless of party.",
            "title_similarity": "0.67702013",
            "sentiment_compound": 0.2363
        },
        {
            "id": "htmx67s",
            "score": 1,
            "text": "Trudeau lost the popular vote in the past 2 elections, yet he is still our Prime Minister. I don't like him, but that is how the system works",
            "title_similarity": "0.71253383",
            "sentiment_compound": -0.0785
        },
        {
            "id": "htmxtsk",
            "score": 1,
            "text": "The electoral college was designed to address the specific problem that the main political fault line in the US was geographic- north vs south. Politics were much more regionalized back then compared to today. 250 years and a civil war later, the political landscape has changed. The chief divide now is urban vs rural, which is a divide that the electoral college is poorly suited to address. Today, we have a system that leads to inverse results on close elections, and discounts the preferences of wide swathes of voters on both sides. The EC was not a bad system by design, but the demographic challenges we have today are different than what was faced in the nation's early days.",
            "title_similarity": "0.69041824",
            "sentiment_compound": -0.4166
        },
        {
            "id": "htmycnw",
            "score": 1,
            "text": "There is one hard solution -- abolish the Electoral College altogether. This is very unlikely as you'd need a Constitutional amendment or convention. Neither is likely.\n\nThere is one easier solution -- remove the capacity limit on House size put in place by the House Apportionment Act of 1929. This would just be a normal law change, not requiring all the steps of a Constitutional change. We are in no way the same country as then in many ways. The House is supposed to reflect the populated areas more heavily. With the cap in place, it allows the less populated areas to have more influence than should in the House.\n\nIf the House size was increased, the Electoral College numbers automatically go up, and the results would likely more closely match popular vote totals.",
            "title_similarity": "0.60462373",
            "sentiment_compound": 0.8387
        },
        {
            "id": "htmyunj",
            "score": 2,
            "text": "Would it be unfair to remove the electoral college because there's more blue than red and undecided? The undecided are the ones that flip the votes the most",
            "title_similarity": "0.5935601",
            "sentiment_compound": -0.7096
        },
        {
            "id": "htmz5vg",
            "score": 1,
            "text": "Simply put there's nothing democratic or fair about the electoral college.\n\nWe have a similar system in Canada and it's result is that the more populated eastern side of the country is constantly passing laws that are detrimental to Western and rural Canada and even if every single person voted against, a minority of eastern votes over rules them",
            "title_similarity": "0.6262683",
            "sentiment_compound": -0.2411
        },
        {
            "id": "htmz62p",
            "score": 1,
            "text": "I can just hear foreign nations laughing at us.",
            "title_similarity": "0.21272126",
            "sentiment_compound": 0.4939
        },
        {
            "id": "htmzarv",
            "score": 1,
            "text": "Probably makes sense. If there’s a trend of migration from rural to urban areas, then rural areas will likely be over represented. \n\nCombine that with any correlation between urban/rural divide and party affiliation; and it’s easy to see how the “rural” candidate could get elected with a minority.",
            "title_similarity": "0.5343938",
            "sentiment_compound": 0.6808
        },
        {
            "id": "htmztv9",
            "score": 1,
            "text": "I want.to see the Democrats finally flip Texas in a presidential election, just so we can see every single conservative in the United States instantly change their entire opinion about the Electoral College, while acting like they have been opposed to this institution of communist tyranny since day one.",
            "title_similarity": "0.56759536",
            "sentiment_compound": 0.6486
        },
        {
            "id": "htn00gr",
            "score": 1,
            "text": "Tag should not be economics, it's political science work in an economics journal.",
            "title_similarity": "0.36844286",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn0473",
            "score": 1,
            "text": "You guys do realize that abolishing the electoral college would cause a total shift in both Democrats and Republicans platforms. Right? Republicans would actually campaign in California and Democrats in all the \"flyover states\" I don't think you would like the outcome.",
            "title_similarity": "0.5225847",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htn0bg5",
            "score": 1,
            "text": "We would have never had a country to begin with had it not been for the compromise that created the Electoral College and the US Senate.\n\nWithout these two things, over half of the states presently in the union would immediately leave.",
            "title_similarity": "0.6888046",
            "sentiment_compound": 0.2023
        },
        {
            "id": "htn0s5i",
            "score": 1,
            "text": "Well we can't have popular vote, we know that doesn't work. We can't have electoral college because that doesn't work either.",
            "title_similarity": "0.34880722",
            "sentiment_compound": -0.0598
        },
        {
            "id": "htn0svq",
            "score": 1,
            "text": "Electoral college is the best democratic approach to elections. The organization in districts doesn't allow demographic-based votes with different realities than less populated areas impose their beliefs on people who might be affected negatively by this majority. In other words, although democratic fascism is still possible but the chances of it happening are incredibly weakened. \n\nWe used to have an electoral college in Argentina but it was dissoluted in 2003 by a fascist nationalist party so they could win easily in the most populated territories regardless of what the rest of the country voted, and here they are, still in power.",
            "title_similarity": "0.6514493",
            "sentiment_compound": 0.7687
        },
        {
            "id": "htn1as2",
            "score": 1,
            "text": "Is it surprising that the two worst Presidents in the last 100 years were chosen this way?",
            "title_similarity": "0.6667003",
            "sentiment_compound": -0.4588
        },
        {
            "id": "htn1dsc",
            "score": 1,
            "text": "But the popular vote was never meant to be the deciding factor..",
            "title_similarity": "0.40284923",
            "sentiment_compound": 0.5719
        },
        {
            "id": "htn1ruj",
            "score": 1,
            "text": "No. The electoral system is much better. Going to a popular vote only would be an obvious step back. Would reduce elections down to what major cities in just a handful of locations get to determine what the entire country has to endure rather than an equal proportion geographically would decide.",
            "title_similarity": "0.6105988",
            "sentiment_compound": 0.6908
        },
        {
            "id": "htn1wof",
            "score": 1,
            "text": "While it is nice to have the popular vote, it isn't the goal post. Now a days you just need Texas, California and New York and you can win the popular vote. Doesn't mean you should run the country if the other 48 states vote against you.",
            "title_similarity": "0.64242494",
            "sentiment_compound": 0.9042
        },
        {
            "id": "htn25rl",
            "score": 1,
            "text": "Only happened 4 or 5 times\n\nHigh probability \n\nPick one",
            "title_similarity": "0.6112065",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn2buj",
            "score": 1,
            "text": "Maybe put a better candidate on stage instead of 2 jabronies that nobody really likes?",
            "title_similarity": "0.42663336",
            "sentiment_compound": 0.7178
        },
        {
            "id": "htn2tbi",
            "score": 1,
            "text": "The USA and \"representative democracy\" are a joke. The Electoral College is racist, classist, and obsolete. Need money and corporations out of politics, and need Direct Democracy, where every vote actually matters.",
            "title_similarity": "0.52189225",
            "sentiment_compound": -0.5994
        },
        {
            "id": "htn31ta",
            "score": 1,
            "text": "The founders of this country knew this could happen and it’s a byproduct of federalism. None of the states would have unified against Britain if power was held at only the national level and not shared at the state level.  Popular vote strips powers from states.  it’s not a bug in the system it’s a feature.",
            "title_similarity": "0.5827314",
            "sentiment_compound": 0.521
        },
        {
            "id": "htn3glr",
            "score": 1,
            "text": "I mean it would seem to me from a reasonable perspective we should ditch the electoral college. It's clearly not working as intended and having unforeseen side effects.",
            "title_similarity": "0.3355238",
            "sentiment_compound": 0.4019
        },
        {
            "id": "htn44x2",
            "score": 1,
            "text": "Who knows: How do we convince people that a political discussion is about science?\n\nThis sub: Add the words probability and study. 60% of the time it works every time.",
            "title_similarity": "0.64095473",
            "sentiment_compound": 0.25
        },
        {
            "id": "htn47yy",
            "score": 1,
            "text": "Sometimes I just wonder how the US has functioned as a democracy for like 200 years with the electoral college.\n\nIt just makes no sense to me.",
            "title_similarity": "0.6402121",
            "sentiment_compound": 0.0772
        },
        {
            "id": "htn4goz",
            "score": 1,
            "text": "I look forward to the reform, should be the easiest thing in the world to have happen right?",
            "title_similarity": "0.29603404",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htn5bex",
            "score": 1,
            "text": "Why is there politics in r/science? I know that it says “social science and more” in the sub description but frankly it just does not fit here.\n\nSooo many political subs out there, why post this here?",
            "title_similarity": "0.48591977",
            "sentiment_compound": -0.4633
        },
        {
            "id": "htn5czr",
            "score": 1,
            "text": "Honestly, that’s 4 times too many. What a joke.",
            "title_similarity": "0.48403776",
            "sentiment_compound": 0.6369
        },
        {
            "id": "htn5pca",
            "score": 1,
            "text": "But we’ll never know if an election based on the Popular Vote instead of the Electoral College would have resulted in Hillary beating Trump or not.",
            "title_similarity": "0.64717007",
            "sentiment_compound": -0.0772
        },
        {
            "id": "htn5r3i",
            "score": 1,
            "text": "So the pumpkin v.s old spice was fun anyway.",
            "title_similarity": "0.2895835",
            "sentiment_compound": 0.5106
        },
        {
            "id": "htn5vqs",
            "score": 1,
            "text": "Why is this post flaired for economics? This is clearly either politics or political science.",
            "title_similarity": "0.4180717",
            "sentiment_compound": 0.4019
        },
        {
            "id": "htn6bi4",
            "score": 1,
            "text": "Getting ahead of people here, removing the electoral college requires a constitutional amendment.",
            "title_similarity": "0.4764533",
            "sentiment_compound": 0.0
        },
        {
            "id": "htn7di1",
            "score": 1,
            "text": "Feature not a bug.\n\nThe right thinks that actual democracy is a barrier to true liberty. Or at least that is how they quietly justify it in their selfish noggins.",
            "title_similarity": "0.37774652",
            "sentiment_compound": 0.3818
        },
        {
            "id": "htn7vpl",
            "score": 1,
            "text": "My Social Studies teacher laughed off me bringing this \"feature\" up. \"It's really unlikely to happen.\" Who's laughing now Mr Stevens?!",
            "title_similarity": "0.38893554",
            "sentiment_compound": 0.7574
        },
        {
            "id": "htn8r4x",
            "score": 1,
            "text": "Simple partial fix.  Repeal the apportionment act and expand the house to 700-750 member.\n\nAll these so-called constitutionalist republicans need to understand that the reason that rural states are so over-powered is that outside of what the framers intended….we capped the house",
            "title_similarity": "0.6378975",
            "sentiment_compound": 0.3182
        },
        {
            "id": "htn9oed",
            "score": 1,
            "text": "This entire country needs a overhaul.",
            "title_similarity": "0.21926886",
            "sentiment_compound": 0.0
        },
        {
            "id": "htncbf3",
            "score": 1,
            "text": "This is 100% by known design as they wanted low population States to be weighted more. It is why Senators are locked in at 2 per state regardless of population.\n\nThis was a know possible side effect of the electoral college and it was designed this way. It's not a fluke or an oversight. You can disagree with it, but people calling for election reform somehow use this as an oversight and flaw of the system when in actuality it's working as intended. If they wanted a popular vote only then they would have never created the electoral college.",
            "title_similarity": "0.6880083",
            "sentiment_compound": 0.0618
        },
        {
            "id": "htnd0t7",
            "score": 1,
            "text": "The whole system's fucked and nothing's going to change until the united states finially falls from its sheer incompetence. Whether that fall is a biproduct of some kind of revolt, an economic dissolution, or just a slow meandering towards an unreliable government thats sole goal is absolute power over societal welfare it doesn't really matter. Its just hard to say the country we live in now is the one its meant to be.",
            "title_similarity": "0.50423104",
            "sentiment_compound": -0.7643
        },
        {
            "id": "htndjbi",
            "score": 1,
            "text": "The issue I have with articles like this is two fold:\n\n\n1. They present the presupposition that the \"popular vote\"  as inherently good. \n\n\n2. They don't offer a representative alternative. \n\n\n\n.\n\n\n\nSo in essence this isn't an argument against the electoral college, it's a veiled argument against representative democracy.",
            "title_similarity": "0.49683207",
            "sentiment_compound": 0.7789
        },
        {
            "id": "htne8qj",
            "score": 1,
            "text": "Shocker, the system designed to hinder actual democracy is hindering actual democracy.",
            "title_similarity": "0.36164555",
            "sentiment_compound": -0.1531
        },
        {
            "id": "htneoec",
            "score": 1,
            "text": "I don’t see republicans ever winning a popular vote in a presidency ever again. They will have to rely on their gerrymandering and voter suppression for electoral wins.",
            "title_similarity": "0.64853084",
            "sentiment_compound": 0.872
        },
        {
            "id": "htnezyi",
            "score": 1,
            "text": "\"Only 4 times\"  as if that's not a lot",
            "title_similarity": "0.51694226",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnfiye",
            "score": 1,
            "text": "That’s why Oikawa calls him that.",
            "title_similarity": "0.036806434",
            "sentiment_compound": 0.0
        },
        {
            "id": "htngagb",
            "score": 1,
            "text": "One time I ran the numbers on the 2016 presidential election and found that if you won the 11 most populous states by a +1 margin and got 0 votes in any of the other states you would win the election even though you lost the popular vote by about 30 million to 100 million. \n\nSomeone then pointed out to me that my thinking was on the right track, but the least populous states had a higher vote to EC vote ratio, so if you won the least populous states instead you could win the EC even though the pop vote would be 25 million to 105 million.  \n\nIts a completely impossible outlier scenario, but it shows just how badly the EC is set up.",
            "title_similarity": "0.7794726",
            "sentiment_compound": 0.9099
        },
        {
            "id": "htnghsx",
            "score": 1,
            "text": "Minority rule doesn't need to exist any longer.\n\nGone are the days where news took months or years to travel, and you could live your entire life in a 10 mile radius without knowing anything about the rest of the country.  Now everyone knows everything instantly, and people move across the entire country easily and many times during their life.\n\nAll these antiquated rules are allowing a minority to obstruct the majority from moving us forward.",
            "title_similarity": "0.5556027",
            "sentiment_compound": 0.34
        },
        {
            "id": "htngwvr",
            "score": 1,
            "text": "fewer than other elections, fewer than the opponent, or fewer in relation to a population?",
            "title_similarity": "0.52061105",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnhwhs",
            "score": 1,
            "text": "NPVIC or amendment the constitution!",
            "title_similarity": "0.19527078",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnino3",
            "score": 1,
            "text": "The brilliance of our founders is evident.",
            "title_similarity": "0.12079471",
            "sentiment_compound": 0.5994
        },
        {
            "id": "htniq5n",
            "score": 1,
            "text": "The Electoral College was invented to protect the minority.  This was an expected outcome.",
            "title_similarity": "0.34647787",
            "sentiment_compound": 0.3818
        },
        {
            "id": "htniyhq",
            "score": 1,
            "text": "And the way things are going, majority voters will never win again unless voting rights are handled federally.",
            "title_similarity": "0.5479164",
            "sentiment_compound": -0.4717
        },
        {
            "id": "htniyhy",
            "score": 4,
            "text": "As a Finn, I must remind you that we had an Electoral College, and we abolished it for the 1994 Presidential election. It wasn't a good idea in the first place, but Finland in the 1920's wasn't the most stable country around. \n\nBUT: we never had anyone win with a minority of votes. \n\nAGAINST: Kekkonen, Kekkonen, Kekkonen, Kekkonen, Kekkonen.",
            "title_similarity": "0.6628869",
            "sentiment_compound": -0.816
        },
        {
            "id": "htnjoyd",
            "score": 1,
            "text": "90% of the time, it works everytime!",
            "title_similarity": "0.37210637",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnjzbk",
            "score": 1,
            "text": "I don’t propose to know what the right solution is, but there is an inherent problem in the first place with any system that assigns one person to represent the interests of over 300 million when virtually half of those people want the other candidate and believe in very opposed views. And I think that is valid whether the winner has a slight majority of the vote, or slightly less.\n\nI can at least accept it if the person being elected has one vote out of many in Congress, where are the interests of all the people of the country are proportionally represented.\n\nBut when the vote is for president and comes down to a single person that generally will not advocate or express the views of the ~150 million constituents that didn’t vote for them, it seems like a problem.\n\nI fully understand checks and balances, but that doesn’t really explain why one of the checks is someone with full veto power that only represents the interest of half the people.",
            "title_similarity": "0.75927293",
            "sentiment_compound": 0.9418
        },
        {
            "id": "htnlt7h",
            "score": 1,
            "text": "I just love how the 40% of the country gets to dictate what happens to the other 60%.  As Bobo the Stupid Congresswoman Clown would say, \"One person, one vote\".",
            "title_similarity": "0.5582197",
            "sentiment_compound": 0.2023
        },
        {
            "id": "htnluzx",
            "score": 1,
            "text": "And which political party consistently benefits from this “fluke”?",
            "title_similarity": "0.45828992",
            "sentiment_compound": 0.6486
        },
        {
            "id": "htnm633",
            "score": 1,
            "text": "Because who doesn’t want every presidential election to be decided by the 5 or 6 most-populated states, amirite? Forget all those fly-over states. Shouldn’t have to pander to the likes of them.",
            "title_similarity": "0.60553676",
            "sentiment_compound": 0.296
        },
        {
            "id": "htnmrvd",
            "score": 1,
            "text": "Removing the electoral college would nudge the entire country a little left. Right now rural states hold disproportionately large power over general elections.",
            "title_similarity": "0.5750052",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnmz4i",
            "score": 1,
            "text": "And thank God because do we really want California residents having any more influence than they already do? \n\nAsk the sensible people that are fleeing there what they think.",
            "title_similarity": "0.3974284",
            "sentiment_compound": 0.6361
        },
        {
            "id": "htnn140",
            "score": 1,
            "text": "Both of the last two republican presidents LOST the popular vote.  This is important context about why this will never be addressed until after the revolution.",
            "title_similarity": "0.69695175",
            "sentiment_compound": 0.1449
        },
        {
            "id": "htnnd88",
            "score": 1,
            "text": "Our government? Flawed? No way!",
            "title_similarity": "0.2815051",
            "sentiment_compound": -0.7142
        },
        {
            "id": "htnnvky",
            "score": 1,
            "text": "But did you really want Al Gore or Hillary to be president..?",
            "title_similarity": "0.4943319",
            "sentiment_compound": 0.2238
        },
        {
            "id": "htnnyua",
            "score": 1,
            "text": "This is by design. Read the Federalist papers. It's how we are able to keep a Republic.",
            "title_similarity": "0.30665517",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnobp2",
            "score": 1,
            "text": "There is an easy fix.  We need to reduce the number of people per House Member (increase the size of the House).  Currently it averages 700,000, which is way too high.  The House should be at least 1,000 people.  This would change the Electoral college as well.",
            "title_similarity": "0.64819974",
            "sentiment_compound": 0.765
        },
        {
            "id": "htnoqwf",
            "score": 1,
            "text": "And republicans everywhere just went, “uhhh yeah we know.”",
            "title_similarity": "0.2616412",
            "sentiment_compound": 0.296
        },
        {
            "id": "htnoy01",
            "score": 1,
            "text": "As the urban rural divide keeps growing this is just going to keep happening. And if politicians keep gaining power without the will of the people and instead benefit from an old system that gives more voting power to spread out land the system is going to tear apart.\n\nCollapse and deteriotion of governance and institutions and norms, calls for secession, massive civil unrest and failure of basic governance. Something's gotta change.",
            "title_similarity": "0.47527978",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnptva",
            "score": 1,
            "text": "It's almost as if it's not accidental.",
            "title_similarity": "0.10353488",
            "sentiment_compound": 0.0572
        },
        {
            "id": "htns4um",
            "score": 1,
            "text": "Democracy without demos",
            "title_similarity": "0.27423972",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnse5l",
            "score": 1,
            "text": "Just a way now for the GOP to jerry mander the whole country",
            "title_similarity": "0.2740091",
            "sentiment_compound": 0.0
        },
        {
            "id": "htnsh8l",
            "score": 1,
            "text": "Pretty much the only way Republicans can win these days.",
            "title_similarity": "0.62889796",
            "sentiment_compound": 0.7906
        },
        {
            "id": "htnsvks",
            "score": 1,
            "text": "The 2024 GOP candidate is almost guaranteed to lose the popular vote.",
            "title_similarity": "0.6364149",
            "sentiment_compound": 0.0935
        },
        {
            "id": "htntvp2",
            "score": 1,
            "text": "Doesn't sound like a sustainable business model. How can a business stay open if more than half the people won't shop there.",
            "title_similarity": "0.54192257",
            "sentiment_compound": -0.2755
        },
        {
            "id": "htnu0bx",
            "score": 1,
            "text": "it also causes candidates to only worry about 270ec and not the entire country. Both sides put their guaranteed states in their back pockets and do the math to 270 and really only campaign in those middle states needed to put them over the top.\n\nThe EC was a very foolish idea but i forgive the founding fathers for not realizing how it skews powers between the states and would eventually head into a wall due to the fact our founders were drunk most of the time.",
            "title_similarity": "0.6466886",
            "sentiment_compound": -0.4012
        },
        {
            "id": "htnumpp",
            "score": 1,
            "text": "Your right.... But it was actually rigged... This is a poor attempt to cover that...",
            "title_similarity": "0.20213687",
            "sentiment_compound": -0.8126
        },
        {
            "id": "htnun8g",
            "score": 1,
            "text": "This sub should be called political_science or something. Even if I do see anything here that is remotely science related, it's always also politically motivated. When I subbed I was under the impression that there would actually be scientific content, but it appears to be more of a political echo chamber.",
            "title_similarity": "0.57653046",
            "sentiment_compound": 0.3506
        },
        {
            "id": "htnwae5",
            "score": 1,
            "text": "Literally the goal of the electoral college. Balances regions against population. Goal served. No problem here.",
            "title_similarity": "0.3900636",
            "sentiment_compound": 0.3089
        },
        {
            "id": "htnwmzd",
            "score": 1,
            "text": "Well, it certainly wouldn't have a high probability in elections which are not close!",
            "title_similarity": "0.36805502",
            "sentiment_compound": 0.5848
        },
        {
            "id": "htnwq91",
            "score": 2,
            "text": "“One of the saddest lessons of history is this: If we've been bamboozled long enough, we tend to reject any evidence of the bamboozle. We're no longer interested in finding out the truth. The bamboozle has captured us. It's simply too painful to acknowledge, even to ourselves, that we've been taken.  Carl Sagan.",
            "title_similarity": "0.44556847",
            "sentiment_compound": -0.9535
        },
        {
            "id": "htnwt9i",
            "score": 1,
            "text": "Which is exactly why the system should be reformed. It should be incredibly rare that the popular vote loser be elected to office.",
            "title_similarity": "0.5824389",
            "sentiment_compound": -0.1531
        },
        {
            "id": "htnx9t6",
            "score": 4,
            "text": "This is strange, I just posted some of my work over on Poly-Sci, but I was interested in something along these lines.\n\nI've always been a little curious about the Electoral College and its impact on our elections. And more specifically, I've really been interested in apportionment and how the changes over the years have impacted that.\n\nA quick statement of my knowledge on this. The electors are based on the number of senators (always 2) + the number of representatives in the House, which since 1912 has been set to 435. Originally, the representatives were supposed to be apportioned out to be roughly 1 rep per 30k people in a state (the first veto in US history was George Washington vetoing a bill that would allow states to exceed that), but we've gotten way past that where we are at roughly 1 rep per 710k people now. There have been a number of proposed ways to remedy what some see as a gap in representation, things like the Wyoming rule (give the least populous state 1 rep, then base other reps based off that population), the cube root rule, and others. I wanted to see what some impact there would be if we adopted either the original 1/30k rep or the Wyoming rule.\n\nSo I got the 2010 census data, and applied the rules to that and got this:\n\nCurrent electors: 538 30k rule: 10420 Wyoming Rule: 677\n\nIt's not surprising that the Wyoming rule is pretty close to our current count, the current method of apportionment (Huntington-Hill) method tries to keep the percentages pretty close. I can't even imagine the disfunction (let alone the budget, salary for all the house members alone would be $1.8 billion) for the 30k rule.\n\nOnce I had that, I applied it to the last 2 elections and found something that I think is intersting. First the results:\n\n**With current electors:**\n\n***2020 Election***\n\nBiden 306.0 electors\n\nTrump 232.0 electors\n\nWith Biden getting 56.877323420074354% of the electors\n\n***2016 Election***\n\nHillary 232.0 electors\n\nTrump 306.0 electors\n\nWith Trump getting 56.877323420074354% of the electors\n\n**With Constitutional electors aka No less than 1 rep per 30k + 2**\n\n***2020 Election***\n\nBiden 6044 electors\n\nTrump 4376 electors\n\nWith Biden getting 58.00383877159309% of the electors\n\n***2016 Election***\n\nHillary 4540.25 electors\n\nTrump 5879.75 electors\n\nWith Trump getting 56.427543186180415% of the electors\n\n**With the Wyoming Rule + 2**\n\n***2020 Election***\n\nBiden 384 electors\n\nTrump 293 electors\n\nWith Biden getting 56.72082717872969% of the electors\n\n***2016 Election***\n\nHillary 290.75 electors\n\nTrump 386.25 electors\n\nWith Trump getting 57.05317577548006% of the electors\n\nI think this was a good example because the results of both elections electorally were exactly the same, so we could see how the distribution of those electors would have changed.\n\nFirst, moving to the 30k rule still wouldn't mirror or fix the popular vs electoral counts. And second, moving to the 30k would have expanded Biden's win by ~1.2%, but moving to the Wyoming Rule would have reduced his margin by ~.1%.\n\nThis leads me to the following conclusions, and please tell me if I'm wrong in them:\n\n1) The smaller states (and demonstrated by the past few popular votes, minority political party) have more electoral power than their numbers indicate. This could be as some believe by design so a majority can't simply take over, but reading what Madison wrote, it could be a demonstration that the system is breaking down. Namely \"a number of citizens whether amounting to a majority or minority of the whole, who are united and actuated by some common impulse of passion, or of interest, adverse to the rights of other citizens, or to the permanent and aggregate interests of the community.\" Which I read as it the offending party doesn't have to be the \"majority\" in people, just the \"majority\" in power.\n\n2) Moving to a 30k representation wouldn't change any (well, I may go look at the 2000 GWB election) election.\n\nI have all my work in a short notebook on Kaggle if anyone wants to double check or expand on my work, just let me know.",
            "title_similarity": "0.63920105",
            "sentiment_compound": 0.9945
        },
        {
            "id": "htnxloc",
            "score": 2,
            "text": "Yes. Everyone should have a town meeting where everyone votes using their ss#. To hen babies can't cry",
            "title_similarity": "0.43475166",
            "sentiment_compound": 0.6433
        },
        {
            "id": "hto0zgm",
            "score": 1,
            "text": "Because the loser states are grossly over-represented in the electoral college.",
            "title_similarity": "0.5239659",
            "sentiment_compound": -0.6486
        },
        {
            "id": "hto1dq7",
            "score": 1,
            "text": "I personally think the electoral college and popular vote are both valid ways to elect a president, but I do think the popular vote is an objectively better metric. If you're a Republican living in California or a Democrat living in Mississippi you have absolutely no effect on the presidential election under the electoral college.",
            "title_similarity": "0.67472214",
            "sentiment_compound": 0.736
        },
        {
            "id": "hto1yk1",
            "score": 1,
            "text": "United STATES of America =/= United PEOPLE of America",
            "title_similarity": "0.13933548",
            "sentiment_compound": 0.6808
        },
        {
            "id": "hto460y",
            "score": 1,
            "text": "Is it even technically a democracy if the candidate with the most votes does not win?",
            "title_similarity": "0.6174793",
            "sentiment_compound": -0.4717
        },
        {
            "id": "hto46wg",
            "score": 1,
            "text": "What is new about this study? We’ve known this forever",
            "title_similarity": "0.25990862",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto62pu",
            "score": 1,
            "text": "Expect the number to increase thanks to the Electoral College and 435 House seats limit. This is why in the Electoral College, a voter in Wyoming carries 6 times the weight of a voter in California!",
            "title_similarity": "0.60926294",
            "sentiment_compound": 0.6996
        },
        {
            "id": "hto6jyy",
            "score": 1,
            "text": "With today's technology, there is no good reason to keep the electoral college",
            "title_similarity": "0.44721413",
            "sentiment_compound": -0.3412
        },
        {
            "id": "hto72by",
            "score": 1,
            "text": "It wasn’t a close race",
            "title_similarity": "0.25282124",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto9gi1",
            "score": 1,
            "text": "How is this related to Science?",
            "title_similarity": "0.17677344",
            "sentiment_compound": 0.0
        },
        {
            "id": "hto9u7d",
            "score": 1,
            "text": "How many were Conservative/ modern day R presidents again?",
            "title_similarity": "0.595799",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoatzw",
            "score": 1,
            "text": "This is why I think it’s hilarious that people actually vote. There’s literally no point because the popular vote doesn’t matter.",
            "title_similarity": "0.38544595",
            "sentiment_compound": 0.5267
        },
        {
            "id": "htoau2m",
            "score": 1,
            "text": "“Peculiar outcome??” What is so peculiar about an electoral system that isn’t the popular vote having different results than the popular vote?",
            "title_similarity": "0.530317",
            "sentiment_compound": 0.8051
        },
        {
            "id": "htobczj",
            "score": 1,
            "text": "Fun fact, the presidential election was never intended, or designed, to be decided by popular vote. This post is just disinformation. \n\n>every time a president wins an election without the popular vote someone had a heart attack in America!",
            "title_similarity": "0.6068374",
            "sentiment_compound": 0.8708
        },
        {
            "id": "htoblb3",
            "score": 1,
            "text": "Republicans will never agree, because they can only retain power by gerrymandering and the electoral college....in other words usurping the will of the actual electorate",
            "title_similarity": "0.501649",
            "sentiment_compound": -0.2755
        },
        {
            "id": "htobtx9",
            "score": 1,
            "text": "In The Netherlands the party with the most voyes wins, seems logical",
            "title_similarity": "0.4222401",
            "sentiment_compound": 0.7703
        },
        {
            "id": "htoc01k",
            "score": 1,
            "text": "It’s a feature, not a bug",
            "title_similarity": "0.06407517",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoccii",
            "score": 1,
            "text": "My point is, if youre a necrophiliac",
            "title_similarity": "0.18017057",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoe0vo",
            "score": 1,
            "text": "A fluke is the most common fish in the sea",
            "title_similarity": "0.40275908",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoe1yh",
            "score": 1,
            "text": "With the advancements in technology, explain why we NEED the electoral college?",
            "title_similarity": "0.38336512",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoe2tf",
            "score": 1,
            "text": "Why are people still “studying” this. You think more data is going to solve this? I wish I could have a job where I just study things that have been understood for years and years and years. That would be sweet.",
            "title_similarity": "0.5050749",
            "sentiment_compound": 0.7579
        },
        {
            "id": "htof077",
            "score": 1,
            "text": "Unclear how this topic is Economics. \n\nSeems more like politics than science.",
            "title_similarity": "0.44547454",
            "sentiment_compound": 0.2006
        },
        {
            "id": "htofmpo",
            "score": 1,
            "text": "There is no problem here.\nThis is a feature not a bug.",
            "title_similarity": "0.07457331",
            "sentiment_compound": 0.3089
        },
        {
            "id": "htofu9y",
            "score": 1,
            "text": "All reforms are a waste of time. Freedom is a carrot on a string until humanity truly understands and applies the  precepts of anarchy, the philosophy of self-governance without any form of government. The world wants you to believe that that it is violence and chaos.  Chaos is what we live in now,. Long before these systems of control and enslavement, humans lived free. Not until the creation of government when one group of people falsely believed that  better than everyone else and has the right to tell them how to live and in prison or fine or tax them until we realize this system is what's causing all these problems until that moment we will never be free. Reforms do nothing but continue this lie and enslavement. It is time to be without these wicked, psychopathic governments and the people who are part of them. Freedom will appear when all humanity peacefully just say no to government.",
            "title_similarity": "0.43285137",
            "sentiment_compound": 0.8362
        },
        {
            "id": "htogexb",
            "score": 1,
            "text": "Same thing happened the last 2 elections in Canada.\n\nTrudeau (liberal/democrat) lost the election by a very large margin twice, but still won the election over what should have been the winner (the conservative/republican candidate).",
            "title_similarity": "0.76940775",
            "sentiment_compound": 0.891
        },
        {
            "id": "htogis0",
            "score": 1,
            "text": "Wow, OMG!  This completely blew my min…\n\nI can’t finish the joke, it’s not a joke.\n\nThe US is already on a one way flight to idiocracy…and lucky us (US), we are bumped to first class.",
            "title_similarity": "0.49705857",
            "sentiment_compound": 0.8022
        },
        {
            "id": "htogv3j",
            "score": 1,
            "text": "Bruh. When the oscillating saw is being used",
            "title_similarity": "0.10250937",
            "sentiment_compound": 0.0
        },
        {
            "id": "htoh34f",
            "score": 1,
            "text": "Still seems rare, like Mr. Clean with hair.",
            "title_similarity": "0.29701832",
            "sentiment_compound": 0.6369
        },
        {
            "id": "htohajj",
            "score": 1,
            "text": "My question is this:\nIf you were to uncap the House of Representatives, than the amount of representatives would reflect the population and by direct effect the amount of electors would too. The amount of electors is literally the amount of congresspersons.\n\nSo would going back to an uncapped House skew the EC enough towards the popular vote that direct reforms aren't needed?\n\nCurrently, 100 senators weights significantly to the 435 representatives (that aren't directly representative to begin with), but if you increased the house to something like the 7000 proposed, 100 weights very minorly than. Seems like we can improve the EC and House with 1 stone.",
            "title_similarity": "0.70707583",
            "sentiment_compound": 0.9313
        },
        {
            "id": "htoi5u5",
            "score": 1,
            "text": "Do we want a pure democracy though? Human history is riddled with examples of when the majority is flat out wrong. Herd mentality can be quite dangerous.",
            "title_similarity": "0.5082667",
            "sentiment_compound": -0.7346
        },
        {
            "id": "htoi68f",
            "score": 1,
            "text": "And favors a certain party.",
            "title_similarity": "0.14648278",
            "sentiment_compound": 0.7003
        },
        {
            "id": "htojeqt",
            "score": 1,
            "text": "Wasn't the constitution originally intended to move towards a popular vote? The constitution says 1 representative per 30000 people. The electoral college would be around 10,000 allocated by population plus 100 for 2 per state.",
            "title_similarity": "0.6573769",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htojx9d",
            "score": 1,
            "text": "I think the bigger issue is the fact that a select few powerful people can bribe the democracy. Sorta making it not a democracy. Rather then a few votes being not represented properly",
            "title_similarity": "0.61294204",
            "sentiment_compound": 0.25
        },
        {
            "id": "htoly3p",
            "score": 1,
            "text": "Yeah but the system is sorta designed to do that to stop mob rule (51% telling 49% what to do)",
            "title_similarity": "0.4546414",
            "sentiment_compound": -0.296
        },
        {
            "id": "htom3ug",
            "score": 1,
            "text": "The electoral college and the senate are anti democratic but republicans benefit from both so they're here to stay.",
            "title_similarity": "0.53623784",
            "sentiment_compound": 0.5187
        },
        {
            "id": "hton0tj",
            "score": 1,
            "text": "Because it’s not based on most votes….",
            "title_similarity": "0.402806",
            "sentiment_compound": 0.0
        },
        {
            "id": "htonebr",
            "score": 1,
            "text": "https://www.nationalpopularvote.com is currently the best chance at fixing this in our lifetimes, FYI.",
            "title_similarity": "0.47027802",
            "sentiment_compound": 0.8286
        },
        {
            "id": "htonycu",
            "score": 1,
            "text": "System working at intended. Constitutional republic of states, not a direct democracy. Mob rule is not a preferable option",
            "title_similarity": "0.377763",
            "sentiment_compound": 0.0
        },
        {
            "id": "htookx9",
            "score": 1,
            "text": "> Far from being a fluke, this peculiar outcome of the US Electoral College has a high probability in close races, according to a new study.\n\nIt's far from a fluke because it's by design. They designed it that way so smaller states would carry a little weight. However, we shouldn't be giving real-estate voting rights, it should people, so it should have always been about the popular vote.",
            "title_similarity": "0.6339659",
            "sentiment_compound": 0.3641
        },
        {
            "id": "htoqgi3",
            "score": 1,
            "text": "This is such a waste of time.  Any state can proportionally divide their electors base on their own rules. So c'mon New York and California  - show us the way.  They won't, because it would dilute their impact.  Less populous states joined the Union because their impact was slightly exaggerated.  They will never join this \"whoever wins the popular vote wins\"  compact.   Plus, you thought Trump trying to steal a couple of states was fun?  Wait until every precinct IN THE COUNTRY is fought over.  If any states join this compact, and it is somehow legally binding, the  interstate legal battles would be legendary.  Florida would be suing New York over their vote counts,  California would be suing Alabama, and Texas would be suing/getting sued by everyone.  The only winners of this would be lawyers.  You think all of this would resolve itself between  November and January?   Gladiatorial combat is really the only way to resolve these issues.",
            "title_similarity": "0.5589087",
            "sentiment_compound": 0.8301
        },
        {
            "id": "htoqq51",
            "score": 1,
            "text": "Every single time, it was to help out a Republican.",
            "title_similarity": "0.386526",
            "sentiment_compound": 0.4019
        },
        {
            "id": "htor9zx",
            "score": 1,
            "text": "Anybody else old enough to remember when the savvy take was the the electoral congress would never (again) go against the popular vote, because if they did it would immediately be abolished?",
            "title_similarity": "0.52941656",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htordb2",
            "score": 1,
            "text": "Isn't it the 1929 Reapportionment Act that has caused this scenario to become far more likely to occur? By freezing the number of Representatives, and hence electors/electoral votes, we're now less representative and less democratic, and the situation will only get worse as the population increases.",
            "title_similarity": "0.52277124",
            "sentiment_compound": -0.4939
        },
        {
            "id": "htorzqz",
            "score": 1,
            "text": "There is no way you should lose if you have a larger amount of votes end of story.",
            "title_similarity": "0.49577093",
            "sentiment_compound": -0.5994
        },
        {
            "id": "htosg07",
            "score": 1,
            "text": "Don't know how a system designed to enhance the power of the rural aristocracy could have such a high probability of preventing a democratic outcome. Bad luck, I guess.",
            "title_similarity": "0.52319837",
            "sentiment_compound": -0.1531
        },
        {
            "id": "htosi8f",
            "score": 1,
            "text": "The EC is designed to protect from the tyranny of the majority. It did exactly what it was designed to.",
            "title_similarity": "0.24142565",
            "sentiment_compound": 0.3818
        },
        {
            "id": "htot6ao",
            "score": 1,
            "text": "It happens rarely so let's recreate the entire system? We aren't a democracy\n\nAlso why is this even posted here?",
            "title_similarity": "0.5336747",
            "sentiment_compound": 0.0
        },
        {
            "id": "htov0yg",
            "score": 1,
            "text": "Calls to reform the system?  From idiots who can’t understand the beauty and intellect of the founders.   And the same reformers are the ones against Voter ID,  and for Mail in ballots.  As many ways to manipulate the vote as possible.   They aren’t concerned about voting process they are concerned with winning at all costs so they can gain power forever.",
            "title_similarity": "0.50668216",
            "sentiment_compound": 0.9308
        },
        {
            "id": "htovebr",
            "score": 1,
            "text": "Nobody has ever succeeded in convincing me that abolishing the electoral college is a bad thing.\n\nMajority rules. Minority rights.  That's how democracy works.\n\nYou don't want the large populations in coastal cities deciding elections? Guess what, they don't.  And don't you think rural reou licans in California will be more likely to vote if they don't feel their vote is a waste of time?\n\nNational popular vote enfranchises everyone equally.  Why does a voter in Utah deserve 2-3 times the voting power of a voter in California?\n\nPopular vote gives every vote meaning, whether you're a Democrat in North Dakota or a republican in Hawaii.\n\nIt wouldnt end gerrymandering but it would eliminate it as a way to weaponize the electoral system to control the executive branch.\n\nIf I coukd change a few things to fix democracy the list is actually fairly short.\n\nUndo citizens United. No more superpacs.  Real campaign finance reform with strict monitoring and penalties (e.g disqualification from holding office if found guilty of even moderate violations)\n\nUniversal ranked choice voting\n\nUniversal mail in balloting options in all ststes\n\nMandatory paper trails on electronic voting machines... No digital-only machines that can't be hand audited\n\nNational popular vote for president\n\nTerm limits for congress and senate.  4 consecutive terms in congress and 2 in the senate.  If you are voted out or your limit is hit you have to sit out just as long as you were in before being eligible again.  Or run for a different office.\n\nPay congress more and allow them larger staffs.  This is unpopular but ckngress is paid poorly for the work they do and the travel/residency requirements they have.  They have to travel between DC and their districts constantly and maintain two homes. This ends up meaning only wealthy people can afford to be in congress. Larger staffs would allow them to write legislation internally without the need of lobbyists to do it for them.",
            "title_similarity": "0.6587265",
            "sentiment_compound": -0.4358
        },
        {
            "id": "htovg19",
            "score": 1,
            "text": "Isn’t that the point of the EC, so it’s not always “majority rule”.",
            "title_similarity": "0.4659954",
            "sentiment_compound": 0.0
        },
        {
            "id": "htovg9a",
            "score": 1,
            "text": "Isn’t the definition of a democracy “control by the majority”. How can the US be a democracy if the majority loses?",
            "title_similarity": "0.56040865",
            "sentiment_compound": -0.3182
        },
        {
            "id": "htovvy7",
            "score": 1,
            "text": "Less political science and more biology and engineering please.",
            "title_similarity": "0.37996888",
            "sentiment_compound": 0.3182
        },
        {
            "id": "htowcbe",
            "score": 3,
            "text": "Baseball fans, say there's a 7 game World Series and the team that scored more total runs loses to the team that won the most games.  It is possible that the losing team scored 30 or more runs .vs the winning team scoring just 5.  Would you then say that the Baseball World Series should be decided on the total sum of runs in all 7 games, or should it remain that the team that wins a majority of games is the winner?",
            "title_similarity": "0.5437429",
            "sentiment_compound": 0.8795
        },
        {
            "id": "htowe32",
            "score": 1,
            "text": "I wonder if democrats had been losing the popular vote and winning the presidency instead would it be flipped? Would republicans be raging about changing the system and democrats thinking it's fine?",
            "title_similarity": "0.63803536",
            "sentiment_compound": 0.3313
        },
        {
            "id": "htowges",
            "score": 1,
            "text": "Welcome to America, where everything is made up and the votes don't matter.",
            "title_similarity": "0.2395097",
            "sentiment_compound": 0.4453
        },
        {
            "id": "htowy16",
            "score": 1,
            "text": "We built an electoral college to attempt a stop at Mob Rule. 'Studies' like this are propoganda garbage for anyone who cant remember this simple fact.",
            "title_similarity": "0.47958672",
            "sentiment_compound": 0.0772
        },
        {
            "id": "htox7fh",
            "score": 1,
            "text": "I would  just like to say pass the anti corruption act at the federal level.",
            "title_similarity": "0.38020313",
            "sentiment_compound": 0.0516
        },
        {
            "id": "htoxgv0",
            "score": 1,
            "text": "Of course it's not a fluke. The \"Electoral\" College was a way of appeasing the traitorous southern Democrats after the civil war.",
            "title_similarity": "0.45513096",
            "sentiment_compound": -0.4404
        },
        {
            "id": "htoy1xp",
            "score": 1,
            "text": "Three of them occurred post-2000.\n\nFun fact. I was in high school that year and was in a government class. When we learned about the electoral college, I asked the teacher if this meant that someone could win the popular vote but lose the election. His response: \"Well, technically yes, but that's only happened once so it's not really a concern.\"\n\nWell...",
            "title_similarity": "0.70692986",
            "sentiment_compound": 0.8792
        },
        {
            "id": "htoy2af",
            "score": 1,
            "text": "The is popular vote is the electoral vote. \n\nPopular vote consists of qualified voters or electorates. \n\nMeaning in the us the electoral college is the popular vote. \n\nThe states vote for President, not the people.",
            "title_similarity": "0.6433846",
            "sentiment_compound": 0.8126
        },
        {
            "id": "htoy6qg",
            "score": 1,
            "text": "United stated is a republic, it was designed to not let super states to gain control and share power and prosperity equally.",
            "title_similarity": "0.417318",
            "sentiment_compound": 0.6433
        },
        {
            "id": "htoylu2",
            "score": 1,
            "text": "Also George Bush cheated in 2000 and had his brother call the election for him in Florida even though as it turns out when they finally counted the votes GB lost in Florida.",
            "title_similarity": "0.60931206",
            "sentiment_compound": -0.6808
        },
        {
            "id": "htoyomm",
            "score": 1,
            "text": "So the side that loses wants to change it. What else is new.",
            "title_similarity": "0.22881459",
            "sentiment_compound": -0.3182
        },
        {
            "id": "htozqmi",
            "score": 1,
            "text": "The whole thing is rigged.",
            "title_similarity": "0.09586002",
            "sentiment_compound": -0.3612
        },
        {
            "id": "htp019e",
            "score": 1,
            "text": "Trump taught us one thing: Our government is stupid, outdated, dangerous, and had only ever worked because both sides were willing to play by the rules, while also being capable of feeling shame. \n\nThe (R) dropped the last two items and now we're everlastingly fucked.",
            "title_similarity": "0.53307915",
            "sentiment_compound": -0.8591
        },
        {
            "id": "htp0d5l",
            "score": 1,
            "text": "\nWe need to keep the electoral collage! It gives people in the Midwest, where it’s not so densely populated a fair voice. Otherwise, the entire country would be run by the major cities. If anything, make it go by county, not just by state.",
            "title_similarity": "0.52182686",
            "sentiment_compound": 0.3802
        },
        {
            "id": "htp0wu0",
            "score": 1,
            "text": "Science sub, economics tag....\n\nPolitical history.",
            "title_similarity": "0.4061483",
            "sentiment_compound": 0.0
        },
        {
            "id": "htp1to8",
            "score": 1,
            "text": "It’s a feature not a bug.",
            "title_similarity": "0.07578951",
            "sentiment_compound": 0.0
        },
        {
            "id": "htp3a9v",
            "score": 1,
            "text": "Popular vote = \"May the odds be ever in your favor\"",
            "title_similarity": "0.4198286",
            "sentiment_compound": 0.6705
        },
        {
            "id": "htp3gat",
            "score": 1,
            "text": "People have been calling the electoral college stupid and outdated for 30 years and probably longer, it was created to work in a slave owning America that had the population the size of Utah or Connecticut, it’s long past the time for it to go",
            "title_similarity": "0.5984323",
            "sentiment_compound": -0.34
        },
        {
            "id": "htp3va5",
            "score": 1,
            "text": "What about candidates with fewer counties?",
            "title_similarity": "0.35228997",
            "sentiment_compound": 0.0
        },
        {
            "id": "htp3y6o",
            "score": 1,
            "text": "So we’re still not a democracy, but a democratic republic?",
            "title_similarity": "0.421192",
            "sentiment_compound": 0.0
        },
        {
            "id": "htp4njp",
            "score": 3,
            "text": "We are a collection of independent states, and a representative republic. Popular vote was never intended on being the deciding factor, hence the existence of the electoral college. Our founding fathers warned against the tyranny of the majority.  \n\n\nOur federal government was largely intended just to make sure the states were governing fairly and in accordance with the constitution. Each state, and it's wishes, is to be represented on the federal level. When only a few states have the majority of the population those few states become capable of dictating to other smaller states if we are to rule exclusively by popular vote. Which goes expressly against our entire federal government's purpose.",
            "title_similarity": "0.56528133",
            "sentiment_compound": 0.8402
        },
        {
            "id": "htp5p86",
            "score": 1,
            "text": "Yes and? That's the point... if the election is that close it could mean the outcome is a \"fluke\". In many votes especially when it comes to changing policy sometimes require an overwhelming majority e.g. 3/4 votes.",
            "title_similarity": "0.7177217",
            "sentiment_compound": 0.4019
        },
        {
            "id": "htp6ufm",
            "score": 1,
            "text": "The conclusion seems logical based upon where population centers are and the fact that the presidential election isn’t a national vote, it is a state by state vote that reflects the membership of the bi-cameral congress plus DC electors.  The same way that two golfers in competition could have different outcomes depending upon whether they were playing medal play ((total stroke count (or nation-wide vote)) versus match play (each hole (or state) is its own competition).  Either way works, just have to have the scoring method defined up front as it affects the strategy employed to win.",
            "title_similarity": "0.6190498",
            "sentiment_compound": 0.91
        },
        {
            "id": "htp8tev",
            "score": 1,
            "text": "And they were republicans",
            "title_similarity": "0.29497656",
            "sentiment_compound": 0.0
        },
        {
            "id": "htp9717",
            "score": 1,
            "text": "Sad that the political system isn’t trustworthy enough for changes to this important process.",
            "title_similarity": "0.40161997",
            "sentiment_compound": 0.3612
        },
        {
            "id": "htpb9rn",
            "score": 1,
            "text": "It’s literally designed that way",
            "title_similarity": "0.02621426",
            "sentiment_compound": 0.0
        },
        {
            "id": "htpc1is",
            "score": 1,
            "text": "I remember in October 2000 a columnist assuring us that though theoretically possible, there was virtually no chance of it happening. Classic inside the beltway privileged spin artist telling us out in the nation to be calm, everything’s really fine. And terrorists won’t strike on our shores. And those free trade treaties are gonna make everyone prosperous and healthy!  And trash TV and shock jock radio? Those are the first amendment’s dues, so they will protect our freedoms. You’ll soon see all this. You malcontents just need to relax!",
            "title_similarity": "0.45221853",
            "sentiment_compound": 0.9463
        },
        {
            "id": "htpctlu",
            "score": 1,
            "text": "It should have always been the popular vote.",
            "title_similarity": "0.3792566",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htperv3",
            "score": 1,
            "text": "Alternate point of view: the people trying to be elected know this and campaign around the electoral college. Why would a republican even try to campaign in Cali when they’re not going to win? Instead of doing that and changing votes that aren’t going to make a difference, they campaign in swing states. This then skews the popular vote a bit, but it sort of makes sense. Changing the electoral college would just make it advantageous to campaign everywhere.",
            "title_similarity": "0.6175475",
            "sentiment_compound": 0.4791
        },
        {
            "id": "htpfo7l",
            "score": 1,
            "text": "They're acting the candidate with less popular votes winning is a faliure of the system, but it just isn't.",
            "title_similarity": "0.5132202",
            "sentiment_compound": 0.4256
        },
        {
            "id": "htphj1h",
            "score": 1,
            "text": "The popular vote does not exist for US Presidential elections.",
            "title_similarity": "0.43258184",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htphriy",
            "score": 1,
            "text": "You dudes really need to scrap the Electoral College and implement preferential voting.",
            "title_similarity": "0.34406382",
            "sentiment_compound": 0.0
        },
        {
            "id": "htphtw9",
            "score": 3,
            "text": "The two highest populace states in the union are blue supermajorities. Of course your republic was going to have red leaders with minority votes these past few election cycles. \n\nOn the bright side, both New York and California have had and will continue to have shoe-in Democrat governors for decades, which is presumably why they’re such affordable and crime free bastions of progress and egalitarianism.",
            "title_similarity": "0.6962017",
            "sentiment_compound": 0.6705
        },
        {
            "id": "htpjsd2",
            "score": 1,
            "text": "Everyone knows the US electoral system is flawed for this reason",
            "title_similarity": "0.3904484",
            "sentiment_compound": -0.4767
        },
        {
            "id": "htpkf5x",
            "score": 1,
            "text": "We’re all under the mistaken belief that the true President is the one who receives the most votes. That’s like saying the winner of the football game should be the team with the most touchdowns. If that was the true purpose of the game, the rules would have made that so. \n\nThe electoral college is designed to give a disproportionate voice to smaller states while still providing a majority to the bigger states. Otherwise, elections would be won and lost on subway funding, highway construction, and traffic congestion instead of immigration, trade, and other more rural issues. The winner would only need to win a handful of states to win the White House. The balance now forces the debate to be of broader geographical importance. \n\nIs it right? Who can say. But that’s the way the game is built.",
            "title_similarity": "0.704521",
            "sentiment_compound": 0.9183
        },
        {
            "id": "htpkjs5",
            "score": 1,
            "text": "I guess political science counts but I didn’t expect this in this sub",
            "title_similarity": "0.47022545",
            "sentiment_compound": 0.0
        },
        {
            "id": "htpnesh",
            "score": 1,
            "text": "We need to get rid of the electoral college! Popular vote!",
            "title_similarity": "0.35721028",
            "sentiment_compound": 0.5242
        },
        {
            "id": "htpnkud",
            "score": 2,
            "text": "Electoral college insures smaller populated states get some say in the national elections, even if it just  few points.  If it was just the popular vote, big cities would rule the elections.",
            "title_similarity": "0.66639334",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htpq1bi",
            "score": 1,
            "text": "The USA is not a democracy. It's no secret.",
            "title_similarity": "0.26762372",
            "sentiment_compound": -0.296
        },
        {
            "id": "htpqfmr",
            "score": 1,
            "text": "Really? We already knew this. Guess now its just being made official.",
            "title_similarity": "0.114510626",
            "sentiment_compound": 0.0
        },
        {
            "id": "htprde5",
            "score": 2,
            "text": "Remember when r/science was about science and not the mods' political soap box?",
            "title_similarity": "0.4189845",
            "sentiment_compound": 0.0
        },
        {
            "id": "htps80t",
            "score": 1,
            "text": "It has an extremely high probability when one party tailors its behavior to capture the votes of people in States that have a higher number of electoral votes per citizen.",
            "title_similarity": "0.5923631",
            "sentiment_compound": 0.4588
        },
        {
            "id": "htpttae",
            "score": 1,
            "text": "That's a feature, not a bug.\n\nAlso, why is this in this sub?",
            "title_similarity": "0.1178599",
            "sentiment_compound": 0.0
        },
        {
            "id": "htpu4jt",
            "score": 2,
            "text": "Because the whole point of the electoral college system is to keep the smaller states relevant in the presidential election, instead of allowing a big single party state to overwhelm them.\n\nAnd seriously HRC's popular vote margin for the nation was about half the size of her NYC margin.",
            "title_similarity": "0.71127737",
            "sentiment_compound": 0.4767
        },
        {
            "id": "htpvub7",
            "score": 1,
            "text": "R/science tryna get ban hammered",
            "title_similarity": "0.27309668",
            "sentiment_compound": -0.5574
        },
        {
            "id": "htpwbxd",
            "score": 1,
            "text": "Is Gore V Bush the only time the loser of the electoral and popular vote still won the election?",
            "title_similarity": "0.7182613",
            "sentiment_compound": 0.4767
        },
        {
            "id": "htq1jqr",
            "score": 3,
            "text": "\"According to a new study\" yeah I can release a study and so can the liberal nuthouse cokehead college grad with a title",
            "title_similarity": "0.43777788",
            "sentiment_compound": 0.296
        },
        {
            "id": "htq355z",
            "score": 1,
            "text": "With today’s quicker technology, we should reconsider popular vote vs. electoral college.",
            "title_similarity": "0.48424453",
            "sentiment_compound": 0.4215
        },
        {
            "id": "htqlixc",
            "score": 1,
            "text": "# National Popular Vote Interstate Compact\n\nThe **National Popular Vote Interstate Compact** (**NPVIC**) is an agreement among a group of U.S. states and the District of Columbia to award all their electoral votes to whichever presidential candidate wins the overall popular vote in the 50 states and the District of Columbia. The compact is designed to ensure that the candidate who receives the most votes nationwide is elected president, and it would come into effect only when it would guarantee that outcome. As of January 2022, it has been adopted by fifteen states and the District of Columbia. These states have 195 electoral votes, which is 36% of the Electoral College and 72% of the 270 votes needed to give the compact legal force.\n\nhttps://en.m.wikipedia.org/wiki/National_Popular_Vote_Interstate_Compact",
            "title_similarity": "0.6064619",
            "sentiment_compound": 0.9716
        },
        {
            "id": "htr21ur",
            "score": 1,
            "text": "Yeah weird that r/Science is advocating for election reform. Is maxwell moderating from jail?",
            "title_similarity": "0.5328933",
            "sentiment_compound": 0.128
        },
        {
            "id": "htr7fhi",
            "score": 1,
            "text": "Fun fact, a non incumbent republican hasn't won the popular presidential vote since George Bush senior in 1988.",
            "title_similarity": "0.7340188",
            "sentiment_compound": -0.257
        },
        {
            "id": "htromar",
            "score": 1,
            "text": "TL;DNR == In other words, the electoral college is working pretty much as designed, not allowing 2 or 3 heavily populated states determine the course of the country.",
            "title_similarity": "0.62742925",
            "sentiment_compound": 0.4939
        },
        {
            "id": "htrwl9f",
            "score": 1,
            "text": "I’m not sure what needs to be studied here.\nThe electoral college is a racist system that has absolutely nothing to do with democracy. \n\nIt needs to be abolished immediately. The fact that it hasn’t yet is just a constant reminder that the US is a racist nation.",
            "title_similarity": "0.39419186",
            "sentiment_compound": -0.8739
        },
        {
            "id": "hts1grx",
            "score": 1,
            "text": "The US has become this way by the efforts of politicians who almost literally never have to face the consequences of their actions. They have acted in the interest of their party and donor’s while disregarding their duty to serve the country. There must be consequences for politicians, they must have skin in the game besides their prospects for re-election (job/power security).",
            "title_similarity": "0.5592684",
            "sentiment_compound": 0.8126
        },
        {
            "id": "httbxhm",
            "score": 1,
            "text": "It’s by design. Not sure why people think it’s a flaw. It’s so a few large populous cities or states don't control the entire country. It’s also why the House of Representatives is based on total populous of districts to give the pure majority a voice without dictating how everyone lives. It’s also why no matter how large the state or populous you only get 2 Senators. when schools taught civics we never had such a problem with people understanding how this government and how people are represented in our Constitutional Republic. It’s not a Democracy. A democracy is just pure majority or Mob rule.",
            "title_similarity": "0.6879155",
            "sentiment_compound": -0.577
        },
        {
            "id": "htuzqnd",
            "score": 1,
            "text": "i am a  simple person. I think the candidate who gets the MOST VOTES should win. What could be simpler than that? That the less popular person \"wins\" and the most popular person loses is illogical. I know. Who says contests have to be logical? So the will of the minority controls the will of the majority. Where else does such absurdity prevail?.",
            "title_similarity": "0.5830117",
            "sentiment_compound": 0.9142
        },
        {
            "id": "hu5iffk",
            "score": 1,
            "text": "Yes because idiots in the city definitely know what's best for farmers...",
            "title_similarity": "0.29391372",
            "sentiment_compound": 0.8625
        },
        {
            "id": "i0a4kgm",
            "score": 1,
            "text": "The electoral college is to stop the majority from having tyranny over the minority. Isn't that what you're all about?",
            "title_similarity": "0.42275298",
            "sentiment_compound": -0.296
        },
        {
            "id": "i10451k",
            "score": 1,
            "text": "Yes, that's a real shame. It's probably time to get rid of the electoral college and go with a popular vote.",
            "title_similarity": "0.46925262",
            "sentiment_compound": 0.34
        }
    ]
}